#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x38
struct TestActionStateSerialisableData
{
public:
	int                                                          IntProp;                                           // 0x30(0x4)
};


// Size 0x18
struct TestActionStateMessage
{
public:
	int                                                          TestProperty;                                      // 0x10(0x4)
};


// Size 0x18
struct InnerTestStruct
{
public:
	bool                                                         BoolProp;                                          // 0x0(0x1)
	struct FString                                               StringProp;                                        // 0x8(0x10)
};


// Size 0x140
struct SerialisedConstructionInfoStore
{
public:
	struct SerialisedActionStateInfo                             SerialisedConstructionInfo;                        // 0x0(0x40)
};


// Size 0x8
struct InnerWithObjTestStruct
{
public:
	class Object*                                                ObjPointer;                                        // 0x0(0x8)
};


// Size 0x38
struct TestActorActionStateConstructionInfo
{
public:
	int                                                          IntProp;                                           // 0x30(0x4)
};


// Size 0x30
struct TestActionStateConstructionInfo
{
public:
	int                                                          IntProp;                                           // 0x28(0x4)
};


// Size 0x28
struct ActionStateConstructionInfo
{
public:
	class UClass*                                                Id;                                                // 0x0(0x8)
	class ScriptStruct*                                          Type;                                              // 0x8(0x8)
};


// Size 0x1
struct ActionStateChangeRequestId
{
public:
	char                                                         Raw;                                               // 0x0(0x1)
};


// Size 0x10
struct ActionStatePriorityRelationship
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	char                                                         Priority;                                          // 0x8(0x1)
};


// Size 0x10
struct ActionStateMessage
{
public:
	class ScriptStruct*                                          Type;                                              // 0x8(0x8)
};


// Size 0x30
struct ActionStateSerialisableData
{
public:
	class UClass*                                                Id;                                                // 0x8(0x8)
	class ScriptStruct*                                          Type;                                              // 0x10(0x8)
};


// Size 0x30
struct ActorActionStateConstructionInfo
{
public:
	class Actor*                                                 ActorOwner;                                        // 0x28(0x8)
};


// Size 0x18
struct ActionStatePriorityList
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	TArray<struct ActionStatePriorityRelationship>               Entries;                                           // 0x8(0x10)
};


// Size 0x48
struct TestActionStateConstructionInfoWithInner
{
public:
	float                                                        FloatProp;                                         // 0x28(0x4)
	struct InnerTestStruct                                       InnerStruct;                                       // 0x30(0x18)
};


// Size 0x48
struct TestActionStateConstructionInfoWithObjPointers
{
public:
	class Object*                                                ObjPointer;                                        // 0x28(0x8)
	struct InnerWithObjTestStruct                                Inner;                                             // 0x30(0x8)
	TArray<class Object*>                                        Array;                                             // 0x38(0x10)
};


// Size 0x150
struct ResetStateMachineRpc
{
public:
	struct ActionStateChangeRequestId                            LatestEpochIds;                                    // 0x0(0x1)
	struct ActionStateChangeRequestId                            LatestRequestIds;                                  // 0x5(0x1)
	struct SerialisedConstructionInfoStore                       PerTrackConstructionInfoStore;                     // 0x10(0x140)
};


