#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x1
struct EventWaitingToSpawnActionStateEndedClient
{
public:
	char                                                         pad0x1_HK0MP[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct TestActionStateSerialisableData
{
public:
	char                                                         pad0x30_5OTDH[0x30];                               // 0x0(0x30)
	int                                                          IntProp;                                           // 0x30(0x4)
	char                                                         pad0x4_HJZS3[0x4];                                 // 0x34(0x4)
};


// Size 0x48
struct TestActionStateConstructionInfo
{
public:
	char                                                         pad0x40_3FT0L[0x40];                               // 0x0(0x40)
	int                                                          IntProp;                                           // 0x40(0x4)
	char                                                         pad0x4_G2VW8[0x4];                                 // 0x44(0x4)
};


// Size 0x40
struct SerialisedActionStateInfo
{
public:
	char                                                         pad0x40_UOW9T[0x40];                               // 0x0(0x40)
};


// Size 0x18
struct SerialisedActionStateMessage
{
public:
	char                                                         pad0x18_MURUK[0x18];                               // 0x0(0x18)
};


// Size 0x1
struct EventWaitingToSpawnActionStateStartedClient
{
public:
	char                                                         pad0x1_WYGIW[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct NullActionStateConstructionInfo
{
public:
	char                                                         pad0x48_CU2WF[0x48];                               // 0x0(0x48)
};


// Size 0x18
struct TestActionStateMessage
{
public:
	char                                                         pad0x10_E3EUU[0x10];                               // 0x0(0x10)
	int                                                          TestProperty;                                      // 0x10(0x4)
	char                                                         pad0x4_88ZON[0x4];                                 // 0x14(0x4)
};


// Size 0x1c
struct ActionStateChangeTelemetryEvent_ConstructionInfoData
{
public:
	struct FName                                                 Id;                                                // 0x0(0x8)
	struct FName                                                 Type;                                              // 0x8(0x8)
	struct FName                                                 PreviousStateToTransitionBackToId;                 // 0x10(0x8)
	bool                                                         ShouldTransitionBackToPreviousState;               // 0x18(0x1)
	bool                                                         IsTransitionState;                                 // 0x19(0x1)
	char                                                         pad0x2_BS7JI[0x2];                                 // 0x1a(0x2)
};


// Size 0x10
struct ActionStateMessage
{
public:
	char                                                         pad0x8_80X8Q[0x8];                                 // 0x0(0x8)
	class ScriptStruct*                                          Type;                                              // 0x8(0x8)
};


// Size 0x1
struct ActionStateChangeRequestId
{
public:
	char                                                         Raw;                                               // 0x0(0x1)
};


// Size 0x30
struct ActionStateSerialisableData
{
public:
	char                                                         pad0x8_BPRB0[0x8];                                 // 0x0(0x8)
	class UClass*                                                Id;                                                // 0x8(0x8)
	class ScriptStruct*                                          Type;                                              // 0x10(0x8)
	char                                                         pad0x18_EDHSR[0x18];                               // 0x18(0x18)
};


// Size 0x18
struct InnerTestStruct
{
public:
	bool                                                         BoolProp;                                          // 0x0(0x1)
	char                                                         pad0x7_1QTEO[0x7];                                 // 0x1(0x7)
	struct FString                                               StringProp;                                        // 0x8(0x10)
};


// Size 0xa0
struct ActionStatePriorityTable
{
public:
	char                                                         pad0xa0_J92GT[0xa0];                               // 0x0(0xa0)
};


// Size 0x1
struct EventFirstPersonAnimaticActionStateEndedClient
{
public:
	char                                                         pad0x1_74F04[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct InnerWithObjTestStruct
{
public:
	class Object*                                                ObjPointer;                                        // 0x0(0x8)
};


// Size 0x48
struct ActorActionStateConstructionInfo
{
public:
	char                                                         pad0x48_3A4QS[0x48];                               // 0x0(0x48)
};


// Size 0x10
struct TestActionStateMessage2
{
public:
	char                                                         pad0x10_P4CEO[0x10];                               // 0x0(0x10)
};


// Size 0x50
struct TestActorActionStateConstructionInfo
{
public:
	char                                                         pad0x48_6LIUC[0x48];                               // 0x0(0x48)
	int                                                          IntProp;                                           // 0x48(0x4)
	char                                                         pad0x4_YYZ3K[0x4];                                 // 0x4c(0x4)
};


// Size 0x10
struct ActionStatePriorityRelationship
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	char                                                         Priority;                                          // 0x8(0x1)
	char                                                         pad0x7_T7BUM[0x7];                                 // 0x9(0x7)
};


// Size 0x28
struct PendingStateTransitionsTelemetryEvent
{
public:
	int                                                          NumPendingTransitions;                             // 0x0(0x4)
	int                                                          MaxPendingTransitions;                             // 0x4(0x4)
	TArray<String>                                               PendingTransitions;                                // 0x8(0x10)
	struct FString                                               RequestedTransition;                               // 0x18(0x10)
};


// Size 0x40
struct ActionStateConstructionInfo
{
public:
	char                                                         pad0x8_0011T[0x8];                                 // 0x0(0x8)
	class UClass*                                                Id;                                                // 0x8(0x8)
	class UClass*                                                PreviousStateToTransitionBackToId;                 // 0x10(0x8)
	bool                                                         ShouldTransitionBackToPreviousState;               // 0x18(0x1)
	bool                                                         IsTransitionState;                                 // 0x19(0x1)
	bool                                                         OverridePreviousStateTransition;                   // 0x1a(0x1)
	char                                                         pad0x5_SYT51[0x5];                                 // 0x1b(0x5)
	class ScriptStruct*                                          Type;                                              // 0x20(0x8)
	char                                                         pad0x18_YFVHQ[0x18];                               // 0x28(0x18)
};


// Size 0x60
struct TestActionStateConstructionInfoWithObjPointers
{
public:
	char                                                         pad0x40_6RO45[0x40];                               // 0x0(0x40)
	class Object*                                                ObjPointer;                                        // 0x40(0x8)
	struct InnerWithObjTestStruct                                Inner;                                             // 0x48(0x8)
	TArray<class Object*>                                        Array;                                             // 0x50(0x10)
};


// Size 0x30
struct ActionStateChangeTelemetryEvent_SerialisedActionStateInfoData
{
public:
	struct ActionStateChangeTelemetryEvent_ConstructionInfoData  ConstructionInfo;                                  // 0x0(0x1c)
	struct FName                                                 ActionStateIdType;                                 // 0x1c(0x8)
	struct FName                                                 ContentsType;                                      // 0x24(0x8)
	int                                                          TrackId;                                           // 0x2c(0x4)
};


// Size 0x140
struct SerialisedConstructionInfoStore
{
public:
	struct SerialisedActionStateInfo                             SerialisedConstructionInfo;                        // 0x0(0x40)
	char                                                         pad0x100_D0ORZ[0x100];                             // 0x40(0x100)
};


// Size 0x60
struct TestActionStateConstructionInfoWithInner
{
public:
	char                                                         pad0x40_D54WO[0x40];                               // 0x0(0x40)
	float                                                        FloatProp;                                         // 0x40(0x4)
	char                                                         pad0x4_25WX3[0x4];                                 // 0x44(0x4)
	struct InnerTestStruct                                       InnerStruct;                                       // 0x48(0x18)
};


// Size 0x18
struct ActionStatePriorityList
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	TArray<struct ActionStatePriorityRelationship>               Entries;                                           // 0x8(0x10)
};


// Size 0x78
struct ActionStateChangeTelemetryEvent
{
public:
	struct ActionStateChangeTelemetryEvent_SerialisedActionStateInfoData NewClientState;                                    // 0x0(0x30)
	struct ActionStateChangeTelemetryEvent_SerialisedActionStateInfoData NewServerState;                                    // 0x30(0x30)
	struct FString                                               CurrentTrackStateId;                               // 0x60(0x10)
	float                                                        TimeInCurrentState;                                // 0x70(0x4)
	bool                                                         IsTrackCurrentlyChangingState;                     // 0x74(0x1)
	bool                                                         RequestedByClient;                                 // 0x75(0x1)
	bool                                                         Predicted;                                         // 0x76(0x1)
	char                                                         TransitionResult;                                  // 0x77(0x1)
};


// Size 0x150
struct ResetStateMachineRpc
{
public:
	struct ActionStateChangeRequestId                            LatestEpochIds;                                    // 0x0(0x1)
	char                                                         pad0x4_KOB6K[0x4];                                 // 0x1(0x4)
	struct ActionStateChangeRequestId                            LatestRequestIds;                                  // 0x5(0x1)
	char                                                         pad0xa_ZGF5Y[0xa];                                 // 0x6(0xa)
	struct SerialisedConstructionInfoStore                       PerTrackConstructionInfoStore;                     // 0x10(0x140)
};


