#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x40
struct ActionStateConstructionInfo
{
public:
	char                                                         pad0x8_6ARWD[0x8];                                 // 0x0(0x8)
	class UClass*                                                Id;                                                // 0x8(0x8)
	class UClass*                                                PreviousStateToTransitionBackToId;                 // 0x10(0x8)
	bool                                                         ShouldTransitionBackToPreviousState;               // 0x18(0x1)
	bool                                                         IsTransitionState;                                 // 0x19(0x1)
	bool                                                         OverridePreviousStateTransition;                   // 0x1a(0x1)
	char                                                         pad0x5_XEN4P[0x5];                                 // 0x1b(0x5)
	class ScriptStruct*                                          Type;                                              // 0x20(0x8)
	char                                                         pad0x18_088OS[0x18];                               // 0x28(0x18)
};


// Size 0x18
struct TestActionStateMessage
{
public:
	char                                                         pad0x10_1G5T8[0x10];                               // 0x0(0x10)
	int                                                          TestProperty;                                      // 0x10(0x4)
	char                                                         pad0x4_G0Y4W[0x4];                                 // 0x14(0x4)
};


// Size 0x38
struct TestActionStateSerialisableData
{
public:
	char                                                         pad0x30_2BYQM[0x30];                               // 0x0(0x30)
	int                                                          IntProp;                                           // 0x30(0x4)
	char                                                         pad0x4_1RX08[0x4];                                 // 0x34(0x4)
};


// Size 0x40
struct ActionStateChangeRejectedTelemetryEvent
{
public:
	struct FString                                               FailureReason;                                     // 0x0(0x10)
	struct FString                                               TrackName;                                         // 0x10(0x10)
	struct FName                                                 PreviousState;                                     // 0x20(0x8)
	struct FName                                                 NewStateServer;                                    // 0x28(0x8)
	struct FName                                                 NewStateClient;                                    // 0x30(0x8)
	float                                                        TimeInPreviousState;                               // 0x38(0x4)
	bool                                                         RequestedByClient;                                 // 0x3c(0x1)
	bool                                                         WasPredicted;                                      // 0x3d(0x1)
	char                                                         pad0x2_0J0FZ[0x2];                                 // 0x3e(0x2)
};


// Size 0x1
struct EventFirstPersonAnimaticActionStateEndedClient
{
public:
	char                                                         pad0x1_U90NV[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct ActionStateConditionalChangeBlockedTelemetryEvent
{
public:
	struct FString                                               TrackName;                                         // 0x0(0x10)
	struct FName                                                 ExpectedCurrentStateName;                          // 0x10(0x8)
	struct FName                                                 ActualCurrentStateName;                            // 0x18(0x8)
	struct FName                                                 RequestedNewStateName;                             // 0x20(0x8)
};


// Size 0x1
struct EventWaitingToSpawnActionStateEndedClient
{
public:
	char                                                         pad0x1_F84EZ[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct SerialisedActionStateMessage
{
public:
	char                                                         pad0x18_H8MW4[0x18];                               // 0x0(0x18)
};


// Size 0x28
struct ActionStatePredictedChangeBlockedTelemetryEvent
{
public:
	struct FString                                               TrackName;                                         // 0x0(0x10)
	struct FName                                                 PreviousState;                                     // 0x10(0x8)
	struct FName                                                 NewStateServer;                                    // 0x18(0x8)
	float                                                        TimeInPreviousState;                               // 0x20(0x4)
	bool                                                         WasPredicted;                                      // 0x24(0x1)
	char                                                         pad0x3_PY1HN[0x3];                                 // 0x25(0x3)
};


// Size 0xa0
struct ActionStatePriorityTable
{
public:
	char                                                         pad0xa0_2NCBP[0xa0];                               // 0x0(0xa0)
};


// Size 0x50
struct TestActorActionStateConstructionInfo
{
public:
	char                                                         pad0x48_45P2L[0x48];                               // 0x0(0x48)
	int                                                          IntProp;                                           // 0x48(0x4)
	char                                                         pad0x4_RAUTC[0x4];                                 // 0x4c(0x4)
};


// Size 0x30
struct ActionStateSerialisableData
{
public:
	char                                                         pad0x8_37FLJ[0x8];                                 // 0x0(0x8)
	class UClass*                                                Id;                                                // 0x8(0x8)
	class ScriptStruct*                                          Type;                                              // 0x10(0x8)
	char                                                         pad0x18_YAZZF[0x18];                               // 0x18(0x18)
};


// Size 0x28
struct PendingStateTransitionsTelemetryEvent
{
public:
	int                                                          NumPendingTransitions;                             // 0x0(0x4)
	int                                                          MaxPendingTransitions;                             // 0x4(0x4)
	TArray<String>                                               PendingTransitions;                                // 0x8(0x10)
	struct FString                                               RequestedTransition;                               // 0x18(0x10)
};


// Size 0x48
struct TestActionStateConstructionInfo
{
public:
	char                                                         pad0x40_CAD54[0x40];                               // 0x0(0x40)
	int                                                          IntProp;                                           // 0x40(0x4)
	char                                                         pad0x4_H96SA[0x4];                                 // 0x44(0x4)
};


// Size 0x8
struct InnerWithObjTestStruct
{
public:
	class Object*                                                ObjPointer;                                        // 0x0(0x8)
};


// Size 0x10
struct TestActionStateMessage2
{
public:
	char                                                         pad0x10_840KW[0x10];                               // 0x0(0x10)
};


// Size 0x10
struct ActionStateMessage
{
public:
	char                                                         pad0x8_BPS6T[0x8];                                 // 0x0(0x8)
	class ScriptStruct*                                          Type;                                              // 0x8(0x8)
};


// Size 0x30
struct ActionStateChangeAcceptedTelemetryEvent
{
public:
	struct FString                                               TrackName;                                         // 0x0(0x10)
	struct FName                                                 PreviousState;                                     // 0x10(0x8)
	struct FName                                                 NewStateServer;                                    // 0x18(0x8)
	struct FName                                                 NewStateClient;                                    // 0x20(0x8)
	float                                                        TimeInPreviousState;                               // 0x28(0x4)
	bool                                                         RequestedByClient;                                 // 0x2c(0x1)
	bool                                                         WasPredicted;                                      // 0x2d(0x1)
	char                                                         pad0x2_EWBSJ[0x2];                                 // 0x2e(0x2)
};


// Size 0x10
struct ActionStatePriorityRelationship
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	char                                                         Priority;                                          // 0x8(0x1)
	char                                                         pad0x7_CLK8Y[0x7];                                 // 0x9(0x7)
};


// Size 0x18
struct InnerTestStruct
{
public:
	bool                                                         BoolProp;                                          // 0x0(0x1)
	char                                                         pad0x7_G6UJ6[0x7];                                 // 0x1(0x7)
	struct FString                                               StringProp;                                        // 0x8(0x10)
};


// Size 0x48
struct NullActionStateConstructionInfo
{
public:
	char                                                         pad0x48_E3F9I[0x48];                               // 0x0(0x48)
};


// Size 0x48
struct ActorActionStateConstructionInfo
{
public:
	char                                                         pad0x48_N2DNL[0x48];                               // 0x0(0x48)
};


// Size 0x1
struct EventWaitingToSpawnActionStateStartedClient
{
public:
	char                                                         pad0x1_1A6RB[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ActionStateChangeRequestId
{
public:
	char                                                         Raw;                                               // 0x0(0x1)
};


// Size 0x40
struct SerialisedActionStateInfo
{
public:
	char                                                         pad0x40_D470A[0x40];                               // 0x0(0x40)
};


// Size 0x140
struct SerialisedConstructionInfoStore
{
public:
	struct SerialisedActionStateInfo                             SerialisedConstructionInfo;                        // 0x0(0x40)
	char                                                         pad0x100_KUYY9[0x100];                             // 0x40(0x100)
};


// Size 0x18
struct ActionStatePriorityList
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	TArray<struct ActionStatePriorityRelationship>               Entries;                                           // 0x8(0x10)
};


// Size 0x60
struct TestActionStateConstructionInfoWithObjPointers
{
public:
	char                                                         pad0x40_5B64V[0x40];                               // 0x0(0x40)
	class Object*                                                ObjPointer;                                        // 0x40(0x8)
	struct InnerWithObjTestStruct                                Inner;                                             // 0x48(0x8)
	TArray<class Object*>                                        Array;                                             // 0x50(0x10)
};


// Size 0x60
struct TestActionStateConstructionInfoWithInner
{
public:
	char                                                         pad0x40_UJD0F[0x40];                               // 0x0(0x40)
	float                                                        FloatProp;                                         // 0x40(0x4)
	char                                                         pad0x4_C29RU[0x4];                                 // 0x44(0x4)
	struct InnerTestStruct                                       InnerStruct;                                       // 0x48(0x18)
};


// Size 0x150
struct ResetStateMachineRpc
{
public:
	struct ActionStateChangeRequestId                            LatestEpochIds;                                    // 0x0(0x1)
	char                                                         pad0x4_OE233[0x4];                                 // 0x1(0x4)
	struct ActionStateChangeRequestId                            LatestRequestIds;                                  // 0x5(0x1)
	char                                                         pad0xa_SKFDZ[0xa];                                 // 0x6(0xa)
	struct SerialisedConstructionInfoStore                       PerTrackConstructionInfoStore;                     // 0x10(0x140)
};


