// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x30
struct ActorActionStateConstructionInfo
{
public:
	char                                                         pad0x30_H2S9N[0x30];                               // 0x0(0x30)
};


// Size 0x28
struct ActionStateConstructionInfo
{
public:
	class UClass*                                                Id;                                                // 0x0(0x8)
	class ScriptStruct*                                          Type;                                              // 0x8(0x8)
	char                                                         pad0x18_HKI7U[0x18];                               // 0x10(0x18)
};


// Size 0x30
struct ActionStateSerialisableData
{
public:
	char                                                         pad0x8_7OKLY[0x8];                                 // 0x0(0x8)
	class UClass*                                                Id;                                                // 0x8(0x8)
	class ScriptStruct*                                          Type;                                              // 0x10(0x8)
	char                                                         pad0x18_XSPNK[0x18];                               // 0x18(0x18)
};


// Size 0x10
struct ActionStateMessage
{
public:
	char                                                         pad0x8_K7896[0x8];                                 // 0x0(0x8)
	class ScriptStruct*                                          Type;                                              // 0x8(0x8)
};


// Size 0x1
struct ActionStateChangeRequestId
{
public:
	byte                                                         Raw;                                               // 0x0(0x1)
};


// Size 0x40
struct SerialisedActionStateInfo
{
public:
	char                                                         pad0x40_CU9FR[0x40];                               // 0x0(0x40)
};


// Size 0x18
struct SerialisedActionStateMessage
{
public:
	char                                                         pad0x18_Q0NRA[0x18];                               // 0x0(0x18)
};


// Size 0x140
struct SerialisedConstructionInfoStore
{
public:
	struct SerialisedActionStateInfo                             SerialisedConstructionInfo;                        // 0x0(0x40)
	char                                                         pad0x100_B075Q[0x100];                             // 0x40(0x100)
};


// Size 0x150
struct ResetStateMachineRpc
{
public:
	struct ActionStateChangeRequestId                            LatestEpochIds;                                    // 0x0(0x1)
	char                                                         pad0x4_OCCF1[0x4];                                 // 0x1(0x4)
	struct ActionStateChangeRequestId                            LatestRequestIds;                                  // 0x5(0x1)
	char                                                         pad0xa_DGYRQ[0xa];                                 // 0x6(0xa)
	struct SerialisedConstructionInfoStore                       PerTrackConstructionInfoStore;                     // 0x10(0x140)
};


// Size 0x38
struct TestActionStateSerialisableData
{
public:
	char                                                         pad0x30_EGJ74[0x30];                               // 0x0(0x30)
	int                                                          IntProp;                                           // 0x30(0x4)
	char                                                         pad0x4_XJAVL[0x4];                                 // 0x34(0x4)
};


// Size 0x18
struct ActionStatePriorityList
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	TArray<struct ActionStatePriorityRelationship>               Entries;                                           // 0x8(0x10)
};


// Size 0x10
struct ActionStatePriorityRelationship
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	byte                                                         Priority;                                          // 0x8(0x1)
	char                                                         pad0x7_LHHSH[0x7];                                 // 0x9(0x7)
};


// Size 0xa0
struct ActionStatePriorityTable
{
public:
	char                                                         pad0xa0_018RO[0xa0];                               // 0x0(0xa0)
};


// Size 0x48
struct TestActionStateConstructionInfoWithObjPointers
{
public:
	char                                                         pad0x28_5SABB[0x28];                               // 0x0(0x28)
	class Object*                                                ObjPointer;                                        // 0x28(0x8)
	struct InnerWithObjTestStruct                                Inner;                                             // 0x30(0x8)
	TArray<class Object*>                                        Array;                                             // 0x38(0x10)
};


// Size 0x8
struct InnerWithObjTestStruct
{
public:
	class Object*                                                ObjPointer;                                        // 0x0(0x8)
};


// Size 0x48
struct TestActionStateConstructionInfoWithInner
{
public:
	char                                                         pad0x28_FZVQ0[0x28];                               // 0x0(0x28)
	float                                                        FloatProp;                                         // 0x28(0x4)
	char                                                         pad0x4_OWK7J[0x4];                                 // 0x2c(0x4)
	struct InnerTestStruct                                       InnerStruct;                                       // 0x30(0x18)
};


// Size 0x18
struct InnerTestStruct
{
public:
	bool                                                         BoolProp;                                          // 0x0(0x1)
	char                                                         pad0x7_H4KEK[0x7];                                 // 0x1(0x7)
	struct FString                                               StringProp;                                        // 0x8(0x10)
};


// Size 0x30
struct TestActionStateConstructionInfo
{
public:
	char                                                         pad0x28_336FK[0x28];                               // 0x0(0x28)
	int                                                          IntProp;                                           // 0x28(0x4)
	char                                                         pad0x4_H2C4C[0x4];                                 // 0x2c(0x4)
};


// Size 0x1
struct EventWaitingToSpawnActionStateEndedClient
{
public:
	char                                                         pad0x1_4XMRS[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventWaitingToSpawnActionStateStartedClient
{
public:
	char                                                         pad0x1_R0T6K[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventFirstPersonAnimaticActionStateEndedClient
{
public:
	char                                                         pad0x1_LSSFE[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct NullActionStateConstructionInfo
{
public:
	char                                                         pad0x30_7FBQN[0x30];                               // 0x0(0x30)
};


// Size 0x10
struct TestActionStateMessage2
{
public:
	char                                                         pad0x10_9ZN07[0x10];                               // 0x0(0x10)
};


// Size 0x18
struct TestActionStateMessage
{
public:
	char                                                         pad0x10_LQUZ1[0x10];                               // 0x0(0x10)
	int                                                          TestProperty;                                      // 0x10(0x4)
	char                                                         pad0x4_7SKEA[0x4];                                 // 0x14(0x4)
};


// Size 0x38
struct TestActorActionStateConstructionInfo
{
public:
	char                                                         pad0x30_OQ5L2[0x30];                               // 0x0(0x30)
	int                                                          IntProp;                                           // 0x30(0x4)
	char                                                         pad0x4_DAQZV[0x4];                                 // 0x34(0x4)
};


}