#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x10
struct TestActionStateMessage2
{
public:
	char                                                         pad0x10_8UWLK[0x10];                               // 0x0(0x10)
};


// Size 0x40
struct ActionStateConstructionInfo
{
public:
	char                                                         pad0x8_IHABY[0x8];                                 // 0x0(0x8)
	class UClass*                                                Id;                                                // 0x8(0x8)
	class UClass*                                                PreviousStateToTransitionBackToId;                 // 0x10(0x8)
	bool                                                         ShouldTransitionBackToPreviousState;               // 0x18(0x1)
	bool                                                         IsTransitionState;                                 // 0x19(0x1)
	bool                                                         OverridePreviousStateTransition;                   // 0x1a(0x1)
	char                                                         pad0x5_U7UJU[0x5];                                 // 0x1b(0x5)
	class ScriptStruct*                                          Type;                                              // 0x20(0x8)
	char                                                         pad0x18_VA2LD[0x18];                               // 0x28(0x18)
};


// Size 0x50
struct TestActorActionStateConstructionInfo
{
public:
	char                                                         pad0x48_9YUK2[0x48];                               // 0x0(0x48)
	int                                                          IntProp;                                           // 0x48(0x4)
	char                                                         pad0x4_TLWBV[0x4];                                 // 0x4c(0x4)
};


// Size 0x18
struct SerialisedActionStateMessage
{
public:
	char                                                         pad0x18_VKY9S[0x18];                               // 0x0(0x18)
};


// Size 0x1
struct ActionStateChangeRequestId
{
public:
	char                                                         Raw;                                               // 0x0(0x1)
};


// Size 0x8
struct InnerWithObjTestStruct
{
public:
	class Object*                                                ObjPointer;                                        // 0x0(0x8)
};


// Size 0x18
struct InnerTestStruct
{
public:
	bool                                                         BoolProp;                                          // 0x0(0x1)
	char                                                         pad0x7_XS2RO[0x7];                                 // 0x1(0x7)
	struct FString                                               StringProp;                                        // 0x8(0x10)
};


// Size 0x48
struct TestActionStateConstructionInfo
{
public:
	char                                                         pad0x40_YMRTD[0x40];                               // 0x0(0x40)
	int                                                          IntProp;                                           // 0x40(0x4)
	char                                                         pad0x4_YZF98[0x4];                                 // 0x44(0x4)
};


// Size 0x1
struct EventWaitingToSpawnActionStateEndedClient
{
public:
	char                                                         pad0x1_QXTKQ[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct PendingStateTransitionsTelemetryEvent
{
public:
	int                                                          NumPendingTransitions;                             // 0x0(0x4)
	int                                                          MaxPendingTransitions;                             // 0x4(0x4)
	TArray<String>                                               PendingTransitions;                                // 0x8(0x10)
	struct FString                                               RequestedTransition;                               // 0x18(0x10)
};


// Size 0x10
struct ActionStateMessage
{
public:
	char                                                         pad0x8_UK294[0x8];                                 // 0x0(0x8)
	class ScriptStruct*                                          Type;                                              // 0x8(0x8)
};


// Size 0x1
struct EventFirstPersonAnimaticActionStateEndedClient
{
public:
	char                                                         pad0x1_MLII2[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct ActionStateChangeAcceptedTelemetryEvent
{
public:
	struct FString                                               TrackName;                                         // 0x0(0x10)
	struct FString                                               PreviousState;                                     // 0x10(0x10)
	struct FString                                               NewStateServer;                                    // 0x20(0x10)
	struct FString                                               NewStateClient;                                    // 0x30(0x10)
	float                                                        TimeInPreviousState;                               // 0x40(0x4)
	bool                                                         RequestedByClient;                                 // 0x44(0x1)
	bool                                                         WasPredicted;                                      // 0x45(0x1)
	char                                                         pad0x2_YG7ST[0x2];                                 // 0x46(0x2)
};


// Size 0xa0
struct ActionStatePriorityTable
{
public:
	char                                                         pad0xa0_41MX4[0xa0];                               // 0x0(0xa0)
};


// Size 0x48
struct ActorActionStateConstructionInfo
{
public:
	char                                                         pad0x48_7FCFH[0x48];                               // 0x0(0x48)
};


// Size 0x58
struct ActionStateChangeRejectedTelemetryEvent
{
public:
	struct FString                                               FailureReason;                                     // 0x0(0x10)
	struct FString                                               TrackName;                                         // 0x10(0x10)
	struct FString                                               PreviousState;                                     // 0x20(0x10)
	struct FString                                               NewStateServer;                                    // 0x30(0x10)
	struct FString                                               NewStateClient;                                    // 0x40(0x10)
	float                                                        TimeInPreviousState;                               // 0x50(0x4)
	bool                                                         RequestedByClient;                                 // 0x54(0x1)
	bool                                                         WasPredicted;                                      // 0x55(0x1)
	char                                                         pad0x2_B4D5F[0x2];                                 // 0x56(0x2)
};


// Size 0x38
struct TestActionStateSerialisableData
{
public:
	char                                                         pad0x30_AJZ5L[0x30];                               // 0x0(0x30)
	int                                                          IntProp;                                           // 0x30(0x4)
	char                                                         pad0x4_HEJCK[0x4];                                 // 0x34(0x4)
};


// Size 0x30
struct ActionStateSerialisableData
{
public:
	char                                                         pad0x8_I3ZXB[0x8];                                 // 0x0(0x8)
	class UClass*                                                Id;                                                // 0x8(0x8)
	class ScriptStruct*                                          Type;                                              // 0x10(0x8)
	char                                                         pad0x18_MKFWK[0x18];                               // 0x18(0x18)
};


// Size 0x40
struct SerialisedActionStateInfo
{
public:
	char                                                         pad0x40_O7GP6[0x40];                               // 0x0(0x40)
};


// Size 0x1
struct EventWaitingToSpawnActionStateStartedClient
{
public:
	char                                                         pad0x1_OLYCW[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct NullActionStateConstructionInfo
{
public:
	char                                                         pad0x48_G9KL9[0x48];                               // 0x0(0x48)
};


// Size 0x18
struct TestActionStateMessage
{
public:
	char                                                         pad0x10_UJU2F[0x10];                               // 0x0(0x10)
	int                                                          TestProperty;                                      // 0x10(0x4)
	char                                                         pad0x4_CVWWV[0x4];                                 // 0x14(0x4)
};


// Size 0x10
struct ActionStatePriorityRelationship
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	char                                                         Priority;                                          // 0x8(0x1)
	char                                                         pad0x7_1791N[0x7];                                 // 0x9(0x7)
};


// Size 0x18
struct ActionStatePriorityList
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	TArray<struct ActionStatePriorityRelationship>               Entries;                                           // 0x8(0x10)
};


// Size 0x60
struct TestActionStateConstructionInfoWithObjPointers
{
public:
	char                                                         pad0x40_HFQYG[0x40];                               // 0x0(0x40)
	class Object*                                                ObjPointer;                                        // 0x40(0x8)
	struct InnerWithObjTestStruct                                Inner;                                             // 0x48(0x8)
	TArray<class Object*>                                        Array;                                             // 0x50(0x10)
};


// Size 0x140
struct SerialisedConstructionInfoStore
{
public:
	struct SerialisedActionStateInfo                             SerialisedConstructionInfo;                        // 0x0(0x40)
	char                                                         pad0x100_KZFKJ[0x100];                             // 0x40(0x100)
};


// Size 0x60
struct TestActionStateConstructionInfoWithInner
{
public:
	char                                                         pad0x40_9X30W[0x40];                               // 0x0(0x40)
	float                                                        FloatProp;                                         // 0x40(0x4)
	char                                                         pad0x4_U803G[0x4];                                 // 0x44(0x4)
	struct InnerTestStruct                                       InnerStruct;                                       // 0x48(0x18)
};


// Size 0x150
struct ResetStateMachineRpc
{
public:
	struct ActionStateChangeRequestId                            LatestEpochIds;                                    // 0x0(0x1)
	char                                                         pad0x4_OQZ6E[0x4];                                 // 0x1(0x4)
	struct ActionStateChangeRequestId                            LatestRequestIds;                                  // 0x5(0x1)
	char                                                         pad0xa_IZM3L[0xa];                                 // 0x6(0xa)
	struct SerialisedConstructionInfoStore                       PerTrackConstructionInfoStore;                     // 0x10(0x140)
};


