#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "ActionStateMachine_Structs.h"


// Size 0x20 (Full Size[0x600] - InheritedSize[0x5e0]
class CharacterWithActionStateMachine: public Character
{
public:
	class ActionStateMachineComponent*                           ActionStateMachineComponent;                       // 0x5e0(0x8)
	class ActionStatePriorityTableData*                          ActionStatePriorityTableData;                      // 0x5e8(0x8)
	class UClass*                                                ActionStateCreatorDefinition;                      // 0x5f0(0x8)
	class UClass*                                                ActionStateInitialStateCreatorDefinition;          // 0x5f8(0x8)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class ActionStatePriorityTableData: public DataAsset
{
public:
	TArray<struct ActionStatePriorityRelationship>               StateDefaultValue;                                 // 0x28(0x10)
	TArray<struct ActionStatePriorityList>                       PriorityTableEntry;                                // 0x38(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class CustomClientValidityCheckCallback: public Object
{
public:
	bool                                                         ShouldPassClientValidation;                        // 0x28(0x1)
};


// Size 0x7a0 (Full Size[0x868] - InheritedSize[0xc8]
class ActionStateMachineComponent: public ActorComponent
{
public:
	multicastinlinedelegate                                      OnActionChangedOnTrack;                            // 0xe0(0x10)
};


// Size 0x48 (Full Size[0x8b0] - InheritedSize[0x868]
class SelfInitialisingActionStateMachineComponent: public ActionStateMachineComponent
{
public:
	class ActionStatePriorityTableData*                          ActionStatePriorityTableData;                      // 0x870(0x8)
	class UClass*                                                ActionStateCreatorDefinition;                      // 0x878(0x8)
	class UClass*                                                ActionStateInitialStateCreatorDefinition;          // 0x880(0x8)
};


