// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x30
struct ActorActionStateConstructionInfo
{
public:
	char                                                         pad0x30_XQOZO[0x30];                               // 0x0(0x30)
};


// Size 0x28
struct ActionStateConstructionInfo
{
public:
	class UClass*                                                Id;                                                // 0x0(0x8)
	class ScriptStruct*                                          Type;                                              // 0x8(0x8)
	char                                                         pad0x18_WZZJ8[0x18];                               // 0x10(0x18)
};


// Size 0x30
struct ActionStateSerialisableData
{
public:
	char                                                         pad0x8_0Z7GM[0x8];                                 // 0x0(0x8)
	class UClass*                                                Id;                                                // 0x8(0x8)
	class ScriptStruct*                                          Type;                                              // 0x10(0x8)
	char                                                         pad0x18_XOG15[0x18];                               // 0x18(0x18)
};


// Size 0x10
struct ActionStateMessage
{
public:
	char                                                         pad0x8_6PPOF[0x8];                                 // 0x0(0x8)
	class ScriptStruct*                                          Type;                                              // 0x8(0x8)
};


// Size 0x1
struct ActionStateChangeRequestId
{
public:
	byte                                                         Raw;                                               // 0x0(0x1)
};


// Size 0x40
struct SerialisedActionStateInfo
{
public:
	char                                                         pad0x40_057B0[0x40];                               // 0x0(0x40)
};


// Size 0x18
struct SerialisedActionStateMessage
{
public:
	char                                                         pad0x18_74SVK[0x18];                               // 0x0(0x18)
};


// Size 0x140
struct SerialisedConstructionInfoStore
{
public:
	struct SerialisedActionStateInfo                             SerialisedConstructionInfo;                        // 0x0(0x40)
	char                                                         pad0x100_ZPUWM[0x100];                             // 0x40(0x100)
};


// Size 0x150
struct ResetStateMachineRpc
{
public:
	struct ActionStateChangeRequestId                            LatestEpochIds;                                    // 0x0(0x1)
	char                                                         pad0x4_LU4MK[0x4];                                 // 0x1(0x4)
	struct ActionStateChangeRequestId                            LatestRequestIds;                                  // 0x5(0x1)
	char                                                         pad0xa_DKXTK[0xa];                                 // 0x6(0xa)
	struct SerialisedConstructionInfoStore                       PerTrackConstructionInfoStore;                     // 0x10(0x140)
};


// Size 0x38
struct TestActionStateSerialisableData
{
public:
	char                                                         pad0x30_L1ZAB[0x30];                               // 0x0(0x30)
	int                                                          IntProp;                                           // 0x30(0x4)
	char                                                         pad0x4_END6V[0x4];                                 // 0x34(0x4)
};


// Size 0x18
struct ActionStatePriorityList
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	TArray<struct ActionStatePriorityRelationship>               Entries;                                           // 0x8(0x10)
};


// Size 0x10
struct ActionStatePriorityRelationship
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	byte                                                         Priority;                                          // 0x8(0x1)
	char                                                         pad0x7_F77V9[0x7];                                 // 0x9(0x7)
};


// Size 0xa0
struct ActionStatePriorityTable
{
public:
	char                                                         pad0xa0_AXZUT[0xa0];                               // 0x0(0xa0)
};


// Size 0x48
struct TestActionStateConstructionInfoWithObjPointers
{
public:
	char                                                         pad0x28_1ZUB6[0x28];                               // 0x0(0x28)
	class Object*                                                ObjPointer;                                        // 0x28(0x8)
	struct InnerWithObjTestStruct                                Inner;                                             // 0x30(0x8)
	TArray<class Object*>                                        Array;                                             // 0x38(0x10)
};


// Size 0x8
struct InnerWithObjTestStruct
{
public:
	class Object*                                                ObjPointer;                                        // 0x0(0x8)
};


// Size 0x48
struct TestActionStateConstructionInfoWithInner
{
public:
	char                                                         pad0x28_XA2KL[0x28];                               // 0x0(0x28)
	float                                                        FloatProp;                                         // 0x28(0x4)
	char                                                         pad0x4_LLS9T[0x4];                                 // 0x2c(0x4)
	struct InnerTestStruct                                       InnerStruct;                                       // 0x30(0x18)
};


// Size 0x18
struct InnerTestStruct
{
public:
	bool                                                         BoolProp;                                          // 0x0(0x1)
	char                                                         pad0x7_UN9GB[0x7];                                 // 0x1(0x7)
	struct FString                                               StringProp;                                        // 0x8(0x10)
};


// Size 0x30
struct TestActionStateConstructionInfo
{
public:
	char                                                         pad0x28_YJOE2[0x28];                               // 0x0(0x28)
	int                                                          IntProp;                                           // 0x28(0x4)
	char                                                         pad0x4_DMCN2[0x4];                                 // 0x2c(0x4)
};


// Size 0x1
struct EventWaitingToSpawnActionStateEndedClient
{
public:
	char                                                         pad0x1_ERKBP[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventWaitingToSpawnActionStateStartedClient
{
public:
	char                                                         pad0x1_AOYYK[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventFirstPersonAnimaticActionStateEndedClient
{
public:
	char                                                         pad0x1_HE8XS[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct NullActionStateConstructionInfo
{
public:
	char                                                         pad0x30_Z4X2B[0x30];                               // 0x0(0x30)
};


// Size 0x10
struct TestActionStateMessage2
{
public:
	char                                                         pad0x10_N4D4J[0x10];                               // 0x0(0x10)
};


// Size 0x18
struct TestActionStateMessage
{
public:
	char                                                         pad0x10_77UD2[0x10];                               // 0x0(0x10)
	int                                                          TestProperty;                                      // 0x10(0x4)
	char                                                         pad0x4_HF4UL[0x4];                                 // 0x14(0x4)
};


// Size 0x38
struct TestActorActionStateConstructionInfo
{
public:
	char                                                         pad0x30_NVDPZ[0x30];                               // 0x0(0x30)
	int                                                          IntProp;                                           // 0x30(0x4)
	char                                                         pad0x4_QEEWT[0x4];                                 // 0x34(0x4)
};


}