// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20
struct ActorSequenceObjectReferenceMap
{
public:
	TArray<struct Guid>                                          BindingIds;                                        // 0x0(0x10)
	TArray<struct ActorSequenceObjectReferences>                 References;                                        // 0x10(0x10)
};


// Size 0x10
struct ActorSequenceObjectReferences
{
public:
	TArray<struct ActorSequenceObjectReference>                  Array;                                             // 0x0(0x10)
};


// Size 0x28
struct ActorSequenceObjectReference
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	char                                                         pad0x3_L32S2[0x3];                                 // 0x1(0x3)
	struct Guid                                                  ActorId;                                           // 0x4(0x10)
	char                                                         pad0x4_4NATI[0x4];                                 // 0x14(0x4)
	struct FString                                               PathToComponent;                                   // 0x18(0x10)
};


}