// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x420 (Full Size[0x490] - InheritedSize[0x70]
class AD_FirstPerson_PlayerPirate_Male_Default_C: public FirstPersonAnimationData
{
public:
	Struct ADS_IdlesNative                                       None;                                              // 0x70(0x10)
	Struct ADS_LocomotionNative                                  None;                                              // 0x80(0x50)
	Struct ADS_JumpingNative                                     None;                                              // 0xd0(0x78)
	Struct ADS_SwimmingNative                                    None;                                              // 0x148(0x68)
	Struct ADS_WheelNative                                       None;                                              // 0x1b0(0x88)
	Struct ADS_CapstanNative                                     None;                                              // 0x238(0x68)
	Struct ADS_CameraAdditiveNative                              None;                                              // 0x2a0(0x50)
	Struct ADS_ObjectsNative                                     None;                                              // 0x2f0(0x10)
	Struct ADS_Sockets                                           None;                                              // 0x300(0x2)
	char                                                         pad0x6_E2I4J[0x6];                                 // 0x302(0x6)
	Struct ADS_CannonNative                                      None;                                              // 0x308(0x38)
	Struct ADS_RowingBoatNative                                  None;                                              // 0x340(0x98)
	Struct ADS_WaterPumpNative                                   None;                                              // 0x3d8(0x28)
	Struct ADS_FacialNative                                      None;                                              // 0x400(0x90)
};


}