// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x420 (Full Size[0x498] - InheritedSize[0x78]
class AD_FirstPerson_PlayerPirate_Male_Default_C: public FirstPersonAnimationData
{
public:
	struct ADS_IdlesNative                                       Idles;                                             // 0x78(0x10)
	struct ADS_LocomotionNative                                  Locomotion;                                        // 0x88(0x50)
	struct ADS_JumpingNative                                     Jumping;                                           // 0xd8(0x78)
	struct ADS_SwimmingNative                                    Swimming;                                          // 0x150(0x68)
	struct ADS_WheelNative                                       Wheel;                                             // 0x1b8(0x88)
	struct ADS_CapstanNative                                     Capstan;                                           // 0x240(0x68)
	struct ADS_CameraAdditiveNative                              CameraAdditive;                                    // 0x2a8(0x50)
	struct ADS_ObjectsNative                                     Items;                                             // 0x2f8(0x10)
	struct ADS_Sockets                                           Sockets;                                           // 0x308(0x2)
	char                                                         pad0x6_G7D9V[0x6];                                 // 0x30a(0x6)
	struct ADS_CannonNative                                      Cannon;                                            // 0x310(0x38)
	struct ADS_RowingBoatNative                                  Rowboat;                                           // 0x348(0x98)
	struct ADS_WaterPumpNative                                   WaterPump;                                         // 0x3e0(0x28)
	struct ADS_FacialNative                                      Facial;                                            // 0x408(0x90)
};


}