// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x420 (Full Size[0x498] - InheritedSize[0x78]
class AD_FirstPerson_PlayerPirate_Male_Default_C: public FirstPersonAnimationData
{
public:
	Struct ADS_IdlesNative                                       None;                                              // 0x78(0x10)
	Struct ADS_LocomotionNative                                  None;                                              // 0x88(0x50)
	Struct ADS_JumpingNative                                     None;                                              // 0xd8(0x78)
	Struct ADS_SwimmingNative                                    None;                                              // 0x150(0x68)
	Struct ADS_WheelNative                                       None;                                              // 0x1b8(0x88)
	Struct ADS_CapstanNative                                     None;                                              // 0x240(0x68)
	Struct ADS_CameraAdditiveNative                              None;                                              // 0x2a8(0x50)
	Struct ADS_ObjectsNative                                     None;                                              // 0x2f8(0x10)
	Struct ADS_Sockets                                           None;                                              // 0x308(0x2)
	char                                                         pad0x6_074SK[0x6];                                 // 0x30a(0x6)
	Struct ADS_CannonNative                                      None;                                              // 0x310(0x38)
	Struct ADS_RowingBoatNative                                  None;                                              // 0x348(0x98)
	Struct ADS_WaterPumpNative                                   None;                                              // 0x3e0(0x28)
	Struct ADS_FacialNative                                      None;                                              // 0x408(0x90)
};


}