// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x700 (Full Size[0x790] - InheritedSize[0x90]
class AD_ThirdPerson_PlayerPirate_Female_Default_C: public AthenaAnimationThirdPersonAnimationData
{
public:
	Struct ADS_IdlesNative                                       Idles;                                             // 0x90(0x10)
	Struct ADS_LocomotionNative                                  Locomotion;                                        // 0xa0(0x50)
	Struct ADS_LocomotionAlternateNative                         LocomotionAlternate;                               // 0xf0(0x140)
	Struct ADS_JumpingNative                                     Jumping;                                           // 0x230(0x78)
	Struct ADS_SwimmingNative                                    Swimming;                                          // 0x2a8(0x68)
	Struct ADS_WheelNative                                       Wheel;                                             // 0x310(0x88)
	Struct ADS_CapstanNative                                     Capstan;                                           // 0x398(0x68)
	Struct ADS_LadderNative                                      Ladder;                                            // 0x400(0x68)
	Struct ADS_ObjectsNative                                     Items;                                             // 0x468(0x10)
	Struct ADS_CannonNative                                      Cannon;                                            // 0x478(0x38)
	Struct ADS_HarpoonLauncherNative                             HarpoonLauncher;                                   // 0x4b0(0x28)
	Struct ADS_Sockets                                           Sockets;                                           // 0x4d8(0x2)
	char                                                         pad0x6_KWRCW[0x6];                                 // 0x4da(0x6)
	Struct ADS_FacialNative                                      Facial;                                            // 0x4e0(0x90)
	Struct ADS_IKFootPlantingNative                              IkFootPlanting;                                    // 0x570(0x1c)
	char                                                         pad0x4_XIMWG[0x4];                                 // 0x58c(0x4)
	Struct ADS_HitReactsNative                                   HitReacts;                                         // 0x590(0x40)
	Struct ADS_MapTableNative                                    MapTable;                                          // 0x5d0(0x30)
	Struct ADS_SpawnNative2                                      Spawning;                                          // 0x600(0x10)
	Struct ADS_CharacterSelectNative                             CharacterSelect;                                   // 0x610(0x10)
	Struct ADS_SkeletonFleeNative                                SkeletonFlee;                                      // 0x620(0x10)
	Struct ADS_InteractionNative                                 ShopInteraction;                                   // 0x630(0x10)
	Struct ADS_SkeletonSensing                                   SkeletonSensing;                                   // 0x640(0x10)
	Struct ADS_SkeletonEmoteActions                              SkeletonActionEmotes;                              // 0x650(0x10)
	Struct ADS_RowingBoatNative                                  Rowboat;                                           // 0x660(0x98)
	Struct ADS_SkeletonCaptainNative                             SkeletonShipCaptain;                               // 0x6f8(0x48)
	Struct ADS_SkeletonCurseNative                               SkeletonCurse;                                     // 0x740(0x28)
	Struct ADS_WaterPumpNative                                   WaterPump;                                         // 0x768(0x28)
};


}