// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x700 (Full Size[0x788] - InheritedSize[0x88]
class AD_ThirdPerson_PlayerPirate_Female_Default_C: public AthenaAnimationThirdPersonAnimationData
{
public:
	Struct ADS_IdlesNative                                       Idles;                                             // 0x88(0x10)
	Struct ADS_LocomotionNative                                  Locomotion;                                        // 0x98(0x50)
	Struct ADS_LocomotionAlternateNative                         LocomotionAlternate;                               // 0xe8(0x140)
	Struct ADS_JumpingNative                                     Jumping;                                           // 0x228(0x78)
	Struct ADS_SwimmingNative                                    Swimming;                                          // 0x2a0(0x68)
	Struct ADS_WheelNative                                       Wheel;                                             // 0x308(0x88)
	Struct ADS_CapstanNative                                     Capstan;                                           // 0x390(0x68)
	Struct ADS_LadderNative                                      Ladder;                                            // 0x3f8(0x68)
	Struct ADS_ObjectsNative                                     Items;                                             // 0x460(0x10)
	Struct ADS_CannonNative                                      Cannon;                                            // 0x470(0x38)
	Struct ADS_HarpoonLauncherNative                             HarpoonLauncher;                                   // 0x4a8(0x28)
	Struct ADS_Sockets                                           Sockets;                                           // 0x4d0(0x2)
	char                                                         pad0x6_4JQ39[0x6];                                 // 0x4d2(0x6)
	Struct ADS_FacialNative                                      Facial;                                            // 0x4d8(0x90)
	Struct ADS_IKFootPlantingNative                              IkFootPlanting;                                    // 0x568(0x1c)
	char                                                         pad0x4_HHZU4[0x4];                                 // 0x584(0x4)
	Struct ADS_HitReactsNative                                   HitReacts;                                         // 0x588(0x40)
	Struct ADS_MapTableNative                                    MapTable;                                          // 0x5c8(0x30)
	Struct ADS_SpawnNative2                                      Spawning;                                          // 0x5f8(0x10)
	Struct ADS_CharacterSelectNative                             CharacterSelect;                                   // 0x608(0x10)
	Struct ADS_SkeletonFleeNative                                SkeletonFlee;                                      // 0x618(0x10)
	Struct ADS_InteractionNative                                 ShopInteraction;                                   // 0x628(0x10)
	Struct ADS_SkeletonSensing                                   SkeletonSensing;                                   // 0x638(0x10)
	Struct ADS_SkeletonEmoteActions                              SkeletonActionEmotes;                              // 0x648(0x10)
	Struct ADS_RowingBoatNative                                  Rowboat;                                           // 0x658(0x98)
	Struct ADS_SkeletonCaptainNative                             SkeletonShipCaptain;                               // 0x6f0(0x48)
	Struct ADS_SkeletonCurseNative                               SkeletonCurse;                                     // 0x738(0x28)
	Struct ADS_WaterPumpNative                                   WaterPump;                                         // 0x760(0x28)
};


}