// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x700 (Full Size[0x790] - InheritedSize[0x90]
class AD_ThirdPerson_PlayerPirate_Male_Default_C: public AthenaAnimationThirdPersonAnimationData
{
public:
	struct ADS_IdlesNative                                       Idles;                                             // 0x90(0x10)
	struct ADS_LocomotionNative                                  Locomotion;                                        // 0xa0(0x50)
	struct ADS_LocomotionAlternateNative                         LocomotionAlternate;                               // 0xf0(0x140)
	struct ADS_JumpingNative                                     Jumping;                                           // 0x230(0x78)
	struct ADS_SwimmingNative                                    Swimming;                                          // 0x2a8(0x68)
	struct ADS_WheelNative                                       Wheel;                                             // 0x310(0x88)
	struct ADS_CapstanNative                                     Capstan;                                           // 0x398(0x68)
	struct ADS_LadderNative                                      Ladder;                                            // 0x400(0x68)
	struct ADS_ObjectsNative                                     Items;                                             // 0x468(0x10)
	struct ADS_CannonNative                                      Cannon;                                            // 0x478(0x38)
	struct ADS_HarpoonLauncherNative                             HarpoonLauncher;                                   // 0x4b0(0x28)
	struct ADS_Sockets                                           Sockets;                                           // 0x4d8(0x2)
	char                                                         pad0x6_I4H04[0x6];                                 // 0x4da(0x6)
	struct ADS_FacialNative                                      Facial;                                            // 0x4e0(0x90)
	struct ADS_IKFootPlantingNative                              IkFootPlanting;                                    // 0x570(0x1c)
	char                                                         pad0x4_NKY7B[0x4];                                 // 0x58c(0x4)
	struct ADS_HitReactsNative                                   HitReacts;                                         // 0x590(0x40)
	struct ADS_MapTableNative                                    MapTable;                                          // 0x5d0(0x30)
	struct ADS_SpawnNative2                                      Spawning;                                          // 0x600(0x10)
	struct ADS_CharacterSelectNative                             CharacterSelect;                                   // 0x610(0x10)
	struct ADS_SkeletonFleeNative                                SkeletonFlee;                                      // 0x620(0x10)
	struct ADS_InteractionNative                                 ShopInteraction;                                   // 0x630(0x10)
	struct ADS_SkeletonSensing                                   SkeletonSensing;                                   // 0x640(0x10)
	struct ADS_SkeletonEmoteActions                              SkeletonActionEmotes;                              // 0x650(0x10)
	struct ADS_RowingBoatNative                                  Rowboat;                                           // 0x660(0x98)
	struct ADS_SkeletonCaptainNative                             SkeletonShipCaptain;                               // 0x6f8(0x48)
	struct ADS_SkeletonCurseNative                               SkeletonCurse;                                     // 0x740(0x28)
	struct ADS_WaterPumpNative                                   WaterPump;                                         // 0x768(0x28)
};


}