#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x700 (Full Size[0x7b8] - InheritedSize[0xb8]
class AD_ThirdPerson_PlayerPirate_Female_Default_C: public AthenaAnimationThirdPersonAnimationData
{
public:
	struct ADS_IdlesNative                                       Idles;                                             // 0xb8(0x10)
	struct ADS_LocomotionNative                                  Locomotion;                                        // 0xc8(0x50)
	struct ADS_LocomotionAlternateNative                         LocomotionAlternate;                               // 0x118(0x140)
	struct ADS_JumpingNative                                     Jumping;                                           // 0x258(0x78)
	struct ADS_SwimmingNative                                    Swimming;                                          // 0x2d0(0x68)
	struct ADS_WheelNative                                       Wheel;                                             // 0x338(0x88)
	struct ADS_CapstanNative                                     Capstan;                                           // 0x3c0(0x68)
	struct ADS_LadderNative                                      Ladder;                                            // 0x428(0x68)
	struct ADS_ObjectsNative                                     Items;                                             // 0x490(0x10)
	struct ADS_CannonNative                                      Cannon;                                            // 0x4a0(0x38)
	struct ADS_HarpoonLauncherNative                             HarpoonLauncher;                                   // 0x4d8(0x28)
	struct ADS_Sockets                                           Sockets;                                           // 0x500(0x2)
	char                                                         pad0x6_K473D[0x6];                                 // 0x502(0x6)
	struct ADS_FacialNative                                      Facial;                                            // 0x508(0x90)
	struct ADS_IKFootPlantingNative                              IkFootPlanting;                                    // 0x598(0x1c)
	char                                                         pad0x4_BASQ5[0x4];                                 // 0x5b4(0x4)
	struct ADS_HitReactsNative                                   HitReacts;                                         // 0x5b8(0x40)
	struct ADS_MapTableNative                                    MapTable;                                          // 0x5f8(0x30)
	struct ADS_SpawnNative2                                      Spawning;                                          // 0x628(0x10)
	struct ADS_CharacterSelectNative                             CharacterSelect;                                   // 0x638(0x10)
	struct ADS_SkeletonFleeNative                                SkeletonFlee;                                      // 0x648(0x10)
	struct ADS_InteractionNative                                 ShopInteraction;                                   // 0x658(0x10)
	struct ADS_SkeletonSensing                                   SkeletonSensing;                                   // 0x668(0x10)
	struct ADS_SkeletonEmoteActions                              SkeletonActionEmotes;                              // 0x678(0x10)
	struct ADS_RowingBoatNative                                  Rowboat;                                           // 0x688(0x98)
	struct ADS_SkeletonCaptainNative                             SkeletonShipCaptain;                               // 0x720(0x48)
	struct ADS_SkeletonCurseNative                               SkeletonCurse;                                     // 0x768(0x28)
	struct ADS_WaterPumpNative                                   WaterPump;                                         // 0x790(0x28)
};


