// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x58 (Full Size[0x708] - InheritedSize[0x6b0]
class Adv12DD_OliviaDistractedTempState_C: public CompanyShopkeeper
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x6b0(0x8)
	Class CommodityRedemptionComponent*                          CommodityRedemption;                               // 0x6b8(0x8)
	Class EmissaryMaxRankQuestProvider*                          EmissaryMaxRankQuestProvider;                      // 0x6c0(0x8)
	Class CargoRunParticipantComponent*                          CargoRunParticipant;                               // 0x6c8(0x8)
	Class CapsuleComponent*                                      SolidHits;                                         // 0x6d0(0x8)
	Class NPCDialogComponent*                                    NPCDialogSellCrate;                                // 0x6d8(0x8)
	Class NPCDialogComponent*                                    NPCDialog;                                         // 0x6e0(0x8)
	Class MerchantCrateProviderComponent*                        MerchantCrateProvider;                             // 0x6e8(0x8)
	Class SkeletalMeshComponent*                                 cmp_pocket_watch_mrh_01_e;                         // 0x6f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x6f8(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x700(0x8)
};


}