#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "AdventureOnDemand_Structs.h"


// Size 0x128 (Full Size[0x158] - InheritedSize[0x30]
class GameEventOnDemandArrivalTunnelWorkerBase: public AdventureOnDemandArrivalTunnelWorkerBase
{
public:
	float                                                        TriggerTunnelFailureTimeout;                       // 0x30(0x4)
	float                                                        MinRangeFromTarget;                                // 0x34(0x4)
	float                                                        MaxRangeFromTarget;                                // 0x38(0x4)
	float                                                        SubsequentCrewJoinRadiusModifier;                  // 0x3c(0x4)
	class UClass*                                                GameEventType;                                     // 0x40(0x8)
	char                                                         pad0xe0_ZVPFH[0xe0];                               // 0x48(0xe0)
	class VoyageDescDataAsset*                                   LeaveTunnelVoyageDesc;                             // 0x128(0x8)
	char                                                         pad0x14_35L0J[0x14];                               // 0x130(0x14)
	float                                                        RetryRequestEventFrequency;                        // 0x144(0x4)
	char                                                         pad0x10_CEYD5[0x10];                               // 0x148(0x10)
};


// Size 0x310 (Full Size[0x6b0] - InheritedSize[0x3a0]
class AdventureOnDemandService: public Actor
{
public:
	char                                                         pad0x10_KS5YW[0x10];                               // 0x3a0(0x10)
	class AdventureOnDemandServiceParams*                        Params;                                            // 0x3b0(0x8)
	class AdventureOnDemandVoyageSelectionDataAsset*             VoyageSelectionDataAsset;                          // 0x3b8(0x8)
	class QuestTableAdventureOnDemandParams*                     QuestTableAdventureOnDemandParams;                 // 0x3c0(0x8)
	class TradingCompanyPopUpBackgroundCollectionDataAsset*      TradingCompanyPopUpBackgroundCollection;           // 0x3c8(0x8)
	char                                                         pad0xa0_RZOKG[0xa0];                               // 0x3d0(0xa0)
	TArray<struct AdventureOnDemandServiceCrewEntry>             DiveToTunnelEntries;                               // 0x470(0x10)
	TArray<struct AdventureOnDemandServiceCrewEntry>             LeaveTunnelEntries;                                // 0x480(0x10)
	TArray<struct Guid>                                          CrewsDivingToTunnel;                               // 0x490(0x10)
	TArray<struct Guid>                                          CrewsInArrivalTunnel;                              // 0x4a0(0x10)
	TArray<struct Guid>                                          CrewsOnCooldown;                                   // 0x4b0(0x10)
	char                                                         pad0x1f0_I1U1G[0x1f0];                             // 0x4c0(0x1f0)
};


// Size 0x30 (Full Size[0x188] - InheritedSize[0x158]
class IslandBasedGameEventOnDemandArrivalTunnelWorker: public GameEventOnDemandArrivalTunnelWorkerBase
{
public:
	bool                                                         UseSpawnDistanceFromIslandForResurfaceRadius;      // 0x158(0x1)
	char                                                         pad0x17_9XSV3[0x17];                               // 0x159(0x17)
	float                                                        ResurfaceMaxRadiusModifier;                        // 0x170(0x4)
	char                                                         pad0x14_8TDOA[0x14];                               // 0x174(0x14)
};


// Size 0x10 (Full Size[0x168] - InheritedSize[0x158]
class AIShipBattleGameEventOnDemandArrivalTunnelWorker: public GameEventOnDemandArrivalTunnelWorkerBase
{
public:
	char                                                         pad0x10_LUWQC[0x10];                               // 0x158(0x10)
};


// Size 0x18 (Full Size[0x1a0] - InheritedSize[0x188]
class ContendedResourceGameEventOnDemandArrivalTunnelWorker: public IslandBasedGameEventOnDemandArrivalTunnelWorker
{
public:
	char                                                         pad0x18_NZS26[0x18];                               // 0x188(0x18)
};


// Size 0x10 (Full Size[0x198] - InheritedSize[0x188]
class AggressiveGhostShipsEncounterOnDemandArrivalTunnelWorker: public IslandBasedGameEventOnDemandArrivalTunnelWorker
{
public:
	char                                                         pad0x10_L362U[0x10];                               // 0x188(0x10)
};


// Size 0x10 (Full Size[0x198] - InheritedSize[0x188]
class AshenLordEventOnDemandArrivalTunnelWorker: public IslandBasedGameEventOnDemandArrivalTunnelWorker
{
public:
	char                                                         pad0x10_RNJZL[0x10];                               // 0x188(0x10)
};


// Size 0x10 (Full Size[0x198] - InheritedSize[0x188]
class SkellyFortEventOnDemandArrivalTunnelWorker: public IslandBasedGameEventOnDemandArrivalTunnelWorker
{
public:
	char                                                         pad0x10_3QXR4[0x10];                               // 0x188(0x10)
};


// Size 0x0 (Full Size[0x1a0] - InheritedSize[0x1a0]
class SunkenKingdomShrineGameEventOnDemandArrivalTunnelWorker: public ContendedResourceGameEventOnDemandArrivalTunnelWorker
{
public:
};


// Size 0x0 (Full Size[0x1a0] - InheritedSize[0x1a0]
class SunkenKingdomTreasuryGameEventOnDemandArrivalTunnelWorker: public ContendedResourceGameEventOnDemandArrivalTunnelWorker
{
public:
};


// Size 0x0 (Full Size[0x1a0] - InheritedSize[0x1a0]
class SkellyCampGameEventOnDemandArrivalTunnelWorker: public ContendedResourceGameEventOnDemandArrivalTunnelWorker
{
public:
};


// Size 0x0 (Full Size[0x1a0] - InheritedSize[0x1a0]
class SeaFortGameEventOnDemandArrivalTunnelWorker: public ContendedResourceGameEventOnDemandArrivalTunnelWorker
{
public:
};


