// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandAreCrewNearQuestTargetStep: public TaleQuestStep
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class AdventureOnDemandAreCrewNearQuestTargetStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableBool                                     AreCrewNearQuestTarget;                            // 0x80(0x30)
};


// Size 0x20 (Full Size[0xf8] - InheritedSize[0xd8]
class AdventureOnDemandArrivalTunnelDependencies: public ArrivalTunnelDependencies
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class AdventureOnDemandArrivalTunnelWorkerBase: public Object
{
public:
	Class World*                                                 WorldPtr;                                          // 0x28(0x8)
};


// Size 0x28 (Full Size[0xd0] - InheritedSize[0xa8]
class AdventureOnDemandArrivalTunnelDesc: public ClientDestinationPreLoadingArrivalTunnelDesc
{
public:
	Struct Vector                                                ResurfaceLocationOffset;                           // 0xa8(0xc)
	char                                                         pad0x4_8N8NY[0x4];                                 // 0xb4(0x4)
	Class AdventureOnDemandArrivalTunnelWorkerBase*              DefaultArrivalLocationWorkerClass;                 // 0xb8(0x8)
	Class EnvQuery*                                              ResurfaceLocationEQ;                               // 0xc0(0x8)
	bool                                                         ShouldExcludeCrewFromBeingTargetedForGameEvents;   // 0xc8(0x1)
	char                                                         pad0x3_9MB24[0x3];                                 // 0xc9(0x3)
	float                                                        ExclusionTimerFromBeingTargetedForGameEvents;      // 0xcc(0x4)
};


// Size 0x60 (Full Size[0x700] - InheritedSize[0x6a0]
class AdventureOnDemandArrivalTunnelOfTheDamned: public ClientDestinationPreLoadingArrivalTunnelOfTheDamned
{
public:
	char                                                         pad0x28_CT97L[0x28];                               // 0x6a0(0x28)
	Class AdventureOnDemandArrivalTunnelDesc*                    AdventureOnDemandArrivalTunnelDesc;                // 0x6c8(0x8)
	Class AdventureOnDemandArrivalTunnelWorkerBase*              ArrivalLocationWorker;                             // 0x6d0(0x8)
	char                                                         pad0x28_CIU32[0x28];                               // 0x6d8(0x28)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class VoyageOnDemandArrivalTunnelWorker: public AdventureOnDemandArrivalTunnelWorkerBase
{
public:
};


// Size 0x10 (Full Size[0x148] - InheritedSize[0x138]
class AdventureOnDemandDepartureTunnelDependencies: public DepartureTunnelDependencies
{
public:
};


// Size 0x0 (Full Size[0x148] - InheritedSize[0x148]
class GameEventOnDemandDepartureTunnelDependencies: public AdventureOnDemandDepartureTunnelDependencies
{
public:
};


// Size 0x0 (Full Size[0x148] - InheritedSize[0x148]
class VoyageOnDemandDepartureTunnelDependencies: public AdventureOnDemandDepartureTunnelDependencies
{
public:
};


// Size 0x0 (Full Size[0x100] - InheritedSize[0x100]
class AdventureOnDemandDepartureTunnelDesc: public DepartureTunnelDesc
{
public:
};


// Size 0x20 (Full Size[0x120] - InheritedSize[0x100]
class GameEventOnDemandDepartureTunnelDesc: public AdventureOnDemandDepartureTunnelDesc
{
public:
};


// Size 0x0 (Full Size[0x100] - InheritedSize[0x100]
class VoyageOnDemandDepartureTunnelDesc: public AdventureOnDemandDepartureTunnelDesc
{
public:
};


// Size 0x20 (Full Size[0x8c0] - InheritedSize[0x8a0]
class AdventureOnDemandDepartureTunnelOfTheDamned: public DepartureTunnelOfTheDamned
{
public:
	Class AdventureOnDemandDepartureTunnelDesc*                  AdventureOnDemandDepartureTunnelDesc;              // 0x8a0(0x8)
	char                                                         pad0x18_CTAP1[0x18];                               // 0x8a8(0x18)
};


// Size 0x0 (Full Size[0x8c0] - InheritedSize[0x8c0]
class GameEventOnDemandDepartureTunnelOfTheDamned: public AdventureOnDemandDepartureTunnelOfTheDamned
{
public:
	Class GameEventOnDemandDepartureTunnelDesc*                  GameEventOnDemandDepartureTunnelDesc;              // 0x8b8(0x8)
};


// Size 0x0 (Full Size[0x8c0] - InheritedSize[0x8c0]
class VoyageOnDemandDepartureTunnelOfTheDamned: public AdventureOnDemandDepartureTunnelOfTheDamned
{
public:
	Class VoyageOnDemandDepartureTunnelDesc*                     VoyageOnDemandDepartureTunnelDesc;                 // 0x8b8(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandDisplayHintPopUpStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class AdventureOnDemandDisplayHintPopUpStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandForceIslandBannerStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class AdventureOnDemandForceIslandBannerStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandGetIsDivingToTunnelStep: public TaleQuestStep
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class AdventureOnDemandGetIsDivingToTunnelStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableBool                                     IsCrewDivingToTunnel;                              // 0x80(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandGetTunnelDescStep: public TaleQuestStep
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class AdventureOnDemandGetTunnelDescStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableDataAsset                                TunnelDesc;                                        // 0x80(0x30)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AdventureOnDemandLocationRequestDataAsset: public DataAsset
{
public:
	TArray<struct SeaBasedGameEventLocations>                    SeaBasedGameEventLocations;                        // 0x28(0x10)
	Class EnvQuery*                                              SeaBasedGameEventQuery;                            // 0x38(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AdventureOnDemandServiceInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class AdventureOnDemandServiceParams: public DataAsset
{
public:
	Class VoyageDescDataAsset*                                   DiveToTunnelVoyageDesc;                            // 0x28(0x8)
	Class TunnelDesc*                                            VoyageTunnelDesc;                                  // 0x30(0x8)
	Class VoyageDescDataAsset*                                   LeaveTunnelVoyageDesc;                             // 0x38(0x8)
	TArray<struct ExtraSpawnDistanceFromIsland>                  ExtraSpawnDistanceFromIsland;                      // 0x40(0x10)
	float                                                        WorldEventsCooldown;                               // 0x50(0x4)
	char                                                         pad0x4_7BIMS[0x4];                                 // 0x54(0x4)
	Class AdventureOnDemandLocationRequestDataAsset*             LocationRequestDataAsset;                          // 0x58(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandSetDirectionToApproachTargetFromStep: public TaleQuestStep
{
public:
};


// Size 0x90 (Full Size[0x110] - InheritedSize[0x80]
class AdventureOnDemandSetDirectionToApproachTargetFromStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableVector                                   DirectionToApproachTargetFrom;                     // 0x80(0x30)
	Struct QuestVariableVector                                   PointOfInterestToGetDirectionToTargetFrom;         // 0xb0(0x30)
	Struct QuestVariableActor                                    ActorToGetDirectionToTargetFrom;                   // 0xe0(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandSetHintPopUpStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class AdventureOnDemandSetHintPopUpStepDesc: public TaleQuestStepDesc
{
public:
	byte                                                         HintType;                                          // 0x80(0x1)
	char                                                         pad0x7_8TYRR[0x7];                                 // 0x81(0x7)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandSetTargetLocationStep: public TaleQuestStep
{
public:
};


// Size 0xc0 (Full Size[0x140] - InheritedSize[0x80]
class AdventureOnDemandSetTargetLocationStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableName                                     IslandName;                                        // 0x80(0x30)
	Struct QuestVariableActor                                    IslandData;                                        // 0xb0(0x30)
	Struct QuestVariableVector                                   TargetLocation;                                    // 0xe0(0x30)
	Struct QuestVariableFloat                                    RadiusFromTarget;                                  // 0x110(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandSetTunnelDescStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class AdventureOnDemandSetTunnelDescStepDesc: public TaleQuestStepDesc
{
public:
	Class TunnelDesc*                                            TunnelDesc;                                        // 0x80(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandSuppressIslandBannerStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class AdventureOnDemandSuppressIslandBannerStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class AdventureOnDemandYieldQuestResumeOnConditionsTaleStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class AdventureOnDemandTaleFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class AdventureOnDemandVoyageSelectionCompanyDataAsset: public DataAsset
{
public:
	struct FName                                                 CompanyName;                                       // 0x28(0x8)
	TArray<class InteractionPrerequisiteBase*>                   Prerequisites;                                     // 0x30(0x10)
	TArray<struct VoyageGroups>                                  VoyageGroups;                                      // 0x40(0x10)
	TArray<struct WorldEventGroups>                              WorldEventGroups;                                  // 0x50(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class AdventureOnDemandVoyageSelectionDataAsset: public DataAsset
{
public:
	TArray<class AdventureOnDemandVoyageSelectionCompanyDataAsset*> CompanyEntries;                                    // 0x28(0x10)
	TArray<class AdventureOnDemandVoyageSelectionCompanyDataAsset*> TallTaleChapters;                                  // 0x38(0x10)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class AdventureOnDemandYieldQuestResumeOnConditionsStepDesc: public TaleQuestStepDesc
{
public:
	Struct OnDemandQuestResumeConditionMetReasonQuestVariable    OutConditionsMetReason;                            // 0x80(0x30)
};


}