// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x290 (Full Size[0x658] - InheritedSize[0x3c8]
class AdventureOnDemandService: public Actor
{
public:
	char                                                         pad0x10_0ZHT5[0x10];                               // 0x3c8(0x10)
	Class AdventureOnDemandServiceParams*                        Params;                                            // 0x3d8(0x8)
	Class AdventureOnDemandVoyageSelectionDataAsset*             VoyageSelectionDataAsset;                          // 0x3e0(0x8)
	char                                                         pad0xb0_VK54R[0xb0];                               // 0x3e8(0xb0)
	TArray<struct DiveToTunnelEntries>                           DiveToTunnelEntries;                               // 0x498(0x10)
	TArray<struct LeaveTunnelEntries>                            LeaveTunnelEntries;                                // 0x4a8(0x10)
	TArray<struct CrewsDivingToTunnel>                           CrewsDivingToTunnel;                               // 0x4b8(0x10)
	TArray<struct CrewsOnCooldown>                               CrewsOnCooldown;                                   // 0x4c8(0x10)
	char                                                         pad0x180_E34A1[0x180];                             // 0x4d8(0x180)
};


// Size 0x58 (Full Size[0x88] - InheritedSize[0x30]
class GameEventOnDemandArrivalTunnelWorkerBase: public AdventureOnDemandArrivalTunnelWorkerBase
{
public:
	float                                                        MinRangeFromTarget;                                // 0x30(0x4)
	float                                                        MaxRangeFromTarget;                                // 0x34(0x4)
	float                                                        SubsequentCrewJoinRadiusModifier;                  // 0x38(0x4)
	char                                                         pad0x34_F3FGW[0x34];                               // 0x3c(0x34)
	Class VoyageDescDataAsset*                                   LeaveTunnelVoyageDesc;                             // 0x70(0x8)
	char                                                         pad0x10_ZGKBL[0x10];                               // 0x78(0x10)
};


// Size 0x68 (Full Size[0xf0] - InheritedSize[0x88]
class SeaBasedGameEventOnDemandArrivalTunnelWorker: public GameEventOnDemandArrivalTunnelWorkerBase
{
public:
	char                                                         pad0x20_TVH7Z[0x20];                               // 0x88(0x20)
	float                                                        VacateOccupiedLocationTimer;                       // 0xa8(0x4)
	char                                                         pad0x44_H3UM5[0x44];                               // 0xac(0x44)
};


// Size 0x60 (Full Size[0xe8] - InheritedSize[0x88]
class SkellyFortEventOnDemandArrivalTunnelWorker: public GameEventOnDemandArrivalTunnelWorkerBase
{
public:
	bool                                                         UseSpawnDistanceFromIslandForResurfaceRadius;      // 0x88(0x1)
	char                                                         pad0x3_VHDS3[0x3];                                 // 0x89(0x3)
	float                                                        ResurfaceMaxRadiusModifier;                        // 0x8c(0x4)
	class                                                        SkellyFortType;                                    // 0x90(0x8)
	char                                                         pad0x50_E4CDL[0x50];                               // 0x98(0x50)
};


}