// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandDisplayHintPopUpStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class AdventureOnDemandDisplayHintPopUpStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandForceIslandBannerStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class AdventureOnDemandForceIslandBannerStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AdventureOnDemandServiceInterface: public Interface
{
public:
};


// Size 0x80 (Full Size[0x448] - InheritedSize[0x3c8]
class AdventureOnDemandService: public Actor
{
public:
	char                                                         pad0x10_HVD5B[0x10];                               // 0x3c8(0x10)
	Class AdventureOnDemandServiceParams*                        Params;                                            // 0x3d8(0x8)
	char                                                         pad0x48_BEHF7[0x48];                               // 0x3e0(0x48)
	TArray<struct DiveToTunnelEntries>                           DiveToTunnelEntries;                               // 0x428(0x10)
	TArray<struct LeaveTunnelEntries>                            LeaveTunnelEntries;                                // 0x438(0x10)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class AdventureOnDemandServiceParams: public DataAsset
{
public:
	Class VoyageDescDataAsset*                                   DiveToTunnelVoyageDesc;                            // 0x28(0x8)
	Class TunnelDesc*                                            VoyageTunnelDesc;                                  // 0x30(0x8)
	Class VoyageDescDataAsset*                                   LeaveTunnelVoyageDesc;                             // 0x38(0x8)
	float                                                        EQSRadiusRange;                                    // 0x40(0x4)
	char                                                         pad0x4_E256G[0x4];                                 // 0x44(0x4)
	TArray<struct ExtraSpawnDistanceFromIsland>                  ExtraSpawnDistanceFromIsland;                      // 0x48(0x10)
	TArray<struct VoyageHintPopupDescs>                          VoyageHintPopupDescs;                              // 0x58(0x10)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandSetDirectionToApproachTargetFromStep: public TaleQuestStep
{
public:
};


// Size 0x90 (Full Size[0x110] - InheritedSize[0x80]
class AdventureOnDemandSetDirectionToApproachTargetFromStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableVector                                   DirectionToApproachTargetFrom;                     // 0x80(0x30)
	Struct QuestVariableVector                                   PointOfInterestToGetDirectionToTargetFrom;         // 0xb0(0x30)
	Struct QuestVariableActor                                    ActorToGetDirectionToTargetFrom;                   // 0xe0(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandSetHintPopUpStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class AdventureOnDemandSetHintPopUpStepDesc: public TaleQuestStepDesc
{
public:
	Class PopUpMessageDesc*                                      HintPopup;                                         // 0x80(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AdventureOnDemandSetTargetLocationStep: public TaleQuestStep
{
public:
};


// Size 0xc0 (Full Size[0x140] - InheritedSize[0x80]
class AdventureOnDemandSetTargetLocationStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableName                                     IslandName;                                        // 0x80(0x30)
	Struct QuestVariableActor                                    IslandData;                                        // 0xb0(0x30)
	Struct QuestVariableVector                                   TargetLocation;                                    // 0xe0(0x30)
	Struct QuestVariableFloat                                    RadiusFromTarget;                                  // 0x110(0x30)
};


}