// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10
struct VoyageHintPopupDescEntry
{
public:
	byte                                                         QuestType;                                         // 0x0(0x1)
	char                                                         pad0x7_HIFNL[0x7];                                 // 0x1(0x7)
	Class PopUpMessageDesc*                                      HintPopUpMessageDesc;                              // 0x8(0x8)
};


// Size 0x18
struct ExtraSpawnDistanceFromIsland
{
public:
	class                                                        ShipSize;                                          // 0x0(0x8)
	TArray<struct DistanceByIslandType>                          DistanceByIslandType;                              // 0x8(0x10)
};


// Size 0x8
struct ExtraSpawnDistanceByIslandType
{
public:
	byte                                                         IslandType;                                        // 0x0(0x1)
	char                                                         pad0x3_77OG2[0x3];                                 // 0x1(0x3)
	float                                                        ExtraSpawnDistance;                                // 0x4(0x4)
};


// Size 0x28
struct AdventureOnDemandVoyageSelectionVoyageProposalGroup
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	TArray<class InteractionPrerequisiteBase*>                   Prerequisites;                                     // 0x8(0x10)
	TArray<struct Proposals>                                     Proposals;                                         // 0x18(0x10)
};


// Size 0x18
struct AdventureOnDemandVoyageSelectionVoyageProposal
{
public:
	TArray<class InteractionPrerequisiteBase*>                   Prerequisites;                                     // 0x0(0x10)
	class                                                        Proposal;                                          // 0x10(0x8)
};


// Size 0x30
struct OnDemandQuestResumeConditionMetReasonQuestVariable
{
public:
};


// Size 0xb8
struct GameEventOnDemandBannerTextData
{
public:
	TArray<class Class*>                                         GameEventTypes;                                    // 0x0(0x10)
	Struct FText                                                 OnShipSunkBannerText;                              // 0x10(0x38)
	Struct FText                                                 OnVoyageCancelledBannerText;                       // 0x48(0x38)
	Struct FText                                                 OnGameEventCompletedBannerHeaderText;              // 0x80(0x38)
};


// Size 0x10
struct AdventureOnDemandCrewReadyToResurfaceEvent
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x10
struct AdventureOnDemandDiveCrewAlreadyAtDestinationEvent
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x1
struct AdventureOnDemandVoyageSurfaceTaleFinished
{
public:
};


// Size 0x10
struct SeaBasedGameEventOnDemandLocationRequestFailedTelemetryEvent
{
public:
	Struct FString                                               GameEventType;                                     // 0x0(0x10)
};


// Size 0x18
struct SeaBasedGameEventOnDemandLocationRequestCompletedTelemetryEvent
{
public:
	Struct FString                                               GameEventType;                                     // 0x0(0x10)
	Struct Vector2D                                              Result;                                            // 0x10(0x8)
};


}