// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x330 (Full Size[0x6f8] - InheritedSize[0x3c8]
class AdventureOnDemandService: public Actor
{
public:
	char                                                         pad0x10_GB8LJ[0x10];                               // 0x3c8(0x10)
	class AdventureOnDemandServiceParams*                        Params;                                            // 0x3d8(0x8)
	class AdventureOnDemandVoyageSelectionDataAsset*             VoyageSelectionDataAsset;                          // 0x3e0(0x8)
	class QuestTableAdventureOnDemandParams*                     QuestTableAdventureOnDemandParams;                 // 0x3e8(0x8)
	char                                                         pad0xb0_EZ23U[0xb0];                               // 0x3f0(0xb0)
	TArray<struct AdventureOnDemandServiceCrewEntry>             DiveToTunnelEntries;                               // 0x4a0(0x10)
	TArray<struct AdventureOnDemandServiceCrewEntry>             LeaveTunnelEntries;                                // 0x4b0(0x10)
	TArray<struct Guid>                                          CrewsDivingToTunnel;                               // 0x4c0(0x10)
	TArray<struct Guid>                                          CrewsInArrivalTunnel;                              // 0x4d0(0x10)
	TArray<struct Guid>                                          CrewsOnCooldown;                                   // 0x4e0(0x10)
	char                                                         pad0x208_KZQVO[0x208];                             // 0x4f0(0x208)
};


// Size 0x128 (Full Size[0x158] - InheritedSize[0x30]
class GameEventOnDemandArrivalTunnelWorkerBase: public AdventureOnDemandArrivalTunnelWorkerBase
{
public:
	float                                                        TriggerTunnelFailureTimeout;                       // 0x30(0x4)
	float                                                        MinRangeFromTarget;                                // 0x34(0x4)
	float                                                        MaxRangeFromTarget;                                // 0x38(0x4)
	float                                                        SubsequentCrewJoinRadiusModifier;                  // 0x3c(0x4)
	class UClass*                                                GameEventType;                                     // 0x40(0x8)
	char                                                         pad0xe0_YUEC7[0xe0];                               // 0x48(0xe0)
	class VoyageDescDataAsset*                                   LeaveTunnelVoyageDesc;                             // 0x128(0x8)
	char                                                         pad0x14_MJFTS[0x14];                               // 0x130(0x14)
	float                                                        RetryRequestEventFrequency;                        // 0x144(0x4)
	char                                                         pad0x10_1ONNV[0x10];                               // 0x148(0x10)
};


// Size 0x10 (Full Size[0x168] - InheritedSize[0x158]
class AIShipBattleGameEventOnDemandArrivalTunnelWorker: public GameEventOnDemandArrivalTunnelWorkerBase
{
public:
	char                                                         pad0x10_M0QR2[0x10];                               // 0x158(0x10)
};


// Size 0x30 (Full Size[0x188] - InheritedSize[0x158]
class IslandBasedGameEventOnDemandArrivalTunnelWorker: public GameEventOnDemandArrivalTunnelWorkerBase
{
public:
	bool                                                         UseSpawnDistanceFromIslandForResurfaceRadius;      // 0x158(0x1)
	char                                                         pad0x17_S1PNO[0x17];                               // 0x159(0x17)
	float                                                        ResurfaceMaxRadiusModifier;                        // 0x170(0x4)
	char                                                         pad0x14_ECMB2[0x14];                               // 0x174(0x14)
};


// Size 0x10 (Full Size[0x198] - InheritedSize[0x188]
class AggressiveGhostShipsEncounterOnDemandArrivalTunnelWorker: public IslandBasedGameEventOnDemandArrivalTunnelWorker
{
public:
	char                                                         pad0x10_D1M08[0x10];                               // 0x188(0x10)
};


// Size 0x10 (Full Size[0x198] - InheritedSize[0x188]
class AshenLordEventOnDemandArrivalTunnelWorker: public IslandBasedGameEventOnDemandArrivalTunnelWorker
{
public:
	char                                                         pad0x10_UT6I4[0x10];                               // 0x188(0x10)
};


// Size 0x18 (Full Size[0x1a0] - InheritedSize[0x188]
class ContendedResourceGameEventOnDemandArrivalTunnelWorker: public IslandBasedGameEventOnDemandArrivalTunnelWorker
{
public:
	char                                                         pad0x18_UA38H[0x18];                               // 0x188(0x18)
};


// Size 0x0 (Full Size[0x1a0] - InheritedSize[0x1a0]
class SeaFortGameEventOnDemandArrivalTunnelWorker: public ContendedResourceGameEventOnDemandArrivalTunnelWorker
{
public:
};


// Size 0x0 (Full Size[0x1a0] - InheritedSize[0x1a0]
class SunkenKingdomShrineGameEventOnDemandArrivalTunnelWorker: public ContendedResourceGameEventOnDemandArrivalTunnelWorker
{
public:
};


// Size 0x0 (Full Size[0x1a0] - InheritedSize[0x1a0]
class SunkenKingdomTreasuryGameEventOnDemandArrivalTunnelWorker: public ContendedResourceGameEventOnDemandArrivalTunnelWorker
{
public:
};


// Size 0x10 (Full Size[0x198] - InheritedSize[0x188]
class SkellyFortEventOnDemandArrivalTunnelWorker: public IslandBasedGameEventOnDemandArrivalTunnelWorker
{
public:
	char                                                         pad0x10_GUCT5[0x10];                               // 0x188(0x10)
};


// Size 0x30 (Full Size[0x188] - InheritedSize[0x158]
class SeaBasedGameEventOnDemandArrivalTunnelWorker: public GameEventOnDemandArrivalTunnelWorkerBase
{
public:
	float                                                        VacateOccupiedLocationTimer;                       // 0x158(0x4)
	char                                                         pad0x2c_KXMHZ[0x2c];                               // 0x15c(0x2c)
};


}