#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "AIActionFramework_Structs.h"


// Size 0x28 (Full Size[0xf0] - InheritedSize[0xc8]
class AIActionInstigatorComponent: public ActorComponent
{
public:
	TArray<class Class*>                                         CurrentRoles;                                      // 0xd0(0x10)
	class UClass*                                                InitialActivity;                                   // 0xe0(0x8)
	class UClass*                                                CurrentActivity;                                   // 0xe8(0x8)
};


// Size 0x58 (Full Size[0x120] - InheritedSize[0xc8]
class AIActionSpotComponent: public ActorComponent
{
public:
	TArray<class Class*>                                         SupportedRoles;                                    // 0xd0(0x10)
	TArray<class Class*>                                         SupportedActivities;                               // 0xe0(0x10)
	TArray<class Class*>                                         ContextTags;                                       // 0xf0(0x10)
	class UClass*                                                CustomAnimInstance;                                // 0x100(0x8)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class DockableRotationOverrideComponent: public ActorComponent
{
public:
	bool                                                         KeepOwnerRotationWhileDocked;                      // 0xd0(0x1)
};


