// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class BTNode: public Object
{
public:
	char                                                         pad0x8_DHZFR[0x8];                                 // 0x28(0x8)
	struct FString                                               NodeName;                                          // 0x30(0x10)
	class BehaviorTree*                                          TreeAsset;                                         // 0x40(0x8)
	class BTCompositeNode*                                       ParentNode;                                        // 0x48(0x8)
	char                                                         pad0x8_HBTRC[0x8];                                 // 0x50(0x8)
};


// Size 0x8 (Full Size[0x60] - InheritedSize[0x58]
class BTAuxiliaryNode: public BTNode
{
public:
	char                                                         pad0x8_S96FW[0x8];                                 // 0x58(0x8)
};


// Size 0x10 (Full Size[0x70] - InheritedSize[0x60]
class BTService: public BTAuxiliaryNode
{
public:
	float                                                        Interval;                                          // 0x60(0x4)
	float                                                        RandomDeviation;                                   // 0x64(0x4)
	bool                                                         bCallTickOnSearchStart;                            // 0x68(0x1)
	bool                                                         bRestartTimerOnEachActivation;                     // 0x68(0x1)
	char                                                         pad0x7_6X1PI[0x7];                                 // 0x69(0x7)
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class BTDecorator: public BTAuxiliaryNode
{
public:
	bool                                                         bInverseCondition;                                 // 0x60(0x1)
	char                                                         pad0x3_LZZAF[0x3];                                 // 0x61(0x3)
	byte                                                         FlowAbortMode;                                     // 0x64(0x1)
	char                                                         pad0x3_AXE44[0x3];                                 // 0x65(0x3)
};


// Size 0x28 (Full Size[0x90] - InheritedSize[0x68]
class BTDecorator_BlackboardBase: public BTDecorator
{
public:
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x68(0x28)
};


// Size 0x8 (Full Size[0x60] - InheritedSize[0x58]
class BTTaskNode: public BTNode
{
public:
	char                                                         pad0x8_E52GT[0x8];                                 // 0x58(0x8)
};


// Size 0x28 (Full Size[0x88] - InheritedSize[0x60]
class BTTask_BlackboardBase: public BTTaskNode
{
public:
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x60(0x28)
};


// Size 0x20 (Full Size[0xa8] - InheritedSize[0x88]
class BTTask_RunEQSQuery: public BTTask_BlackboardBase
{
public:
	class EnvQuery*                                              QueryTemplate;                                     // 0x88(0x8)
	TArray<struct EnvNamedValue>                                 QueryParams;                                       // 0x90(0x10)
	byte                                                         RunMode;                                           // 0xa0(0x1)
	char                                                         pad0x7_A2KF3[0x7];                                 // 0xa1(0x7)
};


// Size 0x8 (Full Size[0x90] - InheritedSize[0x88]
class BTTask_RotateToFaceBBEntry: public BTTask_BlackboardBase
{
public:
	float                                                        Precision;                                         // 0x88(0x4)
	char                                                         pad0x4_GURWW[0x4];                                 // 0x8c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnvQueryContext: public Object
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class EnvQueryNode: public Object
{
public:
	int                                                          VerNum;                                            // 0x28(0x4)
	char                                                         pad0x4_YLG2K[0x4];                                 // 0x2c(0x4)
};


// Size 0x28 (Full Size[0x58] - InheritedSize[0x30]
class EnvQueryGenerator: public EnvQueryNode
{
public:
	struct FString                                               OptionName;                                        // 0x30(0x10)
	bool                                                         NonShippingOnly;                                   // 0x40(0x1)
	char                                                         pad0x3_FQLY4[0x3];                                 // 0x41(0x3)
	struct FeatureFlag                                           Feature;                                           // 0x44(0xc)
	class UClass*                                                ItemType;                                          // 0x50(0x8)
};


// Size 0x140 (Full Size[0x170] - InheritedSize[0x30]
class EnvQueryTest: public EnvQueryNode
{
public:
	int                                                          TestOrder;                                         // 0x30(0x4)
	byte                                                         TestPurpose;                                       // 0x34(0x1)
	byte                                                         MultipleContextFilterOp;                           // 0x35(0x1)
	byte                                                         MultipleContextScoreOp;                            // 0x36(0x1)
	byte                                                         FilterType;                                        // 0x37(0x1)
	struct AIDataProviderBoolValue                               BoolValue;                                         // 0x38(0x30)
	struct AIDataProviderFloatValue                              FloatValueMin;                                     // 0x68(0x30)
	struct AIDataProviderFloatValue                              FloatValueMax;                                     // 0x98(0x30)
	char                                                         pad0x1_DUCBW[0x1];                                 // 0xc8(0x1)
	byte                                                         ScoringEquation;                                   // 0xc9(0x1)
	byte                                                         ClampMinType;                                      // 0xca(0x1)
	byte                                                         ClampMaxType;                                      // 0xcb(0x1)
	char                                                         pad0x4_IVN40[0x4];                                 // 0xcc(0x4)
	struct AIDataProviderFloatValue                              ScoreClampMin;                                     // 0xd0(0x30)
	struct AIDataProviderFloatValue                              ScoreClampMax;                                     // 0x100(0x30)
	struct AIDataProviderFloatValue                              ScoringFactor;                                     // 0x130(0x30)
	char                                                         pad0x8_GOQVG[0x8];                                 // 0x160(0x8)
	bool                                                         bWorkOnFloatValues;                                // 0x168(0x1)
	char                                                         pad0x7_1HWAI[0x7];                                 // 0x169(0x7)
};


// Size 0x90 (Full Size[0x4b8] - InheritedSize[0x428]
class AIController: public Controller
{
public:
	char                                                         pad0x28_2NPQA[0x28];                               // 0x428(0x28)
	bool                                                         bLOSflag;                                          // 0x450(0x1)
	bool                                                         bSkipExtraLOSChecks;                               // 0x450(0x1)
	bool                                                         bAllowStrafe;                                      // 0x450(0x1)
	bool                                                         bWantsPlayerState;                                 // 0x450(0x1)
	bool                                                         bDisableControlRotation;                           // 0x450(0x1)
	char                                                         pad0x7_RLTUV[0x7];                                 // 0x451(0x7)
	class PathFollowingComponent*                                PathFollowingComponent;                            // 0x458(0x8)
	class BrainComponent*                                        BrainComponent;                                    // 0x460(0x8)
	class AIPerceptionComponent*                                 PerceptionComponent;                               // 0x468(0x8)
	class PawnActionsComponent*                                  ActionsComp;                                       // 0x470(0x8)
	class BlackboardComponent*                                   Blackboard;                                        // 0x478(0x8)
	class GameplayTasksComponent*                                CachedGameplayTasksComponent;                      // 0x480(0x8)
	char                                                         pad0x10_W0UXA[0x10];                               // 0x488(0x10)
	char                                                         pad0x20_SY7UN[0x20];                               // 0x498(0x20)
};


// Size 0x1f0 (Full Size[0x2b8] - InheritedSize[0xc8]
class PathFollowingComponent: public ActorComponent
{
public:
	char                                                         pad0x58_CHC9P[0x58];                               // 0xc8(0x58)
	class NavMovementComponent*                                  MovementComp;                                      // 0x120(0x8)
	char                                                         pad0x8_EHMQ6[0x8];                                 // 0x128(0x8)
	class NavigationData*                                        MyNavData;                                         // 0x130(0x8)
	char                                                         pad0xbc_24H3B[0xbc];                               // 0x138(0xbc)
	bool                                                         bUseVisibilityTestsSimplification;                 // 0x1f4(0x1)
	char                                                         pad0xc3_OXS7G[0xc3];                               // 0x1f5(0xc3)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIResourceInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class AIAsyncTaskBlueprintProxy: public Object
{
public:
	char                                                         pad0x38_YQOZ4[0x38];                               // 0x28(0x38)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIBlueprintHelperLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x38 (Full Size[0x100] - InheritedSize[0xc8]
class PawnActionsComponent: public ActorComponent
{
public:
	class Pawn*                                                  ControlledPawn;                                    // 0xc8(0x8)
	TArray<struct PawnActionStack>                               ActionStacks;                                      // 0xd0(0x10)
	TArray<struct PawnActionEvent>                               ActionEvents;                                      // 0xe0(0x10)
	class PawnAction*                                            CurrentAction;                                     // 0xf0(0x8)
	char                                                         pad0x8_FO5Y2[0x8];                                 // 0xf8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIPerceptionListenerInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class BlackboardKeyType: public Object
{
public:
	char                                                         pad0x8_K1KAG[0x8];                                 // 0x28(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BehaviorTreeTypes: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GenericTeamAgentInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x4b8] - InheritedSize[0x4b8]
class DetourCrowdAIController: public AIController
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIDataProvider: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CustomDataProviderObject: public Object
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class AIDataProvider_QueryParamFromCustomObjectProperty: public AIDataProvider
{
public:
	struct CustomDataProviderObjectPropertySelector              ObjectProperty;                                    // 0x28(0x10)
	float                                                        FloatValue;                                        // 0x38(0x4)
	int                                                          IntValue;                                          // 0x3c(0x4)
	bool                                                         BoolValue;                                         // 0x40(0x1)
	char                                                         pad0x7_TJDHA[0x7];                                 // 0x41(0x7)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AIDataProvider_QueryParams: public AIDataProvider
{
public:
	struct FName                                                 ParamName;                                         // 0x28(0x8)
	float                                                        FloatValue;                                        // 0x30(0x4)
	int                                                          IntValue;                                          // 0x34(0x4)
	bool                                                         BoolValue;                                         // 0x38(0x1)
	char                                                         pad0x7_UPSZ8[0x7];                                 // 0x39(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIHotSpotManager: public Object
{
public:
};


// Size 0xb0 (Full Size[0xf0] - InheritedSize[0x40]
class AISystem: public AISystemBase
{
public:
	struct StringClassReference                                  PerceptionSystemClassName;                         // 0x40(0x10)
	struct StringClassReference                                  HotSpotManagerClassName;                           // 0x50(0x10)
	float                                                        AcceptanceRadius;                                  // 0x60(0x4)
	bool                                                         bFinishMoveOnGoalOverlap;                          // 0x64(0x1)
	bool                                                         bAcceptPartialPaths;                               // 0x65(0x1)
	bool                                                         bAllowStrafing;                                    // 0x66(0x1)
	bool                                                         bEnableBTAITasks;                                  // 0x67(0x1)
	class BehaviorTreeManager*                                   BehaviorTreeManager;                               // 0x68(0x8)
	class EnvQueryManager*                                       EnvironmentQueryManager;                           // 0x70(0x8)
	class AIPerceptionSystem*                                    PerceptionSystem;                                  // 0x78(0x8)
	TArray<class AIAsyncTaskBlueprintProxy*>                     AllProxyObjects;                                   // 0x80(0x10)
	class AIHotSpotManager*                                      HotSpotManager;                                    // 0x90(0x8)
	char                                                         pad0x58_LA49O[0x58];                               // 0x98(0x58)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class AISense: public Object
{
public:
	struct Color                                                 DebugDrawColor;                                    // 0x28(0x4)
	char                                                         pad0x4_KCONL[0x4];                                 // 0x2c(0x4)
	struct FString                                               DebugName;                                         // 0x30(0x10)
	float                                                        DefaultExpirationAge;                              // 0x40(0x4)
	byte                                                         NotifyType;                                        // 0x44(0x1)
	char                                                         pad0x3_Y7NHA[0x3];                                 // 0x45(0x3)
	bool                                                         bWantsNewPawnNotification;                         // 0x48(0x1)
	bool                                                         bAutoRegisterAllPawnsAsSources;                    // 0x48(0x1)
	char                                                         pad0x7_KMAO5[0x7];                                 // 0x49(0x7)
	class AIPerceptionSystem*                                    PerceptionSystemInstance;                          // 0x50(0x8)
	char                                                         pad0x30_O3CP4[0x30];                               // 0x58(0x30)
};


// Size 0x100 (Full Size[0x128] - InheritedSize[0x28]
class AIPerceptionSystem: public Object
{
public:
	char                                                         pad0x58_5K1X0[0x58];                               // 0x28(0x58)
	TArray<class AISense*>                                       Senses;                                            // 0x80(0x10)
	float                                                        PerceptionAgingRate;                               // 0x90(0x4)
	char                                                         pad0x94_97H7M[0x94];                               // 0x94(0x94)
};


// Size 0x100 (Full Size[0x1c8] - InheritedSize[0xc8]
class AIPerceptionComponent: public ActorComponent
{
public:
	float                                                        HearingRange;                                      // 0xc8(0x4)
	float                                                        LoSHearingRange;                                   // 0xcc(0x4)
	float                                                        SightRadius;                                       // 0xd0(0x4)
	float                                                        LoseSightRadius;                                   // 0xd4(0x4)
	float                                                        PeripheralVisionAngle;                             // 0xd8(0x4)
	char                                                         pad0x4_1NNNI[0x4];                                 // 0xdc(0x4)
	TArray<class AISenseConfig*>                                 SensesConfig;                                      // 0xe0(0x10)
	class UClass*                                                DominantSense;                                     // 0xf0(0x8)
	char                                                         pad0x10_EPTCI[0x10];                               // 0xf8(0x10)
	class AIController*                                          AIOwner;                                           // 0x108(0x8)
	char                                                         pad0x80_UJVEX[0x80];                               // 0x110(0x80)
	char                                                         pad0x38_JNE0T[0x38];                               // 0x190(0x38)
};


// Size 0x18 (Full Size[0xe0] - InheritedSize[0xc8]
class AIPerceptionStimuliSourceComponent: public ActorComponent
{
public:
	bool                                                         bAutoRegisterAsSource;                             // 0xc8(0x1)
	char                                                         pad0x7_GYVA3[0x7];                                 // 0xc9(0x7)
	TArray<class Class*>                                         RegisterAsSourceForSenses;                         // 0xd0(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AIResource_Movement: public GameplayTaskResource
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AIResource_Logic: public GameplayTaskResource
{
public:
};


// Size 0x28 (Full Size[0xb0] - InheritedSize[0x88]
class AISense_Blueprint: public AISense
{
public:
	class UClass*                                                ListenerDataType;                                  // 0x88(0x8)
	TArray<class AIPerceptionComponent*>                         ListenerContainer;                                 // 0x90(0x10)
	TArray<class AISenseEvent*>                                  UnprocessedEvents;                                 // 0xa0(0x10)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class AISense_Damage: public AISense
{
public:
	TArray<struct AIDamageEvent>                                 RegisteredEvents;                                  // 0x88(0x10)
};


// Size 0x98 (Full Size[0x120] - InheritedSize[0x88]
class AISense_Hearing: public AISense
{
public:
	int                                                          MaxNoisesPerTick;                                  // 0x88(0x4)
	int                                                          MaxNoisesStored;                                   // 0x8c(0x4)
	char                                                         pad0x8_BAWCI[0x8];                                 // 0x90(0x8)
	TArray<struct AINoiseEvent>                                  NoiseEventsArrayA;                                 // 0x98(0x10)
	TArray<struct AINoiseEvent>                                  NoiseEventsArrayB;                                 // 0xa8(0x10)
	char                                                         pad0x10_2A18M[0x10];                               // 0xb8(0x10)
	float                                                        SpeedOfSoundSq;                                    // 0xc8(0x4)
	char                                                         pad0x54_BUY7G[0x54];                               // 0xcc(0x54)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class AISense_Prediction: public AISense
{
public:
	TArray<struct AIPredictionEvent>                             RegisteredEvents;                                  // 0x88(0x10)
};


// Size 0xc8 (Full Size[0x150] - InheritedSize[0x88]
class AISense_Sight: public AISense
{
public:
	char                                                         pad0xb0_L2NAE[0xb0];                               // 0x88(0xb0)
	int                                                          MaxTracesPerTick;                                  // 0x138(0x4)
	float                                                        HighImportanceQueryDistanceThreshold;              // 0x13c(0x4)
	char                                                         pad0x4_RPFSF[0x4];                                 // 0x140(0x4)
	float                                                        MaxQueryImportance;                                // 0x144(0x4)
	float                                                        SightLimitQueryImportance;                         // 0x148(0x4)
	char                                                         pad0x4_3GRWM[0x4];                                 // 0x14c(0x4)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class AISense_Team: public AISense
{
public:
	TArray<struct AITeamStimulusEvent>                           RegisteredEvents;                                  // 0x88(0x10)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class AISense_Touch: public AISense
{
public:
	TArray<struct AITouchEvent>                                  RegisteredEvents;                                  // 0x88(0x10)
};


// Size 0x0 (Full Size[0xa8] - InheritedSize[0xa8]
class AISenseBlueprintListener: public UserDefinedStruct
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class AISenseConfig: public Object
{
public:
	float                                                        MaxAge;                                            // 0x28(0x4)
	bool                                                         bStartsEnabled;                                    // 0x2c(0x1)
	char                                                         pad0x3_PXXGV[0x3];                                 // 0x2d(0x3)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class AISenseConfig_Blueprint: public AISenseConfig
{
public:
	class UClass*                                                Implementation;                                    // 0x30(0x8)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class AISenseConfig_Damage: public AISenseConfig
{
public:
	class UClass*                                                Implementation;                                    // 0x30(0x8)
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class AISenseConfig_Hearing: public AISenseConfig
{
public:
	class UClass*                                                Implementation;                                    // 0x30(0x8)
	float                                                        HearingRange;                                      // 0x38(0x4)
	float                                                        LoSHearingRange;                                   // 0x3c(0x4)
	bool                                                         bUseLoSHearing;                                    // 0x40(0x1)
	char                                                         pad0x3_XFXL0[0x3];                                 // 0x41(0x3)
	struct AISenseAffiliationFilter                              DetectionByAffiliation;                            // 0x44(0x4)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class AISenseConfig_Prediction: public AISenseConfig
{
public:
};


// Size 0x20 (Full Size[0x50] - InheritedSize[0x30]
class AISenseConfig_Sight: public AISenseConfig
{
public:
	class UClass*                                                Implementation;                                    // 0x30(0x8)
	float                                                        SightRadius;                                       // 0x38(0x4)
	float                                                        LoseSightRadius;                                   // 0x3c(0x4)
	float                                                        PeripheralVisionAngleDegrees;                      // 0x40(0x4)
	struct AISenseAffiliationFilter                              DetectionByAffiliation;                            // 0x44(0x4)
	float                                                        AutoSuccessRangeFromLastSeenLocation;              // 0x48(0x4)
	char                                                         pad0x4_EOD72[0x4];                                 // 0x4c(0x4)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class AISenseConfig_Team: public AISenseConfig
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class AISenseConfig_Touch: public AISenseConfig
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AISenseEvent: public Object
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class AISenseEvent_Damage: public AISenseEvent
{
public:
	struct AIDamageEvent                                         Event;                                             // 0x28(0x30)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class AISenseEvent_Hearing: public AISenseEvent
{
public:
	struct AINoiseEvent                                          Event;                                             // 0x28(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AISightTargetInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x60] - InheritedSize[0x58]
class AITask: public GameplayTask
{
public:
	class AIController*                                          OwnerController;                                   // 0x58(0x8)
};


// Size 0x50 (Full Size[0xb0] - InheritedSize[0x60]
class AITask_MoveTo: public AITask
{
public:
	char                                                         pad0x20_4FLXA[0x20];                               // 0x60(0x20)
	struct Vector                                                MoveGoalLocation;                                  // 0x80(0xc)
	char                                                         pad0xc_631RQ[0xc];                                 // 0x8c(0xc)
	class Actor*                                                 MoveGoalActor;                                     // 0x98(0x8)
	float                                                        MoveAcceptanceRadius;                              // 0xa0(0x4)
	bool                                                         bShouldStopOnOverlap;                              // 0xa4(0x1)
	bool                                                         bShouldAcceptPartialPath;                          // 0xa5(0x1)
	bool                                                         bShouldUsePathfinding;                             // 0xa6(0x1)
	char                                                         pad0x9_C1QG3[0x9];                                 // 0xa7(0x9)
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class BrainComponent: public ActorComponent
{
public:
	char                                                         pad0x8_L27QC[0x8];                                 // 0xc8(0x8)
	class BlackboardComponent*                                   BlackboardComp;                                    // 0xd0(0x8)
	class AIController*                                          AIOwner;                                           // 0xd8(0x8)
	char                                                         pad0x48_MT81G[0x48];                               // 0xe0(0x48)
};


// Size 0x160 (Full Size[0x288] - InheritedSize[0x128]
class BehaviorTreeComponent: public BrainComponent
{
public:
	char                                                         pad0x20_YYJOH[0x20];                               // 0x128(0x20)
	TArray<class BTNode*>                                        NodeInstances;                                     // 0x148(0x10)
	char                                                         pad0x130_91545[0x130];                             // 0x158(0x130)
};


// Size 0x30 (Full Size[0x88] - InheritedSize[0x58]
class BTCompositeNode: public BTNode
{
public:
	TArray<struct BTCompositeChild>                              Children;                                          // 0x58(0x10)
	TArray<class BTService*>                                     Services;                                          // 0x68(0x10)
	char                                                         pad0x10_UTYI6[0x10];                               // 0x78(0x10)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class BehaviorTree: public Object
{
public:
	class BTCompositeNode*                                       RootNode;                                          // 0x28(0x8)
	class BlackboardData*                                        BlackboardAsset;                                   // 0x30(0x8)
	TArray<class BTDecorator*>                                   RootDecorators;                                    // 0x38(0x10)
	TArray<struct BTDecoratorLogic>                              RootDecoratorOps;                                  // 0x48(0x10)
	char                                                         pad0x8_DZ4KJ[0x8];                                 // 0x58(0x8)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class BehaviorTreeManager: public Object
{
public:
	int                                                          MaxDebuggerSteps;                                  // 0x28(0x4)
	char                                                         pad0x4_XE5T7[0x4];                                 // 0x2c(0x4)
	TArray<struct BehaviorTreeTemplateInfo>                      LoadedTemplates;                                   // 0x30(0x10)
	TArray<class BehaviorTreeComponent*>                         ActiveComponents;                                  // 0x40(0x10)
};


// Size 0x20 (Full Size[0x50] - InheritedSize[0x30]
class BlackboardKeyType_Enum: public BlackboardKeyType
{
public:
	class Enum*                                                  EnumType;                                          // 0x30(0x8)
	struct FString                                               EnumName;                                          // 0x38(0x10)
	bool                                                         bIsEnumNameValid;                                  // 0x48(0x1)
	char                                                         pad0x7_3ZYV1[0x7];                                 // 0x49(0x7)
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class BlackboardKeyType_NativeEnum: public BlackboardKeyType
{
public:
	struct FString                                               EnumName;                                          // 0x30(0x10)
	class Enum*                                                  EnumType;                                          // 0x40(0x8)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class BlackboardData: public DataAsset
{
public:
	class BlackboardData*                                        Parent;                                            // 0x28(0x8)
	TArray<struct BlackboardEntry>                               Keys;                                              // 0x30(0x10)
	bool                                                         bHasSynchronizedKeys;                              // 0x40(0x1)
	char                                                         pad0x7_M3N47[0x7];                                 // 0x41(0x7)
};


// Size 0x148 (Full Size[0x210] - InheritedSize[0xc8]
class BlackboardComponent: public ActorComponent
{
public:
	class BrainComponent*                                        BrainComp;                                         // 0xc8(0x8)
	class BlackboardData*                                        BlackboardAsset;                                   // 0xd0(0x8)
	char                                                         pad0x20_RMOYA[0x20];                               // 0xd8(0x20)
	TArray<class BlackboardKeyType*>                             KeyInstances;                                      // 0xf8(0x10)
	char                                                         pad0x108_53IZL[0x108];                             // 0x108(0x108)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class BlackboardKeyType_Bool: public BlackboardKeyType
{
public:
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class BlackboardKeyType_Class: public BlackboardKeyType
{
public:
	class UClass*                                                BaseClass;                                         // 0x30(0x8)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class BlackboardKeyType_Float: public BlackboardKeyType
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class BlackboardKeyType_Int: public BlackboardKeyType
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class BlackboardKeyType_Name: public BlackboardKeyType
{
public:
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class BlackboardKeyType_Object: public BlackboardKeyType
{
public:
	class UClass*                                                BaseClass;                                         // 0x30(0x8)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class BlackboardKeyType_Rotator: public BlackboardKeyType
{
public:
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class BlackboardKeyType_String: public BlackboardKeyType
{
public:
	struct FString                                               StringValue;                                       // 0x30(0x10)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class BlackboardKeyType_Vector: public BlackboardKeyType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BTFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x30 (Full Size[0xc0] - InheritedSize[0x90]
class BTDecorator_Blackboard: public BTDecorator_BlackboardBase
{
public:
	int                                                          IntValue;                                          // 0x90(0x4)
	float                                                        FloatValue;                                        // 0x94(0x4)
	struct FString                                               StringValue;                                       // 0x98(0x10)
	struct FString                                               CachedDescription;                                 // 0xa8(0x10)
	byte                                                         OperationType;                                     // 0xb8(0x1)
	byte                                                         NotifyObserver;                                    // 0xb9(0x1)
	char                                                         pad0x6_LQX1S[0x6];                                 // 0xba(0x6)
};


// Size 0x0 (Full Size[0xc0] - InheritedSize[0xc0]
class BTDecorator_ConditionalLoop: public BTDecorator_Blackboard
{
public:
};


// Size 0x8 (Full Size[0x98] - InheritedSize[0x90]
class BTDecorator_IsAtLocation: public BTDecorator_BlackboardBase
{
public:
	float                                                        AcceptableRadius;                                  // 0x90(0x4)
	bool                                                         bUseNavAgentGoalLocation;                          // 0x94(0x1)
	char                                                         pad0x3_IGTNJ[0x3];                                 // 0x95(0x3)
};


// Size 0x8 (Full Size[0x98] - InheritedSize[0x90]
class BTDecorator_IsBBEntryOfClass: public BTDecorator_BlackboardBase
{
public:
	class UClass*                                                TestClass;                                         // 0x90(0x8)
};


// Size 0x38 (Full Size[0xa0] - InheritedSize[0x68]
class BTDecorator_BlueprintBase: public BTDecorator
{
public:
	class AIController*                                          AIOwner;                                           // 0x68(0x8)
	class Actor*                                                 ActorOwner;                                        // 0x70(0x8)
	TArray<struct FName>                                         ObservedKeyNames;                                  // 0x78(0x10)
	char                                                         pad0x10_49QPA[0x10];                               // 0x88(0x10)
	bool                                                         bShowPropertyDetails;                              // 0x98(0x1)
	bool                                                         bCheckConditionOnlyBlackBoardChanges;              // 0x98(0x1)
	bool                                                         bIsObservingBB;                                    // 0x98(0x1)
	char                                                         pad0x7_KJKBR[0x7];                                 // 0x99(0x7)
};


// Size 0x68 (Full Size[0xd0] - InheritedSize[0x68]
class BTDecorator_CheckGameplayTagsOnActor: public BTDecorator
{
public:
	struct BlackboardKeySelector                                 ActorToCheck;                                      // 0x68(0x28)
	byte                                                         TagsToMatch;                                       // 0x90(0x1)
	char                                                         pad0x7_BDLD7[0x7];                                 // 0x91(0x7)
	struct GameplayTagContainer                                  GameplayTags;                                      // 0x98(0x28)
	struct FString                                               CachedDescription;                                 // 0xc0(0x10)
};


// Size 0x58 (Full Size[0xc0] - InheritedSize[0x68]
class BTDecorator_CompareBBEntries: public BTDecorator
{
public:
	byte                                                         Operator;                                          // 0x68(0x1)
	char                                                         pad0x7_DWX6Z[0x7];                                 // 0x69(0x7)
	struct BlackboardKeySelector                                 BlackboardKeyA;                                    // 0x70(0x28)
	struct BlackboardKeySelector                                 BlackboardKeyB;                                    // 0x98(0x28)
};


// Size 0x88 (Full Size[0xf0] - InheritedSize[0x68]
class BTDecorator_ConeCheck: public BTDecorator
{
public:
	float                                                        ConeHalfAngle;                                     // 0x68(0x4)
	char                                                         pad0x4_F8SAD[0x4];                                 // 0x6c(0x4)
	struct BlackboardKeySelector                                 ConeOrigin;                                        // 0x70(0x28)
	struct BlackboardKeySelector                                 ConeDirection;                                     // 0x98(0x28)
	struct BlackboardKeySelector                                 Observed;                                          // 0xc0(0x28)
	char                                                         pad0x8_JHNK9[0x8];                                 // 0xe8(0x8)
};


// Size 0x8 (Full Size[0x70] - InheritedSize[0x68]
class BTDecorator_Cooldown: public BTDecorator
{
public:
	float                                                        CoolDownTime;                                      // 0x68(0x4)
	char                                                         pad0x4_RQ87V[0x4];                                 // 0x6c(0x4)
};


// Size 0x60 (Full Size[0xc8] - InheritedSize[0x68]
class BTDecorator_DoesPathExist: public BTDecorator
{
public:
	struct BlackboardKeySelector                                 BlackboardKeyA;                                    // 0x68(0x28)
	struct BlackboardKeySelector                                 BlackboardKeyB;                                    // 0x90(0x28)
	bool                                                         bUseSelf;                                          // 0xb8(0x1)
	char                                                         pad0x3_KW00J[0x3];                                 // 0xb9(0x3)
	byte                                                         PathQueryType;                                     // 0xbc(0x1)
	char                                                         pad0x3_4JKJ2[0x3];                                 // 0xbd(0x3)
	class UClass*                                                FilterClass;                                       // 0xc0(0x8)
};


// Size 0x0 (Full Size[0x68] - InheritedSize[0x68]
class BTDecorator_ForceSuccess: public BTDecorator
{
public:
};


// Size 0x60 (Full Size[0xc8] - InheritedSize[0x68]
class BTDecorator_KeepInCone: public BTDecorator
{
public:
	float                                                        ConeHalfAngle;                                     // 0x68(0x4)
	char                                                         pad0x4_P8PVH[0x4];                                 // 0x6c(0x4)
	struct BlackboardKeySelector                                 ConeOrigin;                                        // 0x70(0x28)
	struct BlackboardKeySelector                                 Observed;                                          // 0x98(0x28)
	bool                                                         bUseSelfAsOrigin;                                  // 0xc0(0x1)
	bool                                                         bUseSelfAsObserved;                                // 0xc0(0x1)
	char                                                         pad0x7_ECUSP[0x7];                                 // 0xc1(0x7)
};


// Size 0x8 (Full Size[0x70] - InheritedSize[0x68]
class BTDecorator_Loop: public BTDecorator
{
public:
	int                                                          NumLoops;                                          // 0x68(0x4)
	bool                                                         bInfiniteLoop;                                     // 0x6c(0x1)
	char                                                         pad0x3_IJ2Z3[0x3];                                 // 0x6d(0x3)
};


// Size 0x0 (Full Size[0x68] - InheritedSize[0x68]
class BTDecorator_ReachedMoveGoal: public BTDecorator
{
public:
};


// Size 0x10 (Full Size[0x78] - InheritedSize[0x68]
class BTDecorator_SetTagCooldown: public BTDecorator
{
public:
	struct GameplayTag                                           CooldownTag;                                       // 0x68(0x8)
	float                                                        CoolDownDuration;                                  // 0x70(0x4)
	bool                                                         bAddToExistingDuration;                            // 0x74(0x1)
	char                                                         pad0x3_CW7RV[0x3];                                 // 0x75(0x3)
};


// Size 0x10 (Full Size[0x78] - InheritedSize[0x68]
class BTDecorator_TagCooldown: public BTDecorator
{
public:
	struct GameplayTag                                           CooldownTag;                                       // 0x68(0x8)
	float                                                        CoolDownDuration;                                  // 0x70(0x4)
	bool                                                         bAddToExistingDuration;                            // 0x74(0x1)
	bool                                                         bActivatesCooldown;                                // 0x75(0x1)
	char                                                         pad0x2_46ARV[0x2];                                 // 0x76(0x2)
};


// Size 0x8 (Full Size[0x70] - InheritedSize[0x68]
class BTDecorator_TimeLimit: public BTDecorator
{
public:
	float                                                        TimeLimit;                                         // 0x68(0x4)
	char                                                         pad0x4_8WPV2[0x4];                                 // 0x6c(0x4)
};


// Size 0x28 (Full Size[0x98] - InheritedSize[0x70]
class BTService_BlackboardBase: public BTService
{
public:
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x70(0x28)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class BTService_DefaultFocus: public BTService_BlackboardBase
{
public:
	byte                                                         FocusPriority;                                     // 0x98(0x1)
	char                                                         pad0x7_4H1GC[0x7];                                 // 0x99(0x7)
};


// Size 0x28 (Full Size[0x98] - InheritedSize[0x70]
class BTService_BlueprintBase: public BTService
{
public:
	class AIController*                                          AIOwner;                                           // 0x70(0x8)
	class Actor*                                                 ActorOwner;                                        // 0x78(0x8)
	char                                                         pad0x10_RQVFT[0x10];                               // 0x80(0x10)
	bool                                                         bShowPropertyDetails;                              // 0x90(0x1)
	bool                                                         bShowEventDetails;                                 // 0x90(0x1)
	char                                                         pad0x7_DT1XP[0x7];                                 // 0x91(0x7)
};


// Size 0x0 (Full Size[0x88] - InheritedSize[0x88]
class BTComposite_Selector: public BTCompositeNode
{
public:
};


// Size 0x0 (Full Size[0x88] - InheritedSize[0x88]
class BTComposite_Sequence: public BTCompositeNode
{
public:
};


// Size 0x8 (Full Size[0x90] - InheritedSize[0x88]
class BTComposite_SimpleParallel: public BTCompositeNode
{
public:
	byte                                                         FinishMode;                                        // 0x88(0x1)
	char                                                         pad0x7_0NEE4[0x7];                                 // 0x89(0x7)
};


// Size 0x8 (Full Size[0x90] - InheritedSize[0x88]
class BTTask_MoveDirectlyToward: public BTTask_BlackboardBase
{
public:
	float                                                        AcceptableRadius;                                  // 0x88(0x4)
	bool                                                         bDisablePathUpdateOnGoalLocationChange;            // 0x8c(0x1)
	bool                                                         bProjectVectorGoalToNavigation;                    // 0x8c(0x1)
	bool                                                         bAllowStrafe;                                      // 0x8c(0x1)
	bool                                                         bStopOnOverlap;                                    // 0x8c(0x1)
	char                                                         pad0x3_OCSA6[0x3];                                 // 0x8d(0x3)
};


// Size 0x18 (Full Size[0xa0] - InheritedSize[0x88]
class BTTask_MoveTo: public BTTask_BlackboardBase
{
public:
	float                                                        AcceptableRadius;                                  // 0x88(0x4)
	char                                                         pad0x4_HHSHO[0x4];                                 // 0x8c(0x4)
	class UClass*                                                FilterClass;                                       // 0x90(0x8)
	bool                                                         bAllowStrafe;                                      // 0x98(0x1)
	bool                                                         bAllowPartialPath;                                 // 0x98(0x1)
	bool                                                         bStopOnOverlap;                                    // 0x98(0x1)
	char                                                         pad0x7_MRL57[0x7];                                 // 0x99(0x7)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class EnvQueryItemType: public Object
{
public:
	char                                                         pad0x8_YOAMM[0x8];                                 // 0x28(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnvQueryTypes: public Object
{
public:
};


// Size 0x30 (Full Size[0x90] - InheritedSize[0x60]
class BTTask_BlueprintBase: public BTTaskNode
{
public:
	class AIController*                                          AIOwner;                                           // 0x60(0x8)
	class Actor*                                                 ActorOwner;                                        // 0x68(0x8)
	char                                                         pad0x18_01AXG[0x18];                               // 0x70(0x18)
	bool                                                         bShowPropertyDetails;                              // 0x88(0x1)
	char                                                         pad0x7_KSIR1[0x7];                                 // 0x89(0x7)
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class BTTask_MakeNoise: public BTTaskNode
{
public:
	float                                                        Loudnes;                                           // 0x60(0x4)
	char                                                         pad0x4_0PVL8[0x4];                                 // 0x64(0x4)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class PawnAction: public Object
{
public:
	class PawnAction*                                            ChildAction;                                       // 0x28(0x8)
	class PawnAction*                                            ParentAction;                                      // 0x30(0x8)
	class PawnActionsComponent*                                  OwnerComponent;                                    // 0x38(0x8)
	class Object*                                                Instigator;                                        // 0x40(0x8)
	class BrainComponent*                                        BrainComp;                                         // 0x48(0x8)
	char                                                         pad0x28_XT8UE[0x28];                               // 0x50(0x28)
	bool                                                         bAllowNewSameClassInstance;                        // 0x78(0x1)
	bool                                                         bReplaceActiveSameClassInstance;                   // 0x78(0x1)
	bool                                                         bShouldPauseMovement;                              // 0x78(0x1)
	char                                                         pad0x17_9HEWT[0x17];                               // 0x79(0x17)
};


// Size 0x0 (Full Size[0x60] - InheritedSize[0x60]
class BTTask_PawnActionBase: public BTTaskNode
{
public:
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class BTTask_PushPawnAction: public BTTask_PawnActionBase
{
public:
	class PawnAction*                                            Action;                                            // 0x60(0x8)
};


// Size 0x38 (Full Size[0x98] - InheritedSize[0x60]
class BTTask_PlayAnimation: public BTTaskNode
{
public:
	class AnimationAsset*                                        AnimationToPlay;                                   // 0x60(0x8)
	bool                                                         bLooping;                                          // 0x68(0x1)
	bool                                                         bNonBlocking;                                      // 0x68(0x1)
	char                                                         pad0x7_40Q5I[0x7];                                 // 0x69(0x7)
	class BehaviorTreeComponent*                                 MyOwnerComp;                                       // 0x70(0x8)
	class SkeletalMeshComponent*                                 CachedSkelMesh;                                    // 0x78(0x8)
	char                                                         pad0x18_FP66S[0x18];                               // 0x80(0x18)
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class BTTask_PlaySound: public BTTaskNode
{
public:
	class SoundCue*                                              SoundToPlay;                                       // 0x60(0x8)
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class BTTask_RunBehavior: public BTTaskNode
{
public:
	class BehaviorTree*                                          BehaviorAsset;                                     // 0x60(0x8)
};


// Size 0x18 (Full Size[0x78] - InheritedSize[0x60]
class BTTask_RunBehaviorDynamic: public BTTaskNode
{
public:
	struct GameplayTag                                           InjectionTag;                                      // 0x60(0x8)
	class BehaviorTree*                                          DefaultBehaviorAsset;                              // 0x68(0x8)
	class BehaviorTree*                                          BehaviorAsset;                                     // 0x70(0x8)
};


// Size 0x10 (Full Size[0x70] - InheritedSize[0x60]
class BTTask_SetTagCooldown: public BTTaskNode
{
public:
	struct GameplayTag                                           CooldownTag;                                       // 0x60(0x8)
	bool                                                         bAddToExistingDuration;                            // 0x68(0x1)
	char                                                         pad0x3_5POZD[0x3];                                 // 0x69(0x3)
	float                                                        CoolDownDuration;                                  // 0x6c(0x4)
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class BTTask_Wait: public BTTaskNode
{
public:
	float                                                        WaitTime;                                          // 0x60(0x4)
	float                                                        RandomDeviation;                                   // 0x64(0x4)
};


// Size 0x28 (Full Size[0x90] - InheritedSize[0x68]
class BTTask_WaitBlackboardTime: public BTTask_Wait
{
public:
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x68(0x28)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CrowdAgentInterface: public Interface
{
public:
};


// Size 0xb8 (Full Size[0xe0] - InheritedSize[0x28]
class CrowdManager: public Object
{
public:
	class NavigationData*                                        MyNavData;                                         // 0x28(0x8)
	TArray<struct CrowdAvoidanceConfig>                          AvoidanceConfig;                                   // 0x30(0x10)
	TArray<struct CrowdAvoidanceSamplingPattern>                 SamplingPatterns;                                  // 0x40(0x10)
	int                                                          MaxAgents;                                         // 0x50(0x4)
	float                                                        MaxAgentRadius;                                    // 0x54(0x4)
	int                                                          MaxAvoidedAgents;                                  // 0x58(0x4)
	int                                                          MaxAvoidedWalls;                                   // 0x5c(0x4)
	float                                                        NavmeshCheckInterval;                              // 0x60(0x4)
	float                                                        PathOptimizationInterval;                          // 0x64(0x4)
	bool                                                         bResolveCollisions;                                // 0x68(0x1)
	char                                                         pad0x77_C62GI[0x77];                               // 0x69(0x77)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EnvQuery: public Object
{
public:
	TArray<class EnvQueryOption*>                                Options;                                           // 0x28(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class EnvQueryContext_BlueprintBase: public EnvQueryContext
{
public:
	char                                                         pad0x8_5VZ9X[0x8];                                 // 0x28(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnvQueryContext_Item: public EnvQueryContext
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnvQueryContext_Querier: public EnvQueryContext
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class VisualLoggerExtension: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnvQueryDebugHelpers: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EQSQueryResultSourceInterface: public Interface
{
public:
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class EnvQueryInstanceBlueprintWrapper: public Object
{
public:
	char                                                         pad0x8_WO9YE[0x8];                                 // 0x28(0x8)
	int                                                          QueryID;                                           // 0x30(0x4)
	char                                                         pad0x1c_O3FBZ[0x1c];                               // 0x34(0x1c)
	class UClass*                                                ItemType;                                          // 0x50(0x8)
	int                                                          OptionIndex;                                       // 0x58(0x4)
	char                                                         pad0x4_6A7BF[0x4];                                 // 0x5c(0x4)
	char                                                         pad0x10_G9N8H[0x10];                               // 0x60(0x10)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class EnvQueryItemType_VectorBase: public EnvQueryItemType
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class EnvQueryItemType_ActorBase: public EnvQueryItemType_VectorBase
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class EnvQueryItemType_Actor: public EnvQueryItemType_ActorBase
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class EnvQueryItemType_Direction: public EnvQueryItemType_VectorBase
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class EnvQueryItemType_Point: public EnvQueryItemType_VectorBase
{
public:
};


// Size 0xe8 (Full Size[0x110] - InheritedSize[0x28]
class EnvQueryManager: public Object
{
public:
	char                                                         pad0x70_KI0L9[0x70];                               // 0x28(0x70)
	TArray<struct EnvQueryInstanceCache>                         InstanceCache;                                     // 0x98(0x10)
	TArray<class EnvQueryContext*>                               LocalContexts;                                     // 0xa8(0x10)
	char                                                         pad0x58_JXBCP[0x58];                               // 0xb8(0x58)
};


// Size 0x40 (Full Size[0x98] - InheritedSize[0x58]
class EnvQueryGenerator_ActorsOfClass: public EnvQueryGenerator
{
public:
	struct AIDataProviderFloatValue                              SearchRadius;                                      // 0x58(0x30)
	class UClass*                                                SearchedActorClass;                                // 0x88(0x8)
	class UClass*                                                SearchCenter;                                      // 0x90(0x8)
};


// Size 0x50 (Full Size[0xa8] - InheritedSize[0x58]
class EnvQueryGenerator_BlueprintBase: public EnvQueryGenerator
{
public:
	struct FText                                                 GeneratorsActionDescription;                       // 0x58(0x38)
	class UClass*                                                Context;                                           // 0x90(0x8)
	class UClass*                                                GeneratedItemType;                                 // 0x98(0x8)
	char                                                         pad0x8_R8KIJ[0x8];                                 // 0xa0(0x8)
};


// Size 0x18 (Full Size[0x70] - InheritedSize[0x58]
class EnvQueryGenerator_Composite: public EnvQueryGenerator
{
public:
	TArray<class EnvQueryGenerator*>                             Generators;                                        // 0x58(0x10)
	bool                                                         bHasMatchingItemType;                              // 0x68(0x1)
	char                                                         pad0x7_85ZER[0x7];                                 // 0x69(0x7)
};


// Size 0x40 (Full Size[0x98] - InheritedSize[0x58]
class EnvQueryGenerator_ProjectedPoints: public EnvQueryGenerator
{
public:
	struct EnvTraceData                                          ProjectionData;                                    // 0x58(0x40)
};


// Size 0x128 (Full Size[0x1c0] - InheritedSize[0x98]
class EnvQueryGenerator_Donut: public EnvQueryGenerator_ProjectedPoints
{
public:
	struct AIDataProviderFloatValue                              InnerRadius;                                       // 0x98(0x30)
	struct AIDataProviderFloatValue                              OuterRadius;                                       // 0xc8(0x30)
	struct AIDataProviderIntValue                                NumberOfRings;                                     // 0xf8(0x30)
	struct AIDataProviderIntValue                                PointsPerRing;                                     // 0x128(0x30)
	struct EnvDirection                                          ArcDirection;                                      // 0x158(0x20)
	struct AIDataProviderFloatValue                              ArcAngle;                                          // 0x178(0x30)
	bool                                                         RandomiseRadius;                                   // 0x1a8(0x1)
	char                                                         pad0x7_GNRMO[0x7];                                 // 0x1a9(0x7)
	class UClass*                                                Center;                                            // 0x1b0(0x8)
	bool                                                         bDefineArc;                                        // 0x1b8(0x1)
	char                                                         pad0x7_PMFN6[0x7];                                 // 0x1b9(0x7)
};


// Size 0x108 (Full Size[0x1a0] - InheritedSize[0x98]
class EnvQueryGenerator_OnCircle: public EnvQueryGenerator_ProjectedPoints
{
public:
	struct AIDataProviderFloatValue                              CircleRadius;                                      // 0x98(0x30)
	struct AIDataProviderFloatValue                              SpaceBetween;                                      // 0xc8(0x30)
	struct EnvDirection                                          ArcDirection;                                      // 0xf8(0x20)
	struct AIDataProviderFloatValue                              ArcAngle;                                          // 0x118(0x30)
	float                                                        AngleRadians;                                      // 0x148(0x4)
	char                                                         pad0x4_TRZJD[0x4];                                 // 0x14c(0x4)
	class UClass*                                                CircleCenter;                                      // 0x150(0x8)
	struct EnvTraceData                                          TraceData;                                         // 0x158(0x40)
	bool                                                         bDefineArc;                                        // 0x198(0x1)
	char                                                         pad0x7_9QVNM[0x7];                                 // 0x199(0x7)
};


// Size 0x68 (Full Size[0x100] - InheritedSize[0x98]
class EnvQueryGenerator_SimpleGrid: public EnvQueryGenerator_ProjectedPoints
{
public:
	struct AIDataProviderFloatValue                              GridSize;                                          // 0x98(0x30)
	struct AIDataProviderFloatValue                              SpaceBetween;                                      // 0xc8(0x30)
	class UClass*                                                GenerateAround;                                    // 0xf8(0x8)
};


// Size 0x68 (Full Size[0x168] - InheritedSize[0x100]
class EnvQueryGenerator_PathingGrid: public EnvQueryGenerator_SimpleGrid
{
public:
	struct AIDataProviderBoolValue                               PathToItem;                                        // 0x100(0x30)
	class UClass*                                                NavigationFilter;                                  // 0x130(0x8)
	struct AIDataProviderFloatValue                              ScanRangeMultiplier;                               // 0x138(0x30)
};


// Size 0x10 (Full Size[0x180] - InheritedSize[0x170]
class EnvQueryTest_Distance: public EnvQueryTest
{
public:
	byte                                                         TestMode;                                          // 0x170(0x1)
	char                                                         pad0x7_T89Z8[0x7];                                 // 0x171(0x7)
	class UClass*                                                DistanceTo;                                        // 0x178(0x8)
};


// Size 0x48 (Full Size[0x1b8] - InheritedSize[0x170]
class EnvQueryTest_Dot: public EnvQueryTest
{
public:
	struct EnvDirection                                          LineA;                                             // 0x170(0x20)
	struct EnvDirection                                          LineB;                                             // 0x190(0x20)
	byte                                                         TestMode;                                          // 0x1b0(0x1)
	bool                                                         bAbsoluteValue;                                    // 0x1b1(0x1)
	char                                                         pad0x6_XQP2X[0x6];                                 // 0x1b2(0x6)
};


// Size 0x30 (Full Size[0x1a0] - InheritedSize[0x170]
class EnvQueryTest_GameplayTags: public EnvQueryTest
{
public:
	byte                                                         TagsToMatch;                                       // 0x170(0x1)
	char                                                         pad0x7_W66AK[0x7];                                 // 0x171(0x7)
	struct GameplayTagContainer                                  GameplayTags;                                      // 0x178(0x28)
};


// Size 0xd8 (Full Size[0x248] - InheritedSize[0x170]
class EnvQueryTest_Pathfinding: public EnvQueryTest
{
public:
	byte                                                         TestMode;                                          // 0x170(0x1)
	char                                                         pad0x7_8L5JM[0x7];                                 // 0x171(0x7)
	class UClass*                                                Context;                                           // 0x178(0x8)
	struct AIDataProviderBoolValue                               PathFromContext;                                   // 0x180(0x30)
	struct AIDataProviderBoolValue                               SkipUnreachable;                                   // 0x1b0(0x30)
	struct AIDataProviderIntValue                                MaxNumPathSegments;                                // 0x1e0(0x30)
	struct AIDataProviderBoolValue                               PassThroughUnreachable;                            // 0x210(0x30)
	class UClass*                                                FilterClass;                                       // 0x240(0x8)
};


// Size 0x30 (Full Size[0x278] - InheritedSize[0x248]
class EnvQueryTest_PathfindingBatch: public EnvQueryTest_Pathfinding
{
public:
	struct AIDataProviderFloatValue                              ScanRangeMultiplier;                               // 0x248(0x30)
};


// Size 0x0 (Full Size[0x170] - InheritedSize[0x170]
class EnvQueryTest_Random: public EnvQueryTest
{
public:
};


// Size 0xd8 (Full Size[0x248] - InheritedSize[0x170]
class EnvQueryTest_Trace: public EnvQueryTest
{
public:
	struct EnvTraceData                                          TraceData;                                         // 0x170(0x40)
	struct AIDataProviderBoolValue                               TraceFromContext;                                  // 0x1b0(0x30)
	struct AIDataProviderFloatValue                              ItemHeightOffset;                                  // 0x1e0(0x30)
	struct AIDataProviderFloatValue                              ContextHeightOffset;                               // 0x210(0x30)
	class UClass*                                                Context;                                           // 0x240(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class EnvQueryOption: public Object
{
public:
	class EnvQueryGenerator*                                     Generator;                                         // 0x28(0x8)
	TArray<class EnvQueryTest*>                                  Tests;                                             // 0x30(0x10)
};


// Size 0x10 (Full Size[0x5d0] - InheritedSize[0x5c0]
class EQSRenderingComponent: public PrimitiveComponent
{
public:
	char                                                         pad0x10_AP1CO[0x10];                               // 0x5c0(0x10)
};


// Size 0x60 (Full Size[0x640] - InheritedSize[0x5e0]
class EQSTestingPawn: public Character
{
public:
	class EnvQuery*                                              QueryTemplate;                                     // 0x5e0(0x8)
	TArray<struct EnvNamedValue>                                 QueryParams;                                       // 0x5e8(0x10)
	class UClass*                                                ContextToLinkWithThis;                             // 0x5f8(0x8)
	float                                                        TimeLimitPerStep;                                  // 0x600(0x4)
	int                                                          StepToDebugDraw;                                   // 0x604(0x4)
	byte                                                         HighlightMode;                                     // 0x608(0x1)
	char                                                         pad0x3_LNCA2[0x3];                                 // 0x609(0x3)
	bool                                                         bDrawLabels;                                       // 0x60c(0x1)
	bool                                                         bDrawFailedItems;                                  // 0x60c(0x1)
	bool                                                         bReRunQueryOnlyOnFinishedMove;                     // 0x60c(0x1)
	bool                                                         bShouldBeVisibleInGame;                            // 0x60c(0x1)
	char                                                         pad0x3_RGW9B[0x3];                                 // 0x60d(0x3)
	byte                                                         QueryingMode;                                      // 0x610(0x1)
	char                                                         pad0x2f_Y7MWH[0x2f];                               // 0x611(0x2f)
};


// Size 0x50 (Full Size[0x308] - InheritedSize[0x2b8]
class CrowdFollowingComponent: public PathFollowingComponent
{
public:
	char                                                         pad0x8_2IX3A[0x8];                                 // 0x2b8(0x8)
	struct Vector                                                CrowdAgentMoveDirection;                           // 0x2c0(0xc)
	char                                                         pad0x4_VKXT8[0x4];                                 // 0x2cc(0x4)
	class CharacterMovementComponent*                            CharacterMovement;                                 // 0x2d0(0x8)
	struct NavAvoidanceMask                                      AvoidanceGroup;                                    // 0x2d8(0x4)
	struct NavAvoidanceMask                                      GroupsToAvoid;                                     // 0x2dc(0x4)
	struct NavAvoidanceMask                                      GroupsToIgnore;                                    // 0x2e0(0x4)
	char                                                         pad0x24_2Q497[0x24];                               // 0x2e4(0x24)
};


// Size 0x0 (Full Size[0x90] - InheritedSize[0x90]
class PawnAction_BlueprintBase: public PawnAction
{
public:
};


// Size 0x50 (Full Size[0xe0] - InheritedSize[0x90]
class PawnAction_Move: public PawnAction
{
public:
	class Actor*                                                 GoalActor;                                         // 0x90(0x8)
	struct Vector                                                GoalLocation;                                      // 0x98(0xc)
	float                                                        AcceptableRadius;                                  // 0xa4(0x4)
	class UClass*                                                FilterClass;                                       // 0xa8(0x8)
	bool                                                         bAllowStrafe;                                      // 0xb0(0x1)
	bool                                                         bFinishOnOverlap;                                  // 0xb0(0x1)
	bool                                                         bUsePathfinding;                                   // 0xb0(0x1)
	bool                                                         bAllowPartialPath;                                 // 0xb0(0x1)
	bool                                                         bProjectGoalToNavigation;                          // 0xb0(0x1)
	bool                                                         bUpdatePathToGoal;                                 // 0xb0(0x1)
	bool                                                         bAbortChildActionOnPathChange;                     // 0xb0(0x1)
	char                                                         pad0x2f_NRKEJ[0x2f];                               // 0xb1(0x2f)
};


// Size 0x20 (Full Size[0xb0] - InheritedSize[0x90]
class PawnAction_Repeat: public PawnAction
{
public:
	class PawnAction*                                            ActionToRepeat;                                    // 0x90(0x8)
	class PawnAction*                                            RecentActionCopy;                                  // 0x98(0x8)
	byte                                                         ChildFailureHandlingMode;                          // 0xa0(0x1)
	char                                                         pad0xf_RHPJ7[0xf];                                 // 0xa1(0xf)
};


// Size 0x28 (Full Size[0xb8] - InheritedSize[0x90]
class PawnAction_Sequence: public PawnAction
{
public:
	TArray<class PawnAction*>                                    ActionSequence;                                    // 0x90(0x10)
	byte                                                         ChildFailureHandlingMode;                          // 0xa0(0x1)
	char                                                         pad0x7_CSKNX[0x7];                                 // 0xa1(0x7)
	class PawnAction*                                            RecentActionCopy;                                  // 0xa8(0x8)
	char                                                         pad0x8_RG48D[0x8];                                 // 0xb0(0x8)
};


// Size 0x10 (Full Size[0xa0] - InheritedSize[0x90]
class PawnAction_Wait: public PawnAction
{
public:
	float                                                        TimeToWait;                                        // 0x90(0x4)
	char                                                         pad0xc_OOYP6[0xc];                                 // 0x94(0xc)
};


// Size 0x48 (Full Size[0x110] - InheritedSize[0xc8]
class PawnSensingComponent: public ActorComponent
{
public:
	float                                                        HearingThreshold;                                  // 0xc8(0x4)
	float                                                        LOSHearingThreshold;                               // 0xcc(0x4)
	float                                                        SightRadius;                                       // 0xd0(0x4)
	float                                                        SensingInterval;                                   // 0xd4(0x4)
	float                                                        HearingMaxSoundAge;                                // 0xd8(0x4)
	bool                                                         bEnableSensingUpdates;                             // 0xdc(0x1)
	bool                                                         bOnlySensePlayers;                                 // 0xdc(0x1)
	bool                                                         bSeePawns;                                         // 0xdc(0x1)
	bool                                                         bHearNoises;                                       // 0xdc(0x1)
	char                                                         pad0xb_K112V[0xb];                                 // 0xdd(0xb)
	float                                                        PeripheralVisionAngle;                             // 0x108(0x4)
	float                                                        PeripheralVisionCosine;                            // 0x10c(0x4)
};


}