// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x4
struct AIRequestID
{
public:
	char                                                         pad0x4_E2CN3[0x4];                                 // 0x0(0x4)
};


// Size 0x3c
struct AIStimulus
{
public:
	float                                                        Age;                                               // 0x0(0x4)
	float                                                        ExpirationAge;                                     // 0x4(0x4)
	float                                                        Strength;                                          // 0x8(0x4)
	struct Vector                                                StimulusLocation;                                  // 0xc(0xc)
	struct Vector                                                ReceiverLocation;                                  // 0x18(0xc)
	struct FName                                                 Tag;                                               // 0x24(0x8)
	char                                                         pad0xc_XP2AD[0xc];                                 // 0x2c(0xc)
	bool                                                         bSuccessfullySensed;                               // 0x38(0x1)
	char                                                         pad0x3_4RQKL[0x3];                                 // 0x39(0x3)
};


// Size 0x40
struct AIMoveRequest
{
public:
	class Actor*                                                 GoalActor;                                         // 0x0(0x8)
	char                                                         pad0x38_8SXUJ[0x38];                               // 0x8(0x38)
};


// Size 0x8
struct PawnActionStack
{
public:
	class PawnAction*                                            TopAction;                                         // 0x0(0x8)
};


// Size 0x18
struct PawnActionEvent
{
public:
	class PawnAction*                                            Action;                                            // 0x0(0x8)
	char                                                         pad0x10_0DVX5[0x10];                               // 0x8(0x10)
};


// Size 0x28
struct BlackboardKeySelector
{
public:
	TArray<class BlackboardKeyType*>                             AllowedTypes;                                      // 0x0(0x10)
	struct FName                                                 SelectedKeyName;                                   // 0x10(0x8)
	class UClass*                                                SelectedKeyType;                                   // 0x18(0x8)
	byte                                                         SelectedKeyID;                                     // 0x20(0x1)
	char                                                         pad0x3_BQZ81[0x3];                                 // 0x21(0x3)
	bool                                                         bNoneIsAllowedValue;                               // 0x24(0x1)
	char                                                         pad0x3_7UZWA[0x3];                                 // 0x25(0x3)
};


// Size 0x1
struct GenericTeamId
{
public:
	byte                                                         TeamID;                                            // 0x0(0x1)
};


// Size 0x30
struct AIDataProviderBoolValue
{
public:
	char                                                         pad0x28_71MVB[0x28];                               // 0x0(0x28)
	bool                                                         DefaultValue;                                      // 0x28(0x1)
	char                                                         pad0x7_2DCYC[0x7];                                 // 0x29(0x7)
};


// Size 0x28
struct AIDataProviderTypedValue
{
public:
	char                                                         pad0x20_0DNUP[0x20];                               // 0x0(0x20)
	class UClass*                                                PropertyType;                                      // 0x20(0x8)
};


// Size 0x20
struct AIDataProviderValue
{
public:
	char                                                         pad0x8_BUOUR[0x8];                                 // 0x0(0x8)
	class Property*                                              CachedProperty;                                    // 0x8(0x8)
	class AIDataProvider*                                        DataBinding;                                       // 0x10(0x8)
	struct FName                                                 DataField;                                         // 0x18(0x8)
};


// Size 0x30
struct AIDataProviderFloatValue
{
public:
	char                                                         pad0x28_TTD5P[0x28];                               // 0x0(0x28)
	float                                                        DefaultValue;                                      // 0x28(0x4)
	char                                                         pad0x4_QTVL9[0x4];                                 // 0x2c(0x4)
};


// Size 0x30
struct AIDataProviderIntValue
{
public:
	char                                                         pad0x28_B7FTD[0x28];                               // 0x0(0x28)
	int                                                          DefaultValue;                                      // 0x28(0x4)
	char                                                         pad0x4_CCPY3[0x4];                                 // 0x2c(0x4)
};


// Size 0x30
struct AIDataProviderStructValue
{
public:
	char                                                         pad0x30_I7L6B[0x30];                               // 0x0(0x30)
};


// Size 0x10
struct CustomDataProviderObjectPropertySelector
{
public:
	class UClass*                                                ObjectClass;                                       // 0x0(0x8)
	struct FName                                                 PropertyName;                                      // 0x8(0x8)
};


// Size 0xc
struct IgnoreActorInfo
{
public:
	char                                                         pad0x8_83QAU[0x8];                                 // 0x0(0x8)
	float                                                        TimeRemaining;                                     // 0x8(0x4)
};


// Size 0x4
struct AISenseAffiliationFilter
{
public:
	bool                                                         bDetectEnemies;                                    // 0x0(0x1)
	bool                                                         bDetectNeutrals;                                   // 0x0(0x1)
	bool                                                         bDetectFriendlies;                                 // 0x0(0x1)
	char                                                         pad0x3_FAXDJ[0x3];                                 // 0x1(0x3)
};


// Size 0x20
struct ActorPerceptionBlueprintInfo
{
public:
	class Actor*                                                 Target;                                            // 0x0(0x8)
	TArray<struct AIStimulus>                                    LastSensedStimuli;                                 // 0x8(0x10)
	bool                                                         bIsHostile;                                        // 0x18(0x1)
	char                                                         pad0x7_GM98J[0x7];                                 // 0x19(0x7)
};


// Size 0x30
struct AIDamageEvent
{
public:
	float                                                        Amount;                                            // 0x0(0x4)
	struct Vector                                                Location;                                          // 0x4(0xc)
	struct Vector                                                HitLocation;                                       // 0x10(0xc)
	char                                                         pad0x4_WMJF8[0x4];                                 // 0x1c(0x4)
	class Actor*                                                 DamagedActor;                                      // 0x20(0x8)
	class Actor*                                                 Instigator;                                        // 0x28(0x8)
};


// Size 0x30
struct AINoiseEvent
{
public:
	char                                                         pad0x4_B1R9W[0x4];                                 // 0x0(0x4)
	struct Vector                                                NoiseLocation;                                     // 0x4(0xc)
	float                                                        Loudness;                                          // 0x10(0x4)
	float                                                        MaxRange;                                          // 0x14(0x4)
	class Actor*                                                 Instigator;                                        // 0x18(0x8)
	struct FName                                                 Tag;                                               // 0x20(0x8)
	char                                                         pad0x8_0GVSP[0x8];                                 // 0x28(0x8)
};


// Size 0x18
struct AIPredictionEvent
{
public:
	class Actor*                                                 Requestor;                                         // 0x0(0x8)
	class Actor*                                                 PredictedActor;                                    // 0x8(0x8)
	char                                                         pad0x8_MLK4Y[0x8];                                 // 0x10(0x8)
};


// Size 0x18
struct AISightEvent
{
public:
	char                                                         pad0x8_KSWQQ[0x8];                                 // 0x0(0x8)
	class Actor*                                                 SeenActor;                                         // 0x8(0x8)
	class Actor*                                                 Observer;                                          // 0x10(0x8)
};


// Size 0x38
struct AITeamStimulusEvent
{
public:
	char                                                         pad0x28_N5MX5[0x28];                               // 0x0(0x28)
	class Actor*                                                 Broadcaster;                                       // 0x28(0x8)
	class Actor*                                                 Enemy;                                             // 0x30(0x8)
};


// Size 0x20
struct AITouchEvent
{
public:
	char                                                         pad0x10_NNXX2[0x10];                               // 0x0(0x10)
	class Actor*                                                 TouchReceiver;                                     // 0x10(0x8)
	class Actor*                                                 OtherActor;                                        // 0x18(0x8)
};


// Size 0x30
struct BTCompositeChild
{
public:
	class BTCompositeNode*                                       ChildComposite;                                    // 0x0(0x8)
	class BTTaskNode*                                            ChildTask;                                         // 0x8(0x8)
	TArray<class BTDecorator*>                                   Decorators;                                        // 0x10(0x10)
	TArray<struct BTDecoratorLogic>                              DecoratorOps;                                      // 0x20(0x10)
};


// Size 0x4
struct BTDecoratorLogic
{
public:
	byte                                                         Operation;                                         // 0x0(0x1)
	char                                                         pad0x1_1BEW9[0x1];                                 // 0x1(0x1)
	char                                                         pad0x2_VG47B[0x2];                                 // 0x2(0x2)
};


// Size 0x18
struct BehaviorTreeTemplateInfo
{
public:
	class BehaviorTree*                                          Asset;                                             // 0x0(0x8)
	class BTCompositeNode*                                       Template;                                          // 0x8(0x8)
	char                                                         pad0x8_C3UUX[0x8];                                 // 0x10(0x8)
};


// Size 0x18
struct BlackboardEntry
{
public:
	struct FName                                                 EntryName;                                         // 0x0(0x8)
	class BlackboardKeyType*                                     KeyType;                                           // 0x8(0x8)
	bool                                                         bInstanceSynced;                                   // 0x10(0x1)
	char                                                         pad0x7_KCWM3[0x7];                                 // 0x11(0x7)
};


// Size 0xc
struct EnvBoolParam
{
public:
	char                                                         pad0xc_D27KY[0xc];                                 // 0x0(0xc)
};


// Size 0xc
struct EnvBoolParam_DEPRECATED
{
public:
	bool                                                         Value;                                             // 0x0(0x1)
	char                                                         pad0x3_HOUXA[0x3];                                 // 0x1(0x3)
	struct FName                                                 ParamName;                                         // 0x4(0x8)
};


// Size 0xc
struct EnvIntParam
{
public:
	char                                                         pad0xc_A28CM[0xc];                                 // 0x0(0xc)
};


// Size 0xc
struct EnvIntParam_DEPRECATED
{
public:
	int                                                          Value;                                             // 0x0(0x4)
	struct FName                                                 ParamName;                                         // 0x4(0x8)
};


// Size 0xc
struct EnvFloatParam
{
public:
	char                                                         pad0xc_6W3B5[0xc];                                 // 0x0(0xc)
};


// Size 0xc
struct EnvFloatParam_DEPRECATED
{
public:
	float                                                        Value;                                             // 0x0(0x4)
	struct FName                                                 ParamName;                                         // 0x4(0x8)
};


// Size 0x40
struct EnvQueryResult
{
public:
	char                                                         pad0x10_4N0BM[0x10];                               // 0x0(0x10)
	class UClass*                                                ItemType;                                          // 0x10(0x8)
	char                                                         pad0x14_EOB7Q[0x14];                               // 0x18(0x14)
	int                                                          OptionIndex;                                       // 0x2c(0x4)
	int                                                          QueryID;                                           // 0x30(0x4)
	char                                                         pad0xc_ORXXW[0xc];                                 // 0x34(0xc)
};


// Size 0x40
struct EnvTraceData
{
public:
	int                                                          VersionNum;                                        // 0x0(0x4)
	char                                                         pad0x4_U9II5[0x4];                                 // 0x4(0x4)
	class UClass*                                                NavigationFilter;                                  // 0x8(0x8)
	struct FName                                                 OverrideNavMesh;                                   // 0x10(0x8)
	float                                                        ProjectDown;                                       // 0x18(0x4)
	float                                                        ProjectUp;                                         // 0x1c(0x4)
	float                                                        ExtentX;                                           // 0x20(0x4)
	float                                                        ExtentY;                                           // 0x24(0x4)
	float                                                        ExtentZ;                                           // 0x28(0x4)
	float                                                        PostProjectionVerticalOffset;                      // 0x2c(0x4)
	byte                                                         TraceChannel;                                      // 0x30(0x1)
	byte                                                         SerializedChannel;                                 // 0x31(0x1)
	byte                                                         TraceShape;                                        // 0x32(0x1)
	byte                                                         TraceMode;                                         // 0x33(0x1)
	bool                                                         bTraceComplex;                                     // 0x34(0x1)
	bool                                                         bOnlyBlockingHits;                                 // 0x34(0x1)
	bool                                                         bCanTraceOnNavMesh;                                // 0x34(0x1)
	bool                                                         bCanTraceOnGeometry;                               // 0x34(0x1)
	bool                                                         bCanDisableTrace;                                  // 0x34(0x1)
	bool                                                         bCanProjectDown;                                   // 0x34(0x1)
	char                                                         pad0x3_KN7MT[0x3];                                 // 0x35(0x3)
	bool                                                         bUseUpDownAsAbsoluteZStartAndEnd;                  // 0x38(0x1)
	bool                                                         bUseSourceZAsEnd;                                  // 0x39(0x1)
	char                                                         pad0x6_UQJ5B[0x6];                                 // 0x3a(0x6)
};


// Size 0x20
struct EnvDirection
{
public:
	class UClass*                                                LineFrom;                                          // 0x0(0x8)
	class UClass*                                                LineTo;                                            // 0x8(0x8)
	class UClass*                                                Rotation;                                          // 0x10(0x8)
	byte                                                         DirMode;                                           // 0x18(0x1)
	char                                                         pad0x7_THBG9[0x7];                                 // 0x19(0x7)
};


// Size 0x10
struct EnvNamedValue
{
public:
	struct FName                                                 ParamName;                                         // 0x0(0x8)
	byte                                                         ParamType;                                         // 0x8(0x1)
	char                                                         pad0x3_YI25Q[0x3];                                 // 0x9(0x3)
	float                                                        Value;                                             // 0xc(0x4)
};


// Size 0x20
struct CrowdAvoidanceSamplingPattern
{
public:
	TArray<Float Angles>                                         Angles;                                            // 0x0(0x10)
	TArray<Float Radii>                                          Radii;                                             // 0x10(0x10)
};


// Size 0x1c
struct CrowdAvoidanceConfig
{
public:
	float                                                        VelocityBias;                                      // 0x0(0x4)
	float                                                        DesiredVelocityWeight;                             // 0x4(0x4)
	float                                                        CurrentVelocityWeight;                             // 0x8(0x4)
	float                                                        SideBiasWeight;                                    // 0xc(0x4)
	float                                                        ImpactTimeWeight;                                  // 0x10(0x4)
	float                                                        ImpactTimeRange;                                   // 0x14(0x4)
	byte                                                         CustomPatternIdx;                                  // 0x18(0x1)
	byte                                                         AdaptiveDivisions;                                 // 0x19(0x1)
	byte                                                         AdaptiveRings;                                     // 0x1a(0x1)
	byte                                                         AdaptiveDepth;                                     // 0x1b(0x1)
};


// Size 0x290
struct EnvQueryInstanceCache
{
public:
	class EnvQuery*                                              Template;                                          // 0x0(0x8)
	char                                                         pad0x288_0IKKO[0x288];                             // 0x8(0x288)
};


// Size 0x170
struct EnvQueryRequest
{
public:
	class EnvQuery*                                              QueryTemplate;                                     // 0x0(0x8)
	class Object*                                                Owner;                                             // 0x8(0x8)
	class World*                                                 World;                                             // 0x10(0x8)
	char                                                         pad0x158_JM84S[0x158];                             // 0x18(0x158)
};


}