#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x3c
struct AIStimulus
{
public:
	float                                                        Age;                                               // 0x0(0x4)
	float                                                        ExpirationAge;                                     // 0x4(0x4)
	float                                                        Strength;                                          // 0x8(0x4)
	struct Vector                                                StimulusLocation;                                  // 0xc(0xc)
	struct Vector                                                ReceiverLocation;                                  // 0x18(0xc)
	struct FName                                                 Tag;                                               // 0x24(0x8)
	char                                                         pad0xc_QCO30[0xc];                                 // 0x2c(0xc)
	bool                                                         bSuccessfullySensed;                               // 0x38(0x1)
	char                                                         pad0x3_K92AE[0x3];                                 // 0x39(0x3)
};


// Size 0x4
struct AISenseAffiliationFilter
{
public:
	bool                                                         bDetectEnemies;                                    // 0x0(0x1)
	bool                                                         bDetectNeutrals;                                   // 0x0(0x1)
	bool                                                         bDetectFriendlies;                                 // 0x0(0x1)
	char                                                         pad0x3_QXHIN[0x3];                                 // 0x1(0x3)
};


// Size 0xc
struct EnvFloatParam_DEPRECATED
{
public:
	float                                                        Value;                                             // 0x0(0x4)
	struct FName                                                 ParamName;                                         // 0x4(0x8)
};


// Size 0x40
struct AIMoveRequest
{
public:
	class Actor*                                                 GoalActor;                                         // 0x0(0x8)
	char                                                         pad0x38_RGNXN[0x38];                               // 0x8(0x38)
};


// Size 0x30
struct AIDataProviderStructValue
{
public:
	char                                                         pad0x30_GLQ5R[0x30];                               // 0x0(0x30)
};


// Size 0x18
struct AISightEvent
{
public:
	char                                                         pad0x8_LBOA1[0x8];                                 // 0x0(0x8)
	class Actor*                                                 SeenActor;                                         // 0x8(0x8)
	class Actor*                                                 Observer;                                          // 0x10(0x8)
};


// Size 0x4
struct BTDecoratorLogic
{
public:
	char                                                         Operation;                                         // 0x0(0x1)
	char                                                         pad0x1_LDU6U[0x1];                                 // 0x1(0x1)
	char                                                         pad0x2_8XQS1[0x2];                                 // 0x2(0x2)
};


// Size 0x1
struct GenericTeamId
{
public:
	char                                                         TeamID;                                            // 0x0(0x1)
};


// Size 0x38
struct AITeamStimulusEvent
{
public:
	char                                                         pad0x28_3NFW4[0x28];                               // 0x0(0x28)
	class Actor*                                                 Broadcaster;                                       // 0x28(0x8)
	class Actor*                                                 Enemy;                                             // 0x30(0x8)
};


// Size 0xc
struct EnvBoolParam
{
public:
	char                                                         pad0xc_CM7CK[0xc];                                 // 0x0(0xc)
};


// Size 0xc
struct EnvIntParam_DEPRECATED
{
public:
	int                                                          Value;                                             // 0x0(0x4)
	struct FName                                                 ParamName;                                         // 0x4(0x8)
};


// Size 0x18
struct AIPredictionEvent
{
public:
	class Actor*                                                 Requestor;                                         // 0x0(0x8)
	class Actor*                                                 PredictedActor;                                    // 0x8(0x8)
	char                                                         pad0x8_AU6W5[0x8];                                 // 0x10(0x8)
};


// Size 0x170
struct EnvQueryRequest
{
public:
	class EnvQuery*                                              QueryTemplate;                                     // 0x0(0x8)
	class Object*                                                Owner;                                             // 0x8(0x8)
	class World*                                                 World;                                             // 0x10(0x8)
	char                                                         pad0x158_WTITJ[0x158];                             // 0x18(0x158)
};


// Size 0xc
struct EnvBoolParam_DEPRECATED
{
public:
	bool                                                         Value;                                             // 0x0(0x1)
	char                                                         pad0x3_FT5OG[0x3];                                 // 0x1(0x3)
	struct FName                                                 ParamName;                                         // 0x4(0x8)
};


// Size 0x28
struct BlackboardKeySelector
{
public:
	TArray<class BlackboardKeyType*>                             AllowedTypes;                                      // 0x0(0x10)
	struct FName                                                 SelectedKeyName;                                   // 0x10(0x8)
	class UClass*                                                SelectedKeyType;                                   // 0x18(0x8)
	char                                                         SelectedKeyID;                                     // 0x20(0x1)
	char                                                         pad0x3_A8947[0x3];                                 // 0x21(0x3)
	bool                                                         bNoneIsAllowedValue;                               // 0x24(0x1)
	char                                                         pad0x3_UJZJI[0x3];                                 // 0x25(0x3)
};


// Size 0x2e0
struct EnvQueryInstanceCache
{
public:
	class EnvQuery*                                              Template;                                          // 0x0(0x8)
	char                                                         pad0x2d8_EK0T5[0x2d8];                             // 0x8(0x2d8)
};


// Size 0x18
struct PawnActionEvent
{
public:
	class PawnAction*                                            Action;                                            // 0x0(0x8)
	char                                                         pad0x10_S3EYT[0x10];                               // 0x8(0x10)
};


// Size 0x20
struct AITouchEvent
{
public:
	char                                                         pad0x10_VOX34[0x10];                               // 0x0(0x10)
	class Actor*                                                 TouchReceiver;                                     // 0x10(0x8)
	class Actor*                                                 OtherActor;                                        // 0x18(0x8)
};


// Size 0x10
struct CustomDataProviderObjectPropertySelector
{
public:
	class UClass*                                                ObjectClass;                                       // 0x0(0x8)
	struct FName                                                 PropertyName;                                      // 0x8(0x8)
};


// Size 0x30
struct AIDataProviderIntValue
{
public:
	char                                                         pad0x28_X20WI[0x28];                               // 0x0(0x28)
	int                                                          DefaultValue;                                      // 0x28(0x4)
	char                                                         pad0x4_AXU2Q[0x4];                                 // 0x2c(0x4)
};


// Size 0x28
struct AIDataProviderTypedValue
{
public:
	char                                                         pad0x20_VOCOJ[0x20];                               // 0x0(0x20)
	class UClass*                                                PropertyType;                                      // 0x20(0x8)
};


// Size 0x8
struct PawnActionStack
{
public:
	class PawnAction*                                            TopAction;                                         // 0x0(0x8)
};


// Size 0xc
struct IgnoreActorInfo
{
public:
	char                                                         pad0x8_USFME[0x8];                                 // 0x0(0x8)
	float                                                        TimeRemaining;                                     // 0x8(0x4)
};


// Size 0xc
struct EnvFloatParam
{
public:
	char                                                         pad0xc_URD5M[0xc];                                 // 0x0(0xc)
};


// Size 0x20
struct EnvDirection
{
public:
	class UClass*                                                LineFrom;                                          // 0x0(0x8)
	class UClass*                                                LineTo;                                            // 0x8(0x8)
	class UClass*                                                Rotation;                                          // 0x10(0x8)
	char                                                         DirMode;                                           // 0x18(0x1)
	char                                                         pad0x7_G6S7O[0x7];                                 // 0x19(0x7)
};


// Size 0xc
struct EnvIntParam
{
public:
	char                                                         pad0xc_7CXZE[0xc];                                 // 0x0(0xc)
};


// Size 0x18
struct BehaviorTreeTemplateInfo
{
public:
	class BehaviorTree*                                          Asset;                                             // 0x0(0x8)
	class BTCompositeNode*                                       Template;                                          // 0x8(0x8)
	char                                                         pad0x8_5JFCM[0x8];                                 // 0x10(0x8)
};


// Size 0x30
struct AIDataProviderFloatValue
{
public:
	char                                                         pad0x28_FDAC7[0x28];                               // 0x0(0x28)
	float                                                        DefaultValue;                                      // 0x28(0x4)
	char                                                         pad0x4_5TN10[0x4];                                 // 0x2c(0x4)
};


// Size 0x4
struct AIRequestID
{
public:
	char                                                         pad0x4_BMI1H[0x4];                                 // 0x0(0x4)
};


// Size 0x40
struct EnvQueryResult
{
public:
	char                                                         pad0x10_T7XX1[0x10];                               // 0x0(0x10)
	class UClass*                                                ItemType;                                          // 0x10(0x8)
	char                                                         pad0x14_77INV[0x14];                               // 0x18(0x14)
	int                                                          OptionIndex;                                       // 0x2c(0x4)
	int                                                          QueryID;                                           // 0x30(0x4)
	char                                                         pad0xc_LSIR3[0xc];                                 // 0x34(0xc)
};


// Size 0x30
struct AIDataProviderBoolValue
{
public:
	char                                                         pad0x28_51LYR[0x28];                               // 0x0(0x28)
	bool                                                         DefaultValue;                                      // 0x28(0x1)
	char                                                         pad0x7_D1T4I[0x7];                                 // 0x29(0x7)
};


// Size 0x20
struct AIDataProviderValue
{
public:
	char                                                         pad0x8_2LGFF[0x8];                                 // 0x0(0x8)
	class Property*                                              CachedProperty;                                    // 0x8(0x8)
	class AIDataProvider*                                        DataBinding;                                       // 0x10(0x8)
	struct FName                                                 DataField;                                         // 0x18(0x8)
};


// Size 0x18
struct BlackboardEntry
{
public:
	struct FName                                                 EntryName;                                         // 0x0(0x8)
	class BlackboardKeyType*                                     KeyType;                                           // 0x8(0x8)
	bool                                                         bInstanceSynced;                                   // 0x10(0x1)
	char                                                         pad0x7_PQNY5[0x7];                                 // 0x11(0x7)
};


// Size 0x20
struct CrowdAvoidanceSamplingPattern
{
public:
	TArray<float>                                                Angles;                                            // 0x0(0x10)
	TArray<float>                                                Radii;                                             // 0x10(0x10)
};


// Size 0x30
struct AINoiseEvent
{
public:
	char                                                         pad0x4_9020Q[0x4];                                 // 0x0(0x4)
	struct Vector                                                NoiseLocation;                                     // 0x4(0xc)
	float                                                        Loudness;                                          // 0x10(0x4)
	float                                                        MaxRange;                                          // 0x14(0x4)
	class Actor*                                                 Instigator;                                        // 0x18(0x8)
	struct FName                                                 Tag;                                               // 0x20(0x8)
	char                                                         pad0x8_QOHM0[0x8];                                 // 0x28(0x8)
};


// Size 0x30
struct AIDamageEvent
{
public:
	float                                                        Amount;                                            // 0x0(0x4)
	struct Vector                                                Location;                                          // 0x4(0xc)
	struct Vector                                                HitLocation;                                       // 0x10(0xc)
	char                                                         pad0x4_NXC6N[0x4];                                 // 0x1c(0x4)
	class Actor*                                                 DamagedActor;                                      // 0x20(0x8)
	class Actor*                                                 Instigator;                                        // 0x28(0x8)
};


// Size 0x10
struct EnvNamedValue
{
public:
	struct FName                                                 ParamName;                                         // 0x0(0x8)
	char                                                         ParamType;                                         // 0x8(0x1)
	char                                                         pad0x3_J8H3O[0x3];                                 // 0x9(0x3)
	float                                                        Value;                                             // 0xc(0x4)
};


// Size 0x1c
struct CrowdAvoidanceConfig
{
public:
	float                                                        VelocityBias;                                      // 0x0(0x4)
	float                                                        DesiredVelocityWeight;                             // 0x4(0x4)
	float                                                        CurrentVelocityWeight;                             // 0x8(0x4)
	float                                                        SideBiasWeight;                                    // 0xc(0x4)
	float                                                        ImpactTimeWeight;                                  // 0x10(0x4)
	float                                                        ImpactTimeRange;                                   // 0x14(0x4)
	char                                                         CustomPatternIdx;                                  // 0x18(0x1)
	char                                                         AdaptiveDivisions;                                 // 0x19(0x1)
	char                                                         AdaptiveRings;                                     // 0x1a(0x1)
	char                                                         AdaptiveDepth;                                     // 0x1b(0x1)
};


// Size 0x40
struct EnvTraceData
{
public:
	int                                                          VersionNum;                                        // 0x0(0x4)
	char                                                         pad0x4_T35GR[0x4];                                 // 0x4(0x4)
	class UClass*                                                NavigationFilter;                                  // 0x8(0x8)
	struct FName                                                 OverrideNavMesh;                                   // 0x10(0x8)
	float                                                        ProjectDown;                                       // 0x18(0x4)
	float                                                        ProjectUp;                                         // 0x1c(0x4)
	float                                                        ExtentX;                                           // 0x20(0x4)
	float                                                        ExtentY;                                           // 0x24(0x4)
	float                                                        ExtentZ;                                           // 0x28(0x4)
	float                                                        PostProjectionVerticalOffset;                      // 0x2c(0x4)
	char                                                         TraceChannel;                                      // 0x30(0x1)
	char                                                         SerializedChannel;                                 // 0x31(0x1)
	char                                                         TraceShape;                                        // 0x32(0x1)
	char                                                         TraceMode;                                         // 0x33(0x1)
	bool                                                         bTraceComplex;                                     // 0x34(0x1)
	bool                                                         bOnlyBlockingHits;                                 // 0x34(0x1)
	bool                                                         bCanTraceOnNavMesh;                                // 0x34(0x1)
	bool                                                         bCanTraceOnGeometry;                               // 0x34(0x1)
	bool                                                         bCanDisableTrace;                                  // 0x34(0x1)
	bool                                                         bCanProjectDown;                                   // 0x34(0x1)
	char                                                         pad0x3_X7MB3[0x3];                                 // 0x35(0x3)
	bool                                                         bUseUpDownAsAbsoluteZStartAndEnd;                  // 0x38(0x1)
	bool                                                         bUseSourceZAsEnd;                                  // 0x39(0x1)
	char                                                         pad0x6_SJ6TY[0x6];                                 // 0x3a(0x6)
};


// Size 0x20
struct ActorPerceptionBlueprintInfo
{
public:
	class Actor*                                                 Target;                                            // 0x0(0x8)
	TArray<struct AIStimulus>                                    LastSensedStimuli;                                 // 0x8(0x10)
	bool                                                         bIsHostile;                                        // 0x18(0x1)
	char                                                         pad0x7_7LT4N[0x7];                                 // 0x19(0x7)
};


// Size 0x30
struct BTCompositeChild
{
public:
	class BTCompositeNode*                                       ChildComposite;                                    // 0x0(0x8)
	class BTTaskNode*                                            ChildTask;                                         // 0x8(0x8)
	TArray<class BTDecorator*>                                   Decorators;                                        // 0x10(0x10)
	TArray<struct BTDecoratorLogic>                              DecoratorOps;                                      // 0x20(0x10)
};


