#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "AIShips_Structs.h"


// Size 0x98 (Full Size[0xc0] - InheritedSize[0x28]
class AIShipContextDescDataAsset: public DataAsset
{
public:
	char                                                         ShipType;                                          // 0x28(0x1)
	char                                                         EncounterType;                                     // 0x29(0x1)
	char                                                         pad0x6_DDCD3[0x6];                                 // 0x2a(0x6)
	class UClass*                                                EventType;                                         // 0x30(0x8)
	class ShipDescAsset*                                         ShipDesc;                                          // 0x38(0x8)
	class AthenaAIShipControllerParamsDataAsset*                 ControllerParams;                                  // 0x40(0x8)
	TArray<struct AIShipEncounterParamsSpawnerData>              Spawners;                                          // 0x48(0x10)
	struct AIShipContextDescDamageParams                         DamageParams;                                      // 0x58(0x14)
	struct AIShipSailData                                        SailsCustomisation;                                // 0x6c(0x10)
	struct Color                                                 SailColour;                                        // 0x7c(0x4)
	struct AIShipCrewFormType                                    FormType;                                          // 0x80(0x20)
	struct AIShipCrewAmmoType                                    AmmoType;                                          // 0xa0(0x18)
	class ShortRangeMarkerDataAsset*                             RewardMarkerParams;                                // 0xb8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIShipDebugFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIShipsBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x38 (Full Size[0xc0] - InheritedSize[0x88]
class BTTask_SailShipCircleTarget: public BTTask_BlackboardBase
{
public:
	char                                                         pad0x38_49N1B[0x38];                               // 0x88(0x38)
};


// Size 0x38 (Full Size[0x478] - InheritedSize[0x440]
class ShipProxyPawn: public Pawn
{
public:
	class Ship*                                                  Ship;                                              // 0x440(0x8)
	class Ship*                                                  SpawnTargetShip;                                   // 0x448(0x8)
	char                                                         pad0x28_3SG81[0x28];                               // 0x450(0x28)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class AIShipEncounterParamsDataAsset: public DataAsset
{
public:
	class AIShipEncounterSpawnParamsDataAsset*                   SpawnParams;                                       // 0x28(0x8)
	class AIShipContextParamsDataAsset*                          ContextParams;                                     // 0x30(0x8)
	class AIShipContextDescDataAsset*                            DefaultContextDesc;                                // 0x38(0x8)
	class UClass*                                                ShipPawnClass;                                     // 0x40(0x8)
	class BuoyantObjectSpawnProfileDataAsset*                    BuoyantObjectSpawnProfileAsset;                    // 0x48(0x8)
	class UClass*                                                EventSignalAssetClass;                             // 0x50(0x8)
	float                                                        EventSignalHeight;                                 // 0x58(0x4)
	float                                                        OuterRadiusMultiplier;                             // 0x5c(0x4)
	float                                                        MigrationRadiusMultiplier;                         // 0x60(0x4)
	float                                                        InitialEncounterEntryDelay;                        // 0x64(0x4)
	float                                                        MinEngagedDistanceFromPlayers;                     // 0x68(0x4)
	char                                                         pad0x4_N8K6Z[0x4];                                 // 0x6c(0x4)
	struct FString                                               MinEngagedDistanceFromPlayersRemoteConfigKey;      // 0x70(0x10)
	bool                                                         EnableMusicWhenShipsHaveNoTarget;                  // 0x80(0x1)
	char                                                         pad0x3_0X8YL[0x3];                                 // 0x81(0x3)
	int                                                          SecondsUntilEncounterEndsAfterLastCrewLeft;        // 0x84(0x4)
	int                                                          MaximumEncounterDuration;                          // 0x88(0x4)
	char                                                         pad0x4_NNTEQ[0x4];                                 // 0x8c(0x4)
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class AIShipTelemetryComponent: public ActorComponent
{
public:
	char                                                         pad0x40_TTFPC[0x40];                               // 0xc8(0x40)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIShipObstacleServiceInterface: public Interface
{
public:
};


// Size 0x418 (Full Size[0x7e0] - InheritedSize[0x3c8]
class AIShipService: public Actor
{
public:
	char                                                         pad0x10_Q68KY[0x10];                               // 0x3c8(0x10)
	class GameEventOnDemandAvailabilityHandler*                  GameEventOnDemandAvailabilityHandler;              // 0x3d8(0x8)
	char                                                         pad0x18_ZPEEG[0x18];                               // 0x3e0(0x18)
	class AIShipServiceDataAsset*                                Params;                                            // 0x3f8(0x8)
	char                                                         pad0x3e0_H2RX0[0x3e0];                             // 0x400(0x3e0)
};


// Size 0x250 (Full Size[0x278] - InheritedSize[0x28]
class AIShipServiceDataAsset: public DataAsset
{
public:
	TArray<struct EventTypeAIShipEncounterParams>                BattleEncounterParams;                             // 0x28(0x10)
	struct AIShipEncounterParams                                 AggressiveEncounterParams;                         // 0x38(0x28)
	struct AIShipEncounterParams                                 PassiveEncounterParams;                            // 0x60(0x28)
	struct IntPoint                                              ObstacleBucketDimensions;                          // 0x88(0x8)
	float                                                        ShipwreckObstacleRadius;                           // 0x90(0x4)
	char                                                         pad0x4_2GXVW[0x4];                                 // 0x94(0x4)
	struct AIShipContextDescGenerationParams                     ContextDescGenerationParams;                       // 0x98(0x80)
	struct AIShipBattleEncounterDescGenerationParams             EncounterGenerationParams;                         // 0x118(0x80)
	struct AIShipSingleWaveEncounterDescGenerationParams         AggressiveEncounterGenerationParams;               // 0x198(0x10)
	struct AIShipSingleWaveEncounterDescGenerationParams         PassiveEncounterGenerationParams;                  // 0x1a8(0x10)
	struct WeightedProbabilityRangeOfRanges                      TimerBattleFirstRegenInterval;                     // 0x1b8(0x30)
	struct WeightedProbabilityRangeOfRanges                      TimerBattleRegenInterval;                          // 0x1e8(0x30)
	float                                                        TimerBattleFinderThrottle;                         // 0x218(0x4)
	char                                                         pad0x4_GSN0I[0x4];                                 // 0x21c(0x4)
	struct WeightedProbabilityRangeOfRanges                      TimerBattleRetryRegenInterval;                     // 0x220(0x30)
	float                                                        TimerBattleMinActivationDistanceFromPlayers;       // 0x250(0x4)
	char                                                         pad0x4_NO7GQ[0x4];                                 // 0x254(0x4)
	class ShortRangeMarkerDataAsset*                             RewardMarkerParams;                                // 0x258(0x8)
	TArray<struct Name>                                          IslandsToAvoid;                                    // 0x260(0x10)
	float                                                        AvoidanceRange;                                    // 0x270(0x4)
	char                                                         pad0x4_5DI7P[0x4];                                 // 0x274(0x4)
};


// Size 0xe0 (Full Size[0x150] - InheritedSize[0x70]
class BTService_UpdateIfShipShouldBreakTracking: public BTService
{
public:
	struct BlackboardKeySelector                                 TargetActorKey;                                    // 0x70(0x28)
	struct BlackboardKeySelector                                 DisableTrackingKey;                                // 0x98(0x28)
	struct BlackboardKeySelector                                 ShouldSailForwardKey;                              // 0xc0(0x28)
	struct BlackboardKeySelector                                 TimeToSailForwardKey;                              // 0xe8(0x28)
	struct BlackboardKeySelector                                 CaptainIsPresentKey;                               // 0x110(0x28)
	char                                                         pad0x18_GA389[0x18];                               // 0x138(0x18)
};


// Size 0x88 (Full Size[0x450] - InheritedSize[0x3c8]
class AIShipObstacleService: public Actor
{
public:
	char                                                         pad0x88_42B3B[0x88];                               // 0x3c8(0x88)
};


// Size 0x50 (Full Size[0xc0] - InheritedSize[0x70]
class BTService_UpdateLocationWithActorLocation: public BTService
{
public:
	struct BlackboardKeySelector                                 LocationKey;                                       // 0x70(0x28)
	struct BlackboardKeySelector                                 ActorKey;                                          // 0x98(0x28)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class IsAIShipEncounterTypeStatCondition: public StatCondition
{
public:
	char                                                         EncounterType;                                     // 0x28(0x1)
	char                                                         pad0x7_XQ42M[0x7];                                 // 0x29(0x7)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class BTTask_AIShipSurface: public BTTask_BlackboardBase
{
public:
	float                                                        MaxSpeed;                                          // 0x88(0x4)
	float                                                        PreSurfaceDelay;                                   // 0x8c(0x4)
	char                                                         pad0x8_SY3X9[0x8];                                 // 0x90(0x8)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class DefeatAIShipEncounterConditionalStatTrigger: public ConditionalStatsTriggerType
{
public:
};


// Size 0x50 (Full Size[0xd8] - InheritedSize[0x88]
class BTTask_SailShipBesideTarget: public BTTask_BlackboardBase
{
public:
	char                                                         pad0x20_8WT6F[0x20];                               // 0x88(0x20)
	struct TrackingNoiseGenerator                                TrackingNoiseGenerator;                            // 0xa8(0x18)
	char                                                         pad0x18_8V71F[0x18];                               // 0xc0(0x18)
};


// Size 0x358 (Full Size[0x490] - InheritedSize[0x138]
class AthenaAIShipControllerParamsDataAsset: public AthenaAIControllerParamsDataAsset
{
public:
	struct ShipMovementParams                                    TrackingMovementParams;                            // 0x138(0x38)
	struct WeightedProbabilityRangeOfRanges                      TimesToSailBesideTarget;                           // 0x170(0x30)
	struct WeightedProbabilityRangeOfRanges                      PerpendicularDistanceOffsets;                      // 0x1a0(0x30)
	struct WeightedProbabilityRangeOfRanges                      TimesBeforeDistanceChange;                         // 0x1d0(0x30)
	float                                                        MaxParallelDistanceOffset;                         // 0x200(0x4)
	float                                                        AlignDistanceThreshold;                            // 0x204(0x4)
	float                                                        TimeToProjectIntoFutureForTracking;                // 0x208(0x4)
	float                                                        TargetSpeedThresholdToTrackShip;                   // 0x20c(0x4)
	struct TrackingNoiseGenerator                                TrackingNoiseGenerator;                            // 0x210(0x18)
	float                                                        WheelAngleMonitorDuration;                         // 0x228(0x4)
	float                                                        WheelAngleChangeThresholdToBreakTracking;          // 0x22c(0x4)
	float                                                        SpeedMonitorDuration;                              // 0x230(0x4)
	float                                                        SpeedChangeThresholdToBreakTrackingInMPS;          // 0x234(0x4)
	float                                                        TargetSpeedToConsiderAnchorLoweredInMPS;           // 0x238(0x4)
	char                                                         pad0x4_D4YZX[0x4];                                 // 0x23c(0x4)
	struct WeightedProbabilityRangeOfRanges                      TrackingLatencyTimes;                              // 0x240(0x30)
	struct WeightedProbabilityRangeOfRanges                      TrackingLatencyTimesWhenAnchorLowered;             // 0x270(0x30)
	class CurveFloat*                                            DistToTargetShipVSTrackingLatencyCurve;            // 0x2a0(0x8)
	struct ShipMovementParams                                    CirclingMovementParams;                            // 0x2a8(0x38)
	float                                                        TargetSpeedThresholdInKnots;                       // 0x2e0(0x4)
	float                                                        SecondsInFutureToProjectTargetLocation;            // 0x2e4(0x4)
	struct WeightedProbabilityRangeOfRanges                      CircleRadiuses;                                    // 0x2e8(0x30)
	struct WeightedProbabilityRangeOfRanges                      CirclingSpeedsInDegreesPerSecond;                  // 0x318(0x30)
	struct WeightedProbabilityRangeOfRanges                      TimesToCircleBeforeChangingRadius;                 // 0x348(0x30)
	float                                                        MinDistanceFromTargetToStartRam;                   // 0x378(0x4)
	float                                                        MaxDistanceFromTargetToStartRam;                   // 0x37c(0x4)
	float                                                        MaxSpeedToRamTarget;                               // 0x380(0x4)
	float                                                        RammingMaxTurnSpeed;                               // 0x384(0x4)
	float                                                        RammingTimeDampingScalar;                          // 0x388(0x4)
	float                                                        MinAngleToTargetToAttemptRam;                      // 0x38c(0x4)
	struct WeightedProbabilityRangeOfRanges                      RammingLocationOffsets;                            // 0x390(0x30)
	struct ShipMovementParams                                    SailingForwardMovementParams;                      // 0x3c0(0x38)
	float                                                        MinAllowedDistanceToObstacle;                      // 0x3f8(0x4)
	float                                                        MaxPathAvoidanceDistance;                          // 0x3fc(0x4)
	struct ShipMovementParams                                    PassiveSailingMovementParams;                      // 0x400(0x38)
	float                                                        ChanceToAnchor;                                    // 0x438(0x4)
	char                                                         pad0x4_W3LB8[0x4];                                 // 0x43c(0x4)
	struct WeightedProbabilityRangeOfRanges                      TimesToStayAnchored;                               // 0x440(0x30)
	int                                                          NumIslandsToVisitBeforeReturning;                  // 0x470(0x4)
	float                                                        DistanceFromIslandsToSailTo;                       // 0x474(0x4)
	float                                                        DistanceToTargetToDropAnchor;                      // 0x478(0x4)
	char                                                         pad0x4_QIXR9[0x4];                                 // 0x47c(0x4)
	TArray<class Class*>                                         AggressionOverrideImpactIDs;                       // 0x480(0x10)
};


// Size 0x28 (Full Size[0xf0] - InheritedSize[0xc8]
class AIShipObstacleComponent: public ActorComponent
{
public:
	char                                                         ObstacleType;                                      // 0xc8(0x1)
	char                                                         pad0x3_655MN[0x3];                                 // 0xc9(0x3)
	float                                                        Radius;                                            // 0xcc(0x4)
	char                                                         pad0x20_ZQID7[0x20];                               // 0xd0(0x20)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class AIShipBattlesDataAsset: public DataAsset
{
public:
	TArray<struct AIShipBattleParams>                            Battles;                                           // 0x28(0x10)
	TArray<struct Text>                                          SkellyCrewNames;                                   // 0x38(0x10)
	struct FText                                                 EncounterCompleteText;                             // 0x48(0x38)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class AIShipEncounterDesc: public DataAsset
{
public:
	struct Vector2D                                              Location;                                          // 0x28(0x8)
	float                                                        Radius;                                            // 0x30(0x4)
	bool                                                         Moveable;                                          // 0x34(0x1)
	bool                                                         ShowRevealBanner;                                  // 0x35(0x1)
	bool                                                         ShowCompleteBanner;                                // 0x36(0x1)
	bool                                                         ShouldSpawnShipCloud;                              // 0x37(0x1)
	bool                                                         RequirePlayerShipInZoneToSpawnShips;               // 0x38(0x1)
	bool                                                         EnableSecondsUntilEncounterEndsAfterLastCrewLeft;  // 0x39(0x1)
	char                                                         pad0x2_2A0S6[0x2];                                 // 0x3a(0x2)
	int                                                          SecondsUntilEncounterEndsAfterLastCrewLeft;        // 0x3c(0x4)
	bool                                                         EnableMaximumEncounterDuration;                    // 0x40(0x1)
	char                                                         pad0x3_EIHG3[0x3];                                 // 0x41(0x3)
	int                                                          MaximumEncounterDuration;                          // 0x44(0x4)
	char                                                         EncounterType;                                     // 0x48(0x1)
	char                                                         pad0x7_A6FEP[0x7];                                 // 0x49(0x7)
	TArray<struct AIShipEncounterWave>                           Waves;                                             // 0x50(0x10)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class AIShipContextParamsDataAsset: public DataAsset
{
public:
	float                                                        TopDeckPlayerTrackerRadius;                        // 0x28(0x4)
	float                                                        TimeSpentEmotingOnInitialSpawn;                    // 0x2c(0x4)
	bool                                                         ForceAIToAlwaysSpawn;                              // 0x30(0x1)
	char                                                         pad0x3_N3PSS[0x3];                                 // 0x31(0x3)
	float                                                        IntervalBetweenRepairDamageAssignments;            // 0x34(0x4)
	float                                                        IntervalBetweenUseCannonAssignments;               // 0x38(0x4)
	float                                                        DistForMinXYAIInteractableUtility;                 // 0x3c(0x4)
	float                                                        DistForMaxXYAIInteractableUtility;                 // 0x40(0x4)
	float                                                        MinXYAIInteractableUtility;                        // 0x44(0x4)
	float                                                        MaxXYAIInteractableUtility;                        // 0x48(0x4)
	float                                                        DistForMinZAIInteractableUtility;                  // 0x4c(0x4)
	float                                                        DistForMaxZAIInteractableUtility;                  // 0x50(0x4)
	float                                                        MinZAIInteractableUtility;                         // 0x54(0x4)
	float                                                        MaxZAIInteractableUtility;                         // 0x58(0x4)
	float                                                        MinInactiveRepairSpawnDelay;                       // 0x5c(0x4)
	float                                                        MaxInactiveRepairSpawnDelay;                       // 0x60(0x4)
	float                                                        SpawnSfxDistance;                                  // 0x64(0x4)
	float                                                        SinkSfxDistance;                                   // 0x68(0x4)
	int                                                          MinCannonAttackersWhenBoarded;                     // 0x6c(0x4)
	float                                                        StuckCheckInterval;                                // 0x70(0x4)
	float                                                        StuckCheckDistance;                                // 0x74(0x4)
	float                                                        MaxDistanceFromEncounter;                          // 0x78(0x4)
	float                                                        ShipFlippedAngle;                                  // 0x7c(0x4)
	float                                                        SecondsUntilKillAIAfterShipDefeated;               // 0x80(0x4)
	float                                                        SecondsDelayForAIShipDefeatedNotification;         // 0x84(0x4)
	bool                                                         EnableShipSurfacingMusic;                          // 0x88(0x1)
	char                                                         pad0x7_BHIZ3[0x7];                                 // 0x89(0x7)
};


// Size 0xb0 (Full Size[0xd8] - InheritedSize[0x28]
class AIShipEncounterSpawnParamsDataAsset: public DataAsset
{
public:
	float                                                        SpawnDepth;                                        // 0x28(0x4)
	float                                                        Radius;                                            // 0x2c(0x4)
	float                                                        MinSafeSpawnDistanceFromOtherShips;                // 0x30(0x4)
	float                                                        TimeDelayBetweenWaves;                             // 0x34(0x4)
	struct RelativeSpawnLocationGeneratorParams                  RelativeSpawnLocationParams;                       // 0x38(0xa0)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CursedCrewCustomisationInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class CursedSailsCampaignDataAsset: public DataAsset
{
public:
	TArray<struct CursedSailsBattleParams>                       Battles;                                           // 0x28(0x10)
};


// Size 0xe0 (Full Size[0x168] - InheritedSize[0x88]
class BTTask_RamTargetShip: public BTTask_BlackboardBase
{
public:
	char                                                         pad0xe0_H2005[0xe0];                               // 0x88(0xe0)
};


// Size 0x48 (Full Size[0xd0] - InheritedSize[0x88]
class BTTask_SailShipToLocation: public BTTask_BlackboardBase
{
public:
	struct BlackboardKeySelector                                 TargetLocationKey;                                 // 0x88(0x28)
	float                                                        DistanceThresholdToConsiderTargetReached;          // 0xb0(0x4)
	char                                                         pad0x1c_QKWDD[0x1c];                               // 0xb4(0x1c)
};


// Size 0x60 (Full Size[0xd0] - InheritedSize[0x70]
class BTService_UpdateTargetLocationForPassiveShip: public BTService
{
public:
	struct BlackboardKeySelector                                 TargetLocationKey;                                 // 0x70(0x28)
	float                                                        AngleOffsetFromForwardDegreesWhenNoIslands;        // 0x98(0x4)
	float                                                        TargetLocationDistanceWhenNoIslands;               // 0x9c(0x4)
	char                                                         pad0x30_ET5R5[0x30];                               // 0xa0(0x30)
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class AIShipEncounterDynamicDesc: public Object
{
public:
	TArray<struct AIShipSizeDynamicContexts>                     ShipPool;                                          // 0x28(0x10)
	class AIShipContextDescDataAsset*                            FinalShip;                                         // 0x38(0x8)
	struct AIShipEncounterDynamicBalancingDesc                   DynamicBalancingDesc;                              // 0x40(0x58)
};


// Size 0xa8 (Full Size[0x130] - InheritedSize[0x88]
class BTTask_SailShipForward: public BTTask_BlackboardBase
{
public:
	struct BlackboardKeySelector                                 ShouldSailForwardKey;                              // 0x88(0x28)
	struct BlackboardKeySelector                                 TimeToSailForwardKey;                              // 0xb0(0x28)
	struct BlackboardKeySelector                                 IsCaptainPresentKey;                               // 0xd8(0x28)
	char                                                         pad0x30_7YPDR[0x30];                               // 0x100(0x30)
};


// Size 0x170 (Full Size[0x780] - InheritedSize[0x610]
class AthenaAIShipController: public AthenaAIControllerBase
{
public:
	class BehaviorTree*                                          BTAsset;                                           // 0x610(0x8)
	char                                                         pad0x18_WK8FS[0x18];                               // 0x618(0x18)
	class AthenaAIShipControllerParamsDataAsset*                 ShipParamsDataAsset;                               // 0x630(0x8)
	class StatusEffectManagerComponent*                          StatusEffectManagerComponent;                      // 0x638(0x8)
	struct StandardAnchorDynamicsParameters                      AnchorDynamicsParams;                              // 0x640(0x28)
	char                                                         pad0x118_4ARHQ[0x118];                             // 0x668(0x118)
};


