#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xd0 (Full Size[0x470] - InheritedSize[0x3a0]
class AncientSanctuary: public Actor
{
public:
	char                                                         pad0x8_YXTKS[0x8];                                 // 0x3a0(0x8)
	TArray<uintptr_t>                                            SanctuaryCompartments;                             // 0x3a8(0x10)
	TArray<class ItemSpawnComponent*>                            ItemSpawners;                                      // 0x3b8(0x10)
	bool                                                         DespawnTreasureOnResetVault;                       // 0x3c8(0x1)
	char                                                         pad0x3_Y6ANP[0x3];                                 // 0x3c9(0x3)
	float                                                        SanctuaryResetTime;                                // 0x3cc(0x4)
	class InstantaneousPanicTeleportVolume*                      SanctuaryPanicVolume;                              // 0x3d0(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x3d8(0x8)
	class ShapeComponent*                                        SanctuaryOverlapVolume;                            // 0x3e0(0x8)
	char                                                         pad0x68_4IN9O[0x68];                               // 0x3e8(0x68)
	float                                                        ServerMigrationExclusionRadius;                    // 0x450(0x4)
	char                                                         pad0x1c_NQVMV[0x1c];                               // 0x454(0x1c)
};


