#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x48 (Full Size[0x3e8] - InheritedSize[0x3a0]
class AncientSanctuary: public Actor
{
public:
	char                                                         pad0x8_W9HR3[0x8];                                 // 0x3a0(0x8)
	TArray<uintptr_t>                                            SanctuaryCompartments;                             // 0x3a8(0x10)
	TArray<class ItemSpawnComponent*>                            ItemSpawners;                                      // 0x3b8(0x10)
	bool                                                         DespawnTreasureOnResetVault;                       // 0x3c8(0x1)
	char                                                         pad0x3_R05XA[0x3];                                 // 0x3c9(0x3)
	float                                                        SanctuaryResetTime;                                // 0x3cc(0x4)
	char                                                         pad0x8_KSZG2[0x8];                                 // 0x3d0(0x8)
	class InstantaneousPanicTeleportVolume*                      SanctuaryPanicVolume;                              // 0x3d8(0x8)
	char                                                         pad0x8_LGY6Z[0x8];                                 // 0x3e0(0x8)
};


