#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xa0
struct AnimNode_HandIKRetargeting
{
public:
	char                                                         pad0x58_S1EMW[0x58];                               // 0x0(0x58)
	struct BoneReference                                         RightHandFK;                                       // 0x58(0xc)
	struct BoneReference                                         LeftHandFK;                                        // 0x64(0xc)
	struct BoneReference                                         RightHandIK;                                       // 0x70(0xc)
	struct BoneReference                                         LeftHandIK;                                        // 0x7c(0xc)
	TArray<struct BoneReference>                                 IKBonesToMove;                                     // 0x88(0x10)
	float                                                        HandFKWeight;                                      // 0x98(0x4)
	char                                                         pad0x4_WXZN1[0x4];                                 // 0x9c(0x4)
};


// Size 0x78
struct AnimNode_CopyBone
{
public:
	char                                                         pad0x58_416GN[0x58];                               // 0x0(0x58)
	struct BoneReference                                         SourceBone;                                        // 0x58(0xc)
	struct BoneReference                                         TargetBone;                                        // 0x64(0xc)
	bool                                                         bCopyTranslation;                                  // 0x70(0x1)
	bool                                                         bCopyRotation;                                     // 0x71(0x1)
	bool                                                         bCopyScale;                                        // 0x72(0x1)
	char                                                         pad0x5_5ZAZQ[0x5];                                 // 0x73(0x5)
};


// Size 0x78
struct AnimNode_RotationMultiplier
{
public:
	char                                                         pad0x58_70NCC[0x58];                               // 0x0(0x58)
	struct BoneReference                                         TargetBone;                                        // 0x58(0xc)
	struct BoneReference                                         SourceBone;                                        // 0x64(0xc)
	float                                                        Multiplier;                                        // 0x70(0x4)
	char                                                         RotationAxisToRefer;                               // 0x74(0x1)
	bool                                                         bIsAdditive;                                       // 0x75(0x1)
	char                                                         pad0x2_P1CE1[0x2];                                 // 0x76(0x2)
};


// Size 0xe0
struct AnimNode_Trail
{
public:
	char                                                         pad0x58_Q3A9S[0x58];                               // 0x0(0x58)
	struct BoneReference                                         TrailBone;                                         // 0x58(0xc)
	int                                                          ChainLength;                                       // 0x64(0x4)
	char                                                         ChainBoneAxis;                                     // 0x68(0x1)
	bool                                                         bInvertChainBoneAxis;                              // 0x69(0x1)
	bool                                                         bLimitStretch;                                     // 0x6a(0x1)
	char                                                         pad0x1_PCV4X[0x1];                                 // 0x6b(0x1)
	float                                                        TrailRelaxation;                                   // 0x6c(0x4)
	float                                                        StretchLimit;                                      // 0x70(0x4)
	struct Vector                                                FakeVelocity;                                      // 0x74(0xc)
	bool                                                         bActorSpaceFakeVel;                                // 0x80(0x1)
	char                                                         pad0x5f_YB7YY[0x5f];                               // 0x81(0x5f)
};


// Size 0xd0
struct AnimNode_Fabrik
{
public:
	char                                                         pad0x60_3TJP9[0x60];                               // 0x0(0x60)
	struct Transform                                             EffectorTransform;                                 // 0x60(0x30)
	char                                                         EffectorTransformSpace;                            // 0x90(0x1)
	char                                                         pad0x3_36FCR[0x3];                                 // 0x91(0x3)
	struct BoneReference                                         EffectorTransformBone;                             // 0x94(0xc)
	char                                                         EffectorRotationSource;                            // 0xa0(0x1)
	char                                                         pad0x3_FI1YC[0x3];                                 // 0xa1(0x3)
	struct BoneReference                                         TipBone;                                           // 0xa4(0xc)
	struct BoneReference                                         RootBone;                                          // 0xb0(0xc)
	float                                                        Precision;                                         // 0xbc(0x4)
	int                                                          MaxIterations;                                     // 0xc0(0x4)
	bool                                                         bEnableDebugDraw;                                  // 0xc4(0x1)
	char                                                         pad0xb_ZDFG7[0xb];                                 // 0xc5(0xb)
};


// Size 0x90
struct AnimNode_ObserveBone
{
public:
	char                                                         pad0x58_DOBMZ[0x58];                               // 0x0(0x58)
	struct BoneReference                                         BoneToObserve;                                     // 0x58(0xc)
	char                                                         DisplaySpace;                                      // 0x64(0x1)
	bool                                                         bRelativeToRefPose;                                // 0x65(0x1)
	char                                                         pad0x2_PI9AQ[0x2];                                 // 0x66(0x2)
	struct Vector                                                Translation;                                       // 0x68(0xc)
	struct Rotator                                               Rotation;                                          // 0x74(0xc)
	struct Vector                                                Scale;                                             // 0x80(0xc)
	char                                                         pad0x4_X2LB6[0x4];                                 // 0x8c(0x4)
};


// Size 0x90
struct AnimNode_ModifyBone
{
public:
	char                                                         pad0x58_86RZ5[0x58];                               // 0x0(0x58)
	struct BoneReference                                         BoneToModify;                                      // 0x58(0xc)
	struct Vector                                                Translation;                                       // 0x64(0xc)
	struct Rotator                                               Rotation;                                          // 0x70(0xc)
	struct Vector                                                Scale;                                             // 0x7c(0xc)
	char                                                         TranslationMode;                                   // 0x88(0x1)
	char                                                         RotationMode;                                      // 0x89(0x1)
	char                                                         ScaleMode;                                         // 0x8a(0x1)
	char                                                         TranslationSpace;                                  // 0x8b(0x1)
	char                                                         RotationSpace;                                     // 0x8c(0x1)
	char                                                         ScaleSpace;                                        // 0x8d(0x1)
	char                                                         pad0x2_2TZ5P[0x2];                                 // 0x8e(0x2)
};


// Size 0xa8
struct AnimNode_SpringBone
{
public:
	char                                                         pad0x58_IA0NQ[0x58];                               // 0x0(0x58)
	struct BoneReference                                         SpringBone;                                        // 0x58(0xc)
	bool                                                         bLimitDisplacement;                                // 0x64(0x1)
	char                                                         pad0x3_4DNLG[0x3];                                 // 0x65(0x3)
	float                                                        MaxDisplacement;                                   // 0x68(0x4)
	float                                                        SpringStiffness;                                   // 0x6c(0x4)
	float                                                        SpringDamping;                                     // 0x70(0x4)
	float                                                        ErrorResetThresh;                                  // 0x74(0x4)
	bool                                                         bNoZSpring;                                        // 0x78(0x1)
	bool                                                         bTranslateX;                                       // 0x79(0x1)
	bool                                                         bTranslateY;                                       // 0x7a(0x1)
	bool                                                         bTranslateZ;                                       // 0x7b(0x1)
	bool                                                         bRotateX;                                          // 0x7c(0x1)
	bool                                                         bRotateY;                                          // 0x7d(0x1)
	bool                                                         bRotateZ;                                          // 0x7e(0x1)
	char                                                         pad0x29_7THN0[0x29];                               // 0x7f(0x29)
};


// Size 0xc0
struct AnimNode_LookAt
{
public:
	char                                                         pad0x58_Q7H7T[0x58];                               // 0x0(0x58)
	struct BoneReference                                         BoneToModify;                                      // 0x58(0xc)
	struct BoneReference                                         LookAtBone;                                        // 0x64(0xc)
	struct Vector                                                LookAtLocation;                                    // 0x70(0xc)
	char                                                         LookAtAxis;                                        // 0x7c(0x1)
	bool                                                         bUseLookUpAxis;                                    // 0x7d(0x1)
	char                                                         LookUpAxis;                                        // 0x7e(0x1)
	char                                                         pad0x1_SQGQ8[0x1];                                 // 0x7f(0x1)
	float                                                        LookAtClamp;                                       // 0x80(0x4)
	char                                                         InterpolationType;                                 // 0x84(0x1)
	char                                                         pad0x3_1DQE1[0x3];                                 // 0x85(0x3)
	float                                                        InterpolationTime;                                 // 0x88(0x4)
	float                                                        InterpolationTriggerThreashold;                    // 0x8c(0x4)
	bool                                                         bEnableDebug;                                      // 0x90(0x1)
	char                                                         pad0x2f_XQE86[0x2f];                               // 0x91(0x2f)
};


// Size 0xc0
struct AnimNode_CopyPoseFromMesh
{
public:
	char                                                         pad0x30_CPNQU[0x30];                               // 0x0(0x30)
	class SkeletalMeshComponent*                                 SourceMeshComponent;                               // 0x30(0x8)
	bool                                                         bUseAttachedParent;                                // 0x38(0x1)
	char                                                         pad0x87_TBM9V[0x87];                               // 0x39(0x87)
};


// Size 0xa0
struct AnimNode_TwoBoneIK
{
public:
	char                                                         pad0x58_K8RJC[0x58];                               // 0x0(0x58)
	struct BoneReference                                         IKBone;                                            // 0x58(0xc)
	struct Vector                                                EffectorLocation;                                  // 0x64(0xc)
	struct Vector                                                JointTargetLocation;                               // 0x70(0xc)
	struct Vector2D                                              StretchLimits;                                     // 0x7c(0x8)
	struct FName                                                 EffectorSpaceBoneName;                             // 0x84(0x8)
	bool                                                         bTakeRotationFromEffectorSpace;                    // 0x8c(0x1)
	bool                                                         bMaintainEffectorRelRot;                           // 0x8c(0x1)
	bool                                                         bAllowStretching;                                  // 0x8c(0x1)
	char                                                         pad0x3_CQWJT[0x3];                                 // 0x8d(0x3)
	char                                                         EffectorLocationSpace;                             // 0x90(0x1)
	char                                                         JointTargetLocationSpace;                          // 0x91(0x1)
	char                                                         pad0x2_LJ6KV[0x2];                                 // 0x92(0x2)
	struct FName                                                 JointTargetSpaceBoneName;                          // 0x94(0x8)
	char                                                         pad0x4_FGIEI[0x4];                                 // 0x9c(0x4)
};


// Size 0x58
struct AnimNode_SkeletalControlBase
{
public:
	char                                                         pad0x30_WMWZ5[0x30];                               // 0x0(0x30)
	struct ComponentSpacePoseLink                                ComponentPose;                                     // 0x30(0x18)
	float                                                        Alpha;                                             // 0x48(0x4)
	struct InputScaleBias                                        AlphaScaleBias;                                    // 0x4c(0x8)
	char                                                         pad0x4_H1AJX[0x4];                                 // 0x54(0x4)
};


// Size 0xa0
struct AnimNode_BoneDrivenController
{
public:
	char                                                         pad0x58_TSEUP[0x58];                               // 0x0(0x58)
	struct BoneReference                                         SourceBone;                                        // 0x58(0xc)
	char                                                         SourceComponent;                                   // 0x64(0x1)
	char                                                         pad0x3_RYRG9[0x3];                                 // 0x65(0x3)
	class CurveFloat*                                            DrivingCurve;                                      // 0x68(0x8)
	float                                                        Multiplier;                                        // 0x70(0x4)
	bool                                                         bUseRange;                                         // 0x74(0x1)
	char                                                         pad0x3_DR6JG[0x3];                                 // 0x75(0x3)
	float                                                        RangeMin;                                          // 0x78(0x4)
	float                                                        RangeMax;                                          // 0x7c(0x4)
	float                                                        RemappedMin;                                       // 0x80(0x4)
	float                                                        RemappedMax;                                       // 0x84(0x4)
	struct BoneReference                                         TargetBone;                                        // 0x88(0xc)
	char                                                         TargetComponent;                                   // 0x94(0x1)
	char                                                         pad0x3_7Q75S[0x3];                                 // 0x95(0x3)
	bool                                                         bAffectTargetTranslationX;                         // 0x98(0x1)
	bool                                                         bAffectTargetTranslationY;                         // 0x98(0x1)
	bool                                                         bAffectTargetTranslationZ;                         // 0x98(0x1)
	bool                                                         bAffectTargetRotationX;                            // 0x98(0x1)
	bool                                                         bAffectTargetRotationY;                            // 0x98(0x1)
	bool                                                         bAffectTargetRotationZ;                            // 0x98(0x1)
	bool                                                         bAffectTargetScaleX;                               // 0x98(0x1)
	bool                                                         bAffectTargetScaleY;                               // 0x98(0x1)
	bool                                                         bAffectTargetScaleZ;                               // 0x99(0x1)
	char                                                         pad0x2_XYJA0[0x2];                                 // 0x9a(0x2)
	char                                                         ModificationMode;                                  // 0x9c(0x1)
	char                                                         pad0x3_1VBH2[0x3];                                 // 0x9d(0x3)
};


