#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x50 (Full Size[0x418] - InheritedSize[0x3c8]
class AsymmetricClientObject: public Actor
{
public:
	class BoxComponent*                                          BaseComponent;                                     // 0x3e0(0x8)
	class StaticMeshMemoryConstraintComponent*                   ThirdPersonMesh;                                   // 0x3e8(0x8)
	class WaterInteractionComponent*                             WaterInteractionComponent;                         // 0x3f0(0x8)
	class BuoyancyComponent*                                     BuoyancyComponent;                                 // 0x3f8(0x8)
	class SpawnDependentTrackedOwnerComponent*                   SpawnDependentTrackedOwnerComponent;               // 0x400(0x8)
	struct Rotator                                               RotationWhenPlacingWorldProxy;                     // 0x408(0xc)
	float                                                        ZOffsetWhenPlacingWorldProxy;                      // 0x414(0x4)
};


// Size 0x58 (Full Size[0x420] - InheritedSize[0x3c8]
class AsymmetricObjectServerManager: public Actor
{
public:
	class AsymmetricClientObject*                                SpawnedObject;                                     // 0x3e0(0x8)
	class SceneComponent*                                        SceneComponent;                                    // 0x3e8(0x8)
	struct StringAssetReference                                  AsymmetricObjectAsset;                             // 0x3f0(0x10)
	assetclass                                                   ForcedAsymmetricObjectAsset;                       // 0x400(0x20)
};


