#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x50 (Full Size[0x3f0] - InheritedSize[0x3a0]
class AsymmetricClientObject: public Actor
{
public:
	char                                                         pad0x18_LRX2E[0x18];                               // 0x3a0(0x18)
	class BoxComponent*                                          BaseComponent;                                     // 0x3b8(0x8)
	class StaticMeshMemoryConstraintComponent*                   ThirdPersonMesh;                                   // 0x3c0(0x8)
	class WaterInteractionComponent*                             WaterInteractionComponent;                         // 0x3c8(0x8)
	class BuoyancyComponent*                                     BuoyancyComponent;                                 // 0x3d0(0x8)
	class SpawnDependentTrackedOwnerComponent*                   SpawnDependentTrackedOwnerComponent;               // 0x3d8(0x8)
	struct Rotator                                               RotationWhenPlacingWorldProxy;                     // 0x3e0(0xc)
	float                                                        ZOffsetWhenPlacingWorldProxy;                      // 0x3ec(0x4)
};


// Size 0x58 (Full Size[0x3f8] - InheritedSize[0x3a0]
class AsymmetricObjectServerManager: public Actor
{
public:
	char                                                         pad0x18_8RGXI[0x18];                               // 0x3a0(0x18)
	class AsymmetricClientObject*                                SpawnedObject;                                     // 0x3b8(0x8)
	class SceneComponent*                                        SceneComponent;                                    // 0x3c0(0x8)
	struct StringAssetReference                                  AsymmetricObjectAsset;                             // 0x3c8(0x10)
	char                                                         pad0x20_GRIR3[0x20];                               // 0x3d8(0x20)
};


