#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x18
struct CapturedPostLoadExcess
{
public:
	struct FString                                               ObjectName;                                        // 0x0(0x10)
	double                                                       PostLoadDuration;                                  // 0x10(0x8)
};


// Size 0x48
struct AsyncExcessiveLoadTelemetryEvent
{
public:
	int                                                          FrameCounter;                                      // 0x0(0x4)
	char                                                         pad0x4_B46GO[0x4];                                 // 0x4(0x4)
	double                                                       ExpectedAsyncLoadingTime;                          // 0x8(0x8)
	double                                                       ActualAsyncLoadingTime;                            // 0x10(0x8)
	TArray<String>                                               AssetRequestList;                                  // 0x18(0x10)
	TArray<String>                                               LoadedAssetList;                                   // 0x28(0x10)
	TArray<struct CapturedPostLoadExcess>                        PostLoadExcess;                                    // 0x38(0x10)
};


