#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x28
struct DrawDebugItemMessage
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x7_PMG6D[0x7];                                 // 0x9(0x7)
	struct FString                                               Message;                                           // 0x10(0x10)
	struct Color                                                 Colour;                                            // 0x20(0x4)
	char                                                         pad0x4_A55GH[0x4];                                 // 0x24(0x4)
};


// Size 0x18
struct SphereData
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
	int                                                          Segments;                                          // 0x10(0x4)
	struct Color                                                 Colour;                                            // 0x14(0x4)
};


// Size 0x2c
struct DrawDebugItemLine
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x3_RYLSG[0x3];                                 // 0x9(0x3)
	struct Vector                                                LineStart;                                         // 0xc(0xc)
	struct Vector                                                LineEnd;                                           // 0x18(0xc)
	struct Color                                                 Colour;                                            // 0x24(0x4)
	float                                                        Thickness;                                         // 0x28(0x4)
};


// Size 0x40
struct DrawDebugItemCapsule
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x3_U8NSC[0x3];                                 // 0x9(0x3)
	struct Vector                                                CentrePos;                                         // 0xc(0xc)
	float                                                        HalfHeight;                                        // 0x18(0x4)
	float                                                        Radius;                                            // 0x1c(0x4)
	struct Quat                                                  Rotation;                                          // 0x20(0x10)
	struct Color                                                 Colour;                                            // 0x30(0x4)
	char                                                         pad0xc_W47DB[0xc];                                 // 0x34(0xc)
};


// Size 0xc
struct EventHitchDetected
{
public:
	char                                                         pad0xc_O9ADH[0xc];                                 // 0x0(0xc)
};


// Size 0x38
struct DrawDebugItemString
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x7_4391U[0x7];                                 // 0x9(0x7)
	struct FString                                               String;                                            // 0x10(0x10)
	struct Color                                                 Colour;                                            // 0x20(0x4)
	struct Vector                                                StringPos;                                         // 0x24(0xc)
	bool                                                         DrawShadow;                                        // 0x30(0x1)
	char                                                         pad0x3_NRSQH[0x3];                                 // 0x31(0x3)
	float                                                        FontScale;                                         // 0x34(0x4)
};


// Size 0x20
struct DrawDebugItemSphere
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x3_6XHCB[0x3];                                 // 0x9(0x3)
	struct Vector                                                CentrePos;                                         // 0xc(0xc)
	float                                                        Radius;                                            // 0x18(0x4)
	struct Color                                                 Colour;                                            // 0x1c(0x4)
};


// Size 0x30
struct DrawDebugItemCylinder
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x3_9FAJ1[0x3];                                 // 0x9(0x3)
	struct Vector                                                StartPos;                                          // 0xc(0xc)
	struct Vector                                                EndPos;                                            // 0x18(0xc)
	float                                                        Radius;                                            // 0x24(0x4)
	int                                                          Segments;                                          // 0x28(0x4)
	struct Color                                                 Colour;                                            // 0x2c(0x4)
};


// Size 0x48
struct DrawDebugItemSector
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x3_EDLRK[0x3];                                 // 0x9(0x3)
	float                                                        RotationAngle;                                     // 0xc(0x4)
	struct Vector                                                Centre;                                            // 0x10(0xc)
	float                                                        SectorAngle;                                       // 0x1c(0x4)
	float                                                        Radius;                                            // 0x20(0x4)
	struct Color                                                 Colour;                                            // 0x24(0x4)
	struct Vector                                                ZeroAngleVector;                                   // 0x28(0xc)
	struct Vector                                                RotationAxis;                                      // 0x34(0xc)
	float                                                        SubAngles;                                         // 0x40(0x4)
	float                                                        Thickness;                                         // 0x44(0x4)
};


// Size 0x50
struct DrawDebugItemBox
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x3_WBJOU[0x3];                                 // 0x9(0x3)
	struct Vector                                                CentrePos;                                         // 0xc(0xc)
	struct Vector                                                Box;                                               // 0x18(0xc)
	char                                                         pad0xc_RR7AM[0xc];                                 // 0x24(0xc)
	struct Quat                                                  Rotation;                                          // 0x30(0x10)
	struct Color                                                 Colour;                                            // 0x40(0x4)
	char                                                         pad0xc_5BLKU[0xc];                                 // 0x44(0xc)
};


// Size 0x40
struct DrawDebugItemCircle
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x3_P7Q1S[0x3];                                 // 0x9(0x3)
	struct Vector                                                CentrePos;                                         // 0xc(0xc)
	struct Vector                                                YAxis;                                             // 0x18(0xc)
	struct Vector                                                ZAxis;                                             // 0x24(0xc)
	float                                                        Radius;                                            // 0x30(0x4)
	int                                                          Segments;                                          // 0x34(0x4)
	struct Color                                                 Colour;                                            // 0x38(0x4)
	float                                                        LineThickness;                                     // 0x3c(0x4)
};


