#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x28
struct HitRegSnapshotDisagreementTelemetryEntry
{
public:
	int                                                          SubAttackGroupId;                                  // 0x0(0x4)
	struct FString                                               ServerHitActor;                                    // 0x8(0x10)
	struct FString                                               AttackingClientHitActor;                           // 0x18(0x10)
};


// Size 0x10
struct EventPlayerCharacterTeleported
{
public:
	class Actor*                                                 AthenaCharacter;                                   // 0x0(0x8)
	bool                                                         IsOnFerry;                                         // 0x8(0x1)
};


// Size 0x8
struct ArenaSuspensionState
{
public:
	bool                                                         IsUserSuspended;                                   // 0x0(0x1)
	int                                                          SuspensionTimeRemainingInMinutes;                  // 0x4(0x4)
};


// Size 0x20
struct EmblemUnlockedEvent
{
public:
	struct Guid                                                  EmblemId;                                          // 0x0(0x10)
	struct FString                                               Sig;                                               // 0x10(0x10)
};


// Size 0x40
struct ContestLeaderboardEntry
{
public:
	struct FString                                               CrewIconPath;                                      // 0x18(0x10)
	bool                                                         IsMyCrew;                                          // 0x28(0x1)
	int                                                          Amount;                                            // 0x2c(0x4)
	struct FString                                               DisplayAmount;                                     // 0x30(0x10)
};


// Size 0x18
struct BrazierExtinguishCrewSizeTimes
{
public:
	int                                                          CrewSize;                                          // 0x0(0x4)
	TArray<float>                                                ExtinguishTimes;                                   // 0x8(0x10)
};


// Size 0x18
struct TrackedActorTelemetryFragment
{
public:
	struct JsonObjectWrapper                                     Json;                                              // 0x0(0x18)
};


// Size 0x8
struct EventMovedByActorStart
{
public:
	class Actor*                                                 MovementInstigator;                                // 0x0(0x8)
};


// Size 0x10
struct RequestEmblemProgressFailedEvent
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
};


// Size 0x1
struct NavigateToMenuEvent
{
public:
	char                                                         Action;                                            // 0x0(0x1)
};


// Size 0x28
struct QuestInfo
{
public:
	struct Guid                                                  QuestId;                                           // 0x0(0x10)
	struct FString                                               Name;                                              // 0x10(0x10)
	char                                                         Status;                                            // 0x20(0x1)
	char                                                         Type;                                              // 0x21(0x1)
};


// Size 0x60
struct ThrowGrenadeMulticastRpc
{
public:
	class Actor*                                                 Wielder;                                           // 0x18(0x8)
	class Grenade*                                               Grenade;                                           // 0x20(0x8)
	struct Vector                                                ServerThrowLocation;                               // 0x28(0xc)
	struct Vector                                                LaunchVelocity;                                    // 0x34(0xc)
	class UClass*                                                ThrownProjectileType;                              // 0x40(0x8)
	float                                                        FirstPersonScaleModifier;                          // 0x48(0x4)
	float                                                        ProjectileGravityScale;                            // 0x4c(0x4)
	struct Vector                                                FirstPersonThrowOffset;                            // 0x50(0xc)
	bool                                                         UseVisualThrowOffset;                              // 0x5c(0x1)
};


// Size 0x10
struct LobbyCreationRequestModel
{
public:
	struct FString                                               SessionName;                                       // 0x0(0x10)
};


// Size 0x14
struct LinearTransitionLadderActionStateParams
{
public:
	float                                                        Duration;                                          // 0x10(0x4)
};


// Size 0x1
struct UseSingleStickChangedEvent
{
public:
	char                                                         UseSingleStick;                                    // 0x0(0x1)
};


// Size 0x50
struct AthenaAnimationJumpingThirdPersonAnimData
{
public:
	TArray<class BlendSpace*>                                    JumpStart;                                         // 0x0(0x10)
	TArray<class BlendSpace*>                                    JumpCycle;                                         // 0x10(0x10)
	TArray<class BlendSpace*>                                    PreImpact;                                         // 0x20(0x10)
	TArray<class BlendSpace*>                                    LandLight;                                         // 0x30(0x10)
	TArray<class BlendSpace*>                                    LandHeavy;                                         // 0x40(0x10)
};


// Size 0x10
struct PlayerNamesFailedEvent
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
};


// Size 0x8
struct ServerPopulationTelemetryFragment
{
public:
	int                                                          NumberOfPlayers;                                   // 0x0(0x4)
	int                                                          NumberOfCrews;                                     // 0x4(0x4)
};


// Size 0x18
struct PlayersGuildRewardUnlockedActivityMessageModel
{
public:
	struct FString                                               EntitlementId;                                     // 0x0(0x10)
	uint32                                                       RewardLevel;                                       // 0x10(0x4)
	uint32                                                       RewardDistinctionLevel;                            // 0x14(0x4)
};


// Size 0x30
struct EventCargoRunCrateDelivered
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct Guid                                                  PickUpId;                                          // 0x10(0x10)
	class BootyItemInfo*                                         ItemInfo;                                          // 0x20(0x8)
	struct FName                                                 CompanyAffiliation;                                // 0x28(0x8)
};


// Size 0x8
struct EventConcealingObjectUsed
{
public:
	class Actor*                                                 UsingActor;                                        // 0x0(0x8)
};


// Size 0x20
struct ServerCameraFadeCompleteAckNetworkEvent
{
public:
	char                                                         Reason;                                            // 0x18(0x1)
};


// Size 0x18
struct EmblemDefinitionActiveDuration
{
public:
	bool                                                         HasActiveDuration;                                 // 0x0(0x1)
	struct DateTime                                              ActiveFrom;                                        // 0x8(0x8)
	struct DateTime                                              ActiveUntil;                                       // 0x10(0x8)
};


// Size 0xc0
struct BalanceableWalkwayAnimation
{
public:
	class Actor*                                                 CachedPlayerCharacter;                             // 0x0(0x8)
};


// Size 0x20
struct UniversalDescriptionParagraph
{
public:
	struct FString                                               Heading;                                           // 0x0(0x10)
	TArray<String>                                               Sentences;                                         // 0x10(0x10)
};


// Size 0x18
struct FaunaAnimationStartledStructure
{
public:
	class AnimSequence*                                          StartledLowAgitation;                              // 0x0(0x8)
	class AnimSequence*                                          StartledHighAgitation;                             // 0x8(0x8)
	class AnimSequence*                                          StartledOneShot;                                   // 0x10(0x8)
};


// Size 0x18
struct AthenaAnimationPlayingEquipAnimations
{
public:
	class AnimSequence*                                          Equip;                                             // 0x0(0x8)
	class BlendSpace*                                            EquipAsBlendSpace;                                 // 0x8(0x8)
	class BlendSpace*                                            EquipSwimming;                                     // 0x10(0x8)
};


// Size 0x20
struct SkeletonAudioEvents
{
public:
	class WwiseEvent*                                            PlayLoop;                                          // 0x0(0x8)
	class WwiseEvent*                                            StopLoop;                                          // 0x8(0x8)
	class WwiseEvent*                                            StartOneShot;                                      // 0x10(0x8)
	class WwiseEvent*                                            LeaveOneShot;                                      // 0x18(0x8)
};


// Size 0x10
struct ItemProxyImpactVfxParams
{
public:
	char                                                         SurfaceType;                                       // 0x0(0x1)
	class Object*                                                Particles;                                         // 0x8(0x8)
};


// Size 0x40
struct HealthChange
{
public:
	float                                                        From;                                              // 0x0(0x4)
	float                                                        To;                                                // 0x4(0x4)
	char                                                         Reason;                                            // 0x8(0x1)
	class Actor*                                                 DirectInstigator;                                  // 0x10(0x8)
	class Actor*                                                 RootInstigator;                                    // 0x18(0x8)
	struct Guid                                                  IncidentId;                                        // 0x20(0x10)
	struct Vector_NetQuantize10                                  DirectInstigatorLocation;                          // 0x30(0xc)
};


// Size 0x8
struct VoyageLocationDistance
{
public:
	float                                                        Min;                                               // 0x0(0x4)
	float                                                        Max;                                               // 0x4(0x4)
};


// Size 0x10
struct GuildSessionFailedTelemetryEvent
{
public:
	struct FString                                               Error;                                             // 0x0(0x10)
};


// Size 0x10
struct CrewAttackedByGameEventEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0xa0
struct AimSensitivityRuntimeData
{
public:
	map                                                          MouseData;                                         // 0x0(0x50)
	map                                                          ControllerData;                                    // 0x50(0x50)
};


// Size 0x10
struct ApplyDamageGameServerRequestModel
{
public:
	int                                                          ActorId;                                           // 0x0(0x4)
	float                                                        Damage;                                            // 0x4(0x4)
	int                                                          InstigatorId;                                      // 0x8(0x4)
	char                                                         Reason;                                            // 0xc(0x1)
};


// Size 0x30
struct LandmarkSoundPlayedEvent
{
public:
	int                                                          PlayingId;                                         // 0x0(0x4)
	class WwiseEvent*                                            AudioEvent;                                        // 0x8(0x8)
	struct WwiseEmitter                                          Emitter;                                           // 0x10(0x20)
};


// Size 0x20
struct ReapersTributeShipCrewTributeChangedBoxedRpc
{
public:
	int                                                          NewTributeCount;                                   // 0x18(0x4)
	int                                                          OldTributeCount;                                   // 0x1c(0x4)
};


// Size 0x28
struct PlayerPlatformInfoResponse
{
public:
	char                                                         Platform;                                          // 0x0(0x1)
	struct FString                                               PlatformUsername;                                  // 0x8(0x10)
	struct FString                                               PlatformUserId;                                    // 0x18(0x10)
};


// Size 0x8
struct UpdateSnapshotVersionData
{
public:
	struct FName                                                 Version;                                           // 0x0(0x8)
};


// Size 0x1
struct EnableServerCreationEvent
{
public:
	bool                                                         Value;                                             // 0x0(0x1)
};


// Size 0xc
struct GhostPlayModeParameters
{
public:
	char                                                         PlayMode;                                          // 0x0(0x1)
	float                                                        RotationPerSecond;                                 // 0x4(0x4)
	float                                                        DisplacementPerSecond;                             // 0x8(0x4)
};


// Size 0x18
struct CutSceneLoadData
{
public:
	struct StringAssetReference                                  SequenceToPlayAssetReference;                      // 0x0(0x10)
	class Actor*                                                 SpawnablesParent;                                  // 0x10(0x8)
};


// Size 0x10
struct EventEnteredShipLadder
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	class Actor*                                                 Actor;                                             // 0x8(0x8)
};


// Size 0x1
struct ShipTrinketInteractionDisabledSettingChanged
{
public:
	bool                                                         ShipTrinketInteractionsDisabled;                   // 0x0(0x1)
};


// Size 0x30
struct ClothingLoadout
{
public:
	TArray<class Class*>                                         Items;                                             // 0x0(0x10)
	TArray<class Class*>                                         CachedEmoteItems;                                  // 0x10(0x10)
	TArray<class Class*>                                         CachedWalkableEmoteItems;                          // 0x20(0x10)
};


// Size 0x8
struct EventStorageContainerDestroyed
{
public:
	class Object*                                                Replenishable;                                     // 0x0(0x8)
};


// Size 0x10
struct AthenaAnimationWheelArmOverlayAnimData
{
public:
	class BlendSpace1D*                                          ArmLower;                                          // 0x0(0x8)
	class BlendSpace1D*                                          ArmRaise;                                          // 0x8(0x8)
};


// Size 0x10
struct PlayerAggregatePositionTelemetryFragment
{
public:
	TArray<struct Vector>                                        PositionData;                                      // 0x0(0x10)
};


// Size 0x18
struct FaunaAnimationSnakeCharmStructure
{
public:
	class AnimSequence*                                          CharmIn;                                           // 0x0(0x8)
	class AnimSequence*                                          CharmLoop;                                         // 0x8(0x8)
	class AnimSequence*                                          CharmOut;                                          // 0x10(0x8)
};


// Size 0x8
struct PetAnimationWeighting
{
public:
	char                                                         AnimationState;                                    // 0x0(0x1)
	float                                                        Weighting;                                         // 0x4(0x4)
};


// Size 0x78
struct SceneDialogueStructure
{
public:
	struct FText                                                 LocalisableName;                                   // 0x0(0x38)
	struct FText                                                 Text;                                              // 0x38(0x38)
	char                                                         ChatType;                                          // 0x70(0x1)
	float                                                        DelayAfter;                                        // 0x74(0x4)
};


// Size 0x38
struct GameEventSchedulerOnDemandConfigSelectionTelemetryEvent
{
public:
	TArray<struct Name>                                          CurrentMainConfigNames;                            // 0x0(0x10)
	TArray<struct Name>                                          FilteredMainConfigNamesByType;                     // 0x10(0x10)
	char                                                         GameEventTypeFilter;                               // 0x20(0x1)
	struct FString                                               SelectedConfigName;                                // 0x28(0x10)
};


// Size 0x2
struct EventFishingRodFishingStateChanged
{
public:
	bool                                                         IsInFishingState;                                  // 0x0(0x1)
	bool                                                         IsFishHooked;                                      // 0x1(0x1)
};


// Size 0x98
struct StoreCatalogItem
{
public:
	struct FString                                               ProductId;                                         // 0x0(0x10)
	struct FString                                               Title;                                             // 0x10(0x10)
	struct FString                                               Description;                                       // 0x20(0x10)
	struct FString                                               FormattedPrice;                                    // 0x30(0x10)
	struct FString                                               FormattedBasePrice;                                // 0x40(0x10)
	struct FString                                               CurrencyCode;                                      // 0x50(0x10)
	bool                                                         IsOnSale;                                          // 0x60(0x1)
	struct DateTime                                              SaleEndDate;                                       // 0x68(0x8)
	struct FString                                               ImageUri;                                          // 0x70(0x10)
	TArray<String>                                               MetaTags;                                          // 0x80(0x10)
	int                                                          DisplayPriority;                                   // 0x90(0x4)
};


// Size 0x78
struct Alliance
{
public:
	struct Guid                                                  AllianceId;                                        // 0x0(0x10)
	TArray<struct Guid>                                          Crews;                                             // 0x10(0x10)
	char                                                         AllianceIndex;                                     // 0x20(0x1)
};


// Size 0x68
struct EventEmblemUnlockedNotification
{
public:
	struct FName                                                 CompanyName;                                       // 0x0(0x8)
	struct FName                                                 FriendlyName;                                      // 0x8(0x8)
	struct FText                                                 EmblemName;                                        // 0x10(0x38)
	struct FString                                               EmblemUrl;                                         // 0x48(0x10)
	struct FString                                               BackgroundUrl;                                     // 0x58(0x10)
};


// Size 0x20
struct RequestContextualVoyageHintPopupEvent
{
public:
	char                                                         PopupHintType;                                     // 0x18(0x1)
	bool                                                         IsDVR;                                             // 0x19(0x1)
};


// Size 0x40
struct NPCOnSurfaceCannonManagerCrewSizeSettings
{
public:
	int                                                          CrewSize;                                          // 0x0(0x4)
	struct WeightedProbabilityRangeOfRanges                      TimeBetweenShots;                                  // 0x8(0x30)
	float                                                        ChanceOfNearMiss;                                  // 0x38(0x4)
};


// Size 0x1
struct EventSetJIPFishingAnimationState
{
public:
	char                                                         State;                                             // 0x0(0x1)
};


// Size 0x10
struct FragmentMarker
{
public:
	struct FString                                               Marker;                                            // 0x0(0x10)
};


// Size 0x10
struct SeagullManagerFormationOffset
{
public:
	TArray<struct Vector>                                        Offsets;                                           // 0x0(0x10)
};


// Size 0x38
struct ActiveHudIconData
{
public:
	class Texture2D*                                             IconTexture;                                       // 0x18(0x8)
};


// Size 0x4
struct GameNarrationRateChangeEvent
{
public:
	int                                                          Rate;                                              // 0x0(0x4)
};


// Size 0x10
struct VaultAssignedAutomationEvent
{
public:
	class Actor*                                                 Vault;                                             // 0x0(0x8)
	class UClass*                                                Key;                                               // 0x8(0x8)
};


// Size 0x8
struct VisualFeedbackEntry
{
public:
	class EffectBlendObjectBase*                                 Effect;                                            // 0x0(0x8)
};


// Size 0x4c
struct FogBankSettings
{
public:
	char                                                         FogState;                                          // 0x0(0x1)
	float                                                        Density;                                           // 0x4(0x4)
	struct Vector                                                Scale;                                             // 0x8(0xc)
	struct LinearColor                                           FogColour;                                         // 0x14(0x10)
	float                                                        FadeInDuration;                                    // 0x24(0x4)
	float                                                        ActiveDuration;                                    // 0x28(0x4)
	float                                                        FadeOutDuration;                                   // 0x2c(0x4)
	bool                                                         Persistent;                                        // 0x30(0x1)
	float                                                        PreviousDensity;                                   // 0x34(0x4)
	struct LinearColor                                           PreviousFogColour;                                 // 0x38(0x10)
	float                                                        MaximumAudioFogIntensityRTPC;                      // 0x48(0x4)
};


// Size 0x18
struct PlayerActivityIconInfo
{
public:
	char                                                         ActivityType;                                      // 0x0(0x1)
	struct StringAssetReference                                  ActivityIcon;                                      // 0x8(0x10)
};


// Size 0x5
struct SetContestShipTypes
{
public:
	bool                                                         IsGalleonEnabled;                                  // 0x0(0x1)
	bool                                                         IsBrigantineEnabled;                               // 0x1(0x1)
	bool                                                         IsSloopEnabled;                                    // 0x2(0x1)
	bool                                                         IsSloopDuoEnabled;                                 // 0x3(0x1)
	bool                                                         IsMixedGalleonBrigantineEnabled;                   // 0x4(0x1)
};


// Size 0x4
struct PlayerStat
{
public:
	uint32                                                       StatId;                                            // 0x0(0x4)
};


// Size 0x28
struct AthenaAnimationJumpingFirstPersonAnimData
{
public:
	class AnimSequence*                                          JumpStart;                                         // 0x0(0x8)
	class BlendSpace*                                            JumpCycle;                                         // 0x8(0x8)
	class AnimSequence*                                          PreImpact;                                         // 0x10(0x8)
	class BlendSpace*                                            LandLight;                                         // 0x18(0x8)
	class BlendSpace*                                            LandHeavy;                                         // 0x20(0x8)
};


// Size 0x20
struct PlayerActionBaseTelemetryFragment
{
public:
	struct FString                                               ObjectId;                                          // 0x0(0x10)
	struct FString                                               ActionName;                                        // 0x10(0x10)
};


// Size 0x18
struct CutsceneAnimationElement
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	TArray<class AnimSequenceBase*>                              OneShotSequences;                                  // 0x8(0x10)
};


// Size 0x18
struct OpenReputationMenuEvent
{
public:
	char                                                         NavigationAction;                                  // 0x0(0x1)
	struct FString                                               CompanyId;                                         // 0x8(0x10)
};


// Size 0x20
struct ProposedTaleEntry
{
public:
	class VoyageDescDataAsset*                                   TaleData;                                          // 0x0(0x8)
	class VoyageProposalDesc*                                    TaleProposal;                                      // 0x8(0x8)
	class Actor*                                                 ProposingObject;                                   // 0x10(0x8)
	bool                                                         CanStartTale;                                      // 0x18(0x1)
};


// Size 0x18
struct UnlockableEntitlementCategory
{
public:
	struct FName                                                 Category;                                          // 0x0(0x8)
	TArray<class Class*>                                         Entitlements;                                      // 0x8(0x10)
};


// Size 0x20
struct UniversalDescriptorStyle
{
public:
	int                                                          BackgroundColor;                                   // 0x0(0x4)
	int                                                          TextColor;                                         // 0x4(0x4)
	int                                                          OpacityPercent;                                    // 0x8(0x4)
	int                                                          ScalePercent;                                      // 0xc(0x4)
	int                                                          AnchorXPercent;                                    // 0x10(0x4)
	int                                                          AnchorYPercent;                                    // 0x14(0x4)
	int                                                          FontSize;                                          // 0x18(0x4)
	int                                                          FontStyle;                                         // 0x1c(0x4)
};


// Size 0x30
struct BundleMetadataResponse
{
public:
	struct FString                                               ProductId;                                         // 0x0(0x10)
	struct FString                                               ImageUri;                                          // 0x10(0x10)
	TArray<String>                                               MetaTags;                                          // 0x20(0x10)
};


// Size 0x1
struct BootFlowCrossInputMatchmakingStateEvent
{
public:
	bool                                                         CrossInput;                                        // 0x0(0x1)
};


// Size 0x28
struct AppearMaterialParams
{
public:
	struct FName                                                 ParameterName;                                     // 0x0(0x8)
	class CurveFloat*                                            AppearCurveAsset;                                  // 0x8(0x8)
	class CurveFloat*                                            DisppearCurveAsset;                                // 0x10(0x8)
};


// Size 0x80
struct AthenaAnimationAsyncLoadedObjectJumpingAnimations
{
public:
	assetobject                                                  Start;                                             // 0x0(0x20)
	assetobject                                                  Cycle;                                             // 0x20(0x20)
	assetobject                                                  PreImpact;                                         // 0x40(0x20)
	assetobject                                                  LandLight;                                         // 0x60(0x20)
};


// Size 0x20
struct PlayerNonVerbalComponentTelemetry
{
public:
	class AthenaPlayerController*                                PlayerController;                                  // 0x0(0x8)
};


// Size 0x18
struct ItemPreviewView
{
public:
	struct FName                                                 CameraName;                                        // 0x0(0x8)
	class AnimationAsset*                                        Anim;                                              // 0x8(0x8)
	bool                                                         ShouldSpin;                                        // 0x10(0x1)
};


// Size 0x1
struct EventCannonAimingStoppedYaw
{
public:
	bool                                                         IsAtEnd;                                           // 0x0(0x1)
};


// Size 0x5
struct SetFrontEndSelection
{
public:
	bool                                                         IsAdventureActive;                                 // 0x0(0x1)
	bool                                                         IsArenaActive;                                     // 0x1(0x1)
	bool                                                         IsTutorialActive;                                  // 0x2(0x1)
	bool                                                         IsCreativeActive;                                  // 0x3(0x1)
	bool                                                         IsBeachNPCSpawnActive;                             // 0x4(0x1)
};


// Size 0x4
struct SetNotificationScale
{
public:
	float                                                        ScaleValue;                                        // 0x0(0x4)
};


// Size 0x20
struct OnShipStockEntitlementsProcessedNetworkEvent
{
public:
	class ShipEntitlementProcessingPolicyDataAsset*              ShipEntitlementProcessingPolicyDataAsset;          // 0x18(0x8)
};


// Size 0x10
struct SalvageSpawnCompRequest
{
public:
	class SalvageItemSpawnComponent*                             SalvageItemSpawnComp;                              // 0x0(0x8)
};


// Size 0x18
struct AthenaAnimationObjectIdleAnimations
{
public:
	class AnimSequence*                                          Idle1;                                             // 0x0(0x8)
	class AnimSequence*                                          Idle2;                                             // 0x8(0x8)
	class AnimSequence*                                          Idle3;                                             // 0x10(0x8)
};


// Size 0x30
struct FaunaAnimationPigStarvingStructure
{
public:
	class AnimSequence*                                          StarveIn;                                          // 0x0(0x8)
	class AnimSequence*                                          StarveLoop;                                        // 0x8(0x8)
	class AnimSequence*                                          StarveOut;                                         // 0x10(0x8)
	class AnimSequence*                                          StarveDeath;                                       // 0x18(0x8)
	class AnimSequence*                                          StarveStartledLow;                                 // 0x20(0x8)
	class AnimSequence*                                          StarveStartledHigh;                                // 0x28(0x8)
};


// Size 0x20
struct MoveSpeedValidationFailedTelemetryEvent
{
public:
	struct FString                                               Item;                                              // 0x0(0x10)
	int                                                          SpeedId;                                           // 0x10(0x4)
	int                                                          DurationMS;                                        // 0x14(0x4)
	int                                                          IgnoredRequestCount;                               // 0x18(0x4)
};


// Size 0x30
struct ShipAnnouncementLoadoutUpdatedEventRpc
{
public:
	class Controller*                                            Controller;                                        // 0x18(0x8)
	struct Guid                                                  ShipGuid;                                          // 0x20(0x10)
};


// Size 0x4
struct ShipInternalWaterPersistenceModel
{
public:
	float                                                        InternalWaterLevel;                                // 0x0(0x4)
};


// Size 0x40
struct NoiseMakerController
{
public:
	class NoiseMakerControllerParams*                            NoiseMakerParams;                                  // 0x0(0x8)
	float                                                        MaxRunningSpeed;                                   // 0x8(0x4)
	float                                                        SimulatedMaxRunningSpeed;                          // 0xc(0x4)
};


// Size 0x1b0
struct HealthUI
{
public:
	float                                                        MinVisibleHealth;                                  // 0x0(0x4)
	float                                                        ContinuousTimePerUpdate;                           // 0x4(0x4)
	class Pawn*                                                  TargetPawn;                                        // 0x20(0x8)
};


// Size 0x8
struct FogBankManagerIslandTypesToKeepAwayFrom
{
public:
	char                                                         IslandType;                                        // 0x0(0x1)
	float                                                        MinimumDistanceFromIslandInKm;                     // 0x4(0x4)
};


// Size 0x10
struct MetalAIFormRustyDamageResponse
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	float                                                        DamageMultiplier;                                  // 0x8(0x4)
	char                                                         HitReaction;                                       // 0xc(0x1)
};


// Size 0x48
struct WheelPartsScales
{
public:
	struct Vector                                                FractureWestScale;                                 // 0x0(0xc)
	struct Vector                                                FractureEastScale;                                 // 0xc(0xc)
	struct Vector                                                FractureSouthScale;                                // 0x18(0xc)
	struct Vector                                                PlankWestScale;                                    // 0x24(0xc)
	struct Vector                                                PlankEastScale;                                    // 0x30(0xc)
	struct Vector                                                PlankSouthScale;                                   // 0x3c(0xc)
};


// Size 0x30
struct TinVoyageDebugEntry
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	char                                                         Difficulty;                                        // 0x8(0x1)
	assetclass                                                   VoyageProposal;                                    // 0x10(0x20)
};


// Size 0x18
struct AthenaAICharacterWasKilledWhileCursed
{
public:
	TArray<char>                                                 Curses;                                            // 0x0(0x10)
	class Actor*                                                 Instigator;                                        // 0x10(0x8)
};


// Size 0x20
struct FishAnimationSwimmingLoopAnimations
{
public:
	class AnimMontage*                                           IdleLoopEndingForwards;                            // 0x0(0x8)
	class AnimMontage*                                           IdleLoopEndingRight;                               // 0x8(0x8)
	class AnimMontage*                                           IdleLoopEndingLeft;                                // 0x10(0x8)
	class AnimMontage*                                           IdleLoopEndingBackwards;                           // 0x18(0x8)
};


// Size 0xc
struct RadialInventoryCenterUpdated
{
public:
	float                                                        X;                                                 // 0x4(0x4)
	float                                                        Y;                                                 // 0x8(0x4)
};


// Size 0x4
struct ItemBlockingParameters
{
public:
	char                                                         BlockingHalfAngle;                                 // 0x0(0x1)
	char                                                         BlockingDetectionOffset;                           // 0x1(0x1)
	char                                                         BlockingDetectionTruncatedConeRadius;              // 0x2(0x1)
	char                                                         BlockingDetectionCharacterOverlapRadius;           // 0x3(0x1)
};


// Size 0x10
struct WeightedRewardTableUnit
{
public:
	class UClass*                                                Entitlement;                                       // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	uint32                                                       Value;                                             // 0xc(0x4)
};


// Size 0x30
struct OtherPartyTelemetryFragment
{
public:
	struct FString                                               OtherPartyType;                                    // 0x0(0x10)
	struct FString                                               OtherPartyId;                                      // 0x10(0x10)
	uint32                                                       OtherPartyPossessCount;                            // 0x20(0x4)
	double                                                       OtherPartySecondsSinceSpawned;                     // 0x28(0x8)
};


// Size 0x18
struct QuestBookPageRenderer
{
public:
	class Font*                                                  Font;                                              // 0x0(0x8)
	float                                                        FontScale;                                         // 0x8(0x4)
	float                                                        FontMaxScale;                                      // 0xc(0x4)
	float                                                        FontLineSpacingScale;                              // 0x10(0x4)
};


// Size 0x10
struct ArrivalTunnelOfTheDamnedPlayerState
{
public:
	class Character*                                             Character;                                         // 0x0(0x8)
	bool                                                         MigrationComplete;                                 // 0x8(0x1)
};


// Size 0x18
struct AssetLoadSkipInfo
{
public:
	struct FString                                               AnimationsStructName;                              // 0x0(0x10)
	char                                                         SkipCount;                                         // 0x10(0x1)
};


// Size 0x8
struct SwallowedByKrakenActionStateParams
{
public:
	float                                                        FadeToBlackDuration;                               // 0x0(0x4)
	float                                                        DeathDelayTime;                                    // 0x4(0x4)
};


// Size 0x10
struct MeshMemoryConstraintShipPartReceivedShipSafeDeclaration
{
public:
	struct FString                                               ShipPartName;                                      // 0x0(0x10)
};


// Size 0x20
struct TreasureLocationData
{
public:
	struct Vector                                                WorldSpaceLocation;                                // 0x0(0xc)
	struct Vector                                                IslandSpaceLocation;                               // 0xc(0xc)
	struct Vector2D                                              MapSpaceLocation;                                  // 0x18(0x8)
};


// Size 0x30
struct IsTankardEquippedCondition
{
public:
	bool                                                         RequireSpecificLiquidType;                         // 0x28(0x1)
	bool                                                         RequireSpecificMinimumVolume;                      // 0x29(0x1)
	char                                                         RequiredLiquidType;                                // 0x2a(0x1)
	float                                                        RequiredMinimumVolume;                             // 0x2c(0x4)
};


// Size 0x18
struct PlayerMilestoneUnlockTelemetryEvent
{
public:
	struct FString                                               MilestoneName;                                     // 0x0(0x10)
	uint64                                                       ClassNumber;                                       // 0x10(0x8)
};


// Size 0x10
struct RiddleTextPhrasebookEntry
{
public:
	struct FName                                                 Id;                                                // 0x0(0x8)
	class RiddleTextPhraseDataAsset*                             Phrase;                                            // 0x8(0x8)
};


// Size 0xa8
struct ShipAnnouncementCinematicEvent
{
public:
	struct FString                                               ShipName;                                          // 0x0(0x10)
	struct FText                                                 ShipTitle;                                         // 0x10(0x38)
	struct FString                                               CaptainName;                                       // 0x48(0x10)
	struct FString                                               Alignment;                                         // 0x58(0x10)
	struct FString                                               AlignmentId;                                       // 0x68(0x10)
	struct FString                                               Icon;                                              // 0x78(0x10)
	struct FString                                               AudioCue;                                          // 0x88(0x10)
	struct FString                                               GuildName;                                         // 0x98(0x10)
};


// Size 0x4
struct RemoveTriggerGameServerRequestModel
{
public:
	int                                                          TriggerId;                                         // 0x0(0x4)
};


// Size 0x20
struct CaptainCurtainsPartDesc
{
public:
	struct StringAssetReference                                  PrimaryCurtainMesh;                                // 0x0(0x10)
	class MaterialInterface*                                     SecondaryCurtainMaterial;                          // 0x10(0x8)
	int64                                                        PrimaryCurtainCachedMeshResourceSize;              // 0x18(0x8)
};


// Size 0x18
struct ItemMetaBase
{
public:
	struct StringAssetReference                                  StoredStructType;                                  // 0x8(0x10)
};


// Size 0x8
struct AggressiveGhostShipDifficultyTargetSelection
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	char                                                         Target;                                            // 0x4(0x1)
	bool                                                         FireTowardsSeaLevel;                               // 0x5(0x1)
};


// Size 0x30
struct FortSpawnTelemetryEvent
{
public:
	struct Guid                                                  FortId;                                            // 0x0(0x10)
	struct Guid                                                  ConfigSpawnId;                                     // 0x10(0x10)
	struct FName                                                 FortName;                                          // 0x20(0x8)
	struct FName                                                 FortType;                                          // 0x28(0x8)
};


// Size 0x50
struct RemoteAchievementProgressModel
{
public:
	map                                                          AchievementProgress;                               // 0x0(0x50)
};


// Size 0x140
struct CrosshairUI
{
public:
	class ProjectileWeapon*                                      WieldedWeapon;                                     // 0x0(0x8)
};


// Size 0x28
struct AthenaAnimationCharacterSelect
{
public:
	class AnimSequence*                                          Idle;                                              // 0x0(0x8)
	class AnimSequence*                                          IntoHighlight;                                     // 0x8(0x8)
	class AnimSequence*                                          Highlighted;                                       // 0x10(0x8)
	class AnimSequence*                                          OutOfHighlight;                                    // 0x18(0x8)
	class AnimSequence*                                          Selected;                                          // 0x20(0x8)
};


// Size 0x10
struct BookcaseCompanyFullnessData
{
public:
	float                                                        CurrentFullness;                                   // 0x0(0x4)
	class UClass*                                                Company;                                           // 0x8(0x8)
};


// Size 0x8
struct RequestCreatePiratePreviewEvent
{
public:
	int                                                          ResolutionX;                                       // 0x0(0x4)
	int                                                          ResolutionY;                                       // 0x4(0x4)
};


// Size 0x1
struct TextboxFocusRequest
{
public:
	bool                                                         ShouldFocusTextbox;                                // 0x0(0x1)
};


// Size 0x38
struct ShipInternalWaterParams
{
public:
	class CurveFloat*                                            SloshinessCurve;                                   // 0x0(0x8)
	float                                                        MaxWaterAmount;                                    // 0x8(0x4)
	float                                                        MaxWaterHeight;                                    // 0xc(0x4)
	float                                                        CorrectiveSpeed;                                   // 0x10(0x4)
	float                                                        MaxClientWaterError;                               // 0x14(0x4)
	float                                                        WaterStartHeight;                                  // 0x18(0x4)
	float                                                        VisibleWaterLevelSpringAccel;                      // 0x1c(0x4)
	float                                                        MinShowAmount;                                     // 0x20(0x4)
	float                                                        MaxTipAdjustmentDepth;                             // 0x24(0x4)
	float                                                        MaxTipAdjustmentRoll;                              // 0x28(0x4)
	float                                                        MinTipAdjustmentAmount;                            // 0x2c(0x4)
	class CurveFloat*                                            FillPercentageVSMaxRollAngleCurve;                 // 0x30(0x8)
};


// Size 0x18
struct PetAnimationCycle
{
public:
	class AnimSequenceBase*                                      In;                                                // 0x0(0x8)
	class AnimSequenceBase*                                      Loop;                                              // 0x8(0x8)
	class AnimSequenceBase*                                      Out;                                               // 0x10(0x8)
};


// Size 0x40
struct TeamCityBuildFragment
{
public:
	int                                                          Id;                                                // 0x0(0x4)
	int                                                          Changelist;                                        // 0x4(0x4)
	struct FString                                               BuildTypeId;                                       // 0x8(0x10)
	struct FString                                               StartedBy;                                         // 0x18(0x10)
	bool                                                         Personal;                                          // 0x28(0x1)
	struct FString                                               StreamName;                                        // 0x30(0x10)
};


// Size 0x10
struct PlayerEnteredStormEvent
{
public:
	class Actor*                                                 Storm;                                             // 0x0(0x8)
	class Controller*                                            Player;                                            // 0x8(0x8)
};


// Size 0x3
struct AthenaAnimationLODSettings
{
public:
	char                                                         IKState;                                           // 0x0(0x1)
	char                                                         IKSolverType;                                      // 0x1(0x1)
	char                                                         IKFootPlantingState;                               // 0x2(0x1)
};


// Size 0x88
struct MigratableMPSDFallbackData
{
public:
	struct UniqueNetIdRepl                                       CaptainUserId;                                     // 0x0(0x18)
	TArray<struct UniqueNetIdRepl>                               CrewUserIds;                                       // 0x18(0x10)
	struct Guid                                                  CrewId;                                            // 0x28(0x10)
	map                                                          ReconnectTimesRemaining;                           // 0x38(0x50)
};


// Size 0x20
struct SkeletonCampReplicatedData
{
public:
	TArray<struct Guid>                                          CrewIdsInTempleHall;                               // 0x0(0x10)
	bool                                                         OrbOfSecretsHasBeenTaken;                          // 0x10(0x1)
	bool                                                         TempleRitualHasBeenPrepared;                       // 0x11(0x1)
	bool                                                         TempleRitualHasBeenCompleted;                      // 0x12(0x1)
	bool                                                         ProtectorOfTheOrbHasBeenKilled;                    // 0x13(0x1)
	class Actor*                                                 SourceActor;                                       // 0x18(0x8)
};


// Size 0x10
struct RowboatPersistenceModel
{
public:
	struct FName                                                 Class;                                             // 0x0(0x8)
	struct FName                                                 Livery;                                            // 0x8(0x8)
};


// Size 0x10
struct CrewChangeFailedEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x8
struct ShipAnnouncementShipSpottedEvent
{
public:
	class Actor*                                                 ShipSpotted;                                       // 0x0(0x8)
};


// Size 0x20
struct InviterId
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct FString                                               PirateId;                                          // 0x10(0x10)
};


// Size 0x10
struct EventSwimmingCreatureCollided
{
public:
	class Actor*                                                 SwimmingCreatureActor;                             // 0x0(0x8)
};


// Size 0x1c
struct MerchantQuestCategoryGroupBounds
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	int                                                          MinNum;                                            // 0xc(0x4)
	int                                                          MaxNum;                                            // 0x10(0x4)
	int                                                          MinDifferent;                                      // 0x14(0x4)
	int                                                          MaxDifferent;                                      // 0x18(0x4)
};


// Size 0x38
struct SeaOverride
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	TArray<class Class*>                                         Seas;                                              // 0x10(0x10)
	struct StoryFlagContainer                                    StoryFlagContainer;                                // 0x20(0x18)
};


// Size 0x48
struct CheatPerformedByClientNetworkEvent
{
public:
	struct FString                                               CheatSource;                                       // 0x18(0x10)
	struct FString                                               CheatFunction;                                     // 0x28(0x10)
	struct FString                                               CheatArguments;                                    // 0x38(0x10)
};


// Size 0xa0
struct XMarksTheSpotQuestParams
{
public:
	struct WeightedProbabilityRange                              NumTreasureLocations;                              // 0x48(0x20)
	class BoobyTrapSpawnerDataAsset*                             BoobyTrapSpawnerDataAsset;                         // 0x68(0x8)
	TArray<class BoobyTrapSpawnerDataAsset*>                     UniqueTreasureLocationBoobyTraps;                  // 0x70(0x10)
	TArray<class WeightedTreasureChestDescAsset*>                UniqueTreasureLocationRewards;                     // 0x80(0x10)
	TArray<class WeightedItemDescSpawnDataAsset*>                UniqueTreasureLocationRewardsAssets;               // 0x90(0x10)
};


// Size 0x20
struct UIAdventuresDataErrorTelemetryEvent
{
public:
	struct FString                                               ErrorMessage;                                      // 0x0(0x10)
	struct FString                                               ErrorStack;                                        // 0x10(0x10)
};


// Size 0x8
struct EventEndConversationAsParticipant
{
public:
	class Actor*                                                 ConversationStarter;                               // 0x0(0x8)
};


// Size 0xc
struct PlayerMermaidSuppressionData
{
public:
	class PlayerState*                                           PlayerState;                                       // 0x0(0x8)
	float                                                        SuppressionTime;                                   // 0x8(0x4)
};


// Size 0x40
struct SignedSessionRequestModel
{
public:
	struct FString                                               SessionId;                                         // 0x0(0x10)
	struct FString                                               OwningUserId;                                      // 0x10(0x10)
	struct FString                                               SessionTemplateName;                               // 0x20(0x10)
	struct FString                                               Signature;                                         // 0x30(0x10)
};


// Size 0x40
struct SpawnTransformToPositionMapping
{
public:
	struct Transform                                             SpawnTransform;                                    // 0x0(0x30)
	char                                                         Position;                                          // 0x30(0x1)
};


// Size 0x18
struct MerchantQuestStartTelemetryEventRequiredItemEntry
{
public:
	int                                                          NumItems;                                          // 0x0(0x4)
	struct FString                                               Rarity;                                            // 0x8(0x10)
};


// Size 0x20
struct NPCAnimationIdlesVariantStruct
{
public:
	class AnimSequence*                                          IdleVariant;                                       // 0x0(0x8)
	class AnimSequence*                                          InactiveIdleVariant;                               // 0x8(0x8)
	class AnimSequence*                                          InteractIdleVariant;                               // 0x10(0x8)
	bool                                                         IdleVariantIsValid;                                // 0x18(0x1)
	bool                                                         InactiveIdleVariantIsValid;                        // 0x19(0x1)
	bool                                                         InteractIdleVariantIsValid;                        // 0x1a(0x1)
};


// Size 0x10
struct EntitlementLoadFailedTelemetryEvent
{
public:
	struct FString                                               AssetName;                                         // 0x0(0x10)
};


// Size 0x10
struct RandomParticleSystemPickerEntry
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	class Object*                                                Effect;                                            // 0x8(0x8)
};


// Size 0x1
struct EventWheelStoppedMoving
{
public:
	bool                                                         IsAtEnd;                                           // 0x0(0x1)
};


// Size 0x10
struct FishingRodReplicatedFishState
{
public:
	class FishingFish*                                           FishingFish;                                       // 0x0(0x8)
	char                                                         FishingFishState;                                  // 0x8(0x1)
	bool                                                         FishHasEscaped;                                    // 0x9(0x1)
};


// Size 0x28
struct StopNpcAnimationNetworkEvent
{
public:
	class Actor*                                                 TargetActor;                                       // 0x18(0x8)
	class PlaceableReaction*                                     PlaceableReaction;                                 // 0x20(0x8)
};


// Size 0x20
struct GuildUserPirateModel
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct FString                                               PirateId;                                          // 0x10(0x10)
};


// Size 0x1
struct EventSpawnedAsSalvageItem
{
public:
	bool                                                         SpawnedAsSunkenItem;                               // 0x0(0x1)
};


// Size 0x10
struct EventRequestSayPhrase
{
public:
	struct FString                                               PhraseKey;                                         // 0x0(0x10)
};


// Size 0x8
struct GuildLevelChangedEvent
{
public:
	int                                                          OldGuildLevel;                                     // 0x0(0x4)
	int                                                          CurrentGuildLevel;                                 // 0x4(0x4)
};


// Size 0x10
struct SpawnablePrisoner
{
public:
	class UClass*                                                SpawnablePrisoner;                                 // 0x0(0x8)
	struct FName                                                 AnimationMontageName;                              // 0x8(0x8)
};


// Size 0x38
struct TreasureChestSoldNetworkEvent
{
public:
	struct FName                                                 RewardId;                                          // 0x18(0x8)
	struct StringAssetReference                                  StampIcon;                                         // 0x20(0x10)
	class UClass*                                                OverrideCompany;                                   // 0x30(0x8)
};


// Size 0x30
struct PlayerRadialChatTelemetryEvent
{
public:
	struct Guid                                                  RadialChatID;                                      // 0x0(0x10)
	struct FString                                               RadialChatString;                                  // 0x10(0x10)
	struct FString                                               RadialContextType;                                 // 0x20(0x10)
};


// Size 0x4
struct EventDeathCameraActivated
{
public:
	float                                                        CameraDuration;                                    // 0x0(0x4)
};


// Size 0x8
struct EventWaterAmountChanged
{
public:
	float                                                        NewWaterAmount;                                    // 0x0(0x4)
	float                                                        NewRelativeWaterHeight;                            // 0x4(0x4)
};


// Size 0x18
struct RequestShowJupiterProfile
{
public:
	struct FString                                               PlatformUserId;                                    // 0x0(0x10)
	char                                                         Platform;                                          // 0x10(0x1)
};


// Size 0x378
struct LightingControllerSettingsOutput
{
public:
	float                                                        FogDensity;                                        // 0x0(0x4)
	float                                                        FogStartDistance;                                  // 0x4(0x4)
	float                                                        LightIntensity;                                    // 0x8(0x4)
	float                                                        SkyDomeBrightness;                                 // 0xc(0x4)
	float                                                        SkyDomeMoonVisibility;                             // 0x10(0x4)
	float                                                        SkyDomeStarBrightness;                             // 0x14(0x4)
	float                                                        SkyDomeSunBrightness;                              // 0x18(0x4)
	float                                                        PostLPVIntensity;                                  // 0x1c(0x4)
	float                                                        PostExposureBias;                                  // 0x20(0x4)
	float                                                        PostLPVOcclusionIntensity;                         // 0x24(0x4)
	float                                                        SkyLightIntensity;                                 // 0x28(0x4)
	float                                                        FogBrightnessNear;                                 // 0x2c(0x4)
	float                                                        FogBrightnessFar;                                  // 0x30(0x4)
	float                                                        PostBloomIntensity;                                // 0x34(0x4)
	float                                                        PostBloomThreshold;                                // 0x38(0x4)
	float                                                        SkyDomeAuraBrightness;                             // 0x3c(0x4)
	float                                                        PostReflectionProbeBrightness;                     // 0x40(0x4)
	float                                                        PostReflectionProbeShadowBrightness;               // 0x44(0x4)
	float                                                        VfxController;                                     // 0x48(0x4)
	float                                                        FogMaxOpacity;                                     // 0x4c(0x4)
	float                                                        FogScatterExp;                                     // 0x50(0x4)
	float                                                        FogUnderwaterDensity;                              // 0x54(0x4)
	float                                                        PostLensFlareIntensity;                            // 0x58(0x4)
	float                                                        EmissiveFoliage;                                   // 0x5c(0x4)
	float                                                        EmissiveLights;                                    // 0x60(0x4)
	float                                                        PostExposureMinBrightness;                         // 0x64(0x4)
	float                                                        PostExposureMaxBrightness;                         // 0x68(0x4)
	float                                                        SkyDomeMoonBrightness;                             // 0x6c(0x4)
	float                                                        SkyDomeHorizonCloudBrightness;                     // 0x70(0x4)
	float                                                        SkyDomeGreenFlashStrength;                         // 0x74(0x4)
	float                                                        PostSaturation;                                    // 0x78(0x4)
	float                                                        PostContrast;                                      // 0x7c(0x4)
	float                                                        CloudRimlightScale;                                // 0x80(0x4)
	float                                                        CloudSkylightScale;                                // 0x84(0x4)
	float                                                        CloudSunlightScale;                                // 0x88(0x4)
	float                                                        CloudGlobalPressure;                               // 0x8c(0x4)
	float                                                        PostUnderWaterBrightness;                          // 0x90(0x4)
	float                                                        VfxCloudBrightness;                                // 0x94(0x4)
	float                                                        LightGodRayIntensity;                              // 0x98(0x4)
	float                                                        CloudBottomBrightness;                             // 0x9c(0x4)
	float                                                        CloudSunlightShadowing;                            // 0xa0(0x4)
	float                                                        SunDiscScale;                                      // 0xa4(0x4)
	float                                                        WaterSpecularBrightness;                           // 0xa8(0x4)
	float                                                        VfxAmbientScale;                                   // 0xac(0x4)
	float                                                        FogUnderwaterMaxOpacity;                           // 0xb0(0x4)
	float                                                        FogUnderwaterScatterExp;                           // 0xb4(0x4)
	float                                                        FogUnderwaterStartDistance;                        // 0xb8(0x4)
	float                                                        FogUnderwaterBrightnessNear;                       // 0xbc(0x4)
	float                                                        FogUnderwaterBrightnessFar;                        // 0xc0(0x4)
	float                                                        FogDirectionalInscatteringStart;                   // 0xc4(0x4)
	float                                                        FogUnderwaterDirectionalInscatteringStart;         // 0xc8(0x4)
	float                                                        CloudShadowBrightness;                             // 0xcc(0x4)
	float                                                        StormCloudShadowBrightness;                        // 0xd0(0x4)
	float                                                        StormPostBloomIntensity;                           // 0xd4(0x4)
	float                                                        StormPostBloomThreshold;                           // 0xd8(0x4)
	float                                                        DirectionalLightShadowSteppingRate;                // 0xdc(0x4)
	float                                                        SkullBrightness;                                   // 0xe0(0x4)
	float                                                        UnderwaterDirectionalLightMinBrightness;           // 0xe4(0x4)
	struct LinearColor                                           FogColourAway;                                     // 0xe8(0x10)
	struct LinearColor                                           FogColourTowards;                                  // 0xf8(0x10)
	struct LinearColor                                           LightSunColour;                                    // 0x108(0x10)
	struct LinearColor                                           SkyDomeHorizonColour;                              // 0x118(0x10)
	struct LinearColor                                           SkyDomeZenithColour;                               // 0x128(0x10)
	struct LinearColor                                           SkyLightColour;                                    // 0x138(0x10)
	struct LinearColor                                           PostAmbientShadowColour;                           // 0x148(0x10)
	struct LinearColor                                           FogColourAwayFar;                                  // 0x158(0x10)
	struct LinearColor                                           FogColourUnderwater;                               // 0x168(0x10)
	struct LinearColor                                           FogColourAwayUnderwater;                           // 0x178(0x10)
	struct LinearColor                                           WaterColour;                                       // 0x188(0x10)
	struct LinearColor                                           WaterColourShallow;                                // 0x198(0x10)
	struct LinearColor                                           WaterBackLitColour;                                // 0x1a8(0x10)
	struct LinearColor                                           WaterFoamColour;                                   // 0x1b8(0x10)
	struct LinearColor                                           WaterFoamHighlightColour;                          // 0x1c8(0x10)
	struct LinearColor                                           WaterAmbientColour;                                // 0x1d8(0x10)
	struct LinearColor                                           PostReflectionProbeTint;                           // 0x1e8(0x10)
	struct LinearColor                                           CloudRimlightColour;                               // 0x1f8(0x10)
	struct LinearColor                                           CloudSkylightColour;                               // 0x208(0x10)
	struct LinearColor                                           CloudSunlightColour;                               // 0x218(0x10)
	struct LinearColor                                           PostUnderWaterTint;                                // 0x228(0x10)
	struct LinearColor                                           SkyDomeMoonColour;                                 // 0x238(0x10)
	struct LinearColor                                           PostGamma;                                         // 0x248(0x10)
	struct LinearColor                                           SkyDomeSunColour;                                  // 0x258(0x10)
	struct LinearColor                                           VFXFoamColour;                                     // 0x268(0x10)
	struct LinearColor                                           VFXWindColour;                                     // 0x278(0x10)
	struct LinearColor                                           VFXUnderwaterTint;                                 // 0x288(0x10)
	struct LinearColor                                           StormRainColour;                                   // 0x298(0x10)
	struct LinearColor                                           StormSkyLightColour;                               // 0x2a8(0x10)
	struct LinearColor                                           StormPostGamma;                                    // 0x2b8(0x10)
	struct LinearColor                                           StormFogColourUnderwater;                          // 0x2c8(0x10)
	struct LinearColor                                           StormFogColourAwayUnderwater;                      // 0x2d8(0x10)
	struct LinearColor                                           StormWaterColour;                                  // 0x2e8(0x10)
	struct LinearColor                                           StormWaterColourShallow;                           // 0x2f8(0x10)
	struct LinearColor                                           StormWaterBackLitColour;                           // 0x308(0x10)
	struct LinearColor                                           StormWaterFoamColour;                              // 0x318(0x10)
	struct LinearColor                                           StormWaterFoamHighlightColour;                     // 0x328(0x10)
	struct LinearColor                                           StormWaterAmbientColour;                           // 0x338(0x10)
	struct LinearColor                                           StormPostReflectionProbeTint;                      // 0x348(0x10)
	struct LinearColor                                           SkullEyeColour;                                    // 0x358(0x10)
	struct LinearColor                                           SandColour;                                        // 0x368(0x10)
};


// Size 0x28
struct SpawnItemGameServerRequestModel
{
public:
	struct FString                                               AssetId;                                           // 0x0(0x10)
	int                                                          AssetType;                                         // 0x10(0x4)
	struct Vector                                                SpawnLocation;                                     // 0x14(0xc)
	float                                                        Rotation;                                          // 0x20(0x4)
};


// Size 0x58
struct AIKnockbackActionStateConstructionInfo
{
public:
	struct Vector                                                KnockbackDirection;                                // 0x40(0xc)
	float                                                        KnockbackSpeed;                                    // 0x4c(0x4)
	float                                                        KnockbackAccel;                                    // 0x50(0x4)
	char                                                         KnockbackStrengthType;                             // 0x54(0x1)
};


// Size 0x30
struct ShipNameData
{
public:
	struct FString                                               ShipId;                                            // 0x0(0x10)
	struct FString                                               ShipName;                                          // 0x10(0x10)
	struct FString                                               ShipOwnerUserId;                                   // 0x20(0x10)
};


// Size 0xc
struct TimedDoorState
{
public:
	char                                                         State;                                             // 0x0(0x1)
	int                                                          JammedLandmarkReactionIndex;                       // 0x4(0x4)
	int                                                          LoweringLandmarkReactionIndex;                     // 0x8(0x4)
};


// Size 0x48
struct AthenaAnimationOverrideEntry
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	struct StringAssetReference                                  MeshFirstPerson;                                   // 0x8(0x10)
	struct StringAssetReference                                  MeshThirdPerson;                                   // 0x18(0x10)
	struct StringAssetReference                                  AnimationDataStore;                                // 0x28(0x10)
	class UClass*                                                ALKFirstPerson;                                    // 0x38(0x8)
	class UClass*                                                ALKThirdPerson;                                    // 0x40(0x8)
};


// Size 0x18
struct AlignmentFlagActionRuleParams
{
public:
	class UClass*                                                PressedNotificationInputId;                        // 0x0(0x8)
	class UClass*                                                ReleasedNotificationInputId;                       // 0x8(0x8)
	float                                                        AddFlagHoldTime;                                   // 0x10(0x4)
	float                                                        RemoveFlagHoldTime;                                // 0x14(0x4)
};


// Size 0x28
struct RequestBucketStateRpc
{
public:
	char                                                         RequestedBucketState;                              // 0x20(0x1)
};


// Size 0x1
struct PioneerObjectiveCompleteEvent
{
public:
	bool                                                         HasReward;                                         // 0x0(0x1)
};


// Size 0x10
struct PlayerBanishedToBrig
{
public:
	struct FString                                               PlayerName;                                        // 0x0(0x10)
};


// Size 0x40
struct ScrambledNamesUpdateEvent
{
public:
	struct Guid                                                  EntityId;                                          // 0x0(0x10)
	struct FString                                               UnscrambledName;                                   // 0x10(0x10)
	struct UniqueNetIdRepl                                       EntityOwnerNetId;                                  // 0x20(0x18)
	char                                                         ScrambleType;                                      // 0x38(0x1)
};


// Size 0x60
struct ContestShipLiverySet
{
public:
	struct Guid                                                  OwningCrewID;                                      // 0x0(0x10)
	map                                                          ShipLiveryTeamSet;                                 // 0x10(0x50)
};


// Size 0x10
struct IndefiniteDoorLockEntry
{
public:
	class Controller*                                            Controller;                                        // 0x0(0x8)
	class Object*                                                Owner;                                             // 0x8(0x8)
};


// Size 0x14
struct EntitlementMapRedirectorUsedEvent
{
public:
	struct FName                                                 DeprecatedEntitlementId;                           // 0x0(0x8)
	struct FName                                                 RedirectedToValidEntitlementId;                    // 0x8(0x8)
	int                                                          FoundIndex;                                        // 0x10(0x4)
};


// Size 0x18
struct WieldableItemActionVisuals
{
public:
	TArray<class Class*>                                         BlockActions;                                      // 0x0(0x10)
	char                                                         AnimVariant;                                       // 0x10(0x1)
	bool                                                         IsAlternate;                                       // 0x11(0x1)
	bool                                                         HideItem;                                          // 0x12(0x1)
};


// Size 0x18
struct PuzzleVaultStartedTelemetryEvent
{
public:
	struct Guid                                                  VaultId;                                           // 0x0(0x10)
	struct FName                                                 VaultType;                                         // 0x10(0x8)
};


// Size 0x30
struct TimedResponseAction
{
public:
	TArray<class Actor*>                                         TargetActors;                                      // 0x0(0x10)
	float                                                        Duration;                                          // 0x10(0x4)
	bool                                                         IsActive;                                          // 0x14(0x1)
};


// Size 0x4
struct EventCapstanArmIntentChanged
{
public:
	float                                                        NewIntent;                                         // 0x0(0x4)
};


// Size 0x10
struct PlayerEntitlementUpdatedEvent
{
public:
	class Actor*                                                 PlayerController;                                  // 0x0(0x8)
};


// Size 0x38
struct SetItemOnRadialInventorySlot
{
public:
	int                                                          SlotIndex;                                         // 0x0(0x4)
	struct FString                                               SlotItemUrl;                                       // 0x8(0x10)
	float                                                        SlotItemRotation;                                  // 0x18(0x4)
	float                                                        SlotItemScale;                                     // 0x1c(0x4)
	struct Vector2D                                              SlotItemOffset;                                    // 0x20(0x8)
	struct FString                                               SlotItemTitle;                                     // 0x28(0x10)
};


// Size 0x30
struct PopupQueuePlay
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
	struct FString                                               EventName;                                         // 0x10(0x10)
	struct FString                                               EventData;                                         // 0x20(0x10)
};


// Size 0x10
struct BedPartDesc
{
public:
	class MaterialInterface*                                     BedMaterial;                                       // 0x0(0x8)
	class MaterialInterface*                                     DrapesMaterial;                                    // 0x8(0x8)
};


// Size 0x18
struct CrewMutePlayerPhrasesEvent
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
	bool                                                         IsMuted;                                           // 0x10(0x1)
};


// Size 0x20
struct NetPerformanceMonitorInitialisationErrorTelemetryEvent
{
public:
	struct FString                                               ErrorType;                                         // 0x0(0x10)
	struct FString                                               ErrorMessage;                                      // 0x10(0x10)
};


// Size 0x38
struct FogBankSpawnedTelemetryEvent
{
public:
	struct Guid                                                  FogBankId;                                         // 0x0(0x10)
	struct Vector                                                SpawnLocation;                                     // 0x10(0xc)
	struct Vector                                                Scale;                                             // 0x1c(0xc)
	float                                                        Density;                                           // 0x28(0x4)
	float                                                        FadeInDuration;                                    // 0x2c(0x4)
	float                                                        ActiveDuration;                                    // 0x30(0x4)
	float                                                        FadeOutDuration;                                   // 0x34(0x4)
};


// Size 0x1
struct EventExposedToRainChanged
{
public:
	bool                                                         IsExposedToRain;                                   // 0x0(0x1)
};


// Size 0x10
struct FriendsListError
{
public:
	struct FString                                               Error;                                             // 0x0(0x10)
};


// Size 0x18
struct NPCConversationDialogDataConfig
{
public:
	TArray<class Class*>                                         AdditionalParticipants;                            // 0x0(0x10)
	bool                                                         AlwaysFocusOnCurrentSpeaker;                       // 0x10(0x1)
};


// Size 0x20
struct ServiceStatusNotificationModel
{
public:
	uint32                                                       NotificationId;                                    // 0x0(0x4)
	struct DateTime                                              ActivatedDateTimeUtc;                              // 0x8(0x8)
	struct Guid                                                  CorrelationId;                                     // 0x10(0x10)
};


// Size 0x20
struct FortStartedTelemetryEvent
{
public:
	struct Guid                                                  FortId;                                            // 0x0(0x10)
	struct FName                                                 FortIsland;                                        // 0x10(0x8)
	struct FName                                                 FortType;                                          // 0x18(0x8)
};


// Size 0x10
struct ClientMarkerRepresentation
{
public:
	class BaseWorldMarker*                                       MarkerPtr;                                         // 0x0(0x8)
	class Object*                                                MarkerVisualObjectPtr;                             // 0x8(0x8)
};


// Size 0x8
struct EventMeleeAttackStarted
{
public:
	class MeleeAttackDataAsset*                                  AttackData;                                        // 0x0(0x8)
};


// Size 0x80
struct TreasureMapWidgetLocalisedTextWithFontOverride
{
public:
	class Font*                                                  FontOverride;                                      // 0x78(0x8)
};


// Size 0x1
struct ScrambleGamertagsSettingsChanged
{
public:
	bool                                                         ShouldScrambleGamertags;                           // 0x0(0x1)
};


// Size 0x120
struct LaunchableProjectileHitRegistrationTelemetry
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	struct FString                                               DamagerType;                                       // 0x10(0x10)
	double                                                       ClientHitTimestamp;                                // 0x20(0x8)
	double                                                       ServerHitTimestamp;                                // 0x28(0x8)
	int                                                          ClientTimeOfImpact;                                // 0x30(0x4)
	int                                                          ServerTimeOfImpact;                                // 0x34(0x4)
	float                                                        ClientTimeAlive;                                   // 0x38(0x4)
	float                                                        ServerTimeAlive;                                   // 0x3c(0x4)
	struct Vector                                                ClientInitialProjectilePosition;                   // 0x40(0xc)
	struct Vector                                                ServerInitialProjectilePosition;                   // 0x4c(0xc)
	struct Vector                                                ClientFinalProjectilePosition;                     // 0x58(0xc)
	struct Vector                                                ServerFinalProjectilePosition;                     // 0x64(0xc)
	float                                                        ClientProjectileTravelDistance;                    // 0x70(0x4)
	float                                                        ServerProjectileTravelDistance;                    // 0x74(0x4)
	struct Vector                                                ClientProjectileDirection;                         // 0x78(0xc)
	struct Vector                                                ServerProjectileDirection;                         // 0x84(0xc)
	float                                                        ClientProjectileSpeed;                             // 0x90(0x4)
	float                                                        ServerProjectileSpeed;                             // 0x94(0x4)
	int                                                          ClientHitActorNetGuid;                             // 0x98(0x4)
	struct FString                                               ClientHitActorTypeName;                            // 0xa0(0x10)
	struct FString                                               ClientHitComponentName;                            // 0xb0(0x10)
	int                                                          ServerHitActorNetGuid;                             // 0xc0(0x4)
	struct FString                                               ServerHitActorTypeName;                            // 0xc8(0x10)
	struct FString                                               ServerHitComponentName;                            // 0xd8(0x10)
	bool                                                         HitAgreement;                                      // 0xe8(0x1)
	float                                                        ClientServerComponentPositionDelta;                // 0xec(0x4)
	float                                                        ClientServerComponentAngleDelta;                   // 0xf0(0x4)
	float                                                        ServerImpactLatencyMs;                             // 0xf4(0x4)
	float                                                        ClientImpactLatencyMs;                             // 0xf8(0x4)
	float                                                        ClientServerShotAngleDelta;                        // 0xfc(0x4)
	struct FString                                               ClientHitPlayerUserId;                             // 0x100(0x10)
	struct FString                                               ServerHitPlayerUserId;                             // 0x110(0x10)
};


// Size 0x10
struct AggressiveGhostShipAnchorDropTelemetryEvent
{
public:
	struct Guid                                                  ShipId;                                            // 0x0(0x10)
};


// Size 0x10
struct TunnelOfTheDamnedMigrationFailedTelemetryEvent
{
public:
	struct FString                                               Reason;                                            // 0x0(0x10)
};


// Size 0x8
struct ShipLeftTunnelOfTheDamnedEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
};


// Size 0x1
struct GuildShipConfigModel
{
public:
	bool                                                         IsPublic;                                          // 0x0(0x1)
};


// Size 0x40
struct NPCDialogTheme
{
public:
	assetobject                                                  BackgroundImage;                                   // 0x0(0x20)
	assetobject                                                  HeaderIcon;                                        // 0x20(0x20)
};


// Size 0x24
struct CrewCompletedPrimaryVoyageEvent
{
public:
	struct Guid                                                  VoyageID;                                          // 0x0(0x10)
	struct Guid                                                  CrewId;                                            // 0x10(0x10)
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x20(0x1)
};


// Size 0x28
struct FiredFromActorActionStateParams
{
public:
	float                                                        GravityScaleOverride;                              // 0x0(0x4)
	float                                                        MassOverride;                                      // 0x4(0x4)
	float                                                        UnderwaterBrakingFactorOverride;                   // 0x8(0x4)
	float                                                        UnderwaterBrakingFactorOverrideDuration;           // 0xc(0x4)
	struct Vector2D                                              MaskFiringLagScaleMinMax;                          // 0x10(0x8)
	struct Vector2D                                              MaskFiringLagScalingTimeMinMax;                    // 0x18(0x8)
	float                                                        MaskFiringLagSpeedToleranceSquared;                // 0x20(0x4)
	float                                                        TimeUntilRevertingIgnoredActors;                   // 0x24(0x4)
};


// Size 0x20
struct PocketWatchDateDisplay
{
public:
	class WwiseEvent*                                            DateSwitchSFX;                                     // 0x0(0x8)
	class MaterialInstanceDynamic*                               FirstPersonMeshDynamicMaterialInstance;            // 0x8(0x8)
	class MaterialInstanceDynamic*                               ThirdPersonMeshDynamicMaterialInstance;            // 0x10(0x8)
};


// Size 0x78
struct LaunchedFromKrakenActionStateConstructionInfo
{
public:
	struct NetActorPtr                                           Tentacle;                                          // 0x60(0x14)
};


// Size 0x10
struct NPCAnimationSequence
{
public:
	class AnimSequenceBase*                                      AnimationSequence;                                 // 0x0(0x8)
	class AnimMontage*                                           FacialAdditive;                                    // 0x8(0x8)
};


// Size 0x40
struct AthenaAnimationObjectLocomotionAnimations
{
public:
	class BlendSpace*                                            Locomotion1;                                       // 0x0(0x8)
	class BlendSpace*                                            Locomotion2;                                       // 0x8(0x8)
	class BlendSpace*                                            Locomotion3;                                       // 0x10(0x8)
	class BlendSpace*                                            Locomotion4;                                       // 0x18(0x8)
	class AnimSequence*                                          LocomotionTurningLeft;                             // 0x20(0x8)
	class AnimSequence*                                          LocomotionTurningRight;                            // 0x28(0x8)
	class AnimSequence*                                          LocomotionOutOf;                                   // 0x30(0x8)
	class BlendSpace*                                            LocomotionSwimming;                                // 0x38(0x8)
};


// Size 0x18
struct ProcessableActions
{
public:
	char                                                         CurrentStatus;                                     // 0x0(0x1)
	double                                                       StartTime;                                         // 0x8(0x8)
	int                                                          ActionIndex;                                       // 0x10(0x4)
};


// Size 0x3
struct JupiterActivitiesSessionEvent
{
public:
	char                                                         PlayModeVariant;                                   // 0x0(0x1)
	char                                                         SessionStyle;                                      // 0x1(0x1)
	char                                                         PlayMode;                                          // 0x2(0x1)
};


// Size 0x68
struct HttpResponseTelemetryFragment
{
public:
	struct FString                                               Method;                                            // 0x0(0x10)
	struct FString                                               EndPoint;                                          // 0x10(0x10)
	struct FString                                               Context;                                           // 0x20(0x10)
	char                                                         Result;                                            // 0x30(0x1)
	int                                                          StatusCode;                                        // 0x34(0x4)
	int                                                          DurationMS;                                        // 0x38(0x4)
	struct FString                                               ResponseBody;                                      // 0x40(0x10)
	TArray<String>                                               ResponseHeaders;                                   // 0x50(0x10)
	int                                                          Attempts;                                          // 0x60(0x4)
};


// Size 0x10
struct ShipHeartbeatTelemetryEvent
{
public:
	float                                                        Speed;                                             // 0x0(0x4)
	float                                                        Yaw;                                               // 0x4(0x4)
	float                                                        InternalWaterLevel;                                // 0x8(0x4)
	int                                                          FireCellsActive;                                   // 0xc(0x4)
};


// Size 0x28
struct SaveToLoadoutItemCost
{
public:
	struct FString                                               Name;                                              // 0x0(0x10)
	struct FString                                               Currency;                                          // 0x10(0x10)
	int                                                          Amount;                                            // 0x20(0x4)
};


// Size 0x8
struct ItemSpawnComponentFinishedSpawningEvent
{
public:
	class ItemSpawnComponent*                                    ItemSpawnComponent;                                // 0x0(0x8)
};


// Size 0x18
struct NPCOverlapException
{
public:
	struct StringAssetReference                                  MapName;                                           // 0x0(0x10)
	int                                                          MaxOverlapsAllowed;                                // 0x10(0x4)
};


// Size 0xa0
struct PlayerJoinedCrew
{
public:
	struct FText                                                 PlayerName;                                        // 0x18(0x38)
	struct FText                                                 PlayerNameOverride;                                // 0x50(0x38)
	bool                                                         IsJoining;                                         // 0x88(0x1)
	bool                                                         IsCaptain;                                         // 0x89(0x1)
	struct Guid                                                  GuildId;                                           // 0x8c(0x10)
};


// Size 0x8
struct EventSceneDialogueFinished
{
public:
	class SceneDialogueCoordinator*                              Sender;                                            // 0x0(0x8)
};


// Size 0x10
struct AlternateHeldPose
{
public:
	class AnimSequenceBase*                                      AlternateHeldPose;                                 // 0x0(0x8)
	float                                                        AlternateHeldPoseStrength;                         // 0x8(0x4)
};


// Size 0x28
struct NPCCustomAnimationBlueprintPlayingAnimations
{
public:
	class AnimSequenceBase*                                      OneShot;                                           // 0x0(0x8)
	class AnimSequenceBase*                                      ContinouousIn;                                     // 0x8(0x8)
	class AnimSequenceBase*                                      ContinouousLoop_A;                                 // 0x10(0x8)
	class AnimSequenceBase*                                      ContinouousLoop_B;                                 // 0x18(0x8)
	class AnimSequenceBase*                                      ContinouousOut;                                    // 0x20(0x8)
};


// Size 0x10
struct AchievementHeavyAttackRivalOffTheirShip
{
public:
	class AthenaCharacter*                                       Character;                                         // 0x0(0x8)
	float                                                        TimeWindowInSeconds;                               // 0x8(0x4)
};


// Size 0x8
struct ShipWaterloggedEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
};


// Size 0x50
struct ProjectileImpactTelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	struct FString                                               ProjectileId;                                      // 0x10(0x10)
	struct FString                                               DamagerTypeId;                                     // 0x20(0x10)
	struct FString                                               InstigatorObjectId;                                // 0x30(0x10)
	struct FString                                               InstigatorObjectType;                              // 0x40(0x10)
};


// Size 0x18
struct ItemDiggingEffectsOverride
{
public:
	TArray<Class>                                                Classes;                                           // 0x0(0x10)
	class ItemDiggingEffectsConfig*                              DiggingEffectsConfig;                              // 0x10(0x8)
};


// Size 0x30
struct ShipHullLandscapeDamageEntry
{
public:
	char                                                         PhysicalSurface;                                   // 0x0(0x1)
	class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x8(0x8)
	struct Int32Range                                            NumZonesToDamage;                                  // 0x10(0x10)
	struct Int32Range                                            DamageLevel;                                       // 0x20(0x10)
};


// Size 0x18
struct InvasionArrivalTunnelOfTheDamnedCompletedTelemetryEvent
{
public:
	struct Guid                                                  RivalCrewId;                                       // 0x0(0x10)
	int                                                          TunnelCrewSkillScore;                              // 0x10(0x4)
	int                                                          RivalCrewSkillScore;                               // 0x14(0x4)
};


// Size 0x4
struct InventoryInteractionTakeRequestEvent
{
public:
	int                                                          Index;                                             // 0x0(0x4)
};


// Size 0x10
struct EventWheelDamageLevelChanged
{
public:
	class Actor*                                                 Wheel;                                             // 0x0(0x8)
	int                                                          DamageLevel;                                       // 0x8(0x4)
};


// Size 0x14
struct WaterGunUseItemTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	float                                                        Charge;                                            // 0x10(0x4)
};


// Size 0x40
struct ShowJupiterAccountLinkingPrompt
{
public:
	struct FString                                               JupiterUsername;                                   // 0x0(0x10)
	struct FString                                               FullURL;                                           // 0x10(0x10)
	struct FString                                               DisplayURL;                                        // 0x20(0x10)
	struct FString                                               Code;                                              // 0x30(0x10)
};


// Size 0x8
struct VoyageAvailableForCancel
{
public:
	class VoyageProposalDesc*                                    ProposalDesc;                                      // 0x0(0x8)
};


// Size 0x1
struct EventGuildNameTextboxFocusRequest
{
public:
	bool                                                         ShouldFocusGuildNameTextbox;                       // 0x0(0x1)
};


// Size 0x1
struct EventWielderHasExternalLightSource
{
public:
	bool                                                         bOn;                                               // 0x0(0x1)
};


// Size 0x40
struct CaptainsLogPartDesc
{
public:
	struct StringAssetReference                                  BookSkeletalMesh;                                  // 0x0(0x10)
	int64                                                        BookSkeletalMeshResourceSize;                      // 0x10(0x8)
	struct StringAssetReference                                  BookStaticMesh;                                    // 0x18(0x10)
	int64                                                        BookStaticMeshResourceSize;                        // 0x28(0x8)
	class MaterialInterface*                                     WaterloggedTexture;                                // 0x30(0x8)
	class MaterialInterface*                                     RuinedTexture;                                     // 0x38(0x8)
};


// Size 0x20
struct FinishIntroAnimaticTutorialStepRpc
{
public:
	class AthenaTutorialComponent*                               TutorialComponent;                                 // 0x18(0x8)
};


// Size 0x1c
struct EventUpdateIslandEventToggle
{
public:
	struct Guid                                                  EventID;                                           // 0x0(0x10)
	struct Vector2D                                              EventScreenPos;                                    // 0x10(0x8)
	bool                                                         IsInverted;                                        // 0x18(0x1)
};


// Size 0x10
struct NPCOnSurfaceVOEntry
{
public:
	class SceneDialogueData*                                     DialogueData;                                      // 0x0(0x8)
	class WwiseEvent*                                            VOEvent;                                           // 0x8(0x8)
};


// Size 0x10
struct RequestEventShopOffersEvent
{
public:
	struct FString                                               CatalogName;                                       // 0x0(0x10)
};


// Size 0x8
struct ShipCustomizationChestUpdateSavedLoadoutEvent
{
public:
	class UClass*                                                Desc;                                              // 0x0(0x8)
};


// Size 0x10
struct CrewCancelVoteToBrigEvent
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
};


// Size 0x8
struct EventPlayerControllerPossessed
{
public:
	class PlayerController*                                      PlayerController;                                  // 0x0(0x8)
};


// Size 0x4
struct SetAdventureIslandBanners
{
public:
	int                                                          Value;                                             // 0x0(0x4)
};


// Size 0x10
struct EventFactionStatsRequest
{
public:
	struct FString                                               CompanyId;                                         // 0x0(0x10)
};


// Size 0x14
struct ContestCrewPositionTelemetryFragment
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	int                                                          CrewPositionInLastContest;                         // 0x10(0x4)
};


// Size 0x20
struct UseItemOnServerRpc
{
public:
	class WieldableItem*                                         Item;                                              // 0x18(0x8)
};


// Size 0x8
struct CrewBaseTelemetryFragmentPlayerControllerLookupInput
{
public:
	class PlayerState*                                           CrewMemberPlayerState;                             // 0x0(0x8)
};


// Size 0x10
struct ImpactSurfaceData
{
public:
	char                                                         SurfaceType;                                       // 0x0(0x1)
	class ImpactDataAsset*                                       ImpactData;                                        // 0x8(0x8)
};


// Size 0x1c
struct EnterTunnelOfTheDamnedActionStateParams
{
public:
	float                                                        FadeDuration;                                      // 0x0(0x4)
	float                                                        FadeEventTimeout;                                  // 0x4(0x4)
	float                                                        FadeServerTimeout;                                 // 0x8(0x4)
	struct LinearColor                                           FadeColour;                                        // 0xc(0x10)
};


// Size 0x4
struct SetTimeGameServerRequestModel
{
public:
	int                                                          Hours;                                             // 0x0(0x4)
};


// Size 0x8
struct EventPlayerCharacterModelsReplaced
{
public:
	class Actor*                                                 PlayerCharacter;                                   // 0x0(0x8)
};


// Size 0x10
struct InitRHIDiagnosticTelemetryEvent
{
public:
	struct FString                                               ErrorMessage;                                      // 0x0(0x10)
};


// Size 0x10
struct CrewMember
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
};


// Size 0x30
struct PetSpawnDefinition
{
public:
	class UClass*                                                PetDesc;                                           // 0x0(0x8)
	struct PetCustomisation                                      PetCustomisation;                                  // 0x8(0x28)
};


// Size 0x4
struct GameNarrationOverrideStateChangeEvent
{
public:
	int                                                          Status;                                            // 0x0(0x4)
};


// Size 0x60
struct FiredFromActorActionStateConstructionInfo
{
public:
	struct NetActorPtr                                           FiringActor;                                       // 0x40(0x14)
	struct Vector                                                LaunchVelocity;                                    // 0x54(0xc)
};


// Size 0x10
struct EventObjectWielded
{
public:
	interface                                                    Object;                                            // 0x0(0x10)
};


// Size 0x10
struct CampaignPopUpNotificationInfo
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	class PopUpMessageDesc*                                      PopUp;                                             // 0x8(0x8)
};


// Size 0x10
struct ShipCustomizationChestMutualExclusion
{
public:
	class UClass*                                                A;                                                 // 0x0(0x8)
	class UClass*                                                B;                                                 // 0x8(0x8)
};


// Size 0x18
struct ShipConfigurationSettings
{
public:
	float                                                        MetresSailedStatSendFrequency;                     // 0x0(0x4)
	float                                                        MinimumDistanceSailedBeforeSendingUpdate;          // 0x4(0x4)
	float                                                        MaxVelocityAllowedForServerMigration;              // 0x8(0x4)
	float                                                        MaxAngularVelocityAllowedForServerMigration;       // 0xc(0x4)
	float                                                        ShipHeartbeatFrequencySeconds;                     // 0x10(0x4)
	bool                                                         MigrationBasedOnVelocityEnabled;                   // 0x14(0x1)
};


// Size 0x10
struct BootFlowErrorMessageQueryResponseEvent
{
public:
	struct FString                                               ErrorMessage;                                      // 0x0(0x10)
};


// Size 0x10
struct PirateDeletionSucceededEvent
{
public:
	struct FString                                               PirateId;                                          // 0x0(0x10)
};


// Size 0x28
struct ItemSnapshotTakenEvent
{
public:
	interface                                                    Instagator;                                        // 0x0(0x10)
	struct Guid                                                  SnapshotID;                                        // 0x10(0x10)
	class Object*                                                SnapshotObject;                                    // 0x20(0x8)
};


// Size 0x8
struct PlayerObjectUsageTelemetryFragmentInput
{
public:
	class Object*                                                ObjectBeingUsed;                                   // 0x0(0x8)
};


// Size 0x8
struct EventCharacterSpawned
{
public:
	class Character*                                             Character;                                         // 0x0(0x8)
};


// Size 0x40
struct CargoRunQuestDescDataCompanyLocationHintEntry
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	struct FText                                                 LocationHint;                                      // 0x8(0x38)
};


// Size 0x10
struct SeaFortAlignmentTableModelCosmeticDefaults
{
public:
	struct FName                                                 ScalarParameterName;                               // 0x0(0x8)
	class CurveFloat*                                            Curve;                                             // 0x8(0x8)
};


// Size 0x50
struct EventUserGameSettingsRadialMappings
{
public:
	struct FName                                                 RadialSlotIndex0SelectedKeyboard;                  // 0x0(0x8)
	struct FName                                                 RadialSlotIndex1SelectedKeyboard;                  // 0x8(0x8)
	struct FName                                                 RadialSlotIndex2SelectedKeyboard;                  // 0x10(0x8)
	struct FName                                                 RadialSlotIndex3SelectedKeyboard;                  // 0x18(0x8)
	struct FName                                                 RadialSlotIndex4SelectedKeyboard;                  // 0x20(0x8)
	struct FName                                                 RadialSlotIndex5SelectedKeyboard;                  // 0x28(0x8)
	struct FName                                                 RadialSlotIndex6SelectedKeyboard;                  // 0x30(0x8)
	struct FName                                                 RadialSlotIndex7SelectedKeyboard;                  // 0x38(0x8)
	struct FName                                                 RadialSlotClockwise;                               // 0x40(0x8)
	struct FName                                                 RadialSlotCounterClockwise;                        // 0x48(0x8)
};


// Size 0x10
struct PremiumCurrencyItemsErrorEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x58
struct MoveToLocationActionStateConstructionInfo
{
public:
	class SceneComponent*                                        RelativeToComponent;                               // 0x40(0x8)
	struct Vector                                                TargetLocation;                                    // 0x48(0xc)
};


// Size 0x8
struct EventCharacterKnockedBack
{
public:
	struct FName                                                 RumbleTag;                                         // 0x0(0x8)
};


// Size 0xc
struct NPCOnDespawnVOEntry
{
public:
	char                                                         DespawnReason;                                     // 0x0(0x1)
	struct FName                                                 VOGroupName;                                       // 0x4(0x8)
};


// Size 0x18
struct EmblemClaim
{
public:
	bool                                                         IsCompleted;                                       // 0x0(0x1)
	struct FString                                               Sig;                                               // 0x8(0x10)
};


// Size 0x40
struct LevelLoadCompletedTelemetryEvent
{
public:
	bool                                                         WasCancelRequested;                                // 0x30(0x1)
	bool                                                         WasCancelActioned;                                 // 0x31(0x1)
	float                                                        DistancePlayerTravelledSinceLoadRequest;           // 0x34(0x4)
	float                                                        TimeSinceLoadRequested;                            // 0x38(0x4)
};


// Size 0x150
struct QuestTableCompanyVoyageCategoryData
{
public:
	class UClass*                                                CategoryId;                                        // 0x0(0x8)
	struct FText                                                 CategoryName;                                      // 0x8(0x38)
	struct StringAssetReference                                  CategoryIcon;                                      // 0x40(0x10)
	struct FText                                                 CategoryLockedDescription;                         // 0x50(0x38)
	bool                                                         IsTutorialCategory;                                // 0x88(0x1)
	bool                                                         IsInfoCategory;                                    // 0x89(0x1)
	bool                                                         IsInfoCategoryWhenNoVoyagesAvailable;              // 0x8a(0x1)
	struct FText                                                 InfoCategoryTitle;                                 // 0x90(0x38)
	struct FText                                                 InfoCategoryDescription;                           // 0xc8(0x38)
	struct FText                                                 InfoCategorySuggestion;                            // 0x100(0x38)
	bool                                                         HideInfoCategorySuggestionInSaferSeas;             // 0x138(0x1)
	struct StringAssetReference                                  InfoCategoryBackgroundImage;                       // 0x140(0x10)
};


// Size 0x10
struct SequenceResponseContainer
{
public:
	int                                                          SequenceIndexToTrigger;                            // 0x0(0x4)
	class Actor*                                                 ResponseActor;                                     // 0x8(0x8)
};


// Size 0x8
struct OtherPartyTelemetryFragmentInput
{
public:
	class Actor*                                                 OtherParty;                                        // 0x0(0x8)
};


// Size 0x8
struct EventMeleeAttackPredictedHit
{
public:
	class Actor*                                                 HitActor;                                          // 0x0(0x8)
};


// Size 0x18
struct EventLanternIsLightOnStateChanged
{
public:
	class Actor*                                                 Item;                                              // 0x0(0x8)
	class UClass*                                                InputID;                                           // 0x8(0x8)
	bool                                                         IsLightOn;                                         // 0x10(0x1)
};


// Size 0x1
struct EventDockedToObject
{
public:
	char                                                         ObjectType;                                        // 0x0(0x1)
};


// Size 0x8
struct EventPlayerCharacterExitedShip
{
public:
	class Actor*                                                 PlayerCharacter;                                   // 0x0(0x8)
};


// Size 0x220
struct PremiumStoreItemView
{
public:
	struct FString                                               TopBannerUrl;                                      // 0x200(0x10)
	struct FString                                               BottomBannerUrl;                                   // 0x210(0x10)
};


// Size 0x28
struct SeaFortDistantLightsAssetLoader
{
public:
	class SeaFortsService*                                       Owner;                                             // 0x0(0x8)
	class UClass*                                                LoadedDistantLightsAsset;                          // 0x8(0x8)
};


// Size 0x20
struct MermaidUsedEvent
{
public:
	class Mermaid*                                               Mermaid;                                           // 0x18(0x8)
};


// Size 0x10
struct RequestCompanyProgressFailedEvent
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
};


// Size 0x88
struct MPSDFallbackData
{
public:
	struct UniqueNetIdRepl                                       CaptainUserId;                                     // 0x0(0x18)
	TArray<struct UniqueNetIdRepl>                               CrewUserIds;                                       // 0x18(0x10)
	struct Guid                                                  CrewId;                                            // 0x28(0x10)
	map                                                          ReconnectExpiryTimerHandles;                       // 0x38(0x50)
};


// Size 0x10
struct EventUserGameSettingsSetInteger
{
public:
	struct FName                                                 KeyName;                                           // 0x0(0x8)
	int                                                          Value;                                             // 0x8(0x4)
	char                                                         Instigator;                                        // 0xc(0x1)
};


// Size 0x10
struct AthenaAnimationSkeletonKnockbackLocomotion
{
public:
	class AnimSequence*                                          Forwards;                                          // 0x0(0x8)
	class AnimSequence*                                          Backwards;                                         // 0x8(0x8)
};


// Size 0x10
struct EventAIOnDelayedAssignedMeshConsumed
{
public:
	class SkeletalMeshComponent*                                 MeshComponent;                                     // 0x0(0x8)
	class SkeletalMesh*                                          ConsumedMesh;                                      // 0x8(0x8)
};


// Size 0x2
struct EventPlayerControllerKillNotification
{
public:
	bool                                                         IsHighContrast;                                    // 0x0(0x1)
	bool                                                         PlaySfx;                                           // 0x1(0x1)
};


// Size 0x50
struct MountpointClientState
{
public:
	class SceneComponent*                                        TrinketRootComponent;                              // 0x0(0x8)
	class UClass*                                                TrinketClassCached;                                // 0x8(0x8)
	struct Transform                                             TrinketRelativePivotOffset;                        // 0x10(0x30)
	class NudgeInterpolationParamsDataAsset*                     NudgeInterpolationParamsDataAsset;                 // 0x40(0x8)
	class TrinketSfxDataAsset*                                   SfxDataAsset;                                      // 0x48(0x8)
};


// Size 0x18
struct SetNonVerbalOption
{
public:
	TArray<String>                                               Phrases;                                           // 0x8(0x10)
};


// Size 0xc
struct EventUserGameSettingsBooleanChanged
{
public:
	struct FName                                                 KeyName;                                           // 0x0(0x8)
	bool                                                         Value;                                             // 0x8(0x1)
};


// Size 0x30
struct ContestScoreTelemetryGameEvent
{
public:
	char                                                         ScoreReason;                                       // 0x0(0x1)
	int                                                          CurrentScore;                                      // 0x4(0x4)
	int                                                          ScoreChangeAmount;                                 // 0x8(0x4)
	struct FString                                               ScoreContext;                                      // 0x10(0x10)
	struct Guid                                                  InstigatorId;                                      // 0x20(0x10)
};


// Size 0x10
struct TaleQuestTaskCompleteTelemetryEvent
{
public:
	struct Guid                                                  TaskId;                                            // 0x0(0x10)
};


// Size 0x28
struct SignedGuildIdModel
{
public:
	struct Guid                                                  GuildId;                                           // 0x0(0x10)
	char                                                         GuildAffiliation;                                  // 0x10(0x1)
	struct FString                                               Signature;                                         // 0x18(0x10)
};


// Size 0x10
struct AthenaItemsSettingsProjectileCollisionChannelOverride
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	char                                                         ProjectileCollisionChannel;                        // 0x8(0x1)
};


// Size 0x68
struct CompanyShopActionStateConstructionInfo
{
public:
	struct NetObjectPtr                                          NPC;                                               // 0x40(0x14)
};


// Size 0x38
struct SeasonGoalInfo
{
public:
	struct Guid                                                  GoalId;                                            // 0x0(0x10)
	int64                                                        Threshold;                                         // 0x10(0x8)
	struct FString                                               XPGain;                                            // 0x18(0x10)
	struct FString                                               LocalizedTitle;                                    // 0x28(0x10)
};


// Size 0x8
struct NewCaptaincyCustomisationEquipped
{
public:
	class UClass*                                                Desc;                                              // 0x0(0x8)
};


// Size 0x8
struct EventCharacterInteraction
{
public:
	class Object*                                                Interactable;                                      // 0x0(0x8)
};


// Size 0x10
struct ReplyToGuildInviteResponseModel
{
public:
	struct FString                                               Error;                                             // 0x0(0x10)
};


// Size 0x2
struct CarouselPirateBodyshapeCompass
{
public:
	char                                                         StartDirection;                                    // 0x0(0x1)
	char                                                         EndDirection;                                      // 0x1(0x1)
};


// Size 0x58
struct InteractObjectActionStateConstructionInfo
{
public:
	struct NetSubObjectPtr                                       InteractObject;                                    // 0x40(0x14)
};


// Size 0x20
struct UIScreenTransitionEvent
{
public:
	struct FString                                               CurrentScreen;                                     // 0x0(0x10)
	struct FString                                               PreviousScreen;                                    // 0x10(0x10)
};


// Size 0x14
struct EventShipRemovedFromCrew
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	bool                                                         IsMigrating;                                       // 0x10(0x1)
};


// Size 0x14
struct RewardRequestFailedEvent
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
	char                                                         FailureReason;                                     // 0x10(0x1)
};


// Size 0x10
struct TransientActorEntry
{
public:
	class Actor*                                                 Actor;                                             // 0x0(0x8)
};


// Size 0x10
struct CreateSessionFailedEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x10
struct ServiceStatusNotification
{
public:
	uint32                                                       NotificationId;                                    // 0x0(0x4)
	struct DateTime                                              ActivatedDateTimeUtc;                              // 0x8(0x8)
};


// Size 0x10
struct CompanyCatalog
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	class CatalogDataAsset*                                      Catalog;                                           // 0x8(0x8)
};


// Size 0xa0
struct LoadoutCostResponseModel
{
public:
	map                                                          CategoryCosts;                                     // 0x0(0x50)
	map                                                          EntitlementCosts;                                  // 0x50(0x50)
};


// Size 0x30
struct InvasionTunnelDioramaRestrictedSpawnSettings
{
public:
	assetclass                                                   DioramaClass;                                      // 0x0(0x20)
	TArray<class InvasionTunnelDioramaSpawnCondition*>           Conditions;                                        // 0x20(0x10)
};


// Size 0x10
struct ResolutionTelemetryFragment
{
public:
	uint32                                                       ResolutionWidth;                                   // 0x0(0x4)
	uint32                                                       ResolutionHeight;                                  // 0x4(0x4)
	float                                                        ScreenPercentage;                                  // 0x8(0x4)
	bool                                                         DynamicResolution;                                 // 0xc(0x1)
};


// Size 0x38
struct MarkerVariantDesc
{
public:
	class UClass*                                                Variant;                                           // 0x0(0x8)
	class UClass*                                                MarkerType;                                        // 0x8(0x8)
	bool                                                         UseActorMarker;                                    // 0x10(0x1)
	struct StringAssetReference                                  MarkerVfx;                                         // 0x18(0x10)
	struct StringClassReference                                  MarkerClass;                                       // 0x28(0x10)
};


// Size 0x38
struct CurrencyGrantedNotificationUIEvent
{
public:
	char                                                         CurrencyId;                                        // 0x0(0x1)
	int                                                          Amount;                                            // 0x4(0x4)
	struct FString                                               DisplayAmount;                                     // 0x8(0x10)
	struct FString                                               EmissaryAddition;                                  // 0x18(0x10)
	struct FString                                               EmissaryId;                                        // 0x28(0x10)
};


// Size 0x8
struct EventGhostShipDoorCreated
{
public:
	class GhostShipDoor*                                         GhostShipDoor;                                     // 0x0(0x8)
};


// Size 0x40
struct ItemSpawnTelemetryEvent
{
public:
	struct Guid                                                  ItemId;                                            // 0x0(0x10)
	struct FName                                                 SpawnedClass;                                      // 0x10(0x8)
	char                                                         Source;                                            // 0x18(0x1)
	struct FString                                               SourceId;                                          // 0x20(0x10)
	struct Vector                                                SpawnLocation;                                     // 0x30(0xc)
};


// Size 0x8
struct EventOnShipSurfacing
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
};


// Size 0x48
struct UIPremiumStorePageTransitionEvent
{
public:
	struct FString                                               CurrentPage;                                       // 0x0(0x10)
	struct FString                                               PreviousHighlight;                                 // 0x10(0x10)
	struct FString                                               PreviousPage;                                      // 0x20(0x10)
	struct FString                                               SessionId;                                         // 0x30(0x10)
	float                                                        TimeOnPreviousPage;                                // 0x40(0x4)
};


// Size 0x4
struct MastSailAngleBecameStationaryEvent
{
public:
	float                                                        Angle;                                             // 0x0(0x4)
};


// Size 0x40
struct WorldMapIslandDataCaptureParams
{
public:
	struct Vector                                                CameraPosition;                                    // 0x0(0xc)
	struct Rotator                                               CameraOrientation;                                 // 0xc(0xc)
	struct Vector                                                WorldSpaceCameraPosition;                          // 0x18(0xc)
	float                                                        CameraFOV;                                         // 0x24(0x4)
	float                                                        CameraAspect;                                      // 0x28(0x4)
	float                                                        CameraOrthoWidth;                                  // 0x2c(0x4)
	float                                                        CameraNearClip;                                    // 0x30(0x4)
	float                                                        CameraFarClip;                                     // 0x34(0x4)
	int                                                          TextureWidth;                                      // 0x38(0x4)
	int                                                          TextureHeight;                                     // 0x3c(0x4)
};


// Size 0x1
struct EventLocalPlayerEnteredSittingState
{
public:
	bool                                                         SeatSupportsThirdPersonCamera;                     // 0x0(0x1)
};


// Size 0x28
struct AggressiveGhostShipSpawnTelemetryEvent
{
public:
	struct Guid                                                  ShipId;                                            // 0x0(0x10)
	char                                                         ShipType;                                          // 0x10(0x1)
	struct Guid                                                  EncounterId;                                       // 0x14(0x10)
	int                                                          WaveIndex;                                         // 0x24(0x4)
};


// Size 0xc
struct ItemPreviewMoveCameraEvent
{
public:
	float                                                        Rotation;                                          // 0x0(0x4)
	float                                                        Pitch;                                             // 0x4(0x4)
	float                                                        Zoom;                                              // 0x8(0x4)
};


// Size 0x60
struct PlayerBuriedItemsDeferredRewardCompensationTelemetryEvent
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
	struct FName                                                 CompanyAffiliation;                                // 0x10(0x8)
	struct FName                                                 RewardId;                                          // 0x18(0x8)
	struct FString                                               UserId;                                            // 0x20(0x10)
	struct FString                                               PirateId;                                          // 0x30(0x10)
	bool                                                         DontRewardCurrency;                                // 0x40(0x1)
	bool                                                         DontRewardXp;                                      // 0x41(0x1)
	bool                                                         DontRewardSeasonXp;                                // 0x42(0x1)
	struct FString                                               DeferralReason;                                    // 0x48(0x10)
	double                                                       RewardMultiplier;                                  // 0x58(0x8)
};


// Size 0x20
struct ServerAsyncLoadingCompleteAckNetworkEvent
{
public:
	char                                                         Reason;                                            // 0x18(0x1)
};


// Size 0x90
struct AttachedToObjectActionStateConstructionInfo
{
public:
	struct Transform                                             AttachTransform;                                   // 0x60(0x30)
};


// Size 0x48
struct AnimationContinuousCycle
{
public:
	class AnimSequence*                                          In;                                                // 0x0(0x8)
	float                                                        InEffectTime;                                      // 0x8(0x4)
	TArray<class AnimSequence*>                                  Loop;                                              // 0x10(0x10)
	class BlendSpace1D*                                          LoopHitReact;                                      // 0x20(0x8)
	class AnimSequence*                                          Out;                                               // 0x28(0x8)
	TArray<class AnimSequence*>                                  OutAlternates;                                     // 0x30(0x10)
	float                                                        OutUndockTime;                                     // 0x40(0x4)
};


// Size 0x10
struct OpenForListEntry
{
public:
	class Pawn*                                                  Pawn;                                              // 0x0(0x8)
	float                                                        TimeUntilDoorFullyOpen;                            // 0x8(0x4)
};


// Size 0x38
struct MeshMemoryConstraintRegistrationBaseTelemetryEvent
{
public:
	bool                                                         HasWorldContext;                                   // 0x0(0x1)
	bool                                                         HasGameState;                                      // 0x1(0x1)
	struct FString                                               Category;                                          // 0x8(0x10)
	struct FString                                               BudgetNoFallback;                                  // 0x18(0x10)
	struct FString                                               MeshReference;                                     // 0x28(0x10)
};


// Size 0x8
struct IslandSelectionType
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
};


// Size 0x18
struct ItemBuryingBaseOverride
{
public:
	TArray<Class>                                                Classes;                                           // 0x0(0x10)
	class ItemDiggingBuryConfig*                                 BuryingConfig;                                     // 0x10(0x8)
};


// Size 0x38
struct MatchModel
{
public:
	struct FString                                               DisplayName;                                       // 0x0(0x10)
	struct FString                                               UserId;                                            // 0x10(0x10)
	bool                                                         DisplayNameFound;                                  // 0x20(0x1)
	struct FString                                               LastSeenOnPlatform;                                // 0x28(0x10)
};


// Size 0x8
struct OnItemAbandoned
{
public:
	class ItemInfo*                                              ItemInfo;                                          // 0x0(0x8)
};


// Size 0x40
struct CutscenePool
{
public:
	struct FName                                                 CutsceneName;                                      // 0x0(0x8)
	int                                                          Priority;                                          // 0x8(0x4)
	int                                                          ActivationChance;                                  // 0xc(0x4)
	bool                                                         ShouldQueue;                                       // 0x10(0x1)
	float                                                        AdditionalPoolCooldown;                            // 0x14(0x4)
	class CutscenePoolType*                                      PoolType;                                          // 0x18(0x8)
	TArray<class SceneDialogueData*>                             DialogueData;                                      // 0x20(0x10)
	TArray<float>                                                CutsceneLengths;                                   // 0x30(0x10)
};


// Size 0x40
struct SetRadialTitleText
{
public:
	struct FText                                                 Text;                                              // 0x8(0x38)
};


// Size 0x30
struct XPGrantedNetworkEvent
{
public:
	uint32                                                       XPGranted;                                         // 0x18(0x4)
	uint32                                                       CurrentLevel;                                      // 0x1c(0x4)
	uint32                                                       CurrentXP;                                         // 0x20(0x4)
	struct FName                                                 CompanyId;                                         // 0x24(0x8)
};


// Size 0x4
struct SetWindMagnitudeGameServerRequestModel
{
public:
	float                                                        Magnitude;                                         // 0x0(0x4)
};


// Size 0x10
struct ClientStartConnectingToServerTelemetryEvent
{
public:
	struct Guid                                                  MatchmakingAttemptId;                              // 0x0(0x10)
};


// Size 0x30
struct KrakenAnimatedTentacleWaterTriggerableFX
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	float                                                        WaterHeightOffset;                                 // 0x8(0x4)
	class Object*                                                FirstPersonTargetVFX;                              // 0x10(0x8)
	class Object*                                                ThirdPersonTargetVFX;                              // 0x18(0x8)
	class Object*                                                AboveWaterVFX;                                     // 0x20(0x8)
	class Object*                                                BelowWaterVFX;                                     // 0x28(0x8)
};


// Size 0x20
struct WheelAdditiveProperties
{
public:
	float                                                        RightHandOnHandleAMin;                             // 0x0(0x4)
	float                                                        RightHandOnHandleAMax;                             // 0x4(0x4)
	float                                                        RightHandOnHandleBMin;                             // 0x8(0x4)
	float                                                        RightHandOnHandleBMax;                             // 0xc(0x4)
	float                                                        LeftHandOnHandleAMin;                              // 0x10(0x4)
	float                                                        LeftHandOnHandleAMax;                              // 0x14(0x4)
	float                                                        LeftHandOnHandleBMin;                              // 0x18(0x4)
	float                                                        LeftHandOnHandleBMax;                              // 0x1c(0x4)
};


// Size 0x10
struct GuildNamesFailedEvent
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
};


// Size 0x8
struct ChestOnShipEvent
{
public:
	class Actor*                                                 CurrentShip;                                       // 0x0(0x8)
};


// Size 0x20
struct LoadoutCategory
{
public:
	struct FString                                               CategoryName;                                      // 0x0(0x10)
	struct FString                                               EntitlementId;                                     // 0x10(0x10)
};


// Size 0x20
struct UnscrambledIdentity
{
public:
	struct Guid                                                  EntityId;                                          // 0x0(0x10)
	struct FString                                               UnscrambledName;                                   // 0x10(0x10)
};


// Size 0x24
struct CaptainsLogCrewSessionStatsEntry
{
public:
	int                                                          DaysAtSea;                                         // 0x0(0x4)
	int                                                          MilesSailed;                                       // 0x4(0x4)
	int                                                          GoldEarned;                                        // 0x8(0x4)
	int                                                          QuestsCompleted;                                   // 0xc(0x4)
	int                                                          DaysSinceLastSunk;                                 // 0x10(0x4)
	int                                                          FishCaught;                                        // 0x14(0x4)
	int                                                          MetresSailed;                                      // 0x18(0x4)
	int                                                          PreviousDaysSinceLastSunk;                         // 0x1c(0x4)
	int                                                          CaptainsPreviousBalance;                           // 0x20(0x4)
};


// Size 0x10
struct EventPlayerUseItemStart
{
public:
	class UClass*                                                InputID;                                           // 0x0(0x8)
	class Actor*                                                 UsedItem;                                          // 0x8(0x8)
};


// Size 0x8
struct TutorialEventControlledObjectCreated
{
public:
	class TutorialEventControlledObject*                         TutorialEventControlledObject;                     // 0x0(0x8)
};


// Size 0x10
struct StunAttackerOnHitSurfacePair
{
public:
	class PhysicalMaterial*                                      PhysMaterial;                                      // 0x0(0x8)
	float                                                        StunDuration;                                      // 0x8(0x4)
};


// Size 0xc
struct SprintConditionsParams
{
public:
	float                                                        ForwardInputVectorTolerance;                       // 0x0(0x4)
	float                                                        MinVelocityForwardDot;                             // 0x4(0x4)
	float                                                        MinVelocityMagnitude;                              // 0x8(0x4)
};


// Size 0x10
struct DeepSeaRegionScreenEffects
{
public:
	bool                                                         ShouldUseScreenEffects;                            // 0x0(0x1)
	float                                                        DepthFadeEnd;                                      // 0x4(0x4)
	float                                                        RadialFadeStart;                                   // 0x8(0x4)
	float                                                        RadialFadeEnd;                                     // 0xc(0x4)
};


// Size 0x18
struct ArrivalTunnelOfTheDamnedCompletedTelemetryEvent
{
public:
	struct Vector                                                DestinationLocation;                               // 0x0(0xc)
	struct Rotator                                               DestinationRotation;                               // 0xc(0xc)
};


// Size 0x18
struct ClientEndEngagementMessageEvent
{
public:
	float                                                        ScreenDuration;                                    // 0x0(0x4)
	struct FString                                               EndedScreen;                                       // 0x8(0x10)
};


// Size 0x8
struct EventSetFishingRodWieldedItem
{
public:
	class Actor*                                                 FishingRod;                                        // 0x0(0x8)
};


// Size 0x20
struct UserPresenceRequestEvent
{
public:
	TArray<String>                                               XUIDs;                                             // 0x0(0x10)
	struct FString                                               Id;                                                // 0x10(0x10)
};


// Size 0x40
struct PuzzleStatueConfigurationPosition
{
public:
	struct Transform                                             PivotTransform;                                    // 0x0(0x30)
	class WwiseEvent*                                            PositionAudioEvent;                                // 0x30(0x8)
};


// Size 0x20
struct RequestPurchaseShopOfferEvent
{
public:
	struct Guid                                                  OfferId;                                           // 0x0(0x10)
	struct FString                                               CatalogName;                                       // 0x10(0x10)
};


// Size 0x50
struct CachedRespawnPoint
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct Transform                                             AllocatedRespawnPoint;                             // 0x10(0x30)
	class ShipSpawnLocation*                                     AllocatedSpawnLocation;                            // 0x40(0x8)
};


// Size 0x1e0
struct AthenaAnimationAsyncLoadedFishingAnimations
{
public:
	assetobject                                                  CastIntoHoldBack;                                  // 0x0(0x20)
	assetobject                                                  CastHoldBackLoop;                                  // 0x20(0x20)
	assetobject                                                  CastForwards;                                      // 0x40(0x20)
	assetobject                                                  CastHoldLoop;                                      // 0x60(0x20)
	assetobject                                                  CastToFishing;                                     // 0x80(0x20)
	assetobject                                                  CastFail;                                          // 0xa0(0x20)
	class BlendSpace*                                            Fishing;                                           // 0xc0(0x8)
	class BlendSpace1D*                                          FishingAdditive;                                   // 0xc8(0x8)
	assetobject                                                  IntoFighting;                                      // 0xd0(0x20)
	assetobject                                                  FightingCentral;                                   // 0xf0(0x20)
	assetobject                                                  FightingAdditive;                                  // 0x110(0x20)
	assetobject                                                  Linesnap;                                          // 0x130(0x20)
	class AnimSequence*                                          SuccessReelIn;                                     // 0x150(0x8)
	assetobject                                                  ComedyItemSuccessReelIn;                           // 0x158(0x20)
	assetobject                                                  ShakingAdditive;                                   // 0x178(0x20)
	assetobject                                                  LineSnapShakingAdditive;                           // 0x198(0x20)
	class AnimSequence*                                          FishingToIdle;                                     // 0x1b8(0x8)
	assetobject                                                  FishingToUnequip;                                  // 0x1c0(0x20)
};


// Size 0x20
struct WorldEventSnapshotV1
{
public:
	struct FString                                               EventID;                                           // 0x0(0x10)
	struct FString                                               Status;                                            // 0x10(0x10)
};


// Size 0x18
struct InputSequencePair
{
public:
	class UClass*                                                InputID;                                           // 0x0(0x8)
	char                                                         Variant;                                           // 0x8(0x1)
	class AnimMontage*                                           Sequence;                                          // 0x10(0x8)
};


// Size 0x18
struct RequestEntitlementsAsyncFailedTelemetryEvent
{
public:
	char                                                         Reason;                                            // 0x0(0x1)
	char                                                         ServiceFailureReason;                              // 0x1(0x1)
	int                                                          HTTPStatusCode;                                    // 0x4(0x4)
	struct FString                                               AbortedReason;                                     // 0x8(0x10)
};


// Size 0x10
struct GetLoadoutFilteredRequest
{
public:
	struct FString                                               Device;                                            // 0x0(0x10)
};


// Size 0x1
struct EventHUDMouseFocusRequest
{
public:
	bool                                                         RequestFocus;                                      // 0x0(0x1)
};


// Size 0x68
struct MeleeBlockingActionStateConstructionInfo
{
public:
	struct NetActorPtr                                           WieldedItem;                                       // 0x40(0x14)
	class UClass*                                                InputID;                                           // 0x58(0x8)
	float                                                        BlockMovementLockTime;                             // 0x60(0x4)
};


// Size 0x8
struct CharacterSocketCollisionServiceParams
{
public:
	float                                                        MaxCharacterDistanceSqr;                           // 0x0(0x4)
	int                                                          MaxSockets;                                        // 0x4(0x4)
};


// Size 0x4
struct WheelArmIKBoolSets
{
public:
	bool                                                         LeftIKOn;                                          // 0x0(0x1)
	bool                                                         RightIKOn;                                         // 0x1(0x1)
	bool                                                         LeftArmDown;                                       // 0x2(0x1)
	bool                                                         RightArmDown;                                      // 0x3(0x1)
};


// Size 0x14
struct PlayerCharacterSnapshot
{
public:
	int                                                          Id;                                                // 0x0(0x4)
	struct Vector                                                Position;                                          // 0x4(0xc)
	float                                                        Health;                                            // 0x10(0x4)
};


// Size 0x30
struct AthenaAnimationRowboatAnimationsFirstPerson
{
public:
	class AnimSequence*                                          SitDown;                                           // 0x0(0x8)
	class AnimSequence*                                          Stand;                                             // 0x8(0x8)
	class AnimSequence*                                          Idle;                                              // 0x10(0x8)
	class AnimSequence*                                          Row;                                               // 0x18(0x8)
	class AnimSequence*                                          Recover;                                           // 0x20(0x8)
	class AnimSequence*                                          Brake;                                             // 0x28(0x8)
};


// Size 0x10
struct PiratePreviewCreatedEvent
{
public:
	struct FString                                               PreviewURL;                                        // 0x0(0x10)
};


// Size 0x18
struct SupplementalLoadout
{
public:
	struct FName                                                 Feature;                                           // 0x0(0x8)
	struct StringAssetReference                                  LoadoutAsset;                                      // 0x8(0x10)
};


// Size 0x18
struct GenericPartDesc
{
public:
	struct StringAssetReference                                  Mesh;                                              // 0x0(0x10)
	int64                                                        CachedMeshResourceSize;                            // 0x10(0x8)
};


// Size 0x1
struct ConsumeEntitlementRequestFailedTelemetryEvent
{
public:
	char                                                         Reason;                                            // 0x0(0x1)
};


// Size 0x10
struct AthenaAnimationPetSelectedArrayAnimations
{
public:
	class AnimSequence*                                          HeldBaseIdle_A;                                    // 0x0(0x8)
	class AnimSequence*                                          HeldBaseIdle_B;                                    // 0x8(0x8)
};


// Size 0x18
struct ItemRequirementData
{
public:
	int                                                          RequiredNumberToMatch;                             // 0x0(0x4)
	TArray<class Class*>                                         RequiredItemsInLoadout;                            // 0x8(0x10)
};


// Size 0x10
struct CrewBeganTaleEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x68
struct HttpResponseTelemetryFragmentInput
{
public:
	struct FString                                               Method;                                            // 0x0(0x10)
	struct FString                                               EndPoint;                                          // 0x10(0x10)
	struct FString                                               Context;                                           // 0x20(0x10)
	char                                                         Result;                                            // 0x30(0x1)
	int                                                          StatusCode;                                        // 0x34(0x4)
	int                                                          DurationMS;                                        // 0x38(0x4)
	struct FString                                               ResponseBody;                                      // 0x40(0x10)
	TArray<String>                                               ResponseHeaders;                                   // 0x50(0x10)
	int                                                          Attempts;                                          // 0x60(0x4)
};


// Size 0x30
struct ProjectileServiceClientProjectileHitVolumeImpact
{
public:
	double                                                       TimeStamp;                                         // 0x0(0x8)
	int                                                          ProjectileIndex;                                   // 0x8(0x4)
	struct Guid                                                  TelemetryAttackId;                                 // 0xc(0x10)
	class AthenaPlayerCharacter*                                 InstigatingPlayerCharacter;                        // 0x20(0x8)
	class Actor*                                                 HitActor;                                          // 0x28(0x8)
};


// Size 0x28
struct ChainLink
{
public:
	class Actor*                                                 Source;                                            // 0x0(0x8)
	class Actor*                                                 Target;                                            // 0x8(0x8)
	struct Vector_NetQuantize                                    LastSourceLocation;                                // 0x10(0xc)
	struct Vector_NetQuantize                                    LastTargetLocation;                                // 0x1c(0xc)
};


// Size 0x18
struct ShowNewInviteConfirmationModalEvent
{
public:
	bool                                                         IsSaferSeasInvite;                                 // 0x0(0x1)
	struct FString                                               Message;                                           // 0x8(0x10)
};


// Size 0x80
struct MountpointParams
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x0(0xc)
	class UClass*                                                PreviewTrinketDesc;                                // 0x10(0x8)
	struct Transform                                             MountpointRelativePosition;                        // 0x20(0x30)
	struct Vector                                                InteractionBoxExtent;                              // 0x50(0xc)
	TArray<class Class*>                                         AcceptedMountableTypes;                            // 0x60(0x10)
	float                                                        MaxNudgeAngle;                                     // 0x70(0x4)
};


// Size 0x10
struct RequestClothingChestClothingEntitlementsEvent
{
public:
	struct FString                                               ItemCategory;                                      // 0x0(0x10)
};


// Size 0x10
struct ShovelDigActionStateParams
{
public:
	class CurveFloat*                                            SuccessfulPitchBlendCurve;                         // 0x0(0x8)
	class CurveFloat*                                            DeflectedPitchBlendCurve;                          // 0x8(0x8)
};


// Size 0x28
struct InputMontagePair
{
public:
	class UClass*                                                InputID;                                           // 0x0(0x8)
	char                                                         Variant;                                           // 0x8(0x1)
	class AnimSequenceBase*                                      Into;                                              // 0x10(0x8)
	class AnimSequenceBase*                                      Loop;                                              // 0x18(0x8)
	class AnimSequenceBase*                                      Outof;                                             // 0x20(0x8)
};


// Size 0x10
struct DamageableVulnerabilityPair
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	float                                                        DamageMultiplier;                                  // 0x8(0x4)
};


// Size 0x40
struct IsWieldingItemCategoryCondition
{
public:
	TArray<Class>                                                TargetItemCategories;                              // 0x28(0x10)
	bool                                                         InvalidIfStashed;                                  // 0x38(0x1)
};


// Size 0x20
struct QuestTableDataGeneratedTelemetryEvent
{
public:
	bool                                                         NewPlayer;                                         // 0x0(0x1)
	int                                                          NumDiscoverTabTiles;                               // 0x4(0x4)
	TArray<String>                                               DiscoverTabTileIds;                                // 0x8(0x10)
	bool                                                         ShipHasLootOnboard;                                // 0x18(0x1)
};


// Size 0x1
struct EnableDefaultStormsGameServerRequestModel
{
public:
	bool                                                         Enable;                                            // 0x0(0x1)
};


// Size 0x10
struct PlayerBuriedItemServiceCrewMapsChangedEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x18
struct ClientBootFlowSelectUserSucceededTelemetryEvent
{
public:
	struct FString                                               NativeUserId;                                      // 0x0(0x10)
	bool                                                         WasUiShown;                                        // 0x10(0x1)
};


// Size 0x4
struct GraphicalSettingsTelemetryEvent
{
public:
	uint32                                                       AutoDetectBucket;                                  // 0x0(0x4)
};


// Size 0x18
struct FeatureToggledFogBankManagerAsset
{
public:
	struct FeatureFlag                                           FeatureToggle;                                     // 0x0(0xc)
	class FogBankManagerDataAsset*                               Asset;                                             // 0x10(0x8)
};


// Size 0x28
struct VoyageProposalLostVotingSessionTelemetryEvent
{
public:
	struct Guid                                                  VoyageProposalSessionId;                           // 0x0(0x10)
	struct FString                                               VoyageProposalEntitlementId;                       // 0x10(0x10)
	int                                                          NumberOfVotes;                                     // 0x20(0x4)
};


// Size 0x38
struct CargoDeliveredTelemetryEvent
{
public:
	bool                                                         GoldAwarded;                                       // 0x0(0x1)
	struct Guid                                                  BootyId;                                           // 0x4(0x10)
	char                                                         BootyType;                                         // 0x14(0x1)
	struct FString                                               Rarity;                                            // 0x18(0x10)
	int                                                          MaxQuality;                                        // 0x28(0x4)
	int                                                          DeliveredQuality;                                  // 0x2c(0x4)
	bool                                                         DeliveredOnTime;                                   // 0x30(0x1)
};


// Size 0x40
struct TreasureSoldTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	char                                                         BootyType;                                         // 0x10(0x1)
	struct FString                                               Rarity;                                            // 0x18(0x10)
	bool                                                         GoldAwarded;                                       // 0x28(0x1)
	char                                                         Source;                                            // 0x29(0x1)
	struct FString                                               TreasurePurchaser;                                 // 0x30(0x10)
};


// Size 0xa8
struct AthenaAnimationEmoteAnimations
{
public:
	struct FName                                                 EmoteName;                                         // 0x0(0x8)
	char                                                         EmoteSequenceType;                                 // 0x8(0x1)
	assetobject                                                  OneShotSequence;                                   // 0x10(0x20)
	assetobject                                                  ContinuousIn;                                      // 0x30(0x20)
	TArray<Class>                                                ContinuousCycle;                                   // 0x50(0x10)
	assetobject                                                  ContinuousLocomotion;                              // 0x60(0x20)
	assetobject                                                  EmotePreviewSequence;                              // 0x80(0x20)
	class UClass*                                                UseWithObject;                                     // 0xa0(0x8)
};


// Size 0x10
struct PLSectionBundleEntry
{
public:
	class PirateLegendSection*                                   Section;                                           // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
};


// Size 0x30
struct PlayerNameData
{
public:
	struct FString                                               PlayerId;                                          // 0x0(0x10)
	struct FString                                               PlayerName;                                        // 0x10(0x10)
	struct FString                                               UGCCheckUserId;                                    // 0x20(0x10)
};


// Size 0x1
struct GetActorsInRadiusGameServerResponseModel
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
};


// Size 0x38
struct ShipPartChangedEvent
{
public:
	struct FString                                               PartId;                                            // 0x18(0x10)
	struct FString                                               EntitlementId;                                     // 0x28(0x10)
};


// Size 0x10
struct CompanyConditionalStatsTriggerType
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	class UClass*                                                ConditionalStatsTriggerType;                       // 0x8(0x8)
};


// Size 0x30
struct PlayerDefeatedReapersTributeShipBoxedRpc
{
public:
	struct Guid                                                  ControllingCrewId;                                 // 0x18(0x10)
	class Actor*                                                 ReapersTributeShip;                                // 0x28(0x8)
};


// Size 0x30
struct ServerContestScoreUpdateTelemetryEvent
{
public:
	char                                                         ReasonForScoreChange;                              // 0x0(0x1)
	int                                                          CurrentCrewScore;                                  // 0x4(0x4)
	int                                                          ScoreChangeAmount;                                 // 0x8(0x4)
	struct FString                                               ScoreContext;                                      // 0x10(0x10)
	struct Guid                                                  InstigatorId;                                      // 0x20(0x10)
};


// Size 0x60
struct NPCDialogHeaderByConditionText
{
public:
	struct FText                                                 Text;                                              // 0x0(0x38)
	class UClass*                                                InteractResponse;                                  // 0x38(0x8)
	class WwiseEvent*                                            InteractionAudioEvent;                             // 0x40(0x8)
	class UClass*                                                InteractParticipantType;                           // 0x48(0x8)
	TArray<class NPCDialogConditional*>                          Conditions;                                        // 0x50(0x10)
};


// Size 0x8
struct ChestOnWatercraftEvent
{
public:
	class Actor*                                                 CurrentWatercraft;                                 // 0x0(0x8)
};


// Size 0x20
struct ReplyToGuildInviteErrorEvent
{
public:
	struct FString                                               GuildId;                                           // 0x0(0x10)
	struct FString                                               ErrorId;                                           // 0x10(0x10)
};


// Size 0x18
struct PuzzleVaultCompletedTelemetryEvent
{
public:
	struct Guid                                                  VaultId;                                           // 0x0(0x10)
	struct FName                                                 VaultType;                                         // 0x10(0x8)
};


// Size 0xc
struct SeaFortAlignmentChangedTelemetryEvent
{
public:
	char                                                         PreviousAlignment;                                 // 0x0(0x1)
	char                                                         NewAlignment;                                      // 0x1(0x1)
	struct FName                                                 IslandName;                                        // 0x4(0x8)
};


// Size 0x14
struct EventOnCrewStorageUpdate
{
public:
	struct Guid                                                  CrewStoring;                                       // 0x0(0x10)
	int16                                                        IslandHash;                                        // 0x10(0x2)
};


// Size 0x48
struct ProjectileHitScanPerWeaponMeshPairings
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	class StaticMesh*                                            TrailsMeshHitScan;                                 // 0x8(0x8)
	class MaterialInterface*                                     MaterialHitScan;                                   // 0x10(0x8)
	int                                                          MaxTrails;                                         // 0x18(0x4)
};


// Size 0x20
struct PetLoadoutItem
{
public:
	class UClass*                                                PetEntitlementDesc;                                // 0x0(0x8)
	class UClass*                                                PetCustomizationDesc;                              // 0x8(0x8)
	struct FString                                               PetName;                                           // 0x10(0x10)
};


// Size 0x8
struct NotificationStickiness
{
public:
	char                                                         Type;                                              // 0x0(0x1)
	uint32                                                       StickDurationMs;                                   // 0x4(0x4)
};


// Size 0x18
struct RequestPetChestPreviewUpdateEvent
{
public:
	char                                                         Action;                                            // 0x0(0x1)
	struct FString                                               Subject;                                           // 0x8(0x10)
};


// Size 0x28
struct TextureGroupMemorySummary
{
public:
	struct FString                                               TextureGroupName;                                  // 0x0(0x10)
	uint64                                                       MemMax;                                            // 0x10(0x8)
	uint64                                                       MemMin;                                            // 0x18(0x8)
	uint64                                                       MemAvg;                                            // 0x20(0x8)
};


// Size 0x50
struct GuildBrandingModel
{
public:
	struct FString                                               GuildName;                                         // 0x0(0x10)
	struct FString                                               Icon;                                              // 0x10(0x10)
	struct FString                                               ColourSwatch;                                      // 0x20(0x10)
	struct FString                                               Theme;                                             // 0x30(0x10)
	struct FString                                               Motto;                                             // 0x40(0x10)
};


// Size 0x28
struct ShipIdentity
{
public:
	struct FString                                               UnscrambledShipName;                               // 0x0(0x10)
	int                                                          ScrambledShipNameIndex;                            // 0x10(0x4)
	struct FString                                               ClientShipName;                                    // 0x18(0x10)
};


// Size 0x80
struct ScrambledIdentity
{
public:
	struct Guid                                                  EntityId;                                          // 0x0(0x10)
	struct FString                                               UnscrambledName;                                   // 0x10(0x10)
	struct UniqueNetIdRepl                                       OwnersUserId;                                      // 0x20(0x18)
	struct FText                                                 ScrambledName;                                     // 0x38(0x38)
	struct FString                                               ClientName;                                        // 0x70(0x10)
};


// Size 0x18
struct BellDesc
{
public:
	class StaticMesh*                                            BellMesh;                                          // 0x0(0x8)
	class WwiseEvent*                                            BellRingSFX;                                       // 0x8(0x8)
	class WwiseEvent*                                            BellRingTurbulenceSFX;                             // 0x10(0x8)
};


// Size 0x8
struct ItemLoadoutItemAddedEvent
{
public:
	class ItemInfo*                                              Item;                                              // 0x0(0x8)
};


// Size 0x28
struct FeaturedEntitlements
{
public:
	struct FName                                                 Feature;                                           // 0x0(0x8)
	struct StringAssetReference                                  EntitlementsAsset;                                 // 0x8(0x10)
	struct StringAssetReference                                  SupplementalEntitlementMap;                        // 0x18(0x10)
};


// Size 0x40
struct ClientNPCDialogBeganTelemetryEvent
{
public:
	struct Guid                                                  NPCInteractionSessionId;                           // 0x0(0x10)
	struct FString                                               NPCDialogTreeDataAsset;                            // 0x10(0x10)
	struct FString                                               NPCInteracted;                                     // 0x20(0x10)
	struct FString                                               NPCInteractedType;                                 // 0x30(0x10)
};


// Size 0x8
struct WalletBalanceItem
{
public:
	char                                                         CurrencyId;                                        // 0x0(0x1)
	uint32                                                       Balance;                                           // 0x4(0x4)
};


// Size 0x10
struct EventWieldableItemSetIsWielded
{
public:
	class Actor*                                                 Wielder;                                           // 0x0(0x8)
	bool                                                         bIsWielded;                                        // 0x8(0x1)
	bool                                                         bGettingDropped;                                   // 0x9(0x1)
	bool                                                         bIsUnstashing;                                     // 0xa(0x1)
};


// Size 0x10
struct InventoryManipulatorAutoEquipPolicyEntry
{
public:
	class UClass*                                                Category;                                          // 0x0(0x8)
	char                                                         Policy;                                            // 0x8(0x1)
};


// Size 0x18
struct PlayerBuriedItemServiceMapTakenFromTavernBoardEvent
{
public:
	struct FString                                               PlayerName;                                        // 0x0(0x10)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x10(0x8)
};


// Size 0x10
struct RequestPetChestPetEntitlementsEvent
{
public:
	struct FString                                               ItemCategory;                                      // 0x0(0x10)
};


// Size 0x18
struct CompanyRankGradeData
{
public:
	class UClass*                                                Rank;                                              // 0x0(0x8)
	struct StringAssetReference                                  Ribbon;                                            // 0x8(0x10)
};


// Size 0x30
struct CarouselPirateDesc
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
	char                                                         Gender;                                            // 0x4(0x1)
	char                                                         Ethnicity;                                         // 0x5(0x1)
	float                                                        Age;                                               // 0x8(0x4)
	struct RadialCoordinate                                      BodyShape;                                         // 0xc(0x8)
	float                                                        Dirtiness;                                         // 0x14(0x4)
	float                                                        Wonkiness;                                         // 0x18(0x4)
	TArray<class Class*>                                         Outfit;                                            // 0x20(0x10)
};


// Size 0x8
struct WheelSnapshot
{
public:
	float                                                        Angle;                                             // 0x0(0x4)
	float                                                        MaxAngle;                                          // 0x4(0x4)
};


// Size 0x14
struct ReapersMarkLevelChanged
{
public:
	int                                                          NewLevel;                                          // 0x0(0x4)
	struct Guid                                                  AssociatedCrew;                                    // 0x4(0x10)
};


// Size 0x18
struct WieldableBookPageReference
{
public:
	struct StringAssetReference                                  PageReference;                                     // 0x0(0x10)
	char                                                         NumberOfPages;                                     // 0x10(0x1)
};


// Size 0x10
struct OnStartSlidingOnWalkwayEvent
{
public:
	class WwiseEvent*                                            WalkwaySlideLoopStart;                             // 0x0(0x8)
	class WwiseEvent*                                            WalkwayLoopEnd;                                    // 0x8(0x8)
};


// Size 0x20
struct MountedWeaponFireRejectionRpc
{
public:
	class Object*                                                MountedWeaponObject;                               // 0x18(0x8)
};


// Size 0x48
struct AthenaAnimationFootPlanting
{
public:
	struct CollisionResponseContainer                            OverrideRaycast;                                   // 0x8(0x20)
	float                                                        HipHeight;                                         // 0x28(0x4)
	float                                                        HipPullStrength;                                   // 0x2c(0x4)
	float                                                        DownDistance;                                      // 0x30(0x4)
	float                                                        DownDistanceRangeStart;                            // 0x34(0x4)
	float                                                        DownDistanceRangeEnd;                              // 0x38(0x4)
	float                                                        IKLegStretch;                                      // 0x3c(0x4)
	float                                                        SlopeAngle;                                        // 0x40(0x4)
	bool                                                         Active;                                            // 0x44(0x1)
	bool                                                         FeetContact;                                       // 0x45(0x1)
};


// Size 0x1
struct PlayerRequiresMermaidTelemetryEvent
{
public:
	char                                                         Reason;                                            // 0x0(0x1)
};


// Size 0x18
struct AnimatedMechanismActionState
{
public:
	int                                                          AnimationId;                                       // 0x0(0x4)
	double                                                       StartTime;                                         // 0x8(0x8)
	double                                                       EndTime;                                           // 0x10(0x8)
};


// Size 0x20
struct MatineeActorStopNetworkEvent
{
public:
	class MatineeActor*                                          MatineeActor;                                      // 0x18(0x8)
};


// Size 0x18
struct EventTransferObjectState
{
public:
	interface                                                    Target;                                            // 0x0(0x10)
	class Actor*                                                 TargetActor;                                       // 0x10(0x8)
};


// Size 0x10
struct RadialInputBindings
{
public:
	class UClass*                                                GamepadActivatedId;                                // 0x0(0x8)
	class UClass*                                                GamepadDectivatedId;                               // 0x8(0x8)
};


// Size 0x8
struct EventCannonFiredOnServer
{
public:
	class Cannon*                                                Cannon;                                            // 0x0(0x8)
};


// Size 0x8
struct KrakenSpawnLocationParams
{
public:
	float                                                        KrakenRadius;                                      // 0x0(0x4)
	float                                                        MinDistanceFromExistingLocations;                  // 0x4(0x4)
};


// Size 0x90
struct WeaponProjectilePendingImpact
{
public:
	double                                                       TimeStamp;                                         // 0x0(0x8)
	struct HitResult                                             HitResult;                                         // 0x8(0x80)
	bool                                                         RequiresValidation;                                // 0x88(0x1)
	bool                                                         AwaitingValidation;                                // 0x89(0x1)
	float                                                        ProjectileTimeAlive;                               // 0x8c(0x4)
};


// Size 0x14
struct EventHandInMegalodonSoul
{
public:
	char                                                         SoulType;                                          // 0x0(0x1)
	struct Guid                                                  CrewId;                                            // 0x4(0x10)
};


// Size 0x38
struct SkeletonCustomAnimationBlueprintPlayingAnimations
{
public:
	class AnimSequence*                                          OneShot;                                           // 0x0(0x8)
	class AnimSequence*                                          ContinuousIn;                                      // 0x8(0x8)
	class AnimSequence*                                          ContinuousLoop_A;                                  // 0x10(0x8)
	class AnimSequence*                                          ContinuousLoop_B;                                  // 0x18(0x8)
	class AnimSequence*                                          ContinuousOut;                                     // 0x20(0x8)
	TArray<class AnimSequence*>                                  AlternateContinuousOuts;                           // 0x28(0x10)
};


// Size 0x28
struct PlayLandmarkReactionRPC
{
public:
	class Landmark*                                              Landmark;                                          // 0x18(0x8)
	int                                                          LandmarkReactionIndex;                             // 0x20(0x4)
};


// Size 0x30
struct SpawnerCreatedAutomationEvent
{
public:
	class Actor*                                                 SpawnerLocation;                                   // 0x0(0x8)
	class AISpawner*                                             Spawner;                                           // 0x28(0x8)
};


// Size 0x18
struct ShipNameChangedOnServerEvent
{
public:
	struct FString                                               ShipName;                                          // 0x0(0x10)
	int                                                          ScrambledShipNameIndex;                            // 0x10(0x4)
};


// Size 0x50
struct MaskPostProcessParams
{
public:
	class MaterialInterface*                                     MaterialParent;                                    // 0x0(0x8)
	class Texture2D*                                             LensMaskOverride;                                  // 0x8(0x8)
	struct LinearColor                                           LensTint;                                          // 0x10(0x10)
	class CurveFloat*                                            BlurCurve;                                         // 0x20(0x8)
	float                                                        BlurInDuration;                                    // 0x28(0x4)
	float                                                        BlurOutDuration;                                   // 0x2c(0x4)
	float                                                        SecondsUntilPostStarts;                            // 0x30(0x4)
	class MaterialInstanceDynamic*                               DynamicMaterialInstance;                           // 0x40(0x8)
};


// Size 0x10
struct AggressiveGhostShipDroppedMineTelemetryEvent
{
public:
	struct Guid                                                  ShipId;                                            // 0x0(0x10)
};


// Size 0x4
struct BlueprintableIntegerHandle
{
public:
	int                                                          Handle;                                            // 0x0(0x4)
};


// Size 0x78
struct TunnelOfTheDamnedInstance
{
public:
	class UClass*                                                CurrentTunnelArtStyle;                             // 0x0(0x8)
	map                                                          AvailableTunnelArtStyles;                          // 0x8(0x50)
	interface                                                    ActiveInstance;                                    // 0x68(0x10)
};


// Size 0x14
struct CrewCompletedEmergentVoyageEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x10(0x1)
};


// Size 0x10
struct WorldSnapshot
{
public:
	struct FName                                                 Version;                                           // 0x8(0x8)
};


// Size 0x10
struct GuildNameChangedEvent
{
public:
	struct FString                                               GuildName;                                         // 0x0(0x10)
};


// Size 0x10
struct LandmarkReactionKeyFrame
{
public:
	class LandmarkReactionEvent*                                 Event;                                             // 0x0(0x8)
	float                                                        KeyFrame;                                          // 0x8(0x4)
};


// Size 0x98
struct VoyageChestDiscoveredInContest
{
public:
	struct FString                                               DiscovererName;                                    // 0x18(0x10)
	bool                                                         IsDiscovererMe;                                    // 0x28(0x1)
	bool                                                         PlayAudio;                                         // 0x29(0x1)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x30(0x8)
	struct FText                                                 CrewName;                                          // 0x38(0x38)
	struct StringAssetReference                                  ToastBackgroundImage;                              // 0x70(0x10)
	struct StringAssetReference                                  BackgroundImage;                                   // 0x80(0x10)
	struct FName                                                 AudioEventName;                                    // 0x90(0x8)
};


// Size 0x18
struct ProjectileWeaponFireInaccuracySeedMismatchTelemetryEvent
{
public:
	struct Guid                                                  TelemetryAttackId;                                 // 0x0(0x10)
	int                                                          ClientSeed;                                        // 0x10(0x4)
	int                                                          ServerSeed;                                        // 0x14(0x4)
};


// Size 0x8
struct AchievementSailFullyWithTheWind
{
public:
	float                                                        DistanceToTravelInMetres;                          // 0x0(0x4)
};


// Size 0x8
struct EventResetSettingsGroup
{
public:
	struct FName                                                 SettingsGroupNameToReset;                          // 0x0(0x8)
};


// Size 0x20
struct WheelArmIKDownWithinRange
{
public:
	float                                                        LeftArmDownRangeAMin;                              // 0x0(0x4)
	float                                                        LeftArmDownRangeAMax;                              // 0x4(0x4)
	float                                                        LeftArmDownRangeBMin;                              // 0x8(0x4)
	float                                                        LeftArmDownRangeBMax;                              // 0xc(0x4)
	float                                                        RightArmDownRangeAMin;                             // 0x10(0x4)
	float                                                        RightArmDownRangeAMax;                             // 0x14(0x4)
	float                                                        RightArmDownRangeBMin;                             // 0x18(0x4)
	float                                                        RightArmDownRangeBMax;                             // 0x1c(0x4)
};


// Size 0x28
struct GuildChroniclesPirateId
{
public:
	struct UniqueNetIdRepl                                       UserId;                                            // 0x0(0x18)
	struct Guid                                                  PirateId;                                          // 0x18(0x10)
};


// Size 0x8
struct ThrowingKnifeProxySpawnEvent
{
public:
	class ItemProxy*                                             Proxy;                                             // 0x0(0x8)
};


// Size 0x10
struct StorageContainerWeightedItemListEntry
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	class UClass*                                                ItemDesc;                                          // 0x8(0x8)
};


// Size 0x58
struct CappedItemsByGroup
{
public:
	map                                                          ItemGroupMapping;                                  // 0x0(0x50)
};


// Size 0x10
struct PlayerNameOverrideTelemetryEvent
{
public:
	struct FString                                               PlayerNameOverride;                                // 0x0(0x10)
};


// Size 0x10
struct AggressiveGhostShipImpactDamage
{
public:
	class UClass*                                                ImpactProjectileId;                                // 0x0(0x8)
	float                                                        Damage;                                            // 0x8(0x4)
};


// Size 0x28
struct SeaFortKeyPickedUpNetworkEvent
{
public:
	class PopUpMessageDesc*                                      KeyDiscoveredPopUpDesc;                            // 0x18(0x8)
	class PopUpMessageDesc*                                      KeyHandInHintPopUpDesc;                            // 0x20(0x8)
};


// Size 0xf0
struct LPVAdaptationState
{
public:
	struct Transform                                             InitialTransform;                                  // 0x0(0x30)
	struct Transform                                             DestinationTransform;                              // 0x30(0x30)
	struct Transform                                             CurrentTransform;                                  // 0x60(0x30)
	struct Transform                                             SavedOffShipTransform;                             // 0x90(0x30)
	float                                                        BlendWeight;                                       // 0xc0(0x4)
	float                                                        BlendTime;                                         // 0xc4(0x4)
	float                                                        BlendTranslationTime;                              // 0xc8(0x4)
	float                                                        AdditionalAdaptationTime;                          // 0xcc(0x4)
	float                                                        DefaultRotationBlendTime;                          // 0xd0(0x4)
	float                                                        DefaultTranslationBlendTime;                       // 0xd4(0x4)
	float                                                        DefaultAdditionalBlendTime;                        // 0xd8(0x4)
	char                                                         DefaultAdaptationType;                             // 0xdc(0x1)
	char                                                         AdaptationType;                                    // 0xdd(0x1)
	bool                                                         bIsPlayerInLPVRefFrameArea;                        // 0xe0(0x1)
	bool                                                         bIsLPVAdapting;                                    // 0xe0(0x1)
	bool                                                         bAdaptRotationOnly;                                // 0xe0(0x1)
	bool                                                         bUseInstanceDefaultValues;                         // 0xe0(0x1)
};


// Size 0x1
struct LocalGameChatStatusEvent
{
public:
	char                                                         Status;                                            // 0x0(0x1)
};


// Size 0x8
struct GuildNumberOfShipsChangedEvent
{
public:
	int                                                          OldNumberOfShips;                                  // 0x0(0x4)
	int                                                          CurrentNumberOfShips;                              // 0x4(0x4)
};


// Size 0xc
struct StandardSailDynamicsParameters
{
public:
	float                                                        ForceGeneratedByWindSpeedPerMPS;                   // 0x0(0x4)
	float                                                        AirDragPerSailPerMPS;                              // 0x4(0x4)
	float                                                        PowerRatioOfSailForwardForceToFullForce;           // 0x8(0x4)
};


// Size 0x38
struct AggressiveGhostShipSplineDataVariables
{
public:
	double                                                       StartTime;                                         // 0x0(0x8)
	double                                                       StartTimeOffset;                                   // 0x8(0x8)
	TArray<float>                                                SplineOffsets;                                     // 0x10(0x10)
	struct Vector                                                CentrePoint;                                       // 0x20(0xc)
	float                                                        StartAngleOffset;                                  // 0x2c(0x4)
	bool                                                         ReverseDirection;                                  // 0x30(0x1)
};


// Size 0x18
struct BootyItemDroppedOnShipEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	class ItemInfo*                                              ItemOnShip;                                        // 0x8(0x8)
	bool                                                         FirstTimeDroppedOnOwnOrAnotherShipByCrew;          // 0x10(0x1)
	bool                                                         FirstTimeDroppedOnShipByAnyCrew;                   // 0x11(0x1)
};


// Size 0x18
struct ShipCameraAnimation
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	class CameraAnim*                                            Animation;                                         // 0x8(0x8)
	class CurveFloat*                                            BlendCurve;                                        // 0x10(0x8)
};


// Size 0x18
struct UIPremiumStoreOpenEvent
{
public:
	bool                                                         IsFrontend;                                        // 0x0(0x1)
	struct FString                                               SessionId;                                         // 0x8(0x10)
};


// Size 0x48
struct ShipDamagedTelemetryEvent
{
public:
	struct FString                                               DamageType;                                        // 0x0(0x10)
	struct Vector                                                DamageLocation;                                    // 0x10(0xc)
	struct FString                                               DamagedShipPart;                                   // 0x20(0x10)
	int                                                          DamageLevel;                                       // 0x30(0x4)
	struct Guid                                                  AttackId;                                          // 0x34(0x10)
};


// Size 0xa0
struct Crew
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct Guid                                                  SessionId;                                         // 0x10(0x10)
	TArray<class PlayerState*>                                   Players;                                           // 0x20(0x10)
	struct CrewSessionTemplate                                   CrewSessionTemplate;                               // 0x30(0x38)
	struct Guid                                                  LiveryID;                                          // 0x68(0x10)
	TArray<class Actor*>                                         AssociatedActors;                                  // 0x80(0x10)
	bool                                                         HasEverSetSail;                                    // 0x90(0x1)
	bool                                                         RequiresDiveOnceShipHasSpawned;                    // 0x91(0x1)
	bool                                                         CrewDivingToWorldEvent;                            // 0x92(0x1)
	int                                                          ScrambleNameIndex;                                 // 0x94(0x4)
	struct GenericTeamId                                         TeamID;                                            // 0x98(0x1)
};


// Size 0x8
struct ShipTemplate
{
public:
	class UClass*                                                ShipSizeObject;                                    // 0x0(0x8)
};


// Size 0x38
struct PS5AchievementsUpdatedFromServicesTelemetry
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct FString                                               PirateId;                                          // 0x10(0x10)
	struct FString                                               PsnId;                                             // 0x20(0x10)
	bool                                                         Success;                                           // 0x30(0x1)
	int                                                          AchievementsUpdatedCount;                          // 0x34(0x4)
};


// Size 0x60
struct WorldMapIslandData
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	struct FString                                               IslandUrl;                                         // 0x38(0x10)
	float                                                        MinX;                                              // 0x48(0x4)
	float                                                        MinY;                                              // 0x4c(0x4)
	float                                                        MaxX;                                              // 0x50(0x4)
	float                                                        MaxY;                                              // 0x54(0x4)
	float                                                        Rotation;                                          // 0x58(0x4)
	float                                                        LabelOffset;                                       // 0x5c(0x4)
};


// Size 0x1
struct SchedulesRefreshRequestedTelemetryEvent
{
public:
	bool                                                         IsForcedRefresh;                                   // 0x0(0x1)
};


// Size 0x130
struct BowSplashProbe
{
public:
	char                                                         ShipAlignmentType;                                 // 0x128(0x1)
};


// Size 0x10
struct RequestShipCustomizationChestEquipShipCustomizationEvent
{
public:
	struct FString                                               ItemDesc;                                          // 0x0(0x10)
};


// Size 0x8
struct EventGhostShipReleaseIndefiniteDoorLock
{
public:
	class Object*                                                Owner;                                             // 0x0(0x8)
};


// Size 0x40
struct AthenaStreamedLevelItem
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	class AthenaStreamedLevelDataAsset*                          DataAsset;                                         // 0x10(0x8)
	struct FeatureFlag                                           FeatureFlag;                                       // 0x18(0xc)
	struct FString                                               UniqueId;                                          // 0x28(0x10)
	bool                                                         ShouldBeVisibleOnLoad;                             // 0x38(0x1)
	bool                                                         ClientOnlyVisible;                                 // 0x39(0x1)
};


// Size 0xf8
struct TakeFlameOfFateParams
{
public:
	bool                                                         IncludeTakeFlameOfFateActionRule;                  // 0x0(0x1)
	class UClass*                                                ActionRuleNotificationInputId;                     // 0x8(0x8)
	char                                                         ActionRulePriority;                                // 0x10(0x1)
	struct FText                                                 TakeFlameOfFateTooltipText;                        // 0x18(0x38)
	struct FText                                                 LanternNotRaisedToolTipText;                       // 0x50(0x38)
	struct FText                                                 NotWieldingFlameTooltipText;                       // 0x88(0x38)
	struct FText                                                 CannotSetFlameTooltipText;                         // 0xc0(0x38)
};


// Size 0x40
struct ProjectileHitTelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	struct FString                                               ProjectileId;                                      // 0x10(0x10)
	struct FString                                               HitObjectId;                                       // 0x20(0x10)
	struct FString                                               HitObjectType;                                     // 0x30(0x10)
};


// Size 0x20
struct PlayerGeneratedMapsContainerUnregisterServerEventsRpc
{
public:
	class Object*                                                InPlayerGeneratedMapsContainerOwnerObject;         // 0x18(0x8)
};


// Size 0x1
struct SignOutButtonVisibilityEvent
{
public:
	bool                                                         IsVisible;                                         // 0x0(0x1)
};


// Size 0x28
struct HitDetectionParamsOverride
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x0(0xc)
	float                                                        HitStartRange;                                     // 0xc(0x4)
	float                                                        HitEndRange;                                       // 0x10(0x4)
	float                                                        HitStartAngle;                                     // 0x14(0x4)
	float                                                        HitAngleDelta;                                     // 0x18(0x4)
	float                                                        HitSphereRadius;                                   // 0x1c(0x4)
	float                                                        HitTimeOffset;                                     // 0x20(0x4)
	float                                                        HitDuration;                                       // 0x24(0x4)
};


// Size 0x10
struct EventAIEmoteActionAnimationChange
{
public:
	char                                                         ActiveEmoteActionState;                            // 0x0(0x1)
	class AthenaCharacter*                                       Owner;                                             // 0x8(0x8)
};


// Size 0x20
struct UIMessageOfTheDayOpenEvent
{
public:
	struct FString                                               SessionId;                                         // 0x0(0x10)
	struct FString                                               MessageId;                                         // 0x10(0x10)
};


// Size 0x10
struct ShipLoadoutRequestShipPartsModel
{
public:
	TArray<struct Guid>                                          ShipIds;                                           // 0x0(0x10)
};


// Size 0x14
struct VaultReserved
{
public:
	bool                                                         IsReserved;                                        // 0x0(0x1)
	struct Guid                                                  CrewId;                                            // 0x4(0x10)
};


// Size 0x1
struct OnRestoreShopStateChangedEvent
{
public:
	bool                                                         CanRestore;                                        // 0x0(0x1)
};


// Size 0x40
struct WieldableBookNamedWidgetTexture
{
public:
	struct FName                                                 ImageKey;                                          // 0x30(0x8)
	char                                                         WidgetVisibilityGroup;                             // 0x38(0x1)
};


// Size 0x1c
struct FortDespawnTelemetryEvent
{
public:
	struct Guid                                                  FortId;                                            // 0x0(0x10)
	char                                                         DestructionReason;                                 // 0x10(0x1)
	struct FName                                                 FortType;                                          // 0x14(0x8)
};


// Size 0x40
struct PlayerJoinCrewInProgressRequestMessage
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct UniqueNetIdRepl                                       UserId;                                            // 0x10(0x18)
	struct FString                                               PirateId;                                          // 0x28(0x10)
	char                                                         SessionType;                                       // 0x38(0x1)
};


// Size 0x98
struct CreateBlowpipeDartProxyRpc
{
public:
	struct HitResult                                             HitResult;                                         // 0x18(0x80)
};


// Size 0x50
struct CoastObject
{
public:
	class SplineComponent*                                       CoastSplineInternal;                               // 0x0(0x8)
	class SplineComponent*                                       InnerSplineInternal;                               // 0x8(0x8)
	struct Vector                                                SplineOrigin;                                      // 0x10(0xc)
	float                                                        CoastalLookupSquaredDistance;                      // 0x1c(0x4)
};


// Size 0x10
struct MaterialInformationTranslationData
{
public:
	struct FName                                                 AudioSurfaceType;                                  // 0x0(0x8)
	struct FName                                                 VFXSurfaceType;                                    // 0x8(0x8)
};


// Size 0x10
struct RequestShowGamerCard
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
};


// Size 0x30
struct CannonDesc
{
public:
	struct StringAssetReference                                  CannonBarrelMesh;                                  // 0x0(0x10)
	int64                                                        CannonBarrelCachedMeshResourceSize;                // 0x10(0x8)
	struct StringAssetReference                                  CannonBoxMesh;                                     // 0x18(0x10)
	int64                                                        CannonBoxCachedMeshResourceSize;                   // 0x28(0x8)
};


// Size 0xd0
struct StormScalingParameters
{
public:
	struct FName                                                 MaterialMaskPropertyName;                          // 0x0(0x8)
	struct FName                                                 RainOpacityPropertyName;                           // 0x8(0x8)
	class CurveFloat*                                            RadiusCurve;                                       // 0x10(0x8)
	class CurveFloat*                                            OuterRadiusCurve;                                  // 0x18(0x8)
	class CurveFloat*                                            RainSheetOuterOpacityCurve;                        // 0x20(0x8)
	class CurveFloat*                                            RainSheetInnerOpacityCurve;                        // 0x28(0x8)
	class CurveFloat*                                            BaseCloudHeightCurve;                              // 0x30(0x8)
	class CurveFloat*                                            BaseCloudMaskCurve;                                // 0x38(0x8)
	class CurveFloat*                                            RingCloudHeightCurve;                              // 0x40(0x8)
	class CurveFloat*                                            RingCloudMaskCurve;                                // 0x48(0x8)
	class CurveFloat*                                            TopCloudHeightCurve;                               // 0x50(0x8)
	class CurveFloat*                                            TopCloudMaskCurve;                                 // 0x58(0x8)
	class CurveFloat*                                            PressureZoneRadiusCurve;                           // 0x60(0x8)
	class CurveFloat*                                            PressureZoneTargetCurve;                           // 0x68(0x8)
	class CurveFloat*                                            PressureZonePushCurve;                             // 0x70(0x8)
	class CurveFloat*                                            PressureZoneWeightCurve;                           // 0x78(0x8)
	class CurveFloat*                                            RainStrengthCurve;                                 // 0x80(0x8)
	class CurveFloat*                                            WindStrengthCurve;                                 // 0x88(0x8)
	class CurveFloat*                                            WindInnerRadiusCurve;                              // 0x90(0x8)
	class CurveFloat*                                            WaterStrengthCurve;                                // 0x98(0x8)
	class CurveLinearColor*                                      RainSheetOuterScaleCurve;                          // 0xa0(0x8)
	class CurveLinearColor*                                      RainSheetInnerScaleCurve;                          // 0xa8(0x8)
	class CurveLinearColor*                                      BaseCloudScaleCurve;                               // 0xb0(0x8)
	class CurveLinearColor*                                      RingCloudScaleCurve;                               // 0xb8(0x8)
	class CurveLinearColor*                                      TopCloudScaleCurve;                                // 0xc0(0x8)
	float                                                        AngryWaterLerpRatio;                               // 0xc8(0x4)
};


// Size 0x20
struct ItemInfoHealthMetaWrapper
{
public:
	float                                                        CurrentHealth;                                     // 0x18(0x4)
	float                                                        MaxHealth;                                         // 0x1c(0x4)
};


// Size 0x10
struct StartPickupObjectActionRuleParams
{
public:
	TArray<char>                                                 WieldableItemSizesDisablePickup;                   // 0x0(0x10)
};


// Size 0x8
struct RenderToTextureTestChangeEvent
{
public:
	class Actor*                                                 Object;                                            // 0x0(0x8)
};


// Size 0x4
struct AchievementKillOpponentFromBehindWithBlunderbuss
{
public:
	float                                                        FacingDirAngleTolerance;                           // 0x0(0x4)
};


// Size 0x40
struct PlayerGeneratedMapDisplayData
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	int                                                          IslandIndex;                                       // 0x10(0x4)
	int                                                          NumXs;                                             // 0x14(0x4)
	int                                                          MapCreatedByPlayerNameOverrideIndex;               // 0x18(0x4)
	struct Guid                                                  MapID;                                             // 0x1c(0x10)
	struct FString                                               MapCreatedByPlayerName;                            // 0x30(0x10)
};


// Size 0x40
struct PlayerNameplateUIInfo
{
public:
	struct FString                                               GamerTag;                                          // 0x0(0x10)
	struct FString                                               Title;                                             // 0x10(0x10)
	char                                                         Attitude;                                          // 0x20(0x1)
	char                                                         ChatState;                                         // 0x21(0x1)
	float                                                        Health;                                            // 0x24(0x4)
	bool                                                         HealthVisible;                                     // 0x28(0x1)
	bool                                                         TitleVisible;                                      // 0x29(0x1)
	struct FString                                               NameplateIconReference;                            // 0x30(0x10)
};


// Size 0x18
struct ItemDiggingAudioOverride
{
public:
	TArray<Class>                                                Classes;                                           // 0x0(0x10)
	class ItemDiggingAudioConfig*                                DiggingAudioConfig;                                // 0x10(0x8)
};


// Size 0x10
struct FishBaitInfo
{
public:
	char                                                         BaitType;                                          // 0x0(0x1)
	class UClass*                                                BaitItemDesc;                                      // 0x8(0x8)
};


// Size 0x8
struct StormStrengthType
{
public:
	float                                                        Strength;                                          // 0x0(0x4)
	float                                                        Chance;                                            // 0x4(0x4)
};


// Size 0x18
struct GuildSender
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct DateTime                                              ExpiryTime;                                        // 0x10(0x8)
};


// Size 0x8
struct EventPlayerEnteredSinkingTunnelActionState
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
	int                                                          Entry;                                             // 0x4(0x4)
};


// Size 0x20
struct InteractionOptionSelectedNonUI
{
public:
	struct FName                                                 EventName;                                         // 0x0(0x8)
	struct Guid                                                  InstigatorCrewID;                                  // 0x8(0x10)
	class Actor*                                                 InteractingPlayer;                                 // 0x18(0x8)
};


// Size 0x18
struct BountyQuestWaveCompletedTelemetryEvent
{
public:
	struct FString                                               LandmarkName;                                      // 0x0(0x10)
	int                                                          BountyWaveIndex;                                   // 0x10(0x4)
	int                                                          TotalBountyWaves;                                  // 0x14(0x4)
};


// Size 0x28
struct RetrieveAllPiratesRequestFailedEvent
{
public:
	struct UniqueNetIdRepl                                       UserId;                                            // 0x0(0x18)
	struct Guid                                                  RequestID;                                         // 0x18(0x10)
};


// Size 0x50
struct GetLinkedPSNIdFromXuidResponseModel
{
public:
	map                                                          Matches;                                           // 0x0(0x50)
};


// Size 0xc0
struct CoordinatedKrakenTentacleSpawnInfo
{
public:
	struct Transform                                             SpawnTransform;                                    // 0x0(0x30)
	struct Transform                                             FinalSpawnTransform;                               // 0x30(0x30)
	int                                                          ClientCapsuleCullCount;                            // 0x60(0x4)
	bool                                                         ShouldDockToTargetActor;                           // 0x64(0x1)
	bool                                                         RequiresBoxCollider;                               // 0x65(0x1)
	bool                                                         RequiresKnockback;                                 // 0x66(0x1)
	struct Vector                                                BoxExtents;                                        // 0x68(0xc)
	struct Transform                                             BoxOffset;                                         // 0x80(0x30)
	class KrakenAnimatedTentacle*                                SpawnedTentacle;                                   // 0xb0(0x8)
};


// Size 0x14
struct WorldMapShipFlags
{
public:
	bool                                                         IsInAlliance;                                      // 0x0(0x1)
	bool                                                         IsOwnedShip;                                       // 0x1(0x1)
	bool                                                         IsReapersTrackedShip;                              // 0x2(0x1)
	char                                                         ReapersMarkLevel;                                  // 0x3(0x1)
	char                                                         EmissaryLevel;                                     // 0x4(0x1)
	bool                                                         IsInFaction;                                       // 0x5(0x1)
	bool                                                         IsMaxFaction;                                      // 0x6(0x1)
	struct FName                                                 FactionName;                                       // 0x8(0x8)
	bool                                                         IsInvadingShip;                                    // 0x10(0x1)
	bool                                                         IsInTunnel;                                        // 0x11(0x1)
	bool                                                         IsMaxGradedGuildShip;                              // 0x12(0x1)
	bool                                                         IsReapersTributeShip;                              // 0x13(0x1)
};


// Size 0x20
struct AthenaAnimationLocomotionStairsAnimData
{
public:
	class BlendSpace*                                            UpStairsLeft;                                      // 0x0(0x8)
	class BlendSpace*                                            UpStairsRight;                                     // 0x8(0x8)
	class BlendSpace*                                            DownStairsLeft;                                    // 0x10(0x8)
	class BlendSpace*                                            DownStairsRight;                                   // 0x18(0x8)
};


// Size 0x10
struct SwitchMechanismTriggerCustomTarget
{
public:
	struct Vector                                                Target;                                            // 0x0(0xc)
	int                                                          LaunchPositionIndex;                               // 0xc(0x4)
};


// Size 0x10
struct DockToObjectActionStateParams
{
public:
	float                                                        DockTime;                                          // 0x0(0x4)
	float                                                        DelayAfterDockingTime;                             // 0x4(0x4)
	float                                                        ForcedFieldOfView;                                 // 0x8(0x4)
	bool                                                         ForceStash;                                        // 0xc(0x1)
};


// Size 0x20
struct EventPlayerLeftIslandVicinity
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	struct FName                                                 IslandName;                                        // 0x10(0x8)
};


// Size 0x54
struct KnockBackInfo
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	float                                                        HorizontalVelocity;                                // 0x8(0x4)
	float                                                        VerticalVelocity;                                  // 0xc(0x4)
	float                                                        MinHorizontalVelocity;                             // 0x10(0x4)
	float                                                        MinVerticalVelocity;                               // 0x14(0x4)
	float                                                        SwimmingVelocity;                                  // 0x18(0x4)
	float                                                        DockedHorizontalVelocity;                          // 0x1c(0x4)
	float                                                        DockedVerticalVelocity;                            // 0x20(0x4)
	bool                                                         UseDockedVelocitiesWhenDocked;                     // 0x24(0x1)
	struct FName                                                 RumbleTag;                                         // 0x28(0x8)
	float                                                        StunDuration;                                      // 0x30(0x4)
	float                                                        AIKnockbackDistance;                               // 0x34(0x4)
	float                                                        AIKnockbackSpeed;                                  // 0x38(0x4)
	float                                                        AIKnockbackAcceleration;                           // 0x3c(0x4)
	char                                                         AIKnockbackStrengthType;                           // 0x40(0x1)
	bool                                                         UseOverrideLaunchDirection;                        // 0x41(0x1)
	struct Vector                                                OverrideLaunchDirectionInWorldSpace;               // 0x44(0xc)
	bool                                                         DisableAirControl;                                 // 0x50(0x1)
};


// Size 0x1
struct ClientInputMatchmakingNotificationResultTelemetryEvent
{
public:
	bool                                                         Accepted;                                          // 0x0(0x1)
};


// Size 0x48
struct MilestoneAlignmentThreshold
{
public:
	struct FText                                                 MilestoneRequirementDescription;                   // 0x0(0x38)
	TArray<class Class*>                                         Entitlements;                                      // 0x38(0x10)
};


// Size 0x18
struct ShipVoyageModel
{
public:
	struct Guid                                                  Id;                                                // 0x0(0x10)
	struct FName                                                 EntitlementId;                                     // 0x10(0x8)
};


// Size 0x2
struct EventFaunaAnimationSnakeInAttackStance
{
public:
	bool                                                         SnakeInAttackStance;                               // 0x0(0x1)
	char                                                         SnakeAttackDirection;                              // 0x1(0x1)
};


// Size 0x38
struct PlayNpcAnimationNetworkEvent
{
public:
	class Actor*                                                 TargetActor;                                       // 0x18(0x8)
	struct FName                                                 AnimationNameToPlay;                               // 0x20(0x8)
	class UClass*                                                LocalMusicZone;                                    // 0x28(0x8)
	class PlaceableReaction*                                     PlaceableReaction;                                 // 0x30(0x8)
};


// Size 0xc
struct SetTotalItemsOnRadialInventorySlot
{
public:
	int                                                          SlotIndex;                                         // 0x0(0x4)
	int                                                          TotalItems;                                        // 0x4(0x4)
	int                                                          Capacity;                                          // 0x8(0x4)
};


// Size 0x10
struct GuaranteedStorageContainerContentSpawnerEntry
{
public:
	class UClass*                                                ItemDesc;                                          // 0x0(0x8)
	int                                                          AmountToStock;                                     // 0x8(0x4)
};


// Size 0x40
struct ScrambledIdentityServer
{
public:
	char                                                         IdentityType;                                      // 0x0(0x1)
	struct Guid                                                  EntityId;                                          // 0x4(0x10)
	struct FString                                               UnscrambledName;                                   // 0x18(0x10)
	struct UniqueNetIdRepl                                       OwnersUserId;                                      // 0x28(0x18)
};


// Size 0x10
struct CargoRunQuestDescCollectCargoText
{
public:
	TArray<struct Text>                                          ItemText;                                          // 0x0(0x10)
};


// Size 0x10
struct IncomingFriendRequestReceivedEvent
{
public:
	struct FString                                               GamerTag;                                          // 0x0(0x10)
};


// Size 0x8
struct EventItemTransmuted
{
public:
	class ItemInfo*                                              NewItem;                                           // 0x0(0x8)
};


// Size 0x10
struct MermaidActivatedLocally
{
public:
	class Mermaid*                                               Mermaid;                                           // 0x0(0x8)
	bool                                                         IsForLocalPlayer;                                  // 0x8(0x1)
};


// Size 0x8
struct EventAreaNowHasPlayers
{
public:
	struct FName                                                 AreaName;                                          // 0x0(0x8)
};


// Size 0x18
struct UIQuestTableCloseTelemetryEvent
{
public:
	float                                                        TotalTimeInQuestTable;                             // 0x0(0x4)
	struct FString                                               SessionId;                                         // 0x8(0x10)
};


// Size 0xc
struct SingleStickMappingUserSettingsBoolean
{
public:
	struct FName                                                 SettingName;                                       // 0x0(0x8)
	bool                                                         Value;                                             // 0x8(0x1)
};


// Size 0x1
struct EventHdrSettingsVisible
{
public:
	bool                                                         Visible;                                           // 0x0(0x1)
};


// Size 0x10
struct EventEnteredShip
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	class Actor*                                                 Actor;                                             // 0x8(0x8)
};


// Size 0x20
struct GameEventServiceDesc
{
public:
	struct StringAssetReference                                  ServiceParamsAssetPath;                            // 0x0(0x10)
	struct StringAssetReference                                  GameEventOnDemandAvailabilityParamsAsset;          // 0x10(0x10)
};


// Size 0x38
struct PlayerEntitlementsCompact
{
public:
	char                                                         Status;                                            // 0x0(0x1)
	TArray<class Class*>                                         Loose;                                             // 0x28(0x10)
};


// Size 0x10
struct RewardRequestSucceededMessage
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
};


// Size 0x40
struct ControlObjectActionStateSerialisableData
{
public:
	struct Vector                                                UndockLocation;                                    // 0x30(0xc)
	bool                                                         UndockRequested;                                   // 0x3c(0x1)
};


// Size 0x10
struct EventClearCrewProgressOverride
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x4
struct RequestJoinCrewEvent
{
public:
	int                                                          CrewId;                                            // 0x0(0x4)
};


// Size 0x28
struct SetHiddenData
{
public:
	class SequencerCutSceneActor*                                SequencerActor;                                    // 0x0(0x8)
	class LevelSequence*                                         LevelSeq;                                          // 0x8(0x8)
	struct FString                                               ActorName;                                         // 0x10(0x10)
	bool                                                         Visible;                                           // 0x20(0x1)
};


// Size 0x10
struct GetInteractingShopKeeperFailTelemetryEvent
{
public:
	struct FString                                               FailureReason;                                     // 0x0(0x10)
};


// Size 0xc
struct EventPlayerEnteredSleepingState
{
public:
	float                                                        AudioEventDelay;                                   // 0x0(0x4)
	float                                                        AudioStateDelay;                                   // 0x4(0x4)
	bool                                                         NoFarting;                                         // 0x8(0x1)
};


// Size 0x40
struct AthenaAnimationPulleyControl
{
public:
	TArray<char>                                                 PulleyObjectTypes;                                 // 0x0(0x10)
	float                                                        MaxRate;                                           // 0x10(0x4)
	float                                                        ForceMultiplier;                                   // 0x14(0x4)
	float                                                        PulleyMovementForce;                               // 0x18(0x4)
	bool                                                         UsingPulley;                                       // 0x1c(0x1)
	bool                                                         MovingPulley;                                      // 0x1d(0x1)
	bool                                                         LookAtOffsetSet;                                   // 0x1e(0x1)
	bool                                                         LookingRight;                                      // 0x1f(0x1)
};


// Size 0x18
struct EventPlayerDockToObjectEnd
{
public:
	interface                                                    ObjectBeingUsed;                                   // 0x0(0x10)
	bool                                                         CanLookAtBeDisabledWhenDockedToObject;             // 0x10(0x1)
};


// Size 0x50
struct ShipSpeedUpdateTelemetryEvent
{
public:
	int                                                          TimeElapsed;                                       // 0x0(0x4)
	struct FString                                               ShipSize;                                          // 0x8(0x10)
	struct FString                                               ShipDirection;                                     // 0x18(0x10)
	struct FString                                               WindDirection;                                     // 0x28(0x10)
	float                                                        ShipSailAngle;                                     // 0x38(0x4)
	float                                                        ShipSailLoweredPercentage;                         // 0x3c(0x4)
	float                                                        MaxShipSpeed;                                      // 0x40(0x4)
	float                                                        CurrentShipSpeed;                                  // 0x44(0x4)
	float                                                        ShipAcceleration;                                  // 0x48(0x4)
	float                                                        DistanceTravelled;                                 // 0x4c(0x4)
};


// Size 0x38
struct FortTargetKilledTelemetryEvent
{
public:
	struct Guid                                                  FortKeyId;                                         // 0x0(0x10)
	struct FString                                               FortTargetName;                                    // 0x10(0x10)
	struct Vector                                                FortKeyDroppedLocation;                            // 0x20(0xc)
	struct FName                                                 FortType;                                          // 0x2c(0x8)
};


// Size 0x48
struct SpeechAccessibilityOptions
{
public:
	bool                                                         GameChatSTT;                                       // 0x0(0x1)
	bool                                                         GameChatTTS;                                       // 0x1(0x1)
	struct FString                                               PersonaID;                                         // 0x8(0x10)
	struct FString                                               PersonaName;                                       // 0x18(0x10)
	int                                                          PersonaGender;                                     // 0x28(0x4)
	struct FString                                               PersonaLang;                                       // 0x30(0x10)
	bool                                                         GameTextSS;                                        // 0x40(0x1)
};


// Size 0x10
struct GameplayEventExclusionInfo
{
public:
	class UClass*                                                Type;                                              // 0x0(0x8)
	float                                                        ExclusionRadius;                                   // 0x8(0x4)
};


// Size 0x4
struct EmptyWaterFromVaultGameServerRequestModel
{
public:
	int                                                          ActorId;                                           // 0x0(0x4)
};


// Size 0x18
struct ScheduledShutdownSettingsClient
{
public:
	float                                                        StartScreenFadeWithTimeRemainingSeconds;           // 0x0(0x4)
	float                                                        ScreenFadeTimeSeconds;                             // 0x4(0x4)
	float                                                        QuitGameTimeRemainingSeconds;                      // 0x8(0x4)
	float                                                        UpperDisplayPeriodTimeSeconds;                     // 0xc(0x4)
	float                                                        LowerDisplayPeriodTimeSeconds;                     // 0x10(0x4)
	float                                                        SwitchToLowerTimePeriodWithTimeRemainingSeconds;   // 0x14(0x4)
};


// Size 0x20
struct PageCultureOverride
{
public:
	struct FString                                               Culture;                                           // 0x0(0x10)
	struct StringAssetReference                                  PageReference;                                     // 0x10(0x10)
};


// Size 0x10
struct LandmarkReactionEventPlayForceFeedbackEntry
{
public:
	float                                                        OuterRadius;                                       // 0x0(0x4)
	class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x8(0x8)
};


// Size 0x68
struct AthenaAnimationZiplineControlAnimData
{
public:
	class AnimSequenceBase*                                      ActionToUse;                                       // 0x0(0x8)
	assetobject                                                  ActionAssetPtr;                                    // 0x8(0x20)
	class AnimSequenceBase*                                      ActionFallback;                                    // 0x28(0x8)
	bool                                                         IsRidingZipline;                                   // 0x48(0x1)
};


// Size 0x18
struct AthenaWorldSettingsGameEventSchedulerSettingsConfiguration
{
public:
	struct FName                                                 FeatureFlag;                                       // 0x0(0x8)
	char                                                         RequiredPlayMode;                                  // 0x8(0x1)
	class GameEventSchedulerSettingsAsset*                       EventSchedulerSettings;                            // 0x10(0x8)
};


// Size 0x20
struct WeightedTunnelCreatureDioramaType
{
public:
	class UClass*                                                DioramaClassType;                                  // 0x0(0x8)
	float                                                        SelectionChance;                                   // 0x8(0x4)
};


// Size 0x10
struct ManagedItems
{
public:
	TArray<class ItemProxy*>                                     Items;                                             // 0x0(0x10)
};


// Size 0x20
struct AthenaAnimationSwimmingSprintAnimData
{
public:
	class AnimSequence*                                          Into;                                              // 0x0(0x8)
	class AnimSequence*                                          Loop;                                              // 0x8(0x8)
	class AnimSequence*                                          IntoUnderwater;                                    // 0x10(0x8)
	class AnimSequence*                                          LoopUnderwater;                                    // 0x18(0x8)
};


// Size 0x10
struct FeaturedShipCustomizationCategory
{
public:
	class UClass*                                                Category;                                          // 0x0(0x8)
	struct FName                                                 Feature;                                           // 0x8(0x8)
};


// Size 0x8
struct EventKilledCharacter
{
public:
	class Actor*                                                 KilledCharacter;                                   // 0x0(0x8)
};


// Size 0x10
struct UIWhatsNewAvailableArticlesEvent
{
public:
	TArray<String>                                               Articles;                                          // 0x0(0x10)
};


// Size 0x38
struct SinkingShipParams
{
public:
	float                                                        DragWhenGrindingToHalt;                            // 0x0(0x4)
	float                                                        MinSpdToStopToBeforeLowering;                      // 0x4(0x4)
	float                                                        LowerIntoWaterTime;                                // 0x8(0x4)
	float                                                        TimeIntoLoweringToStartOcclusionZoneShrinkage;     // 0xc(0x4)
	float                                                        AngularDragDuringSinkingSequence;                  // 0x10(0x4)
	float                                                        KeeledOverTime;                                    // 0x14(0x4)
	float                                                        TurnOffBuoyancyTime;                               // 0x18(0x4)
	float                                                        FinalSinkingBuoyancy;                              // 0x1c(0x4)
	float                                                        SinkingTimeUntilDestroy;                           // 0x20(0x4)
	float                                                        ReduceWaterOcclusionZoneTime;                      // 0x24(0x4)
	float                                                        ReduceWaterOcclusionZoneTimeHurryUp;               // 0x28(0x4)
	float                                                        TimeIntoKeelingOverToTeleportPlayer;               // 0x2c(0x4)
	float                                                        MinSampleSubmersionToConsiderInWater;              // 0x30(0x4)
	float                                                        MinPctSamplesRequiredSubmergedToBeAbleToSink;      // 0x34(0x4)
};


// Size 0x20
struct OpenableItemMetaWrapper
{
public:
	char                                                         OpenState;                                         // 0x18(0x1)
	bool                                                         HasEverClosed;                                     // 0x19(0x1)
};


// Size 0x18
struct EventDisableInteractionPoints
{
public:
	char                                                         ShipCurseTag;                                      // 0x0(0x1)
	char                                                         CurseTag;                                          // 0x1(0x1)
	TArray<class Class*>                                         InteractionPointsToDisable;                        // 0x8(0x10)
};


// Size 0x80
struct AthenaAnimationFirstPersonAnimatic
{
public:
	bool                                                         IsFirstPersonAnimaticActive;                       // 0x0(0x1)
	bool                                                         IsFirstPersonCustomAnimatic;                       // 0x0(0x1)
	class AnimSequence*                                          FirstPersonAnimationToPlay;                        // 0x8(0x8)
	class FirstPersonAnimaticList*                               FirstPersonAnimaticList;                           // 0x10(0x8)
};


// Size 0x8
struct ClothingChestUnequipEmoteEvent
{
public:
	class UClass*                                                Desc;                                              // 0x0(0x8)
};


// Size 0x10
struct KrakenSpawnLocationExclusionZone
{
public:
	struct Vector                                                Centre;                                            // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
};


// Size 0x48
struct WreckMatch
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	interface                                                    Wreck;                                             // 0x10(0x10)
	float                                                        DistanceData;                                      // 0x30(0x4)
	struct Guid                                                  OwningCrewID;                                      // 0x34(0x10)
};


// Size 0x1
struct CrewMuteOthersChatEvent
{
public:
	bool                                                         IsMuted;                                           // 0x0(0x1)
};


// Size 0x1
struct EventChatboxFocusRequest
{
public:
	bool                                                         ShouldFocusChatbox;                                // 0x0(0x1)
};


// Size 0x20
struct AllianceDisbandedTelemetryEvent
{
public:
	struct Guid                                                  AllianceId;                                        // 0x0(0x10)
	struct Guid                                                  LeavingCrewSessionId;                              // 0x10(0x10)
};


// Size 0x20
struct RadialActionGroup
{
public:
	class RadialAction*                                          PrimaryAction;                                     // 0x0(0x8)
	class RadialAction*                                          SecondaryAction;                                   // 0x8(0x8)
	class RadialAction*                                          TertiaryAction;                                    // 0x10(0x8)
	class RadialAction*                                          QuaternaryAction;                                  // 0x18(0x8)
};


// Size 0x18
struct EndEmoteGameServerRequestModel
{
public:
	int                                                          ActorId;                                           // 0x0(0x4)
	struct FString                                               EmoteName;                                         // 0x8(0x10)
};


// Size 0x28
struct ResponseContendedResourcesNetworkEvent
{
public:
	struct FString                                               ContendedResources;                                // 0x18(0x10)
};


// Size 0xf8
struct EmoteFlourishCategoryMapping
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	class UClass*                                                AlternateItemCategory;                             // 0x8(0x8)
	struct StringAssetReference                                  IconPath;                                          // 0x10(0x10)
	struct EmoteData                                             EmoteData;                                         // 0x20(0xc8)
	struct FString                                               PairName;                                          // 0xe8(0x10)
};


// Size 0x18
struct ConstellationAudioPair
{
public:
	class UClass*                                                ConstellationClass;                                // 0x0(0x8)
	class WwiseEvent*                                            AudioStartEvent;                                   // 0x8(0x8)
	class WwiseEvent*                                            AudioStopEvent;                                    // 0x10(0x8)
};


// Size 0x68
struct CapstanAudioParams
{
public:
	class WwiseEvent*                                            CapstanStart;                                      // 0x0(0x8)
	class WwiseEvent*                                            CapstanStop;                                       // 0x8(0x8)
	class WwiseEvent*                                            CapstanDamagedStart;                               // 0x10(0x8)
	class WwiseEvent*                                            CapstanDamagedStop;                                // 0x18(0x8)
	class WwiseEvent*                                            CapstanStopFullyRaised;                            // 0x20(0x8)
	class WwiseEvent*                                            CapstanStopFullyLowered;                           // 0x28(0x8)
	class WwiseObjectPoolWrapper*                                CapstanEmitterPool;                                // 0x30(0x8)
	struct FName                                                 CapstanTurnRateRtpc;                               // 0x38(0x8)
	float                                                        CapstanTurnMinRtpcValue;                           // 0x40(0x4)
	float                                                        CapstanTurnMaxRtpcValue;                           // 0x44(0x4)
	struct FName                                                 BoatVelocityRtpc;                                  // 0x48(0x8)
	float                                                        BoatVelocityMinRtpcValue;                          // 0x50(0x4)
	float                                                        BoatVelocityMaxRtpcValue;                          // 0x54(0x4)
	float                                                        EmpiricalMaxShipVelocity;                          // 0x58(0x4)
	struct FName                                                 CapstanDamageRtpc;                                 // 0x5c(0x8)
	float                                                        CapstanDamageRtpcMaxValue;                         // 0x64(0x4)
};


// Size 0x30
struct MaterialManipulationSettings
{
public:
	TArray<struct ScalarParameterValue>                          ScalarParameterValues;                             // 0x0(0x10)
	TArray<struct TextureParameterValue>                         TextureParameterValues;                            // 0x10(0x10)
	TArray<struct VectorParameterValue>                          VectorParameterValues;                             // 0x20(0x10)
};


// Size 0x70
struct CrewServiceParams
{
public:
	float                                                        MinSafeDistanceToShip;                             // 0x0(0x4)
	float                                                        SpawnDistAroundSunkenShip;                         // 0x4(0x4)
	TArray<int>                                                  VotesRequiredForSendToBrig;                        // 0x8(0x10)
	TArray<int>                                                  VotesRequiredForReleaseFromBrig;                   // 0x18(0x10)
	TArray<int>                                                  VotesRequiredForScuttleShip;                       // 0x28(0x10)
	TArray<int>                                                  VotesRequiredForChangeMatchmakingVisibility;       // 0x38(0x10)
	TArray<int>                                                  VotesRequiredForArenaRivalVote;                    // 0x48(0x10)
	float                                                        BrigMinReleaseTime;                                // 0x58(0x4)
	float                                                        BrigServerTimeToRememberPastCrewMates;             // 0x5c(0x4)
	float                                                        ScuttleInitialTimeoutTime;                         // 0x60(0x4)
	float                                                        ScuttleMultipleRequestTimeoutIncrement;            // 0x64(0x4)
	float                                                        ScuttleMaxRequestTimeoutTime;                      // 0x68(0x4)
};


// Size 0x8
struct GuildNumberOfMembersChangedEvent
{
public:
	int                                                          OldNumberOfMembers;                                // 0x0(0x4)
	int                                                          CurrentNumberOfMembers;                            // 0x4(0x4)
};


// Size 0x1
struct GuildValidityResponseModel
{
public:
	bool                                                         IsSessionValid;                                    // 0x0(0x1)
};


// Size 0xc
struct ContestVoyageIslandData
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	int                                                          MaxItemCountForIsland;                             // 0x8(0x4)
};


// Size 0x50
struct SwitchMechanismTriggerPosition
{
public:
	char                                                         MechanismState;                                    // 0x0(0x1)
	struct Transform                                             PivotTransform;                                    // 0x10(0x30)
	class WwiseEvent*                                            SwitchStartTransitionAudioEvent;                   // 0x40(0x8)
	class WwiseEvent*                                            SwitchStopTransitionAudioEvent;                    // 0x48(0x8)
};


// Size 0xc
struct DestroyingUnsafeExpiredWreckTelemetryEvent
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
};


// Size 0x20
struct FlagMeshParams
{
public:
	struct StringAssetReference                                  FlagMesh;                                          // 0x0(0x10)
	class UClass*                                                FlagItemInfo;                                      // 0x10(0x8)
	class UClass*                                                TemporaryEntitlement;                              // 0x18(0x8)
};


// Size 0x28
struct VoyageProposalCompletedNetworkEvent
{
public:
	TArray<String>                                               VoyageProposalIds;                                 // 0x18(0x10)
};


// Size 0x10
struct CrewBeganPrimaryVoyageEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x18
struct CompanyProgressDistinctionIcon
{
public:
	int                                                          RequiredLevel;                                     // 0x0(0x4)
	struct StringAssetReference                                  Icon;                                              // 0x8(0x10)
};


// Size 0x40
struct FishingComedyItemInfo
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	class UClass*                                                ItemDesc;                                          // 0x8(0x8)
	struct Transform                                             SpawnOffset;                                       // 0x10(0x30)
};


// Size 0x30
struct CrewJoinedAllianceTelemetryEvent
{
public:
	struct Guid                                                  AllianceId;                                        // 0x0(0x10)
	struct Guid                                                  OfferingCrewSessionId;                             // 0x10(0x10)
	struct Guid                                                  AcceptingCrewSessionId;                            // 0x20(0x10)
};


// Size 0x10
struct CrewRequestedRivalChangeEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x28
struct CrewStatEvent
{
public:
	class Object*                                                ObjectOfInterest;                                  // 0x18(0x8)
};


// Size 0x4
struct FallingIntoWaterEvent
{
public:
	float                                                        FallingSpeed;                                      // 0x0(0x4)
};


// Size 0x30
struct AllianceCreatedTelemetryEvent
{
public:
	struct Guid                                                  AllianceId;                                        // 0x0(0x10)
	struct Guid                                                  OfferingCrewSessionId;                             // 0x10(0x10)
	struct Guid                                                  AcceptingCrewSessionId;                            // 0x20(0x10)
};


// Size 0x20
struct CaptainsLogAccoladesCommittedEvent
{
public:
	TArray<String>                                               PirateAccolades;                                   // 0x0(0x10)
	TArray<String>                                               ShipAccolades;                                     // 0x10(0x10)
};


// Size 0x8
struct EventSetFishingFloatActor
{
public:
	class Actor*                                                 FishingFloat;                                      // 0x0(0x8)
};


// Size 0x8
struct SeaFortAlignmentDollHandinEvent
{
public:
	char                                                         HandInAlignemnt;                                   // 0x0(0x1)
	bool                                                         IsDollEnchanted;                                   // 0x1(0x1)
	int                                                          FortsAlignedToHandInType;                          // 0x4(0x4)
};


// Size 0x4
struct MastFallenAngleChangedEvent
{
public:
	float                                                        Angle;                                             // 0x0(0x4)
};


// Size 0x78
struct StandingSpyglassInteractionParams
{
public:
	class UClass*                                                CanInteractNotificationInputId;                    // 0x0(0x8)
	struct FText                                                 CanInteractDescriptorText;                         // 0x8(0x38)
	struct FText                                                 DisplayName;                                       // 0x40(0x38)
};


// Size 0x14
struct AggressiveGhostShipEncounterEndTelemetryEvent
{
public:
	struct Guid                                                  EncounterId;                                       // 0x0(0x10)
	bool                                                         WasSuccessfullyCompleted;                          // 0x10(0x1)
};


// Size 0x28
struct OnStartDockedToWalkwayEvent
{
public:
	class WwiseEvent*                                            WalkwayStart;                                      // 0x0(0x8)
	class WwiseEvent*                                            AttachToWalkwayAdditiveOneShot;                    // 0x8(0x8)
	class WwiseEvent*                                            WalkwayLoopStart;                                  // 0x10(0x8)
	class ParticleSystem*                                        WalkwayWindVFX;                                    // 0x18(0x8)
	class ParticleSystem*                                        WalkwayTrailVFX;                                   // 0x20(0x8)
};


// Size 0x18
struct ReplicatedMountpointData
{
public:
	class InteractableComponentWithActionRules*                  InteractableComponentWithActionRules;              // 0x0(0x8)
	int                                                          CurrentTrinketClassIndex;                          // 0x8(0x4)
	class Actor*                                                 InteractingPlayerReplicated;                       // 0x10(0x8)
};


// Size 0x20
struct AmmoTransferMetaWrapper
{
public:
	int                                                          AmmoCount;                                         // 0x18(0x4)
};


// Size 0x8
struct EventShipBecameUseless
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
};


// Size 0x80
struct PremiumCatalogLandingPageTab
{
public:
	struct Guid                                                  Id;                                                // 0x0(0x10)
	struct FText                                                 DisplayName;                                       // 0x10(0x38)
	TArray<class PremiumCatalogLandingPageItemDataAsset*>        Children;                                          // 0x48(0x10)
	struct FName                                                 FeatureToggle;                                     // 0x58(0x8)
	struct FName                                                 InverseFeatureToggle;                              // 0x60(0x8)
	struct FName                                                 IncludeForPromotion;                               // 0x68(0x8)
	struct FName                                                 ExcludeFromPromotion;                              // 0x70(0x8)
	bool                                                         RealMoneyOnly;                                     // 0x78(0x1)
};


// Size 0x18
struct GetLinkedXuidFromPSNIdRequestModel
{
public:
	TArray<String>                                               PsnIds;                                            // 0x0(0x10)
	int                                                          PsnIssuerId;                                       // 0x10(0x4)
};


// Size 0x48
struct UserSettingsMapMarkDefinition
{
public:
	class UClass*                                                MarkId;                                            // 0x0(0x8)
	assetobject                                                  DefaultTexture;                                    // 0x8(0x20)
	assetobject                                                  HighContrastTexture;                               // 0x28(0x20)
};


// Size 0x78
struct AthenaAnimationAsyncLoadedFacialActionAnimations
{
public:
	TArray<Class>                                                PrimaryContinuous;                                 // 0x8(0x10)
	TArray<Class>                                                SecondaryContinuous;                               // 0x18(0x10)
	TArray<Class>                                                PrimaryOneShot;                                    // 0x28(0x10)
	TArray<Class>                                                SecondaryOneShot;                                  // 0x38(0x10)
	TArray<Class>                                                MeleeBlocking;                                     // 0x48(0x10)
	TArray<Class>                                                MeleeAttack;                                       // 0x58(0x10)
	TArray<Class>                                                MeleeBlockReact;                                   // 0x68(0x10)
};


// Size 0x44
struct LightingControllerLightingParams
{
public:
	float                                                        SunYaw;                                            // 0x0(0x4)
	float                                                        SunElevation;                                      // 0x4(0x4)
	float                                                        UnderworldSunElevation;                            // 0x8(0x4)
	float                                                        MinSunAngle;                                       // 0xc(0x4)
	float                                                        UnderworldZThreshold;                              // 0x10(0x4)
	float                                                        HideoutZThreshold;                                 // 0x14(0x4)
	float                                                        UnderwaterInsideShipBrightnessInBoatSpace;         // 0x18(0x4)
	float                                                        UnderwaterInsideShipBrightnessOutsideBoatSpace;    // 0x1c(0x4)
	float                                                        UnderwaterBrightnessInBoatSpace;                   // 0x20(0x4)
	float                                                        UnderwaterDepthDarkenStart;                        // 0x24(0x4)
	float                                                        UnderwaterDepthDarkenRange;                        // 0x28(0x4)
	float                                                        UnderwaterDepthDarkenMin;                          // 0x2c(0x4)
	float                                                        UnderwaterMurkDensity;                             // 0x30(0x4)
	float                                                        SecondaryLPVCascadeOcclusionIntensityScale;        // 0x34(0x4)
	int                                                          LPVPropagationSteps;                               // 0x38(0x4)
	int                                                          DefaultLightingSet;                                // 0x3c(0x4)
	bool                                                         EnableGodRays;                                     // 0x40(0x1)
};


// Size 0x10
struct CrewFinishedBeingAttackedByGameEventEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x20
struct KeyBindingRemote
{
public:
	struct FString                                               BindingName;                                       // 0x0(0x10)
	struct FName                                                 KeyName;                                           // 0x10(0x8)
	char                                                         ControllerType;                                    // 0x18(0x1)
};


// Size 0x20
struct CondensedPlayerStat
{
public:
	uint32                                                       StatId;                                            // 0x0(0x4)
	uint64                                                       Min;                                               // 0x8(0x8)
	uint64                                                       Max;                                               // 0x10(0x8)
	uint64                                                       Sum;                                               // 0x18(0x8)
};


// Size 0x18
struct CoherentToWwiseEventDataAssetEntry
{
public:
	struct FString                                               CueKey;                                            // 0x0(0x10)
	class WwiseEvent*                                            AudioEvent;                                        // 0x10(0x8)
};


// Size 0x48
struct PlayerBaseTelemetryFragment
{
public:
	struct Guid                                                  PlayerGameId;                                      // 0x0(0x10)
	struct FString                                               UserId;                                            // 0x10(0x10)
	struct FString                                               PirateId;                                          // 0x20(0x10)
	char                                                         PlatformId;                                        // 0x30(0x1)
	struct FString                                               DeviceID;                                          // 0x38(0x10)
};


// Size 0x8
struct RepairObjectActionStateParams
{
public:
	float                                                        MountTime;                                         // 0x0(0x4)
	struct AdaptiveTriggerEffectMode_Vibration                   RightTrigger_Repair;                               // 0x4(0x4)
};


// Size 0x2c
struct AthenaAnimationHitReactParams
{
public:
	int                                                          StandardIndex0;                                    // 0x0(0x4)
	int                                                          StandardIndex1;                                    // 0x4(0x4)
	bool                                                         HitReactTransition;                                // 0x8(0x1)
	float                                                        DirectionYaw;                                      // 0xc(0x4)
	int                                                          ItemIndex0;                                        // 0x10(0x4)
	int                                                          ItemIndex1;                                        // 0x14(0x4)
	int                                                          ActionIndex0;                                      // 0x18(0x4)
	int                                                          ActionIndex1;                                      // 0x1c(0x4)
	int                                                          SubtleIndex0;                                      // 0x20(0x4)
	int                                                          SubtleIndex1;                                      // 0x24(0x4)
	char                                                         AnimationType;                                     // 0x28(0x1)
};


// Size 0x10
struct EventStatueThreatWasDefeated
{
public:
	class Actor*                                                 Instigator;                                        // 0x0(0x8)
	class Actor*                                                 DirectInstigator;                                  // 0x8(0x8)
};


// Size 0x40
struct AthenaAnimationSkeletonFlee
{
public:
	class UClass*                                                UseWithObject;                                     // 0x0(0x8)
	TArray<class AnimSequence*>                                  FleeTurnLeft;                                      // 0x8(0x10)
	TArray<class AnimSequence*>                                  FleeTurnRight;                                     // 0x18(0x10)
	class BlendSpace*                                            FleeLocomotionBase;                                // 0x28(0x8)
	TArray<class BlendSpace*>                                    FleeLocomotionVariants;                            // 0x30(0x10)
};


// Size 0x20
struct VoyageProposedTelemetryEvent
{
public:
	struct Guid                                                  VoyageProposalSessionId;                           // 0x0(0x10)
	struct FString                                               VoyageProposalEntitlementId;                       // 0x10(0x10)
};


// Size 0x28
struct AIShipEncounterZoneEnteredNetworkEvent
{
public:
	int                                                          RemainingAIShips;                                  // 0x18(0x4)
	int                                                          TotalAIShips;                                      // 0x1c(0x4)
	int                                                          TotalAIShipsInFinalWave;                           // 0x20(0x4)
	int                                                          CurrentSpawnedAIShips;                             // 0x24(0x4)
};


// Size 0x58
struct ServerShutdownRequestFilter
{
public:
	struct DateTime                                              ShutdownTimeUtc;                                   // 0x0(0x8)
	struct FString                                               VersionNumber;                                     // 0x8(0x10)
	char                                                         PlayMode;                                          // 0x18(0x1)
	char                                                         PlayModeVariant;                                   // 0x19(0x1)
	char                                                         ServerEnvironmentStatus;                           // 0x1a(0x1)
	struct FString                                               FeatureHash;                                       // 0x20(0x10)
	struct FString                                               BuildId;                                           // 0x30(0x10)
	uint32                                                       AgeOverSeconds;                                    // 0x40(0x4)
	struct Guid                                                  SessionId;                                         // 0x44(0x10)
};


// Size 0x8
struct EventFallWithDamageLegNotBroken
{
public:
	struct FName                                                 RumbleTag;                                         // 0x0(0x8)
};


// Size 0x8
struct EventCutsceneTargetReady
{
public:
	class Actor*                                                 CutsceneTarget;                                    // 0x0(0x8)
};


// Size 0x10
struct PetCustomizationPartMapping
{
public:
	struct AIPartId                                              AppliedToPetPartId;                                // 0x0(0x8)
	struct AIPartId                                              CustomizationPetPartId;                            // 0x8(0x8)
};


// Size 0x98
struct ContestCeremonyEvent
{
public:
	TArray<class WwiseEvent*>                                    AudioEvents;                                       // 0x0(0x10)
	TArray<char>                                                 SpecialEvents;                                     // 0x10(0x10)
	struct FText                                                 NPCName;                                           // 0x20(0x38)
	struct FText                                                 NPCMessageToAllPlayers;                            // 0x58(0x38)
	float                                                        TimeToEvent;                                       // 0x90(0x4)
};


// Size 0x8
struct NumCrewsPercentageModel
{
public:
	uint32                                                       NumCrews;                                          // 0x0(0x4)
	float                                                        Percentage;                                        // 0x4(0x4)
};


// Size 0x10
struct CatagoriesDataRequestUIEvent
{
public:
	struct FString                                               CatalogName;                                       // 0x0(0x10)
};


// Size 0x50
struct CaptainsShopInventoryCountsResponseEvent
{
public:
	map                                                          StockCount;                                        // 0x0(0x50)
};


// Size 0x20
struct GlobalIslandChanceToSpawnOverride
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	float                                                        GlobalIslandChanceToSpawn;                         // 0xc(0x4)
	TArray<class SpawnRequirement*>                              Requirements;                                      // 0x10(0x10)
};


// Size 0x20
struct VirtualActionBindingDefinition
{
public:
	TArray<struct Name>                                          ActionNames;                                       // 0x0(0x10)
	struct FString                                               BindingName;                                       // 0x10(0x10)
};


// Size 0x30
struct SwimmingCreatureAIStrategyMovementProperties
{
public:
	class UClass*                                                AIStrategy;                                        // 0x0(0x8)
	char                                                         SwimRotationMode;                                  // 0x8(0x1)
	float                                                        RotationRate;                                      // 0xc(0x4)
	float                                                        CorrectingMaxSpeed;                                // 0x10(0x4)
	float                                                        CorrectingYawTurnRate;                             // 0x14(0x4)
	float                                                        MaxAbsPitch;                                       // 0x18(0x4)
	float                                                        MaxSpeed;                                          // 0x1c(0x4)
	float                                                        VelocitySmoothingFactor;                           // 0x20(0x4)
	float                                                        TrackedActorVelocityScaling;                       // 0x24(0x4)
	float                                                        TrackedActorVelocityScalingSmoothingFactor;        // 0x28(0x4)
};


// Size 0x20
struct AthenaAnimationAsyncLoadedLocomotionTurningAnimData
{
public:
	assetobject                                                  Turn90;                                            // 0x0(0x20)
};


// Size 0x10
struct DartProxies
{
public:
	TArray<class ItemProxy*>                                     DartProxyArray;                                    // 0x0(0x10)
};


// Size 0x8
struct TeleportShipToTunnelEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
};


// Size 0x8
struct EventGhostShipPlayerSpawnLocationCreated
{
public:
	class GhostShipPlayerSpawnLocation*                          SpawnLocation;                                     // 0x0(0x8)
};


// Size 0x20
struct UISetAudioSwitchEvent
{
public:
	struct FString                                               SwitchGroup;                                       // 0x0(0x10)
	struct FString                                               SwitchValue;                                       // 0x10(0x10)
};


// Size 0x10
struct AIShipDespawnedEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	char                                                         ShipDestructionReason;                             // 0x8(0x1)
};


// Size 0x58
struct ShovelDigActionStateConstructionInfo
{
public:
	struct NetActorPtr                                           UsableObject;                                      // 0x40(0x14)
};


// Size 0x38
struct ShipRepairTelemetryEvent
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct Vector                                                DamageLocation;                                    // 0x10(0xc)
	struct FString                                               RepairedShipPart;                                  // 0x20(0x10)
	int                                                          DamageLevel;                                       // 0x30(0x4)
	float                                                        RepairPercentage;                                  // 0x34(0x4)
};


// Size 0x38
struct AthenaAnimationActiveItemComplexAnimData
{
public:
	class AnimSequence*                                          WarmUp;                                            // 0x0(0x8)
	class AnimSequence*                                          HeavyWarmUp;                                       // 0x8(0x8)
	class AnimSequence*                                          Action;                                            // 0x10(0x8)
	class AnimSequence*                                          Recover;                                           // 0x18(0x8)
	class AnimSequence*                                          HeavyAttackStunRecover;                            // 0x20(0x8)
	char                                                         AnimType;                                          // 0x28(0x1)
	float                                                        WarmUpPlaySpeed;                                   // 0x2c(0x4)
	bool                                                         IsHeavyAttackActive;                               // 0x30(0x1)
};


// Size 0x1
struct ClientInputMatchmakingResult
{
public:
	bool                                                         IsAccepted;                                        // 0x0(0x1)
};


// Size 0x1
struct ShipMastCollapseStateTelemetryEvent
{
public:
	bool                                                         MastCollapsedState;                                // 0x0(0x1)
};


// Size 0x2
struct VoiceChatStatusTelemetryEvent
{
public:
	char                                                         Device;                                            // 0x0(0x1)
	bool                                                         IsInPartyChat;                                     // 0x1(0x1)
};


// Size 0x40
struct CollectorsChestItemSlotDefinition
{
public:
	TArray<Class>                                                TargetObjectTypes;                                 // 0x0(0x10)
	struct Transform                                             RelativeTransform;                                 // 0x10(0x30)
};


// Size 0x10
struct GenericConfirmationEvent
{
public:
	struct FString                                               DisplayMessage;                                    // 0x0(0x10)
};


// Size 0x1
struct EventHarpoonProjectileClientStateChanged
{
public:
	char                                                         ProjectileState;                                   // 0x0(0x1)
};


// Size 0x8
struct FishAnimationParams
{
public:
	char                                                         FishAnimationState;                                // 0x0(0x1)
	int                                                          FishLoopEndingDirection;                           // 0x4(0x4)
};


// Size 0x34
struct BuoyancyComponentSinkingParams
{
public:
	float                                                        BuoyancyBlendTimeWhenSinking;                      // 0x0(0x4)
	char                                                         FloatingToSinkingBuoyancyCurveTransition;          // 0x4(0x1)
	float                                                        FloatingToSinkingBuoyancyCurveBlendTime;           // 0x8(0x4)
	float                                                        FinalSinkingBuoyancy;                              // 0xc(0x4)
	float                                                        SinkingTimeUntilDestroy;                           // 0x10(0x4)
	float                                                        DisappearingTime;                                  // 0x14(0x4)
	bool                                                         AutomaticSinkingEnabled;                           // 0x18(0x1)
	struct FloatRange                                            TimeInFloatingStateBeforeSinking;                  // 0x1c(0x10)
	float                                                        WaterDepthToAllowItemToSink;                       // 0x2c(0x4)
	char                                                         WorldHitsTraceChannel;                             // 0x30(0x1)
};


// Size 0x40
struct ClientReachedInGameTelemetryEvent
{
public:
	struct Guid                                                  PlayerGameId;                                      // 0x0(0x10)
	struct FString                                               SessionType;                                       // 0x10(0x10)
	struct Guid                                                  MatchmakingAttemptId;                              // 0x20(0x10)
	struct FString                                               ActiveExperiments;                                 // 0x30(0x10)
};


// Size 0x18
struct StorageContainerContentModifierExtraContentSpawnerEntry
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	int                                                          MinimumUses;                                       // 0x4(0x4)
