#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x20
struct OutgoingServerMigrationCompletedEvent
{
public:
	char                                                         pad0x20_Z4WM9[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct OutgoingServerMigrationAbortedEvent
{
public:
	char                                                         pad0x20_4LXGU[0x20];                               // 0x0(0x20)
};


// Size 0x18
struct PrepareForWorldSwitchRpc
{
public:
	char                                                         pad0x18_KEP9M[0x18];                               // 0x0(0x18)
};


// Size 0x20
struct ServerMigrationRefusedEvent
{
public:
	struct Guid                                                  MigrationId;                                       // 0x0(0x10)
	TArray<struct Guid>                                          CrewIds;                                           // 0x10(0x10)
};


// Size 0x48
struct AddedPendingIncomingGameEventOnDemandCrewEvent
{
public:
	char                                                         pad0x48_OCYPG[0x48];                               // 0x0(0x48)
};


// Size 0x20
struct ServerMigrationInstanceEventBase
{
public:
	struct Guid                                                  ServerId;                                          // 0x0(0x10)
	struct Guid                                                  MigrationId;                                       // 0x10(0x10)
};


// Size 0x60
struct ServerMigrationRequestEvent
{
public:
	struct Guid                                                  MigrationId;                                       // 0x0(0x10)
	struct FString                                               DestinationAddress;                                // 0x10(0x10)
	TArray<struct Guid>                                          CrewIds;                                           // 0x20(0x10)
	struct FString                                               SubMode;                                           // 0x30(0x10)
	TArray<char>                                                 MatchmakingReasons;                                // 0x40(0x10)
	TArray<String>                                               RequestedGameEvents;                               // 0x50(0x10)
};


// Size 0x1
struct ServerMigrationCompleteEvent
{
public:
	char                                                         pad0x1_KYFSB[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct AddedPendingIncomingInvaderCrewEvent
{
public:
	char                                                         pad0x48_E48QH[0x48];                               // 0x0(0x48)
};


// Size 0x90
struct ServerMigrationReadyToTransferActors
{
public:
	char                                                         pad0x90_FTBJP[0x90];                               // 0x0(0x90)
};


// Size 0x1
struct ServerMigrationSetupRequestEvent
{
public:
	char                                                         pad0x1_ROPBR[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct OutgoingServerMigrationStartedEvent
{
public:
	char                                                         pad0x20_JXQZ1[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct ServerMigrationAbortEvent
{
public:
	char                                                         pad0x20_VNI7Q[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct OutgoingServerMigrationCompleteEvent
{
public:
	char                                                         pad0x20_BB5IY[0x20];                               // 0x0(0x20)
};


// Size 0xc
struct IncomingMigrationPreventionZone
{
public:
	struct Vector2D                                              Location;                                          // 0x0(0x8)
	float                                                        Radius;                                            // 0x8(0x4)
};


// Size 0x1
struct ServerMigrationSetupCompleteEvent
{
public:
	char                                                         pad0x1_XE5XT[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct ServerMigrationRequestBroadcastEvent
{
public:
	struct FString                                               DestinationAddress;                                // 0x0(0x10)
	struct Guid                                                  CrewId;                                            // 0x10(0x10)
};


// Size 0x20
struct ServerMigrationAboutToStartEvent
{
public:
	char                                                         pad0x20_CD8IE[0x20];                               // 0x0(0x20)
};


// Size 0x10
struct AthenaServerMigrationClientContext
{
public:
	struct FString                                               StampId;                                           // 0x0(0x10)
};


