// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20
struct ConfigurableStructureInstanceWrapper
{
public:
	struct UserDefinedStructWithSerialisableValue                Value;                                             // 0x0(0x20)
};


// Size 0x20
struct UserDefinedStructWithSerialisableValue
{
public:
	class ScriptStruct*                                          InternalStruct;                                    // 0x0(0x8)
	char                                                         pad0x18_FFM6I[0x18];                               // 0x8(0x18)
};


// Size 0x10
struct BoxedRpc
{
public:
	char                                                         pad0x8_US9K5[0x8];                                 // 0x0(0x8)
	class ScriptStruct*                                          Type;                                              // 0x8(0x8)
};


// Size 0x28
struct PlayModeDefiniton
{
public:
	TArray<Str Tags>                                             Tags;                                              // 0x0(0x10)
	TArray<Str States>                                           States;                                            // 0x10(0x10)
	int                                                          CrewMin;                                           // 0x20(0x4)
	int                                                          CrewMax;                                           // 0x24(0x4)
};


// Size 0x20
struct SerialisedRpc
{
public:
	char                                                         pad0x18_UKWH1[0x18];                               // 0x0(0x18)
	class ScriptStruct*                                          ContentsType;                                      // 0x18(0x8)
};


// Size 0x10
struct ServicesStampId
{
public:
	struct FString                                               StampId;                                           // 0x0(0x10)
};


// Size 0x40
struct StringAssetClassPair
{
public:
	struct FString                                               String;                                            // 0x0(0x10)
	TArray<struct StringAssetClassPairFeatureOverride>           FeatureOverrides;                                  // 0x30(0x10)
};


// Size 0x28
struct StringAssetClassPairFeatureOverride
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	char                                                         pad0x20_Y4TS9[0x20];                               // 0x8(0x20)
};


// Size 0x10
struct ActorComponentSelector
{
public:
	struct FName                                                 ComponentName;                                     // 0x0(0x8)
	class ActorComponent*                                        CachedComponent;                                   // 0x8(0x8)
};


// Size 0x20
struct PlaySoundRpc
{
public:
	char                                                         pad0x10_WPR7Y[0x10];                               // 0x0(0x10)
	class WwiseEvent*                                            WwiseEvent;                                        // 0x10(0x8)
	bool                                                         PlayOnTarget;                                      // 0x18(0x1)
	char                                                         pad0x7_JP0IY[0x7];                                 // 0x19(0x7)
};


// Size 0x10
struct EventCancelForceFeedback
{
public:
	class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x0(0x8)
	struct FName                                                 Tag;                                               // 0x8(0x8)
};


// Size 0x18
struct EventTriggerForceFeedback
{
public:
	class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x0(0x8)
	bool                                                         Looping;                                           // 0x8(0x1)
	char                                                         pad0x3_C9BP4[0x3];                                 // 0x9(0x3)
	struct FName                                                 Tag;                                               // 0xc(0x8)
	char                                                         pad0x4_2FAEV[0x4];                                 // 0x14(0x4)
};


// Size 0x18
struct AthenaAsyncAssetLoaderWrapper
{
public:
	char                                                         pad0x18_EZIRP[0x18];                               // 0x0(0x18)
};


// Size 0x1
struct EventMeshAssigned
{
public:
	char                                                         pad0x1_I7X6F[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct InlineUserDefinedStructDetails
{
public:
	class ScriptStruct*                                          Struct;                                            // 0x0(0x8)
};


// Size 0x8
struct NativeAndUserDefinedStructSelector
{
public:
	class ScriptStruct*                                          Struct;                                            // 0x0(0x8)
};


}