// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0 (Full Size[0x208] - InheritedSize[0x148]
class MetalAIFormComponent: public AthenaAIFormComponent
{
public:
	char                                                         pad0x28_MKTS2[0x28];                               // 0x148(0x28)
	class ParticleSystem*                                        RustyParticlesTemplate;                            // 0x170(0x8)
	class SkeletonAudioFootfallControllerParams*                 DefaultFootfallParams;                             // 0x178(0x8)
	class SkeletonAudioFootfallControllerParams*                 RustyFootfallParams;                               // 0x180(0x8)
	struct FName                                                 RustShaderParamName;                               // 0x1a8(0x8)
	float                                                        NotRustyShaderParamValue;                          // 0x1b0(0x4)
	float                                                        RustyShaderParamValue;                             // 0x1b4(0x4)
	float                                                        ShaderParamBlendSpeed;                             // 0x1b8(0x4)
	struct FName                                                 SeedShaderParamName;                               // 0x1bc(0x8)
	int                                                          MaxSeedShaderValue;                                // 0x1c4(0x4)
	bool                                                         IsWet;                                             // 0x1c8(0x1)
	char                                                         pad0x7_22GLK[0x7];                                 // 0x1c9(0x7)
	class ParticleSystemComponent*                               RustyParticleSystemComponent;                      // 0x1d0(0x8)
	char                                                         pad0x8_3GYI3[0x8];                                 // 0x1d8(0x8)
	class DamageableVulnerabilityLayer*                          DefaultVulnerabilityLayer;                         // 0x1e0(0x8)
	class DamageableVulnerabilityLayer*                          RustyVulnerabilityLayer;                           // 0x1e8(0x8)
	class CharacterHitReactionDamagerTypeToAnimTypeLayer*        RustyHitReactionsLayer;                            // 0x1f0(0x8)
	class MaterialInstanceDynamic*                               MetalDynamicMaterialInstance;                      // 0x1f8(0x8)
	char                                                         pad0x8_E09HO[0x8];                                 // 0x200(0x8)
};


// Size 0xa0 (Full Size[0x1e8] - InheritedSize[0x148]
class PlantAIFormComponent: public AthenaAIFormComponent
{
public:
	char                                                         pad0x28_1C65G[0x28];                               // 0x148(0x28)
	class ParticleSystem*                                        HealingParticlesTemplate;                          // 0x170(0x8)
	class WwiseEvent*                                            StartHealingAudioLoopEvent;                        // 0x178(0x8)
	class WwiseEvent*                                            StopHealingAudioLoopEvent;                         // 0x180(0x8)
	class ParticleSystem*                                        WeakParticlesTemplate;                             // 0x188(0x8)
	struct FName                                                 HealingShaderParamName;                            // 0x1b0(0x8)
	float                                                        IsNotHealingShaderParamValue;                      // 0x1b8(0x4)
	float                                                        IsHealingShaderParamValue;                         // 0x1bc(0x4)
	float                                                        ShaderParamBlendSpeed;                             // 0x1c0(0x4)
	bool                                                         IsWet;                                             // 0x1c4(0x1)
	bool                                                         IsWeak;                                            // 0x1c5(0x1)
	char                                                         pad0x2_PTXOD[0x2];                                 // 0x1c6(0x2)
	class ParticleSystemComponent*                               HealingParticleSystemComponent;                    // 0x1c8(0x8)
	class ParticleSystemComponent*                               WeakParticleSystemComponent;                       // 0x1d0(0x8)
	class MaterialInstanceDynamic*                               PlantDynamicMaterialInstance;                      // 0x1d8(0x8)
	char                                                         pad0x8_2I3WI[0x8];                                 // 0x1e0(0x8)
};


// Size 0x198 (Full Size[0x2e0] - InheritedSize[0x148]
class ShadowAIFormComponent: public AthenaAIFormComponent
{
public:
	byte                                                         FlameSpecificPhobia;                               // 0x148(0x1)
	char                                                         pad0x7_C18IS[0x7];                                 // 0x149(0x7)
	class ParticleSystem*                                        LightStateConstantParticlesTemplate;               // 0x150(0x8)
	class ParticleSystem*                                        DarkStateConstantParticlesTemplate;                // 0x158(0x8)
	class ParticleSystem*                                        ToLightTransitionParticlesTemplate;                // 0x160(0x8)
	class ParticleSystem*                                        ToDarkTransitionParticlesTemplate;                 // 0x168(0x8)
	class PhysicalMaterial*                                      ClientLightStatePhysMaterialOverride;              // 0x170(0x8)
	class PhysicalMaterial*                                      ClientDarkStatePhysMaterialOverride;               // 0x178(0x8)
	class WwiseEvent*                                            StartDarkStateAudioLoopEvent;                      // 0x180(0x8)
	class WwiseEvent*                                            StopDarkStateAudioLoopEvent;                       // 0x188(0x8)
	TArray<Assetclass ShadowBaseMaterials>                       ShadowBaseMaterials;                               // 0x190(0x10)
	struct FName                                                 ShadowShaderParamName;                             // 0x1a0(0x8)
	float                                                        LightStateShaderParamValue;                        // 0x1a8(0x4)
	float                                                        DarkStateShaderParamValue;                         // 0x1ac(0x4)
	float                                                        ShaderParamBlendSpeed;                             // 0x1b0(0x4)
	struct FName                                                 SeedShaderParamName;                               // 0x1b4(0x8)
	int                                                          MaxSeedShaderValue;                                // 0x1bc(0x4)
	byte                                                         CurrentState;                                      // 0x1c0(0x1)
	char                                                         pad0x7_BMY0D[0x7];                                 // 0x1c1(0x7)
	class ParticleSystemComponent*                               LightStateConstantParticleSystemComponent;         // 0x1c8(0x8)
	class ParticleSystemComponent*                               DarkStateConstantParticleSystemComponent;          // 0x1d0(0x8)
	TArray<class MaterialInstanceDynamic*>                       ShadowDynamicMaterialInstances;                    // 0x1d8(0x10)
	char                                                         pad0x78_DRYVR[0x78];                               // 0x1e8(0x78)
	TArray<struct FlameSpecificDataEntry>                        FlameSpecificDataMap;                              // 0x260(0x10)
	char                                                         pad0x70_DGDIR[0x70];                               // 0x270(0x70)
};


// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class EntitlementDesc: public DataAsset
{
public:
	struct FText                                                 Title;                                             // 0x28(0x38)
	struct FText                                                 Description;                                       // 0x60(0x38)
	struct StringAssetReference                                  IconInvPath;                                       // 0x98(0x10)
	struct StringAssetReference                                  IconPrvPath;                                       // 0xa8(0x10)
	class UClass*                                                Category;                                          // 0xb8(0x8)
	class UClass*                                                Company;                                           // 0xc0(0x8)
};


// Size 0x8 (Full Size[0xd0] - InheritedSize[0xc8]
class ClothingDesc: public EntitlementDesc
{
public:
	struct FName                                                 WardrobeKey;                                       // 0xc8(0x8)
};


// Size 0x30 (Full Size[0xf8] - InheritedSize[0xc8]
class ShipCustomizationDesc: public EntitlementDesc
{
public:
	struct StringAssetReference                                  CustomizationInfo;                                 // 0xc8(0x10)
	struct FString                                               PreviousItem;                                      // 0xd8(0x10)
	struct FString                                               NextItem;                                          // 0xe8(0x10)
};


// Size 0x0 (Full Size[0xc8] - InheritedSize[0xc8]
class TaleRankDesc: public EntitlementDesc
{
public:
};


// Size 0x20 (Full Size[0xf0] - InheritedSize[0xd0]
class TitleDesc: public ClothingDesc
{
public:
	TArray<struct TitleDescIconEntry>                            IconInvPathOverride;                               // 0xd0(0x10)
	TArray<struct TitleDescIconEntry>                            IconPrvPathOverride;                               // 0xe0(0x10)
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class ShantyItemDesc: public EntitlementDesc
{
public:
	struct ShantyData                                            ShantyData;                                        // 0xc8(0x30)
	struct StringAssetReference                                  BackgroundPath;                                    // 0xf8(0x10)
};


// Size 0x0 (Full Size[0xc8] - InheritedSize[0xc8]
class SeasonPassEntitlementDesc: public EntitlementDesc
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class PrimaryItemUsePressedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SecondaryItemUsePressedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class InteractableBase: public Actor
{
public:
	char                                                         pad0x10_0RFZB[0x10];                               // 0x3c8(0x10)
	bool                                                         RequiresFacingFront;                               // 0x3d8(0x1)
	bool                                                         RequiresNotBeingAirborne;                          // 0x3d9(0x1)
	bool                                                         RequiresNotSwimming;                               // 0x3da(0x1)
	bool                                                         InteractionsCanBeDisabled;                         // 0x3db(0x1)
	bool                                                         CanSetInteractionState;                            // 0x3dc(0x1)
	char                                                         pad0x3_062L4[0x3];                                 // 0x3dd(0x3)
	TArray<class InteractionPrerequisiteBase*>                   InteractionPrerequisites;                          // 0x3e0(0x10)
	class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x3f0(0x8)
	byte                                                         InteractableIdentifier;                            // 0x3f8(0x1)
	char                                                         pad0x1_8PXEW[0x1];                                 // 0x3f9(0x1)
	byte                                                         CurrentInteractionState;                           // 0x3fa(0x1)
	char                                                         pad0x5_HV4E0[0x5];                                 // 0x3fb(0x5)
};


// Size 0x110 (Full Size[0x510] - InheritedSize[0x400]
class ControllableObject: public InteractableBase
{
public:
	char                                                         pad0x30_Y9OIU[0x30];                               // 0x400(0x30)
	struct ControlObjectActionRuleParams                         ControlObjectActionRuleParams;                     // 0x430(0x10)
	class PhrasesRadialDataAsset*                                Phrases;                                           // 0x440(0x8)
	bool                                                         AllowDisconnectWhenIdle;                           // 0x448(0x1)
	char                                                         pad0x3_FWELM[0x3];                                 // 0x449(0x3)
	char                                                         pad0xc4_8RILR[0xc4];                               // 0x44c(0xc4)
};


// Size 0x10 (Full Size[0x520] - InheritedSize[0x510]
class ControllablePulley: public ControllableObject
{
public:
	char                                                         pad0x8_FP9TX[0x8];                                 // 0x510(0x8)
	class ControllableIntentComponent*                           IntentComponent;                                   // 0x518(0x8)
};


// Size 0x318 (Full Size[0x838] - InheritedSize[0x520]
class SailManipulator: public ControllablePulley
{
public:
	struct RopeVisualParams                                      RopeVisuals;                                       // 0x520(0xc)
	float                                                        RopeLength;                                        // 0x52c(0x4)
	class StaticMeshComponent*                                   BaseMeshComponent;                                 // 0x530(0x8)
	class StaticMeshComponent*                                   TopMeshComponent;                                  // 0x538(0x8)
	class FixedIntentComponent*                                  CurseIntentComponent;                              // 0x540(0x8)
	class WwiseObjectPoolWrapper*                                ManipulatorAudioPool;                              // 0x548(0x8)
	struct SocketId                                              MastSocketId;                                      // 0x550(0x20)
	class SailManipulatorAudioParams*                            AudioParams;                                       // 0x570(0x8)
	class SceneComponent*                                        MastSocketSceneComponent;                          // 0x578(0x8)
	struct WwiseEmitter                                          AudioEmitter;                                      // 0x580(0x20)
	char                                                         pad0x270_AEE31[0x270];                             // 0x5a0(0x270)
	class Mast*                                                  BoundMast;                                         // 0x810(0x8)
	class Mast*                                                  PendingBoundMast;                                  // 0x818(0x8)
	bool                                                         Locked;                                            // 0x820(0x1)
	char                                                         pad0x7_VX23F[0x7];                                 // 0x821(0x7)
	class MobileInstancedStaticMeshComponent*                    TopMeshInstanceComponent;                          // 0x828(0x8)
	char                                                         pad0x8_GD0TK[0x8];                                 // 0x830(0x8)
};


// Size 0x28 (Full Size[0x860] - InheritedSize[0x838]
class SailHoist: public SailManipulator
{
public:
	char                                                         pad0x8_GRH11[0x8];                                 // 0x838(0x8)
	float                                                        RopeUVSpeed;                                       // 0x840(0x4)
	char                                                         pad0x4_SLIGD[0x4];                                 // 0x844(0x4)
	class RiggingSystemComponent*                                Rigging;                                           // 0x848(0x8)
	int                                                          RiggingRopeIndex;                                  // 0x850(0x4)
	bool                                                         PlayAudio;                                         // 0x854(0x1)
	char                                                         pad0xb_QLHV7[0xb];                                 // 0x855(0xb)
};


// Size 0x608 (Full Size[0x9d0] - InheritedSize[0x3c8]
class Mast: public Actor
{
public:
	char                                                         pad0x48_U2H4L[0x48];                               // 0x3c8(0x48)
	byte                                                         MastType;                                          // 0x410(0x1)
	char                                                         pad0x7_XSZUP[0x7];                                 // 0x411(0x7)
	class MastAudioParams*                                       MastAudioParams;                                   // 0x418(0x8)
	class SceneComponent*                                        SceneRootComponent;                                // 0x420(0x8)
	class IntentCombinerComponent*                               AngleCombinerComponent;                            // 0x428(0x8)
	class IntentCombinerComponent*                               SailHoistIntentCombinerComponent;                  // 0x430(0x8)
	class IntentCombinerComponent*                               MastHoistIntentCombinerComponent;                  // 0x438(0x8)
	class SceneComponent*                                        MastMovingAttachComponent;                         // 0x440(0x8)
	class SceneComponent*                                        SailAnglePivotComponent;                           // 0x448(0x8)
	class ReplicatedShipPartCustomizationComponent*              CustomizationComponent;                            // 0x450(0x8)
	class RepairableComponent*                                   RepairableComponentFirst;                          // 0x458(0x8)
	class RepairableComponent*                                   RepairableComponentSecond;                         // 0x460(0x8)
	class RepairableComponent*                                   RepairableComponentThird;                          // 0x468(0x8)
	class ShipDamageableComponent*                               DamageableComponent;                               // 0x470(0x8)
	class MastFlammableComponent*                                MastFlammableComponent;                            // 0x478(0x8)
	float                                                        AngleBlend;                                        // 0x480(0x4)
	float                                                        LoweredBlend;                                      // 0x484(0x4)
	float                                                        LoweringSpeed;                                     // 0x488(0x4)
	float                                                        RaisingSpeed;                                      // 0x48c(0x4)
	float                                                        TurnSpeed;                                         // 0x490(0x4)
	float                                                        MaxTurnAngle;                                      // 0x494(0x4)
	float                                                        SailOffsetFromMast;                                // 0x498(0x4)
	float                                                        SailWidth;                                         // 0x49c(0x4)
	float                                                        SailHeight;                                        // 0x4a0(0x4)
	float                                                        SailStartOffset;                                   // 0x4a4(0x4)
	struct Vector                                                LookAtPosLow;                                      // 0x4a8(0xc)
	struct Vector                                                LookAtPosHigh;                                     // 0x4b4(0xc)
	class WwiseObjectPoolWrapper*                                SailAudioPool;                                     // 0x4c0(0x8)
	class WwiseEvent*                                            AmbientSailFlapsSfx;                               // 0x4c8(0x8)
	class WwiseEvent*                                            AmbientSailFlapsStopSfx;                           // 0x4d0(0x8)
	class WwiseEvent*                                            PerfectSailInflationOneShot;                       // 0x4d8(0x8)
	class WwiseEvent*                                            SailLostPerfectWindOneShot;                        // 0x4e0(0x8)
	struct FName                                                 InflationRTPC;                                     // 0x4e8(0x8)
	struct FName                                                 SailLengthRTPC;                                    // 0x4f0(0x8)
	float                                                        ClientSailBlendSpeed;                              // 0x4f8(0x4)
	char                                                         pad0x4_UGPE6[0x4];                                 // 0x4fc(0x4)
	TArray<class StaticMeshComponent*>                           YardArms;                                          // 0x500(0x10)
	struct FName                                                 TelemetryIdentifier;                               // 0x510(0x8)
	bool                                                         MastShouldBeFractured;                             // 0x518(0x1)
	char                                                         pad0x3_92TI2[0x3];                                 // 0x519(0x3)
	struct MastCollisionProfiles                                 MastCollisionProfiles;                             // 0x51c(0x28)
	char                                                         pad0x4_05GYH[0x4];                                 // 0x544(0x4)
	struct MastPhysicsComponents                                 MastPhysicsComponents;                             // 0x548(0x38)
	class StaticMesh*                                            MastIntactMesh;                                    // 0x580(0x8)
	class StaticMesh*                                            MastFractureMeshBottom;                            // 0x588(0x8)
	float                                                        MastFractureMeshBottomScale;                       // 0x590(0x4)
	float                                                        MastFractureMeshOriginalScale;                     // 0x594(0x4)
	class StaticMesh*                                            MastFractureMeshTop;                               // 0x598(0x8)
	class ParticleSystem*                                        DamageParticleSystem;                              // 0x5a0(0x8)
	float                                                        HingeHeight;                                       // 0x5a8(0x4)
	float                                                        HingeDistanceFromCentre;                           // 0x5ac(0x4)
	float                                                        HingeDirectionAngle;                               // 0x5b0(0x4)
	float                                                        MaxFallAngle;                                      // 0x5b4(0x4)
	float                                                        MastLiftingSpeed;                                  // 0x5b8(0x4)
	bool                                                         OverrideSailLengthWhenFalling;                     // 0x5bc(0x1)
	char                                                         pad0x3_IR06B[0x3];                                 // 0x5bd(0x3)
	float                                                        MaxFallenSailLength;                               // 0x5c0(0x4)
	float                                                        SailFoldingSpeed;                                  // 0x5c4(0x4)
	bool                                                         OverrideSailAngleWhenFalling;                      // 0x5c8(0x1)
	char                                                         pad0x3_NRBW5[0x3];                                 // 0x5c9(0x3)
	float                                                        DesiredFallingSailAngle;                           // 0x5cc(0x4)
	float                                                        SailTwistingSpeed;                                 // 0x5d0(0x4)
	char                                                         pad0x4_LR3C3[0x4];                                 // 0x5d4(0x4)
	class MastHinge*                                             Hinge;                                             // 0x5d8(0x8)
	struct WeightedProbabilityRangeOfRanges                      MastImpactForceToApplyToShip;                      // 0x5e0(0x30)
	float                                                        MastImpactForceModifierToApplyToKrakenWrappedShip; // 0x610(0x4)
	float                                                        MastImpactHeightLocation;                          // 0x614(0x4)
	class UClass*                                                CameraShake;                                       // 0x618(0x8)
	float                                                        CameraShakeInnerRadius;                            // 0x620(0x4)
	float                                                        CameraShakeOuterRadius;                            // 0x624(0x4)
	bool                                                         PreviewMastFallenPosition;                         // 0x628(0x1)
	char                                                         pad0x7_7YQFT[0x7];                                 // 0x629(0x7)
	TArray<class RepairableComponent*>                           RepairableComponents;                              // 0x630(0x10)
	struct MastDamageAudioParams                                 DamageAudioParameters;                             // 0x640(0xb0)
	char                                                         pad0x8_OQSEH[0x8];                                 // 0x6f0(0x8)
	class TetherCustomisationComponent*                          TetherCustomisationComponent;                      // 0x6f8(0x8)
	char                                                         pad0xa0_MZLN2[0xa0];                               // 0x700(0xa0)
	TArray<class ChildActorComponent*>                           LinkedSails;                                       // 0x7a0(0x10)
	struct IntentPredictor                                       LengthIntentPredictor;                             // 0x7b0(0x1c)
	struct IntentPredictor                                       AngleIntentPredictor;                              // 0x7cc(0x1c)
	struct IntentPredictor                                       MastHoistIntentPredictor;                          // 0x7e8(0x1c)
	bool                                                         MastHoistingControlSchemeActive;                   // 0x804(0x1)
	char                                                         pad0x3_U9CT3[0x3];                                 // 0x805(0x3)
	struct ObjectMessagingHandle                                 SailGotPerfectWindEventHandle;                     // 0x808(0x58)
	struct ObjectMessagingHandle                                 SailLostPerfectWindEventHandle;                    // 0x860(0x58)
	struct ObjectMessagingHandle                                 MastRepairStoppedHandle;                           // 0x8b8(0x58)
	char                                                         pad0x10_ANQCK[0x10];                               // 0x910(0x10)
	struct WwiseEmitter                                          SailsAudioEmitter;                                 // 0x920(0x20)
	float                                                        ServerAngleRatio;                                  // 0x940(0x4)
	float                                                        ServerLoweredProportion;                           // 0x944(0x4)
	byte                                                         ForceBillowingState;                               // 0x948(0x1)
	char                                                         pad0x3_Z0LEW[0x3];                                 // 0x949(0x3)
	float                                                        ServerMastFallingProportion;                       // 0x94c(0x4)
	char                                                         pad0x1c_64XX0[0x1c];                               // 0x950(0x1c)
	bool                                                         AllowedToFall;                                     // 0x96c(0x1)
	bool                                                         PlayAudio;                                         // 0x96d(0x1)
	char                                                         pad0x3a_MKIZL[0x3a];                               // 0x96e(0x3a)
	bool                                                         IsCursed;                                          // 0x9a8(0x1)
	char                                                         pad0x27_YQFLQ[0x27];                               // 0x9a9(0x27)
};


// Size 0x30 (Full Size[0x868] - InheritedSize[0x838]
class SailAngle: public SailManipulator
{
public:
	char                                                         pad0x8_AEKZL[0x8];                                 // 0x838(0x8)
	float                                                        RopeUVSpeed;                                       // 0x840(0x4)
	char                                                         pad0x4_46ETF[0x4];                                 // 0x844(0x4)
	class RiggingSystemComponent*                                Rigging;                                           // 0x848(0x8)
	int                                                          RiggingLeftRopeIndex;                              // 0x850(0x4)
	int                                                          RiggingRightRopeIndex;                             // 0x854(0x4)
	bool                                                         PlayAudio;                                         // 0x858(0x1)
	char                                                         pad0xf_HGN2T[0xf];                                 // 0x859(0xf)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class PrimaryItemUseReleasedNotificationInputId: public PrimaryItemUsePressedNotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SecondaryItemUseReleasedNotificationInputId: public SecondaryItemUsePressedNotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class PrimaryInteractNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class InteractOrDisengageNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SecondaryInteractNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class CompositeQuickSwitchWeaponSecondaryInteractNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventType: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SkellyFortGameEventTypeBase: public GameEventType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SkellyFortGameEventType: public SkellyFortGameEventTypeBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SkellyFort2022GameEventType: public SkellyFortGameEventType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AggressiveGhostShipsEncounterGameEventType: public GameEventType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AshenLordEncounterGameEventType: public GameEventType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIShipBattleGameEventType: public GameEventType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SeaFortGameEventType: public GameEventType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SunkenKingdomTreasuryGameEventType: public GameEventType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SunkenKingdomShrineGameEventType: public GameEventType
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SecondaryInteractReleasedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class PrimaryInteractReleasedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AbsorbsLiquidInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class AbsorbsLiquidComponent: public ActorComponent
{
public:
	char                                                         pad0x10_83N8H[0x10];                               // 0xc8(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AchievementDefinitionDataAsset: public DataAsset
{
public:
	TArray<struct AchievementDefinition>                         AchievementDefintions;                             // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ActionRulesBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class ActionRuleTestActor: public Actor
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RadialContextBase: public Object
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ActionStateRadialContext: public RadialContextBase
{
public:
	TArray<class Class*>                                         TargetActionStates;                                // 0x28(0x10)
	bool                                                         AreDockablePhrasesRequired;                        // 0x38(0x1)
	char                                                         pad0x7_IGDQU[0x7];                                 // 0x39(0x7)
};


// Size 0xa8 (Full Size[0x3f0] - InheritedSize[0x348]
class ActorCoherentViewComponent: public CoherentUIGTComponent
{
public:
	char                                                         pad0xa0_QC6G3[0xa0];                               // 0x348(0xa0)
	struct FName                                                 TargetPrimitiveName;                               // 0x3e8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ActorRelevancyTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AddFogBankAvoidanceAreaStep: public TaleQuestStep
{
public:
};


// Size 0x20 (Full Size[0x3e8] - InheritedSize[0x3c8]
class FogBankManager: public Actor
{
public:
	TArray<struct FeatureToggledFogBankManagerAsset>             FeatureToggledManagerAssetsArray;                  // 0x3c8(0x10)
	class FogBankManagerDataAsset*                               DefaultFogBankManagerDataAsset;                    // 0x3d8(0x8)
	class FogBankManagerDataAsset*                               ActiveFogBankManagerDataAsset;                     // 0x3e0(0x8)
};


// Size 0x18 (Full Size[0x78] - InheritedSize[0x60]
class FogBankTaleService: public TaleQuestService
{
public:
	class FogBankTaleServiceDesc*                                Desc;                                              // 0x60(0x8)
	TArray<struct FogBankManagerFogAvoidanceArea>                FogBankAvoidanceAreas;                             // 0x68(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FogBankTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class AddFogBankAvoidanceAreaStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableVector                                   Location;                                          // 0x80(0x30)
	struct QuestVariableFloat                                    Radius;                                            // 0xb0(0x30)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class AddMechanismTriggerStep: public TaleQuestStep
{
public:
	class AddMechanismTriggerStepDesc*                           Desc;                                              // 0x98(0x8)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class AddMechanismTriggerStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    Action;                                            // 0x80(0x30)
	struct QuestVariableActor                                    Trigger;                                           // 0xb0(0x30)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class AddOpenContainerActionRuleComponent: public ActorComponent
{
public:
	class UClass*                                                NotificationInputId;                               // 0xc8(0x8)
	byte                                                         DisplayPriority;                                   // 0xd0(0x1)
	char                                                         pad0x7_J07UJ[0x7];                                 // 0xd1(0x7)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class AddReloadAmmoActionRuleComponent: public ActorComponent
{
public:
	class UClass*                                                NotificationInputId;                               // 0xc8(0x8)
	byte                                                         DisplayPriority;                                   // 0xd0(0x1)
	char                                                         pad0x7_X1TME[0x7];                                 // 0xd1(0x7)
};


// Size 0x100 (Full Size[0x4c8] - InheritedSize[0x3c8]
class AdjustableWaterLevelPuzzle: public Actor
{
public:
	char                                                         pad0x8_6TWJT[0x8];                                 // 0x3c8(0x8)
	class SceneComponent*                                        RootComp;                                          // 0x3d0(0x8)
	class ChildActorComponent*                                   WaterVolumeComponent;                              // 0x3d8(0x8)
	class VariableFillRateWaterVolume*                           WaterVolumeActor;                                  // 0x3e0(0x8)
	TArray<struct WaterPuzzleWaterLevel>                         WaterLevels;                                       // 0x3e8(0x10)
	int                                                          DefaultWaterLevelIndex;                            // 0x3f8(0x4)
	char                                                         pad0x4_13FY7[0x4];                                 // 0x3fc(0x4)
	class CurveFloat*                                            FillCurve;                                         // 0x400(0x8)
	class CurveFloat*                                            DrainCurve;                                        // 0x408(0x8)
	class CurveFloat*                                            ResetCurve;                                        // 0x410(0x8)
	float                                                        PuzzleResetTimeout;                                // 0x418(0x4)
	struct WaterPuzzleRepData                                    ReppedData;                                        // 0x41c(0x8)
	char                                                         pad0xa4_M0WNG[0xa4];                               // 0x424(0xa4)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AdjustableWaterLevelPuzzleAudioParams: public DataAsset
{
public:
	class WwiseObjectPoolWrapper*                                WaterLevelPuzzlePool;                              // 0x28(0x8)
	class WwiseEvent*                                            PuzzleWaterRiseStartEvent;                         // 0x30(0x8)
	class WwiseEvent*                                            PuzzleWaterRiseEndEvent;                           // 0x38(0x8)
	class WwiseEvent*                                            PuzzleWaterFallStartEvent;                         // 0x40(0x8)
	class WwiseEvent*                                            PuzzleWaterFallEndEvent;                           // 0x48(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class QuestBookPageBundle: public DataAsset
{
public:
	TArray<struct StringAssetReference>                          Pages;                                             // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AdventuresActorBundleAsset: public DataAsset
{
public:
	TArray<struct AdventuresActorBundleInfo>                     Contents;                                          // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AdventuresBundleListingAsset: public DataAsset
{
public:
	TArray<struct StringAssetReference>                          Pages;                                             // 0x28(0x10)
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class AdventuresActorBundleTaleFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AdventureSettings: public DeveloperSettings
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AgitatedAIStrategyId: public AIStrategyId
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class AIBuffStatus: public StatusBase
{
public:
};


// Size 0x18 (Full Size[0x528] - InheritedSize[0x510]
class AIDockableObject: public ControllableObject
{
public:
	char                                                         pad0x8_Q5CBM[0x8];                                 // 0x510(0x8)
	class UClass*                                                InteractableType;                                  // 0x518(0x8)
	float                                                        InteractableOffset;                                // 0x520(0x4)
	char                                                         pad0x4_KSFMI[0x4];                                 // 0x524(0x4)
};


// Size 0x0 (Full Size[0x528] - InheritedSize[0x528]
class AIDockableWheel: public AIDockableObject
{
public:
};


// Size 0x10 (Full Size[0x5b8] - InheritedSize[0x5a8]
class AIEmergentCaptainSpawner: public AIPerCrewSpawner
{
public:
	char                                                         pad0x8_LC93F[0x8];                                 // 0x5a8(0x8)
	class NamedAIDataAsset*                                      NamedAIDataAsset;                                  // 0x5b0(0x8)
};


// Size 0x18 (Full Size[0x160] - InheritedSize[0x148]
class AIFormWithVFXComponent: public AthenaAIFormComponent
{
public:
	class ParticleSystem*                                        ParticlesTemplate;                                 // 0x148(0x8)
	class ParticleSystemComponent*                               ParticleSystemComponent;                           // 0x150(0x8)
	float                                                        ParticleActivationDelay;                           // 0x158(0x4)
	struct TimerHandle                                           ActivationTimerHandle;                             // 0x15c(0x4)
};


// Size 0x10 (Full Size[0xa0] - InheritedSize[0x90]
class AIFormWithVFXDataAsset: public AthenaAIFormDataAsset
{
public:
	class ParticleSystem*                                        ParticlesTemplate;                                 // 0x90(0x8)
	float                                                        ParticleActivationDelay;                           // 0x98(0x4)
	char                                                         pad0x4_ZMK79[0x4];                                 // 0x9c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIKnockbackActionStateId: public ActionStateId
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class LoadoutAsset: public DataAsset
{
public:
	struct ItemLoadout                                           ItemLoadout;                                       // 0x28(0x20)
	struct FName                                                 FeatureName;                                       // 0x48(0x8)
};


// Size 0x10 (Full Size[0x60] - InheritedSize[0x50]
class AILoadoutWithNonStoreableAsset: public LoadoutAsset
{
public:
	char                                                         pad0x8_JFHK3[0x8];                                 // 0x50(0x8)
	class UClass*                                                NonStoreableItem;                                  // 0x58(0x8)
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class AimSensitivityComponent: public ActorComponent
{
public:
	char                                                         pad0x40_02W4L[0x40];                               // 0xc8(0x40)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AimWeaponPressedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AimWeaponReleasedNotificationInputId: public AimWeaponPressedNotificationInputId
{
public:
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class AIOnShipManagerComponent: public ActorComponent
{
public:
	char                                                         pad0x8_L89GV[0x8];                                 // 0xc8(0x8)
	class AIProximityPlayerTracker*                              AIProximityPlayerTracker;                          // 0xd0(0x8)
	TArray<class AIFixedWavesSpawner*>                           AIOnShipAIFixedWavesSpawners;                      // 0xd8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ProjectileWeaponFiringIntentionInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0x100] - InheritedSize[0xc8]
class AIProjectileWeaponFiringIntentionComponent: public ActorComponent
{
public:
	char                                                         pad0x8_MSSKU[0x8];                                 // 0xc8(0x8)
	class Pawn*                                                  PawnOwner;                                         // 0xd0(0x8)
	class AthenaAIControllerBase*                                AIController;                                      // 0xd8(0x8)
	char                                                         pad0x1c_KB5AI[0x1c];                               // 0xe0(0x1c)
	float                                                        DefaultHitChance;                                  // 0xfc(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIQuickDeathInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIShipCaptainActionStateId: public ActionStateId
{
public:
};


// Size 0x190 (Full Size[0x470] - InheritedSize[0x2e0]
class ItemSpawnComponent: public SceneComponent
{
public:
	bool                                                         SpawnOnStart;                                      // 0x2e0(0x1)
	char                                                         pad0x7_SBJ7T[0x7];                                 // 0x2e1(0x7)
	struct ItemSpawnParams                                       SpawnParams;                                       // 0x2e8(0x38)
	TArray<struct ItemSpawnParams>                               SpawnParamOverrides;                               // 0x320(0x10)
	class WeightedItemDescSpawnDataAsset*                        ReferencedSpawnDistributionAsset;                  // 0x330(0x8)
	TArray<struct ItemSpawnDistributionAssets>                   ReferencedSpawnDistributionAssetOverrides;         // 0x338(0x10)
	TArray<struct ItemSpawnTransform>                            SpawnTransforms;                                   // 0x348(0x10)
	TArray<struct ItemSpawnTransformWithRandomQuantity>          SpawnTransformsWithRandomQuantities;               // 0x358(0x10)
	struct FName                                                 FeatureToggle;                                     // 0x368(0x8)
	bool                                                         InvertFeatureToggle;                               // 0x370(0x1)
	byte                                                         SpawnSource;                                       // 0x371(0x1)
	char                                                         pad0x2_BS4UE[0x2];                                 // 0x372(0x2)
	float                                                        SpawnRate;                                         // 0x374(0x4)
	bool                                                         DestroyProxiesOnEndPlay;                           // 0x378(0x1)
	bool                                                         SpawnWithPhysicsEnabled;                           // 0x379(0x1)
	bool                                                         DoNotAttachToOwnerWhenSpawned;                     // 0x37a(0x1)
	bool                                                         DropItemsOnSpawn;                                  // 0x37b(0x1)
	bool                                                         DropItemsUsingPriorityAIDropParams;                // 0x37c(0x1)
	char                                                         pad0x3_P3YSS[0x3];                                 // 0x37d(0x3)
	TArray<struct SpawnInstance>                                 SpawnList;                                         // 0x380(0x10)
	TArray<struct SpawnInstance>                                 SingleItemInstances;                               // 0x390(0x10)
	TArray<struct SpawnedItem>                                   SpawnedItems;                                      // 0x3a0(0x10)
	char                                                         pad0xc0_CWKXM[0xc0];                               // 0x3b0(0xc0)
};


// Size 0x70 (Full Size[0x4e0] - InheritedSize[0x470]
class AIShipItemSpawnComponent: public ItemSpawnComponent
{
public:
	bool                                                         SpawnForBattleFinalShip;                           // 0x470(0x1)
	char                                                         pad0x6f_UR0F5[0x6f];                               // 0x471(0x6f)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EmotesInterface: public Interface
{
public:
};


// Size 0xb8 (Full Size[0x180] - InheritedSize[0xc8]
class LookAtOffsetComponent: public ActorComponent
{
public:
	char                                                         pad0xb8_A7COR[0xb8];                               // 0xc8(0xb8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterMeshInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterInterface: public CharacterMeshInterface
{
public:
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class FireSettingsDataAsset: public DataAsset
{
public:
	float                                                        CharacterOnFireEffectRadius;                       // 0x28(0x4)
	byte                                                         TraceChannel;                                      // 0x2c(0x1)
	char                                                         pad0x3_NPE18[0x3];                                 // 0x2d(0x3)
	float                                                        CharacterToCharacterPropagationInterval;           // 0x30(0x4)
	float                                                        MaxInitialPropagationOffset;                       // 0x34(0x4)
	struct Status                                                BurnStatus;                                        // 0x38(0x18)
	struct Status                                                FirePropagationStatus;                             // 0x50(0x18)
	char                                                         pad0x8_T9IO0[0x8];                                 // 0x68(0x8)
};


// Size 0xd0 (Full Size[0x2c0] - InheritedSize[0x1f0]
class CharacterFlammableComponent: public ActorFlammableComponent
{
public:
	char                                                         pad0x30_5PGOP[0x30];                               // 0x1f0(0x30)
	float                                                        FireFalloffDuration;                               // 0x220(0x4)
	float                                                        FireRateOfFalloffInRain;                           // 0x224(0x4)
	float                                                        FireFalloffMultiplier;                             // 0x228(0x4)
	struct FName                                                 VfxSocketName;                                     // 0x22c(0x8)
	char                                                         pad0xc_FXGAG[0xc];                                 // 0x234(0xc)
	struct Transform                                             SocketRelativeOffset;                              // 0x240(0x30)
	char                                                         pad0x8_XWTPE[0x8];                                 // 0x270(0x8)
	class FireSettingsDataAsset*                                 FireSettingsAsset;                                 // 0x278(0x8)
	char                                                         pad0x40_YYLDP[0x40];                               // 0x280(0x40)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterFootImpactMeshInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ObscuredVisionInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayerPrivilegeInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PirateDescInterface: public Interface
{
public:
};


// Size 0x660 (Full Size[0xc40] - InheritedSize[0x5e0]
class AthenaCharacter: public Character
{
public:
	char                                                         pad0x128_OHH3K[0x128];                             // 0x5e0(0x128)
	class LookAtOffsetComponent*                                 LookAtOffsetComponent;                             // 0x708(0x8)
	class AnimationDataStoreAsset*                               AnimationDataStoreAsset;                           // 0x710(0x8)
	class AthenaAnimationSittingDataAsset*                       SittingAnimationDataAssets;                        // 0x718(0x8)
	class AthenaCharacterMovementComponent*                      AthenaCharacterMovementComponent;                  // 0x720(0x8)
	class CollidableCharacterComponent*                          CollidableCharacterComponent;                      // 0x728(0x8)
	struct Docker                                                Docker;                                            // 0x730(0x90)
	class ActionStateMachineComponent*                           ActionStateMachineComponent;                       // 0x7c0(0x8)
	class ActionStatePriorityTableData*                          ActionStatePriorityTableData;                      // 0x7c8(0x8)
	class UClass*                                                ActionStateCreatorDefinition;                      // 0x7d0(0x8)
	struct ObjectMessagingDispatcher                             ObjectMessageDispatcher;                           // 0x7d8(0xa0)
	class WieldableItemSetComponent*                             WieldableItemSetComponent;                         // 0x878(0x8)
	class WieldedItemComponent*                                  WieldedItemComponent;                              // 0x880(0x8)
	class SceneComponent*                                        MeshAdjustmentComponent;                           // 0x888(0x8)
	class InventoryManipulatorComponent*                         InventoryManipulatorComponent;                     // 0x890(0x8)
	class LoadoutComponent*                                      LoadoutComponent;                                  // 0x898(0x8)
	class ItemLoadoutComponent*                                  ItemLoadoutComponent;                              // 0x8a0(0x8)
	class HealthComponent*                                       HealthComponent;                                   // 0x8a8(0x8)
	class AthenaCharacterStateManagerComponent*                  StateManagerComponent;                             // 0x8b0(0x8)
	class RewindComponent*                                       RewindComponent;                                   // 0x8b8(0x8)
	class ActorDamageableComponent*                              ActorDamageableComponent;                          // 0x8c0(0x8)
	class CharacterHitReactionComponent*                         CharacterHitReactionComponent;                     // 0x8c8(0x8)
	class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitterComponent;                   // 0x8d0(0x8)
	class MeleeAttackProcessorComponent*                         MeleeAttackProcessor;                              // 0x8d8(0x8)
	class HitDetectionComponent*                                 HitDetectionComponent;                             // 0x8e0(0x8)
	class AthenaCharacterKnockbackComponent*                     KnockBackComponent;                                // 0x8e8(0x8)
	class AthenaCharacterDodgeComponent*                         DodgeComponent;                                    // 0x8f0(0x8)
	class CharacterAINoiseEventComponent*                        CharacterAINoiseEventComponent;                    // 0x8f8(0x8)
	class ActionRulesComponent*                                  PrivateActionRulesComponent;                       // 0x900(0x8)
	class ShipTrackerComponent*                                  ShipTrackerComponent;                              // 0x908(0x8)
	class WatercraftTrackerComponent*                            WatercraftTrackerComponent;                        // 0x910(0x8)
	class ItemLoaderComponent*                                   ItemLoaderComponent;                               // 0x918(0x8)
	class RetractableCharacterComponent*                         RetractableCharacterComponent;                     // 0x920(0x8)
	class ResourceProviderComponent*                             ResourceProviderComponent;                         // 0x928(0x8)
	class CharacterFlammableComponent*                           CharacterFlammableComponent;                       // 0x930(0x8)
	class SoakableComponent*                                     SoakableComponent;                                 // 0x938(0x8)
	class WaterExposureComponent*                                WaterExposureComponent;                            // 0x940(0x8)
	class ShelteredComponent*                                    ShelteredComponent;                                // 0x948(0x8)
	class BoxedRpcDispatcherComponent*                           BoxedRpcDispatcherComponent;                       // 0x950(0x8)
	class CosmeticItemAnimationComponent*                        CosmeticItemAnimationComponent;                    // 0x958(0x8)
	class InteractionPreventionComponent*                        InteractionPreventionComponent;                    // 0x960(0x8)
	class DeathCustomisationComponent*                           DeathCustomisation;                                // 0x968(0x8)
	class MovementInterferenceComponent*                         InterferenceComponent;                             // 0x990(0x8)
	class WaterInteractionComponent*                             WaterInteractionComponent;                         // 0x998(0x8)
	class UClass*                                                ThirdPersonAnimSetDataId;                          // 0x9a0(0x8)
	bool                                                         OverrideEncroachesBlockingGeometry;                // 0x9a8(0x1)
	byte                                                         OverrideEncroachesBlockingGeometryChannel;         // 0x9a9(0x1)
	char                                                         pad0x2_XZFLB[0x2];                                 // 0x9aa(0x2)
	struct FName                                                 OverrideFloorSweepCollisionProfileName;            // 0x9ac(0x8)
	char                                                         pad0x20_EV9DX[0x20];                               // 0x9b4(0x20)
	float                                                        MovementThresholdToRecordRewindTransform;          // 0x9d4(0x4)
	char                                                         pad0xc_K7VS6[0xc];                                 // 0x9d8(0xc)
	int                                                          SpawnAnimIndex;                                    // 0x9e4(0x4)
	char                                                         pad0x70_I0LKT[0x70];                               // 0x9e8(0x70)
	class AnimationDataStore*                                    AnimationDataStore;                                // 0xa58(0x8)
	char                                                         pad0x58_WNVBN[0x58];                               // 0xa60(0x58)
	class PlayerState*                                           OldPlayerState;                                    // 0xab8(0x8)
	char                                                         pad0x3c_FFRU0[0x3c];                               // 0xac0(0x3c)
	float                                                        RelativeTargetYawOnMovingBase;                     // 0xafc(0x4)
	char                                                         pad0x30_PLVAL[0x30];                               // 0xb00(0x30)
	float                                                        SmoothYawOnMovingBaseTime;                         // 0xb30(0x4)
	int                                                          RandomAnimationSeed;                               // 0xb34(0x4)
	char                                                         pad0x8_7741T[0x8];                                 // 0xb38(0x8)
	bool                                                         RandomBool;                                        // 0xb40(0x1)
	char                                                         pad0x27_JPJDT[0x27];                               // 0xb41(0x27)
	class SkeletalMeshSocket*                                    CameraSocket;                                      // 0xb68(0x8)
	char                                                         pad0x48_7N68R[0x48];                               // 0xb70(0x48)
	TArray<class InputComponent*>                                RegisteredInputComponents;                         // 0xbb8(0x10)
	char                                                         pad0x78_41CAH[0x78];                               // 0xbc8(0x78)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BriggableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SwimAttackableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayerManagerServiceInterface: public Interface
{
public:
};


// Size 0x1390 (Full Size[0x1fd0] - InheritedSize[0xc40]
class AthenaPlayerCharacter: public AthenaCharacter
{
public:
	char                                                         pad0x150_H42PR[0x150];                             // 0xc40(0x150)
	class SceneComponent*                                        FirstPersonMeshOffsetComponent;                    // 0xd90(0x8)
	class SkeletalMeshComponent*                                 FirstPersonMesh;                                   // 0xd98(0x8)
	class AthenaCameraComponent*                                 FirstPersonCamera;                                 // 0xda0(0x8)
	TArray<class ParticleSystemComponent*>                       FirstPersonParticleComponents;                     // 0xda8(0x10)
	class AthenaCameraComponent*                                 ThirdPersonCamera;                                 // 0xdb8(0x8)
	TArray<class ParticleSystemComponent*>                       ThirdPersonParticleComponents;                     // 0xdc0(0x10)
	class AthenaCameraComponent*                                 SpringArmCamera;                                   // 0xdd0(0x8)
	class LookAtEmoteCameraComponent*                            LookAtEmoteCameraComponent;                        // 0xdd8(0x8)
	class AthenaSpringArmComponent*                              SpringArm;                                         // 0xde0(0x8)
	class ChildActorComponent*                                   LocalCloudDome;                                    // 0xde8(0x8)
	class CharacterInteractionComponent*                         InteractionComponent;                              // 0xdf0(0x8)
	class ClimbingComponent*                                     ClimbingComponent;                                 // 0xdf8(0x8)
	class DrunkennessComponent*                                  DrunkennessComponent;                              // 0xe00(0x8)
	class StaggerComponent*                                      StaggerComponent;                                  // 0xe08(0x8)
	class DrowningComponent*                                     DrowningComponent;                                 // 0xe10(0x8)
	class RumbleHandlerComponent*                                RumbleHandlerComponent;                            // 0xe18(0x8)
	class ScreenSpaceVfxComponent*                               ScreenSpaceVfxComponent;                           // 0xe20(0x8)
	class TreasureMapCollectionComponent*                        TreasureMapCollectionComponent;                    // 0xe28(0x8)
	class PhrasesRadialComponent*                                PhrasesRadialComponent;                            // 0xe30(0x8)
	class QuickInventoryComponent*                               QuickInventoryComponent;                           // 0xe38(0x8)
	class PointOfInterestTrackerComponent*                       PointOfInterestTrackerComponent;                   // 0xe40(0x8)
	class ProjectileWeaponQSDebugComponent*                      ProjectileWeaponQSDebugComponent;                  // 0xe48(0x8)
	class LimpingComponent*                                      LimpingComponent;                                  // 0xe50(0x8)
	class PacingComponent*                                       PacingComponent;                                   // 0xe58(0x8)
	class BurpComponent*                                         BurpComponent;                                     // 0xe60(0x8)
	class MeleeAttackLockOnComponent*                            MeleeLockOnComponent;                              // 0xe68(0x8)
	class DeathSelfInteractionComponent*                         DeathSelfInteractionComponent;                     // 0xe70(0x8)
	class RidePlayerComponent*                                   RidePlayerComponent;                               // 0xe78(0x8)
	class ReviveDebugComponent*                                  ReviveDebugComponent;                              // 0xe80(0x8)
	class FlashbangEffectComponent*                              FlashbangEffectComponent;                          // 0xe88(0x8)
	class BalancingComponent*                                    BalancingComponent;                                // 0xe90(0x8)
	class WorldLocationVisitorComponent*                         WorldLocationVisitorComponent;                     // 0xe98(0x8)
	class MeleeAttackLockOnComponentSettings*                    MeleeAttackLockOnSettings;                         // 0xea0(0x8)
	class StatusEffectManagerComponent*                          StatusEffectManagerComponent;                      // 0xea8(0x8)
	class StatusEffectPersistenceComponent*                      StatusEffectPersistenceComponent;                  // 0xeb0(0x8)
	class PlayerCurseComponent*                                  PlayerCurseComponent;                              // 0xeb8(0x8)
	class MaterialStatusSusceptibilityComponent*                 MaterialStatusSusceptibilityComponent;             // 0xec0(0x8)
	class HealthRegenerationPoolComponent*                       HealthRegenerationPoolComponent;                   // 0xec8(0x8)
	class SicknessComponent*                                     SicknessComponent;                                 // 0xed0(0x8)
	class RewindComponent*                                       PlayerViewRewindComponent;                         // 0xed8(0x8)
	class CapsuleComponent*                                      ProjectileTraceHitVolume;                          // 0xee0(0x8)
	class PlayerMerchantContractsComponent*                      PlayerMerchantContractsComponent;                  // 0xee8(0x8)
	class PlayerShroudBreakerTrackerComponent*                   PlayerShroudBreakerTrackerComponent;               // 0xef0(0x8)
	class PetOwnerComponent*                                     PetOwnerComponent;                                 // 0xef8(0x8)
	class AISpawnContextContainerComponent*                      SpawnContextContainerComponent;                    // 0xf00(0x8)
	class RadialManagerComponent*                                RadialManager;                                     // 0xf08(0x8)
	class StreamingLocationComponent*                            StreamingLocationComponent;                        // 0xf10(0x8)
	class EquipClothingComponent*                                EquipClothingComponent;                            // 0xf18(0x8)
	class GenericStatusVFXComponent*                             GenericStatusVFXComponent;                         // 0xf20(0x8)
	float                                                        CameraFOVWhenSprinting;                            // 0xf28(0x4)
	char                                                         pad0x4_80WA7[0x4];                                 // 0xf2c(0x4)
	class CurveVector*                                           ApproximateCamPitchToLocalCamOffsetCurve;          // 0xf30(0x8)
	struct WalkConditionsParams                                  WalkConditionParams;                               // 0xf38(0x8)
	struct SprintConditionsParams                                ServerSprintConditionParams;                       // 0xf40(0xc)
	struct SprintConditionsParams                                ClientSprintConditionParams;                       // 0xf4c(0xc)
	float                                                        SprintingServerTimeTolerance;                      // 0xf58(0x4)
	float                                                        PostSprintResetTime;                               // 0xf5c(0x4)
	class AthenaSpringArmComponentParams*                        EmoteSpringArmParameters;                          // 0xf60(0x8)
	class AthenaSpringArmComponentParams*                        DeathSpringArmParameters;                          // 0xf68(0x8)
	class EmotesRadialDataAsset*                                 EmotesRadialDataAsset;                             // 0xf70(0x8)
	bool                                                         AllowAnimationTickAggregation;                     // 0xf78(0x1)
	char                                                         pad0x3_2NVTC[0x3];                                 // 0xf79(0x3)
	struct AchievementKillOpponentFromBehindWithBlunderbuss      AchievementKillOpponentFromBehindWithBlunderbuss;  // 0xf7c(0x4)
	struct AchievementHeavyAttackRivalOffTheirShip               AchievementHeavyAttackRivalOffTheirShip;           // 0xf80(0x10)
	struct AchievementBlockThenHitAndGetBlockedThenTakeHit       AchievementBlockThenHitAndGetBlockedThenTakeHit;   // 0xf90(0x10)
	struct AchievementHaveADrinkWithAnotherCrewAtAnOutpost       AchievementHaveADrinkWithAnotherCrewAtAnOutpost;   // 0xfa0(0x20)
	struct AchievementKillOpponentInContest                      AchievementKillOpponentInContest;                  // 0xfc0(0x8)
	class UClass*                                                ConditionalStatsTriggerForKillingAnotherPlayer;    // 0xfc8(0x8)
	class AICreatureMovementModifierParamsDataAsset*             PirateLegendHideoutPetMovementData;                // 0xfd0(0x8)
	class AICreatureMovementModifierParamsDataAsset*             OnShipPetMovementData;                             // 0xfd8(0x8)
	class AsyncLoadoutRepairComponent*                           RepairComponent;                                   // 0xfe0(0x8)
	class SeasonProgressionUIComponent*                          SeasonUIComponent;                                 // 0xfe8(0x8)
	class AimAssistComponent*                                    AimAssistComponent;                                // 0xff0(0x8)
	class AimAssistTargetComponent*                              AimAssistTargetComponent;                          // 0xff8(0x8)
	class SequencerCameraDockingComponent*                       SequencerCameraDockingComponent;                   // 0x1000(0x8)
	class EmotePropData*                                         EmotePropData;                                     // 0x1008(0x8)
	char                                                         pad0xb0_4EC7P[0xb0];                               // 0x1010(0xb0)
	class UClass*                                                FirstPersonAnimSetDataId;                          // 0x10c0(0x8)
	class AnimationDataStoreWeakReferenceAsset*                  FirstPersonAnimationDataStoreWeakReferencesAsset;  // 0x10c8(0x8)
	byte                                                         CharacterType;                                     // 0x10d0(0x1)
	char                                                         pad0x20_E5D6Y[0x20];                               // 0x10d1(0x20)
	bool                                                         IsWearingSkeletonCurseCached;                      // 0x10f1(0x1)
	bool                                                         IsWearingGhostCurseCached;                         // 0x10f2(0x1)
	char                                                         pad0xc85_947GA[0xc85];                             // 0x10f3(0xc85)
	class ClothingLoadoutComponent*                              ClothingLoadoutComponent;                          // 0x1d78(0x8)
	class PetLoadoutComponent*                                   PetLoadoutComponent;                               // 0x1d80(0x8)
	class VoyageParticipantComponent*                            PrimaryVoyageParticipantComponent;                 // 0x1d88(0x8)
	class VoyageParticipantComponent*                            TaleVoyageParticipantComponent;                    // 0x1d90(0x8)
	class VoyageParticipantComponent*                            EmergentVoyageParticipantComponent;                // 0x1d98(0x8)
	class PlayerWorldLocationComponent*                          PlayerWorldLocationComponent;                      // 0x1da0(0x8)
	class ChainLightningReceiverComponent*                       ChainLightningReceiverComponent;                   // 0x1da8(0x8)
	class PlayerGuildComponent*                                  PlayerGuildComponent;                              // 0x1db0(0x8)
	class GuildInviterComponent*                                 GuildInviterComponent;                             // 0x1db8(0x8)
	class InteractableComponentWithTooltipDetailedEventProvider* EmoteInteractableComponent;                        // 0x1dc0(0x8)
	struct AthenaPlayerCharacterModelSwap                        PendingModelSwap;                                  // 0x1dc8(0x68)
	char                                                         pad0x20_C1L0E[0x20];                               // 0x1e30(0x20)
	struct FName                                                 ReplicatedOverrideAnimationEntry;                  // 0x1e50(0x8)
	char                                                         pad0x9_DXFTP[0x9];                                 // 0x1e58(0x9)
	bool                                                         ReplicatedEmoteExitAllowed;                        // 0x1e61(0x1)
	char                                                         pad0x7e_RVP6H[0x7e];                               // 0x1e62(0x7e)
	bool                                                         FinishedWaitingForSpawn;                           // 0x1ee0(0x1)
	char                                                         pad0x31_MO1Z5[0x31];                               // 0x1ee1(0x31)
	bool                                                         AutoFloatInWater;                                  // 0x1f12(0x1)
	char                                                         pad0x1_RCY1Y[0x1];                                 // 0x1f13(0x1)
	bool                                                         ReplicatedIsSprinting;                             // 0x1f14(0x1)
	char                                                         pad0x1b_DT1T0[0x1b];                               // 0x1f15(0x1b)
	float                                                        AutoMoveCancelThreshold;                           // 0x1f30(0x4)
	int                                                          ReplicatedOverridePirateDescSeed;                  // 0x1f34(0x4)
	bool                                                         PreventJumping;                                    // 0x1f38(0x1)
	bool                                                         StopMovementAndPreventSwimming;                    // 0x1f39(0x1)
	bool                                                         PlayerIsInTunnelOfTheDamned;                       // 0x1f3a(0x1)
	char                                                         pad0x95_R74BB[0x95];                               // 0x1f3b(0x95)
};


// Size 0xe8 (Full Size[0x130] - InheritedSize[0x48]
class AIShipPlayerTracker: public AISpawnerPlayerTracker
{
public:
	char                                                         pad0xe8_S9NQ5[0xe8];                               // 0x48(0xe8)
};


// Size 0x30 (Full Size[0x78] - InheritedSize[0x48]
class AIShipRegionPlayerTracker: public AISpawnerPlayerTracker
{
public:
	char                                                         pad0x30_PKKDP[0x30];                               // 0x48(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIInteractableType: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIShipWheelAIInteractableType: public AIInteractableType
{
public:
};


// Size 0x20 (Full Size[0x5a0] - InheritedSize[0x580]
class AISignalTargetWaveSpawner: public AIWaveSpawner
{
public:
	TArray<struct StringAssetReference>                          SignalMechanismAssetRefs;                          // 0x580(0x10)
	char                                                         pad0x10_T7YDK[0x10];                               // 0x590(0x10)
};


// Size 0x30 (Full Size[0x90] - InheritedSize[0x60]
class AISpawnContextTaleQuestService: public TaleQuestService
{
public:
	class AISpawnContextTaleQuestServiceDesc*                    Desc;                                              // 0x60(0x8)
	char                                                         pad0x28_ZRJLV[0x28];                               // 0x68(0x28)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class AISpawnContextTaleQuestServiceDesc: public TaleQuestServiceDesc
{
public:
	struct FName                                                 AISpawnContextName;                                // 0x28(0x8)
	bool                                                         SpecificToIsland;                                  // 0x30(0x1)
	char                                                         pad0x7_AKRYV[0x7];                                 // 0x31(0x7)
	struct QuestVariableAsset                                    ActorLocatedOnIsland;                              // 0x38(0x30)
};


// Size 0x20 (Full Size[0x2b8] - InheritedSize[0x298]
class AIWieldableUseInputComponent: public AthenaCharacterBaseInputComponent
{
public:
	char                                                         pad0x20_AZJKD[0x20];                               // 0x298(0x20)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class AlcoholStatus: public StatusBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AllianceBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0xf8 (Full Size[0x4c0] - InheritedSize[0x3c8]
class AllianceService: public Actor
{
public:
	char                                                         pad0x8_EKCHP[0x8];                                 // 0x3c8(0x8)
	class AllianceSettingsAsset*                                 Settings;                                          // 0x3d0(0x8)
	TArray<struct Alliance>                                      Alliances;                                         // 0x3d8(0x10)
	class AllianceServiceTelemetryComponent*                     TelemetryComponent;                                // 0x3e8(0x8)
	TArray<struct CrewAllianceJoinStatus>                        CrewAllianceJoinStatuses;                          // 0x3f0(0x10)
	char                                                         pad0x38_R59WU[0x38];                               // 0x400(0x38)
	char                                                         pad0x88_4N2NT[0x88];                               // 0x438(0x88)
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class AllianceServiceTelemetryComponent: public ActorComponent
{
public:
	char                                                         pad0x40_AJH3Z[0x40];                               // 0xc8(0x40)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AllianceSettingsAsset: public DataAsset
{
public:
	float                                                        MaximumAllianceDistance;                           // 0x28(0x4)
	float                                                        PollDelay;                                         // 0x2c(0x4)
	class UClass*                                                OfferFlag;                                         // 0x30(0x8)
	class UClass*                                                AcceptFlag;                                        // 0x38(0x8)
	class UClass*                                                LeaveFlag;                                         // 0x40(0x8)
	class AlliancePennantAsset*                                  AlliancePennantAsset;                              // 0x48(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class AlwaysRelevantLightweightActor: public Actor
{
public:
	class Actor*                                                 OwningActor;                                       // 0x3c8(0x8)
};


// Size 0x30 (Full Size[0x310] - InheritedSize[0x2e0]
class NameplateComponent: public SceneComponent
{
public:
	float                                                        FadeTime;                                          // 0x2e0(0x4)
	char                                                         pad0x4_FAWZP[0x4];                                 // 0x2e4(0x4)
	class SkeletalMeshSocket*                                    NameplateSocket;                                   // 0x2e8(0x8)
	char                                                         pad0x20_Z4CP8[0x20];                               // 0x2f0(0x20)
};


// Size 0xa0 (Full Size[0x3b0] - InheritedSize[0x310]
class PlayerNameplateComponent: public NameplateComponent
{
public:
	char                                                         pad0x8_188W7[0x8];                                 // 0x310(0x8)
	float                                                        VisibleFromWorldDistance;                          // 0x318(0x4)
	float                                                        VisibleUntilWorldDistanceCrew;                     // 0x31c(0x4)
	float                                                        VisibleUntilWorldDistanceNonCrew;                  // 0x320(0x4)
	float                                                        EmoteForcedRevealTime;                             // 0x324(0x4)
	char                                                         pad0x8_2MLST[0x8];                                 // 0x328(0x8)
	class AthenaPlayerCharacter*                                 PlayerCharacter;                                   // 0x330(0x8)
	char                                                         pad0x78_DYXJC[0x78];                               // 0x338(0x78)
};


// Size 0x20 (Full Size[0x3d0] - InheritedSize[0x3b0]
class AlwaysRelevantPlayerNameplateComponent: public PlayerNameplateComponent
{
public:
	class AthenaPlayerState*                                     PlayerStatePtr;                                    // 0x3a8(0x8)
	char                                                         pad0x20_SMC4L[0x20];                               // 0x3b0(0x20)
};


// Size 0x70 (Full Size[0x440] - InheritedSize[0x3d0]
class AlwaysRelevantLightweightPlayerNameplate: public AlwaysRelevantLightweightActor
{
public:
	char                                                         pad0x20_RJULL[0x20];                               // 0x3d0(0x20)
	class AlwaysRelevantPlayerNameplateComponent*                PlayerNameplateComponent;                          // 0x3f0(0x8)
	struct Guid                                                  OwnedActorsCrewId;                                 // 0x3f8(0x10)
	char                                                         pad0x28_FNL6X[0x28];                               // 0x408(0x28)
	class AthenaPlayerState*                                     PlayerStatePtr;                                    // 0x430(0x8)
	bool                                                         IsOwnerInert;                                      // 0x438(0x1)
	char                                                         pad0x7_S8VWJ[0x7];                                 // 0x439(0x7)
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class Anchor: public Actor
{
public:
	char                                                         pad0x8_7W7T2[0x8];                                 // 0x3c8(0x8)
	struct Vector                                                PositionForAnchorDynamicsRelativeToAnchorActor;    // 0x3d0(0xc)
	char                                                         pad0x4_0EG1K[0x4];                                 // 0x3dc(0x4)
	class BaseAnchorDynamicsDesc*                                AnchorDynamicsDesc;                                // 0x3e0(0x8)
	char                                                         pad0x18_XKIJU[0x18];                               // 0x3e8(0x18)
};


// Size 0x28 (Full Size[0x170] - InheritedSize[0x148]
class AncientAIFormComponent: public AthenaAIFormComponent
{
public:
	char                                                         pad0x28_TTRP5[0x28];                               // 0x148(0x28)
};


// Size 0x10 (Full Size[0xa0] - InheritedSize[0x90]
class AncientAIFormDataAsset: public AthenaAIFormDataAsset
{
public:
	class UClass*                                                AwardableComponentType;                            // 0x90(0x8)
	float                                                        TimeBeforeDespawn;                                 // 0x98(0x4)
	char                                                         pad0x4_WPPD1[0x4];                                 // 0x9c(0x4)
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class NPCHeldObjectData: public DataAsset
{
public:
	struct FName                                                 LeftHandWieldSocket;                               // 0x28(0x8)
	struct FName                                                 RightHandWieldSocket;                              // 0x30(0x8)
	struct FName                                                 DetachSocketA;                                     // 0x38(0x8)
	struct FName                                                 DetachSocketB;                                     // 0x40(0x8)
	class UClass*                                                Object1;                                           // 0x48(0x8)
	class UClass*                                                Object2;                                           // 0x50(0x8)
	class UClass*                                                Object3;                                           // 0x58(0x8)
	class UClass*                                                Object4;                                           // 0x60(0x8)
	class UClass*                                                Object5;                                           // 0x68(0x8)
	class UClass*                                                Object6;                                           // 0x70(0x8)
	class UClass*                                                Object7;                                           // 0x78(0x8)
	class UClass*                                                Object8;                                           // 0x80(0x8)
	class UClass*                                                Object9;                                           // 0x88(0x8)
	class UClass*                                                Object10;                                          // 0x90(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AnimatedCosmeticItemInterface: public Interface
{
public:
};


// Size 0x70 (Full Size[0x4b0] - InheritedSize[0x440]
class AnimatedCosmeticItemAnimationInstance: public AnimInstance
{
public:
	char                                                         pad0x8_U6TJ5[0x8];                                 // 0x440(0x8)
	TArray<struct NPCOneShotAnimationElement>                    OneShotSequences;                                  // 0x448(0x10)
	TArray<struct NPCContinuousAnimationElement>                 ContinuousSequences;                               // 0x458(0x10)
	class AnimInstance*                                          ParentCharacterAnimationInstance;                  // 0x468(0x8)
	class AnimMontage*                                           CurrentPlayingMontage;                             // 0x470(0x8)
	class AnimSequenceBase*                                      OneShot;                                           // 0x478(0x8)
	class AnimSequenceBase*                                      ContinuousIn;                                      // 0x480(0x8)
	class AnimSequenceBase*                                      ContinuousLoopA;                                   // 0x488(0x8)
	class AnimSequenceBase*                                      ContinuousLoopB;                                   // 0x490(0x8)
	class AnimSequenceBase*                                      ContinuousOut;                                     // 0x498(0x8)
	char                                                         pad0x10_MR0BK[0x10];                               // 0x4a0(0x10)
};


// Size 0x28 (Full Size[0xf0] - InheritedSize[0xc8]
class AnimatedStepsComponent: public ActorComponent
{
public:
	class PoseableSkeletalMeshComponent*                         Mesh;                                              // 0xc8(0x8)
	TArray<class BoxComponent*>                                  Boxes;                                             // 0xd0(0x10)
	TArray<struct Vector>                                        BoxOrigins;                                        // 0xe0(0x10)
};


// Size 0x38 (Full Size[0x100] - InheritedSize[0xc8]
class AnimationDataOverriderComponent: public ActorComponent
{
public:
	char                                                         pad0x8_QBNPD[0x8];                                 // 0xc8(0x8)
	struct StringAssetReference                                  AnimationDataStoreAssetReference;                  // 0xd0(0x10)
	class AnimationDataStoreAsset*                               AnimationDataStoreAsset;                           // 0xe0(0x8)
	char                                                         pad0x18_XNYPJ[0x18];                               // 0xe8(0x18)
};


// Size 0x50 (Full Size[0x88] - InheritedSize[0x38]
class AnimNotify_AthenaPlayParticleEffect: public AnimNotify
{
public:
	class Object*                                                PSTemplate;                                        // 0x38(0x8)
	struct FName                                                 SocketName;                                        // 0x40(0x8)
	struct Vector                                                LocationOffset;                                    // 0x48(0xc)
	struct Rotator                                               RotationOffset;                                    // 0x54(0xc)
	struct Vector                                                RelativeScale;                                     // 0x60(0xc)
	struct LinearColor                                           ColorTint;                                         // 0x6c(0x10)
	float                                                        CustomParameter;                                   // 0x7c(0x4)
	bool                                                         Attached;                                          // 0x80(0x1)
	bool                                                         KeepWorldScale;                                    // 0x80(0x1)
	bool                                                         OwnerOnlySee;                                      // 0x80(0x1)
	bool                                                         OwnerNoSee;                                        // 0x80(0x1)
	bool                                                         OwnedByWorld;                                      // 0x80(0x1)
	char                                                         pad0x3_14BH2[0x3];                                 // 0x81(0x3)
	byte                                                         UnderwaterMode;                                    // 0x84(0x1)
	byte                                                         CustomLocalSpaceMode;                              // 0x85(0x1)
	char                                                         pad0x2_YLDKP[0x2];                                 // 0x86(0x2)
};


// Size 0x8 (Full Size[0x90] - InheritedSize[0x88]
class AnimNotify_AthenaPlayParticleEffectWithOwnerCustomisation: public AnimNotify_AthenaPlayParticleEffect
{
public:
	class UClass*                                                VfxCustomisationType;                              // 0x88(0x8)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class AnimNotify_CutSceneSubtitle: public AnimNotify
{
public:
	char                                                         pad0x8_YHMQJ[0x8];                                 // 0x38(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AnimNotify_DockableCutscene: public AnimNotify
{
public:
};


// Size 0x18 (Full Size[0x50] - InheritedSize[0x38]
class AnimNotify_RumbleController: public AnimNotify
{
public:
	class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x38(0x8)
	struct FName                                                 ForceFeedbackTag;                                  // 0x40(0x8)
	class ForceFeedbackCondition*                                ForceFeedbackCondition;                            // 0x48(0x8)
};


// Size 0x10 (Full Size[0x320] - InheritedSize[0x310]
class AnimNotifyAdditionalEventsWwiseEmitterComponent: public AnimNotifyWwiseEmitterComponent
{
public:
	TArray<struct AnimNotifyWwiseObserver>                       AnimNotifyObservers;                               // 0x310(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AnimNotifyQuestBookForcePageRedraw: public AnimNotify
{
public:
};


// Size 0x28 (Full Size[0x88] - InheritedSize[0x60]
class AnimNotifyState_AthenaTimedParticleEffect: public AnimNotifyState_TimedParticleEffect
{
public:
	struct Vector                                                RelativeScale;                                     // 0x60(0xc)
	struct LinearColor                                           ColorTint;                                         // 0x6c(0x10)
	float                                                        CustomParameter;                                   // 0x7c(0x4)
	bool                                                         Attached;                                          // 0x80(0x1)
	bool                                                         KeepWorldScale;                                    // 0x80(0x1)
	char                                                         pad0x3_C36VX[0x3];                                 // 0x81(0x3)
	byte                                                         UnderwaterMode;                                    // 0x84(0x1)
	byte                                                         CustomLocalSpaceMode;                              // 0x85(0x1)
	char                                                         pad0x2_GNPHD[0x2];                                 // 0x86(0x2)
};


// Size 0x50 (Full Size[0x80] - InheritedSize[0x30]
class AnimNotifyStateQuestBookRenderingModeRequest: public AnimNotifyState
{
public:
	char                                                         pad0x50_EO7IW[0x50];                               // 0x30(0x50)
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class AnimNotifyStateQuestBookLeftSpreadCurrentRightSpreadNext: public AnimNotifyStateQuestBookRenderingModeRequest
{
public:
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class AnimNotifyStateQuestBookLeftSpreadPreviousRightSpreadCurrent: public AnimNotifyStateQuestBookRenderingModeRequest
{
public:
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class AnimNotifyTriggerPlaceableReaction: public AnimNotify
{
public:
	struct StringAssetReference                                  PlaceableReactionToTrigger;                        // 0x38(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ApplicationSettings: public Object
{
public:
	int                                                          GameLanguage;                                      // 0x28(0x4)
	char                                                         pad0x4_X93E3[0x4];                                 // 0x2c(0x4)
};


// Size 0x28 (Full Size[0x3f0] - InheritedSize[0x3c8]
class ArenaVendorShip: public Actor
{
public:
	class SceneComponent*                                        ArenaVendorShipRootComponent;                      // 0x3c8(0x8)
	class ContestMerchantSpawnerComponent*                       ContestMerchantSpawnerComponent;                   // 0x3d0(0x8)
	class GenericWorldMapMarker*                                 VendorShipWorldMarkerComponent;                    // 0x3d8(0x8)
	class SphereComponent*                                       VendorDeadZoneComponent;                           // 0x3e0(0x8)
	float                                                        VendorShipDeadZoneRadius;                          // 0x3e8(0x4)
	char                                                         pad0x4_88KAW[0x4];                                 // 0x3ec(0x4)
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class ViewModelComponentBase: public ActorComponent
{
public:
	char                                                         pad0x60_N7WQ8[0x60];                               // 0xc8(0x60)
};


// Size 0x48 (Full Size[0x170] - InheritedSize[0x128]
class PossessionsChestViewModel: public ViewModelComponentBase
{
public:
	struct FText                                                 AllTabLabel;                                       // 0x128(0x38)
	struct StringAssetReference                                  AllTabIcon;                                        // 0x160(0x10)
};


// Size 0x28 (Full Size[0x198] - InheritedSize[0x170]
class ArmoryChestViewModelComponent: public PossessionsChestViewModel
{
public:
	char                                                         pad0x10_37RAE[0x10];                               // 0x170(0x10)
	TArray<class Class*>                                         Categories;                                        // 0x180(0x10)
	bool                                                         IncludeAllCategory;                                // 0x190(0x1)
	char                                                         pad0x7_1L6XO[0x7];                                 // 0x191(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AshCloudAIAbilityType: public AthenaAIAbilityType
{
public:
};


// Size 0x0 (Full Size[0x40] - InheritedSize[0x40]
class AshCloudAbilityStageParams: public AthenaAIAbilityStageParams
{
public:
};


// Size 0x18 (Full Size[0x90] - InheritedSize[0x78]
class AshCloudAIAbility: public AthenaAIAbility
{
public:
	class Pawn*                                                  Owner;                                             // 0x78(0x8)
	class AshCloudAIAbilityParams*                               SetupAbilityParams;                                // 0x80(0x8)
	class AshenLordAshCloud*                                     AshCloudInstance;                                  // 0x88(0x8)
};


// Size 0x8 (Full Size[0xd0] - InheritedSize[0xc8]
class AshCloudAIAbilityParams: public AthenaAIAbilityParams
{
public:
	class UClass*                                                AshCloudClass;                                     // 0xc8(0x8)
};


// Size 0x68 (Full Size[0x1b0] - InheritedSize[0x148]
class AshenLordAIFormComponent: public AthenaAIFormComponent
{
public:
	class WwiseEvent*                                            AshenLordVulnerabilityDamageAudioEvent;            // 0x148(0x8)
	struct FName                                                 AshenLordHeartBeatShaderParamName;                 // 0x150(0x8)
	class UClass*                                                CameraShake;                                       // 0x178(0x8)
	float                                                        ShakeInnerRadius;                                  // 0x180(0x4)
	float                                                        ShakeOuterRadius;                                  // 0x184(0x4)
	class MaterialInstanceDynamic*                               AshenLordDynamicMaterialInstance;                  // 0x188(0x8)
	float                                                        CachedNormalisedHealthScalar;                      // 0x190(0x4)
	bool                                                         IsInVulnerability;                                 // 0x194(0x1)
	char                                                         pad0x1b_SXQ6E[0x1b];                               // 0x195(0x1b)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AssetListDataAsset: public DataAsset
{
public:
	TArray<struct StringAssetReference>                          AssetList;                                         // 0x28(0x10)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class AssignItemStep: public TaleQuestStep
{
public:
	class AssignItemStepDesc*                                    StepDesc;                                          // 0x98(0x8)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class AssignItemStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableClass                                    TypeVar;                                           // 0x80(0x30)
	class UClass*                                                TypeValue;                                         // 0xb0(0x8)
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class AssociateActorToCrewTaskStep: public TaleQuestStep
{
public:
	class AssociateActorToCrewTaskStepDesc*                      Desc;                                              // 0x98(0x8)
	char                                                         pad0x30_1KZRY[0x30];                               // 0xa0(0x30)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class AssociateActorToCrewTaskStepDesc: public TaleQuestStepDesc
{
public:
	class TaleQuestStepDesc*                                     TaskDesc;                                          // 0x80(0x8)
	struct QuestVariableActor                                    ActorToAssociate;                                  // 0x88(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LoadoutRepairerInterface: public Interface
{
public:
};


// Size 0x58 (Full Size[0x120] - InheritedSize[0xc8]
class AsyncLoadoutRepairComponent: public ActorComponent
{
public:
	char                                                         pad0x58_I0PJH[0x58];                               // 0xc8(0x58)
};


// Size 0x130 (Full Size[0x230] - InheritedSize[0x100]
class AthenaAIInteractableComponent: public AIInteractableComponent
{
public:
	char                                                         pad0x8_LC1BQ[0x8];                                 // 0x100(0x8)
	bool                                                         Moveable;                                          // 0x108(0x1)
	char                                                         pad0x3_U0RDN[0x3];                                 // 0x109(0x3)
	struct Vector                                                InteractableRelativeVectorToSpawnPos;              // 0x10c(0xc)
	struct Vector                                                TriggerSphereCentreOffset;                         // 0x118(0xc)
	float                                                        TriggerSphereRadiusOffset;                         // 0x124(0x4)
	float                                                        TimeToCacheLastBestTargetResult;                   // 0x128(0x4)
	byte                                                         OwnerAITeam;                                       // 0x12c(0x1)
	char                                                         pad0x103_25P0H[0x103];                             // 0x12d(0x103)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAITeamsServiceInterface: public Interface
{
public:
};


// Size 0x5b8 (Full Size[0x5e0] - InheritedSize[0x28]
class AthenaAITeamsService: public Object
{
public:
	char                                                         pad0x5b8_0MOO7[0x5b8];                             // 0x28(0x5b8)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class AthenaAnimationCustomSkeletonAnimationData: public DataAsset
{
public:
	struct SkeletonCustomAnimationDataStructure                  SkeletonCustomAnimData;                            // 0x28(0x38)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterAnimationInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAnimationLocomotionComponentFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x2c50 (Full Size[0x32b0] - InheritedSize[0x660]
class AthenaAnimationInstance: public CharacterAnimationInstance
{
public:
	char                                                         pad0x38_VX5QE[0x38];                               // 0x660(0x38)
	byte                                                         ControllableObjectType;                            // 0x698(0x1)
	char                                                         pad0x7_VQOXG[0x7];                                 // 0x699(0x7)
	TArray<struct AthenaAnimationLoadObjectsWrapper>             AllLoadedItemData;                                 // 0x6a0(0x10)
	struct AthenaAnimationHandHeldItemParams                     HandHeldItemParams;                                // 0x6b0(0x20)
	struct AthenaAnimationIdleVariantChange                      IdleVariantParams;                                 // 0x6d0(0x10)
	struct AthenaAnimationWheel                                  WheelAnimationParams;                              // 0x6e0(0x1f0)
	struct AthenaAnimationCapstan                                CapstanAnimationParams;                            // 0x8d0(0x178)
	struct AthenaAnimationFacialAnimData                         FacialParams;                                      // 0xa48(0x90)
	struct AthenaAnimationFire                                   Fire;                                              // 0xad8(0x20)
	byte                                                         MeleeSpecialState;                                 // 0xaf8(0x1)
	char                                                         pad0x3_Y5TRF[0x3];                                 // 0xaf9(0x3)
	float                                                        DodgeDirection;                                    // 0xafc(0x4)
	struct AthenaAnimationRowboatParams                          RowboatParams;                                     // 0xb00(0xc8)
	struct AthenaAnimationRowing                                 Rowing;                                            // 0xbc8(0xe0)
	struct AthenaAnimationWaterPumpAnimData                      WaterPumpAnimations;                               // 0xca8(0x28)
	struct AthenaAnimationWaterPumpParams                        WaterPumpAnimationParams;                          // 0xcd0(0xc)
	struct AthenaAnimationFishingParams                          FishingParams;                                     // 0xcdc(0x34)
	struct AthenaAnimationFishing                                Fishing;                                           // 0xd10(0x3f0)
	struct AthenaAnimationWaterSlideControlAnimData              WaterSlideControlAnimData;                         // 0x1100(0xe0)
	struct AthenaAnimationZiplineControlAnimData                 ZiplineControlAnimData;                            // 0x11e0(0x68)
	class AthenaCharacter*                                       AthenaCharacter;                                   // 0x1248(0x8)
	struct AthenaAnimationJumping                                JumpingAnimationParams;                            // 0x1250(0xf0)
	float                                                        SpineBlendAlpha;                                   // 0x1340(0x4)
	float                                                        DockingTransitionAlpha;                            // 0x1344(0x4)
	struct AthenaAnimationWaterPump                              AthenaAnimationWaterPump;                          // 0x1348(0x30)
	struct AthenaAnimationLODSettings                            AnimationLODSettings;                              // 0x1378(0x3)
	char                                                         pad0x5_3JXNG[0x5];                                 // 0x137b(0x5)
	struct AthenaAnimationLocomotion                             Locomotion;                                        // 0x1380(0x68)
	struct AthenaAnimationWieldedItemStateMachine                WieldedItemStateMachine;                           // 0x13e8(0x5f0)
	char                                                         pad0x8_5B5XG[0x8];                                 // 0x19d8(0x8)
	struct AthenaAnimationLoadObjectByID                         ItemLoading;                                       // 0x19e0(0x930)
	class UClass*                                                CurrentWieldedItemALK;                             // 0x2310(0x8)
	struct AthenaAnimationObjectActionContinuousStruct           ItemPrimaryContinousUseAnims;                      // 0x2318(0xa8)
	struct AthenaAnimationObjectActionContinuousStruct           ItemSecondaryContinousUseAnims;                    // 0x23c0(0xa8)
	struct AthenaAnimationObjectActionContinuousStruct           ItemPrimaryContinousUseAlternateAnims;             // 0x2468(0xa8)
	struct AthenaAnimationObjectActionContinuousStruct           ItemSecondaryContinousUseAlternateAnims;           // 0x2510(0xa8)
	struct AthenaAnimationObjectActionContinuousSwimming         ItemPrimaryContinousUseSwimmingAnims;              // 0x25b8(0x20)
	struct AthenaAnimationObjectActionContinuousSwimming         ItemSecondaryContinousUseSwimmingAnims;            // 0x25d8(0x20)
	struct AthenaAnimationObjectActionContinuousSwimming         ItemPrimaryContinousUseSwimmingAlternateAnims;     // 0x25f8(0x20)
	struct AthenaAnimationObjectActionContinuousSwimming         ItemSecondaryContinousUseSwimmingAlternateAnims;   // 0x2618(0x20)
	struct AthenaAnimationObjectJumpingAnimations                ItemPrimaryContinousUseJumpingAnims;               // 0x2638(0x20)
	struct AthenaAnimationObjectJumpingAnimations                ItemSecondaryContinousUseJumpingAnims;             // 0x2658(0x20)
	struct AthenaAnimationObjectJumpingAnimations                ItemPrimaryContinousUseJumpingAlternateAnims;      // 0x2678(0x20)
	struct AthenaAnimationObjectJumpingAnimations                ItemSecondaryContinousUseJumpingAlternateAnims;    // 0x2698(0x20)
	struct AthenaAnimationActiveOneShotAnimationStruct           ActiveOneShotAnimations;                           // 0x26b8(0x20)
	struct AthenaAnimationActiveOneShotAnimationStruct           DuplicateActiveOneShotAnimations;                  // 0x26d8(0x20)
	struct AthenaAnimationObjectActionOneShotPlayingStruct       ItemPrimaryOneShotAnims;                           // 0x26f8(0x28)
	struct AthenaAnimationObjectActionOneShotPlayingStruct       ItemSecondaryOneShotAnims;                         // 0x2720(0x28)
	struct AthenaAnimationObjectActionOneShotPlayingStruct       ItemPrimaryOneShotAlternateAnims;                  // 0x2748(0x28)
	struct AthenaAnimationObjectActionOneShotPlayingStruct       ItemSecondaryOneShotAlternateAnims;                // 0x2770(0x28)
	struct AthenaAnimationActiveItemComplexAnimData              CurrentComplexOneShotData;                         // 0x2798(0x38)
	struct AthenaAnimationObjectComplexOneShotPlaySpeeds         CurrentMeleeAttackSequencePlaySpeeds;              // 0x27d0(0x14)
	char                                                         pad0x4_LCXFQ[0x4];                                 // 0x27e4(0x4)
	struct AthenaAnimationObjectMeleeBlocking                    ItemCombatBlockingAnims;                           // 0x27e8(0x60)
	class UClass*                                                FishingRodAnimStoreID;                             // 0x2848(0x8)
	class UClass*                                                QuestBookAnimStoreID;                              // 0x2850(0x8)
	class UClass*                                                WoodenPlankAnimStoreID;                            // 0x2858(0x8)
	float                                                        UnequipPlayRate;                                   // 0x2860(0x4)
	char                                                         pad0x4_S07B8[0x4];                                 // 0x2864(0x4)
	struct AthenaAnimationLoadOnDemandItemsAnimgraphStructure    LoadOnDemandItemParams;                            // 0x2868(0x760)
	byte                                                         ControllableSocketGroup;                           // 0x2fc8(0x1)
	byte                                                         ControllableSocketGroupCharacterSize;              // 0x2fc9(0x1)
	byte                                                         LocomotionState;                                   // 0x2fca(0x1)
	struct AthenaAnimationDebugTrackingParams                    DebugTrackingParams;                               // 0x2fcb(0x4)
	char                                                         pad0x1_5936D[0x1];                                 // 0x2fcf(0x1)
	struct AthenaAnimationDeath                                  Death;                                             // 0x2fd0(0x100)
	struct AthenaAnimationUndoRepair                             UndoRepair;                                        // 0x30d0(0x70)
	struct AthenaAnimationSitting                                Sitting;                                           // 0x3140(0x70)
	byte                                                         PropWieldLocation;                                 // 0x31b0(0x1)
	char                                                         pad0x3_CFDW4[0x3];                                 // 0x31b1(0x3)
	struct Vector                                                PropOffsetLocation;                                // 0x31b4(0xc)
	struct Rotator                                               PropOffsetRotation;                                // 0x31c0(0xc)
	struct Vector                                                PropOffsetScale;                                   // 0x31cc(0xc)
	bool                                                         FaunaAddedToCrate;                                 // 0x31d8(0x1)
	bool                                                         InDockingTransition;                               // 0x31d8(0x1)
	bool                                                         WieldedItemIsMeleeWeapon;                          // 0x31d8(0x1)
	bool                                                         InMeleeCombat;                                     // 0x31d8(0x1)
	bool                                                         IsBlockingLeft;                                    // 0x31d8(0x1)
	bool                                                         IsFishingWithWieldedRod;                           // 0x31d8(0x1)
	bool                                                         UsePropOffset;                                     // 0x31d8(0x1)
	bool                                                         IsOnLadder;                                        // 0x31d8(0x1)
	bool                                                         IsUsingAdditiveHandOverlayPose;                    // 0x31d9(0x1)
	bool                                                         IgnoreIdleBlendTransition;                         // 0x31d9(0x1)
	bool                                                         UseDuplicateOneShotState;                          // 0x31d9(0x1)
	char                                                         pad0xd6_AR0S4[0xd6];                               // 0x31da(0xd6)
};


// Size 0xd0 (Full Size[0x3380] - InheritedSize[0x32b0]
class FirstPersonAnimationInstance: public AthenaAnimationInstance
{
public:
	char                                                         pad0x8_J78PE[0x8];                                 // 0x32b0(0x8)
	float                                                        SpineRotationTime;                                 // 0x32b8(0x4)
	struct Vector                                                RangedWeaponTargetingOffset;                       // 0x32bc(0xc)
	float                                                        RangedWeaponAlpha;                                 // 0x32c8(0x4)
	struct AthenaAnimationCamera                                 CameraParams;                                      // 0x32cc(0x18)
	char                                                         pad0x4_F71B5[0x4];                                 // 0x32e4(0x4)
	struct AthenaAnimationFirstPersonAnimatic                    FirstPersonAnimatic;                               // 0x32e8(0x80)
	byte                                                         CameraAdditiveBlendPoseType;                       // 0x3368(0x1)
	char                                                         pad0x3_IKS8D[0x3];                                 // 0x3369(0x3)
	float                                                        RowboatCameraAlpha;                                // 0x336c(0x4)
	bool                                                         UseAdditiveHandOverlay;                            // 0x3370(0x1)
	bool                                                         CameraAttachmentTypeNotDefault;                    // 0x3370(0x1)
	bool                                                         BlendUpperBodyAndArmOverlay;                       // 0x3370(0x1)
	bool                                                         UseArmOverlayJumpContinuous;                       // 0x3370(0x1)
	bool                                                         IsSwimming;                                        // 0x3370(0x1)
	bool                                                         IsControllableObjectActive;                        // 0x3370(0x1)
	bool                                                         UseSwimmingEquip;                                  // 0x3370(0x1)
	char                                                         pad0x3_5IUFD[0x3];                                 // 0x3371(0x3)
	float                                                        EquipAnimationPlayRate;                            // 0x3374(0x4)
	bool                                                         ActivateIK;                                        // 0x3378(0x1)
	bool                                                         UseOneShotIntoAnimInContinuousUse;                 // 0x3378(0x1)
	char                                                         pad0x7_OXBNU[0x7];                                 // 0x3379(0x7)
};


// Size 0x1490 (Full Size[0x4740] - InheritedSize[0x32b0]
class ThirdPersonAnimationInstance: public AthenaAnimationInstance
{
public:
	float                                                        ItemAnimPausedTimeRemaining;                       // 0x32b0(0x4)
	bool                                                         IsItemAnimPaused;                                  // 0x32b4(0x1)
	bool                                                         UseContinualLoopInOneShotState;                    // 0x32b4(0x1)
	char                                                         pad0x3_NOX9I[0x3];                                 // 0x32b5(0x3)
	struct AthenaAnimationIKLimbStretch                          IKLimbStretchParams;                               // 0x32b8(0xc)
	char                                                         pad0x4_LNC47[0x4];                                 // 0x32c4(0x4)
	struct AthenaAnimationLadder                                 LadderAnimationParams;                             // 0x32c8(0x330)
	struct AthenaAnimationTalking                                Talking;                                           // 0x35f8(0x38)
	struct AthenaAnimationPitchControlStates                     PitchTargetingControlStates;                       // 0x3630(0x168)
	struct AthenaAnimationObjectTargetingOptions                 PitchTargetingParameters;                          // 0x3798(0x3c)
	struct AthenaAnimationObjectTargetingOptions                 WantedPitchTargetingParameters;                    // 0x37d4(0x3c)
	struct AthenaAnimationPitchAlpha                             PitchTargetingAlpha;                               // 0x3810(0x14)
	struct AthenaAnimationPitchShoulders                         PitchShoulderParams;                               // 0x3824(0x1c)
	struct AthenaAnimationMountedWeapon                          MountedWeaponAnimationParams;                      // 0x3840(0x128)
	struct AthenaAnimationFootPlanting                           FootPlanting;                                      // 0x3968(0x48)
	byte                                                         StairAnimationState;                               // 0x39b0(0x1)
	char                                                         pad0x7_Z6IIX[0x7];                                 // 0x39b1(0x7)
	struct AthenaAnimationPulleyControl                          PulleyControl;                                     // 0x39b8(0x40)
	struct AthenaAnimationPulleyControlAnimData                  PulleyControlAnimData;                             // 0x39f8(0x48)
	struct AthenaAnimationKeyedInstrumentAnimData                KeyedInstrumentAnimData;                           // 0x3a40(0x18)
	struct AthenaAnimationAI                                     AIAnimationParams;                                 // 0x3a58(0x358)
	struct AthenaAnimationLocomotionAlternateAnimData            LocomotionDrunk;                                   // 0x3db0(0x50)
	struct AthenaAnimationLocomotionAlternateAnimData            LocomotionLimp;                                    // 0x3e00(0x50)
	struct AthenaAnimationLocomotionAlternateAnimData            LocomotionPegLeg;                                  // 0x3e50(0x50)
	struct AthenaAnimationLocomotionAlternateAnimData            LocomotionHotCoals;                                // 0x3ea0(0x50)
	TArray<struct AthenaAnimationSpawnBase>                      AISpawnStruct;                                     // 0x3ef0(0x10)
	TArray<struct AthenaAnimationSkeletonFlee>                   AIFleeLoadingStruct;                               // 0x3f00(0x10)
	struct AthenaAnimationSkeletonFleeInGraph                    AIFleePlayingStruct;                               // 0x3f10(0x38)
	struct AthenaAnimationSkeletonScream                         SkeletonScream;                                    // 0x3f48(0x8)
	class BlendSpace1D*                                          PitchAnimationToPlay;                              // 0x3f50(0x8)
	struct AthenaAnimationShopInteractionParams                  ShopInteractionParams;                             // 0x3f58(0x30)
	struct AthenaAnimationEmoteAnimgraphStructure                EmoteParams;                                       // 0x3f88(0x148)
	struct AthenaAnimationSkeletonCurseAnimations                SkeletonCurseAnims;                                // 0x40d0(0x28)
	struct AthenaAnimationHarpoonLauncherAnimData                HarpoonLauncherAnims;                              // 0x40f8(0x28)
	struct AthenaAnimationAIKnockback                            AIKnockbackStruct;                                 // 0x4120(0x30)
	struct AthenaAnimationHitReactsAnimData                      HitReactionsAnimationData;                         // 0x4150(0x40)
	struct AthenaAnimationHitReactsSelectedAnimations            HitReactionsSelectedAnimationData;                 // 0x4190(0x48)
	struct AthenaAnimationHitReactParams                         HitReactionsAnimationParams;                       // 0x41d8(0x2c)
	char                                                         pad0x4_HLS9X[0x4];                                 // 0x4204(0x4)
	struct AthenaAnimationSinkingTunnel                          Sinking;                                           // 0x4208(0x68)
	float                                                        HitReactAdditiveBlendAmount;                       // 0x4270(0x4)
	float                                                        WieldedItemPoseBlendTime;                          // 0x4274(0x4)
	float                                                        UpperBodyPoseBlendTime;                            // 0x4278(0x4)
	float                                                        AimingAndPitchOverride;                            // 0x427c(0x4)
	float                                                        FacialOverlayBlendWeight;                          // 0x4280(0x4)
	struct Rotator                                               PitchShoulderRotation;                             // 0x4284(0xc)
	struct Rotator                                               PitchClavicleRotation;                             // 0x4290(0xc)
	float                                                        RightArmPitchAlpha;                                // 0x429c(0x4)
	float                                                        LeftArmPitchAlpha;                                 // 0x42a0(0x4)
	float                                                        SpineRotation;                                     // 0x42a4(0x4)
	struct AthenaAnimationStunData                               StunData;                                          // 0x42a8(0x8)
	class BlendSpace1D*                                          HitReactItem;                                      // 0x42b0(0x8)
	float                                                        WorldDelta;                                        // 0x42b8(0x4)
	float                                                        CapstanAngularVelocityWanted;                      // 0x42bc(0x4)
	struct AthenaAnimationPlayingFacialAnimations                PlayingFacialAnimations;                           // 0x42c0(0x40)
	struct AthenaAnimationPlayingEquipAnimations                 PlayingEquipAnimations;                            // 0x4300(0x18)
	float                                                        CharacterPitch;                                    // 0x4318(0x4)
	float                                                        TargetingPitch;                                    // 0x431c(0x4)
	struct AthenaAnimationObjectLocomotionAnimations             ItemAlternateLocomotionAnims;                      // 0x4320(0x40)
	struct AthenaAnimationObjectIdleAnimations                   ItemAlternateIdleAnims;                            // 0x4360(0x18)
	struct AthenaAnimationObjectActionContinuousStructPitchOverride ItemPrimaryContinousUseAnimsPitchOverride;         // 0x4378(0x78)
	struct AthenaAnimationObjectActionContinuousStructPitchOverride ItemSecondaryContinousUseAnimsPitchOverride;       // 0x43f0(0x78)
	struct AthenaAnimationObjectActionContinuousStructPitchOverride ItemPrimaryContinousUseAlternateAnimsPitchOverride; // 0x4468(0x78)
	struct AthenaAnimationObjectActionContinuousStructPitchOverride ItemSecondaryContinousUseAlternateAnimsPitchOverride; // 0x44e0(0x78)
	struct AthenaAnimationObjectActionContinuousSwimming         ItemPrimaryContinousUseSwimmingAnimsPitchOverride; // 0x4558(0x20)
	struct AthenaAnimationObjectActionContinuousSwimming         ItemSecondaryContinousUseSwimmingAnimsPitchOverride; // 0x4578(0x20)
	struct AthenaAnimationObjectActionContinuousSwimming         ItemPrimaryContinousUseSwimmingAlternateAnimsPitchOverride; // 0x4598(0x20)
	struct AthenaAnimationObjectActionContinuousSwimming         ItemSecondaryContinousUseSwimmingAlternateAnimsPitchOverride; // 0x45b8(0x20)
	struct AthenaAnimationObjectJumpingAnimationsPitchOverride   ItemPrimaryContinousUseJumpingAnimsPitchOverride;  // 0x45d8(0x20)
	struct AthenaAnimationObjectJumpingAnimationsPitchOverride   ItemSecondaryContinousUseJumpingAnimsPitchOverride; // 0x45f8(0x20)
	struct AthenaAnimationObjectJumpingAnimationsPitchOverride   ItemPrimaryContinousUseJumpingAlternateAnimsPitchOverride; // 0x4618(0x20)
	struct AthenaAnimationObjectJumpingAnimationsPitchOverride   ItemSecondaryContinousUseJumpingAlternateAnimsPitchOverride; // 0x4638(0x20)
	struct AthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemPrimaryOneShotAnimsPitchOverride;              // 0x4658(0x28)
	struct AthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemSecondaryOneShotAnimsPitchOverride;            // 0x4680(0x28)
	struct AthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemPrimaryOneShotAlternateAnimsPitchOverride;     // 0x46a8(0x28)
	struct AthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemSecondaryOneShotAlternateAnimsPitchOverride;   // 0x46d0(0x28)
	bool                                                         ZeroLocomotionForced;                              // 0x46f8(0x1)
	bool                                                         ConcealedInLoadable;                               // 0x46f8(0x1)
	bool                                                         AIUseAlternateLocomotion;                          // 0x46f8(0x1)
	bool                                                         EmoteIKIsOff;                                      // 0x46f8(0x1)
	bool                                                         InBlockingInto;                                    // 0x46f8(0x1)
	bool                                                         IsAI;                                              // 0x46f8(0x1)
	bool                                                         IsLocallyControlled;                               // 0x46f8(0x1)
	bool                                                         IsHit;                                             // 0x46f8(0x1)
	bool                                                         InRecover;                                         // 0x46f9(0x1)
	bool                                                         InWarmUp;                                          // 0x46f9(0x1)
	bool                                                         PlayingFullBodyAnimation;                          // 0x46f9(0x1)
	bool                                                         PlayingUpperBodyAnimation;                         // 0x46f9(0x1)
	bool                                                         PlayingRightArmOverlayAnimation;                   // 0x46f9(0x1)
	bool                                                         PlayingSpineOverlayAnimation;                      // 0x46f9(0x1)
	bool                                                         PlayingLeftArmOverlayAnimation;                    // 0x46f9(0x1)
	bool                                                         IsUsingFullBodyOverlayPose;                        // 0x46f9(0x1)
	bool                                                         IsUsingLocalIKPose;                                // 0x46fa(0x1)
	bool                                                         IsRightShoulderActive;                             // 0x46fa(0x1)
	bool                                                         IsLeftShoulderActive;                              // 0x46fa(0x1)
	bool                                                         ControllableObjectTypeHasValidTarget;              // 0x46fa(0x1)
	bool                                                         UseHandsAndFootplantingIK;                         // 0x46fa(0x1)
	bool                                                         IKLODActive;                                       // 0x46fa(0x1)
	bool                                                         LODSolverActive;                                   // 0x46fa(0x1)
	bool                                                         ObjectPitchTargetingActive;                        // 0x46fa(0x1)
	bool                                                         ObjectOrIKEmoteActive;                             // 0x46fb(0x1)
	bool                                                         ObjectOrWheelCapstanAndNotDocking;                 // 0x46fb(0x1)
	bool                                                         HitReact1Active;                                   // 0x46fb(0x1)
	bool                                                         HitReact2Active;                                   // 0x46fb(0x1)
	bool                                                         AthenaCharacterIsValid;                            // 0x46fb(0x1)
	bool                                                         UsePrimaryActionPitchOverride;                     // 0x46fb(0x1)
	bool                                                         UseSecondaryActionPitchOverride;                   // 0x46fb(0x1)
	char                                                         pad0x44_N4KAO[0x44];                               // 0x46fc(0x44)
};


// Size 0x170 (Full Size[0x48b0] - InheritedSize[0x4740]
class SkeletonAnimationInstance: public ThirdPersonAnimationInstance
{
public:
	char                                                         pad0x10_1LCS0[0x10];                               // 0x4740(0x10)
	struct AthenaAnimationSkeletonAIFastPathData                 SkeletonAIFastPathData;                            // 0x4750(0x4)
	char                                                         pad0x4_901TN[0x4];                                 // 0x4754(0x4)
	class NPCHeldObjectData*                                     HeldObjectList;                                    // 0x4758(0x8)
	class Actor*                                                 LeftHandObject;                                    // 0x4760(0x8)
	class Actor*                                                 RightHandObject;                                   // 0x4768(0x8)
	float                                                        ObjectOverlayBlendOutTime;                         // 0x4770(0x4)
	char                                                         pad0x4_0JWRZ[0x4];                                 // 0x4774(0x4)
	class AthenaAnimationCustomSkeletonAnimationData*            CustomAnimationData;                               // 0x4778(0x8)
	struct AthenaAnimationCustomSkeletonAnimationBlueprintData   CustomAnimationBlueprintData;                      // 0x4780(0x58)
	byte                                                         PreviousCustomAnimationState;                      // 0x47d8(0x1)
	char                                                         pad0x7_F53E3[0x7];                                 // 0x47d9(0x7)
	class AnimMontage*                                           CustomAnimationCurrentMontage;                     // 0x47e0(0x8)
	char                                                         pad0xc8_2R59N[0xc8];                               // 0x47e8(0xc8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAnimationInstanceTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAnimationMountedWeaponBlueprintFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAnimationWieldedItemAnimationOverlayFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAnimationWieldedItemFunctions: public Object
{
public:
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class AthenaAssetSettings: public Object
{
public:
	TArray<struct AssetDelayLoadEntry>                           DelayLoadedAssets;                                 // 0x28(0x10)
	TArray<struct AssetDelayLoadEntry>                           SteamOnlyDelayLoadedAssets;                        // 0x38(0x10)
	TArray<Str PhysicsAuditBlueprintExceptions>                  PhysicsAuditBlueprintExceptions;                   // 0x48(0x10)
	TArray<struct FName>                                         PhysicsAuditExemptedCollisionProfiles;             // 0x58(0x10)
};


// Size 0x80 (Full Size[0x8d0] - InheritedSize[0x850]
class AthenaCameraComponent: public CameraComponent
{
public:
	float                                                        OffsetBlendSpeed;                                  // 0x850(0x4)
	float                                                        AboveWaterOffset;                                  // 0x854(0x4)
	float                                                        UnderWaterOffset;                                  // 0x858(0x4)
	float                                                        SubmersionDistanceBeforeSurfacing;                 // 0x85c(0x4)
	float                                                        SubmersionDistanceBeforeUnderwater;                // 0x860(0x4)
	float                                                        SubmersionDistanceBeforeUnderwaterOnShip;          // 0x864(0x4)
	bool                                                         IsInsideShipHull;                                  // 0x888(0x1)
	char                                                         pad0x3_SNI8Y[0x3];                                 // 0x889(0x3)
	float                                                        CurrentCameraOffset;                               // 0x88c(0x4)
	char                                                         pad0x40_TH8D1[0x40];                               // 0x890(0x40)
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class CustomAnimationHandlerComponent: public ActorComponent
{
public:
	char                                                         pad0x10_NGJYS[0x10];                               // 0xc8(0x10)
	TArray<struct StringAssetReference>                          CurrentCustomAnimationDataAssetReferences;         // 0xd8(0x10)
	struct RequestedLoopAnims                                    RequestedLoopingAnim;                              // 0xe8(0x10)
	class AthenaAnimationCustomSkeletonAnimationData*            MergedCustomAnimationData;                         // 0xf8(0x8)
	char                                                         pad0x28_FULHB[0x28];                               // 0x100(0x28)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class HitDetectionVisualisationInterface: public Interface
{
public:
};


// Size 0x780 (Full Size[0x13c0] - InheritedSize[0xc40]
class AthenaAICharacter: public AthenaCharacter
{
public:
	char                                                         pad0xa0_HURWH[0xa0];                               // 0xc40(0xa0)
	class UClass*                                                DefaultAmmoItemDescType;                           // 0xce0(0x8)
	class UClass*                                                DefaultInteractableAmmoItemDescType;               // 0xce8(0x8)
	class CurveFloat*                                            DistanceInMToCannonShotHitChanceCurve;             // 0xcf0(0x8)
	bool                                                         AimNoiseEnabled;                                   // 0xcf8(0x1)
	char                                                         pad0x3_J5VCG[0x3];                                 // 0xcf9(0x3)
	float                                                        AmplitudeChangeSpeed;                              // 0xcfc(0x4)
	float                                                        AmplitudeOffset;                                   // 0xd00(0x4)
	float                                                        Frequency;                                         // 0xd04(0x4)
	float                                                        InteractableMissFallShortMinProportion;            // 0xd08(0x4)
	float                                                        InteractableMissFallShortMaxProportion;            // 0xd0c(0x4)
	byte                                                         TrackedActorType;                                  // 0xd10(0x1)
	char                                                         pad0x7_APPPN[0x7];                                 // 0xd11(0x7)
	class FaceTargetComponent*                                   FaceTargetComponent;                               // 0xd18(0x8)
	class AIPartsRetrievalComponent*                             AIPartsRetrievalComponent;                         // 0xd20(0x8)
	class AthenaAIFormComponent*                                 FormComponent;                                     // 0xd28(0x8)
	class AICharacterAudioComponent*                             AICharacterAudioComponent;                         // 0xd30(0x8)
	class StatusEffectManagerComponent*                          StatusEffectManagerComponent;                      // 0xd38(0x8)
	class StatusEffectPersistenceComponent*                      StatusEffectPersistenceComponent;                  // 0xd40(0x8)
	class PlayerCurseComponent*                                  PlayerCurseComponent;                              // 0xd48(0x8)
	class VulnerabilityDuringAIStrategyComponent*                VulnerabilityDuringAIStrategyComponent;            // 0xd50(0x8)
	class CapsuleComponent*                                      ProjectileTraceHitVolume;                          // 0xd58(0x8)
	class AnimationDataOverriderComponent*                       AnimationDataOverriderComponent;                   // 0xd60(0x8)
	class CustomAnimationHandlerComponent*                       CustomAnimationHandlerComponent;                   // 0xd68(0x8)
	class AIProjectileWeaponFiringIntentionComponent*            FiringIntentionComponent;                          // 0xd70(0x8)
	class Object*                                                KilledVfxTemplate;                                 // 0xd78(0x8)
	class Object*                                                PartSpecificKilledVfxTemplate;                     // 0xd80(0x8)
	struct ItemLoadout                                           AISpawnLoadout;                                    // 0xd88(0x20)
	bool                                                         KillOnFallingIntoWater;                            // 0xda8(0x1)
	char                                                         pad0x7_2PFPH[0x7];                                 // 0xda9(0x7)
	class UClass*                                                MeleeAttackStrategyId;                             // 0xdb0(0x8)
	class UClass*                                                GunpowderKegAnimationStoreId;                      // 0xdb8(0x8)
	struct PlayerStat                                            OnFireStat;                                        // 0xdc0(0x4)
	struct PlayerStat                                            OnDistortStat;                                     // 0xdc4(0x4)
	char                                                         pad0x48_8SYQ1[0x48];                               // 0xdc8(0x48)
	class SkeletalMesh*                                          AssignedMesh;                                      // 0xe10(0x8)
	class ColorTexture*                                          TeamColorTexture;                                  // 0xe18(0x8)
	struct GenericTeamId                                         TeamID;                                            // 0xe20(0x1)
	char                                                         pad0x7_UVCAP[0x7];                                 // 0xe21(0x7)
	class Actor*                                                 CurrentShip;                                       // 0xe28(0x8)
	float                                                        MeshScale;                                         // 0xe30(0x4)
	bool                                                         DamageResponsesDisabled;                           // 0xe34(0x1)
	bool                                                         TurnActive;                                        // 0xe35(0x1)
	char                                                         pad0x2_AVZ5E[0x2];                                 // 0xe36(0x2)
	class UClass*                                                CurrentAIStrategy;                                 // 0xe38(0x8)
	class UClass*                                                CurrentAnimationState;                             // 0xe40(0x8)
	class UClass*                                                AlternateLocomotionItemType;                       // 0xe48(0x8)
	char                                                         pad0x3b0_AEAE6[0x3b0];                             // 0xe50(0x3b0)
	class AthenaAIAmmoDataAsset*                                 Ammo;                                              // 0x1200(0x8)
	struct AIEncounterSpecification                              PawnEncounterSpec;                                 // 0x1208(0xd0)
	char                                                         pad0xe8_TXD6E[0xe8];                               // 0x12d8(0xe8)
};


// Size 0xe0 (Full Size[0x14a0] - InheritedSize[0x13c0]
class OceanCrawlerAICharacter: public AthenaAICharacter
{
public:
	char                                                         pad0x70_T5VE3[0x70];                               // 0x13c0(0x70)
	class HealthGemComponent*                                    HealthGemComponent;                                // 0x1430(0x8)
	class BuffReceiverComponent*                                 BuffReceiver;                                      // 0x1438(0x8)
	byte                                                         OceanCrawlerType;                                  // 0x1440(0x1)
	char                                                         pad0x7_48QSA[0x7];                                 // 0x1441(0x7)
	class CustomAnimationMontageComponent*                       MontageComponent;                                  // 0x1448(0x8)
	class AnimationServerData*                                   OceanCrawlerAnimationServerData;                   // 0x1450(0x8)
	float                                                        StaticCollisionRampAngleLimit;                     // 0x1458(0x4)
	bool                                                         ShouldPlayersInterruptBullRush;                    // 0x145c(0x1)
	bool                                                         SporeBreathActive;                                 // 0x145d(0x1)
	char                                                         pad0x42_741JR[0x42];                               // 0x145e(0x42)
};


// Size 0x160 (Full Size[0x2130] - InheritedSize[0x1fd0]
class AthenaGhostPlayerCharacter: public AthenaPlayerCharacter
{
public:
	char                                                         pad0xb0_FFI1C[0xb0];                               // 0x1fd0(0xb0)
	class GhostShipTickManager*                                  GhostShipTickManager;                              // 0x2080(0x8)
	char                                                         pad0xa8_R3OUW[0xa8];                               // 0x2088(0xa8)
};


// Size 0x0 (Full Size[0x2130] - InheritedSize[0x2130]
class AthenaGhostPlayerCharacterMock: public AthenaGhostPlayerCharacter
{
public:
};


// Size 0x338 (Full Size[0x400] - InheritedSize[0xc8]
class VoyageParticipantComponent: public ActorComponent
{
public:
	char                                                         pad0xa8_E8U8N[0xa8];                               // 0xc8(0xa8)
	class Actor*                                                 OwningPlayer;                                      // 0x170(0x8)
	struct VoyageParticipantViewContainer                        ViewContainer;                                     // 0x178(0x100)
	struct VoyageParticipantViewContainer                        PreviousViewContainer;                             // 0x278(0x100)
	char                                                         pad0x88_2X7JW[0x88];                               // 0x378(0x88)
};


// Size 0x30 (Full Size[0x2000] - InheritedSize[0x1fd0]
class AthenaPlayerCharacterMock: public AthenaPlayerCharacter
{
public:
	class AICreatureMovementModifierParamsDataAsset*             PetMovementParamsDataAsset;                        // 0x1fd0(0x8)
	bool                                                         AllowedToSwim;                                     // 0x1fd8(0x1)
	char                                                         pad0x27_6QPKK[0x27];                               // 0x1fd9(0x27)
};


// Size 0x1a0 (Full Size[0x21a0] - InheritedSize[0x2000]
class AthenaPlayerCharacterUnitTestMock: public AthenaPlayerCharacterMock
{
public:
	char                                                         pad0x178_KWX2H[0x178];                             // 0x2000(0x178)
	class UClass*                                                ExpectedActionStateId;                             // 0x2178(0x8)
	char                                                         pad0x20_9J2AI[0x20];                               // 0x2180(0x20)
};


// Size 0x50 (Full Size[0x2050] - InheritedSize[0x2000]
class AthenaPlayerCharacterMockWithAnimSeq: public AthenaPlayerCharacterMock
{
public:
	char                                                         pad0x50_T74II[0x50];                               // 0x2000(0x50)
};


// Size 0x120 (Full Size[0x148] - InheritedSize[0x28]
class AthenaCharacterMovementUnderwater: public DataAsset
{
public:
	bool                                                         bSphere;                                           // 0x28(0x1)
	char                                                         pad0x3_CPFQE[0x3];                                 // 0x29(0x3)
	float                                                        Radius;                                            // 0x2c(0x4)
	float                                                        HalfHeight;                                        // 0x30(0x4)
	float                                                        PenResolveInflation;                               // 0x34(0x4)
	float                                                        PullBackDistance;                                  // 0x38(0x4)
	float                                                        FanOutAngle;                                       // 0x3c(0x4)
	float                                                        MaxFanOutScalar;                                   // 0x40(0x4)
	float                                                        IdleBobSpeed;                                      // 0x48(0x4)
	float                                                        IdleBobDuration;                                   // 0x4c(0x4)
	struct FName                                                 CollisionProfileName;                              // 0x50(0x8)
	class CurveFloat*                                            VelocityToAngle;                                   // 0x58(0x8)
	bool                                                         bDrawDebugCapsule;                                 // 0x64(0x1)
	bool                                                         bDebugOldMovement;                                 // 0x65(0x1)
	char                                                         pad0xe2_OIPWO[0xe2];                               // 0x66(0xe2)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LocalDisturbanceFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x2d0 (Full Size[0x860] - InheritedSize[0x590]
class AthenaCharacterMovementComponent: public CharacterMovementComponent
{
public:
	char                                                         pad0x10_4ILIO[0x10];                               // 0x590(0x10)
	struct AthenaCharacterSwimParams                             SwimParams;                                        // 0x5a0(0x9c)
	float                                                        SprintSpdAmp;                                      // 0x63c(0x4)
	float                                                        SprintAccelAmp;                                    // 0x640(0x4)
	float                                                        LookAtYawRate;                                     // 0x644(0x4)
	float                                                        LookAtPitchRate;                                   // 0x648(0x4)
	char                                                         pad0x4_UCR14[0x4];                                 // 0x64c(0x4)
	float                                                        MaxSpeedRatioWhenWalkingInNonSwimWater;            // 0x650(0x4)
	float                                                        MaxAccelerationRatioWhenWalkingInNonSwimWater;     // 0x654(0x4)
	bool                                                         bCharacterCollisionSweepsEnabled;                  // 0x658(0x1)
	char                                                         pad0x3_2VG15[0x3];                                 // 0x659(0x3)
	float                                                        CharacterCollisionRadius;                          // 0x65c(0x4)
	struct CollisionProfileName                                  CharacterCollisionProfile;                         // 0x660(0x8)
	struct CollisionProfileName                                  CollisionPanicFallbackProfileName;                 // 0x668(0x8)
	float                                                        CharacterCollisionWalkingFriction;                 // 0x670(0x4)
	float                                                        CharacterCollisionSwimmingFriction;                // 0x674(0x4)
	float                                                        CharacterCollisionUnderwaterOffset;                // 0x678(0x4)
	float                                                        CharacterDepenetrationSmoothingMultiplier;         // 0x67c(0x4)
	class AthenaCharacterMovementUnderwater*                     UnderwaterMovement;                                // 0x680(0x8)
	bool                                                         bCreateDisturbance;                                // 0x688(0x1)
	char                                                         pad0x3_Y2RWJ[0x3];                                 // 0x689(0x3)
	float                                                        DisturbanceSize;                                   // 0x68c(0x4)
	float                                                        DisturbanceVelocityScale;                          // 0x690(0x4)
	bool                                                         UseAsRVOObstacleOnly;                              // 0x694(0x1)
	char                                                         pad0x63_0586P[0x63];                               // 0x695(0x63)
	float                                                        FanPushOutAngle;                                   // 0x6f8(0x4)
	int                                                          FanPushOutNumSteps;                                // 0x6fc(0x4)
	float                                                        MaxFanPushOutScalar;                               // 0x700(0x4)
	char                                                         pad0x4_O126P[0x4];                                 // 0x704(0x4)
	class CurveFloat*                                            UnderwaterVelocityToAnglePitchProjectileHitVolume; // 0x708(0x8)
	class CurveFloat*                                            UnderwaterVelocityToAngleRollProjectileHitVolume;  // 0x710(0x8)
	class CurveFloat*                                            UnderwaterVelocityToZOffsetProjectileHitVolume;    // 0x718(0x8)
	class CurveFloat*                                            OnLandVelocityToAnglePitchProjectileHitVolume;     // 0x720(0x8)
	class CurveFloat*                                            OnLandVelocityToXOffsetProjectileHitVolume;        // 0x728(0x8)
	class CurveFloat*                                            OnLandVelocityToYOffsetProjectileHitVolume;        // 0x730(0x8)
	class CurveFloat*                                            OnLandVelocityToZOffsetProjectileHitVolume;        // 0x738(0x8)
	class CurveFloat*                                            FallingVelocityToAnglePitchProjectileHitVolume;    // 0x740(0x8)
	class CurveFloat*                                            FallingVelocityToXOffsetProjectileHitVolume;       // 0x748(0x8)
	class CurveFloat*                                            FallingVelocityToZOffsetProjectileHitVolume;       // 0x750(0x8)
	char                                                         pad0xc8_L93I1[0xc8];                               // 0x758(0xc8)
	struct FName                                                 NonUnderwaterCollisionProfileName;                 // 0x820(0x8)
	struct FName                                                 UnderwaterCollisionProfileName;                    // 0x828(0x8)
	char                                                         pad0x30_FINOG[0x30];                               // 0x830(0x30)
};


// Size 0x150 (Full Size[0x9b0] - InheritedSize[0x860]
class AthenaPlayerCharacterMovementComponent: public AthenaCharacterMovementComponent
{
public:
	char                                                         pad0x8_DT5UG[0x8];                                 // 0x860(0x8)
	class CurveFloat*                                            LandingSpeedToFallDamageCurve;                     // 0x868(0x8)
	float                                                        MinFallSpeedToPossiblyCauseDamage;                 // 0x870(0x4)
	float                                                        MinTimeBetweenDamagingImpactsOnUnwalkableSurface;  // 0x874(0x4)
	float                                                        MinFallDamageToBreakLeg;                           // 0x878(0x4)
	float                                                        FiredFromActorFallDamageScalar;                    // 0x87c(0x4)
	float                                                        TimeUntilRecoverFallDamageAudioState;              // 0x880(0x4)
	char                                                         pad0x4_WLZQV[0x4];                                 // 0x884(0x4)
	struct Status                                                FallDamageLimpingStatus;                           // 0x888(0x18)
	float                                                        SwimmingStateFilterTime;                           // 0x8a0(0x4)
	char                                                         pad0x10c_E6K7X[0x10c];                             // 0x8a4(0x10c)
};


// Size 0x10 (Full Size[0x9c0] - InheritedSize[0x9b0]
class MockAthenaPlayerCharacterMovementComponent: public AthenaPlayerCharacterMovementComponent
{
public:
	char                                                         pad0x10_LMSL4[0x10];                               // 0x9b0(0x10)
};


// Size 0x0 (Full Size[0x2000] - InheritedSize[0x2000]
class MockAthenaPlayerCharacterWithAthenaPlayerCharacterMovementComponent: public AthenaPlayerCharacterMock
{
public:
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class StreamingLocationComponent: public ActorComponent
{
public:
	char                                                         pad0x8_TKG4S[0x8];                                 // 0xc8(0x8)
	struct StreamingLocation                                     StreamingLocationOverride;                         // 0xd0(0x10)
	bool                                                         StreamingLocationActive;                           // 0xe0(0x1)
	char                                                         pad0x7_NMO81[0x7];                                 // 0xe1(0x7)
};


// Size 0x70 (Full Size[0x2040] - InheritedSize[0x1fd0]
class AthenaTavernPlayerCharacter: public AthenaPlayerCharacter
{
public:
	class AICreatureMovementModifierParamsDataAsset*             ArenaTavernPetMovementData;                        // 0x1fd0(0x8)
	char                                                         pad0x30_4SX0I[0x30];                               // 0x1fd8(0x30)
	class AthenaPlayerController*                                PlayerController;                                  // 0x2008(0x8)
	char                                                         pad0x20_U0MLM[0x20];                               // 0x2010(0x20)
	bool                                                         VoteForRivalsHasPassed;                            // 0x2030(0x1)
	char                                                         pad0xf_KGT1S[0xf];                                 // 0x2031(0xf)
};


// Size 0x0 (Full Size[0x2040] - InheritedSize[0x2040]
class AthenaTavernPlayerCharacterMock: public AthenaTavernPlayerCharacter
{
public:
};


// Size 0x68 (Full Size[0x300] - InheritedSize[0x298]
class AthenaCharacterBaseLocomotionInputComponent: public AthenaCharacterBaseInputComponent
{
public:
	char                                                         pad0x60_748J0[0x60];                               // 0x298(0x60)
	class UClass*                                                ThrowablesItemCategory;                            // 0x2f8(0x8)
};


// Size 0x0 (Full Size[0x300] - InheritedSize[0x300]
class DebugFlyingInputComponent: public AthenaCharacterBaseLocomotionInputComponent
{
public:
};


// Size 0x0 (Full Size[0x300] - InheritedSize[0x300]
class LocomotionInputComponent: public AthenaCharacterBaseLocomotionInputComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaCharacterDockingFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class AthenaCharacterDodgeComponent: public ActorComponent
{
public:
	struct AthenaCharacterDodgeParams                            Params;                                            // 0xc8(0x10)
	float                                                        ConsecutiveDodgeCountResetTimer;                   // 0xd8(0x4)
	char                                                         pad0x4_2X0XA[0x4];                                 // 0xdc(0x4)
	class CurveFloat*                                            BunnyHoppingScalarCurve;                           // 0xe0(0x8)
	class AthenaCharacter*                                       Character;                                         // 0xe8(0x8)
	char                                                         pad0x18_EYS59[0x18];                               // 0xf0(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaCharacterFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x70 (Full Size[0x138] - InheritedSize[0xc8]
class AthenaCharacterKnockbackComponent: public ActorComponent
{
public:
	char                                                         pad0x8_C5WJ0[0x8];                                 // 0xc8(0x8)
	bool                                                         Disabled;                                          // 0xd0(0x1)
	char                                                         pad0x7_H2QCY[0x7];                                 // 0xd1(0x7)
	class AthenaCharacter*                                       Character;                                         // 0xd8(0x8)
	char                                                         pad0x58_MR2HU[0x58];                               // 0xe0(0x58)
};


// Size 0x0 (Full Size[0x138] - InheritedSize[0x138]
class AthenaCharacterKnockbackComponentMock: public AthenaCharacterKnockbackComponent
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class AthenaCharacterMovementCheatDetectionSettings: public Object
{
public:
	float                                                        MinLifetime;                                       // 0x28(0x4)
	float                                                        MinRatioLifetimeToLifetimeRawTimeDiscrepancy;      // 0x2c(0x4)
};


// Size 0x140 (Full Size[0x9a0] - InheritedSize[0x860]
class AthenaAICharacterMovementComponent: public AthenaCharacterMovementComponent
{
public:
	char                                                         pad0x10_MIP31[0x10];                               // 0x860(0x10)
	struct AIStrategyMovementProperties                          DefaultMovementProperties;                         // 0x870(0x18)
	TArray<struct AIStrategyMovementProperties>                  AIStrategyMovementProperties;                      // 0x888(0x10)
	TArray<struct ItemCategoryAIStrategyMovementPropertiesOverride> ItemCategoryAIStrategyMovementPropertiesOverrides; // 0x898(0x10)
	float                                                        BlendSpeed;                                        // 0x8a8(0x4)
	float                                                        KeepOnNavMeshProjectionDistance;                   // 0x8ac(0x4)
	bool                                                         bDebugKeepOnNavMesh;                               // 0x8b0(0x1)
	bool                                                         DisableNavMeshChecks;                              // 0x8b1(0x1)
	bool                                                         OverrideSmoothNetUpdateDistancesDuringCharge;      // 0x8b2(0x1)
	char                                                         pad0x1_LPHCE[0x1];                                 // 0x8b3(0x1)
	float                                                        ChargeMaxSmoothNetUpdateDist;                      // 0x8b4(0x4)
	float                                                        ChargeNoSmoothNetUpdateDist;                       // 0x8b8(0x4)
	float                                                        ChargeSmoothNetUpdateGracePeriod;                  // 0x8bc(0x4)
	char                                                         pad0xc0_E67PB[0xc0];                               // 0x8c0(0xc0)
	float                                                        DesiredMaxSpeedAmp;                                // 0x980(0x4)
	float                                                        DesiredMaxAccelAmp;                                // 0x984(0x4)
	char                                                         pad0x18_8CNAW[0x18];                               // 0x988(0x18)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class AthenaCharacterMovementSettings: public Object
{
public:
	struct NetPositionErrorTolerance                             StandardError;                                     // 0x28(0x8)
	struct NetPositionErrorTolerance                             SwimmingError;                                     // 0x30(0x8)
	float                                                        SwimmingClientTrustThreshold;                      // 0x38(0x4)
	float                                                        MaxSwimmingTimeStep;                               // 0x3c(0x4)
	int                                                          MaxSwimmingIterations;                             // 0x40(0x4)
	float                                                        RebaseToServerErrorSqrDist;                        // 0x44(0x4)
	float                                                        OnlyInterpolationAfterSqrDist;                     // 0x48(0x4)
	float                                                        InterpolationSqrDistWhenWithinConeAngle;           // 0x4c(0x4)
	float                                                        IncreasedInterpolationDistConeAngleDegrees;        // 0x50(0x4)
	bool                                                         OnlyUseInterpolationConeAngleForPlayerCharacters;  // 0x54(0x1)
	char                                                         pad0x3_IV81A[0x3];                                 // 0x55(0x3)
	float                                                        NoVisualUpdateAfterSqrDist;                        // 0x58(0x4)
	float                                                        TimeBetweenPlayerDistanceChecks;                   // 0x5c(0x4)
	float                                                        TimeBetweenPlayerDistanceChecksWhenConsideringConeAngle; // 0x60(0x4)
	float                                                        TimeToSimulateNewCharacters;                       // 0x64(0x4)
};


// Size 0xc0 (Full Size[0x188] - InheritedSize[0xc8]
class AthenaCharacterStateManagerComponent: public ActorComponent
{
public:
	char                                                         pad0xc0_0ECIK[0xc0];                               // 0xc8(0xc0)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaCharacterTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class AthenaContestTavern: public Actor
{
public:
	TArray<class SpawnLocation*>                                 TavernSpawnPoints;                                 // 0x3c8(0x10)
	TArray<class Actor*>                                         TavernLevelActorsToPrepare;                        // 0x3d8(0x10)
	char                                                         pad0x18_YU2AS[0x18];                               // 0x3e8(0x18)
};


// Size 0x8 (Full Size[0xd0] - InheritedSize[0xc8]
class PlayerPermissionsComponent: public ActorComponent
{
public:
	bool                                                         AllowDebugMenuAccess;                              // 0xc8(0x1)
	bool                                                         AllowDebugMenuButtonShortcutsAccess;               // 0xc9(0x1)
	bool                                                         AllowExecuteOnServer;                              // 0xca(0x1)
	bool                                                         DisableWatermark;                                  // 0xcb(0x1)
	char                                                         pad0x4_ZNC0E[0x4];                                 // 0xcc(0x4)
};


// Size 0x10 (Full Size[0x128] - InheritedSize[0x118]
class AthenaDebugMenuComponent: public DebugMenuComponent
{
public:
	char                                                         pad0x10_7LD8J[0x10];                               // 0x118(0x10)
};


// Size 0x10 (Full Size[0x138] - InheritedSize[0x128]
class TestAthenaDebugMenuComponent: public AthenaDebugMenuComponent
{
public:
	class PlayerPermissionsComponent*                            TestPermissionComponent;                           // 0x128(0x8)
	char                                                         pad0x8_BEQI4[0x8];                                 // 0x130(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AthenaDebugSettings: public Object
{
public:
	struct StringAssetReference                                  Dioramas;                                          // 0x28(0x10)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class AthenaEditorRuntimeSettings: public DeveloperSettings
{
public:
	int                                                          PIECrewSize;                                       // 0x38(0x4)
	bool                                                         PIEWithBootflow;                                   // 0x3c(0x1)
	char                                                         pad0x3_UFX02[0x3];                                 // 0x3d(0x3)
	class UClass*                                                PIEShipSize;                                       // 0x40(0x8)
	bool                                                         PIEIsInitialTutorial;                              // 0x48(0x1)
	bool                                                         PIEIsArenaGame;                                    // 0x49(0x1)
	bool                                                         PIEIsCaptain;                                      // 0x4a(0x1)
	bool                                                         PIEIsGuildedSession;                               // 0x4b(0x1)
	int                                                          PIEGuildMembersOnCrew;                             // 0x4c(0x4)
	bool                                                         PIEIsCustomServer;                                 // 0x50(0x1)
	bool                                                         PIEIsSaferSeasServer;                              // 0x51(0x1)
	byte                                                         SessionStyle;                                      // 0x52(0x1)
	char                                                         pad0x5_6JBUW[0x5];                                 // 0x53(0x5)
	TArray<struct AthenaAnimationOverrideEntry>                  AnimationOverrideEntries;                          // 0x58(0x10)
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class AthenaPlayModeLevelsDataAsset: public DataAsset
{
public:
	struct PlayModeLevelArray                                    PlayModeSpecificLevels;                            // 0x28(0x20)
	char                                                         pad0x60_8MYAA[0x60];                               // 0x48(0x60)
	TArray<struct StringAssetReference>                          CommonLevels;                                      // 0xa8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class UserBannedHandlerRetrievalInterface: public Interface
{
public:
};


// Size 0x848 (Full Size[0x870] - InheritedSize[0x28]
class AthenaGameContext: public Object
{
public:
	char                                                         pad0x80_K0G5Q[0x80];                               // 0x28(0x80)
	class VoiceChatRenderer*                                     VoiceChatRenderer;                                 // 0xa8(0x8)
	class AthenaPlayModeLevelsDataAsset*                         PlayModeLevels;                                    // 0xb0(0x8)
	class FeatureToggledLevelsDataAsset*                         FeatureToggledLevels;                              // 0xb8(0x8)
	char                                                         pad0x1a0_IFC4U[0x1a0];                             // 0xc0(0x1a0)
	class GameInstance*                                          PrimaryGameInstance;                               // 0x260(0x8)
	class AthenaServerIdentityManager*                           AthenaServerIdentityManager;                       // 0x268(0x8)
	struct GameServiceCoordinator                                ServiceCoordinator;                                // 0x270(0x20)
	char                                                         pad0x258_FDVM8[0x258];                             // 0x290(0x258)
	class AthenaLocalPlayerManager*                              AthenaLocalPlayerManager;                          // 0x4e8(0x8)
	class AthenaLocalPlayerReengage*                             AthenaLocalPlayerReengage;                         // 0x4f0(0x8)
	class GameNarrationCoordinator*                              GameNarrationCoordinator;                          // 0x4f8(0x8)
	class ApplicationSettings*                                   ApplicationSettings;                               // 0x500(0x8)
	char                                                         pad0x368_R6UM3[0x368];                             // 0x508(0x368)
};


// Size 0x20 (Full Size[0xaa8] - InheritedSize[0xa88]
class AthenaGameEngine: public RareGameEngine
{
public:
	char                                                         pad0x8_3AE9I[0x8];                                 // 0xa88(0x8)
	class AthenaGameEngineSettings*                              EngineSettings;                                    // 0xa90(0x8)
	char                                                         pad0x10_6G252[0x10];                               // 0xa98(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaGameEngineSettingsInterface: public Interface
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AthenaGameEngineSettings: public Object
{
public:
	char                                                         pad0x28_IWSUI[0x28];                               // 0x28(0x28)
};


// Size 0x20 (Full Size[0x70] - InheritedSize[0x50]
class AthenaGameEngineSettingsWindows: public AthenaGameEngineSettings
{
public:
	char                                                         pad0x20_EYM1K[0x20];                               // 0x50(0x20)
};


// Size 0x48 (Full Size[0xd0] - InheritedSize[0x88]
class AthenaGameInstance: public GameInstance
{
public:
	char                                                         pad0x8_Z30J2[0x8];                                 // 0x88(0x8)
	class AthenaPlayModeLevelsDataAsset*                         AdditionalPlayModeLevels;                          // 0x90(0x8)
	class AthenaGameContext*                                     GameContext;                                       // 0xa0(0x8)
	char                                                         pad0x28_FI2PY[0x28];                               // 0xa8(0x28)
};


// Size 0x688 (Full Size[0xb48] - InheritedSize[0x4c0]
class AthenaGameMode: public GameMode
{
public:
	char                                                         pad0x30_WIUUC[0x30];                               // 0x4c0(0x30)
	class UClass*                                                GhostShipPawnClass;                                // 0x4f0(0x8)
	class UClass*                                                ServerNetworkedEventsWhitelistDefinition;          // 0x4f8(0x8)
	char                                                         pad0x1a8_R820U[0x1a8];                             // 0x500(0x1a8)
	struct GhostShipCoordinator                                  GhostShipCoordinator;                              // 0x6a8(0x370)
	struct StorageContainerRefresher                             StorageContainerRefresher;                         // 0xa18(0xf8)
	class RiddleQuestDescGeneratorData*                          RiddleQuestDescGeneratorData;                      // 0xb10(0x8)
	float                                                        RespawnTimer;                                      // 0xb18(0x4)
	float                                                        ContestRespawnTimer;                               // 0xb1c(0x4)
	struct CrewBasedRespawnTimes                                 CrewBasedRespawnTimes;                             // 0xb20(0x10)
	float                                                        StorageContainerRefreshInterval;                   // 0xb30(0x4)
	int                                                          ContainerRefreshBatchSize;                         // 0xb34(0x4)
	char                                                         pad0x10_OIKRG[0x10];                               // 0xb38(0x10)
};


// Size 0x210 (Full Size[0xd58] - InheritedSize[0xb48]
class OnlineAthenaGameMode: public AthenaGameMode
{
public:
	char                                                         pad0x210_F93E8[0x210];                             // 0xb48(0x210)
};


// Size 0x8 (Full Size[0xb50] - InheritedSize[0xb48]
class TestAthenaGameMode: public AthenaGameMode
{
public:
	char                                                         pad0x8_HTWLY[0x8];                                 // 0xb48(0x8)
};


// Size 0x0 (Full Size[0xb50] - InheritedSize[0xb50]
class TestAthenaGameModeWithHUD: public TestAthenaGameMode
{
public:
};


// Size 0x0 (Full Size[0xb48] - InheritedSize[0xb48]
class TestInventoryAthenaGameMode: public AthenaGameMode
{
public:
};


// Size 0x90 (Full Size[0x880] - InheritedSize[0x7f0]
class AthenaGameplayDebuggingComponent: public GameplayDebuggingComponent
{
public:
	TArray<Str CurrentServerActionStates>                        CurrentServerActionStates;                         // 0x7e8(0x10)
	class UClass*                                                CurrentAIStrategyId;                               // 0x7f8(0x8)
	TArray<struct DebugReplicatedAbilityData>                    CachedAIAbilities;                                 // 0x800(0x10)
	TArray<struct AthenaAIControllerTargetPickingData>           CachedAITargetPickingData;                         // 0x810(0x10)
	class UClass*                                                NextAbility;                                       // 0x820(0x8)
	class UClass*                                                QueuedAbility;                                     // 0x828(0x8)
	TArray<class Class*>                                         ReadiedAbilities;                                  // 0x830(0x10)
	class AthenaAIAbilityHandlerComponent*                       AIAbilityComponent;                                // 0x840(0x8)
	bool                                                         FollowUpAbilitySet;                                // 0x848(0x1)
	char                                                         pad0x3_9G6DR[0x3];                                 // 0x849(0x3)
	int                                                          CurrentAbilityStageIndex;                          // 0x84c(0x4)
	TArray<class Class*>                                         AbilitiesActiveInCurrentStage;                     // 0x850(0x10)
	char                                                         pad0x20_6TIEY[0x20];                               // 0x860(0x20)
};


// Size 0x0 (Full Size[0x4b8] - InheritedSize[0x4b8]
class AthenaGameplayDebuggingHUDComponent: public GameplayDebuggingHUDComponent
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ShovelSurfaceFxDataAsset: public DataAsset
{
public:
	TArray<struct DigSurfaceTypeParams>                          SurfaceParams;                                     // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ShovelSurfaceHoleDataAsset: public DataAsset
{
public:
	TArray<struct SurfaceDigHole>                                SurfaceDigHoleClass;                               // 0x28(0x10)
};


// Size 0x9f0 (Full Size[0xa18] - InheritedSize[0x28]
class AthenaGameSettings: public Object
{
public:
	int                                                          NumberOfDaysInEachMonth;                           // 0x28(0x4)
	char                                                         pad0x4_DP9QB[0x4];                                 // 0x2c(0x4)
	struct FString                                               EntryMap;                                          // 0x30(0x10)
	struct FString                                               FrontendMap;                                       // 0x40(0x10)
	struct FString                                               InGameMap;                                         // 0x50(0x10)
	struct FString                                               TutorialMap;                                       // 0x60(0x10)
	struct StringAssetReference                                  PlayModeLevels;                                    // 0x70(0x10)
	struct StringAssetReference                                  FeatureToggledLevels;                              // 0x80(0x10)
	struct FString                                               OverrideServerURL;                                 // 0x90(0x10)
	float                                                        LoadLevelTimeoutTime;                              // 0xa0(0x4)
	float                                                        ServiceBridgeConnectTimeout;                       // 0xa4(0x4)
	TArray<Assetclass MaidenVoyageProgressionEntitlements>       MaidenVoyageProgressionEntitlements;               // 0xa8(0x10)
	struct StringAssetReference                                  CinematicCameraControllerClass;                    // 0x118(0x10)
	struct StringAssetReference                                  CinematicCameraSpectatorPawnClass;                 // 0x128(0x10)
	struct StringAssetReference                                  MaterialTranslationTableFileLocation;              // 0x138(0x10)
	struct StringAssetReference                                  MaterialAudioTableFileLocation;                    // 0x148(0x10)
	struct StringAssetReference                                  MaterialVFXTableFileLocation;                      // 0x158(0x10)
	struct StringAssetReference                                  ShipAssetClassDatabaseFileLocation;                // 0x168(0x10)
	struct StringAssetReference                                  DebugMenuFileLocation;                             // 0x178(0x10)
	struct StringAssetReference                                  SpawnLocationKeywordPriorityListLocation;          // 0x188(0x10)
	struct StringAssetReference                                  CrewSpawnLocationVariablesListAsset;               // 0x198(0x10)
	struct StringAssetReference                                  SkellyFortDataFileLocation;                        // 0x1a8(0x10)
	struct StringAssetReference                                  SkellyFortListDataFileLocation;                    // 0x1b8(0x10)
	struct StringAssetReference                                  AIShipServiceDataAssetFileLocation;                // 0x1c8(0x10)
	struct ToggleableAIShipServiceDataAssetFileLocation          AIShipServiceDataAssetFileLocationOverride;        // 0x1d8(0x18)
	struct StringAssetReference                                  EnemyAIOnShipServiceDataAssetFileLocation;         // 0x1f0(0x10)
	struct StringAssetReference                                  ProjectileServiceDataFileLocation;                 // 0x200(0x10)
	struct StringAssetReference                                  ThrottledProjectileTickDataAssetLocation;          // 0x210(0x10)
	struct StringAssetReference                                  HoleDataFileLocation;                              // 0x220(0x10)
	struct StringAssetReference                                  PlayerBuriedItemServiceDataFileLocation;           // 0x230(0x10)
	struct StringAssetReference                                  ItemLifetimeIslandCapsDataFileLocation;            // 0x240(0x10)
	struct StringAssetReference                                  CursedCannonballDataAsset;                         // 0x250(0x10)
	struct StringAssetReference                                  Throwables;                                        // 0x260(0x10)
	struct StringClassReference                                  ThrowablesItemCategory;                            // 0x270(0x10)
	struct StringAssetReference                                  SpawnableItemsDataAssetLocation;                   // 0x280(0x10)
	struct StringAssetReference                                  FireworksDebugSpawnItemsDataAsset;                 // 0x290(0x10)
	struct StringAssetReference                                  UnlockableEntitlementsDataAssetLocation;           // 0x2a0(0x10)
	struct StringAssetReference                                  DebugWieldablesDataAsset;                          // 0x2b0(0x10)
	struct StringAssetReference                                  StrongholdKeyDataAsset;                            // 0x2c0(0x10)
	struct StringAssetReference                                  MigrationUIContentsFileLocation;                   // 0x2d0(0x10)
	struct StringAssetReference                                  ArenaMigrationUIContentsFileLocation;              // 0x2e0(0x10)
	struct StringAssetReference                                  InventoryRemappingAssetLocation;                   // 0x2f0(0x10)
	struct StringAssetReference                                  AllianceSettingsAssetLocation;                     // 0x300(0x10)
	struct StringAssetReference                                  ReapersMarkSettingsAssetLocation;                  // 0x310(0x10)
	struct StringAssetReference                                  EmissaryLevelSettingsAssetLocation;                // 0x320(0x10)
	struct StringAssetReference                                  EmissaryRewardSettingsAssetLocation;               // 0x330(0x10)
	struct StringAssetReference                                  FactionSettingsAssetLocation;                      // 0x340(0x10)
	struct StringAssetReference                                  FactionLootLevelRewardsAssetLocation;              // 0x350(0x10)
	struct StringAssetReference                                  FlamesOfFateSettingsAssetLocation;                 // 0x360(0x10)
	struct StringAssetReference                                  DiggingConfigResolverAssetLocation;                // 0x370(0x10)
	struct StringAssetReference                                  ContestSettingsDataAsset;                          // 0x380(0x10)
	struct StringAssetReference                                  ContestEventsDataAsset;                            // 0x390(0x10)
	struct StringAssetReference                                  CrewNotificationToastSettings;                     // 0x3a0(0x10)
	struct StringAssetReference                                  FireSettingsDataAsset;                             // 0x3b0(0x10)
	struct FString                                               InventoryDefaultItemURL;                           // 0x3c0(0x10)
	float                                                        CheatFlyingSpeedSlow;                              // 0x3d0(0x4)
	float                                                        CheatFlyingSpeedDefault;                           // 0x3d4(0x4)
	float                                                        CheatFlyingSpeedFast;                              // 0x3d8(0x4)
	float                                                        CheatFlyingAcceleration;                           // 0x3dc(0x4)
	struct EncounterServiceParams                                EncounterServiceParams;                            // 0x3e0(0x20)
	struct WindServiceParams                                     WindParams;                                        // 0x400(0x24)
	char                                                         pad0x4_TTB8L[0x4];                                 // 0x424(0x4)
	struct CrewServiceParams                                     CrewServiceParams;                                 // 0x428(0x70)
	struct SharedShovelParams                                    SharedShovelParams;                                // 0x498(0x60)
	struct MermaidServiceParams                                  MermaidServiceParams;                              // 0x4f8(0x8c)
	struct MermaidServiceParams                                  ContestSpecificMermaidServiceParamsToggleLocked;   // 0x584(0x8c)
	struct MermaidServiceParams                                  InvasionSpecificMermaidServiceParams;              // 0x610(0x8c)
	char                                                         pad0x4_G6HE0[0x4];                                 // 0x69c(0x4)
	struct MakeFriendsEmoteParams                                MakeFriendsEmoteParams;                            // 0x6a0(0x18)
	struct MermaidRespawnConfig                                  MermaidRespawnConfiguration;                       // 0x6b8(0x28)
	struct CharacterSocketCollisionServiceParams                 CharacterSocketCollisionServiceParams;             // 0x6e0(0x8)
	struct AthenaAICharacterParams                               AAthenaAICharacterParams;                          // 0x6e8(0x14)
	int                                                          AssumedMaxFPSOnServer;                             // 0x6fc(0x4)
	struct FName                                                 WwiseObjectUnderwaterStateSwitchGroup;             // 0x700(0x8)
	struct FName                                                 WwiseObjectUnderwaterSwitchDefaultState;           // 0x708(0x8)
	struct FName                                                 WwiseObjectUnderwaterSwitchUnderwaterState;        // 0x710(0x8)
	float                                                        StormQuantisePrecision;                            // 0x718(0x4)
	char                                                         pad0x4_GIP32[0x4];                                 // 0x71c(0x4)
	struct StringAssetReference                                  ShipLiveryCatalogueDataAssetLocation;              // 0x720(0x10)
	struct StringAssetReference                                  ShipPartsCatalogueDataAssetLocation;               // 0x730(0x10)
	struct StringAssetReference                                  RowboatSpawnParamsDataAssetLocation;               // 0x740(0x10)
	struct StringAssetReference                                  HarpoonLauncherItemExclusionDataAssetLocation;     // 0x750(0x10)
	struct StringAssetReference                                  KrakenTentacleClassLocation;                       // 0x760(0x10)
	struct StringAssetReference                                  KrakenShipTentacleClassLocation;                   // 0x770(0x10)
	struct StringAssetReference                                  KrakenServiceParamsDataAssetLocation;              // 0x780(0x10)
	struct StringAssetReference                                  AmbientTinySharkServiceParamsDataAssetLocation;    // 0x790(0x10)
	struct StringAssetReference                                  SunkenIslandSettings;                              // 0x7a0(0x10)
	struct StringAssetReference                                  CompanyDataListAssetLocation;                      // 0x7b0(0x10)
	struct StringAssetReference                                  CoherentUIGTAssetRootLocation;                     // 0x7c0(0x10)
	struct StringAssetReference                                  CoherentUIGTPersistentDataAssetLocation;           // 0x7d0(0x10)
	struct StringAssetReference                                  CoherentContentEngagementMessageLocation;          // 0x7e0(0x10)
	struct StringAssetReference                                  NestedWorldRootDataAssetLocation;                  // 0x7f0(0x10)
	struct StringAssetReference                                  AshenLordEncounterServiceParams;                   // 0x800(0x10)
	struct StringAssetReference                                  PortalServiceParams;                               // 0x810(0x10)
	struct StringAssetReference                                  AggressiveGhostShipsEncounterServiceParams;        // 0x820(0x10)
	TArray<Assetclass RequiredLoadoutCategories>                 RequiredLoadoutCategories;                         // 0x830(0x10)
	struct StringAssetReference                                  CarouselGenerationParams;                          // 0x840(0x10)
	float                                                        SinkingShipDestructionDistanceThreshold;           // 0x850(0x4)
	char                                                         pad0x4_B699F[0x4];                                 // 0x854(0x4)
	struct StringAssetReference                                  DefaultItemsToBeDisplayedOnInventoryPanel;         // 0x858(0x10)
	struct StringClassReference                                  DefaultFogBank;                                    // 0x868(0x10)
	struct StringClassReference                                  DefaultFogBankManager;                             // 0x878(0x10)
	struct StringAssetReference                                  TunnelsOfTheDamnedServiceParamsDataAssetLocation;  // 0x888(0x10)
	struct PlayerModerationParams                                PlayerModerationParams;                            // 0x898(0xc)
	char                                                         pad0x4_3MK1Q[0x4];                                 // 0x8a4(0x4)
	struct StringAssetReference                                  SpireServiceParamsDataAssetLocation;               // 0x8a8(0x10)
	struct StringClassReference                                  GhostCurseEntitlement;                             // 0x8b8(0x10)
	struct FName                                                 GhostCurseRewardId;                                // 0x8c8(0x8)
	struct StringClassReference                                  GoldGhostCurseEntitlement;                         // 0x8d0(0x10)
	struct FName                                                 GoldGhostCurseRewardId;                            // 0x8e0(0x8)
	struct StringClassReference                                  SkeletonCurseEntitlement;                          // 0x8e8(0x10)
	struct FName                                                 SkeletonCurseRewardId;                             // 0x8f8(0x8)
	struct FName                                                 SkeletonCurseWardrobeKey;                          // 0x900(0x8)
	TArray<Assetclass SkeletonClothingCategories>                SkeletonClothingCategories;                        // 0x908(0x10)
	struct StringAssetReference                                  SkeletonClothingEntitlementMapDataAsset;           // 0x918(0x10)
	TArray<Byte KillNotificationHealthChangeReasons>             KillNotificationHealthChangeReasons;               // 0x928(0x10)
	struct StringAssetReference                                  ShipStorageJettisonParamsDataAsset;                // 0x938(0x10)
	struct StringAssetReference                                  WorldEdgeItemParamsDataAsset;                      // 0x948(0x10)
	struct StringAssetReference                                  PlayerLootMarkerServiceParamsFileLocation;         // 0x958(0x10)
	struct StringAssetReference                                  AdventureOnDemandServiceParamsAssetFileLocation;   // 0x968(0x10)
	struct StringAssetReference                                  AdventureOnDemandVoyageSelectionDataAssetFileLocation; // 0x978(0x10)
	struct StringAssetReference                                  QuestTableAdventureOnDemandParamsFileLocation;     // 0x988(0x10)
	struct SeaOfThievesOnDemandTreasurePopupConversionTable      SeaOfThievesOnDemandRewardPopupsConversionTable;   // 0x998(0x10)
	struct StringAssetReference                                  SkellyFortAvailabilityParamsAssetFileLocation;     // 0x9a8(0x10)
	struct StringAssetReference                                  KrakenAvailabilityParamsAssetFileLocation;         // 0x9b8(0x10)
	struct StringAssetReference                                  AshenLordAvailabilityParamsAssetFileLocation;      // 0x9c8(0x10)
	struct StringAssetReference                                  AggressiveGhostShipEncounterAvailabilityParamsAssetFileLocation; // 0x9d8(0x10)
	struct StringAssetReference                                  AIShipBattleAvailabilityParamsAssetFileLocation;   // 0x9e8(0x10)
	struct StringAssetReference                                  CompetitiveVoyagesServiceParamsDataAsset;          // 0x9f8(0x10)
	TArray<struct RareGameServiceSpecification>                  GameContextServiceSpecifications;                  // 0xa08(0x10)
};


// Size 0x760 (Full Size[0xca0] - InheritedSize[0x540]
class AthenaGameState: public ServiceProviderGameState
{
public:
	char                                                         pad0x78_SIIZI[0x78];                               // 0x540(0x78)
	class WindService*                                           WindService;                                       // 0x5b8(0x8)
	class PlayerManagerService*                                  PlayerManagerService;                              // 0x5c0(0x8)
	class ShipService*                                           ShipService;                                       // 0x5c8(0x8)
	class WatercraftService*                                     WatercraftService;                                 // 0x5d0(0x8)
	class TimeService*                                           TimeService;                                       // 0x5d8(0x8)
	class HealthCustomizationService*                            HealthService;                                     // 0x5e0(0x8)
	class CustomWeatherService*                                  CustomWeatherService;                              // 0x5e8(0x8)
	class CustomStatusesService*                                 CustomStatusesService;                             // 0x5f0(0x8)
	class FFTWaterService*                                       WaterService;                                      // 0x5f8(0x8)
	class StormService*                                          StormService;                                      // 0x600(0x8)
	class CrewService*                                           CrewService;                                       // 0x608(0x8)
	class CaptainedSessionService*                               CaptainedSessionService;                           // 0x610(0x8)
	class ContestZoneService*                                    ContestZoneService;                                // 0x618(0x8)
	class IslandService*                                         IslandService;                                     // 0x620(0x8)
	class NPCService*                                            NPCService;                                        // 0x628(0x8)
	class SkellyFortService*                                     SkellyFortService;                                 // 0x630(0x8)
	class DeepSeaRegionService*                                  DeepSeaRegionService;                              // 0x638(0x8)
	class AIActionSpotService*                                   AIActionSpotService;                               // 0x640(0x8)
	class AIDioramaService*                                      AIDioramaService;                                  // 0x648(0x8)
	class AshenLordEncounterService*                             AshenLordEncounterService;                         // 0x650(0x8)
	class AggressiveGhostShipsEncounterService*                  AggressiveGhostShipsEncounterService;              // 0x658(0x8)
	class TallTaleService*                                       TallTaleService;                                   // 0x660(0x8)
	class AIShipObstacleService*                                 AIShipObstacleService;                             // 0x668(0x8)
	class AIShipService*                                         AIShipService;                                     // 0x670(0x8)
	class AITargetService*                                       AITargetService;                                   // 0x678(0x8)
	class ShipLiveryCatalogueService*                            ShipLiveryCatalogueService;                        // 0x680(0x8)
	class DrawDebugService*                                      DrawDebugService;                                  // 0x688(0x8)
	class WorldEventZoneService*                                 WorldEventZoneService;                             // 0x690(0x8)
	class WorldResourceRegistry*                                 WorldResourceRegistry;                             // 0x698(0x8)
	class KrakenService*                                         KrakenService;                                     // 0x6a0(0x8)
	class PlayerNameService*                                     PlayerNameService;                                 // 0x6a8(0x8)
	class TinySharkService*                                      TinySharkService;                                  // 0x6b0(0x8)
	class ProjectileService*                                     ProjectileService;                                 // 0x6b8(0x8)
	class ProjectileHitRegService*                               ProjectileHitRegService;                           // 0x6c0(0x8)
	class LaunchableProjectileService*                           LaunchableProjectileService;                       // 0x6c8(0x8)
	class ServerNotificationsService*                            ServerNotificationsService;                        // 0x6d0(0x8)
	class AIManagerService*                                      AIManagerService;                                  // 0x6d8(0x8)
	class AIEncounterService*                                    AIEncounterService;                                // 0x6e0(0x8)
	class AIEncounterGenerationService*                          AIEncounterGenerationService;                      // 0x6e8(0x8)
	class EncounterService*                                      EncounterService;                                  // 0x6f0(0x8)
	class GameEventSchedulerService*                             GameEventSchedulerService;                         // 0x6f8(0x8)
	class GameEventsOnDemandAvailabilityService*                 GameEventsOnDemandAvailabilityService;             // 0x700(0x8)
	class GameEventsOnDemandLoserTunnelService*                  GameEventsOnDemandLoserTunnelService;              // 0x708(0x8)
	class HideoutService*                                        HideoutService;                                    // 0x710(0x8)
	class AthenaStreamedLevelService*                            StreamedLevelService;                              // 0x718(0x8)
	class LocationProviderService*                               LocationProviderService;                           // 0x720(0x8)
	class HoleService*                                           HoleService;                                       // 0x728(0x8)
	class PlayerBuriedItemService*                               PlayerBuriedItemService;                           // 0x730(0x8)
	class LoadoutService*                                        LoadoutService;                                    // 0x738(0x8)
	class OcclusionService*                                      OcclusionService;                                  // 0x740(0x8)
	class PetsService*                                           PetsService;                                       // 0x748(0x8)
	class AthenaAITeamsService*                                  AthenaAITeamsService;                              // 0x750(0x8)
	class AllianceService*                                       AllianceService;                                   // 0x758(0x8)
	class MaterialAccessibilityService*                          MaterialAccessibilityService;                      // 0x760(0x8)
	class NPCLoadedOnClientService*                              NPCLoadedOnClientService;                          // 0x768(0x8)
	class ReapersMarkService*                                    ReapersMarkService;                                // 0x770(0x8)
	class EmissaryLevelService*                                  EmissaryLevelService;                              // 0x778(0x8)
	class FactionService*                                        FactionService;                                    // 0x780(0x8)
	class CampaignService*                                       CampaignService;                                   // 0x788(0x8)
	class StoryService*                                          StoryService;                                      // 0x790(0x8)
	class StorySpawnedActorsService*                             StorySpawnedActorsService;                         // 0x798(0x8)
	class StoryClaimedResourcesService*                          StoryClaimedResourcesService;                      // 0x7a0(0x8)
	class GlobalVoyageDirectorService*                           GlobalVoyageDirector;                              // 0x7a8(0x8)
	class UtilityVoyageService*                                  UtilityVoyageService;                              // 0x7b0(0x8)
	class FlamesOfFateSettingsService*                           FlamesOfFateSettingsService;                       // 0x7b8(0x8)
	class ServiceStatusNotificationsService*                     ServiceStatusNotificationsService;                 // 0x7c0(0x8)
	class MigrationService*                                      MigrationService;                                  // 0x7c8(0x8)
	class ShipStockService*                                      ShipStockService;                                  // 0x7d0(0x8)
	class ShroudBreakerService*                                  ShroudBreakerService;                              // 0x7d8(0x8)
	class ServerUpdateReportingService*                          ServerUpdateReportingService;                      // 0x7e0(0x8)
	class GenericMarkerService*                                  GenericMarkerService;                              // 0x7e8(0x8)
	class MechanismsService*                                     MechanismsService;                                 // 0x7f0(0x8)
	class MerchantContractsService*                              MerchantContractsService;                          // 0x7f8(0x8)
	class ShipFactory*                                           ShipFactory;                                       // 0x800(0x8)
	class RewindPhysicsService*                                  RewindPhysicsService;                              // 0x808(0x8)
	class NotificationMessagesDataAsset*                         NotificationMessagesDataAsset;                     // 0x810(0x8)
	class ProjectileCooldownService*                             ProjectileCooldownService;                         // 0x818(0x8)
	class IslandReservationService*                              IslandReservationService;                          // 0x820(0x8)
	class PortalService*                                         PortalService;                                     // 0x828(0x8)
	class MeshMemoryConstraintService*                           MeshMemoryConstraintService;                       // 0x830(0x8)
	class BootyStorageService*                                   BootyStorageService;                               // 0x838(0x8)
	class LoadoutCostService*                                    LoadoutCostService;                                // 0x840(0x8)
	class SpireService*                                          SpireService;                                      // 0x848(0x8)
	class FireworkService*                                       FireworkService;                                   // 0x850(0x8)
	class InvasionService*                                       InvasionService;                                   // 0x858(0x8)
	class AirGivingService*                                      AirGivingService;                                  // 0x860(0x8)
	class CutsceneService*                                       CutsceneService;                                   // 0x868(0x8)
	class CargoRunService*                                       CargoRunService;                                   // 0x870(0x8)
	class CommodityDemandService*                                CommodityDemandService;                            // 0x878(0x8)
	class DebugTeleportationDestinationService*                  DebugTeleportationDestinationService;              // 0x880(0x8)
	class SeasonProgressionUIService*                            SeasonProgressionUIService;                        // 0x888(0x8)
	class TransientActorService*                                 TransientActorService;                             // 0x890(0x8)
	class TunnelsOfTheDamnedService*                             TunnelsOfTheDamnedService;                         // 0x898(0x8)
	class WorldSequenceService*                                  WorldSequenceService;                              // 0x8a0(0x8)
	class ItemLifetimeManagerService*                            ItemLifetimeManagerService;                        // 0x8a8(0x8)
	class ShipStorageJettisonService*                            ShipStorageJettisonService;                        // 0x8b0(0x8)
	class SeaFortsService*                                       SeaFortsService;                                   // 0x8b8(0x8)
	class CustomServerLocalisationService*                       CustomServerLocalisationService;                   // 0x8c0(0x8)
	class BeckonService*                                         BeckonService;                                     // 0x8c8(0x8)
	class VolcanoService*                                        VolcanoService;                                    // 0x8d0(0x8)
	class ShipAnnouncementService*                               ShipAnnouncementService;                           // 0x8d8(0x8)
	class ShipsLogService*                                       ShipsLogService;                                   // 0x8e0(0x8)
	class AsyncLoadingMonitoringService*                         AsyncLoadingMonitoringService;                     // 0x8e8(0x8)
	class ActorOfInterestService*                                ActorOfInterestService;                            // 0x8f0(0x8)
	class EnemyAIOnShipService*                                  EnemyAIOnShipService;                              // 0x8f8(0x8)
	class UserSettingsService*                                   UserSettingsService;                               // 0x900(0x8)
	class GuildService*                                          GuildService;                                      // 0x908(0x8)
	class GuildChroniclesService*                                GuildChroniclesService;                            // 0x910(0x8)
	class PlayerLootMarkerService*                               PlayerLootMarkerService;                           // 0x918(0x8)
	class InventoryPersistenceService*                           InventoryPersistenceService;                       // 0x920(0x8)
	class AdventureOnDemandService*                              AdventureOnDemandService;                          // 0x928(0x8)
	class ScrambledNamesService*                                 ScrambledNamesService;                             // 0x930(0x8)
	class ExperienceService*                                     ExperienceService;                                 // 0x938(0x8)
	class QuestTableService*                                     QuestTableService;                                 // 0x940(0x8)
	class CompetitiveVoyagesService*                             CompetitiveVoyagesService;                         // 0x948(0x8)
	char                                                         pad0x1c0_CPZBD[0x1c0];                             // 0x950(0x1c0)
	struct GameServiceCoordinator                                ServiceCoordinator;                                // 0xb10(0x20)
	char                                                         pad0x28_3SAE4[0x28];                               // 0xb30(0x28)
	TArray<Interface ChatComponents>                             ChatComponents;                                    // 0xb58(0x10)
	char                                                         pad0xb0_GG3ZO[0xb0];                               // 0xb68(0xb0)
	bool                                                         IsXboxGamePadOnlyServer;                           // 0xc18(0x1)
	bool                                                         ShouldDisableAsyncOcclusionCheck;                  // 0xc19(0x1)
	char                                                         pad0x6_2MIP9[0x6];                                 // 0xc1a(0x6)
	struct FString                                               SubPlayMode;                                       // 0xc20(0x10)
	class CustomVaultService*                                    CustomVaultService;                                // 0xc30(0x8)
	class EntityEnumerationService*                              EntityEnumerationService;                          // 0xc38(0x8)
	class LevelAssetCachingService*                              LevelAssetCachingService;                          // 0xc40(0x8)
	class CrewSkillRatingService*                                CrewSkillRatingService;                            // 0xc48(0x8)
	char                                                         pad0x50_M6CNB[0x50];                               // 0xc50(0x50)
};


// Size 0x40 (Full Size[0xb8] - InheritedSize[0x78]
class AthenaGameUserSettings: public GameUserSettings
{
public:
	int                                                          MaxVerticalResolution;                             // 0x78(0x4)
	int                                                          MaxFPS;                                            // 0x7c(0x4)
	int                                                          VSync;                                             // 0x80(0x4)
	int                                                          LightingDetail;                                    // 0x84(0x4)
	int                                                          ModelDetail;                                       // 0x88(0x4)
	int                                                          ShadowDetail;                                      // 0x8c(0x4)
	int                                                          TextureDetail;                                     // 0x90(0x4)
	int                                                          WaterDetail;                                       // 0x94(0x4)
	int                                                          AnimationQuality;                                  // 0x98(0x4)
	int                                                          MMCThresholdScale;                                 // 0x9c(0x4)
	float                                                        ResolutionScaling;                                 // 0xa0(0x4)
	int                                                          ParticleEmitterQuality;                            // 0xa4(0x4)
	int                                                          ParticleResolutionQuality;                         // 0xa8(0x4)
	int                                                          BackBufferCount;                                   // 0xac(0x4)
	int                                                          ShowPerformanceCounters;                           // 0xb0(0x4)
	bool                                                         SmoothFPS;                                         // 0xb4(0x1)
	bool                                                         HDR;                                               // 0xb5(0x1)
	bool                                                         AudioOutputSpatialAudio;                           // 0xb6(0x1)
	bool                                                         Fullscreen;                                        // 0xb7(0x1)
};


// Size 0x10 (Full Size[0x260] - InheritedSize[0x250]
class AthenaGameViewportClient: public GameViewportClient
{
public:
	char                                                         pad0x10_X6ANG[0x10];                               // 0x250(0x10)
};


// Size 0x318 (Full Size[0x340] - InheritedSize[0x28]
class AthenaLocalPlayerManager: public Object
{
public:
	char                                                         pad0x318_HZAHU[0x318];                             // 0x28(0x318)
};


// Size 0x150 (Full Size[0x178] - InheritedSize[0x28]
class AthenaLocalPlayerReengage: public Object
{
public:
	char                                                         pad0x150_I6F5P[0x150];                             // 0x28(0x150)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaPlayerCharacterTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterAnimaticSettingsInterface: public Interface
{
public:
};


// Size 0x78 (Full Size[0x140] - InheritedSize[0xc8]
class CharacterAnimaticSettingsComponent: public ActorComponent
{
public:
	char                                                         pad0x70_VP593[0x70];                               // 0xc8(0x70)
	bool                                                         HasPlayedWakeUpAnimation;                          // 0x138(0x1)
	char                                                         pad0x7_51HJK[0x7];                                 // 0x139(0x7)
};


// Size 0x3b0 (Full Size[0x800] - InheritedSize[0x450]
class AthenaPlayerState: public PlayerState
{
public:
	char                                                         pad0x48_WXPHD[0x48];                               // 0x450(0x48)
	class VoiceChatComponent*                                    VoiceChatComponent;                                // 0x498(0x8)
	char                                                         pad0x58_OUDQ4[0x58];                               // 0x4a0(0x58)
	struct FString                                               Sandbox;                                           // 0x4f8(0x10)
	struct FString                                               ClientPlatform;                                    // 0x508(0x10)
	struct FString                                               DeviceID;                                          // 0x518(0x10)
	struct PirateIdentity                                        PirateIdentity;                                    // 0x528(0x78)
	char                                                         pad0xa0_NP9EY[0xa0];                               // 0x5a0(0xa0)
	struct Guid                                                  PlayerGameId;                                      // 0x640(0x10)
	struct PirateDescription                                     PirateDesc;                                        // 0x650(0x80)
	int                                                          PlayerIndexOnServer;                               // 0x6d0(0x4)
	char                                                         pad0x3c_CIE3Q[0x3c];                               // 0x6d4(0x3c)
	struct FString                                               PlayerNameDebug;                                   // 0x710(0x10)
	byte                                                         PlayerActivity;                                    // 0x720(0x1)
	char                                                         pad0xdf_L75VF[0xdf];                               // 0x721(0xdf)
};


// Size 0x178 (Full Size[0x1a0] - InheritedSize[0x28]
class VoyageRecipeDataAsset: public DataAsset
{
public:
	struct VoyageRecipe                                          Recipe;                                            // 0x28(0x170)
	bool                                                         IsVoyageLocationBound;                             // 0x198(0x1)
	char                                                         pad0x7_KVZKS[0x7];                                 // 0x199(0x7)
};


// Size 0x1e8 (Full Size[0x388] - InheritedSize[0x1a0]
class EmergentContestVoyageRecipeDataAsset: public VoyageRecipeDataAsset
{
public:
	struct EmergentContestVoyageRecipe                           ContestVoyageRecipe;                               // 0x1a0(0x1e8)
};


// Size 0x178 (Full Size[0x1a0] - InheritedSize[0x28]
class VoyageDescDataAsset: public DataAsset
{
public:
	TArray<struct ChapterQuests>                                 Chapters;                                          // 0x28(0x10)
	TArray<struct FeatureToggledChapters>                        FeatureToggledChapters;                            // 0x38(0x10)
	struct FText                                                 Title;                                             // 0x48(0x38)
	struct FText                                                 Description;                                       // 0x80(0x38)
	struct FText                                                 LockedDescription;                                 // 0xb8(0x38)
	struct StringAssetReference                                  KeyArtUrl;                                         // 0xf0(0x10)
	struct StringAssetReference                                  IconUrl;                                           // 0x100(0x10)
	class UClass*                                                Company;                                           // 0x110(0x8)
	bool                                                         IsEmergent;                                        // 0x118(0x1)
	bool                                                         IsTale;                                            // 0x119(0x1)
	bool                                                         IsStarlightTale;                                   // 0x11a(0x1)
	bool                                                         IsUtilityVoyage;                                   // 0x11b(0x1)
	bool                                                         IsAdventure;                                       // 0x11c(0x1)
	bool                                                         IsCrossWorld;                                      // 0x11d(0x1)
	bool                                                         IsAthenaVoyage2;                                   // 0x11e(0x1)
	bool                                                         IsConsumableQuestTableVoyage;                      // 0x11f(0x1)
	struct ViewVoyageBanners                                     ViewVoyageBanners;                                 // 0x120(0x3)
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x123(0x1)
	bool                                                         DoNotNotifyParticipantsOfQuestPages;               // 0x124(0x1)
	char                                                         pad0x3_7XKUM[0x3];                                 // 0x125(0x3)
	int                                                          Rank;                                              // 0x128(0x4)
	char                                                         pad0x4_2VB8H[0x4];                                 // 0x12c(0x4)
	TArray<struct PlayerStat>                                    VoyageBegunStats;                                  // 0x130(0x10)
	TArray<struct PlayerStat>                                    VoyageCompletionStats;                             // 0x140(0x10)
	TArray<struct PlayerStat>                                    DiveVoyageCompletionStats;                         // 0x150(0x10)
	TArray<struct PlayerStat>                                    ReapersMarkCompletionStats;                        // 0x160(0x10)
	TArray<struct VoyageCompletionReward>                        VoyageCompletionRewards;                           // 0x170(0x10)
	struct FName                                                 CampaignId;                                        // 0x180(0x8)
	struct StringAssetReference                                  TaleCancelVoteMesh;                                // 0x188(0x10)
	byte                                                         EmergentSource;                                    // 0x198(0x1)
	char                                                         pad0x7_627FD[0x7];                                 // 0x199(0x7)
};


// Size 0x48 (Full Size[0x1e8] - InheritedSize[0x1a0]
class TallTaleContestRecipeDataAsset: public VoyageDescDataAsset
{
public:
	struct ContestZoneDistribution                               WeightedContestZonesToActivate;                    // 0x1a0(0x10)
	TArray<struct ContestIslandArchetype>                        AvailableIslandArchetypes;                         // 0x1b0(0x10)
	struct ContestTimerData                                      ContestVoyageTime;                                 // 0x1c0(0x18)
	struct StringClassReference                                  ScoreSystemToLoad;                                 // 0x1d8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ContestManagerServiceInterface: public Interface
{
public:
};


// Size 0xa0 (Full Size[0x168] - InheritedSize[0xc8]
class UIResponceComponent: public ActorComponent
{
public:
	class AthenaPlayerController*                                OwningPlayerController;                            // 0xc8(0x8)
	char                                                         pad0x98_9TE7K[0x98];                               // 0xd0(0x98)
};


// Size 0x1e8 (Full Size[0x2b0] - InheritedSize[0xc8]
class PlayerTelemetryComponent: public ActorComponent
{
public:
	char                                                         pad0x64_FRIB3[0x64];                               // 0xc8(0x64)
	float                                                        HeartbeatInterval;                                 // 0x12c(0x4)
	char                                                         pad0x150_T2SVC[0x150];                             // 0x130(0x150)
	struct DateTime                                              SpawnTimestamp;                                    // 0x280(0x8)
	char                                                         pad0x28_0YVWU[0x28];                               // 0x288(0x28)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class IslandEventType: public Object
{
public:
	struct IslandEventIcons                                      IslandIcons;                                       // 0x28(0x10)
	struct IslandEventIcons                                      HeaderIcons;                                       // 0x38(0x10)
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class TallTaleIslandEventType: public IslandEventType
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class MapTableCanvasDataAsset: public DataAsset
{
public:
	struct MapTableCanvasDetails                                 CanvasDetails;                                     // 0x28(0x30)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class IslandEventHUDData: public DataAsset
{
public:
	TArray<class Class*>                                         EventTypes;                                        // 0x28(0x10)
	struct Vector2D                                              IslandIconSize;                                    // 0x38(0x8)
	struct Vector2D                                              HeaderIconSize;                                    // 0x40(0x8)
	float                                                        HeaderYOffset;                                     // 0x48(0x4)
	float                                                        TriggerLerpAtZoomLevel;                            // 0x4c(0x4)
	struct CanvasLerpData                                        LerpData;                                          // 0x50(0x10)
	struct CanvasLerpData                                        HighlightLerpData;                                 // 0x60(0x10)
	struct CanvasLerpData                                        FadeInOutData;                                     // 0x70(0x10)
	float                                                        MarkerHighlightRadiusAdjuster;                     // 0x80(0x4)
	struct Vector2D                                              MarkerHighlightCentreOffset;                       // 0x84(0x8)
	float                                                        MarkerHighlightScale;                              // 0x8c(0x4)
};


// Size 0x90 (Full Size[0x158] - InheritedSize[0xc8]
class IslandEventTrackerComponent: public ActorComponent
{
public:
	TArray<struct IslandEventData>                               EventData;                                         // 0xc8(0x10)
	char                                                         pad0x80_TKJJT[0x80];                               // 0xd8(0x80)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class IslandEventTrackerInterface: public Interface
{
public:
};


// Size 0xfc8 (Full Size[0x1738] - InheritedSize[0x770]
class AthenaPlayerController: public PlayerController
{
public:
	char                                                         pad0x80_0JX2P[0x80];                               // 0x770(0x80)
	class PioneerComponent*                                      PioneerComponent;                                  // 0x7f0(0x8)
	class PlayerPermissionsComponent*                            PlayerPermissionsComponent;                        // 0x7f8(0x8)
	class PlayerTelemetryComponent*                              PlayerTelemetryComponent;                          // 0x800(0x8)
	class PlayerStatsComponent*                                  PlayerStatsComponent;                              // 0x808(0x8)
	class PlayerSeasonProgressionComponent*                      PlayerSeasonProgressionComponent;                  // 0x810(0x8)
	class PlayerHeroStatsComponent*                              PlayerHeroStatsComponent;                          // 0x818(0x8)
	class PlayerWalletComponent*                                 PlayerWalletComponent;                             // 0x820(0x8)
	class BoxedRpcDispatcherComponent*                           BoxedRpcDispatcherComponent;                       // 0x828(0x8)
	class PlayerEntitlementComponent*                            PlayerEntitlementComponent;                        // 0x830(0x8)
	class PlayerMigratableStatusComponent*                       PlayerMigratableStatusComponent;                   // 0x838(0x8)
	class EmblemComponent*                                       EmblemComponent;                                   // 0x840(0x8)
	class PlayerCompanyComponent*                                PlayerCompanyComponent;                            // 0x848(0x8)
	class LeaderboardComponent*                                  LeaderboardComponent;                              // 0x850(0x8)
	class RewardComponent*                                       RewardComponent;                                   // 0x858(0x8)
	class PlayerNonVerbalComponent*                              PlayerNonVerbalComponent;                          // 0x860(0x8)
	class PlayerCrewComponent*                                   PlayerCrewComponent;                               // 0x868(0x8)
	class PlayerMuteComponent*                                   PlayerMuteComponent;                               // 0x870(0x8)
	class UIResponceComponent*                                   PlayerUIReturnedResponceComponent;                 // 0x878(0x8)
	class PopUpNotificationComponent*                            PopUpNotificationComponent;                        // 0x880(0x8)
	class EncounterListenerComponent*                            EncounterListenerComponent;                        // 0x888(0x8)
	class CharacterAnimaticSettingsComponent*                    CharacterAnimaticSettingsComponent;                // 0x890(0x8)
	class AthenaTutorialComponent*                               TutorialComponent;                                 // 0x898(0x8)
	class ContextualTutorialComponent*                           ContextualTutorialComponent;                       // 0x8a0(0x8)
	class ShantySelectionComponent*                              ShantySelectionComponent;                          // 0x8a8(0x8)
	class TutorialManager*                                       TutorialManagerComponent;                          // 0x8b0(0x8)
	class EmissaryActionRewardBoostComponent*                    EmissaryActionRewardBoostComponent;                // 0x8b8(0x8)
	class PlayerMysteriousNoteComponent*                         PlayerMysteriousNoteComponent;                     // 0x8c0(0x8)
	class EmissaryParticipantComponent*                          EmissaryParticipantComponent;                      // 0x8c8(0x8)
	class CommodityPurchaseTrackingComponent*                    CommodityPurchaseTrackingComponent;                // 0x8d0(0x8)
	class PlayerActivityComponent*                               PlayerActivityComponent;                           // 0x8d8(0x8)
	class IslandEventTrackerComponent*                           IslandEventTrackerComponent;                       // 0x8e0(0x8)
	class CampaignComponent*                                     CampaignComponent;                                 // 0x8e8(0x8)
	class TaleQuestQueryableStatesAccessComponent*               TaleQuestQueryableStatesAccessComponent;           // 0x8f0(0x8)
	class AudioReportingComponent*                               AudioReportingComponent;                           // 0x8f8(0x8)
	class GuildInviteeComponent*                                 GuildInviteeComponent;                             // 0x900(0x8)
	class ExperienceRefreshComponent*                            ExperienceRefreshComponent;                        // 0x908(0x8)
	float                                                        InputRawYawScale;                                  // 0x910(0x4)
	float                                                        InputRawPitchScale;                                // 0x914(0x4)
	struct InventoryMemory                                       InventoryMemory;                                   // 0x918(0x50)
	char                                                         pad0x8_GS8XH[0x8];                                 // 0x968(0x8)
	class CinematicCameraController*                             CinematicCameraController;                         // 0x970(0x8)
	char                                                         pad0xc10_MOK3I[0xc10];                             // 0x978(0xc10)
	struct Guid                                                  ClientSessionId;                                   // 0x1588(0x10)
	char                                                         pad0x4_7L99D[0x4];                                 // 0x1598(0x4)
	class PromptsLocalService*                                   PromptsLocalService;                               // 0x1608(0x8)
	class CurveFloat*                                            AutoCentreCurve;                                   // 0x1610(0x8)
	char                                                         pad0x40_Q2YEB[0x40];                               // 0x1618(0x40)
	struct Vector                                                CinematicCameraControllerLocation;                 // 0x1658(0xc)
	struct Rotator                                               CinematicCameraControllerRotation;                 // 0x1664(0xc)
	struct PirateIdentity                                        PirateIdentity;                                    // 0x1670(0x78)
	byte                                                         DeathFlameOfFateType;                              // 0x16e8(0x1)
	byte                                                         FlameOfFateType;                                   // 0x16e9(0x1)
	byte                                                         PlayerDeathType;                                   // 0x16ea(0x1)
	char                                                         pad0x5_AB0IJ[0x5];                                 // 0x16eb(0x5)
	class IndividualReplicationChannel*                          IndividualReplicationChannel;                      // 0x16f0(0x8)
	char                                                         pad0x18_Q1732[0x18];                               // 0x16f8(0x18)
	struct FString                                               DebugServerMigrationEndpoint;                      // 0x1710(0x10)
	char                                                         pad0x18_ZDIPQ[0x18];                               // 0x1720(0x18)
};


// Size 0xe8 (Full Size[0x1820] - InheritedSize[0x1738]
class OnlineAthenaPlayerController: public AthenaPlayerController
{
public:
	char                                                         pad0x8_PQX40[0x8];                                 // 0x1738(0x8)
	struct MysteriousNotesCompletionEventsModelEntry             LogoutNoteCompletionIdent;                         // 0x1740(0x8)
	char                                                         pad0x19_5NBOB[0x19];                               // 0x1748(0x19)
	bool                                                         IdleDisconnectEnabled;                             // 0x1761(0x1)
	char                                                         pad0xbe_AM9RM[0xbe];                               // 0x1762(0xbe)
};


// Size 0x40 (Full Size[0x1778] - InheritedSize[0x1738]
class TestAthenaPlayerController: public AthenaPlayerController
{
public:
	class ForceFeedbackEffect*                                   LastReceivedForceFeedbackEffect;                   // 0x1738(0x8)
	char                                                         pad0x38_USZAF[0x38];                               // 0x1740(0x38)
};


// Size 0x0 (Full Size[0x1778] - InheritedSize[0x1778]
class TestAthenaPlayerControllerWithAthenaPlayerCameraManager: public TestAthenaPlayerController
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayerRelevancyServiceInterface: public Interface
{
public:
};


// Size 0x28 (Full Size[0x1760] - InheritedSize[0x1738]
class TestPlayerRelevancyAthenaPlayerController: public AthenaPlayerController
{
public:
	char                                                         pad0x28_97HVK[0x28];                               // 0x1738(0x28)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaPlayerControllerTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x18 (Full Size[0x818] - InheritedSize[0x800]
class TestAthenaPlayerState: public AthenaPlayerState
{
public:
	char                                                         pad0x18_ZTTVD[0x18];                               // 0x800(0x18)
};


// Size 0xf8 (Full Size[0x1c0] - InheritedSize[0xc8]
class AthenaPlayerZonePenetrationTrackerComponent: public ActorComponent
{
public:
	char                                                         pad0x8_9E32W[0x8];                                 // 0xc8(0x8)
	byte                                                         OverlapType;                                       // 0xd0(0x1)
	char                                                         pad0x3_M9DVN[0x3];                                 // 0xd1(0x3)
	float                                                        UpdateInterval;                                    // 0xd4(0x4)
	class ShapeComponent*                                        ShapeComponent;                                    // 0xd8(0x8)
	TArray<class AthenaPlayerCharacter*>                         PlayersInZone;                                     // 0xe0(0x10)
	char                                                         pad0xd0_Z2KRU[0xd0];                               // 0xf0(0xd0)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class AthenaServerIdentityManager: public Object
{
public:
	char                                                         pad0x30_WX5I3[0x30];                               // 0x28(0x30)
};


// Size 0xc8 (Full Size[0x4a0] - InheritedSize[0x3d8]
class AthenaTextRender: public StaticMeshActor
{
public:
	struct FText                                                 Text;                                              // 0x3d8(0x38)
	struct TreasureMapWidgetText                                 TextDesc;                                          // 0x410(0x3c)
	int                                                          CanvasWidth;                                       // 0x44c(0x4)
	int                                                          CanvasHeight;                                      // 0x450(0x4)
	char                                                         pad0x4_9WWK9[0x4];                                 // 0x454(0x4)
	class Font*                                                  Font;                                              // 0x458(0x8)
	struct Vector2D                                              FontScale;                                         // 0x460(0x8)
	float                                                        FontLineSpacingScale;                              // 0x468(0x4)
	char                                                         pad0xc_NJ5NI[0xc];                                 // 0x46c(0xc)
	class CanvasRenderTarget2D*                                  AthenaTextRenderTarget;                            // 0x478(0x8)
	char                                                         pad0x20_6D5IW[0x20];                               // 0x480(0x20)
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class VoyageProposalDesc: public EntitlementDesc
{
public:
	class UClass*                                                TradingCompany;                                    // 0xc8(0x8)
	int                                                          Rank;                                              // 0xd0(0x4)
	bool                                                         UseDifficultyAsRank;                               // 0xd4(0x1)
	bool                                                         UnlockedForAnyRank;                                // 0xd5(0x1)
	bool                                                         AvailableEvenIfRecentlySeen;                       // 0xd6(0x1)
	char                                                         pad0x1_QPQRE[0x1];                                 // 0xd7(0x1)
	int                                                          Difficulty;                                        // 0xd8(0x4)
	int                                                          Length;                                            // 0xdc(0x4)
	struct StringAssetReference                                  TooltipBackgroundImageUrl;                         // 0xe0(0x10)
	class VoyageRecipeDataAsset*                                 VoyageRecipe;                                      // 0xf0(0x8)
	class VoyageDescDataAsset*                                   VoyageDesc;                                        // 0xf8(0x8)
	struct StringAssetReference                                  OverrideVotingTableVoyageProposalMesh;             // 0x100(0x10)
	struct StringAssetReference                                  OverrideOpenVoyageProposalMesh;                    // 0x110(0x10)
	char                                                         pad0x8_L2KSC[0x8];                                 // 0x120(0x8)
};


// Size 0x8 (Full Size[0x130] - InheritedSize[0x128]
class VoyageCheckpointProposalDesc: public VoyageProposalDesc
{
public:
	int                                                          TaleIndex;                                         // 0x128(0x4)
	bool                                                         DoConsumeOnUse;                                    // 0x12c(0x1)
	bool                                                         DoCountAsInventoryVoyage;                          // 0x12d(0x1)
	char                                                         pad0x2_ZQ470[0x2];                                 // 0x12e(0x2)
};


// Size 0x8 (Full Size[0x408] - InheritedSize[0x400]
class WorldSafeRegion: public BlockingVolume
{
public:
	char                                                         pad0x1_SXN4C[0x1];                                 // 0x400(0x1)
	bool                                                         RequiresShroudBreaker;                             // 0x401(0x1)
	bool                                                         IsMainWorldSafeZone;                               // 0x402(0x1)
	char                                                         pad0x5_ZDO4S[0x5];                                 // 0x403(0x5)
};


// Size 0x1d8 (Full Size[0x758] - InheritedSize[0x580]
class AthenaWorldSettings: public WorldSettings
{
public:
	char                                                         pad0x68_3HUPV[0x68];                               // 0x580(0x68)
	struct Vector2D                                              WorldMax;                                          // 0x5e8(0x8)
	struct Vector2D                                              WorldMapMin;                                       // 0x5f0(0x8)
	struct Vector2D                                              WorldMapMax;                                       // 0x5f8(0x8)
	char                                                         pad0x4_X9QUG[0x4];                                 // 0x600(0x4)
	float                                                        AdventureDistanceFromWorldSafeRegionEdgeToKillZone; // 0x604(0x4)
	float                                                        ArenaDistanceFromWorldSafeRegionEdgeToKillZone;    // 0x608(0x4)
	float                                                        EndOfWorldWarningOffset;                           // 0x60c(0x4)
	char                                                         pad0x4_KGKB6[0x4];                                 // 0x610(0x4)
	float                                                        AdventureDistanceFromWorldSafeRegionEdgeToFullStrainAndLighting; // 0x614(0x4)
	float                                                        ArenaDistanceFromWorldSafeRegionEdgeToFullStrainAndLighting; // 0x618(0x4)
	int                                                          EndOfWorldWarningLightingIndex;                    // 0x61c(0x4)
	class BuoyantObjectSpawnParamsDataAsset*                     BuoyantObjectSpawnParams;                          // 0x620(0x8)
	class SeaFortsWorldDataAsset*                                SeaFortsData;                                      // 0x628(0x8)
	class SeaRockDataAsset*                                      SeaRockLocations;                                  // 0x630(0x8)
	struct StringAssetReference                                  TradeRoutes;                                       // 0x638(0x10)
	TArray<struct AthenaStreamedLevelItem>                       ManuallyStreamedLevels;                            // 0x648(0x10)
	class TunnelWorldConfig*                                     TunnelWorldConfig;                                 // 0x658(0x8)
	class SpireStreamedLevelDataAsset*                           SpireLevels;                                       // 0x660(0x8)
	struct KrakenWorldSettingsParams                             KrakenParams;                                      // 0x668(0x1)
	struct TinySharkWorldSettingsParams                          TinySharkParams;                                   // 0x669(0x1)
	char                                                         pad0x6_FAMU4[0x6];                                 // 0x66a(0x6)
	struct AIShipWorldSettings                                   AIShipParams;                                      // 0x670(0x18)
	class InvasionLocationsDataAsset*                            InvasionLocationsDataAsset;                        // 0x688(0x8)
	class IslandDataAsset*                                       IslandDataAsset;                                   // 0x690(0x8)
	class PrebakedIslandAsset*                                   PrebakedIslandData;                                // 0x698(0x8)
	class MapTableCanvasDataAsset*                               MapTableCanvasData;                                // 0x6a0(0x8)
	class VoyageDescDataAsset*                                   TutorialTale;                                      // 0x6a8(0x8)
	class VoyageDescDataAsset*                                   ScuttleShipVoyageDescAsset;                        // 0x6b0(0x8)
	float                                                        DevilsShroudPlayerDamageMaxDamage;                 // 0x6b8(0x4)
	bool                                                         AllowCompanyOnboardingTutorial;                    // 0x6bc(0x1)
	bool                                                         AllowContextualTutorial;                           // 0x6bd(0x1)
	bool                                                         ShowMapTable;                                      // 0x6be(0x1)
	bool                                                         UseDevDefinition;                                  // 0x6bf(0x1)
	bool                                                         EnableGlobalVoyages;                               // 0x6c0(0x1)
	char                                                         pad0x7_IJ70M[0x7];                                 // 0x6c1(0x7)
	class GlobalVoyageOverrideAsset*                             GlobalVoyageOverrideAsset;                         // 0x6c8(0x8)
	TArray<class Class*>                                         NPCOnBeachVoyageCheckpoints;                       // 0x6d0(0x10)
	float                                                        ServerChatMessageStickyTime;                       // 0x6e0(0x4)
	float                                                        SaferSeasServerChatMessageStickyTime;              // 0x6e4(0x4)
	bool                                                         UseGameEventSchedulerRemoteServices;               // 0x6e8(0x1)
	char                                                         pad0x7_R8ZPO[0x7];                                 // 0x6e9(0x7)
	class GameEventSchedulerSettingsAsset*                       DefaultGameEventSchedulerSettings;                 // 0x6f0(0x8)
	TArray<struct AthenaWorldSettingsGameEventSchedulerSettingsConfiguration> GameEventSchedulerSettingsConfigurations;          // 0x6f8(0x10)
	class StormServiceAsset*                                     StormServiceSettings;                              // 0x708(0x8)
	TArray<struct WorldSafeZone>                                 SafeZonesIncludingRequiresShroudBreaker;           // 0x710(0x10)
	TArray<struct WorldSafeZone>                                 SafeZonesExcludingRequiresShroudBreaker;           // 0x720(0x10)
	TArray<struct WorldSafeZone>                                 MainWorldSafeZones;                                // 0x730(0x10)
	TArray<struct WorldSafeZone>                                 OverridingSafeZones;                               // 0x740(0x10)
	char                                                         pad0x8_6HEJJ[0x8];                                 // 0x750(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AudioEmitterPoolSourceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AudioUtilities: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AudioVisualiserHudComponentInterface: public Interface
{
public:
};


// Size 0x70 (Full Size[0x138] - InheritedSize[0xc8]
class AudioVisualiserHudComponent: public ActorComponent
{
public:
	char                                                         pad0x10_QDDR1[0x10];                               // 0xc8(0x10)
	TArray<struct HoopData>                                      Hoops;                                             // 0xd8(0x10)
	char                                                         pad0x50_98EPC[0x50];                               // 0xe8(0x50)
};


// Size 0xb0 (Full Size[0x148] - InheritedSize[0x98]
class AwaitCrewShipToSailAwayFromCurrentLocationStep: public TaleQuestStep
{
public:
	char                                                         pad0xb0_J3YOQ[0xb0];                               // 0x98(0xb0)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class AwaitCrewShipToSailAwayFromCurrentLocationStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        MinShipDistanceToTravel;                           // 0x80(0x4)
	bool                                                         CompleteStepIfShipIsDestroyed;                     // 0x84(0x1)
	char                                                         pad0x3_5WQAF[0x3];                                 // 0x85(0x3)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class RadialContentRule: public Object
{
public:
	struct FText                                                 RadialTitle;                                       // 0x28(0x38)
	char                                                         pad0x8_LM26B[0x8];                                 // 0x60(0x8)
	TArray<class Class*>                                         NotificationInputsToBlock;                         // 0x68(0x10)
};


// Size 0x98 (Full Size[0x110] - InheritedSize[0x78]
class BaitRadialContentRule: public RadialContentRule
{
public:
	char                                                         pad0x58_QALD2[0x58];                               // 0x78(0x58)
	float                                                        RadialIconScale;                                   // 0xd0(0x4)
	struct Vector2D                                              RadialIconOffset;                                  // 0xd4(0x8)
	char                                                         pad0x4_NXS7H[0x4];                                 // 0xdc(0x4)
	class InventoryItemDescToSlotRemappingPolicyAsset*           RemappingAsset;                                    // 0xe0(0x8)
	TArray<class ItemInfo*>                                      MappedSlots;                                       // 0xe8(0x10)
	class UClass*                                                BaitItemCategory;                                  // 0xf8(0x8)
	char                                                         pad0x10_S5PJ4[0x10];                               // 0x100(0x10)
};


// Size 0x48 (Full Size[0x110] - InheritedSize[0xc8]
class BakedDecalComponent: public ActorComponent
{
public:
	int                                                          TargetTextureSize;                                 // 0xc8(0x4)
	struct LinearColor                                           ClearColour;                                       // 0xcc(0x10)
	int                                                          MaxDeferredDecals;                                 // 0xdc(0x4)
	class TextureRenderTarget2D*                                 TargetTexture;                                     // 0xe0(0x8)
	TArray<class StaticMeshComponent*>                           StaticMeshes;                                      // 0xe8(0x10)
	TArray<struct DeferredBakedDecal>                            DeferredDecals;                                    // 0xf8(0x10)
	char                                                         pad0x8_FGGZR[0x8];                                 // 0x108(0x8)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class BallastStatus: public StatusBase
{
public:
};


// Size 0x1d8 (Full Size[0x5d8] - InheritedSize[0x400]
class PickupableObject: public InteractableBase
{
public:
	char                                                         pad0x10_2D7A8[0x10];                               // 0x400(0x10)
	struct StartPickupObjectActionRuleParams                     StartPickupObjectActionRuleParams;                 // 0x410(0x10)
	float                                                        PickupTime;                                        // 0x420(0x4)
	char                                                         pad0x10c_SFM66[0x10c];                             // 0x424(0x10c)
	struct FText                                                 PickupTooltipDescription;                          // 0x530(0x38)
	struct FText                                                 PickupInventoryFullTooltipDescription;             // 0x568(0x38)
	struct FText                                                 StoreTooltipDescription;                           // 0x5a0(0x38)
};


// Size 0x138 (Full Size[0x710] - InheritedSize[0x5d8]
class ItemProxy: public PickupableObject
{
public:
	char                                                         pad0x30_S7RMT[0x30];                               // 0x5d8(0x30)
	float                                                        InteractionPointRadius;                            // 0x608(0x4)
	char                                                         pad0x4_Q03UZ[0x4];                                 // 0x60c(0x4)
	class WwiseEvent*                                            GroundImpactSfx;                                   // 0x610(0x8)
	class WwiseEvent*                                            GroundImpactAdditiveSfx;                           // 0x618(0x8)
	char                                                         pad0x20_PLOOD[0x20];                               // 0x620(0x20)
	TArray<struct ItemProxyImpactVfxParams>                      VFXParams;                                         // 0x640(0x10)
	float                                                        ZOffsetWhenPlacingWorldProxy;                      // 0x650(0x4)
	struct Rotator                                               RotationWhenPlacingWorldProxy;                     // 0x654(0xc)
	byte                                                         DropOnSurfaceClientTraceChannel;                   // 0x660(0x1)
	char                                                         pad0x7_VULZ8[0x7];                                 // 0x661(0x7)
	class PrimitiveComponent*                                    ThirdPersonMesh;                                   // 0x668(0x8)
	float                                                        TTL;                                               // 0x670(0x4)
	char                                                         pad0x4_HHD0H[0x4];                                 // 0x674(0x4)
	class WaterInteractionComponent*                             WaterInteractionComponent;                         // 0x678(0x8)
	class BuoyancyComponent*                                     BuoyancyComponent;                                 // 0x680(0x8)
	char                                                         pad0x1_Q7TBC[0x1];                                 // 0x688(0x1)
	byte                                                         CachedProxySurfaceType;                            // 0x689(0x1)
	bool                                                         CachedOnTopOfExistingBuriable;                     // 0x68a(0x1)
	bool                                                         DroppedInDeepWater;                                // 0x68b(0x1)
	char                                                         pad0x4_E5D04[0x4];                                 // 0x68c(0x4)
	class ItemInfo*                                              ItemInfo;                                          // 0x690(0x8)
	char                                                         pad0x6c_JSOUD[0x6c];                               // 0x698(0x6c)
	float                                                        TTLPlayerProximityCutoff;                          // 0x704(0x4)
	float                                                        TTLRecheckPeriod;                                  // 0x708(0x4)
	char                                                         pad0x4_H815I[0x4];                                 // 0x70c(0x4)
};


// Size 0x1b0 (Full Size[0x8c0] - InheritedSize[0x710]
class FloatingItemProxy: public ItemProxy
{
public:
	char                                                         pad0x8_RLLKR[0x8];                                 // 0x710(0x8)
	struct RigidBodyErrorCorrection                              PhysicsErrorCorrection;                            // 0x718(0x1c)
	char                                                         pad0x4_2UGKA[0x4];                                 // 0x734(0x4)
	class BoxComponent*                                          BaseComponent;                                     // 0x738(0x8)
	char                                                         pad0x40_CGVM3[0x40];                               // 0x740(0x40)
	struct NetTimeStampCalculator                                MovementTimeStamp;                                 // 0x780(0x70)
	class Actor*                                                 TutorialOwner;                                     // 0x7f0(0x8)
	bool                                                         IsTutorialProxy;                                   // 0x7f8(0x1)
	char                                                         pad0x7_LWYY4[0x7];                                 // 0x7f9(0x7)
	struct ReplicatedPhysicsState                                ReplicatedPhysicsState;                            // 0x800(0x50)
	class RetractableComponent*                                  RetractableComponent;                              // 0x850(0x8)
	bool                                                         ForceKeepTickActive;                               // 0x858(0x1)
	bool                                                         DisallowHarpoon;                                   // 0x859(0x1)
	char                                                         pad0x5e_P3W5Y[0x5e];                               // 0x85a(0x5e)
	byte                                                         CachedAutoAimCollisionChannel;                     // 0x8b8(0x1)
	byte                                                         CachedVehicleCollisionResponse;                    // 0x8b9(0x1)
	char                                                         pad0x6_AMIEG[0x6];                                 // 0x8ba(0x6)
};


// Size 0x20 (Full Size[0x8e0] - InheritedSize[0x8c0]
class BootyProxy: public FloatingItemProxy
{
public:
	char                                                         pad0x18_5QYM9[0x18];                               // 0x8c0(0x18)
	class ItemProxyShipTrackerComponent*                         ItemProxyShipTrackerComponent;                     // 0x8d8(0x8)
};


// Size 0x20 (Full Size[0x900] - InheritedSize[0x8e0]
class BaseMerchantCrateItemProxy: public BootyProxy
{
public:
	class RewindComponent*                                       RewindComponent;                                   // 0x8e0(0x8)
	class WwiseEvent*                                            FullGroundImpactSfx;                               // 0x8f8(0x8)
};


// Size 0x0 (Full Size[0x900] - InheritedSize[0x900]
class MerchantCrateItemProxy: public BaseMerchantCrateItemProxy
{
public:
};


// Size 0x0 (Full Size[0x900] - InheritedSize[0x900]
class StaticMerchantCrateItemProxy: public BaseMerchantCrateItemProxy
{
public:
};


// Size 0x10 (Full Size[0x910] - InheritedSize[0x900]
class CargoRunCrateItemProxy: public MerchantCrateItemProxy
{
public:
	class CargoRunCrateComponent*                                CargoRunCrateComponent;                            // 0x900(0x8)
	class NPCDialogComponent*                                    NPCDialogComponent;                                // 0x908(0x8)
};


// Size 0x10 (Full Size[0x910] - InheritedSize[0x900]
class StaticCargoRunCrateItemProxy: public StaticMerchantCrateItemProxy
{
public:
	class CargoRunCrateComponent*                                CargoRunCrateComponent;                            // 0x900(0x8)
	class NPCDialogComponent*                                    NPCDialogComponent;                                // 0x908(0x8)
};


// Size 0x28 (Full Size[0x938] - InheritedSize[0x910]
class DamageableCargoRunCrateItemProxy: public CargoRunCrateItemProxy
{
public:
	bool                                                         ProjectileCollisionsEnabledAboveMinimumHealthGate; // 0x910(0x1)
	char                                                         pad0x7_8IGY7[0x7];                                 // 0x911(0x7)
	class GatedHealthComponent*                                  GatedHealthComponent;                              // 0x918(0x8)
	char                                                         pad0x8_5FPOW[0x8];                                 // 0x920(0x8)
	class VisualHealthResponseComponent*                         VisualHealthResponseComponent;                     // 0x928(0x8)
	class LightWeightStatusEffectManagerComponent*               LightweightStatusEffectComponent;                  // 0x930(0x8)
};


// Size 0x28 (Full Size[0x938] - InheritedSize[0x910]
class StaticDamageableCargoRunCrateItemProxy: public StaticCargoRunCrateItemProxy
{
public:
	bool                                                         ProjectileCollisionsEnabledAboveMinimumHealthGate; // 0x910(0x1)
	char                                                         pad0x7_4UO16[0x7];                                 // 0x911(0x7)
	class GatedHealthComponent*                                  GatedHealthComponent;                              // 0x918(0x8)
	char                                                         pad0x8_2M9GR[0x8];                                 // 0x920(0x8)
	class VisualHealthResponseComponent*                         VisualHealthResponseComponent;                     // 0x928(0x8)
	class LightWeightStatusEffectManagerComponent*               LightweightStatusEffectComponent;                  // 0x930(0x8)
};


// Size 0x168 (Full Size[0x530] - InheritedSize[0x3c8]
class ItemInfo: public Actor
{
public:
	char                                                         pad0x20_EX47W[0x20];                               // 0x3c8(0x20)
	bool                                                         CanBeStoredInInventory;                            // 0x3e8(0x1)
	char                                                         pad0x7_XYQEO[0x7];                                 // 0x3e9(0x7)
	class UClass*                                                WieldableType;                                     // 0x440(0x8)
	class UClass*                                                ProxyType;                                         // 0x448(0x8)
	class WieldableItemPersistentCooldownComponent*              WieldableItemPersistenceCooldownComponent;         // 0x450(0x8)
	bool                                                         ExcludeFromMigration;                              // 0x458(0x1)
	char                                                         pad0x7_JZOGW[0x7];                                 // 0x459(0x7)
	class ItemDesc*                                              Desc;                                              // 0x460(0x8)
	byte                                                         CurrentRepresentation;                             // 0x468(0x1)
	char                                                         pad0x7_ZLPME[0x7];                                 // 0x469(0x7)
	class Actor*                                                 CurrentRepresentationInstance;                     // 0x470(0x8)
	class Actor*                                                 CurrentOwner;                                      // 0x478(0x8)
	class Actor*                                                 TutorialOwner;                                     // 0x480(0x8)
	char                                                         pad0xa1_QT60O[0xa1];                               // 0x488(0xa1)
	bool                                                         DoNotConsiderForMigrationGather;                   // 0x529(0x1)
	char                                                         pad0x1_QEDFR[0x1];                                 // 0x52a(0x1)
	bool                                                         DestroyPostMigration;                              // 0x52b(0x1)
	char                                                         pad0x4_ZOD7E[0x4];                                 // 0x52c(0x4)
};


// Size 0x0 (Full Size[0x530] - InheritedSize[0x530]
class NonStorableItemInfo: public ItemInfo
{
public:
};


// Size 0x218 (Full Size[0x748] - InheritedSize[0x530]
class BootyItemInfo: public NonStorableItemInfo
{
public:
	char                                                         pad0x30_SGS1D[0x30];                               // 0x530(0x30)
	byte                                                         BootyType;                                         // 0x560(0x1)
	char                                                         pad0x3_N2P0U[0x3];                                 // 0x561(0x3)
	struct Guid                                                  Id;                                                // 0x564(0x10)
	bool                                                         PlayedFirstTimeEquipSfx;                           // 0x574(0x1)
	char                                                         pad0x3_3O7FO[0x3];                                 // 0x575(0x3)
	TArray<struct PlayerStat>                                    HandInPlayerStats;                                 // 0x578(0x10)
	TArray<struct PlayerStat>                                    HandInStolenPlayerStats;                           // 0x588(0x10)
	TArray<struct PlayerStat>                                    HandInStolenFromPlayerStats;                       // 0x598(0x10)
	TArray<struct PlayerStat>                                    HandInGiftPlayerStats;                             // 0x5a8(0x10)
	TArray<struct PlayerStat>                                    HandInAsPirateLegendPlayerStats;                   // 0x5b8(0x10)
	TArray<struct PlayerStat>                                    HandInOnSchedulePlayerStats;                       // 0x5c8(0x10)
	TArray<struct PlayerStat>                                    HandInAsPirateLegendOnSchedulePlayerStats;         // 0x5d8(0x10)
	TArray<struct EmissaryBootyItemStats>                        HandInAsEmissaryPlayerStats;                       // 0x5e8(0x10)
	TArray<struct EmissaryBootyItemStats>                        HandInAsMaxLevelEmissaryPlayerStats;               // 0x5f8(0x10)
	TArray<struct EmissaryBootyItemStats>                        HandInStolenAsEmissaryPlayerStats;                 // 0x608(0x10)
	TArray<struct EmissaryBootyItemStats>                        HandInStolenAsMaxLevelEmissaryPlayerStats;         // 0x618(0x10)
	TArray<struct PlayerStat>                                    UsePlayerStats;                                    // 0x628(0x10)
	TArray<struct PlayerStat>                                    UseStolenPlayerStats;                              // 0x638(0x10)
	struct CompanyBootyStatList                                  CompanySpecificStats;                              // 0x648(0x10)
	struct ConditionalHandInStat                                 ConditionalHandInStat;                             // 0x658(0x20)
	class PopUpMessageDesc*                                      DiscoveredPopupDesc;                               // 0x678(0x8)
	struct BootyItemSellPrerequisites                            SellPrerequisites;                                 // 0x680(0x10)
	class TrackedOwnerComponent*                                 TrackedOwnerComponent;                             // 0x690(0x8)
	class ItemQualityComponent*                                  ItemQualityComponent;                              // 0x698(0x8)
	byte                                                         ItemQualityLevel;                                  // 0x6a0(0x1)
	char                                                         pad0x7_OJLCI[0x7];                                 // 0x6a1(0x7)
	TArray<struct PerComanyItemQualityEntry>                     CompanySpecificItemQualityLevel;                   // 0x6a8(0x10)
	struct RewardId                                              HandInRewardId;                                    // 0x6b8(0x8)
	TArray<struct CompanySpecificBootyReward>                    HandInRewardIdCompanySpecific;                     // 0x6c0(0x10)
	bool                                                         RewardToOwnCrewOnly;                               // 0x6d0(0x1)
	char                                                         pad0x3_2XK3H[0x3];                                 // 0x6d1(0x3)
	struct FName                                                 Rarity;                                            // 0x6d4(0x8)
	char                                                         pad0x4_5EY89[0x4];                                 // 0x6dc(0x4)
	class UClass*                                                AwardAllegianceToFaction;                          // 0x6e0(0x8)
	char                                                         pad0x18_TXNDG[0x18];                               // 0x6e8(0x18)
	class DeliverableComponent*                                  DeliverableComponent;                              // 0x700(0x8)
	class CrewOwnershipTrackingComponent*                        CrewOwnershipTrackingComponent;                    // 0x708(0x8)
	class BootyItemShipOwnershipComponent*                       BootyItemShipOwnershipComponent;                   // 0x710(0x8)
	byte                                                         SpawnSource;                                       // 0x718(0x1)
	char                                                         pad0x2f_1UU6V[0x2f];                               // 0x719(0x2f)
};


// Size 0x88 (Full Size[0x7d0] - InheritedSize[0x748]
class MerchantCrateItemInfo: public BootyItemInfo
{
public:
	char                                                         pad0x8_MSKQH[0x8];                                 // 0x748(0x8)
	TArray<struct MerchantCrateItemInfoFaunaBreedRarityEntry>    FaunaBreedRarity;                                  // 0x750(0x10)
	char                                                         pad0x68_7M3OX[0x68];                               // 0x760(0x68)
	class Actor*                                                 CurrentShip;                                       // 0x7c8(0x8)
};


// Size 0x418 (Full Size[0x7e0] - InheritedSize[0x3c8]
class WieldableItem: public Actor
{
public:
	char                                                         pad0x60_0SMYO[0x60];                               // 0x3c8(0x60)
	class PrimitiveComponent*                                    FirstPersonMesh;                                   // 0x428(0x8)
	class PrimitiveComponent*                                    ThirdPersonMesh;                                   // 0x430(0x8)
	class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x438(0x8)
	class UClass*                                                AnimationKey;                                      // 0x440(0x8)
	struct ObjectMessagingDispatcher                             MessagingDispatcher;                               // 0x448(0xa0)
	char                                                         pad0x8_QCGVK[0x8];                                 // 0x4e8(0x8)
	struct Transform                                             AnimationOffset;                                   // 0x4f0(0x30)
	class WwiseEvent*                                            EquipSfx;                                          // 0x520(0x8)
	class WwiseEvent*                                            UnequipSfx;                                        // 0x528(0x8)
	class WwiseEvent*                                            WielderLandedJumpSfx;                              // 0x530(0x8)
	class WwiseEvent*                                            WielderFootstepLayerOneshot;                       // 0x538(0x8)
	struct FName                                                 PlayerWalkSpeedRtpc;                               // 0x540(0x8)
	class WwiseEvent*                                            FirstTimeEquipSfx;                                 // 0x548(0x8)
	bool                                                         ForceUnequipSfx;                                   // 0x550(0x1)
	byte                                                         ItemSize;                                          // 0x551(0x1)
	char                                                         pad0x6_3AW6E[0x6];                                 // 0x552(0x6)
	struct DetailAppearenceDesc                                  DetailAppearence;                                  // 0x558(0x30)
	bool                                                         PropagateVisibilityToChildren;                     // 0x588(0x1)
	char                                                         pad0x3_6LLMX[0x3];                                 // 0x589(0x3)
	struct FName                                                 AINoiseTag;                                        // 0x58c(0x8)
	char                                                         pad0x4_7UF0I[0x4];                                 // 0x594(0x4)
	TArray<struct FName>                                         ThirdPersonExtraMeshNames;                         // 0x598(0x10)
	TArray<struct FName>                                         StashedExtraMeshNames;                             // 0x5a8(0x10)
	class MeshComponent*                                         StashedMeshComponent;                              // 0x5b8(0x8)
	struct FName                                                 StashedMeshAttachSocket;                           // 0x5c0(0x8)
	struct FName                                                 ServerWieldAttachSocket;                           // 0x5c8(0x8)
	class PhrasesRadialDataAsset*                                Phrases;                                           // 0x5d0(0x8)
	class Object*                                                CachedFirstPersonProxyMesh;                        // 0x5d8(0x8)
	class Object*                                                CachedThirdPersonProxyMesh;                        // 0x5e0(0x8)
	char                                                         pad0x168_Q3RUX[0x168];                             // 0x5e8(0x168)
	class UClass*                                                ItemCategory;                                      // 0x750(0x8)
	class ItemInfo*                                              ItemInfo;                                          // 0x758(0x8)
	class InterpolatingItem*                                     InterpolatingItem;                                 // 0x760(0x8)
	char                                                         pad0x18_LKFIQ[0x18];                               // 0x768(0x18)
	class WieldableItemVfxComponent*                             WieldableItemVfxComponent;                         // 0x788(0x8)
	TArray<class MeshComponent*>                                 ThirdPersonExtraMeshes;                            // 0x790(0x10)
	TArray<class MeshComponent*>                                 StashedExtraMeshes;                                // 0x7a0(0x10)
	char                                                         pad0x19_5GS1M[0x19];                               // 0x7b0(0x19)
	bool                                                         OfferingEnabled;                                   // 0x7c9(0x1)
	char                                                         pad0x2_WV4O6[0x2];                                 // 0x7ca(0x2)
	struct Guid                                                  QuestId;                                           // 0x7cc(0x10)
	char                                                         pad0x4_A18X7[0x4];                                 // 0x7dc(0x4)
};


// Size 0x0 (Full Size[0x7e0] - InheritedSize[0x7e0]
class SkeletalMeshWieldableItem: public WieldableItem
{
public:
};


// Size 0x0 (Full Size[0x7e0] - InheritedSize[0x7e0]
class LargeSkeletalMeshWieldableItem: public SkeletalMeshWieldableItem
{
public:
};


// Size 0x30 (Full Size[0x810] - InheritedSize[0x7e0]
class MerchantCrate: public LargeSkeletalMeshWieldableItem
{
public:
	struct MerchantCrateSfx                                      FullCrateSfx;                                      // 0x7e0(0x20)
	char                                                         pad0x10_U6BAF[0x10];                               // 0x800(0x10)
};


// Size 0x0 (Full Size[0x7e0] - InheritedSize[0x7e0]
class StaticMeshWieldableItem: public WieldableItem
{
public:
};


// Size 0x0 (Full Size[0x7e0] - InheritedSize[0x7e0]
class LargeStaticMeshWieldableItem: public StaticMeshWieldableItem
{
public:
};


// Size 0x60 (Full Size[0x840] - InheritedSize[0x7e0]
class StaticMerchantCrate: public LargeStaticMeshWieldableItem
{
public:
	class RewindComponent*                                       RewindComponent;                                   // 0x7e0(0x8)
	struct MerchantCrateSfx                                      FullCrateSfx;                                      // 0x7e8(0x20)
	class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectComponent;                   // 0x818(0x8)
	char                                                         pad0x10_UA5K9[0x10];                               // 0x820(0x10)
	bool                                                         RequiresRewindComponent;                           // 0x830(0x1)
	char                                                         pad0xf_CMVAR[0xf];                                 // 0x831(0xf)
};


// Size 0x0 (Full Size[0x900] - InheritedSize[0x900]
class MockMerchantCrateItemProxy: public BaseMerchantCrateItemProxy
{
public:
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class CategoryBase: public Object
{
public:
	struct FText                                                 Name;                                              // 0x28(0x38)
	struct FName                                                 UniqueTextIdentifier;                              // 0x60(0x8)
	struct StringAssetReference                                  IconPath;                                          // 0x68(0x10)
	struct FeatureFlag                                           FeatureToggle;                                     // 0x78(0xc)
	char                                                         pad0x4_2JLIP[0x4];                                 // 0x84(0x4)
};


// Size 0x8 (Full Size[0x90] - InheritedSize[0x88]
class ItemCategory: public CategoryBase
{
public:
	class UClass*                                                NotificationInputId;                               // 0x88(0x8)
};


// Size 0x0 (Full Size[0x90] - InheritedSize[0x90]
class MerchantCrateCategoryMock: public ItemCategory
{
public:
};


// Size 0x8 (Full Size[0x7d8] - InheritedSize[0x7d0]
class MerchantCrateItemInfoMock: public MerchantCrateItemInfo
{
public:
	char                                                         pad0x8_521LH[0x8];                                 // 0x7d0(0x8)
};


// Size 0x0 (Full Size[0x7d8] - InheritedSize[0x7d8]
class CommonMerchantCrateItemInfoMock: public MerchantCrateItemInfoMock
{
public:
};


// Size 0x0 (Full Size[0x7d8] - InheritedSize[0x7d8]
class RareMerchantCrateItemInfoMock: public MerchantCrateItemInfoMock
{
public:
};


// Size 0x0 (Full Size[0x7d8] - InheritedSize[0x7d8]
class LegendaryMerchantCrateItemInfoMock: public MerchantCrateItemInfoMock
{
public:
};


// Size 0x0 (Full Size[0x7d8] - InheritedSize[0x7d8]
class MythicalMerchantCrateItemInfoMock: public MerchantCrateItemInfoMock
{
public:
};


// Size 0x58 (Full Size[0x120] - InheritedSize[0xc8]
class ItemDesc: public EntitlementDesc
{
public:
	bool                                                         CanBeAddedToLoadout;                               // 0xc8(0x1)
	bool                                                         IsTransient;                                       // 0xc8(0x1)
	char                                                         pad0x3_534KB[0x3];                                 // 0xc9(0x3)
	bool                                                         AvailableInSaferSeas;                              // 0xcc(0x1)
	char                                                         pad0x3_T3WAY[0x3];                                 // 0xcd(0x3)
	struct FString                                               PreviousItem;                                      // 0xd0(0x10)
	struct FString                                               NextItem;                                          // 0xe0(0x10)
	struct StringAssetReference                                  IconRadPath;                                       // 0xf0(0x10)
	struct StringClassReference                                  InstanceClassType;                                 // 0x100(0x10)
	TArray<struct ItemInfoTogglePair>                            ItemInfoOverrides;                                 // 0x110(0x10)
};


// Size 0x0 (Full Size[0x120] - InheritedSize[0x120]
class ItemWithoutIconsDesc: public ItemDesc
{
public:
};


// Size 0x0 (Full Size[0x120] - InheritedSize[0x120]
class BootyItemDesc: public ItemWithoutIconsDesc
{
public:
};


// Size 0x0 (Full Size[0x120] - InheritedSize[0x120]
class MerchantCrateItemDescMock: public BootyItemDesc
{
public:
};


// Size 0x18 (Full Size[0x918] - InheritedSize[0x900]
class MerchantCrateFilledItemProxy: public StaticMerchantCrateItemProxy
{
public:
	class StorageContainerComponent*                             StorageContainerComponent;                         // 0x900(0x8)
	bool                                                         FillCrateToCapacity;                               // 0x908(0x1)
	char                                                         pad0xf_NR552[0xf];                                 // 0x909(0xf)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class ClientNotificationsService: public Object
{
public:
	char                                                         pad0x30_Y2KFL[0x30];                               // 0x28(0x30)
};


// Size 0x68 (Full Size[0x100] - InheritedSize[0x98]
class PlayNpcAnimationStep: public TaleQuestStep
{
public:
	class BasePlayNpcAnimationStepDesc*                          StepDesc;                                          // 0x98(0x8)
	char                                                         pad0x10_VKWXC[0x10];                               // 0xa0(0x10)
	class NPCDialogComponent*                                    NPCDialogComponent;                                // 0xb0(0x8)
	class CutSceneActor*                                         CutSceneActor;                                     // 0xb8(0x8)
	char                                                         pad0x40_YMH5V[0x40];                               // 0xc0(0x40)
};


// Size 0xb8 (Full Size[0x138] - InheritedSize[0x80]
class BasePlayNpcAnimationStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    PlaceableReaction;                                 // 0x80(0x30)
	struct QuestVariableActor                                    CutSceneActor;                                     // 0xb0(0x30)
	struct FName                                                 AnimationNameToPlay;                               // 0xe0(0x8)
	float                                                        SubtitleMaxDistance;                               // 0xe8(0x4)
	bool                                                         UseServerDrivenDialogue;                           // 0xec(0x1)
	char                                                         pad0x3_1KVZ1[0x3];                                 // 0xed(0x3)
	class SceneDialogueData*                                     DialogueData;                                      // 0xf0(0x8)
	class UClass*                                                LocalMusicZone;                                    // 0xf8(0x8)
	bool                                                         PreventServerMigration;                            // 0x100(0x1)
	char                                                         pad0x7_CBB60[0x7];                                 // 0x101(0x7)
	struct TaleQuestPhaseClusterRootActor                        PhaseClusterToSpawnFor;                            // 0x108(0x30)
};


// Size 0x68 (Full Size[0x1a0] - InheritedSize[0x138]
class PlayNpcAnimationStepDesc: public BasePlayNpcAnimationStepDesc
{
public:
	struct QuestVariableActor                                    TargetNpc;                                         // 0x138(0x30)
	struct FText                                                 SpeakingActorLocalisableName;                      // 0x168(0x38)
};


// Size 0xa0 (Full Size[0x1d8] - InheritedSize[0x138]
class PlayGroupNpcAnimationStepDesc: public BasePlayNpcAnimationStepDesc
{
public:
	struct QuestVariableActor                                    TargetNpc1;                                        // 0x138(0x30)
	struct QuestVariableActor                                    TargetNpc2;                                        // 0x168(0x30)
	struct QuestVariableActor                                    TargetNpc3;                                        // 0x198(0x30)
	TArray<struct FText>                                         SpeakingActorLocalisableNames;                     // 0x1c8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FlamesOfFateSettingsServiceInterface: public Interface
{
public:
};


// Size 0x68 (Full Size[0x468] - InheritedSize[0x400]
class InteractableObject: public InteractableBase
{
public:
	char                                                         pad0x18_QSUJ6[0x18];                               // 0x400(0x18)
	class OneShotInteractableFilterDesc*                         FilterDesc;                                        // 0x418(0x8)
	struct FText                                                 Verb;                                              // 0x420(0x38)
	char                                                         pad0x10_F025X[0x10];                               // 0x458(0x10)
};


// Size 0x390 (Full Size[0x7f8] - InheritedSize[0x468]
class Beacon: public InteractableObject
{
public:
	char                                                         pad0x10_CPS1G[0x10];                               // 0x468(0x10)
	class StaticMeshComponent*                                   Mesh;                                              // 0x478(0x8)
	class ParticleSystemComponent*                               BeaconActiveParticleSystem;                        // 0x480(0x8)
	class PointLightComponent*                                   PointLight;                                        // 0x488(0x8)
	bool                                                         EnableParticleSystemTint;                          // 0x490(0x1)
	char                                                         pad0x7_TZN9X[0x7];                                 // 0x491(0x7)
	class InteractableComponent*                                 InteractableComponent;                             // 0x498(0x8)
	class Object*                                                ExtinguishedVFX;                                   // 0x4a0(0x8)
	struct FName                                                 WwiseEmitterName;                                  // 0x4a8(0x8)
	class WwiseEvent*                                            StartLoopFlameSfx;                                 // 0x4b0(0x8)
	class WwiseEvent*                                            StopLoopFlameSfx;                                  // 0x4b8(0x8)
	class WwiseEvent*                                            FlameTransferSfx;                                  // 0x4c0(0x8)
	class WwiseEvent*                                            ExtinguishedSfx;                                   // 0x4c8(0x8)
	class WwiseObjectPoolWrapper*                                BeaconWwisePool;                                   // 0x4d0(0x8)
	float                                                        InteractionRadius;                                 // 0x4d8(0x4)
	char                                                         pad0x4_ID42D[0x4];                                 // 0x4dc(0x4)
	struct FText                                                 TakeFlameTooltipText;                              // 0x4e0(0x38)
	struct FText                                                 CannotTakeFlameTooltipText;                        // 0x518(0x38)
	struct FText                                                 LanternNotRaisedToolTipText;                       // 0x550(0x38)
	struct FText                                                 NotWieldingFlameTooltipText;                       // 0x588(0x38)
	struct FText                                                 SetFlameTooltipText;                               // 0x5c0(0x38)
	bool                                                         CanTakeFlameFromBeacon;                            // 0x5f8(0x1)
	bool                                                         CanSetFlameOnBeacon;                               // 0x5f9(0x1)
	bool                                                         StartLit;                                          // 0x5fa(0x1)
	byte                                                         StartingType;                                      // 0x5fb(0x1)
	struct PlayerStat                                            StatToFire;                                        // 0x5fc(0x4)
	TArray<struct BeaconLitWithFlameOfFateStatsToFire>           StatMap;                                           // 0x600(0x10)
	class CurveLinearColor*                                      ColourChangeCurveFX;                               // 0x610(0x8)
	class CurveLinearColor*                                      ColourChangeCurveLight;                            // 0x618(0x8)
	bool                                                         CanExtinguish;                                     // 0x620(0x1)
	char                                                         pad0x3_TKKU4[0x3];                                 // 0x621(0x3)
	float                                                        ExtinguishFadeTime;                                // 0x624(0x4)
	struct BeaconData                                            BeaconData;                                        // 0x628(0x2)
	char                                                         pad0x6_KR8TJ[0x6];                                 // 0x62a(0x6)
	class ParticleSystemComponent*                               ExtinguishFXComponent;                             // 0x630(0x8)
