#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x40
struct CinematicCameraReplicatedSpotLightParams
{
public:
	float                                                        Intensity;                                         // 0x0(0x4)
	float                                                        AttenuationRadius;                                 // 0x4(0x4)
	float                                                        InnerConeAngle;                                    // 0x8(0x4)
	float                                                        OuterConeAngle;                                    // 0xc(0x4)
	struct LinearColor                                           LightColour;                                       // 0x10(0x10)
	struct Vector                                                Location;                                          // 0x20(0xc)
	struct Rotator                                               Rotation;                                          // 0x2c(0xc)
	int                                                          RepUpdateCounter;                                  // 0x38(0x4)
	bool                                                         Enabled;                                           // 0x3c(0x1)
	bool                                                         CastShadows;                                       // 0x3d(0x1)
	char                                                         pad0x2_X4S3A[0x2];                                 // 0x3e(0x2)
};


// Size 0x60
struct UpdateCinematicSpotLightParamsRpc
{
public:
	char                                                         pad0x18_0XINI[0x18];                               // 0x0(0x18)
	class CinematicCameraSpotLight*                              LightActor;                                        // 0x18(0x8)
	struct CinematicCameraReplicatedSpotLightParams              LightParams;                                       // 0x20(0x40)
};


