#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "AthenaStatusResponse_Structs.h"


// Size 0x20 (Full Size[0x58] - InheritedSize[0x38]
class StatusResponseApplyOneShotStatus: public StatusResponse
{
public:
	struct Status                                                StatusToApply;                                     // 0x38(0x20)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class StatusResponseApplyPersistentStatus: public StatusResponse
{
public:
	struct Status                                                StatusToApply;                                     // 0x38(0x20)
	float                                                        DurationMultiplier;                                // 0x58(0x4)
	char                                                         pad0x4_740XA[0x4];                                 // 0x5c(0x4)
};


// Size 0x40 (Full Size[0x78] - InheritedSize[0x38]
class StatusResponseReportNoiseEvent: public StatusResponse
{
public:
	class UClass*                                                NoiseInstigator;                                   // 0x38(0x8)
	struct FName                                                 NoiseTag;                                          // 0x40(0x8)
	float                                                        NoiseRange;                                        // 0x48(0x4)
	float                                                        NoiseLoudness;                                     // 0x4c(0x4)
	bool                                                         NoiseMultipleTicks;                                // 0x50(0x1)
	char                                                         pad0x3_DXTVT[0x3];                                 // 0x51(0x3)
	float                                                        NoiseTimerTick;                                    // 0x54(0x4)
	char                                                         pad0x20_OUVDB[0x20];                               // 0x58(0x20)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class StatusResponseHealthRegenerationPoolChange: public StatusResponse
{
public:
	float                                                        HealthPoolChangeIntensityMultiplier;               // 0x38(0x4)
	char                                                         pad0x4_IJHGZ[0x4];                                 // 0x3c(0x4)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class StatusResponseSuspendStatus: public StatusResponse
{
public:
	TArray<class Class*>                                         Status;                                            // 0x38(0x10)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class StatusResponseCancelStatus: public StatusResponse
{
public:
	TArray<class Class*>                                         Status;                                            // 0x38(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class StatusResponseCook: public StatusResponse
{
public:
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class StatusResponseSetScalarParamOnCharacter: public StatusResponse
{
public:
	TArray<struct ScalarParamInfo>                               ParamsToChange;                                    // 0x38(0x10)
};


