// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0
struct CharacterSocketCollisionResult
{
public:
	bool                                                         HasHit;                                            // 0x0(0x1)
	char                                                         pad0x3_H26M6[0x3];                                 // 0x1(0x3)
	struct HitResult                                             HitResult;                                         // 0x4(0x80)
	struct Vector                                                SocketVelocity;                                    // 0x84(0xc)
	struct Transform                                             SocketTransform;                                   // 0x90(0x30)
};


// Size 0xc
struct CharacterSocketCollisionHandle
{
public:
	char                                                         pad0xc_GJJ17[0xc];                                 // 0x0(0xc)
};


// Size 0x58
struct ImpactDamageEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	class UClass*                                                DamagerType;                                       // 0x10(0x8)
	class Actor*                                                 DirectInstigator;                                  // 0x18(0x8)
	class Actor*                                                 RootInstigator;                                    // 0x20(0x8)
	struct Vector                                                Location;                                          // 0x28(0xc)
	struct Vector                                                SurfaceNormal;                                     // 0x34(0xc)
	struct Vector                                                Velocity;                                          // 0x40(0xc)
	float                                                        DamageAmount;                                      // 0x4c(0x4)
	int                                                          DamageSpread;                                      // 0x50(0x4)
	byte                                                         Reason;                                            // 0x54(0x1)
	bool                                                         DealFriendlyFireDamage;                            // 0x55(0x1)
	char                                                         pad0x2_1431R[0x2];                                 // 0x56(0x2)
};


// Size 0x50
struct ProjectileAim
{
public:
	struct Vector                                                AimDirection;                                      // 0x0(0xc)
	struct Vector                                                AimPosition;                                       // 0xc(0xc)
	class PrimitiveComponent*                                    AimBase;                                           // 0x18(0x8)
	struct Transform                                             AimBaseTransform;                                  // 0x20(0x30)
};


// Size 0x8
struct RewardId
{
public:
	struct FName                                                 RewardId;                                          // 0x0(0x8)
};


// Size 0x18
struct AchievementDefinition
{
public:
	struct FName                                                 DevCenterId;                                       // 0x0(0x8)
	TArray<struct AchievementCriteria>                           UnlockCriteria;                                    // 0x8(0x10)
};


// Size 0x18
struct AchievementCriteria
{
public:
	struct PlayerStat                                            PlayerStat;                                        // 0x0(0x4)
	char                                                         pad0x4_L933J[0x4];                                 // 0x4(0x4)
	byte                                                         Operator;                                          // 0x10(0x1)
	char                                                         pad0x7_187YP[0x7];                                 // 0x11(0x7)
};


// Size 0x4
struct PlayerStat
{
public:
	char                                                         pad0x4_GOEG6[0x4];                                 // 0x0(0x4)
};


// Size 0x18
struct FeatureToggledFogBankManagerAsset
{
public:
	struct FeatureFlag                                           FeatureToggle;                                     // 0x0(0xc)
	char                                                         pad0x4_Y7W3Y[0x4];                                 // 0xc(0x4)
	class FogBankManagerDataAsset*                               Asset;                                             // 0x10(0x8)
};


// Size 0x10
struct FogBankManagerFogAvoidanceArea
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
};


// Size 0xc
struct WaterPuzzleWaterLevel
{
public:
	float                                                        WaterLevel;                                        // 0x0(0x4)
	float                                                        FillTransitionTime;                                // 0x4(0x4)
	float                                                        DrainTransitionTime;                               // 0x8(0x4)
};


// Size 0x8
struct WaterPuzzleRepData
{
public:
	int                                                          CurrentWaterLevelIndex;                            // 0x0(0x4)
	bool                                                         TransitionDueToReset;                              // 0x4(0x1)
	char                                                         pad0x3_Y9V5Y[0x3];                                 // 0x5(0x3)
};


// Size 0x20
struct AdventuresActorBundleInfo
{
public:
	struct StringAssetReference                                  Actor;                                             // 0x0(0x10)
	TArray<struct StringAssetReference>                          Pages;                                             // 0x10(0x10)
};


// Size 0x10
struct AudioEmitterParameters
{
public:
	class WwiseObjectPoolWrapper*                                LocalEmitterPool;                                  // 0x0(0x8)
	class WwiseObjectPoolWrapper*                                RemoteEmitterPool;                                 // 0x8(0x8)
};


// Size 0x68
struct WeaponProjectileEffectParams
{
public:
	bool                                                         ApplyStun;                                         // 0x0(0x1)
	char                                                         pad0x3_NQ2CB[0x3];                                 // 0x1(0x3)
	float                                                        StunDuration;                                      // 0x4(0x4)
	bool                                                         ApplyKnockback;                                    // 0x8(0x1)
	char                                                         pad0x3_J9J8Q[0x3];                                 // 0x9(0x3)
	struct KnockBackInfo                                         KnockbackParams;                                   // 0xc(0x50)
	int                                                          MinimumHitProjectilesForKnockback;                 // 0x5c(0x4)
	float                                                        MaximumKnockbackDistance;                          // 0x60(0x4)
	bool                                                         EnableKnockbackFalloffOverDistance;                // 0x64(0x1)
	char                                                         pad0x3_5O9L5[0x3];                                 // 0x65(0x3)
};


// Size 0x50
struct KnockBackInfo
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	float                                                        HorizontalVelocity;                                // 0x8(0x4)
	float                                                        VerticalVelocity;                                  // 0xc(0x4)
	float                                                        MinHorizontalVelocity;                             // 0x10(0x4)
	float                                                        MinVerticalVelocity;                               // 0x14(0x4)
	float                                                        SwimmingVelocity;                                  // 0x18(0x4)
	float                                                        DockedHorizontalVelocity;                          // 0x1c(0x4)
	float                                                        DockedVerticalVelocity;                            // 0x20(0x4)
	bool                                                         UseDockedVelocitiesWhenDocked;                     // 0x24(0x1)
	char                                                         pad0x3_QVW0H[0x3];                                 // 0x25(0x3)
	struct FName                                                 RumbleTag;                                         // 0x28(0x8)
	float                                                        StunDuration;                                      // 0x30(0x4)
	float                                                        AIKnockbackDistance;                               // 0x34(0x4)
	float                                                        AIKnockbackSpeed;                                  // 0x38(0x4)
	float                                                        AIKnockbackAcceleration;                           // 0x3c(0x4)
	byte                                                         AIKnockbackStrengthType;                           // 0x40(0x1)
	bool                                                         UseOverrideLaunchDirection;                        // 0x41(0x1)
	char                                                         pad0x2_NOTAR[0x2];                                 // 0x42(0x2)
	struct Vector                                                OverrideLaunchDirectionInWorldSpace;               // 0x44(0xc)
};


// Size 0xc0
struct WeaponProjectileParams
{
public:
	float                                                        Damage;                                            // 0x0(0x4)
	float                                                        DamageMultiplierAtMaximumRange;                    // 0x4(0x4)
	float                                                        LifeTime;                                          // 0x8(0x4)
	float                                                        TrailFadeOutTime;                                  // 0xc(0x4)
	float                                                        Velocity;                                          // 0x10(0x4)
	float                                                        TimeBeforeApplyingGravity;                         // 0x14(0x4)
	float                                                        DownForceVelocityFractionPerSecond;                // 0x18(0x4)
	float                                                        VelocityDampeningPerSecond;                        // 0x1c(0x4)
	struct LinearColor                                           Color;                                             // 0x20(0x10)
	class UClass*                                                ProjectileId;                                      // 0x30(0x8)
	byte                                                         HealthChangeReason;                                // 0x38(0x1)
	char                                                         pad0x3_GLIG0[0x3];                                 // 0x39(0x3)
	struct WeaponProjectileEffectParams                          ProjectileEffects;                                 // 0x3c(0x68)
	int                                                          SuggestedMaxSimulationIterations;                  // 0xa4(0x4)
	float                                                        SuggestedMinTickTimeSecs;                          // 0xa8(0x4)
	float                                                        SuggestedMaxSimulationTimeStep;                    // 0xac(0x4)
	int                                                          SuggestedFixedTimestepMaxSimulationIterations;     // 0xb0(0x4)
	float                                                        SuggestedFixedTimestepMinTickTimeSecs;             // 0xb4(0x4)
	float                                                        SuggestedFixedSimulationTimeStep;                  // 0xb8(0x4)
	char                                                         pad0x4_PB80L[0x4];                                 // 0xbc(0x4)
};


// Size 0x20
struct ChargeRequest
{
public:
	class Actor*                                                 Instigator;                                        // 0x0(0x8)
	struct Guid                                                  TelemetryChargeId;                                 // 0x8(0x10)
	struct ProjectileTimeStamp                                   TimeStamp;                                         // 0x18(0x8)
};


// Size 0x8
struct ProjectileTimeStamp
{
public:
	char                                                         pad0x8_N9P3W[0x8];                                 // 0x0(0x8)
};


// Size 0x18
struct ReloadRequest
{
public:
	class Actor*                                                 Instigator;                                        // 0x0(0x8)
	struct Guid                                                  TelemetryReloadId;                                 // 0x8(0x10)
};


// Size 0x40
struct EquipRequest
{
public:
	class Actor*                                                 Instigator;                                        // 0x0(0x8)
	struct Guid                                                  TelemetryEquipId;                                  // 0x8(0x10)
	struct Vector                                                EquipLocation;                                     // 0x18(0xc)
	float                                                        OtherWeaponFiredTimestamp;                         // 0x24(0x4)
	bool                                                         ShouldHaveCancelledEquipAnim;                      // 0x28(0x1)
	bool                                                         DidCancelEquipAnim;                                // 0x29(0x1)
	char                                                         pad0x6_M0GCU[0x6];                                 // 0x2a(0x6)
	struct EventWieldableItemSetIsWielded                        WieldEvent;                                        // 0x30(0x10)
};


// Size 0x10
struct EventWieldableItemSetIsWielded
{
public:
	class Actor*                                                 Wielder;                                           // 0x0(0x8)
	bool                                                         bIsWielded;                                        // 0x8(0x1)
	bool                                                         bGettingDropped;                                   // 0x9(0x1)
	bool                                                         bIsUnstashing;                                     // 0xa(0x1)
	char                                                         pad0x5_ROKRZ[0x5];                                 // 0xb(0x5)
};


// Size 0x210
struct ProjectileWeaponParameters
{
public:
	int                                                          AmmoClipSize;                                      // 0x0(0x4)
	int                                                          AmmoCostPerShot;                                   // 0x4(0x4)
	float                                                        ChargingDuration;                                  // 0x8(0x4)
	float                                                        EquipDuration;                                     // 0xc(0x4)
	float                                                        IntoAimingDuration;                                // 0x10(0x4)
	float                                                        RecoilDuration;                                    // 0x14(0x4)
	float                                                        ReloadDuration;                                    // 0x18(0x4)
	struct ProjectileShotParams                                  HipFireProjectileShotParams;                       // 0x1c(0x1c)
	struct ProjectileShotParams                                  AimDownSightsProjectileShotParams;                 // 0x38(0x1c)
	int                                                          InaccuracySeed;                                    // 0x54(0x4)
	float                                                        ProjectileDistributionMaxAngle;                    // 0x58(0x4)
	int                                                          NumberOfProjectiles;                               // 0x5c(0x4)
	float                                                        ProjectileMaximumRange;                            // 0x60(0x4)
	float                                                        ProjectileHitScanMaximumRange;                     // 0x64(0x4)
	float                                                        ProjectileDamage;                                  // 0x68(0x4)
	float                                                        ProjectileDamageMultiplierAtMaximumRange;          // 0x6c(0x4)
	class UClass*                                                DamagerType;                                       // 0x70(0x8)
	class UClass*                                                ProjectileId;                                      // 0x78(0x8)
	struct WeaponProjectileParams                                AmmoParams;                                        // 0x80(0xc0)
	bool                                                         UsesScope;                                         // 0x140(0x1)
	char                                                         pad0x3_11DNO[0x3];                                 // 0x141(0x3)
	float                                                        ZoomedRecoilDurationIncrease;                      // 0x144(0x4)
	float                                                        SecondsUntilZoomStarts;                            // 0x148(0x4)
	float                                                        SecondsUntilPostStarts;                            // 0x14c(0x4)
	float                                                        WeaponFiredAINoiseRange;                           // 0x150(0x4)
	float                                                        MaximumRequestPositionDelta;                       // 0x154(0x4)
	float                                                        MaximumRequestAngleDelta;                          // 0x158(0x4)
	float                                                        TimeoutTolerance;                                  // 0x15c(0x4)
	float                                                        AimingMoveSpeedScalar;                             // 0x160(0x4)
	byte                                                         AimSensitivitySettingCategory;                     // 0x164(0x1)
	char                                                         pad0x3_K8FPI[0x3];                                 // 0x165(0x3)
	float                                                        InAimFOV;                                          // 0x168(0x4)
	float                                                        BlendSpeed;                                        // 0x16c(0x4)
	class WwiseEvent*                                            DryFireSfx;                                        // 0x170(0x8)
	class WwiseEvent*                                            EndOfBulletsNotificationSfx;                       // 0x178(0x8)
	struct AudioEmitterParameters                                AudioEmitterParameters;                            // 0x180(0x10)
	struct FName                                                 RumbleTag;                                         // 0x190(0x8)
	bool                                                         KnockbackEnabled;                                  // 0x198(0x1)
	char                                                         pad0x3_1ON5A[0x3];                                 // 0x199(0x3)
	struct KnockBackInfo                                         KnockbackParams;                                   // 0x19c(0x50)
	bool                                                         StunEnabled;                                       // 0x1ec(0x1)
	char                                                         pad0x3_SF74L[0x3];                                 // 0x1ed(0x3)
	float                                                        StunDuration;                                      // 0x1f0(0x4)
	struct Vector                                                TargetingOffset;                                   // 0x1f4(0xc)
	bool                                                         OverridePlayerCharacterInterpolationConeAngleAndDistanceWhenAiming; // 0x200(0x1)
	char                                                         pad0x3_AYH3L[0x3];                                 // 0x201(0x3)
	float                                                        OverridePlayerCharacterInterpolationConeAngleAndDistanceDuration; // 0x204(0x4)
	float                                                        PlayerCharacterInterpolationConeAngleOverride;     // 0x208(0x4)
	float                                                        PlayerCharacterInterpolationDistanceOverride;      // 0x20c(0x4)
};


// Size 0x1c
struct ProjectileShotParams
{
public:
	int                                                          InaccuracySeed;                                    // 0x0(0x4)
	float                                                        ProjectileDistributionMaxAngle;                    // 0x4(0x4)
	int                                                          NumberOfProjectiles;                               // 0x8(0x4)
	float                                                        ProjectileMaximumRange;                            // 0xc(0x4)
	float                                                        ProjectileHitScanMaximumRange;                     // 0x10(0x4)
	float                                                        ProjectileDamage;                                  // 0x14(0x4)
	float                                                        ProjectileDamageMultiplierAtMaximumRange;          // 0x18(0x4)
};


// Size 0x1c
struct Projectile
{
public:
	struct Vector                                                Origin;                                            // 0x0(0xc)
	struct Vector                                                Direction;                                         // 0xc(0xc)
	float                                                        MaxDistance;                                       // 0x18(0x4)
};


// Size 0x90
struct FireBroadcast
{
public:
	class Actor*                                                 Instigator;                                        // 0x0(0x8)
	TArray<struct HitResult>                                     HitResults;                                        // 0x8(0x10)
	struct Vector                                                FirePosition;                                      // 0x18(0xc)
	struct Vector                                                FireDirection;                                     // 0x24(0xc)
	struct ProjectileAim                                         ProjectileAim;                                     // 0x30(0x50)
	int                                                          InaccuracySeed;                                    // 0x80(0x4)
	bool                                                         IsOutOfAmmo;                                       // 0x84(0x1)
	char                                                         pad0x3_BPCHH[0x3];                                 // 0x85(0x3)
	int                                                          NumProjectilesFired;                               // 0x88(0x4)
	char                                                         pad0x4_SFB60[0x4];                                 // 0x8c(0x4)
};


// Size 0xb0
struct FireRequest
{
public:
	class Actor*                                                 Instigator;                                        // 0x0(0x8)
	char                                                         pad0x8_UVQI8[0x8];                                 // 0x8(0x8)
	struct RemoteProjectileAim                                   RemoteAimData;                                     // 0x10(0x60)
	TArray<struct HitResult>                                     HitResults;                                        // 0x70(0x10)
	bool                                                         HitResultsAreFromShadowHitScan;                    // 0x80(0x1)
	char                                                         pad0x7_TVUCA[0x7];                                 // 0x81(0x7)
	TArray<struct FireRequestHitActorWorldTransform>             HitActorWorldTransforms;                           // 0x88(0x10)
	struct Guid                                                  TelemetryAttackId;                                 // 0x98(0x10)
	int                                                          InaccuracySeed;                                    // 0xa8(0x4)
	char                                                         pad0x4_DCG79[0x4];                                 // 0xac(0x4)
};


// Size 0x20
struct FireRequestHitActorWorldTransform
{
public:
	class Actor*                                                 Actor;                                             // 0x0(0x8)
	struct Vector                                                Location;                                          // 0x8(0xc)
	struct Rotator                                               Rotation;                                          // 0x14(0xc)
};


// Size 0x60
struct RemoteProjectileAim
{
public:
	struct ProjectileAim                                         AimData;                                           // 0x0(0x50)
	bool                                                         IsRelativeAim;                                     // 0x50(0x1)
	char                                                         pad0x7_LMQFB[0x7];                                 // 0x51(0x7)
	struct ProjectileTimeStamp                                   TimeStamp;                                         // 0x58(0x8)
};


// Size 0x10
struct AchievementBlockThenHitAndGetBlockedThenTakeHit
{
public:
	class AthenaPlayerCharacter*                                 Character;                                         // 0x0(0x8)
	float                                                        TimeWindowInSeconds;                               // 0x8(0x4)
	char                                                         pad0x4_0AR2Z[0x4];                                 // 0xc(0x4)
};


// Size 0x20
struct AchievementHaveADrinkWithAnotherCrewAtAnOutpost
{
public:
	class AthenaPlayerCharacter*                                 Character;                                         // 0x0(0x8)
	char                                                         pad0x10_RN0SN[0x10];                               // 0x8(0x10)
	float                                                        RangeOfCheckInMetres;                              // 0x18(0x4)
	float                                                        DrinkConsumedVolumeThreshold;                      // 0x1c(0x4)
};


// Size 0x10
struct AchievementHeavyAttackRivalOffTheirShip
{
public:
	class AthenaCharacter*                                       Character;                                         // 0x0(0x8)
	float                                                        TimeWindowInSeconds;                               // 0x8(0x4)
	char                                                         pad0x4_MFVL5[0x4];                                 // 0xc(0x4)
};


// Size 0x4
struct AchievementKillOpponentFromBehindWithBlunderbuss
{
public:
	float                                                        FacingDirAngleTolerance;                           // 0x0(0x4)
};


// Size 0x8
struct AchievementKillOpponentInContest
{
public:
	char                                                         pad0x8_SM1M8[0x8];                                 // 0x0(0x8)
};


// Size 0xc
struct SprintConditionsParams
{
public:
	float                                                        ForwardInputVectorTolerance;                       // 0x0(0x4)
	float                                                        MinVelocityForwardDot;                             // 0x4(0x4)
	float                                                        MinVelocityMagnitude;                              // 0x8(0x4)
};


// Size 0x48
struct SprintLogicHandler
{
public:
	char                                                         pad0x48_MEBTY[0x48];                               // 0x0(0x48)
};


// Size 0x8
struct WalkConditionsParams
{
public:
	float                                                        WalkSpeedMultiplier;                               // 0x0(0x4)
	float                                                        WalkStopThreshold;                                 // 0x4(0x4)
};


// Size 0xc
struct WalkLogicHandler
{
public:
	char                                                         pad0xc_W2R2C[0xc];                                 // 0x0(0xc)
};


// Size 0x68
struct AthenaPlayerCharacterModelSwap
{
public:
	class SkeletalMesh*                                          FirstPersonMesh;                                   // 0x0(0x8)
	class UClass*                                                FirstPersonAnimSetDataId;                          // 0x8(0x8)
	struct PirateGeneratorAdditionalBakeInfo                     FirstPersonAdditionalBakeInfo;                     // 0x10(0x20)
	class SkeletalMesh*                                          ThirdPersonMesh;                                   // 0x30(0x8)
	class UClass*                                                ThirdPersonAnimSetDataId;                          // 0x38(0x8)
	struct PirateGeneratorAdditionalBakeInfo                     ThirdPersonAdditionalBakeInfo;                     // 0x40(0x20)
	char                                                         pad0x8_IRQWM[0x8];                                 // 0x60(0x8)
};


// Size 0x78
struct Alliance
{
public:
	struct Guid                                                  AllianceId;                                        // 0x0(0x10)
	TArray<struct Guid>                                          Crews;                                             // 0x10(0x10)
	byte                                                         AllianceIndex;                                     // 0x20(0x1)
	char                                                         pad0x57_RB5YT[0x57];                               // 0x21(0x57)
};


// Size 0x14
struct CrewAllianceJoinStatus
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	byte                                                         AllianceJoinStatus;                                // 0x10(0x1)
	byte                                                         LastAllianceJoinStatus;                            // 0x11(0x1)
	char                                                         pad0x2_DSA4D[0x2];                                 // 0x12(0x2)
};


// Size 0x68
struct NPCCustomAnimationBlueprintData
{
public:
	bool                                                         SequenceActive;                                    // 0x0(0x1)
	bool                                                         LoopActive;                                        // 0x1(0x1)
	char                                                         pad0x2_QY6V1[0x2];                                 // 0x2(0x2)
	int                                                          ActiveSequenceIndex;                               // 0x4(0x4)
	bool                                                         IsOneShot;                                         // 0x8(0x1)
	char                                                         pad0x7_8RTB7[0x7];                                 // 0x9(0x7)
	struct NPCCustomAnimationBlueprintPlayingAnimations          BlueprintPlayingAnimations;                        // 0x10(0x28)
	struct NPCCustomAnimationBlueprintPlayingMontage             BlueprintPlayingFacialMontages;                    // 0x38(0x28)
	byte                                                         CustomAnimationState;                              // 0x60(0x1)
	char                                                         pad0x7_X0VPC[0x7];                                 // 0x61(0x7)
};


// Size 0x28
struct NPCCustomAnimationBlueprintPlayingMontage
{
public:
	class AnimMontage*                                           OneShot;                                           // 0x0(0x8)
	class AnimMontage*                                           ContinouousIn;                                     // 0x8(0x8)
	class AnimMontage*                                           ContinouousLoop_A;                                 // 0x10(0x8)
	class AnimMontage*                                           ContinouousLoop_B;                                 // 0x18(0x8)
	class AnimMontage*                                           ContinouousOut;                                    // 0x20(0x8)
};


// Size 0x28
struct NPCCustomAnimationBlueprintPlayingAnimations
{
public:
	class AnimSequenceBase*                                      OneShot;                                           // 0x0(0x8)
	class AnimSequenceBase*                                      ContinouousIn;                                     // 0x8(0x8)
	class AnimSequenceBase*                                      ContinouousLoop_A;                                 // 0x10(0x8)
	class AnimSequenceBase*                                      ContinouousLoop_B;                                 // 0x18(0x8)
	class AnimSequenceBase*                                      ContinouousOut;                                    // 0x20(0x8)
};


// Size 0x38
struct NPCCustomAnimationDataStructure
{
public:
	TArray<struct NPCOneShotAnimationElement>                    OneShotSequences;                                  // 0x0(0x10)
	TArray<struct NPCContinuousAnimationElement>                 ContinuousSequences;                               // 0x10(0x10)
	class NPCHeldObjectData*                                     WieldableCosmeticItemList;                         // 0x20(0x8)
	TArray<struct NPCInitialSpawnedCosmeticItems>                InitialSpawnedCosmeticItems;                       // 0x28(0x10)
};


// Size 0x10
struct NPCInitialSpawnedCosmeticItems
{
public:
	class UClass*                                                CosmeticItemObject;                                // 0x0(0x8)
	struct FName                                                 AttachSocketName;                                  // 0x8(0x8)
};


// Size 0x38
struct NPCContinuousAnimationElement
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	struct NPCAnimationContinuousCycle                           ContinuousSequence;                                // 0x8(0x30)
};


// Size 0x30
struct NPCAnimationContinuousCycle
{
public:
	struct NPCAnimationSequence                                  In;                                                // 0x0(0x10)
	TArray<struct NPCAnimationSequence>                          Loop;                                              // 0x10(0x10)
	struct NPCAnimationSequence                                  Out;                                               // 0x20(0x10)
};


// Size 0x10
struct NPCAnimationSequence
{
public:
	class AnimSequenceBase*                                      AnimationSequence;                                 // 0x0(0x8)
	class AnimMontage*                                           FacialAdditive;                                    // 0x8(0x8)
};


// Size 0x18
struct NPCOneShotAnimationElement
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	TArray<struct NPCAnimationSequence>                          OneShotSequence;                                   // 0x8(0x10)
};


// Size 0x20
struct AnimNotifyWwiseObserver
{
public:
	class WwiseEvent*                                            OnEventPosted;                                     // 0x0(0x8)
	bool                                                         PreventPlayingPostedEvent;                         // 0x8(0x1)
	char                                                         pad0x7_RR96Q[0x7];                                 // 0x9(0x7)
	TArray<class WwiseEvent*>                                    AdditionalEventsToTrigger;                         // 0x10(0x10)
};


// Size 0x14
struct JoinedCrew
{
public:
	char                                                         pad0x14_UZ8VR[0x14];                               // 0x0(0x14)
};


// Size 0x58
struct AthenaAnimationCustomSkeletonAnimationBlueprintData
{
public:
	bool                                                         SequenceActive;                                    // 0x0(0x1)
	bool                                                         LoopActive;                                        // 0x1(0x1)
	char                                                         pad0x2_TAY93[0x2];                                 // 0x2(0x2)
	int                                                          ActiveSequenceIndex;                               // 0x4(0x4)
	bool                                                         IsOneShot;                                         // 0x8(0x1)
	char                                                         pad0x7_VKU0M[0x7];                                 // 0x9(0x7)
	struct SkeletonCustomAnimationBlueprintPlayingAnimations     BlueprintPlayingAnimations;                        // 0x10(0x38)
	class NPCHeldObjectData*                                     WieldableCosmeticItemList;                         // 0x48(0x8)
	byte                                                         CustomAnimationState;                              // 0x50(0x1)
	char                                                         pad0x3_YOVB9[0x3];                                 // 0x51(0x3)
	float                                                        BlendTime;                                         // 0x54(0x4)
};


// Size 0x38
struct SkeletonCustomAnimationBlueprintPlayingAnimations
{
public:
	class AnimSequence*                                          OneShot;                                           // 0x0(0x8)
	class AnimSequence*                                          ContinuousIn;                                      // 0x8(0x8)
	class AnimSequence*                                          ContinuousLoop_A;                                  // 0x10(0x8)
	class AnimSequence*                                          ContinuousLoop_B;                                  // 0x18(0x8)
	class AnimSequence*                                          ContinuousOut;                                     // 0x20(0x8)
	TArray<class AnimSequence*>                                  AlternateContinuousOuts;                           // 0x28(0x10)
};


// Size 0x38
struct SkeletonCustomAnimationDataStructure
{
public:
	TArray<struct OneShotAnimationElement>                       OneShotSequences;                                  // 0x0(0x10)
	TArray<struct ContinuousAnimationElement>                    ContinuousSequences;                               // 0x10(0x10)
	class NPCHeldObjectData*                                     WieldableCosmeticItemList;                         // 0x20(0x8)
	TArray<class WwiseEvent*>                                    AudioEvents;                                       // 0x28(0x10)
};


// Size 0x58
struct ContinuousAnimationElement
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	struct AnimationContinuousCycle                              ContinuousSequence;                                // 0x8(0x48)
	float                                                        BlendTime;                                         // 0x50(0x4)
	char                                                         pad0x4_KXUAC[0x4];                                 // 0x54(0x4)
};


// Size 0x48
struct AnimationContinuousCycle
{
public:
	class AnimSequence*                                          In;                                                // 0x0(0x8)
	float                                                        InEffectTime;                                      // 0x8(0x4)
	char                                                         pad0x4_V8AEZ[0x4];                                 // 0xc(0x4)
	TArray<class AnimSequence*>                                  Loop;                                              // 0x10(0x10)
	class BlendSpace1D*                                          LoopHitReact;                                      // 0x20(0x8)
	class AnimSequence*                                          Out;                                               // 0x28(0x8)
	TArray<class AnimSequence*>                                  OutAlternates;                                     // 0x30(0x10)
	float                                                        OutUndockTime;                                     // 0x40(0x4)
	char                                                         pad0x4_Z0JXA[0x4];                                 // 0x44(0x4)
};


// Size 0x20
struct OneShotAnimationElement
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	TArray<class AnimSequence*>                                  OneShotSequence;                                   // 0x8(0x10)
	float                                                        EffectTime;                                        // 0x18(0x4)
	float                                                        BlendTime;                                         // 0x1c(0x4)
};


// Size 0x68
struct AthenaAnimationLocomotion
{
public:
	struct Vector                                                CharacterVelocity;                                 // 0x0(0xc)
	float                                                        WantedMovementSpeed;                               // 0xc(0x4)
	float                                                        HalfWantedMovementSpeed;                           // 0x10(0x4)
	bool                                                         CharacterMoving;                                   // 0x14(0x1)
	bool                                                         RunStopWanted;                                     // 0x15(0x1)
	char                                                         pad0x2_QKMKU[0x2];                                 // 0x16(0x2)
	float                                                        TurnRate;                                          // 0x18(0x4)
	float                                                        CurrentYaw;                                        // 0x1c(0x4)
	float                                                        CurrentDirection;                                  // 0x20(0x4)
	bool                                                         TurningActive;                                     // 0x24(0x1)
	bool                                                         TurningLeft;                                       // 0x25(0x1)
	bool                                                         IsSwimming;                                        // 0x26(0x1)
	bool                                                         IsUnderwaterSwimming;                              // 0x27(0x1)
	float                                                        BlendedTurnRate;                                   // 0x28(0x4)
	float                                                        MinimumMoveSpeedToTriggerRunStop;                  // 0x2c(0x4)
	float                                                        InterpSpeed;                                       // 0x30(0x4)
	float                                                        TurnRateToDisableTurns;                            // 0x34(0x4)
	float                                                        TurningAnimationExplicitTime;                      // 0x38(0x4)
	float                                                        FixedBlendedTurnRateForAI;                         // 0x3c(0x4)
	bool                                                         IsInAITurn;                                        // 0x40(0x1)
	char                                                         pad0x17_2ACRW[0x17];                               // 0x41(0x17)
	class AthenaAnimationInstance*                               CachedOwner;                                       // 0x58(0x8)
	char                                                         pad0x8_9VWIK[0x8];                                 // 0x60(0x8)
};


// Size 0x3f0
struct AthenaAnimationFishing
{
public:
	bool                                                         AnimationOverride;                                 // 0x0(0x1)
	char                                                         pad0x3cf_6408H[0x3cf];                             // 0x1(0x3cf)
	class Actor*                                                 FishingRodActor;                                   // 0x3d0(0x8)
	class Actor*                                                 FishingFloat;                                      // 0x3d8(0x8)
	class AthenaAnimationInstance*                               OwningAnimationInstance;                           // 0x3e0(0x8)
	char                                                         pad0x8_GG3YB[0x8];                                 // 0x3e8(0x8)
};


// Size 0x34
struct AthenaAnimationFishingParams
{
public:
	byte                                                         FishingState;                                      // 0x0(0x1)
	bool                                                         InFishing;                                         // 0x1(0x1)
	char                                                         pad0x2_B6KDZ[0x2];                                 // 0x2(0x2)
	struct Vector2D                                              RodBend;                                           // 0x4(0x8)
	float                                                        ReelSpeed;                                         // 0xc(0x4)
	bool                                                         CastFailed;                                        // 0x10(0x1)
	bool                                                         IsFishHookedAndVisible;                            // 0x11(0x1)
	char                                                         pad0x2_PZ6JX[0x2];                                 // 0x12(0x2)
	struct Vector2D                                              PlayerInputForce;                                  // 0x14(0x8)
	float                                                        TensionShake;                                      // 0x1c(0x4)
	float                                                        LineSnapShake;                                     // 0x20(0x4)
	bool                                                         IKIsActive;                                        // 0x24(0x1)
	char                                                         pad0x3_0VTV8[0x3];                                 // 0x25(0x3)
	float                                                        IKBlendInSpeed;                                    // 0x28(0x4)
	float                                                        IKBlendIOutSpeed;                                  // 0x2c(0x4)
	bool                                                         IsComedyItem;                                      // 0x30(0x1)
	byte                                                         FishingJIPState;                                   // 0x31(0x1)
	char                                                         pad0x2_181Q9[0x2];                                 // 0x32(0x2)
};


// Size 0x10
struct AthenaAnimationIdleVariantChange
{
public:
	float                                                        CurrentTime;                                       // 0x0(0x4)
	float                                                        TriggerTime;                                       // 0x4(0x4)
	int                                                          VariantID;                                         // 0x8(0x4)
	bool                                                         VariantCompleted;                                  // 0xc(0x1)
	char                                                         pad0x3_L5E2B[0x3];                                 // 0xd(0x3)
};


// Size 0xc8
struct AthenaAnimationRowboatParams
{
public:
	bool                                                         InLeftArmRow;                                      // 0x0(0x1)
	bool                                                         InLeftArmRecover;                                  // 0x1(0x1)
	bool                                                         InRightArmRow;                                     // 0x2(0x1)
	bool                                                         InRightArmRecover;                                 // 0x3(0x1)
	float                                                        LeftArmForce;                                      // 0x4(0x4)
	float                                                        LeftArmRecover;                                    // 0x8(0x4)
	float                                                        RightArmForce;                                     // 0xc(0x4)
	float                                                        RightArmRecover;                                   // 0x10(0x4)
	byte                                                         Braking;                                           // 0x14(0x1)
	bool                                                         BrakingLeftOrBoth;                                 // 0x15(0x1)
	bool                                                         BrakingRightOrBoth;                                // 0x16(0x1)
	char                                                         pad0x1_3V5XI[0x1];                                 // 0x17(0x1)
	int                                                          Direction;                                         // 0x18(0x4)
	bool                                                         PlayIdle;                                          // 0x1c(0x1)
	bool                                                         LeftArmInactive;                                   // 0x1d(0x1)
	bool                                                         RightArmInactive;                                  // 0x1e(0x1)
	char                                                         pad0x1_HOTFC[0x1];                                 // 0x1f(0x1)
	struct Vector                                                CameraAdjustment;                                  // 0x20(0xc)
	bool                                                         IsSeated;                                          // 0x2c(0x1)
	char                                                         pad0x3_TF67W[0x3];                                 // 0x2d(0x3)
	struct AthenaAnimationRowboatAnimationsFirstPerson           RowBoatAnimationsFirstPerson;                      // 0x30(0x30)
	struct AthenaAnimationRowboatAnimationsThirdPerson           RowBoatAnimationsThirdPerson;                      // 0x60(0x50)
	struct AthenaAnimationRowboatAnimationsPassenger             RowBoatAnimationsPassenger;                        // 0xb0(0x18)
};


// Size 0x18
struct AthenaAnimationRowboatAnimationsPassenger
{
public:
	class AnimSequence*                                          PassengerIntoSitting;                              // 0x0(0x8)
	class AnimSequence*                                          PassengerSittingIdle;                              // 0x8(0x8)
	class AnimSequence*                                          PassengerStand;                                    // 0x10(0x8)
};


// Size 0x50
struct AthenaAnimationRowboatAnimationsThirdPerson
{
public:
	class AnimSequence*                                          SitDown;                                           // 0x0(0x8)
	class AnimSequence*                                          Stand;                                             // 0x8(0x8)
	class AnimSequence*                                          Idle;                                              // 0x10(0x8)
	class BlendSpace1D*                                          Row;                                               // 0x18(0x8)
	class BlendSpace1D*                                          Recover;                                           // 0x20(0x8)
	class BlendSpace1D*                                          IntoRow;                                           // 0x28(0x8)
	class BlendSpace1D*                                          IntoRowBrake;                                      // 0x30(0x8)
	class BlendSpace1D*                                          BrakeRow;                                          // 0x38(0x8)
	class BlendSpace1D*                                          BrakeRecover;                                      // 0x40(0x8)
	class BlendSpace1D*                                          BrakeIdle;                                         // 0x48(0x8)
};


// Size 0x30
struct AthenaAnimationRowboatAnimationsFirstPerson
{
public:
	class AnimSequence*                                          SitDown;                                           // 0x0(0x8)
	class AnimSequence*                                          Stand;                                             // 0x8(0x8)
	class AnimSequence*                                          Idle;                                              // 0x10(0x8)
	class AnimSequence*                                          Row;                                               // 0x18(0x8)
	class AnimSequence*                                          Recover;                                           // 0x20(0x8)
	class AnimSequence*                                          Brake;                                             // 0x28(0x8)
};


// Size 0xe0
struct AthenaAnimationRowing
{
public:
	class Actor*                                                 ControlledObject;                                  // 0x0(0x8)
	class Actor*                                                 CachedPlayerCharacter;                             // 0x8(0x8)
	class UClass*                                                CosmeticOarClass;                                  // 0x10(0x8)
	char                                                         pad0xc8_5GEXT[0xc8];                               // 0x18(0xc8)
};


// Size 0x5f0
struct AthenaAnimationWieldedItemStateMachine
{
public:
	byte                                                         CurrentState;                                      // 0x0(0x1)
	byte                                                         PreviousState;                                     // 0x1(0x1)
	bool                                                         ExpectingTransition;                               // 0x2(0x1)
	char                                                         pad0x5_F132C[0x5];                                 // 0x3(0x5)
	class UClass*                                                ContinuousUseInputId;                              // 0x8(0x8)
	class UClass*                                                OutOfContinuousUseInputId;                         // 0x10(0x8)
	class UClass*                                                OneShotUseInputId;                                 // 0x18(0x8)
	bool                                                         OneShotIsAlternate;                                // 0x20(0x1)
	bool                                                         ContinuousIsAlternate;                             // 0x21(0x1)
	byte                                                         OneShotAnimationVariant;                           // 0x22(0x1)
	bool                                                         IdleIsAlternate;                                   // 0x23(0x1)
	bool                                                         UsePrimaryContinuousAnimations;                    // 0x24(0x1)
	bool                                                         UsePrimaryContinuousOutOfAnimations;               // 0x25(0x1)
	bool                                                         UsePrimaryOneShotAnimations;                       // 0x26(0x1)
	char                                                         pad0x29_C612S[0x29];                               // 0x27(0x29)
	class AnimSequence*                                          LastValidAnimSequence;                             // 0x50(0x8)
	class BlendSpace1D*                                          LastValidBlendspace;                               // 0x58(0x8)
	class Actor*                                                 PreviousWieldedItem;                               // 0x60(0x8)
	bool                                                         DuplicateTransition;                               // 0x68(0x1)
	char                                                         pad0x3_YZBIR[0x3];                                 // 0x69(0x3)
	struct FName                                                 WieldSockets;                                      // 0x6c(0x8)
	char                                                         pad0x57c_H5BIK[0x57c];                             // 0x74(0x57c)
};


// Size 0x28
struct AthenaAnimationSkeletonCurseAnimations
{
public:
	class AnimSequence*                                          SkeletonDrunk;                                     // 0x0(0x8)
	class AnimSequence*                                          SkeletonDance;                                     // 0x8(0x8)
	class AnimSequence*                                          SkeletonSleepInto;                                 // 0x10(0x8)
	class AnimSequence*                                          SkeletonSleepLoop;                                 // 0x18(0x8)
	class AnimSequence*                                          SkeletonSleepOut;                                  // 0x20(0x8)
};


// Size 0x8
struct AthenaAnimationSkeletonScream
{
public:
	class AnimSequence*                                          SkeletonScream;                                    // 0x0(0x8)
};


// Size 0x38
struct AthenaAnimationSkeletonFleeInGraph
{
public:
	class AnimSequence*                                          TurnLeft;                                          // 0x0(0x8)
	class AnimSequence*                                          TurnRight;                                         // 0x8(0x8)
	class BlendSpace*                                            LocomotionBase;                                    // 0x10(0x8)
	class BlendSpace*                                            LocomotionVariant;                                 // 0x18(0x8)
	TArray<class BlendSpace*>                                    LocomotionVariantSelection;                        // 0x20(0x10)
	int                                                          PrecentageChanceOfVariantOccuring;                 // 0x30(0x4)
	char                                                         pad0x4_L843Y[0x4];                                 // 0x34(0x4)
};


// Size 0x40
struct AthenaAnimationSkeletonFlee
{
public:
	class UClass*                                                UseWithObject;                                     // 0x0(0x8)
	TArray<class AnimSequence*>                                  FleeTurnLeft;                                      // 0x8(0x10)
	TArray<class AnimSequence*>                                  FleeTurnRight;                                     // 0x18(0x10)
	class BlendSpace*                                            FleeLocomotionBase;                                // 0x28(0x8)
	TArray<class BlendSpace*>                                    FleeLocomotionVariants;                            // 0x30(0x10)
};


// Size 0x38
struct AthenaAnimationSkeletonEmoteActionParams
{
public:
	TArray<struct AthenaAnimationSkeletonEmoteActionAnimations>  AllLoadedAIEmoteActionAnimations;                  // 0x0(0x10)
	byte                                                         CurrentEmoteActionState;                           // 0x10(0x1)
	char                                                         pad0x7_ZN5EU[0x7];                                 // 0x11(0x7)
	class AnimSequence*                                          TauntAnimation;                                    // 0x18(0x8)
	class AnimSequence*                                          CheerAnimation;                                    // 0x20(0x8)
	class AnimSequence*                                          TauntAnimationB;                                   // 0x28(0x8)
	class AnimSequence*                                          CheerAnimationB;                                   // 0x30(0x8)
};


// Size 0x28
struct AthenaAnimationSkeletonEmoteActionAnimations
{
public:
	class UClass*                                                UseWithObject;                                     // 0x0(0x8)
	TArray<class AnimSequence*>                                  Taunt;                                             // 0x8(0x10)
	TArray<class AnimSequence*>                                  Cheer;                                             // 0x18(0x10)
};


// Size 0x60
struct AthenaAnimationSkeletonShipCaptainParams
{
public:
	struct AthenaAnimationSkeletonShipCaptainAnimations          AllSkeletonShipCaptainAnimations;                  // 0x0(0x48)
	class AnimSequence*                                          ShipCaptainIdleCycleA;                             // 0x48(0x8)
	class AnimSequence*                                          ShipCaptainIdleCycleB;                             // 0x50(0x8)
	byte                                                         DockedAnimationState;                              // 0x58(0x1)
	char                                                         pad0x7_9Q9CY[0x7];                                 // 0x59(0x7)
};


// Size 0x48
struct AthenaAnimationSkeletonShipCaptainAnimations
{
public:
	class AnimSequence*                                          EnterDockedPose;                                   // 0x0(0x8)
	TArray<class AnimSequence*>                                  DockedIdles;                                       // 0x8(0x10)
	class AnimSequence*                                          ExitDockedPose;                                    // 0x18(0x8)
	class AnimSequence*                                          Taunt;                                             // 0x20(0x8)
	class AnimSequence*                                          RamInto;                                           // 0x28(0x8)
	class AnimSequence*                                          RamCycle;                                          // 0x30(0x8)
	class AnimSequence*                                          RamImpact;                                         // 0x38(0x8)
	class AnimSequence*                                          RamOutOf;                                          // 0x40(0x8)
};


// Size 0x38
struct AthenaAnimationSkeletonSensingParams
{
public:
	TArray<struct AthenaAnimationSkeletonSensingAnimations>      AllLoadedAISensingAnimations;                      // 0x0(0x10)
	byte                                                         CurrentSensingState;                               // 0x10(0x1)
	char                                                         pad0x7_STWRW[0x7];                                 // 0x11(0x7)
	class AnimSequence*                                          InitialReactionAnimation;                          // 0x18(0x8)
	class BlendSpace1D*                                          SearchingAnimation;                                // 0x20(0x8)
	class AnimSequence*                                          AlertingOthersAnimation;                           // 0x28(0x8)
	class BlendSpace1D*                                          PursuitAnimation;                                  // 0x30(0x8)
};


// Size 0x28
struct AthenaAnimationSkeletonSensingAnimations
{
public:
	class UClass*                                                UseWithObject;                                     // 0x0(0x8)
	class AnimSequence*                                          InitialReaction;                                   // 0x8(0x8)
	class BlendSpace1D*                                          Searching;                                         // 0x10(0x8)
	class AnimSequence*                                          AlertingOthers;                                    // 0x18(0x8)
	class BlendSpace1D*                                          Pursuit;                                           // 0x20(0x8)
};


// Size 0x358
struct AthenaAnimationAI
{
public:
	bool                                                         SpawnAnimationActive;                              // 0x0(0x1)
	bool                                                         SpawnAnimationReadyToBegin;                        // 0x1(0x1)
	char                                                         pad0x6_J69SP[0x6];                                 // 0x2(0x6)
	class AnimSequence*                                          AISpawn;                                           // 0x8(0x8)
	class AnimSequence*                                          AIDespawn;                                         // 0x10(0x8)
	float                                                        AIAnimationSpawnTime;                              // 0x18(0x4)
	bool                                                         AISpawnOnLand;                                     // 0x1c(0x1)
	bool                                                         AIFleeActive;                                      // 0x1d(0x1)
	char                                                         pad0x2_KHOS3[0x2];                                 // 0x1e(0x2)
	struct AthenaAnimationSkeletonSensingParams                  AISensing;                                         // 0x20(0x38)
	struct AthenaAnimationSkeletonEmoteActionParams              AIEmoteActions;                                    // 0x58(0x38)
	struct AthenaAnimationSkeletonShipCaptainParams              SkeletonShipCaptainParams;                         // 0x90(0x60)
	char                                                         pad0x268_2C1B8[0x268];                             // 0xf0(0x268)
};


// Size 0x30
struct AthenaAnimationAIKnockback
{
public:
	struct AthenaAnimationSkeletonKnockbackLocomotionStrength    KnockbackAnimations;                               // 0x0(0x20)
	byte                                                         AIKnockbackDirection;                              // 0x20(0x1)
	char                                                         pad0x3_W207L[0x3];                                 // 0x21(0x3)
	bool                                                         KnockbackActive;                                   // 0x24(0x1)
	char                                                         pad0x3_NS6CO[0x3];                                 // 0x25(0x3)
	class AnimSequence*                                          KnockbackAnimToUse;                                // 0x28(0x8)
};


// Size 0x20
struct AthenaAnimationSkeletonKnockbackLocomotionStrength
{
public:
	struct AthenaAnimationSkeletonKnockbackLocomotion            LowStrength;                                       // 0x0(0x10)
	struct AthenaAnimationSkeletonKnockbackLocomotion            HighStrength;                                      // 0x10(0x10)
};


// Size 0x10
struct AthenaAnimationSkeletonKnockbackLocomotion
{
public:
	class AnimSequence*                                          Forwards;                                          // 0x0(0x8)
	class AnimSequence*                                          Backwards;                                         // 0x8(0x8)
};


// Size 0x48
struct AthenaAnimationFootPlanting
{
public:
	char                                                         pad0x8_JT6JY[0x8];                                 // 0x0(0x8)
	struct CollisionResponseContainer                            OverrideRaycast;                                   // 0x8(0x20)
	float                                                        HipHeight;                                         // 0x28(0x4)
	float                                                        HipPullStrength;                                   // 0x2c(0x4)
	float                                                        DownDistance;                                      // 0x30(0x4)
	float                                                        DownDistanceRangeStart;                            // 0x34(0x4)
	float                                                        DownDistanceRangeEnd;                              // 0x38(0x4)
	float                                                        IKLegStretch;                                      // 0x3c(0x4)
	float                                                        SlopeAngle;                                        // 0x40(0x4)
	bool                                                         Active;                                            // 0x44(0x1)
	bool                                                         FeetContact;                                       // 0x45(0x1)
	char                                                         pad0x2_VXH2B[0x2];                                 // 0x46(0x2)
};


// Size 0x8
struct AthenaAnimationStunData
{
public:
	byte                                                         StunAnimType;                                      // 0x0(0x1)
	char                                                         pad0x3_AQDMG[0x3];                                 // 0x1(0x3)
	bool                                                         IsCursedVariant;                                   // 0x4(0x1)
	char                                                         pad0x3_C6XT4[0x3];                                 // 0x5(0x3)
};


// Size 0x28
struct AthenaAnimationHarpoonLauncherAnimData
{
public:
	TArray<class BlendSpace1D*>                                  Idle;                                              // 0x0(0x10)
	class BlendSpace1D*                                          FireInto;                                          // 0x10(0x8)
	class BlendSpace1D*                                          FireOutOf;                                         // 0x18(0x8)
	class BlendSpace1D*                                          FireAction;                                        // 0x20(0x8)
};


// Size 0x128
struct AthenaAnimationMountedWeapon
{
public:
	bool                                                         IsFiring;                                          // 0x0(0x1)
	char                                                         pad0x3_8QMZJ[0x3];                                 // 0x1(0x3)
	float                                                        Pitch;                                             // 0x4(0x4)
	float                                                        Yaw;                                               // 0x8(0x4)
	char                                                         pad0x4_OGO7O[0x4];                                 // 0xc(0x4)
	class Actor*                                                 ControlledObject;                                  // 0x10(0x8)
	char                                                         pad0x110_NO4D5[0x110];                             // 0x18(0x110)
};


// Size 0x40
struct AssetDelayLoadEntry
{
public:
	struct FString                                               Comment;                                           // 0x0(0x10)
	byte                                                         LoadAtPhase;                                       // 0x10(0x1)
	byte                                                         Persistence;                                       // 0x11(0x1)
	bool                                                         LoadForClient;                                     // 0x12(0x1)
	bool                                                         LoadForServer;                                     // 0x13(0x1)
	struct FName                                                 Feature;                                           // 0x14(0x8)
	char                                                         pad0x4_5F2TZ[0x4];                                 // 0x1c(0x4)
	TArray<struct StringAssetReference>                          AssetsToLoad;                                      // 0x20(0x10)
	TArray<Assetclass BlueprintsToLoad>                          BlueprintsToLoad;                                  // 0x30(0x10)
};


// Size 0x10
struct RequestedLoopAnims
{
public:
	struct FName                                                 RequestedLoopingAnimName;                          // 0x0(0x8)
	int                                                          RequestedOutOfAnimIndex;                           // 0x8(0x4)
	int                                                          AnimationAssetRequired;                            // 0xc(0x4)
};


// Size 0x100
struct VoyageParticipantViewContainer
{
public:
	struct VoyageParticipantView                                 State;                                             // 0x0(0x100)
};


// Size 0x100
struct VoyageParticipantView
{
public:
	struct FText                                                 Title;                                             // 0x0(0x38)
	struct Guid                                                  Id;                                                // 0x38(0x10)
	int                                                          ChapterIndex;                                      // 0x48(0x4)
	int                                                          ChapterCount;                                      // 0x4c(0x4)
	int                                                          ActiveQuestCount;                                  // 0x50(0x4)
	byte                                                         History;                                           // 0x54(0x1)
	char                                                         pad0x3_JTRFP[0x3];                                 // 0x55(0x3)
	class UClass*                                                Company;                                           // 0x58(0x8)
	bool                                                         IsEmergent;                                        // 0x60(0x1)
	bool                                                         IsTale;                                            // 0x61(0x1)
	bool                                                         IsDiveVoyage;                                      // 0x62(0x1)
	byte                                                         EmergentSource;                                    // 0x63(0x1)
	struct ViewVoyageBanners                                     ViewVoyageBanners;                                 // 0x64(0x3)
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x67(0x1)
	int                                                          Rank;                                              // 0x68(0x4)
	struct NetActorPtr                                           PlayerStateOfDiscoverer;                           // 0x6c(0x14)
	bool                                                         IsDiscovererMe;                                    // 0x80(0x1)
	char                                                         pad0x3_FQCWH[0x3];                                 // 0x81(0x3)
	struct FName                                                 ChestRarity;                                       // 0x84(0x8)
	bool                                                         PlayAudio;                                         // 0x8c(0x1)
	char                                                         pad0x3_Q2PAE[0x3];                                 // 0x8d(0x3)
	int                                                          ChestDiscoveredId;                                 // 0x90(0x4)
	char                                                         pad0x4_5T4TW[0x4];                                 // 0x94(0x4)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x98(0x8)
	int                                                          CollectCratesPopUpId;                              // 0xa0(0x4)
	char                                                         pad0x4_VEBJA[0x4];                                 // 0xa4(0x4)
	TArray<struct PlayerStat>                                    VoyageBegunStats;                                  // 0xa8(0x10)
	TArray<struct PlayerStat>                                    VoyageCompletionStats;                             // 0xb8(0x10)
	TArray<struct PlayerStat>                                    DiveVoyageCompletionStats;                         // 0xc8(0x10)
	TArray<struct PlayerStat>                                    ReapersMarkCompletionStats;                        // 0xd8(0x10)
	TArray<struct VoyageCompletionReward>                        VoyageCompletionRewards;                           // 0xe8(0x10)
	byte                                                         VoyageHintType;                                    // 0xf8(0x1)
	char                                                         pad0x7_NCOB3[0x7];                                 // 0xf9(0x7)
};


// Size 0x10
struct VoyageCompletionReward
{
public:
	TArray<struct RewardId>                                      Rewards;                                           // 0x0(0x10)
};


// Size 0x3
struct ViewVoyageBanners
{
public:
	byte                                                         ShowIntroBanners;                                  // 0x0(0x1)
	byte                                                         ShowOutroBanners;                                  // 0x1(0x1)
	struct ViewCustomVoyageBanners                               ShowCustomIntroBanners;                            // 0x2(0x1)
};


// Size 0x1
struct ViewCustomVoyageBanners
{
public:
	byte                                                         ShowQuestReceivedBanners;                          // 0x0(0x1)
};


// Size 0x9c
struct AthenaCharacterSwimParams
{
public:
	float                                                        EnterSwimmingDepth;                                // 0x0(0x4)
	float                                                        ExitSwimmingDepth;                                 // 0x4(0x4)
	float                                                        FloatHeight;                                       // 0x8(0x4)
	float                                                        ThirdPersonMeshOffset;                             // 0xc(0x4)
	float                                                        ThirdPersonMeshAdjustTime;                         // 0x10(0x4)
	float                                                        FullGravityHeight;                                 // 0x14(0x4)
	float                                                        SurfaceSwimDepth;                                  // 0x18(0x4)
	float                                                        SurfaceSwimExitDepth;                              // 0x1c(0x4)
	float                                                        SubmergedBuoyancyDepth;                            // 0x20(0x4)
	float                                                        ZeroDragDepth;                                     // 0x24(0x4)
	float                                                        MaxBuoyancyAcceleration;                           // 0x28(0x4)
	float                                                        SubmergedBuoyancyAcceleration;                     // 0x2c(0x4)
	float                                                        SubmergedBuoyancyTime;                             // 0x30(0x4)
	float                                                        DragFactor;                                        // 0x34(0x4)
	float                                                        MaxDragAcceleration;                               // 0x38(0x4)
	float                                                        MinPushDownRoofAngle;                              // 0x3c(0x4)
	float                                                        MinPushDownRoofZ;                                  // 0x40(0x4)
	float                                                        MinCorrectionVelForSurfaceSwim;                    // 0x44(0x4)
	float                                                        SurfaceVelBlendTime;                               // 0x48(0x4)
	float                                                        UnderwaterSwimmingEntryPitch;                      // 0x4c(0x4)
	float                                                        UnderwaterSwimmingEntryAccel;                      // 0x50(0x4)
	float                                                        UnderwaterSwimDepth;                               // 0x54(0x4)
	float                                                        UnderwaterSwimmingDragSpeed;                       // 0x58(0x4)
	float                                                        UnderwaterSwimmingSpeed;                           // 0x5c(0x4)
	float                                                        PitchBlendOffRate;                                 // 0x60(0x4)
	float                                                        MaxSwimDepth;                                      // 0x64(0x4)
	float                                                        MaxSwimDepthBuoyancy;                              // 0x68(0x4)
	float                                                        MaxSwimDepthBuoyancyRange;                         // 0x6c(0x4)
	float                                                        MaxSwimDepthDragFactor;                            // 0x70(0x4)
	float                                                        CharacterCentreOffset;                             // 0x74(0x4)
	byte                                                         WaterDepthTraceQueryType;                          // 0x78(0x1)
	char                                                         pad0x3_ZSG6X[0x3];                                 // 0x79(0x3)
	struct AthenaCharacterSwimSpeed                              SurfaceSwimSpeeds;                                 // 0x7c(0xc)
	struct AthenaCharacterSwimSpeed                              UnderwaterSwimSpeeds;                              // 0x88(0xc)
	float                                                        SurfaceSwimmingDepthWhenEnteredWater;              // 0x94(0x4)
	char                                                         pad0x4_42JRD[0x4];                                 // 0x98(0x4)
};


// Size 0xc
struct AthenaCharacterSwimSpeed
{
public:
	float                                                        SprintSpdAmp;                                      // 0x0(0x4)
	float                                                        SprintAccelAmp;                                    // 0x4(0x4)
	float                                                        TurnSpeedScalar;                                   // 0x8(0x4)
};


// Size 0x10
struct AthenaCharacterDodgeParams
{
public:
	float                                                        DodgeCooldown;                                     // 0x0(0x4)
	float                                                        DodgeForce;                                        // 0x4(0x4)
	float                                                        GroundLaunchAngle;                                 // 0x8(0x4)
	bool                                                         DodgePerpendicularToGround;                        // 0xc(0x1)
	bool                                                         Disabled;                                          // 0xd(0x1)
	char                                                         pad0x2_209QJ[0x2];                                 // 0xe(0x2)
};


// Size 0x8
struct NetPositionErrorTolerance
{
public:
	float                                                        ZDistance;                                         // 0x0(0x4)
	float                                                        XYDistance;                                        // 0x4(0x4)
};


// Size 0x48
struct AthenaAnimationOverrideEntry
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	struct StringAssetReference                                  MeshFirstPerson;                                   // 0x8(0x10)
	struct StringAssetReference                                  MeshThirdPerson;                                   // 0x18(0x10)
	struct StringAssetReference                                  AnimationDataStore;                                // 0x28(0x10)
	class UClass*                                                ALKFirstPerson;                                    // 0x38(0x8)
	class UClass*                                                ALKThirdPerson;                                    // 0x40(0x8)
};


// Size 0x20
struct PlayModeLevelArray
{
public:
	TArray<struct StringAssetReference>                          PlayModeLevels;                                    // 0x0(0x10)
	TArray<struct SubModeLevel>                                  SubModes;                                          // 0x10(0x10)
};


// Size 0x20
struct SubModeLevel
{
public:
	struct FString                                               SubMode;                                           // 0x0(0x10)
	struct StringAssetReference                                  Level;                                             // 0x10(0x10)
};


// Size 0x18
struct FirstInteractableTelemetryEvent
{
public:
	float                                                        StartTime;                                         // 0x0(0x4)
	float                                                        FirstSpinnerShownTime;                             // 0x4(0x4)
	float                                                        StartEntryLevelLoadTime;                           // 0x8(0x4)
	float                                                        StartLegalSplashTime;                              // 0xc(0x4)
	float                                                        EndLegalSplashTime;                                // 0x10(0x4)
	float                                                        FirstInteractableTime;                             // 0x14(0x4)
};


// Size 0x28
struct LoadingTelemetryEvent
{
public:
	struct FString                                               LoadingEvent;                                      // 0x0(0x10)
	struct FString                                               MapName;                                           // 0x10(0x10)
	float                                                        StartTime;                                         // 0x20(0x4)
	float                                                        EndTime;                                           // 0x24(0x4)
};


// Size 0xf8
struct StorageContainerRefresher
{
public:
	char                                                         pad0xf8_TFWYH[0xf8];                               // 0x0(0xf8)
};


// Size 0x18
struct OnlineAthenaGameModeConfigurationSettings
{
public:
	struct Timespan                                              PreLoginEntitlementQueryTimeout;                   // 0x0(0x8)
	struct Timespan                                              PreLoginPirateValidationTimeout;                   // 0x8(0x8)
	bool                                                         ConfigAllowCrossWorld;                             // 0x10(0x1)
	char                                                         pad0x7_U4LMF[0x7];                                 // 0x11(0x7)
};


// Size 0xc
struct ServerLifetimeConfigurationSettings
{
public:
	float                                                        ServerTimeToLiveSeconds;                           // 0x0(0x4)
	float                                                        HeartbeatFrequencySeconds;                         // 0x4(0x4)
	float                                                        MaxTimeToAcceptShutdownRequestSeconds;             // 0x8(0x4)
};


// Size 0x10
struct ServerTelemetryConfigurationSettings
{
public:
	float                                                        PlayerHeartbeatInterval;                           // 0x0(0x4)
	bool                                                         TelemetryEnabled_ItemEquip;                        // 0x4(0x1)
	bool                                                         TelemetryEnabled_ItemUsageEnd;                     // 0x5(0x1)
	bool                                                         TelemetryEnabled_ItemUsageStart;                   // 0x6(0x1)
	bool                                                         TelemetryEnabled_ObjectUsageEnd;                   // 0x7(0x1)
	bool                                                         TelemetryEnabled_ObjectUsageStart;                 // 0x8(0x1)
	bool                                                         TelemetryEnabled_PlayerAction;                     // 0x9(0x1)
	bool                                                         TelemetryEnabled_PlayerChangedLoadout;             // 0xa(0x1)
	bool                                                         TelemetryEnabled_PlayerChangedShipLoadout;         // 0xb(0x1)
	bool                                                         TelemetryEnabled_PlayerHeartbeat;                  // 0xc(0x1)
	bool                                                         TelemetryEnabled_PlayerPerformedEmote;             // 0xd(0x1)
	char                                                         pad0x2_ZBTT3[0x2];                                 // 0xe(0x2)
};


// Size 0x20
struct DebugReplicatedAbilityData
{
public:
	struct AIAbilityDebugReplicatedIntervals                     AbilityIntervals;                                  // 0x0(0xc)
	char                                                         pad0x4_E5E0D[0x4];                                 // 0xc(0x4)
	class UClass*                                                TypeClass;                                         // 0x10(0x8)
	bool                                                         AbilityInRange;                                    // 0x18(0x1)
	bool                                                         AbilityDebugBlocked;                               // 0x19(0x1)
	bool                                                         UseTimerBetween;                                   // 0x1a(0x1)
	bool                                                         UseDamageBetween;                                  // 0x1b(0x1)
	byte                                                         DamageIntervalBlockMode;                           // 0x1c(0x1)
	char                                                         pad0x3_0JYBP[0x3];                                 // 0x1d(0x3)
};


// Size 0x18
struct MakeFriendsEmoteParams
{
public:
	TArray<struct FName>                                         TriggerEmoteNames;                                 // 0x0(0x10)
	float                                                        TriggerDistanceThreshold;                          // 0x10(0x4)
	char                                                         pad0x4_0HV94[0x4];                                 // 0x14(0x4)
};


// Size 0x8
struct CharacterSocketCollisionServiceParams
{
public:
	float                                                        MaxCharacterDistanceSqr;                           // 0x0(0x4)
	int                                                          MaxSockets;                                        // 0x4(0x4)
};


// Size 0x28
struct MermaidRespawnConfig
{
public:
	float                                                        ScorePenaltyForEachMeterAwayFromShipwreck;         // 0x0(0x4)
	float                                                        MinRespawnLocDistanceFromSunkShip;                 // 0x4(0x4)
	float                                                        MinScorePenaltyForEnemyShipProximity;              // 0x8(0x4)
	float                                                        MaxScorePenaltyForEnemyShipProximity;              // 0xc(0x4)
	float                                                        MaxDistanceFromEnemyShipToApplyPenalty;            // 0x10(0x4)
	float                                                        MinScorePenaltyForAlliedShipProximity;             // 0x14(0x4)
	float                                                        MaxScorePenaltyForAlliedShipProximity;             // 0x18(0x4)
	float                                                        MaxDistanceFromAlliedShipToApplyPenalty;           // 0x1c(0x4)
	float                                                        MaxDistanceFromIslandWeHaveMapForToApplyPenalty;   // 0x20(0x4)
	float                                                        ScorePenaltyForIslandsWeHaveMapFor;                // 0x24(0x4)
};


// Size 0x10
struct SeaOfThievesOnDemandTreasurePopupConversionTable
{
public:
	TArray<struct SeaOfThievesOnDemandTreasurePopupConversionPair> Conversions;                                       // 0x0(0x10)
};


// Size 0x20
struct SeaOfThievesOnDemandTreasurePopupConversionPair
{
public:
	struct StringAssetReference                                  From;                                              // 0x0(0x10)
	struct StringAssetReference                                  To;                                                // 0x10(0x10)
};


// Size 0x38
struct DigSurfaceTypeParams
{
public:
	byte                                                         SurfaceType;                                       // 0x0(0x1)
	char                                                         pad0x7_G8UM0[0x7];                                 // 0x1(0x7)
	struct DigEventFxParams                                      EnterGroundFx;                                     // 0x8(0x18)
	struct DigEventFxParams                                      LeaveGroundFx;                                     // 0x20(0x18)
};


// Size 0x18
struct DigEventFxParams
{
public:
	class Object*                                                Particles;                                         // 0x0(0x8)
	bool                                                         bAttachParticlesToShovel;                          // 0x8(0x1)
	char                                                         pad0x7_SIJ2I[0x7];                                 // 0x9(0x7)
	class ForceFeedbackEffect*                                   Rumble;                                            // 0x10(0x8)
};


// Size 0x18
struct SurfaceDigHole
{
public:
	byte                                                         SurfaceType;                                       // 0x0(0x1)
	char                                                         pad0x7_XE22I[0x7];                                 // 0x1(0x7)
	class UClass*                                                DigHoleClass;                                      // 0x8(0x8)
	float                                                        DigAINoiseRange;                                   // 0x10(0x4)
	char                                                         pad0x4_47FHN[0x4];                                 // 0x14(0x4)
};


// Size 0x60
struct SharedShovelParams
{
public:
	struct ShovelSurfaceDigType                                  DigSurfaceDigType;                                 // 0x0(0x10)
	byte                                                         SandSurfaceType;                                   // 0x10(0x1)
	byte                                                         WetSandSurfaceType;                                // 0x11(0x1)
	char                                                         pad0x2_BRPOP[0x2];                                 // 0x12(0x2)
	float                                                        MaxHeightDifferenceToNotBeConsideredWetSand;       // 0x14(0x4)
	struct Vector                                                DigPosOffsetFromPlayerPos;                         // 0x18(0xc)
	float                                                        SurfaceTypeRaycastLength;                          // 0x24(0x4)
	float                                                        MaxSurfaceAngleForDig;                             // 0x28(0x4)
	float                                                        InitialSphereCastRadiusForSuccessfulDig;           // 0x2c(0x4)
	byte                                                         ItemProxyCollisionChannel;                         // 0x30(0x1)
	char                                                         pad0x3_2UOYN[0x3];                                 // 0x31(0x3)
	float                                                        SphereRadiusForItemProxySweep;                     // 0x34(0x4)
	float                                                        RequiredObstacleFreeRadiusForSuccessfulDig;        // 0x38(0x4)
	float                                                        ObstacleCheckStartOffsetZFromSphereTestPos;        // 0x3c(0x4)
	int                                                          NumSamplesForBlockingSurfacesTest;                 // 0x40(0x4)
	float                                                        MaxWaterDepthToStartSuccessfulDig;                 // 0x44(0x4)
	byte                                                         HitTestTraceChannel;                               // 0x48(0x1)
	char                                                         pad0x3_PDDII[0x3];                                 // 0x49(0x3)
	float                                                        MinPlanarTestRadius;                               // 0x4c(0x4)
	int                                                          NumSamplesForPlanarityTest;                        // 0x50(0x4)
	float                                                        MaxBumpinessForPlanarityTestInCm;                  // 0x54(0x4)
	float                                                        AssumedPlayerWaistHeight;                          // 0x58(0x4)
	bool                                                         bDrawDebug;                                        // 0x5c(0x1)
	char                                                         pad0x3_0PCMY[0x3];                                 // 0x5d(0x3)
};


// Size 0x10
struct ShovelSurfaceDigType
{
public:
	TArray<struct SurfaceDigType>                                SurfaceDigType;                                    // 0x0(0x10)
};


// Size 0x2
struct SurfaceDigType
{
public:
	byte                                                         SurfaceType;                                       // 0x0(0x1)
	byte                                                         DigType;                                           // 0x1(0x1)
};


// Size 0x70
struct CrewServiceParams
{
public:
	float                                                        MinSafeDistanceToShip;                             // 0x0(0x4)
	float                                                        SpawnDistAroundSunkenShip;                         // 0x4(0x4)
	TArray<Int VotesRequiredForSendToBrig>                       VotesRequiredForSendToBrig;                        // 0x8(0x10)
	TArray<Int VotesRequiredForReleaseFromBrig>                  VotesRequiredForReleaseFromBrig;                   // 0x18(0x10)
	TArray<Int VotesRequiredForScuttleShip>                      VotesRequiredForScuttleShip;                       // 0x28(0x10)
	TArray<Int VotesRequiredForChangeMatchmakingVisibility>      VotesRequiredForChangeMatchmakingVisibility;       // 0x38(0x10)
	TArray<Int VotesRequiredForArenaRivalVote>                   VotesRequiredForArenaRivalVote;                    // 0x48(0x10)
	float                                                        BrigMinReleaseTime;                                // 0x58(0x4)
	float                                                        BrigServerTimeToRememberPastCrewMates;             // 0x5c(0x4)
	float                                                        ScuttleInitialTimeoutTime;                         // 0x60(0x4)
	float                                                        ScuttleMultipleRequestTimeoutIncrement;            // 0x64(0x4)
	float                                                        ScuttleMaxRequestTimeoutTime;                      // 0x68(0x4)
	char                                                         pad0x4_VA0DK[0x4];                                 // 0x6c(0x4)
};


// Size 0x8c
struct MermaidServiceParams
{
public:
	float                                                        LocallyActiveMermaidCheckInterval;                 // 0x0(0x4)
	float                                                        PlayerAbandonedCheckInterval;                      // 0x4(0x4)
	float                                                        MinDestroyDistancePlayerToMermaidIfPlayerNearEnemyShip; // 0x8(0x4)
	float                                                        MinDestroyDistancePlayerToMermaidIfPlayerNearIsland; // 0xc(0x4)
	float                                                        MinDestroyDistancePlayerToMermaidIfPlayerNotNearIsland; // 0x10(0x4)
	float                                                        MaxDistFromCoastForPlayerToCountAsNearIsland;      // 0x14(0x4)
	float                                                        MaxDistFromCoastForShipToCountAsNearIsland;        // 0x18(0x4)
	float                                                        MaxInvadingPlayerVelocityForPlayerToQualifyAsAbandoned; // 0x1c(0x4)
	float                                                        MinPlayerToShipDistForPlayerToQualifyAsAbandoned;  // 0x20(0x4)
	float                                                        MinPlayerToShipDistForPlayerToBeClearedOfAbandonedStatus; // 0x24(0x4)
	float                                                        MinPlayerToEnemyShipDistForPlayerToQualifyForStealthSpawns; // 0x28(0x4)
	float                                                        MinPlayerToWatercraftDistForPlayerToQualifyAsAbandoned; // 0x2c(0x4)
	float                                                        MinDistFromAnyMermaidForPlayerToBeAbandonedIfPlayerNotNearIsland; // 0x30(0x4)
	float                                                        MinDistFromAnyMermaidForPlayerToBeAbandonedIfPlayerNearIsland; // 0x34(0x4)
	int                                                          MaxNumberOfConcurrentMermaids;                     // 0x38(0x4)
	float                                                        MinLifeTimeOfMermaidBeforeCanBeCulledInPopulationCheck; // 0x3c(0x4)
	float                                                        SpawnDistAroundSaviourMermaid;                     // 0x40(0x4)
	struct MermaidServiceMermaidSpawnParams                      SpawnParams;                                       // 0x44(0x48)
};


// Size 0x48
struct MermaidServiceMermaidSpawnParams
{
public:
	float                                                        MinDistFromSpawnOrigin;                            // 0x0(0x4)
	float                                                        MinDistFromSpawnOriginForDestroyedShip;            // 0x4(0x4)
	float                                                        MaxDistFromSpawnOriginBeforeGivingUp;              // 0x8(0x4)
	float                                                        DistIncrementPerFailedSpawnCircle;                 // 0xc(0x4)
	int                                                          NumSamplesInSpawnCircle;                           // 0x10(0x4)
	float                                                        SpawnCastStartZ;                                   // 0x14(0x4)
	float                                                        MinSpawnDepth;                                     // 0x18(0x4)
	float                                                        SpawnHalfConeAngleRestrictIfSpawningForPlayer;     // 0x1c(0x4)
	byte                                                         HitTestTraceChannel;                               // 0x20(0x1)
	char                                                         pad0x3_IT23U[0x3];                                 // 0x21(0x3)
	float                                                        AssumedMermaidRadius;                              // 0x24(0x4)
	float                                                        MinDistanceOfFinalSpawnPosToAnyActiveMermaid;      // 0x28(0x4)
	float                                                        MinDistanceOfFinalSpawnPosToAnyActiveMermaidWhenNearEnemyShip; // 0x2c(0x4)
	float                                                        MinDistFromEdgeOfWorld;                            // 0x30(0x4)
	float                                                        MinAngularStepSize;                                // 0x34(0x4)
	float                                                        MaxAngularStepSize;                                // 0x38(0x4)
	float                                                        MinDistanceIncrementPerFail;                       // 0x3c(0x4)
	float                                                        MaxDistanceIncrementPerFail;                       // 0x40(0x4)
	float                                                        AdditionalDistanceFromOriginMultiplierPerMeter;    // 0x44(0x4)
};


// Size 0xc
struct PlayerModerationParams
{
public:
	float                                                        PlayerReportableDistance;                          // 0x0(0x4)
	float                                                        PlayerReportableTimeBetweenChecksInSeconds;        // 0x4(0x4)
	float                                                        RemovePlayerFromListAfterSeconds;                  // 0x8(0x4)
};


// Size 0x18
struct ToggleableAIShipServiceDataAssetFileLocation
{
public:
	struct FName                                                 ToggleName;                                        // 0x0(0x8)
	struct StringAssetReference                                  Location;                                          // 0x8(0x10)
};


// Size 0x80
struct FirstPersonAnimaticActionStateConstructionInfo
{
public:
	char                                                         pad0x30_LRNQG[0x30];                               // 0x0(0x30)
	struct FirstPersonAnimaticSettings                           FirstPersonAnimaticSettings;                       // 0x30(0x2c)
	char                                                         pad0x4_8ZQQ2[0x4];                                 // 0x5c(0x4)
	struct FirstPersonAnimaticDockInfo                           FirstPersonAnimaticDockInfo;                       // 0x60(0x20)
};


// Size 0x20
struct FirstPersonAnimaticDockInfo
{
public:
	class Actor*                                                 Dockable;                                          // 0x0(0x8)
	struct Vector                                                DockLocationOffset;                                // 0x8(0xc)
	struct Rotator                                               DockRotationOffset;                                // 0x14(0xc)
};


// Size 0x2c
struct FirstPersonAnimaticSettings
{
public:
	struct Vector                                                CutsceneFirstPersonMeshOffset;                     // 0x0(0xc)
	struct Rotator                                               CutsceneRotation;                                  // 0xc(0xc)
	float                                                        TimeBeforeFadeIn;                                  // 0x18(0x4)
	float                                                        FadeInDuration;                                    // 0x1c(0x4)
	float                                                        FirstPersonMeshBoundsScale;                        // 0x20(0x4)
	struct FName                                                 FirstPersonAnimName;                               // 0x24(0x8)
};


// Size 0x58
struct CharacterAnimaticSettings
{
public:
	char                                                         pad0x58_R85Y2[0x58];                               // 0x0(0x58)
};


// Size 0x10
struct UIReturnedToPlayerEvent
{
public:
	char                                                         pad0x10_HWQ92[0x10];                               // 0x0(0x10)
};


// Size 0x10
struct NetworkEventStruct
{
public:
	char                                                         pad0x10_0IVF2[0x10];                               // 0x0(0x10)
};


// Size 0x2
struct EventPlayerControllerKillNotification
{
public:
	bool                                                         IsHighContrast;                                    // 0x0(0x1)
	bool                                                         PlaySfx;                                           // 0x1(0x1)
};


// Size 0x1
struct EventPlayerControllerHitNotification
{
public:
	bool                                                         PlaySfx;                                           // 0x0(0x1)
};


// Size 0x1
struct EventPlayerControllerHitNotificationOld
{
public:
	bool                                                         PlaySfx;                                           // 0x0(0x1)
};


// Size 0x10
struct EventClientPlayerSpawnedBeforeGameState
{
public:
	char                                                         pad0x10_7CWX0[0x10];                               // 0x0(0x10)
};


// Size 0x10
struct EventPlayerTeleportToSafety
{
public:
	char                                                         pad0x10_NSA9G[0x10];                               // 0x0(0x10)
};


// Size 0x8
struct EventPlayerControllerUnPossess
{
public:
	class Pawn*                                                  Pawn;                                              // 0x0(0x8)
};


// Size 0x8
struct EventPlayerControllerPossess
{
public:
	class Pawn*                                                  Pawn;                                              // 0x0(0x8)
};


// Size 0x8
struct EventAthenaPlayerControllerEndingPlay
{
public:
	class AthenaPlayerController*                                Controller;                                        // 0x0(0x8)
};


// Size 0x8
struct EventAthenaPlayerControllerBegunPlay
{
public:
	class AthenaPlayerController*                                Controller;                                        // 0x0(0x8)
};


// Size 0x8
struct EventPlayerControllerDestroyedCalled
{
public:
	class AthenaPlayerController*                                Controller;                                        // 0x0(0x8)
};


// Size 0x18
struct ContestTimerData
{
public:
	float                                                        Time;                                              // 0x0(0x4)
	char                                                         pad0x4_818Z0[0x4];                                 // 0x4(0x4)
	struct FString                                               ServicesConfigRetrievalString;                     // 0x8(0x10)
};


// Size 0x1e8
struct EmergentContestVoyageRecipe
{
public:
	char                                                         pad0x170_58RZA[0x170];                             // 0x0(0x170)
	bool                                                         IsSharableVoyage;                                  // 0x170(0x1)
	char                                                         pad0x7_B0IQ8[0x7];                                 // 0x171(0x7)
	struct ContestZoneDistribution                               WeightedContestZonesToActivate;                    // 0x178(0x10)
	struct ContestTimerData                                      ContestVoyageTime;                                 // 0x188(0x18)
	struct StringClassReference                                  ScoreSystemToLoad;                                 // 0x1a0(0x10)
	struct FText                                                 ContestArenaName;                                  // 0x1b0(0x38)
};


// Size 0x170
struct VoyageRecipe
{
public:
	struct QuestDistributionParams                               QuestDistribution;                                 // 0x0(0xc8)
	struct QuestSelectionParams                                  QuestSelection;                                    // 0xc8(0x8)
	TArray<struct QuestPoolParams>                               QuestPools;                                        // 0xd0(0x10)
	bool                                                         UseFixedFinalQuestPool;                            // 0xe0(0x1)
	bool                                                         RandomiseChapters;                                 // 0xe1(0x1)
	char                                                         pad0x6_ZRKSX[0x6];                                 // 0xe2(0x6)
	struct QuestPoolParams                                       FixedFinalQuestPool;                               // 0xe8(0x30)
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x118(0x1)
	bool                                                         DoNotNotifyParticipantsOnQuestsReceived;           // 0x119(0x1)
	char                                                         pad0x6_IEAXQ[0x6];                                 // 0x11a(0x6)
	TArray<struct PlayerStat>                                    VoyageBegunStats;                                  // 0x120(0x10)
	TArray<struct PlayerStat>                                    CompletionStats;                                   // 0x130(0x10)
	TArray<struct PlayerStat>                                    DiveCompletionStats;                               // 0x140(0x10)
	TArray<struct PlayerStat>                                    ReapersMarkCompletionStats;                        // 0x150(0x10)
	TArray<struct VoyageCompletionReward>                        VoyageCompletionRewards;                           // 0x160(0x10)
};


// Size 0x30
struct QuestPoolParams
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	char                                                         pad0x4_A48K3[0x4];                                 // 0x4(0x4)
	TArray<struct WeightedQuestParams>                           Quests;                                            // 0x8(0x10)
	TArray<struct WeightedVoyageLocationParams>                  Location;                                          // 0x18(0x10)
	bool                                                         ChainLocations;                                    // 0x28(0x1)
	bool                                                         AllowRepeatIslandsWithinQuest;                     // 0x29(0x1)
	bool                                                         LimitTimesCanBeSelected;                           // 0x2a(0x1)
	char                                                         pad0x1_909R9[0x1];                                 // 0x2b(0x1)
	int                                                          MaxTimesCanBeSelected;                             // 0x2c(0x4)
};


// Size 0x18
struct WeightedVoyageLocationParams
{
public:
	byte                                                         Filter;                                            // 0x0(0x1)
	char                                                         pad0x3_2G827[0x3];                                 // 0x1(0x3)
	float                                                        Weight;                                            // 0x4(0x4)
	TArray<struct VoyageLocationParams>                          Locations;                                         // 0x8(0x10)
};


// Size 0xb0
struct VoyageLocationParams
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	char                                                         pad0x3_3ZHJQ[0x3];                                 // 0x1(0x3)
	struct VoyageLocationFixedParams                             Fixed;                                             // 0x4(0x8)
	char                                                         pad0x4_7GWQG[0x4];                                 // 0xc(0x4)
	struct VoyageLocationRandomParams                            Random;                                            // 0x10(0x48)
	struct VoyageLocationCompetitiveVoyageParams                 CompetitiveVoyage;                                 // 0x58(0x58)
};


// Size 0x58
struct VoyageLocationCompetitiveVoyageParams
{
public:
	bool                                                         Feature;                                           // 0x0(0x1)
	bool                                                         Resource;                                          // 0x1(0x1)
	bool                                                         IsTreasureHunt;                                    // 0x2(0x1)
	char                                                         pad0x1_TGSD6[0x1];                                 // 0x3(0x1)
	struct VoyageLocationDistance                                PreferredDistanceFromAverageShipLocation;          // 0x4(0x8)
	bool                                                         IsHandIn;                                          // 0xc(0x1)
	char                                                         pad0x3_Q3YH5[0x3];                                 // 0xd(0x3)
	struct VoyageLocationDistance                                PreferredDistanceForHandInIsland;                  // 0x10(0x8)
	bool                                                         AvoidUsedIslands;                                  // 0x18(0x1)
	bool                                                         AvoidWorldEventIslands;                            // 0x19(0x1)
	char                                                         pad0x2_FUDAK[0x2];                                 // 0x1a(0x2)
	float                                                        MinDistanceFromUsedVoyageIslands;                  // 0x1c(0x4)
	bool                                                         OnlyNamedIslands;                                  // 0x20(0x1)
	char                                                         pad0x7_NWI2I[0x7];                                 // 0x21(0x7)
	class VoyageLocationOnlyNamedIslandListDataAsset*            OnlyNamedIslandsListDataAsset;                     // 0x28(0x8)
	TArray<struct FName>                                         ProhibitedIslandNames;                             // 0x30(0x10)
	TArray<class Class*>                                         Seas;                                              // 0x40(0x10)
	bool                                                         AllowFallbackSelection;                            // 0x50(0x1)
	char                                                         pad0x7_R9XB1[0x7];                                 // 0x51(0x7)
};


// Size 0x8
struct VoyageLocationDistance
{
public:
	float                                                        Min;                                               // 0x0(0x4)
	float                                                        Max;                                               // 0x4(0x4)
};


// Size 0x48
struct VoyageLocationRandomParams
{
public:
	bool                                                         AddToVoyageHistory;                                // 0x0(0x1)
	bool                                                         AvoidWorldEventIslands;                            // 0x1(0x1)
	bool                                                         NPCsOnly;                                          // 0x2(0x1)
	bool                                                         CargoRunNPCsOnly;                                  // 0x3(0x1)
	bool                                                         Feature;                                           // 0x4(0x1)
	bool                                                         Resource;                                          // 0x5(0x1)
	bool                                                         Outpost;                                           // 0x6(0x1)
	bool                                                         Fort;                                              // 0x7(0x1)
	bool                                                         SeaPost;                                           // 0x8(0x1)
	bool                                                         HasWashedUpItemLocations;                          // 0x9(0x1)
	bool                                                         HasLandmarks;                                      // 0xa(0x1)
	bool                                                         OnlyNamedIslands;                                  // 0xb(0x1)
	char                                                         pad0x4_HNE85[0x4];                                 // 0xc(0x4)
	class VoyageLocationOnlyNamedIslandListDataAsset*            OnlyNamedIslandsListDataAsset;                     // 0x10(0x8)
	TArray<class Class*>                                         Seas;                                              // 0x18(0x10)
	bool                                                         WithinDistance;                                    // 0x28(0x1)
	char                                                         pad0x3_C0L91[0x3];                                 // 0x29(0x3)
	struct VoyageLocationDistance                                Distance;                                          // 0x2c(0x8)
	char                                                         pad0x14_59J13[0x14];                               // 0x34(0x14)
};


// Size 0x8
struct VoyageLocationFixedParams
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
};


// Size 0x500
struct WeightedQuestParams
{
public:
	TArray<Byte LocationFilters>                                 LocationFilters;                                   // 0x0(0x10)
	float                                                        Weight;                                            // 0x10(0x4)
	char                                                         pad0x4_3CMV1[0x4];                                 // 0x14(0x4)
	struct QuestParams                                           Params;                                            // 0x18(0x4e8)
};


// Size 0x4e8
struct QuestParams
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	char                                                         pad0x7_DI1F6[0x7];                                 // 0x1(0x7)
	struct XMarksTheSpotQuestParams                              XMarksTheSpot;                                     // 0x8(0xa0)
	struct RiddleQuestParams                                     Riddle;                                            // 0xa8(0x58)
	struct BountyQuestParams                                     Bounty;                                            // 0x100(0x1a8)
	struct MerchantQuestParams                                   Merchant;                                          // 0x2a8(0xf0)
	struct CargoRunQuestParams                                   CargoRun;                                          // 0x398(0xe0)
	struct TaleQuestParams                                       Tale;                                              // 0x478(0x68)
	struct MatchmakingQuestParams                                Matchmake;                                         // 0x4e0(0x1)
	struct StagingQuestParams                                    Staging;                                           // 0x4e1(0x1)
	struct EmergantVoyageQuestParams                             EmergantVoyage;                                    // 0x4e2(0x1)
	struct RewardQuestParams                                     Reward;                                            // 0x4e3(0x1)
	char                                                         pad0x4_C7QHQ[0x4];                                 // 0x4e4(0x4)
};


// Size 0x1
struct RewardQuestParams
{
public:
	char                                                         pad0x1_MA27V[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EmergantVoyageQuestParams
{
public:
	char                                                         pad0x1_20UMS[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct StagingQuestParams
{
public:
	char                                                         pad0x1_Y5XNE[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct MatchmakingQuestParams
{
public:
	char                                                         pad0x1_M2UAQ[0x1];                                 // 0x0(0x1)
};


// Size 0x68
struct TaleQuestParams
{
public:
	char                                                         pad0x68_3N3GT[0x68];                               // 0x0(0x68)
};


// Size 0x48
struct QuestTypeParams
{
public:
	char                                                         pad0x8_DEWEO[0x8];                                 // 0x0(0x8)
	class WeightedTreasureChestDescAsset*                        ReferencedRewards;                                 // 0x8(0x8)
	TArray<struct WeightedTreasureChestDesc>                     Rewards;                                           // 0x10(0x10)
	bool                                                         UseRewardAssetList;                                // 0x20(0x1)
	char                                                         pad0x7_XQ0CZ[0x7];                                 // 0x21(0x7)
	class WeightedItemDescSpawnDataAsset*                        RewardsAsset;                                      // 0x28(0x8)
	TArray<class WeightedItemDescSpawnDataAsset*>                RewardsAssets;                                     // 0x30(0x10)
	class UClass*                                                OverrideTreasureMapItemDesc;                       // 0x40(0x8)
};


// Size 0x18
struct WeightedTreasureChestDesc
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	struct FName                                                 Feature;                                           // 0x4(0x8)
	char                                                         pad0x4_QMRJ7[0x4];                                 // 0xc(0x4)
	class UClass*                                                Desc;                                              // 0x10(0x8)
};


// Size 0xe0
struct CargoRunQuestParams
{
public:
	char                                                         pad0x48_LD14W[0x48];                               // 0x0(0x48)
	bool                                                         IsCargoRunQuestV2;                                 // 0x48(0x1)
	char                                                         pad0x7_S9BJY[0x7];                                 // 0x49(0x7)
	struct WeightedProbabilityRange                              NumberOfRequiredItems;                             // 0x50(0x20)
	struct WeightedProbabilityRangeOfRanges                      TimeLimitInMinutes;                                // 0x70(0x30)
	class CargoRunQuestRandomRequiredItemsDataAsset*             RequiredItemsDataAsset;                            // 0xa0(0x8)
	class CargoRunQuestRandomRequiredItemsDataAsset*             GroupedRequiredItemsDataAsset;                     // 0xa8(0x8)
	struct WeightedProbabilityRange                              NumberOfGroups;                                    // 0xb0(0x20)
	TArray<struct CargoRunQuestCategoryGroupBounds>              CategoryGroupBounds;                               // 0xd0(0x10)
};


// Size 0x1c
struct CargoRunQuestCategoryGroupBounds
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	int                                                          MinNum;                                            // 0xc(0x4)
	int                                                          MaxNum;                                            // 0x10(0x4)
	int                                                          MinDifferent;                                      // 0x14(0x4)
	int                                                          MaxDifferent;                                      // 0x18(0x4)
};


// Size 0xf0
struct MerchantQuestParams
{
public:
	char                                                         pad0x48_Y29L5[0x48];                               // 0x0(0x48)
	bool                                                         IsMerchantQuestV2;                                 // 0x48(0x1)
	char                                                         pad0x7_N7I0T[0x7];                                 // 0x49(0x7)
	TArray<Byte IslandTypes>                                     IslandTypes;                                       // 0x50(0x10)
	struct WeightedProbabilityRange                              NumberOfRequiredItems;                             // 0x60(0x20)
	struct WeightedProbabilityRangeOfRanges                      TimeLimitInMinutes;                                // 0x80(0x30)
	class MerchantQuestRequiredItemsDataAsset*                   RequiredItemsDataAsset;                            // 0xb0(0x8)
	class MerchantQuestRandomRequiredItemsDataAsset*             RandomRequiredItemsDataAsset;                      // 0xb8(0x8)
	struct WeightedProbabilityRange                              NumberOfGroups;                                    // 0xc0(0x20)
	TArray<struct MerchantQuestCategoryGroupBounds>              CategoryGroupBounds;                               // 0xe0(0x10)
};


// Size 0x1c
struct MerchantQuestCategoryGroupBounds
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	int                                                          MinNum;                                            // 0xc(0x4)
	int                                                          MaxNum;                                            // 0x10(0x4)
	int                                                          MinDifferent;                                      // 0x14(0x4)
	int                                                          MaxDifferent;                                      // 0x18(0x4)
};


// Size 0x1a8
struct BountyQuestParams
{
public:
	char                                                         pad0x48_UVK8X[0x48];                               // 0x0(0x48)
	bool                                                         ConvertFinalCaptainToSkeletonLord;                 // 0x48(0x1)
	char                                                         pad0x7_93ASQ[0x7];                                 // 0x49(0x7)
	class BountyQuestSkeletonLordInfoData*                       SkeletonLordInfoData;                              // 0x50(0x8)
	class AIBountySpawner*                                       Spawner;                                           // 0x58(0x8)
	struct BountyQuestRandomSpawnGeneratorParams                 BountyQuestRandomSpawnGeneratorParams;             // 0x60(0x148)
};


// Size 0x148
struct BountyQuestRandomSpawnGeneratorParams
{
public:
	struct WeightedProbabilityRange                              NumberOfWaves;                                     // 0x0(0x20)
	struct WeightedProbabilityRange                              NumberOfWaveGroups;                                // 0x20(0x20)
	int                                                          MinNumberOfAIPerWave;                              // 0x40(0x4)
	int                                                          MaxNumberOfAIPerWave;                              // 0x44(0x4)
	TArray<Int AdditionalAIPerPlayer>                            AdditionalAIPerPlayer;                             // 0x48(0x10)
	int                                                          MinFormsPerEncounter;                              // 0x58(0x4)
	int                                                          MaxFormsPerEncounter;                              // 0x5c(0x4)
	bool                                                         AllowMultipleFormsPerWave;                         // 0x60(0x1)
	char                                                         pad0x7_NN3OX[0x7];                                 // 0x61(0x7)
	struct WeightedProbabilityRange                              FormsPerWave;                                      // 0x68(0x20)
	int                                                          MinVarietiesPerEncounter;                          // 0x88(0x4)
	int                                                          MaxVarietiesPerEncounter;                          // 0x8c(0x4)
	float                                                        MinTimeBetweenSpawns;                              // 0x90(0x4)
	float                                                        MaxTimeBetweenSpawns;                              // 0x94(0x4)
	float                                                        MinTimeBetweenWaves;                               // 0x98(0x4)
	float                                                        MaxTimeBetweenWaves;                               // 0x9c(0x4)
	struct WeightedProbabilityRange                              WavesPerRelocate;                                  // 0xa0(0x20)
	struct WeightedProbabilityRange                              WaveSplitChance;                                   // 0xc0(0x20)
	TArray<Float WaveSuicideTime>                                WaveSuicideTime;                                   // 0xe0(0x10)
	float                                                        WaveSuicideMinDist;                                // 0xf0(0x4)
	char                                                         pad0x4_M548Q[0x4];                                 // 0xf4(0x4)
	class AIEncounterGenerationRecipeRankOrderList*              Recipes;                                           // 0xf8(0x8)
	struct WeightedProbabilityRange                              NumberOfTargetsTotal;                              // 0x100(0x20)
	struct WeightedProbabilityRange                              NumberOfTargetsWhichAreCaptains;                   // 0x120(0x20)
	float                                                        ChanceOfAllTargetsBeingOnTheLastWave;              // 0x140(0x4)
	float                                                        ChanceOfFemale;                                    // 0x144(0x4)
};


// Size 0x58
struct RiddleQuestParams
{
public:
	char                                                         pad0x50_1E5X4[0x50];                               // 0x0(0x50)
	class BoobyTrapSpawnerDataAsset*                             BoobyTrapSpawnerDataAsset;                         // 0x50(0x8)
};


// Size 0xa0
struct XMarksTheSpotQuestParams
{
public:
	char                                                         pad0x48_QM6RG[0x48];                               // 0x0(0x48)
	struct WeightedProbabilityRange                              NumTreasureLocations;                              // 0x48(0x20)
	class BoobyTrapSpawnerDataAsset*                             BoobyTrapSpawnerDataAsset;                         // 0x68(0x8)
	TArray<class BoobyTrapSpawnerDataAsset*>                     UniqueTreasureLocationBoobyTraps;                  // 0x70(0x10)
	TArray<class WeightedTreasureChestDescAsset*>                UniqueTreasureLocationRewards;                     // 0x80(0x10)
	TArray<class WeightedItemDescSpawnDataAsset*>                UniqueTreasureLocationRewardsAssets;               // 0x90(0x10)
};


// Size 0x8
struct QuestSelectionParams
{
public:
	byte                                                         PoolSelectionMethod;                               // 0x0(0x1)
	byte                                                         LocationSelectionMethod;                           // 0x1(0x1)
	bool                                                         UseChapterBasedVoyageHistory;                      // 0x2(0x1)
	char                                                         pad0x1_IQVAF[0x1];                                 // 0x3(0x1)
	int                                                          MaxNumberOfPoolRetries;                            // 0x4(0x4)
};


// Size 0xc8
struct QuestDistributionParams
{
public:
	byte                                                         Method;                                            // 0x0(0x1)
	char                                                         pad0x7_7NS9H[0x7];                                 // 0x1(0x7)
	struct QuestDistributionAllAtOnceParams                      AllAtOnce;                                         // 0x8(0x40)
	struct QuestDistributionPerChapterParams                     PerChapter;                                        // 0x48(0x68)
	struct QuestDistributionFixedChaptersParams                  FixedChapters;                                     // 0xb0(0x18)
};


// Size 0x18
struct QuestDistributionFixedChaptersParams
{
public:
	bool                                                         UseProceduralQuestRewards;                         // 0x0(0x1)
	char                                                         pad0x3_NE2RG[0x3];                                 // 0x1(0x3)
	int                                                          NumChapters;                                       // 0x4(0x4)
	TArray<struct ChapterDataEntry>                              Chapters;                                          // 0x8(0x10)
};


// Size 0x10
struct ChapterDataEntry
{
public:
	int                                                          NumQuests;                                         // 0x0(0x4)
	char                                                         pad0x4_SG8BX[0x4];                                 // 0x4(0x4)
	class VoyageRewardDataAsset*                                 PerChapterRewardAsset;                             // 0x8(0x8)
};


// Size 0x68
struct QuestDistributionPerChapterParams
{
public:
	int                                                          MinNumChapters;                                    // 0x0(0x4)
	char                                                         pad0x4_BSES7[0x4];                                 // 0x4(0x4)
	struct WeightedProbabilityRange                              NumQuests;                                         // 0x8(0x20)
	struct WeightedProbabilityRange                              NumQuestsInFirstChapter;                           // 0x28(0x20)
	struct WeightedProbabilityRange                              NumQuestsInOtherChapters;                          // 0x48(0x20)
};


// Size 0x40
struct QuestDistributionAllAtOnceParams
{
public:
	struct WeightedProbabilityRange                              NumQuests;                                         // 0x0(0x20)
	struct WeightedProbabilityRange                              QuestsPerChapter;                                  // 0x20(0x20)
};


// Size 0x10
struct ContestZoneDistribution
{
public:
	TArray<struct WeightedContestZone>                           WeightedContestZones;                              // 0x0(0x10)
};


// Size 0xc
struct WeightedContestZone
{
public:
	struct FName                                                 ContestZoneName;                                   // 0x0(0x8)
	int                                                          Weight;                                            // 0x8(0x4)
};


// Size 0x10
struct ContestIslandArchetype
{
public:
	TArray<struct WeightedContestIslandData>                     AvailableIslands;                                  // 0x0(0x10)
};


// Size 0x10
struct WeightedContestIslandData
{
public:
	struct ContestVoyageIslandData                               IslandData;                                        // 0x0(0xc)
	int                                                          WeightedChance;                                    // 0xc(0x4)
};


// Size 0xc
struct ContestVoyageIslandData
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	int                                                          MaxItemCountForIsland;                             // 0x8(0x4)
};


// Size 0x58
struct EventCharacterHitReaction
{
public:
	struct ImpactDamageEvent                                     ImpactDamage;                                      // 0x0(0x58)
};


// Size 0x1
struct EventPlayerCharacterPuzzleVaultIncorrect
{
public:
	char                                                         pad0x1_K8W4N[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventPlayerCharacterPuzzleVaultComplete
{
public:
	char                                                         pad0x1_GAXL5[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventPlayerCharacterInPuzzleVaultChanged
{
public:
	bool                                                         IsInPuzzleVault;                                   // 0x0(0x1)
	char                                                         pad0x3_HCDD6[0x3];                                 // 0x1(0x3)
	float                                                        CurrentWaterLevel;                                 // 0x4(0x4)
};


// Size 0xc
struct EventItemUseAINoiseEvent
{
public:
	float                                                        NoiseRange;                                        // 0x0(0x4)
	struct FName                                                 NoiseTag;                                          // 0x4(0x8)
};


// Size 0x10
struct EventAnimationShopInteraction
{
public:
	bool                                                         Active;                                            // 0x0(0x1)
	byte                                                         Type;                                              // 0x1(0x1)
	char                                                         pad0x6_3TICT[0x6];                                 // 0x2(0x6)
	class Actor*                                                 Interactor;                                        // 0x8(0x8)
};


// Size 0x1
struct EventFaceTargetEnabled
{
public:
	bool                                                         Enabled;                                           // 0x0(0x1)
};


// Size 0x1
struct EventRemoteCharacterStartedDig
{
public:
	char                                                         pad0x1_I2J50[0x1];                                 // 0x0(0x1)
};


// Size 0xc
struct EventRequestVomit
{
public:
	char                                                         pad0xc_QEBFG[0xc];                                 // 0x0(0xc)
};


// Size 0x1
struct EventIsDrunk
{
public:
	bool                                                         bIsDrunk;                                          // 0x0(0x1)
};


// Size 0x8
struct EventFallWithDamageLegNotBroken
{
public:
	struct FName                                                 RumbleTag;                                         // 0x0(0x8)
};


// Size 0x1
struct EventHealedLeg
{
public:
	char                                                         pad0x1_XF075[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventBrokeLeg
{
public:
	struct FName                                                 RumbleTag;                                         // 0x0(0x8)
};


// Size 0x1
struct EventPlayerGhostShipWhiteOutStarted
{
public:
	char                                                         pad0x1_NZ6T5[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventCharacterRestarted
{
public:
	char                                                         pad0x1_WBKPC[0x1];                                 // 0x0(0x1)
};


// Size 0x84
struct EventCharacterLanded
{
public:
	struct HitResult                                             HitResult;                                         // 0x0(0x80)
	float                                                        VerticalSpeed;                                     // 0x80(0x4)
};


// Size 0x1
struct EventCharacterJumped
{
public:
	char                                                         pad0x1_563N5[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventCharacterDestroyed
{
public:
	char                                                         pad0x1_LMEP0[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventCharacterInteraction
{
public:
	class Object*                                                Interactable;                                      // 0x0(0x8)
};


// Size 0x1c
struct ClientTelemetryConfigurationSettings
{
public:
	float                                                        HighMemoryPerformanceHeartbeatIntervalSeconds;     // 0x0(0x4)
	float                                                        HighMemoryThresholdDurango;                        // 0x4(0x4)
	float                                                        HighMemoryThresholdEdmonton;                       // 0x8(0x4)
	float                                                        HighMemoryThresholdScorpio;                        // 0xc(0x4)
	float                                                        HighMemoryThresholdLockhart;                       // 0x10(0x4)
	float                                                        HighMemoryThresholdAnaconda;                       // 0x14(0x4)
	float                                                        PlayerAggregatePositionInterval;                   // 0x18(0x4)
};


// Size 0x10
struct ServerMigrationStatusTelemetryFragment
{
public:
	TArray<struct CrewMigrationStatusInfo>                       CrewsMigrationStatusInfo;                          // 0x0(0x10)
};


// Size 0x28
struct CrewMigrationStatusInfo
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	TArray<Str CrewMigrationStatusLog>                           CrewMigrationStatusLog;                            // 0x10(0x10)
	bool                                                         CrewMigrationStatusState;                          // 0x20(0x1)
	char                                                         pad0x7_C8920[0x7];                                 // 0x21(0x7)
};


// Size 0x4
struct UISlatePerformanceTelemetryFragment
{
public:
	char                                                         pad0x4_KMUY3[0x4];                                 // 0x0(0x4)
};


// Size 0x10
struct ResolutionTelemetryFragment
{
public:
	char                                                         pad0x8_73XN1[0x8];                                 // 0x0(0x8)
	float                                                        ScreenPercentage;                                  // 0x8(0x4)
	bool                                                         DynamicResolution;                                 // 0xc(0x1)
	char                                                         pad0x3_ZGO78[0x3];                                 // 0xd(0x3)
};


// Size 0x18
struct ShippingLastFramePerformanceStatsTelemetryFragment
{
public:
	struct JsonObjectWrapper                                     Json;                                              // 0x0(0x18)
};


// Size 0x18
struct ShippingStatsTelemetryFragment
{
public:
	struct JsonObjectWrapper                                     Json;                                              // 0x0(0x18)
};


// Size 0xf0
struct AudioDataTelemetryFragment
{
public:
	char                                                         pad0x30_U0JK4[0x30];                               // 0x0(0x30)
	TArray<UInt32 WwiseStateGroups>                              WwiseStateGroups;                                  // 0x30(0x10)
	TArray<UInt32 WwiseStateValues>                              WwiseStateValues;                                  // 0x40(0x10)
	TArray<UInt32 PeakProxyCountsPools>                          PeakProxyCountsPools;                              // 0x50(0x10)
	TArray<UInt32 PeakProxyCounts>                               PeakProxyCounts;                                   // 0x60(0x10)
	TArray<UInt32 StreamFindFailedIDs>                           StreamFindFailedIDs;                               // 0x70(0x10)
	TArray<UInt32 StreamOpenFailedIDs>                           StreamOpenFailedIDs;                               // 0x80(0x10)
	TArray<UInt32 StreamReadFailedIDs>                           StreamReadFailedIDs;                               // 0x90(0x10)
	TArray<struct SoundBankFailureTelemetryEntry>                FailedToLoadBankIDs;                               // 0xa0(0x10)
	float                                                        AverageIOBytesPerSecondRead;                       // 0xbc(0x4)
	struct FrameDurationDataTelemetryFragment                    FrameKickoffTimesInMs;                             // 0xc0(0x10)
	struct FrameDurationDataTelemetryFragment                    UpdateDurationsInMs;                               // 0xd0(0x10)
	struct FrameDurationDataTelemetryFragment                    TritonQueryAcousticsTimesInMs;                     // 0xe0(0x10)
};


// Size 0x10
struct FrameDurationDataTelemetryFragment
{
public:
	float                                                        Min;                                               // 0x0(0x4)
	float                                                        Max;                                               // 0x4(0x4)
	float                                                        Average;                                           // 0x8(0x4)
	float                                                        StdDeviation;                                      // 0xc(0x4)
};


// Size 0x8
struct SoundBankFailureTelemetryEntry
{
public:
	char                                                         pad0x8_K2ES8[0x8];                                 // 0x0(0x8)
};


// Size 0x20
struct PlayFabPartyTelemetryFragment
{
public:
	char                                                         pad0x10_7RGW0[0x10];                               // 0x0(0x10)
	TArray<struct PlayFabPartyNetworkStats>                      PerNetworkStats;                                   // 0x10(0x10)
};


// Size 0x28
struct PlayFabPartyNetworkStats
{
public:
	char                                                         pad0x28_MPLJ5[0x28];                               // 0x0(0x28)
};


// Size 0x18
struct FrameTypeTelemetryFragment
{
public:
	char                                                         pad0x18_FO26A[0x18];                               // 0x0(0x18)
};


// Size 0x8
struct RefreshRateTelemetryFragment
{
public:
	bool                                                         Supports120Hz;                                     // 0x0(0x1)
	char                                                         pad0x3_ORJ6H[0x3];                                 // 0x1(0x3)
	char                                                         pad0x4_C9V76[0x4];                                 // 0x4(0x4)
};


// Size 0x1
struct HDRTelemetryFragment
{
public:
	bool                                                         HDR;                                               // 0x0(0x1)
};


// Size 0x10
struct UIFrameDurationDataTelemetryFragment
{
public:
	float                                                        Min;                                               // 0x0(0x4)
	float                                                        Max;                                               // 0x4(0x4)
	float                                                        Average;                                           // 0x8(0x4)
	float                                                        StdDeviation;                                      // 0xc(0x4)
};


// Size 0x18
struct GarbageCollectionFrametimeTelemetryFragment
{
public:
	TArray<Float GCFrametimesMs>                                 GCFrametimesMs;                                    // 0x0(0x10)
	float                                                        MaxGCFrametimeMs;                                  // 0x10(0x4)
	char                                                         pad0x4_TXF7X[0x4];                                 // 0x14(0x4)
};


// Size 0x20
struct HitchDataTelemetryFragment
{
public:
	char                                                         pad0x20_316GA[0x20];                               // 0x0(0x20)
};


// Size 0xc
struct StutterDataTelemetryFragment
{
public:
	float                                                        StutterFramePercentage;                            // 0x0(0x4)
	float                                                        StutterFrameDeltaMax;                              // 0x4(0x4)
	float                                                        StutterFrameDeltaAverage;                          // 0x8(0x4)
};


// Size 0x20
struct ServerNetworkDataTelemetryFragment
{
public:
	struct PacketDiscardStats                                    DiscardedPackets;                                  // 0x0(0x20)
};


// Size 0x28
struct NetworkDataTelemetryFragmentInput
{
public:
	char                                                         pad0x28_80W11[0x28];                               // 0x0(0x28)
};


// Size 0x1
struct TelemetryFragmentInput
{
public:
	char                                                         pad0x1_JIRIP[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct NetworkDataTelemetryFragment
{
public:
	char                                                         pad0x28_7EORM[0x28];                               // 0x0(0x28)
};


// Size 0xaf0
struct RenderingTelemetryFragment
{
public:
	struct TextureGroupMemorySummary                             StreamedTexturePoolGroupsMemorySummary;            // 0x0(0x28)
	char                                                         pad0x550_0HEAD[0x550];                             // 0x28(0x550)
	struct TextureGroupMemorySummary                             UnstreamedTexturePoolGroupsMemorySummary;          // 0x578(0x28)
	char                                                         pad0x550_AYJ4S[0x550];                             // 0x5a0(0x550)
};


// Size 0x28
struct TextureGroupMemorySummary
{
public:
	struct FString                                               TextureGroupName;                                  // 0x0(0x10)
	char                                                         pad0x18_H4DJ8[0x18];                               // 0x10(0x18)
};


// Size 0x18
struct PerformanceTelemetryFragmentInput
{
public:
	char                                                         pad0x18_M5TUQ[0x18];                               // 0x0(0x18)
};


// Size 0x180
struct MemoryDataTelemetryFragment
{
public:
	char                                                         pad0xe0_XN4C3[0xe0];                               // 0x0(0xe0)
	TArray<struct MemoryTableData>                               TableInfo;                                         // 0xe0(0x10)
	int                                                          HighMemoryThresholdPercentage;                     // 0x128(0x4)
	char                                                         pad0x4_UYDPB[0x4];                                 // 0x12c(0x4)
	char                                                         pad0x50_HICQW[0x50];                               // 0x130(0x50)
};


// Size 0x18
struct MemoryTableData
{
public:
	char                                                         pad0x18_YP46K[0x18];                               // 0x0(0x18)
};


// Size 0x50
struct InventoryMemory
{
public:
	char                                                         pad0x50_MB4CP[0x50];                               // 0x0(0x50)
};


// Size 0x10
struct IslandEventIcons
{
public:
	class Texture*                                               ActiveEventIcon;                                   // 0x0(0x8)
	class Texture*                                               InactiveEventIcon;                                 // 0x8(0x8)
};


// Size 0x58
struct CanvasWorldMapShipLocation
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	class UClass*                                                ShipSize;                                          // 0x10(0x8)
	struct Vector2D                                              Location;                                          // 0x18(0x8)
	float                                                        Rotation;                                          // 0x20(0x4)
	struct CanvasLerpData                                        LerpData;                                          // 0x24(0x10)
	bool                                                         IsInAlliance;                                      // 0x34(0x1)
	bool                                                         IsInFaction;                                       // 0x35(0x1)
	bool                                                         IsFactionMaxRank;                                  // 0x36(0x1)
	bool                                                         IsInvadingShip;                                    // 0x37(0x1)
	struct FName                                                 CrewFactionName;                                   // 0x38(0x8)
	byte                                                         ReapersMarkLevel;                                  // 0x40(0x1)
	byte                                                         EmissaryLevel;                                     // 0x41(0x1)
	bool                                                         IsMaxGradedGuildShip;                              // 0x42(0x1)
	char                                                         pad0x5_ULHX1[0x5];                                 // 0x43(0x5)
	class Texture*                                               CrewLiveryOverlayIcon;                             // 0x48(0x8)
	bool                                                         IsReapersTrackedShip;                              // 0x50(0x1)
	bool                                                         IsInTunnel;                                        // 0x51(0x1)
	char                                                         pad0x6_3TM3G[0x6];                                 // 0x52(0x6)
};


// Size 0x10
struct CanvasLerpData
{
public:
	float                                                        LerpTime;                                          // 0x0(0x4)
	float                                                        EaseExponent;                                      // 0x4(0x4)
	char                                                         pad0x8_GZRNC[0x8];                                 // 0x8(0x8)
};


// Size 0x20
struct CanvasWorldMapGeneric
{
public:
	class Actor*                                                 MarkerActor;                                       // 0x0(0x8)
	class Texture*                                               Icon;                                              // 0x8(0x8)
	struct Vector                                                Location;                                          // 0x10(0xc)
	bool                                                         HasLocationSet;                                    // 0x1c(0x1)
	char                                                         pad0x3_OTGTQ[0x3];                                 // 0x1d(0x3)
};


// Size 0x18
struct CanvasWorldMapReaperTrackedBootItemIcon
{
public:
	byte                                                         BootyItemType;                                     // 0x0(0x1)
	char                                                         pad0x7_A1FRG[0x7];                                 // 0x1(0x7)
	class Texture*                                               Texture;                                           // 0x8(0x8)
	char                                                         pad0x8_GRSEW[0x8];                                 // 0x10(0x8)
};


// Size 0x18
struct CanvasWorldMapShipIcons
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	class Texture*                                               ShipTexture;                                       // 0x8(0x8)
	class Texture*                                               OffscreenTexture;                                  // 0x10(0x8)
};


// Size 0x20
struct CanvasWorldMapWorldData
{
public:
	struct Vector2D                                              Min;                                               // 0x0(0x8)
	struct Vector2D                                              Max;                                               // 0x8(0x8)
	TArray<struct CanvasWorldMapIslandData>                      Islands;                                           // 0x10(0x10)
};


// Size 0x60
struct CanvasWorldMapIslandData
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               IslandTex;                                         // 0x38(0x8)
	struct Box2D                                                 Bounds;                                            // 0x40(0x14)
	float                                                        Rotation;                                          // 0x54(0x4)
	float                                                        LabelOffset;                                       // 0x58(0x4)
	char                                                         pad0x4_M4M4Z[0x4];                                 // 0x5c(0x4)
};


// Size 0x30
struct MapTableCanvasDetails
{
public:
	TArray<struct CanvasWorldMapBackgroundItems>                 BackgroundDetails;                                 // 0x0(0x10)
	TArray<struct CanvasWorldMapForegroundItems>                 ForegroundDetails;                                 // 0x10(0x10)
	TArray<struct CanvasWorldMapSeaAreaItems>                    SeaDetails;                                        // 0x20(0x10)
};


// Size 0x50
struct CanvasWorldMapSeaAreaItems
{
public:
	class Texture*                                               Texture;                                           // 0x0(0x8)
	struct FText                                                 Name;                                              // 0x8(0x38)
	struct Vector2D                                              Location;                                          // 0x40(0x8)
	struct FName                                                 FeatureName;                                       // 0x48(0x8)
};


// Size 0x20
struct CanvasWorldMapForegroundItems
{
public:
	class Texture*                                               Texture;                                           // 0x0(0x8)
	struct FName                                                 FeatureToggle;                                     // 0x8(0x8)
	TArray<struct Vector2D>                                      Locations;                                         // 0x10(0x10)
};


// Size 0x20
struct CanvasWorldMapBackgroundItems
{
public:
	class Texture*                                               Texture;                                           // 0x0(0x8)
	struct Vector2D                                              WorldSize;                                         // 0x8(0x8)
	TArray<struct Vector2D>                                      Locations;                                         // 0x10(0x10)
};


// Size 0x118
struct VoyageProposalDescViewModel
{
public:
	char                                                         pad0x100_M42AI[0x100];                             // 0x0(0x100)
	struct FString                                               ProposalDesc;                                      // 0x100(0x10)
	byte                                                         State;                                             // 0x110(0x1)
	char                                                         pad0x3_BE7RX[0x3];                                 // 0x111(0x3)
	int                                                          VoyageIndex;                                       // 0x114(0x4)
};


// Size 0x100
struct VoyageDisplayInformation
{
public:
	struct FText                                                 Title;                                             // 0x0(0x38)
	struct FText                                                 Description;                                       // 0x38(0x38)
	struct FText                                                 StateDescription;                                  // 0x70(0x38)
	struct FString                                               KeyArtUrl;                                         // 0xa8(0x10)
	struct FString                                               IconUrl;                                           // 0xb8(0x10)
	int                                                          RumouredHaulMin;                                   // 0xc8(0x4)
	bool                                                         Locked;                                            // 0xcc(0x1)
	char                                                         pad0x3_08SV4[0x3];                                 // 0xcd(0x3)
	struct FString                                               Category;                                          // 0xd0(0x10)
	struct FString                                               PreviewImageUrl;                                   // 0xe0(0x10)
	struct FString                                               ThumbnailImageUrl;                                 // 0xf0(0x10)
};


// Size 0x1c
struct EventUpdateIslandEventToggle
{
public:
	struct Guid                                                  EventID;                                           // 0x0(0x10)
	struct Vector2D                                              EventScreenPos;                                    // 0x10(0x8)
	bool                                                         IsInverted;                                        // 0x18(0x1)
	char                                                         pad0x3_YUIZH[0x3];                                 // 0x19(0x3)
};


// Size 0x1
struct EventRefreshIslandEventData
{
public:
	char                                                         pad0x1_OYW3G[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventUpdateIslandEventHighlight
{
public:
	bool                                                         IsHighlightActive;                                 // 0x0(0x1)
};


// Size 0x110
struct IslandEventTooltipData
{
public:
	struct VoyageDisplayInformation                              DisplayInfo;                                       // 0x0(0x100)
	struct Guid                                                  EventID;                                           // 0x100(0x10)
};


// Size 0x58
struct IslandEventIconData
{
public:
	struct IslandEventData                                       EventData;                                         // 0x0(0x38)
	struct IslandEventIcons                                      IslandIcons;                                       // 0x38(0x10)
	struct IslandEventIcons                                      HeaderIcons;                                       // 0x48(0x10)
};


// Size 0x38
struct IslandEventData
{
public:
	class UClass*                                                EventType;                                         // 0x0(0x8)
	struct StringAssetReference                                  VoyageDescAssetString;                             // 0x8(0x10)
	struct Vector2D                                              WorldPos;                                          // 0x18(0x8)
	bool                                                         IsActive;                                          // 0x20(0x1)
	char                                                         pad0x3_4U1QA[0x3];                                 // 0x21(0x3)
	struct Guid                                                  EventID;                                           // 0x24(0x10)
	char                                                         pad0x4_9CS3F[0x4];                                 // 0x34(0x4)
};


// Size 0x1c
struct IslandNameAndBounds
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	struct Box2D                                                 IslandBounds;                                      // 0x8(0x14)
};


// Size 0x1
struct EventIslandEventDataChanged
{
public:
	char                                                         pad0x1_GP8M2[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct WorldSafeZone
{
public:
	char                                                         pad0x18_HDP95[0x18];                               // 0x0(0x18)
};


// Size 0x18
struct AthenaWorldSettingsGameEventSchedulerSettingsConfiguration
{
public:
	struct FName                                                 FeatureFlag;                                       // 0x0(0x8)
	byte                                                         RequiredPlayMode;                                  // 0x8(0x1)
	char                                                         pad0x7_XQ3FR[0x7];                                 // 0x9(0x7)
	class GameEventSchedulerSettingsAsset*                       EventSchedulerSettings;                            // 0x10(0x8)
};


// Size 0x18
struct HoopData
{
public:
	float                                                        HoopRadius;                                        // 0x0(0x4)
	char                                                         pad0x4_EP17R[0x4];                                 // 0x4(0x4)
	TArray<struct WwiseEventsIcon>                               EventIcons;                                        // 0x8(0x10)
};


// Size 0x18
struct WwiseEventsIcon
{
public:
	class Texture2D*                                             IconTexture;                                       // 0x0(0x8)
	TArray<class WwiseEvent*>                                    WwiseEvents;                                       // 0x8(0x10)
};


// Size 0x20
struct ActiveHudIconData
{
public:
	char                                                         pad0x18_DTDVZ[0x18];                               // 0x0(0x18)
	class Texture2D*                                             IconTexture;                                       // 0x18(0x8)
};


// Size 0x38
struct DeferredBakedDecal
{
public:
	char                                                         pad0x38_W3X9K[0x38];                               // 0x0(0x38)
};


// Size 0xc0
struct MerchantCrateItemInfoFaunaBreedRarityEntry
{
public:
	class UClass*                                                FaunaBreed;                                        // 0x0(0x8)
	struct FName                                                 Rarity;                                            // 0x8(0x8)
	struct BootyItemStats                                        HandInStats;                                       // 0x10(0x90)
	struct CompanyBootyStatList                                  CompanySpecificStats;                              // 0xa0(0x10)
	TArray<struct CompanySpecificBootyReward>                    CompanySpecificHandInRewardIds;                    // 0xb0(0x10)
};


// Size 0x18
struct CompanySpecificBootyReward
{
public:
	class UClass*                                                CompanyId;                                         // 0x0(0x8)
	struct RewardId                                              RewardId;                                          // 0x8(0x8)
	bool                                                         RequirePirateLegend;                               // 0x10(0x1)
	char                                                         pad0x7_085DF[0x7];                                 // 0x11(0x7)
};


// Size 0x10
struct CompanyBootyStatList
{
public:
	TArray<struct CompanyBootyStats>                             CompanyList;                                       // 0x0(0x10)
};


// Size 0x98
struct CompanyBootyStats
{
public:
	class UClass*                                                CompanyId;                                         // 0x0(0x8)
	struct BootyItemStats                                        Stats;                                             // 0x8(0x90)
};


// Size 0x90
struct BootyItemStats
{
public:
	TArray<struct PlayerStat>                                    HandInPlayerStats;                                 // 0x0(0x10)
	TArray<struct PlayerStat>                                    HandInStolenPlayerStats;                           // 0x10(0x10)
	TArray<struct PlayerStat>                                    HandInAsPirateLegendPlayerStats;                   // 0x20(0x10)
	TArray<struct PlayerStat>                                    HandInOnSchedulePlayerStats;                       // 0x30(0x10)
	TArray<struct PlayerStat>                                    HandInAsPirateLegendOnSchedulePlayerStats;         // 0x40(0x10)
	TArray<struct EmissaryBootyItemStats>                        HandInAsEmissaryPlayerStats;                       // 0x50(0x10)
	TArray<struct EmissaryBootyItemStats>                        HandInAsMaxLevelEmissaryPlayerStats;               // 0x60(0x10)
	TArray<struct EmissaryBootyItemStats>                        HandInStolenAsEmissaryPlayerStats;                 // 0x70(0x10)
	TArray<struct EmissaryBootyItemStats>                        HandInStolenAsMaxLevelEmissaryPlayerStats;         // 0x80(0x10)
};


// Size 0x18
struct EmissaryBootyItemStats
{
public:
	class UClass*                                                EmissaryCompany;                                   // 0x0(0x8)
	TArray<struct PlayerStat>                                    Stats;                                             // 0x8(0x10)
};


// Size 0x20
struct MerchantCrateSfx
{
public:
	class WwiseEvent*                                            EquipSfx;                                          // 0x0(0x8)
	class WwiseEvent*                                            UnequipSfx;                                        // 0x8(0x8)
	class WwiseEvent*                                            WielderLandedJumpSfx;                              // 0x10(0x8)
	class WwiseEvent*                                            WielderFootstepLayerOneshot;                       // 0x18(0x8)
};


// Size 0x18
struct BeaconLitWithFlameOfFateStatsToFire
{
public:
	byte                                                         FlameOfFateType;                                   // 0x0(0x1)
	char                                                         pad0x7_QLE38[0x7];                                 // 0x1(0x7)
	TArray<struct PlayerStat>                                    StatsToFire;                                       // 0x8(0x10)
};


// Size 0x2
struct BeaconData
{
public:
	bool                                                         LightIsOn_Server;                                  // 0x0(0x1)
	byte                                                         FlameOfFateType;                                   // 0x1(0x1)
};


// Size 0x1
struct BeaconExtinguishedEvent
{
public:
	char                                                         pad0x1_MC3OT[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct BeaconLitEvent
{
public:
	char                                                         pad0x1_D33IZ[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct DeactivateHatchEvent
{
public:
	struct FName                                                 EventID;                                           // 0x0(0x8)
};


// Size 0xc
struct ActivateHatchEvent
{
public:
	struct FName                                                 EventID;                                           // 0x0(0x8)
	byte                                                         FlameSpecificPhobia;                               // 0x8(0x1)
	char                                                         pad0x3_L7P1P[0x3];                                 // 0x9(0x3)
};


// Size 0x10
struct BedPartDesc
{
public:
	class MaterialInterface*                                     BedMaterial;                                       // 0x0(0x8)
	class MaterialInterface*                                     DrapesMaterial;                                    // 0x8(0x8)
};


// Size 0x10
struct BellPlayerStats
{
public:
	TArray<struct PlayerStat>                                    StatsToFireUponBellRing;                           // 0x0(0x10)
};


// Size 0x18
struct BellDesc
{
public:
	class StaticMesh*                                            BellMesh;                                          // 0x0(0x8)
	class WwiseEvent*                                            BellRingSFX;                                       // 0x8(0x8)
	class WwiseEvent*                                            BellRingTurbulenceSFX;                             // 0x10(0x8)
};


// Size 0x28
struct PageLayoutRepInfo
{
public:
	char                                                         pad0x8_ZKJ1W[0x8];                                 // 0x0(0x8)
	TArray<struct TreasureMapWidgetTexture>                      Images;                                            // 0x8(0x10)
	TArray<struct TreasureMapWidgetLocalisedTextWithFontOverride> GeneralText;                                       // 0x18(0x10)
};


// Size 0x80
struct TreasureMapWidgetLocalisedTextWithFontOverride
{
public:
	char                                                         pad0x78_62J60[0x78];                               // 0x0(0x78)
	class Font*                                                  FontOverride;                                      // 0x78(0x8)
};


// Size 0x78
struct TreasureMapWidgetLocalisedText
{
public:
	char                                                         pad0x40_FZO93[0x40];                               // 0x0(0x40)
	struct FText                                                 Text;                                              // 0x40(0x38)
};


// Size 0x3c
struct TreasureMapWidgetText
{
public:
	char                                                         pad0x1c_N8NRE[0x1c];                               // 0x0(0x1c)
	float                                                        Scale;                                             // 0x1c(0x4)
	bool                                                         CutoutTextStyle;                                   // 0x20(0x1)
	bool                                                         ShouldStrikethroughOnStart;                        // 0x21(0x1)
	char                                                         pad0x2_OLBD3[0x2];                                 // 0x22(0x2)
	float                                                        StrikethroughThickness;                            // 0x24(0x4)
	float                                                        StrikethroughOffset;                               // 0x28(0x4)
	struct LinearColor                                           StrikethroughColor;                                // 0x2c(0x10)
};


// Size 0x1c
struct TreasureMapWidget
{
public:
	struct Vector2D                                              Position;                                          // 0x0(0x8)
	byte                                                         HorizontalAlignment;                               // 0x8(0x1)
	byte                                                         VerticalAlignment;                                 // 0x9(0x1)
	char                                                         pad0x2_RG6XX[0x2];                                 // 0xa(0x2)
	float                                                        Angle;                                             // 0xc(0x4)
	float                                                        Width;                                             // 0x10(0x4)
	float                                                        Opacity;                                           // 0x14(0x4)
	bool                                                         DisableCanvasWidthClamp;                           // 0x18(0x1)
	char                                                         pad0x3_MN1JW[0x3];                                 // 0x19(0x3)
};


// Size 0x30
struct TreasureMapWidgetTexture
{
public:
	char                                                         pad0x20_FUME0[0x20];                               // 0x0(0x20)
	class Texture*                                               Image;                                             // 0x20(0x8)
	float                                                        RelativeHeightModifier;                            // 0x28(0x4)
	bool                                                         FlipX;                                             // 0x2c(0x1)
	bool                                                         ScaleHeightOnMultipleLines;                        // 0x2d(0x1)
	char                                                         pad0x2_TTF86[0x2];                                 // 0x2e(0x2)
};


// Size 0x18
struct QuestBookPageRenderer
{
public:
	class Font*                                                  Font;                                              // 0x0(0x8)
	float                                                        FontScale;                                         // 0x8(0x4)
	float                                                        FontMaxScale;                                      // 0xc(0x4)
	float                                                        FontLineSpacingScale;                              // 0x10(0x4)
	char                                                         pad0x4_PER5F[0x4];                                 // 0x14(0x4)
};


// Size 0x140
struct QuestBookMaterialHandler
{
public:
	int                                                          PageWidth;                                         // 0x0(0x4)
	int                                                          PageHeight;                                        // 0x4(0x4)
	struct QuestBookPageRenderer                                 PageTextRenderer;                                  // 0x8(0x18)
	class MaybeCompressedCanvasRenderTarget2D*                   LeftSpreadLeftPageRenderTarget;                    // 0x20(0x8)
	class MaybeCompressedCanvasRenderTarget2D*                   LeftSpreadRightPageRenderTarget;                   // 0x28(0x8)
	class MaybeCompressedCanvasRenderTarget2D*                   RightSpreadLeftPageRenderTarget;                   // 0x30(0x8)
	class MaybeCompressedCanvasRenderTarget2D*                   RightSpreadRightPageRenderTarget;                  // 0x38(0x8)
	class QuestBookPageLayout*                                   LeftSpreadLeftPageContents;                        // 0x40(0x8)
	char                                                         pad0x10_KRBEE[0x10];                               // 0x48(0x10)
	class QuestBookPageLayout*                                   LeftSpreadRightPageContents;                       // 0x58(0x8)
	char                                                         pad0x10_DU88Q[0x10];                               // 0x60(0x10)
	class QuestBookPageLayout*                                   RightSpreadLeftPageContents;                       // 0x70(0x8)
	char                                                         pad0x10_D2CH1[0x10];                               // 0x78(0x10)
	class QuestBookPageLayout*                                   RightSpreadRightPageContents;                      // 0x88(0x8)
	char                                                         pad0xb0_G09K3[0xb0];                               // 0x90(0xb0)
};


// Size 0x28
struct PageReference
{
public:
	struct StringAssetReference                                  PageReference;                                     // 0x0(0x10)
	byte                                                         NumberOfPages;                                     // 0x10(0x1)
	bool                                                         IsSkippable;                                       // 0x11(0x1)
	char                                                         pad0x2_EGIKH[0x2];                                 // 0x12(0x2)
	int                                                          Priority;                                          // 0x14(0x4)
	TArray<struct PageCultureOverride>                           CultureOverrides;                                  // 0x18(0x10)
};


// Size 0x20
struct PageCultureOverride
{
public:
	struct FString                                               Culture;                                           // 0x0(0x10)
	struct StringAssetReference                                  PageReference;                                     // 0x10(0x10)
};


// Size 0x28
struct QuestBookRepInfo
{
public:
	int                                                          LeftPageIndex;                                     // 0x0(0x4)
	char                                                         pad0x4_M8IWK[0x4];                                 // 0x4(0x4)
	TArray<Int CurrentBookContents>                              CurrentBookContents;                               // 0x8(0x10)
	TArray<struct PageLayoutRepInfo>                             ProcPageList;                                      // 0x18(0x10)
};


// Size 0x50
struct BountyMapTargetDesc
{
public:
	struct TreasureMapTextDesc                                   Name;                                              // 0x0(0x48)
	class Texture*                                               MugShotImage;                                      // 0x48(0x8)
};


// Size 0x48
struct TreasureMapTextDesc
{
public:
	struct FText                                                 Pattern;                                           // 0x0(0x38)
	TArray<struct TreasureMapTextEntry>                          Substitutions;                                     // 0x38(0x10)
};


// Size 0x48
struct TreasureMapTextEntry
{
public:
	struct FString                                               Name;                                              // 0x0(0x10)
	struct FText                                                 Substitution;                                      // 0x10(0x38)
};


// Size 0x68
struct BountyMapContents
{
public:
	struct TreasureMapTextDesc                                   Location;                                          // 0x0(0x48)
	TArray<struct TreasureMapTextDesc>                           Descriptions;                                      // 0x48(0x10)
	TArray<struct BountyMapTargetDesc>                           Targets;                                           // 0x58(0x10)
};


// Size 0x30
struct CannonDesc
{
public:
	struct StringAssetReference                                  CannonBarrelMesh;                                  // 0x0(0x10)
	struct StringAssetReference                                  CannonBoxMesh;                                     // 0x18(0x10)
	char                                                         pad0x8_TCK3F[0x8];                                 // 0x28(0x8)
};


// Size 0x8
struct EventCannonFiredOnServer
{
public:
	class Cannon*                                                Cannon;                                            // 0x0(0x8)
};


// Size 0x20
struct EventCannonFired
{
public:
	class Cannon*                                                FiredCannon;                                       // 0x0(0x8)
	char                                                         pad0x18_QTF9O[0x18];                               // 0x8(0x18)
};


// Size 0x1
struct EventCannonAimingStoppedYaw
{
public:
	bool                                                         IsAtEnd;                                           // 0x0(0x1)
};


// Size 0x1
struct EventCannonAimingStoppedPitch
{
public:
	bool                                                         IsAtEnd;                                           // 0x0(0x1)
};


// Size 0x1
struct EventCannonAimingStartedYaw
{
public:
	char                                                         pad0x1_NTPPU[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventCannonAimingStartedPitch
{
public:
	char                                                         pad0x1_YZS2I[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventCannonAimingCenteredYaw
{
public:
	char                                                         pad0x1_16ZHI[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventCannonAimingCenteredPitch
{
public:
	char                                                         pad0x1_KG2Z6[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct AchievementSailCloseToShipWithoutFiring
{
public:
	float                                                        RangeToRemainWithinInMetres;                       // 0x0(0x4)
	float                                                        DistanceToTravelInMetres;                          // 0x4(0x4)
	char                                                         pad0x10_5ZB2Z[0x10];                               // 0x8(0x10)
};


// Size 0x8
struct AchievementSailFullyWithTheWind
{
public:
	float                                                        DistanceToTravelInMetres;                          // 0x0(0x4)
	char                                                         pad0x4_2H6B7[0x4];                                 // 0x4(0x4)
};


// Size 0x90
struct AchievementSailThroughStormAtNightWithLightsOff
{
public:
	char                                                         pad0x60_BM6D0[0x60];                               // 0x0(0x60)
	class Ship*                                                  Ship;                                              // 0x60(0x8)
	char                                                         pad0x28_XH4E3[0x28];                               // 0x68(0x28)
};


// Size 0x118
struct AchievementSailWithFlameOfFateColoursAboard
{
public:
	char                                                         pad0x8_HE9CA[0x8];                                 // 0x0(0x8)
	class Ship*                                                  Ship;                                              // 0x8(0x8)
	TArray<class ShipInteractableLight*>                         ShipLights;                                        // 0x10(0x10)
	char                                                         pad0xf8_KRZOL[0xf8];                               // 0x20(0xf8)
};


// Size 0x98
struct ShipPartConnections
{
public:
	struct FName                                                 AnchorName;                                        // 0x0(0x8)
	struct FName                                                 CapstanName;                                       // 0x8(0x8)
	struct FName                                                 RudderName;                                        // 0x10(0x8)
	struct FName                                                 WheelName;                                         // 0x18(0x8)
	struct FName                                                 MainMastName;                                      // 0x20(0x8)
	struct FName                                                 MainMastSailHoistRightName;                        // 0x28(0x8)
	struct FName                                                 MainMastSailHoistLeftName;                         // 0x30(0x8)
	struct FName                                                 MainMastSailAngleRightName;                        // 0x38(0x8)
	struct FName                                                 MainMastSailAngleLeftName;                         // 0x40(0x8)
	struct FName                                                 MizzenMastName;                                    // 0x48(0x8)
	struct FName                                                 MizzenMastSailHoistRightName;                      // 0x50(0x8)
	struct FName                                                 MizzenMastSailHoistLeftName;                       // 0x58(0x8)
	struct FName                                                 MizzenMastSailAngleRightName;                      // 0x60(0x8)
	struct FName                                                 MizzenMastSailAngleLeftName;                       // 0x68(0x8)
	struct FName                                                 ForeMastName;                                      // 0x70(0x8)
	struct FName                                                 ForeMastSailHoistRightName;                        // 0x78(0x8)
	struct FName                                                 ForeMastSailHoistLeftName;                         // 0x80(0x8)
	struct FName                                                 ForeMastSailAngleRightName;                        // 0x88(0x8)
	struct FName                                                 ForeMastSailAngleLeftName;                         // 0x90(0x8)
};


// Size 0x30
struct ShipCurseFXData
{
public:
	byte                                                         ShipCurseTag;                                      // 0x0(0x1)
	char                                                         pad0x7_9HKO0[0x7];                                 // 0x1(0x7)
	TArray<struct ShipCurseVFXTemplate>                          VFXTemplates;                                      // 0x8(0x10)
	struct ShipCurseAudioLoop                                    AudioLoop;                                         // 0x18(0x18)
};


// Size 0x18
struct ShipCurseAudioLoop
{
public:
	class WwiseEvent*                                            PlayLoop;                                          // 0x0(0x8)
	class WwiseEvent*                                            StopLoop;                                          // 0x8(0x8)
	class WwiseObjectPoolWrapper*                                PoolWrapper;                                       // 0x10(0x8)
};


// Size 0x20
struct ShipCurseVFXTemplate
{
public:
	class UClass*                                                ActorClass;                                        // 0x0(0x8)
	class ParticleSystem*                                        Template;                                          // 0x8(0x8)
	struct FString                                               SocketNameSubstring;                               // 0x10(0x10)
};


// Size 0x1
struct EventApplyStatusShipCurseEnd
{
public:
	char                                                         pad0x1_F8RAX[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct EventApplyStatusShipCurse
{
public:
	char                                                         pad0x8_HIZUA[0x8];                                 // 0x0(0x8)
	struct Status                                                Status;                                            // 0x8(0x18)
};


// Size 0x1
struct EventCurseWheelLockEnd
{
public:
	char                                                         pad0x1_HTTIH[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventCurseWheelLock
{
public:
	byte                                                         CurseTag;                                          // 0x0(0x1)
	char                                                         pad0x3_JUTLH[0x3];                                 // 0x1(0x3)
	float                                                        AngleThreshold;                                    // 0x4(0x4)
};


// Size 0x8
struct EventCurseSpawnAIOnShip
{
public:
	class AIFixedWavesSpawner*                                   AISpawner;                                         // 0x0(0x8)
};


// Size 0x1
struct EventCurseBallastEnd
{
public:
	char                                                         pad0x1_GMFAH[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct EventCurseBallast
{
public:
	char                                                         pad0x4_T4OW5[0x4];                                 // 0x0(0x4)
};


// Size 0x30
struct EventShipCurseFXEnd
{
public:
	struct ShipCurseFXData                                       CurseFXData;                                       // 0x0(0x30)
};


// Size 0x30
struct EventShipCurseFX
{
public:
	struct ShipCurseFXData                                       CurseFXData;                                       // 0x0(0x30)
};


// Size 0xc
struct CurseShipCannonsEvent
{
public:
	float                                                        PitchAngle;                                        // 0x0(0x4)
	float                                                        YawAngle;                                          // 0x4(0x4)
	float                                                        BlendTime;                                         // 0x8(0x4)
};


// Size 0x18
struct EventEnableInteractionPoints
{
public:
	byte                                                         ShipCurseTag;                                      // 0x0(0x1)
	byte                                                         CurseTag;                                          // 0x1(0x1)
	char                                                         pad0x6_2938S[0x6];                                 // 0x2(0x6)
	TArray<class Class*>                                         InteractionPointsToEnable;                         // 0x8(0x10)
};


// Size 0x18
struct EventDisableInteractionPoints
{
public:
	byte                                                         ShipCurseTag;                                      // 0x0(0x1)
	byte                                                         CurseTag;                                          // 0x1(0x1)
	char                                                         pad0x6_49V0K[0x6];                                 // 0x2(0x6)
	TArray<class Class*>                                         InteractionPointsToDisable;                        // 0x8(0x10)
};


// Size 0x4
struct EventCurseCapstan
{
public:
	float                                                        DurationToToggleCapstanPosition;                   // 0x0(0x4)
};


// Size 0x4
struct EventCurseChangeSailHeight
{
public:
	float                                                        Duration;                                          // 0x0(0x4)
};


// Size 0x30
struct TimedResponseAction
{
public:
	TArray<class Actor*>                                         TargetActors;                                      // 0x0(0x10)
	float                                                        Duration;                                          // 0x10(0x4)
	bool                                                         IsActive;                                          // 0x14(0x1)
	char                                                         pad0x1b_L3XAD[0x1b];                               // 0x15(0x1b)
};


// Size 0x18
struct ShipCurseSpawnedFXForCurse
{
public:
	char                                                         pad0x8_3DYV3[0x8];                                 // 0x0(0x8)
	TArray<struct ShipCurseSpawnedFXObject>                      SpawnedFXObjects;                                  // 0x8(0x10)
};


// Size 0x30
struct ShipCurseSpawnedFXObject
{
public:
	char                                                         pad0x28_Y6GQB[0x28];                               // 0x0(0x28)
	class WwiseEvent*                                            StopAudioLoopEvent;                                // 0x28(0x8)
};


// Size 0x30
struct ShipActiveCurseFXData
{
public:
	struct ShipCurseFXData                                       CurseFXData;                                       // 0x0(0x30)
};


// Size 0x18
struct ShipConfigurationSettings
{
public:
	float                                                        MetresSailedStatSendFrequency;                     // 0x0(0x4)
	float                                                        MinimumDistanceSailedBeforeSendingUpdate;          // 0x4(0x4)
	float                                                        MaxVelocityAllowedForServerMigration;              // 0x8(0x4)
	float                                                        MaxAngularVelocityAllowedForServerMigration;       // 0xc(0x4)
	float                                                        ShipHeartbeatFrequencySeconds;                     // 0x10(0x4)
	bool                                                         MigrationBasedOnVelocityEnabled;                   // 0x14(0x1)
	char                                                         pad0x3_GSZDT[0x3];                                 // 0x15(0x3)
};


// Size 0x40
struct LiquidContents
{
public:
	class Ship*                                                  LiquidSource;                                      // 0x0(0x8)
	TArray<class Ship*>                                          LiquidTargets;                                     // 0x8(0x10)
	class Actor*                                                 Container;                                         // 0x18(0x8)
	float                                                        LiquidVolume;                                      // 0x20(0x4)
	struct Guid                                                  ScoopID;                                           // 0x24(0x10)
	float                                                        LiquidTransferFillAmountModifier;                  // 0x34(0x4)
	byte                                                         ContainerType;                                     // 0x38(0x1)
	char                                                         pad0x7_35HJE[0x7];                                 // 0x39(0x7)
};


// Size 0x58
struct BucketContentsInfo
{
public:
	byte                                                         ThrowableLiquidType;                               // 0x0(0x1)
	char                                                         pad0x7_F6MPW[0x7];                                 // 0x1(0x7)
	class UClass*                                                ProjectileClassToSpawn;                            // 0x8(0x8)
	class UClass*                                                ProjectileClassToSpawnAtWielder;                   // 0x10(0x8)
	class WwiseEvent*                                            ThrowSfx;                                          // 0x18(0x8)
	class Object*                                                ThrowVfxFirstPerson;                               // 0x20(0x8)
	class Object*                                                ThrowVfxThirdPerson;                               // 0x28(0x8)
	class Object*                                                DrenchWielderVfxThirdPerson;                       // 0x30(0x8)
	class Object*                                                BucketContentsParticleSystemFirstPerson;           // 0x38(0x8)
	class Object*                                                BucketContentsParticleSystemThirdPerson;           // 0x40(0x8)
	struct FName                                                 SwitchState;                                       // 0x48(0x8)
	float                                                        LiquidLevel;                                       // 0x50(0x4)
	char                                                         pad0x4_JO21Y[0x4];                                 // 0x54(0x4)
};


// Size 0x30
struct QuestVariablePlayerActor
{
public:
	char                                                         pad0x30_52X00[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariable
{
public:
	char                                                         pad0x18_ZOFFR[0x18];                               // 0x0(0x18)
	struct FName                                                 ParamName;                                         // 0x18(0x8)
	char                                                         pad0x10_4VKJ9[0x10];                               // 0x20(0x10)
};


// Size 0x1c
struct LocationGeneratorSample
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	char                                                         pad0x3_QEAHC[0x3];                                 // 0x1(0x3)
	struct Vector                                                Location;                                          // 0x4(0xc)
	struct Vector                                                Normal;                                            // 0x10(0xc)
};


// Size 0x10
struct CampaignPopUpNotificationInfo
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	class PopUpMessageDesc*                                      PopUp;                                             // 0x8(0x8)
};


// Size 0x18
struct CannonEnchantmentDesc
{
public:
	class Object*                                                MuzzleFlashVfxFirstPerson;                         // 0x0(0x8)
	class Object*                                                MuzzleFlashVfxThirdPerson;                         // 0x8(0x8)
	class WwiseEvent*                                            FireSfx;                                           // 0x10(0x8)
};


// Size 0x10
struct AdditionalMarkerData
{
public:
	char                                                         pad0x10_SMF6H[0x10];                               // 0x0(0x10)
};


// Size 0x10
struct FactionStreakIcon
{
public:
	class Texture*                                               FactionStreakIcon;                                 // 0x0(0x8)
	class UClass*                                                Faction;                                           // 0x8(0x8)
};


// Size 0x48
struct CapstanDesc
{
public:
	struct StringAssetReference                                  CapstanBodyMesh;                                   // 0x0(0x10)
	struct StringAssetReference                                  CapstanArmMesh;                                    // 0x18(0x10)
	struct StringAssetReference                                  CapstanReleaseMesh;                                // 0x30(0x10)
	char                                                         pad0x8_ULAI6[0x8];                                 // 0x40(0x8)
};


// Size 0x68
struct CapstanAudioParams
{
public:
	class WwiseEvent*                                            CapstanStart;                                      // 0x0(0x8)
	class WwiseEvent*                                            CapstanStop;                                       // 0x8(0x8)
	class WwiseEvent*                                            CapstanDamagedStart;                               // 0x10(0x8)
	class WwiseEvent*                                            CapstanDamagedStop;                                // 0x18(0x8)
	class WwiseEvent*                                            CapstanStopFullyRaised;                            // 0x20(0x8)
	class WwiseEvent*                                            CapstanStopFullyLowered;                           // 0x28(0x8)
	class WwiseObjectPoolWrapper*                                CapstanEmitterPool;                                // 0x30(0x8)
	struct FName                                                 CapstanTurnRateRtpc;                               // 0x38(0x8)
	float                                                        CapstanTurnMinRtpcValue;                           // 0x40(0x4)
	float                                                        CapstanTurnMaxRtpcValue;                           // 0x44(0x4)
	struct FName                                                 BoatVelocityRtpc;                                  // 0x48(0x8)
	float                                                        BoatVelocityMinRtpcValue;                          // 0x50(0x4)
	float                                                        BoatVelocityMaxRtpcValue;                          // 0x54(0x4)
	float                                                        EmpiricalMaxShipVelocity;                          // 0x58(0x4)
	struct FName                                                 CapstanDamageRtpc;                                 // 0x5c(0x8)
	float                                                        CapstanDamageRtpcMaxValue;                         // 0x64(0x4)
};


// Size 0x8
struct CapstanNetState
{
public:
	float                                                        TargetRatio;                                       // 0x0(0x4)
	bool                                                         IsLocked;                                          // 0x4(0x1)
	char                                                         pad0x3_26OKY[0x3];                                 // 0x5(0x3)
};


// Size 0x14
struct CapstanParams
{
public:
	float                                                        MaxVelocityPerPlayer;                              // 0x0(0x4)
	float                                                        MaxFreeLoweringVelocity;                           // 0x4(0x4)
	float                                                        MaxError;                                          // 0x8(0x4)
	float                                                        CorrectiveForceMultiplier;                         // 0xc(0x4)
	float                                                        PlayerAnimationOnCapstanMultiplier;                // 0x10(0x4)
};


// Size 0x20
struct CaptainCurtainsPartDesc
{
public:
	struct StringAssetReference                                  PrimaryCurtainMesh;                                // 0x0(0x10)
	class MaterialInterface*                                     SecondaryCurtainMaterial;                          // 0x10(0x8)
	char                                                         pad0x8_8P469[0x8];                                 // 0x18(0x8)
};


// Size 0x78
struct WalletUpdatedMessage
{
public:
	struct PirateIdentity                                        PirateIdentity;                                    // 0x0(0x78)
};


// Size 0x78
struct PirateIdentity
{
public:
	struct UniqueNetIdRepl                                       UserId;                                            // 0x0(0x18)
	struct FString                                               PirateId;                                          // 0x18(0x10)
	char                                                         pad0x50_EO6HQ[0x50];                               // 0x28(0x50)
};


// Size 0x18
struct WalletTransactionRequest
{
public:
	byte                                                         Currency;                                          // 0x0(0x1)
	char                                                         pad0x3_YA0UD[0x3];                                 // 0x1(0x3)
	struct Guid                                                  TransactionId;                                     // 0x8(0x10)
};


// Size 0x50
struct CommerceRemoteServiceWalletTransactionResponse
{
public:
	char                                                         pad0x50_2EXCH[0x50];                               // 0x0(0x50)
};


// Size 0x50
struct CommerceRemoteServiceWalletBalanceResponse
{
public:
	char                                                         pad0x50_O5AYC[0x50];                               // 0x0(0x50)
};


// Size 0x10
struct FeaturedShipCustomizationCategory
{
public:
	class UClass*                                                Category;                                          // 0x0(0x8)
	struct FName                                                 Feature;                                           // 0x8(0x8)
};


// Size 0x18
struct FeatureToggledCargoRunCrateCustomData
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x0(0xc)
	char                                                         pad0x4_PRB6Y[0x4];                                 // 0xc(0x4)
	class CargoRunCrateCustomData*                               Data;                                              // 0x10(0x8)
};


// Size 0x38
struct CompanyCargoRunHandInStats
{
public:
	class UClass*                                                CompanyId;                                         // 0x0(0x8)
	TArray<struct PlayerStat>                                    StatsToFireOnHandIn;                               // 0x8(0x10)
	TArray<struct PlayerStat>                                    StatsToFireOnDamagedHandIn;                        // 0x18(0x10)
	TArray<struct PlayerStat>                                    StatsToFirePerHealthTierOnHandIn;                  // 0x28(0x10)
};


// Size 0x18
struct CompanySpecificCargoRunStats
{
public:
	class UClass*                                                CompanyId;                                         // 0x0(0x8)
	TArray<struct PlayerStat>                                    StatsToFireUponPerfectOnTimeHandIn;                // 0x8(0x10)
};


// Size 0x28
struct CompanySpecificCargoRunReward
{
public:
	class UClass*                                                CompanyId;                                         // 0x0(0x8)
	struct CargoRunReward                                        Reward;                                            // 0x8(0x20)
};


// Size 0x20
struct CargoRunReward
{
public:
	TArray<struct RewardId>                                      OnTimeRewards;                                     // 0x0(0x10)
	TArray<struct RewardId>                                      LateRewards;                                       // 0x10(0x10)
};


// Size 0x60
struct CargoRunMapContents
{
public:
	struct Guid                                                  NPCId;                                             // 0x0(0x10)
	int                                                          CompanyIndex;                                      // 0x10(0x4)
	int                                                          NumOfItems;                                        // 0x14(0x4)
	struct TreasureMapTextDesc                                   PickupLocationHint;                                // 0x18(0x48)
};


// Size 0x30
struct CarouselPirateDesc
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
	byte                                                         Gender;                                            // 0x4(0x1)
	byte                                                         Ethnicity;                                         // 0x5(0x1)
	char                                                         pad0x2_BKG3J[0x2];                                 // 0x6(0x2)
	float                                                        Age;                                               // 0x8(0x4)
	struct RadialCoordinate                                      BodyShape;                                         // 0xc(0x8)
	float                                                        Dirtiness;                                         // 0x14(0x4)
	float                                                        Wonkiness;                                         // 0x18(0x4)
	char                                                         pad0x4_U98X3[0x4];                                 // 0x1c(0x4)
	TArray<class Class*>                                         Outfit;                                            // 0x20(0x10)
};


// Size 0xc8
struct CarouselPirateGeneratorParams
{
public:
	int                                                          MinNumOfEachGender;                                // 0x0(0x4)
	int                                                          MinNumOfEachEthnicity;                             // 0x4(0x4)
	TArray<struct CarouselPirateGroup>                           Groups;                                            // 0x8(0x10)
	struct CarouselPirateGroup                                   Default;                                           // 0x18(0x6c)
	char                                                         pad0x4_09YTQ[0x4];                                 // 0x84(0x4)
	struct CarouselPirateClothing                                MaleClothing;                                      // 0x88(0x20)
	struct CarouselPirateClothing                                FemaleClothing;                                    // 0xa8(0x20)
};


// Size 0x20
struct CarouselPirateClothing
{
public:
	TArray<struct CarouselPirateClothingItem>                    AvailableItems;                                    // 0x0(0x10)
	TArray<struct CarouselPirateClothingCategoryBias>            Probabilities;                                     // 0x10(0x10)
};


// Size 0x10
struct CarouselPirateClothingCategoryBias
{
public:
	class UClass*                                                Category;                                          // 0x0(0x8)
	float                                                        LikelihoodOfHaving;                                // 0x8(0x4)
	bool                                                         ProgressivlyDecreaseChance;                        // 0xc(0x1)
	char                                                         pad0x3_30ABC[0x3];                                 // 0xd(0x3)
};


// Size 0x10
struct CarouselPirateClothingItem
{
public:
	class UClass*                                                Item;                                              // 0x0(0x8)
	byte                                                         EthnicityFilter;                                   // 0x8(0x1)
	char                                                         pad0x7_FO2MW[0x7];                                 // 0x9(0x7)
};


// Size 0x6c
struct CarouselPirateGroup
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	int                                                          Count;                                             // 0x8(0x4)
	struct FloatRange                                            Age;                                               // 0xc(0x10)
	struct FloatRange                                            Wonkiness;                                         // 0x1c(0x10)
	struct FloatRange                                            Dirt;                                              // 0x2c(0x10)
	struct CarouselPirateBodyshape                               MaleBodyShape;                                     // 0x3c(0x18)
	struct CarouselPirateBodyshape                               FemaleBodyShape;                                   // 0x54(0x18)
};


// Size 0x18
struct CarouselPirateBodyshape
{
public:
	float                                                        RandomizationBias;                                 // 0x0(0x4)
	struct FloatRange                                            ShapeMagnitude;                                    // 0x4(0x10)
	struct CarouselPirateBodyshapeCompass                        BodyShapeCompass;                                  // 0x14(0x2)
	char                                                         pad0x2_MXX6E[0x2];                                 // 0x16(0x2)
};


// Size 0x2
struct CarouselPirateBodyshapeCompass
{
public:
	byte                                                         StartDirection;                                    // 0x0(0x1)
	byte                                                         EndDirection;                                      // 0x1(0x1)
};


// Size 0x18
struct CatalogOfferCommodity
{
public:
	class UClass*                                                RequiredEmissary;                                  // 0x0(0x8)
	struct CommoditySelectionType                                Type;                                              // 0x8(0x8)
	byte                                                         Demand;                                            // 0x10(0x1)
	char                                                         pad0x7_E1GYH[0x7];                                 // 0x11(0x7)
};


// Size 0x18
struct CatalogOfferBundleDataAsset
{
public:
	char                                                         pad0x8_WK10Y[0x8];                                 // 0x0(0x8)
	struct StringAssetReference                                  TileImage;                                         // 0x8(0x10)
};


// Size 0x10
struct CatalogOfferRewardDataAsset
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	struct RewardId                                              Reward;                                            // 0x8(0x8)
};


// Size 0x28
struct CatalogOfferPrerequisitesDataAsset
{
public:
	TArray<class Class*>                                         Entitlements;                                      // 0x0(0x10)
	TArray<struct CatalogOfferCompanyLevelDataAsset>             CompanyLevel;                                      // 0x10(0x10)
	char                                                         pad0x8_YFQH4[0x8];                                 // 0x20(0x8)
};


// Size 0x10
struct CatalogOfferCompanyLevelDataAsset
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	char                                                         pad0x8_R22DW[0x8];                                 // 0x8(0x8)
};


// Size 0x18
struct CategoryDefaultsUnit
{
public:
	TArray<Str PartialStrings>                                   PartialStrings;                                    // 0x0(0x10)
	class UClass*                                                Category;                                          // 0x10(0x8)
};


// Size 0x30
struct ChandelierPartDesc
{
public:
	struct StringAssetReference                                  ChandelierMesh;                                    // 0x0(0x10)
	struct StringAssetReference                                  FlamesMesh;                                        // 0x10(0x10)
	char                                                         pad0x10_FY0JS[0x10];                               // 0x20(0x10)
};


// Size 0x210
struct PlayerMusicController
{
public:
	class PlayerMusicControllerParams*                           PlayerMusicParams;                                 // 0x0(0x8)
	char                                                         pad0x30_FZVIK[0x30];                               // 0x8(0x30)
	class Actor*                                                 LocalPlayerActor;                                  // 0x38(0x8)
	class PlayerOceanAudioComponent*                             PlayerOceanAudioComponent;                         // 0x40(0x8)
	class PlayerAtmosphericsAudioComponent*                      AtmosphericsAudioComponent;                        // 0x48(0x8)
	class AthenaPlayerCharacter*                                 AthenaPlayerCharacter;                             // 0x50(0x8)
	class AthenaWorldSettings*                                   AthenaWorldSettings;                               // 0x58(0x8)
	char                                                         pad0x160_GJEYU[0x160];                             // 0x60(0x160)
	struct TimeStampedShipDiveMusicState                         TimeStampedShipDiveMusicState;                     // 0x1c0(0x18)
	char                                                         pad0x10_FDCH9[0x10];                               // 0x1d8(0x10)
	TArray<struct AudioStingRelevantShips>                       RelevantAudioStingShips;                           // 0x1e8(0x10)
	TArray<struct AudioStingShipsSpotted>                        AudioStingShipsSpottedRecently;                    // 0x1f8(0x10)
	char                                                         pad0x8_ZII7Z[0x8];                                 // 0x208(0x8)
};


// Size 0x10
struct AudioStingShipsSpotted
{
public:
	class Actor*                                                 SpottedShip;                                       // 0x0(0x8)
	double                                                       TimeSpotted;                                       // 0x8(0x8)
};


// Size 0x10
struct AudioStingRelevantShips
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	bool                                                         IsAIShip;                                          // 0x8(0x1)
	bool                                                         IsEmissary;                                        // 0x9(0x1)
	bool                                                         IsCaptainedShip;                                   // 0xa(0x1)
	char                                                         pad0x5_3ZVG6[0x5];                                 // 0xb(0x5)
};


// Size 0x18
struct TimeStampedShipDiveMusicState
{
public:
	struct FName                                                 MusicThemeName;                                    // 0x0(0x8)
	byte                                                         DiveMusicState;                                    // 0x8(0x1)
	char                                                         pad0x7_XWVVO[0x7];                                 // 0x9(0x7)
	double                                                       EnteredStateServerTimeStamp;                       // 0x10(0x8)
};


// Size 0x18
struct NamedStateSelector
{
public:
	TArray<struct NameActiveStatePair>                           NamedStates;                                       // 0x0(0x10)
	struct FName                                                 DefaultStateName;                                  // 0x10(0x8)
};


// Size 0xc
struct NameActiveStatePair
{
public:
	struct FName                                                 StateName;                                         // 0x0(0x8)
	bool                                                         IsActive;                                          // 0x8(0x1)
	char                                                         pad0x3_7F8YY[0x3];                                 // 0x9(0x3)
};


// Size 0x18
struct FogTypeToAudio
{
public:
	byte                                                         FogBankType;                                       // 0x0(0x1)
	char                                                         pad0x7_UI0UV[0x7];                                 // 0x1(0x7)
	class WwiseEvent*                                            FogMusicPlayEvent;                                 // 0x8(0x8)
	class WwiseEvent*                                            FogMusicStopEvent;                                 // 0x10(0x8)
};


// Size 0x20
struct StateCategoryGroup
{
public:
	char                                                         pad0x18_HJV7U[0x18];                               // 0x0(0x18)
	struct FName                                                 GroupName;                                         // 0x18(0x8)
};


// Size 0x10
struct HealthChangeAudio
{
public:
	byte                                                         Reason;                                            // 0x0(0x1)
	char                                                         pad0x7_9ZOPM[0x7];                                 // 0x1(0x7)
	class WwiseEvent*                                            Sfx;                                               // 0x8(0x8)
};


// Size 0x28
struct DamageTypeToAudio
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	struct FName                                                 AudioState;                                        // 0x8(0x8)
	class WwiseEvent*                                            StartAudioEvent;                                   // 0x10(0x8)
	class WwiseEvent*                                            EndAudioEvent;                                     // 0x18(0x8)
	float                                                        Duration;                                          // 0x20(0x4)
	char                                                         pad0x4_GE96C[0x4];                                 // 0x24(0x4)
};


// Size 0x1c
struct CharacterSocketFootWaterImpactResult
{
public:
	struct Vector                                                Position;                                          // 0x0(0xc)
	struct Vector                                                SocketVelocity;                                    // 0xc(0xc)
	int                                                          FootIndex;                                         // 0x18(0x4)
};


// Size 0x20
struct CharacterFootWaterImpactResult
{
public:
	struct CharacterSocketFootWaterImpactResult                  SocketFootImpactResult;                            // 0x0(0x1c)
	int                                                          FootIndex;                                         // 0x1c(0x4)
};


// Size 0xd0
struct CharacterFootImpactResult
{
public:
	struct HitResult                                             HitResult;                                         // 0x0(0x80)
	byte                                                         FootImpactType;                                    // 0x80(0x1)
	char                                                         pad0xf_Y3XJS[0xf];                                 // 0x81(0xf)
	struct Transform                                             SocketTransform;                                   // 0x90(0x30)
	struct Vector                                                SocketVelocity;                                    // 0xc0(0xc)
	int                                                          FootIndex;                                         // 0xcc(0x4)
};


// Size 0x28
struct CharacterSocketCollisionDesc
{
public:
	struct FName                                                 SocketName;                                        // 0x0(0x8)
	class SkeletalMeshComponent*                                 SkeletalMeshComponent;                             // 0x8(0x8)
	byte                                                         TraceType;                                         // 0x10(0x1)
	char                                                         pad0x3_Y42A1[0x3];                                 // 0x11(0x3)
	float                                                        TraceDistance;                                     // 0x14(0x4)
	float                                                        TraceOffset;                                       // 0x18(0x4)
	byte                                                         ResultType;                                        // 0x1c(0x1)
	char                                                         pad0x3_DVIOE[0x3];                                 // 0x1d(0x3)
	int                                                          FootIndex;                                         // 0x20(0x4)
	char                                                         pad0x4_UQ9L0[0x4];                                 // 0x24(0x4)
};


// Size 0x28
struct SocketCollisionExitWaterEvent
{
public:
	char                                                         pad0x28_6BPDD[0x28];                               // 0x0(0x28)
};


// Size 0x28
struct SocketCollisionEnterWaterEvent
{
public:
	char                                                         pad0x28_GQ36K[0x28];                               // 0x0(0x28)
};


// Size 0xd0
struct SocketCollisionEvent
{
public:
	char                                                         pad0xd0_54UTD[0xd0];                               // 0x0(0xd0)
};


// Size 0xc
struct ChestOfRageReplicatedData
{
public:
	byte                                                         State;                                             // 0x0(0x1)
	char                                                         pad0x3_DPM53[0x3];                                 // 0x1(0x3)
	float                                                        RageValue;                                         // 0x4(0x4)
	bool                                                         HasBeenActivated;                                  // 0x8(0x1)
	char                                                         pad0x3_EPDCG[0x3];                                 // 0x9(0x3)
};


// Size 0x8
struct EventReceiveChestOfRageComponentState
{
public:
	class ChestOfRageComponent*                                  Source;                                            // 0x0(0x8)
};


// Size 0x8
struct ChestOfRageDamageTableEntry
{
public:
	byte                                                         Reason;                                            // 0x0(0x1)
	char                                                         pad0x3_9F73I[0x3];                                 // 0x1(0x3)
	float                                                        TimeToAdd;                                         // 0x4(0x4)
};


// Size 0x10
struct ClothingLoadout
{
public:
	TArray<class Class*>                                         Items;                                             // 0x0(0x10)
};


// Size 0x10
struct ClothingChestRandomFilter
{
public:
	class UClass*                                                Category;                                          // 0x0(0x8)
	float                                                        Likelihood;                                        // 0x8(0x4)
	char                                                         pad0x4_TIOPU[0x4];                                 // 0xc(0x4)
};


// Size 0x18
struct ClothingLoadoutContainer
{
public:
	struct ClothingLoadout                                       Loadout;                                           // 0x0(0x10)
	bool                                                         HasBeenSet;                                        // 0x10(0x1)
	char                                                         pad0x7_CRM7G[0x7];                                 // 0x11(0x7)
};


// Size 0x50
struct CoastObject
{
public:
	class SplineComponent*                                       CoastSplineInternal;                               // 0x0(0x8)
	class SplineComponent*                                       InnerSplineInternal;                               // 0x8(0x8)
	struct Vector                                                SplineOrigin;                                      // 0x10(0xc)
	float                                                        CoastalLookupSquaredDistance;                      // 0x1c(0x4)
	char                                                         pad0x30_Y3L9L[0x30];                               // 0x20(0x30)
};


// Size 0x18
struct HUDBlur
{
public:
	class MaterialParameterCollectionInstance*                   ScreenEffectsMaterialParameterCollectionInstance;  // 0x0(0x8)
	char                                                         pad0x10_UHSLW[0x10];                               // 0x8(0x10)
};


// Size 0x18
struct HUDBlurParams
{
public:
	class MaterialParameterCollection*                           ScreenEffectsMaterialParameterCollection;          // 0x0(0x8)
	struct HUDBlurSourceParams                                   MenuBlurParams;                                    // 0x8(0x8)
	struct HUDBlurSourceParams                                   MigrationBlurParams;                               // 0x10(0x8)
};


// Size 0x8
struct HUDBlurSourceParams
{
public:
	float                                                        SecondsToFullyBlur;                                // 0x0(0x4)
	float                                                        SecondsToFullyUnblur;                              // 0x4(0x4)
};


// Size 0x98
struct HttpClientComponentRequestEvent
{
public:
	struct FString                                               Uri;                                               // 0x0(0x10)
	struct FString                                               Body;                                              // 0x10(0x10)
	bool                                                         ShouldEncrypt;                                     // 0x20(0x1)
	bool                                                         ShouldAuthorize;                                   // 0x21(0x1)
	char                                                         pad0x6_PSU9A[0x6];                                 // 0x22(0x6)
	struct FString                                               Method;                                            // 0x28(0x10)
	struct FString                                               Id;                                                // 0x88(0x10)
};


// Size 0x28
struct HttpClientComponentResponseEvent
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
	char                                                         pad0x7_1WOHN[0x7];                                 // 0x1(0x7)
	struct FString                                               Body;                                              // 0x8(0x10)
	struct FString                                               Id;                                                // 0x18(0x10)
};


// Size 0x30
struct PlayerTalkingSettings
{
public:
	struct LinearColor                                           IconTint;                                          // 0x0(0x10)
	class Texture2D*                                             Icon;                                              // 0x10(0x8)
	float                                                        ScreenEdgePadding;                                 // 0x18(0x4)
	float                                                        Scale;                                             // 0x1c(0x4)
	float                                                        FadeInTimeInSeconds;                               // 0x20(0x4)
	char                                                         pad0xc_MBCTV[0xc];                                 // 0x24(0xc)
};


// Size 0x78
struct UpdateShipPreviewWorldEvent
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	TArray<class Class*>                                         ShipCustomizationClasses;                          // 0x8(0x10)
	struct ShipPersistenceModel                                  DamageState;                                       // 0x18(0x50)
	struct FString                                               Name;                                              // 0x68(0x10)
};


// Size 0x50
struct ShipPersistenceModel
{
public:
	TArray<struct ShipPartDamagePersistenceModel>                PartDamagePersistenceModels;                       // 0x0(0x10)
	struct HullDamagePersistenceModel                            HullDamageModel;                                   // 0x10(0x10)
	struct HullCharringPersistenceModel                          HullCharringModel;                                 // 0x20(0x18)
	struct MapTablePersistenceModel                              MapTablePersistenceModel;                          // 0x38(0x10)
	struct ShipInternalWaterPersistenceModel                     InternalWaterModel;                                // 0x48(0x4)
	char                                                         pad0x4_7RP3I[0x4];                                 // 0x4c(0x4)
};


// Size 0x1
struct PersistenceModel
{
public:
	char                                                         pad0x1_NYCUQ[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct ShipInternalWaterPersistenceModel
{
public:
	float                                                        InternalWaterLevel;                                // 0x0(0x4)
};


// Size 0x10
struct MapTablePersistenceModel
{
public:
	TArray<struct Vector2D>                                      MapPins;                                           // 0x0(0x10)
};


// Size 0x1
struct ShipPreviewFailedEvent
{
public:
	char                                                         pad0x1_9SY0W[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct CachingOfShipPreviewLoadoutsCompleteEvent
{
public:
	char                                                         pad0x1_RK1UN[0x1];                                 // 0x0(0x1)
};


// Size 0x60
struct RequestCachingOfShipPreviewLoadoutsEvent
{
public:
	TArray<Str Ids>                                              Ids;                                               // 0x0(0x10)
	TArray<Str Names>                                            Names;                                             // 0x10(0x10)
	TArray<Str DamageStates>                                     DamageStates;                                      // 0x20(0x10)
	TArray<Str OwnerUserIds>                                     OwnerUserIds;                                      // 0x30(0x10)
	TArray<Str OwnerPirateIds>                                   OwnerPirateIds;                                    // 0x40(0x10)
	TArray<Str Signatures>                                       Signatures;                                        // 0x50(0x10)
};


// Size 0x80
struct CachedShipLoadout
{
public:
	struct Guid                                                  ShipId;                                            // 0x0(0x10)
	struct FString                                               Name;                                              // 0x10(0x10)
	TArray<struct ShipPartCustomizationModel>                    ShipPartCustomisations;                            // 0x20(0x10)
	struct ShipPersistenceModel                                  DamageState;                                       // 0x30(0x50)
};


// Size 0x8
struct ShipPartCustomizationModel
{
public:
	struct FName                                                 EntitlementId;                                     // 0x0(0x8)
};


// Size 0x30
struct ShipPreviewData
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
	struct FString                                               Name;                                              // 0x10(0x10)
	struct FString                                               DamageState;                                       // 0x20(0x10)
};


// Size 0x20
struct RequestShipPreviewUpdateEvent
{
public:
	struct FString                                               ShipId;                                            // 0x0(0x10)
	struct FString                                               ShipType;                                          // 0x10(0x10)
};


// Size 0x1
struct ShipPreviewLoadingEvent
{
public:
	char                                                         pad0x1_TQBJW[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ShipPreviewLoadedEvent
{
public:
	char                                                         pad0x1_W36KC[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct ShipPreviewCreatedEvent
{
public:
	struct FString                                               PreviewURL;                                        // 0x0(0x10)
};


// Size 0x1
struct RequestDestroyShipPreviewEvent
{
public:
	char                                                         pad0x1_K0ZNT[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct RequestCreateShipPreviewEvent
{
public:
	int                                                          ResolutionX;                                       // 0x0(0x4)
	int                                                          ResolutionY;                                       // 0x4(0x4)
};


// Size 0x18
struct CoherentToWwiseEventDataAssetEntry
{
public:
	struct FString                                               CueKey;                                            // 0x0(0x10)
	class WwiseEvent*                                            AudioEvent;                                        // 0x10(0x8)
};


// Size 0x128
struct AmmoUI
{
public:
	char                                                         pad0x18_QTJH2[0x18];                               // 0x0(0x18)
	class Pawn*                                                  TargetPawn;                                        // 0x18(0x8)
	char                                                         pad0x108_L4JOB[0x108];                             // 0x20(0x108)
};


// Size 0x1b0
struct HealthUI
{
public:
	float                                                        MinVisibleHealth;                                  // 0x0(0x4)
	float                                                        ContinuousTimePerUpdate;                           // 0x4(0x4)
	char                                                         pad0x18_5DJSJ[0x18];                               // 0x8(0x18)
	class Pawn*                                                  TargetPawn;                                        // 0x20(0x8)
	char                                                         pad0x188_ZD592[0x188];                             // 0x28(0x188)
};


// Size 0x10
struct PlayerNewDistinctionLevelEvent
{
public:
	char                                                         pad0x8_DOYT0[0x8];                                 // 0x0(0x8)
	struct FName                                                 CompanyId;                                         // 0x8(0x8)
};


// Size 0x10
struct PlayerNewLevelEvent
{
public:
	char                                                         pad0x8_8VUOS[0x8];                                 // 0x0(0x8)
	struct FName                                                 CompanyId;                                         // 0x8(0x8)
};


// Size 0x10
struct EventCompanyRankProgressUpdateNotification
{
public:
	struct FName                                                 Company;                                           // 0x0(0x8)
	char                                                         pad0x8_DITEZ[0x8];                                 // 0x8(0x8)
};


// Size 0x1
struct PlayerCompanyProgressUpdatedEvent
{
public:
	char                                                         pad0x1_EO5WH[0x1];                                 // 0x0(0x1)
};


// Size 0x60
struct EventCompanyProgressUpdateNotification
{
public:
	struct CompanyReputationProgressModel                        CurrentProgress;                                   // 0x0(0x30)
	struct CompanyReputationProgressModel                        PreviousProgress;                                  // 0x30(0x30)
};


// Size 0x30
struct CompanyReputationProgressModel
{
public:
	struct FName                                                 CompanyId;                                         // 0x0(0x8)
	struct CompanyLevelDefinition                                NextCompanyLevel;                                  // 0x14(0x8)
	char                                                         pad0x4_41AXR[0x4];                                 // 0x1c(0x4)
	struct FString                                               Sig;                                               // 0x20(0x10)
};


// Size 0x8
struct CompanyLevelDefinition
{
public:
	char                                                         pad0x8_QC5XR[0x8];                                 // 0x0(0x8)
};


// Size 0x18
struct ShopDescOverride
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	char                                                         pad0x4_R38BD[0x4];                                 // 0xc(0x4)
	class ShopDesc*                                              ShopDesc;                                          // 0x10(0x8)
};


// Size 0x10
struct AssociatedCompanies
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	struct FName                                                 FeatureToggle;                                     // 0x8(0x8)
};


// Size 0x20
struct MultiShopResponse
{
public:
	byte                                                         ShopType;                                          // 0x0(0x1)
	char                                                         pad0x7_XFYS3[0x7];                                 // 0x1(0x7)
	class ShopDesc*                                              ShopDesc;                                          // 0x8(0x8)
	TArray<struct MultiShopResponsePerNPCEntry>                  PerNPCShopDescs;                                   // 0x10(0x10)
};


// Size 0x10
struct MultiShopResponsePerNPCEntry
{
public:
	struct FName                                                 NPCName;                                           // 0x0(0x8)
	class ShopDesc*                                              ShopDesc;                                          // 0x8(0x8)
};


// Size 0x18
struct FeatureToggledPremiumCatalog
{
public:
	struct FeatureFlag                                           FeatureToggle;                                     // 0x0(0xc)
	char                                                         pad0x4_LE7ZG[0x4];                                 // 0xc(0x4)
	class PremiumCatalogDataAsset*                               PremiumCatalog;                                    // 0x10(0x8)
};


// Size 0x30
struct CatalogDescTab
{
public:
	struct StringAssetReference                                  FilterIcon;                                        // 0x0(0x10)
	class CatalogDataAsset*                                      Catalog;                                           // 0x10(0x8)
	TArray<struct CatalogDescTabCatalogOverrides>                CatalogOverrides;                                  // 0x18(0x10)
	struct ShopCatalogDesc                                       CatalogData;                                       // 0x28(0x1)
	char                                                         pad0x7_BLYKT[0x7];                                 // 0x29(0x7)
};


// Size 0x1
struct ShopCatalogDesc
{
public:
	byte                                                         CurrencyType;                                      // 0x0(0x1)
};


// Size 0x28
struct CatalogDescTabCatalogOverrides
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	char                                                         pad0x4_BSX92[0x4];                                 // 0xc(0x4)
	TArray<struct FName>                                         RequiredCampaigns;                                 // 0x10(0x10)
	class CatalogDataAsset*                                      Catalog;                                           // 0x20(0x8)
};


// Size 0x10
struct CompanyValidationAssetUnit
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	bool                                                         ShouldHaveLevels;                                  // 0x8(0x1)
	bool                                                         ShouldHaveEmblems;                                 // 0x9(0x1)
	char                                                         pad0x6_X9LRQ[0x6];                                 // 0xa(0x6)
};


// Size 0x18
struct ConstellationAudioPair
{
public:
	class UClass*                                                ConstellationClass;                                // 0x0(0x8)
	class WwiseEvent*                                            AudioStartEvent;                                   // 0x8(0x8)
	class WwiseEvent*                                            AudioStopEvent;                                    // 0x10(0x8)
};


// Size 0x18
struct NPCPurchaseList
{
public:
	class Actor*                                                 NPC;                                               // 0x0(0x8)
	TArray<class Class*>                                         Items;                                             // 0x8(0x10)
};


// Size 0x10
struct RegisterCeremonyInterface
{
public:
	char                                                         pad0x10_ZKCHY[0x10];                               // 0x0(0x10)
};


// Size 0x98
struct ContestCeremonyEvent
{
public:
	TArray<class WwiseEvent*>                                    AudioEvents;                                       // 0x0(0x10)
	TArray<Byte SpecialEvents>                                   SpecialEvents;                                     // 0x10(0x10)
	struct FText                                                 NPCName;                                           // 0x20(0x38)
	struct FText                                                 NPCMessageToAllPlayers;                            // 0x58(0x38)
	float                                                        TimeToEvent;                                       // 0x90(0x4)
	char                                                         pad0x4_S9JHJ[0x4];                                 // 0x94(0x4)
};


// Size 0x18
struct ContestEventSet
{
public:
	TArray<struct ContestCeremonyEvent>                          Events;                                            // 0x0(0x10)
	byte                                                         BelongingStage;                                    // 0x10(0x1)
	byte                                                         StageTimePivot;                                    // 0x11(0x1)
	char                                                         pad0x6_RB80W[0x6];                                 // 0x12(0x6)
};


// Size 0x180
struct ShipIdentityOwnership
{
public:
	struct Guid                                                  OwningCrewID;                                      // 0x0(0x10)
	struct ShipLiveryCatalogueEntry                              Identity;                                          // 0x10(0x170)
};


// Size 0x170
struct ShipLiveryCatalogueEntry
{
public:
	struct Guid                                                  Id;                                                // 0x0(0x10)
	struct StringAssetReference                                  Desc;                                              // 0x10(0x10)
	struct StringAssetReference                                  RowboatLiveryDesc;                                 // 0x20(0x10)
	TArray<struct FText>                                         Names;                                             // 0x30(0x10)
	class UClass*                                                ShipSize;                                          // 0x40(0x8)
	bool                                                         AvailableToGame;                                   // 0x48(0x1)
	char                                                         pad0x3_P424P[0x3];                                 // 0x49(0x3)
	struct FName                                                 FeatureName;                                       // 0x4c(0x8)
	char                                                         pad0x4_UJ9SI[0x4];                                 // 0x54(0x4)
	struct FText                                                 ShipTeamName;                                      // 0x58(0x38)
	struct FText                                                 ArenaCrewWelcomeMessage;                           // 0x90(0x38)
	struct FText                                                 ShipUINotificationTeamName;                        // 0xc8(0x38)
	class Texture*                                               ShipScrollTeamIcon;                                // 0x100(0x8)
	struct StringAssetReference                                  ShipToastTeamIcon;                                 // 0x108(0x10)
	struct StringAssetReference                                  ShipToastTeamBackgroundImage;                      // 0x118(0x10)
	struct StringAssetReference                                  ShipToastForegroundArtWork;                        // 0x128(0x10)
	struct StringAssetReference                                  ShipTeamBackgroundImage;                           // 0x138(0x10)
	struct FName                                                 AudioEventName;                                    // 0x148(0x8)
	struct StringAssetReference                                  TeamTavernBannerTexture;                           // 0x150(0x10)
	class Texture*                                               CrewLiveryOverlayIcon;                             // 0x160(0x8)
	bool                                                         AvailableWhenFeatureEnabled;                       // 0x168(0x1)
	bool                                                         AvailableWhenFeatureDisabled;                      // 0x169(0x1)
	char                                                         pad0x6_OLXM4[0x6];                                 // 0x16a(0x6)
};


// Size 0x10
struct ShipLiveryCatalogue
{
public:
	TArray<struct ShipLiveryCatalogueEntry>                      Liveries;                                          // 0x0(0x10)
};


// Size 0x20
struct OwnedCrewCostumes
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	TArray<Assetclass Costumes>                                  Costumes;                                          // 0x10(0x10)
};


// Size 0x8
struct CaptureChatPerformanceTelemetryFragment
{
public:
	char                                                         pad0x8_8A8ER[0x8];                                 // 0x0(0x8)
};


// Size 0xe8
struct TimedContestEventAction
{
public:
	char                                                         pad0x8_RYCNL[0x8];                                 // 0x0(0x8)
	struct FText                                                 NPCName;                                           // 0x8(0x38)
	struct FText                                                 NPCMessageToAllPlayers;                            // 0x40(0x38)
	float                                                        Duration;                                          // 0x78(0x4)
	char                                                         pad0x4_2BCWG[0x4];                                 // 0x7c(0x4)
	TArray<Byte SpecialEvents>                                   SpecialEvents;                                     // 0x80(0x10)
	TArray<class WwiseEvent*>                                    AudioEvents;                                       // 0x90(0x10)
	char                                                         pad0x48_X0R02[0x48];                               // 0xa0(0x48)
};


// Size 0x70
struct ContestMapLayoutScoreInfo
{
public:
	struct TreasureMapWidgetTexture                              ScoreInfoIcon;                                     // 0x0(0x30)
	struct TreasureMapWidgetText                                 ScoreInfoText;                                     // 0x30(0x3c)
	byte                                                         ScoreReason;                                       // 0x6c(0x1)
	char                                                         pad0x3_T907A[0x3];                                 // 0x6d(0x3)
};


// Size 0x108
struct ContestMapLayoutCrew
{
public:
	struct TreasureMapWidgetTexture                              CrewIcon;                                          // 0x0(0x30)
	struct TreasureMapWidgetTexture                              ScoreIcon;                                         // 0x30(0x30)
	struct TreasureMapWidgetTexture                              UnderlineIcon;                                     // 0x60(0x30)
	struct TreasureMapWidgetText                                 CrewName;                                          // 0x90(0x3c)
	struct TreasureMapWidgetText                                 Score;                                             // 0xcc(0x3c)
};


// Size 0x50
struct MerchantSpawnData
{
public:
	char                                                         pad0x20_6V327[0x20];                               // 0x0(0x20)
	struct Transform                                             MerchantTransform;                                 // 0x20(0x30)
};


// Size 0x30
struct QuestVariableContestIslandArchetype
{
public:
	char                                                         pad0x30_DLFI7[0x30];                               // 0x0(0x30)
};


// Size 0x28
struct ContestCrewRequirementData
{
public:
	int                                                          CrewCount;                                         // 0x0(0x4)
	char                                                         pad0x4_7YKXE[0x4];                                 // 0x4(0x4)
	struct FString                                               CrewCountServicesConfigRetrievalString;            // 0x8(0x10)
	TArray<struct ShipSizeRequirementData>                       OpenCrewRequirementData;                           // 0x18(0x10)
};


// Size 0x20
struct ShipSizeRequirementData
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	int                                                          OpenCrewMemberCount;                               // 0x8(0x4)
	char                                                         pad0x4_A3OVQ[0x4];                                 // 0xc(0x4)
	struct FString                                               OpenCrewCountRetrivalString;                       // 0x10(0x10)
};


// Size 0x80
struct ContestUIDescriptions
{
public:
	class PopUpMessageDesc*                                      NewMapDesc;                                        // 0x0(0x8)
	class PopUpMessageDesc*                                      ShipSunkDesc;                                      // 0x8(0x8)
	struct FText                                                 ContestStartBlindText;                             // 0x10(0x38)
	struct FText                                                 ContestEndBlindText;                               // 0x48(0x38)
};


// Size 0x10
struct ShipLiveryTeamSet
{
public:
	TArray<struct ShipLiveryCatalogueEntry>                      ShipCatalogue;                                     // 0x0(0x10)
};


// Size 0x60
struct ContestShipLiverySet
{
public:
	struct Guid                                                  OwningCrewID;                                      // 0x0(0x10)
	char                                                         pad0x50_JEHDT[0x50];                               // 0x10(0x50)
};


// Size 0x1
struct OtherCrewMuteStateResponse
{
public:
	byte                                                         MuteState;                                         // 0x0(0x1)
};


// Size 0x1
struct OtherCrewMuteStateRequest
{
public:
	char                                                         pad0x1_UDPGB[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct CrewMuteOthersPhrasesEvent
{
public:
	bool                                                         IsMuted;                                           // 0x0(0x1)
};


// Size 0x18
struct CrewMutePlayerPhrasesEvent
{
public:
	struct FString                                               XUID;                                              // 0x0(0x10)
	bool                                                         IsMuted;                                           // 0x10(0x1)
	char                                                         pad0x7_INSQ4[0x7];                                 // 0x11(0x7)
};


// Size 0x1
struct CrewMuteOthersChatEvent
{
public:
	bool                                                         IsMuted;                                           // 0x0(0x1)
};


// Size 0x18
struct CrewMutePlayerChatEvent
{
public:
	struct FString                                               XUID;                                              // 0x0(0x10)
	bool                                                         IsMuted;                                           // 0x10(0x1)
	char                                                         pad0x7_C54IT[0x7];                                 // 0x11(0x7)
};


// Size 0x1
struct CrewMuteOthersVoiceEvent
{
public:
	bool                                                         IsMuted;                                           // 0x0(0x1)
};


// Size 0x18
struct CrewMutePlayerVoiceEvent
{
public:
	struct FString                                               XUID;                                              // 0x0(0x10)
	bool                                                         IsMuted;                                           // 0x10(0x1)
	char                                                         pad0x7_AKAXU[0x7];                                 // 0x11(0x7)
};


// Size 0x10
struct ContestCrewManagementMemberDataEvent
{
public:
	TArray<struct ContestCrewManagementMemberData>               Members;                                           // 0x0(0x10)
};


// Size 0x38
struct ContestCrewManagementMemberData
{
public:
	struct FString                                               XUID;                                              // 0x0(0x10)
	struct FString                                               GamerTag;                                          // 0x10(0x10)
	byte                                                         Muted;                                             // 0x20(0x1)
	char                                                         pad0x7_A48YP[0x7];                                 // 0x21(0x7)
	struct FString                                               CrewIcon;                                          // 0x28(0x10)
};


// Size 0x1
struct ContestStopCrewManagementEvent
{
public:
	char                                                         pad0x1_OG8ED[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ContestRequestCrewManagementEvent
{
public:
	char                                                         pad0x1_86R9O[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct ContestUpdateScoreBoardTimer
{
public:
	struct FString                                               TimeRemaining;                                     // 0x0(0x10)
};


// Size 0x28
struct ContestLaunchStartBlinds
{
public:
	char                                                         pad0x10_164ZT[0x10];                               // 0x0(0x10)
	struct Guid                                                  CrewId;                                            // 0x10(0x10)
	float                                                        DisplayDuration;                                   // 0x20(0x4)
	char                                                         pad0x4_4PE14[0x4];                                 // 0x24(0x4)
};


// Size 0x20
struct StagingPlayerWelcomingPopup
{
public:
	char                                                         pad0x10_XSM8R[0x10];                               // 0x0(0x10)
	struct Guid                                                  LiveryID;                                          // 0x10(0x10)
};


// Size 0x20
struct ContestShipSinkNetworkEvent
{
public:
	char                                                         pad0x10_RI262[0x10];                               // 0x0(0x10)
	struct Guid                                                  CrewLiveryId;                                      // 0x10(0x10)
};


// Size 0x30
struct ContestEndEvent
{
public:
	int                                                          Position;                                          // 0x0(0x4)
	char                                                         pad0x4_3KTIA[0x4];                                 // 0x4(0x4)
	struct FString                                               Message;                                           // 0x8(0x10)
	TArray<struct ScoreboardItems>                               Scores;                                            // 0x18(0x10)
	float                                                        HoldDuration;                                      // 0x28(0x4)
	char                                                         pad0x4_I0H25[0x4];                                 // 0x2c(0x4)
};


// Size 0x38
struct ScoreboardItems
{
public:
	struct FString                                               Icon;                                              // 0x0(0x10)
	struct FString                                               CrewName;                                          // 0x10(0x10)
	struct FString                                               Score;                                             // 0x20(0x10)
	bool                                                         IsMyCrew;                                          // 0x30(0x1)
	char                                                         pad0x7_IOCBJ[0x7];                                 // 0x31(0x7)
};


// Size 0x48
struct ContestStartEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
	struct FString                                               CrewIcon;                                          // 0x10(0x10)
	struct FString                                               CrewName;                                          // 0x20(0x10)
	TArray<Str CrewMembers>                                      CrewMembers;                                       // 0x30(0x10)
	float                                                        HoldDuration;                                      // 0x40(0x4)
	char                                                         pad0x4_TW48V[0x4];                                 // 0x44(0x4)
};


// Size 0x18
struct ContestNotificationNetworkEvent
{
public:
	char                                                         pad0x10_JWLSV[0x10];                               // 0x0(0x10)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x10(0x8)
};


// Size 0x10
struct ContestRequestScoreBoardData
{
public:
	char                                                         pad0x10_3J26T[0x10];                               // 0x0(0x10)
};


// Size 0x10
struct RequestContestStateEvent
{
public:
	char                                                         pad0x10_QDWU9[0x10];                               // 0x0(0x10)
};


// Size 0x18
struct ContestStateChangedEvent
{
public:
	char                                                         pad0x10_CIKR5[0x10];                               // 0x0(0x10)
	byte                                                         ContestState;                                      // 0x10(0x1)
	char                                                         pad0x7_T0A9J[0x7];                                 // 0x11(0x7)
};


// Size 0x20
struct UpdateScoreBalanceHUDEvent
{
public:
	char                                                         pad0x10_U0GEV[0x10];                               // 0x0(0x10)
	TArray<struct ContestLeaderboardEntry>                       ContestLeaderboard;                                // 0x10(0x10)
};


// Size 0x38
struct ContestLeaderboardEntry
{
public:
	char                                                         pad0x10_SQMJE[0x10];                               // 0x0(0x10)
	struct FString                                               CrewIconPath;                                      // 0x10(0x10)
	bool                                                         IsMyCrew;                                          // 0x20(0x1)
	char                                                         pad0x3_ACY2O[0x3];                                 // 0x21(0x3)
	int                                                          Amount;                                            // 0x24(0x4)
	struct FString                                               DisplayAmount;                                     // 0x28(0x10)
};


// Size 0x30
struct ScoreGrantedNotificationUIEvent
{
public:
	byte                                                         ScoreId;                                           // 0x0(0x1)
	char                                                         pad0x7_TO90G[0x7];                                 // 0x1(0x7)
	struct FString                                               DisplayAmount;                                     // 0x8(0x10)
	int                                                          Amount;                                            // 0x18(0x4)
	char                                                         pad0x4_M4GZA[0x4];                                 // 0x1c(0x4)
	struct FString                                               ScoringIconPath;                                   // 0x20(0x10)
};


// Size 0x28
struct WeightedContestList
{
public:
	char                                                         pad0x8_2FPFP[0x8];                                 // 0x0(0x8)
	TArray<struct WeightedEmergentContestVoyageRecipe>           WeightedContests;                                  // 0x8(0x10)
	TArray<struct WeightedTallTaleContestRecipe>                 WeightedTallTaleContests;                          // 0x18(0x10)
};


// Size 0x10
struct WeightedTallTaleContestRecipe
{
public:
	class TallTaleContestRecipeDataAsset*                        TallTaleContest;                                   // 0x0(0x8)
	int                                                          WeightedChance;                                    // 0x8(0x4)
	char                                                         pad0x4_XVG4G[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct WeightedEmergentContestVoyageRecipe
{
public:
	class EmergentContestVoyageRecipeDataAsset*                  ContestVoyage;                                     // 0x0(0x8)
	int                                                          WeightedChance;                                    // 0x8(0x4)
	char                                                         pad0x4_M1GNJ[0x4];                                 // 0xc(0x4)
};


// Size 0x20
struct TallTaleContestInfo
{
public:
	TArray<class Class*>                                         ValidShipTypes;                                    // 0x0(0x10)
	struct WeightedTallTaleContestRecipe                         WeightedTallTaleContest;                           // 0x10(0x10)
};


// Size 0x20
struct ContestVoyageInfo
{
public:
	TArray<class Class*>                                         ValidShipTypes;                                    // 0x0(0x10)
	struct WeightedEmergentContestVoyageRecipe                   WeightedContestVoyage;                             // 0x10(0x10)
};


// Size 0x10
struct ContestVoyagesSelectorUnit
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x0(0x8)
	class ContestVoyagesDataAsset*                               ContestVoyages;                                    // 0x8(0x8)
};


// Size 0x50
struct CachedRespawnPoint
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct Transform                                             AllocatedRespawnPoint;                             // 0x10(0x30)
	class ShipSpawnLocation*                                     AllocatedSpawnLocation;                            // 0x40(0x8)
	char                                                         pad0x8_YTTF5[0x8];                                 // 0x48(0x8)
};


// Size 0x50
struct ContestZoneVendorShipData
{
public:
	char                                                         pad0x20_QEZ2Q[0x20];                               // 0x0(0x20)
	struct Transform                                             ContestZoneWorldLocation;                          // 0x20(0x30)
};


// Size 0xc0
struct CoordinatedKrakenTentacleSpawnInfo
{
public:
	struct Transform                                             SpawnTransform;                                    // 0x0(0x30)
	struct Transform                                             FinalSpawnTransform;                               // 0x30(0x30)
	int                                                          ClientCapsuleCullCount;                            // 0x60(0x4)
	bool                                                         ShouldDockToTargetActor;                           // 0x64(0x1)
	bool                                                         RequiresBoxCollider;                               // 0x65(0x1)
	bool                                                         RequiresKnockback;                                 // 0x66(0x1)
	char                                                         pad0x1_VQEMX[0x1];                                 // 0x67(0x1)
	struct Vector                                                BoxExtents;                                        // 0x68(0xc)
	char                                                         pad0xc_GH15P[0xc];                                 // 0x74(0xc)
	struct Transform                                             BoxOffset;                                         // 0x80(0x30)
	char                                                         pad0x10_9802D[0x10];                               // 0xb0(0x10)
};


// Size 0x28
struct CrestPartDesc
{
public:
	struct StringAssetReference                                  CrestMesh;                                         // 0x0(0x10)
	TArray<class MaterialInterface*>                             CrestMaterials;                                    // 0x18(0x10)
};


// Size 0x10
struct ShipCustomizationLoadoutPartCustomizations
{
public:
	TArray<struct PartDesc>                                      Parts;                                             // 0x0(0x10)
};


// Size 0x20
struct PartDesc
{
public:
	struct FString                                               Name;                                              // 0x0(0x10)
	TArray<struct PartCustomisation>                             Customisations;                                    // 0x10(0x10)
};


// Size 0x20
struct PartCustomisation
{
public:
	struct FString                                               Category;                                          // 0x0(0x10)
	struct StringAssetReference                                  Customisation;                                     // 0x10(0x10)
};


// Size 0x4
struct SinkShipGameServerRequestModel
{
public:
	int                                                          ShipNetGUID;                                       // 0x0(0x4)
};


// Size 0xb8
struct CustomTriggerData
{
public:
	class TriggerBase*                                           TriggerObject;                                     // 0x0(0x8)
	bool                                                         DetectingPlayers;                                  // 0xa8(0x1)
	bool                                                         DetectingShips;                                    // 0xa9(0x1)
	bool                                                         DetectingEnemies;                                  // 0xaa(0x1)
	char                                                         pad0x5_Y5UQE[0x5];                                 // 0xab(0x5)
	class TriggerCollisionHelper*                                CollisionHelper;                                   // 0xb0(0x8)
};


// Size 0x10
struct CustomItemDetectionData
{
public:
	char                                                         pad0x10_WLO1A[0x10];                               // 0x0(0x10)
};


// Size 0x40
struct ObjectHitDetectedEvent
{
public:
	char                                                         pad0x40_ENC5K[0x40];                               // 0x0(0x40)
};


// Size 0x40
struct ProjectileLauncherMechanismSourceShipParams
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	struct ProjectileLauncherMechanismSourceWatercraftParams     Params;                                            // 0x8(0x38)
};


// Size 0x38
struct ProjectileLauncherMechanismSourceWatercraftParams
{
public:
	float                                                        ShipBoundsMultiplier;                              // 0x0(0x4)
	float                                                        NearMissChance;                                    // 0x4(0x4)
	struct WeightedProbabilityRangeOfRanges                      NearMissShipOffsetInMetres;                        // 0x8(0x30)
};


// Size 0x90
struct LevelOfDamageProperties
{
public:
	float                                                        LeakAmount;                                        // 0x0(0x4)
	float                                                        RepairTime;                                        // 0x4(0x4)
	float                                                        UndoRepairTime;                                    // 0x8(0x4)
	float                                                        NonOwningCrewUndoRepairTime;                       // 0xc(0x4)
	class MaterialInterface*                                     HoleDecalMaterial;                                 // 0x10(0x8)
	char                                                         pad0x8_PMX5Q[0x8];                                 // 0x18(0x8)
	struct Transform                                             HoleDecalComponentTransform;                       // 0x20(0x30)
	struct Vector                                                ParticleSystemComponentLocation;                   // 0x50(0xc)
	float                                                        InternalWaterSamplePositionTopOffset;              // 0x5c(0x4)
	float                                                        InternalWaterSamplePositionBottomOffset;           // 0x60(0x4)
	char                                                         pad0x4_QBKLS[0x4];                                 // 0x64(0x4)
	class ParticleSystem*                                        ParticleSystem_WaterLeakAboveWater;                // 0x68(0x8)
	class ParticleSystem*                                        ParticleSystem_WaterLeakBelowWater;                // 0x70(0x8)
	class ParticleSystem*                                        ParticleSystem_RepairLeakAboveWater;               // 0x78(0x8)
	class ParticleSystem*                                        ParticleSystem_RepairLeakBelowWater;               // 0x80(0x8)
	class ParticleSystem*                                        ParticleSystem_SplashOnInternalWaterSurface;       // 0x88(0x8)
};


// Size 0x18
struct AuthorityRepairableState
{
public:
	byte                                                         RepairableState;                                   // 0x0(0x1)
	char                                                         pad0x7_QYO2V[0x7];                                 // 0x1(0x7)
	TArray<Weakclass RepairingList>                              RepairingList;                                     // 0x8(0x10)
};


// Size 0x18
struct DeferralReasonPopUpNotificationInfo
{
public:
	struct FString                                               DeferralReason;                                    // 0x0(0x10)
	class PopUpMessageDesc*                                      PopUp;                                             // 0x10(0x8)
};


// Size 0x48
struct MultipleNPCCompaniesRedirectionData
{
public:
	TArray<class Class*>                                         Companies;                                         // 0x0(0x10)
	struct FText                                                 VisitNPCTooltip;                                   // 0x10(0x38)
};


// Size 0x40
struct SingleNPCCompanyRedirectionData
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	struct FText                                                 VisitNPCTooltip;                                   // 0x8(0x38)
};


// Size 0x18
struct ItemDiggingAnimationOverride
{
public:
	TArray<Assetclass Classes>                                   Classes;                                           // 0x0(0x10)
	class ItemDiggingAnimationConfig*                            DiggingAnimationConfig;                            // 0x10(0x8)
};


// Size 0x18
struct ItemDiggingAudioOverride
{
public:
	TArray<Assetclass Classes>                                   Classes;                                           // 0x0(0x10)
	class ItemDiggingAudioConfig*                                DiggingAudioConfig;                                // 0x10(0x8)
};


// Size 0x18
struct ItemDiggingBaseOverride
{
public:
	TArray<Assetclass Classes>                                   Classes;                                           // 0x0(0x10)
	class ItemDiggingBaseConfig*                                 DiggingBaseConfig;                                 // 0x10(0x8)
};


// Size 0x18
struct ItemBuryingBaseOverride
{
public:
	TArray<Assetclass Classes>                                   Classes;                                           // 0x0(0x10)
	class ItemDiggingBuryConfig*                                 BuryingConfig;                                     // 0x10(0x8)
};


// Size 0x18
struct ItemDiggingEffectsOverride
{
public:
	TArray<Assetclass Classes>                                   Classes;                                           // 0x0(0x10)
	class ItemDiggingEffectsConfig*                              DiggingEffectsConfig;                              // 0x10(0x8)
};


// Size 0x30
struct DioramaDebugMenuEntry
{
public:
	class AISpawner*                                             Spawner;                                           // 0x0(0x8)
	class AIDioramaDesc*                                         DioramaDesc;                                       // 0x8(0x8)
	struct FString                                               DioramaName;                                       // 0x10(0x10)
	struct FString                                               TaleId;                                            // 0x20(0x10)
};


// Size 0x8
struct DrapesPartDesc
{
public:
	class MaterialInterface*                                     DrapesMaterial;                                    // 0x0(0x8)
};


// Size 0x14
struct DrunkennessSetupData
{
public:
	byte                                                         DrunkennessType;                                   // 0x0(0x1)
	char                                                         pad0x3_S9OUV[0x3];                                 // 0x1(0x3)
	float                                                        MaxDrunkenness;                                    // 0x4(0x4)
	float                                                        GettingDrunkDrunkennessChangePerSec;               // 0x8(0x4)
	float                                                        SoberingUpDrunkennessChangePerSec;                 // 0xc(0x4)
	bool                                                         AutoSoberUpWhenFullyDrunk;                         // 0x10(0x1)
	char                                                         pad0x3_XXYAP[0x3];                                 // 0x11(0x3)
};


// Size 0x18
struct EmissaryRewardMultiplierModel
{
public:
	struct FName                                                 EmissaryName;                                      // 0x0(0x8)
	TArray<struct EmissaryLevelMultiplierModel>                  Multipliers;                                       // 0x8(0x10)
};


// Size 0x8
struct EmissaryLevelMultiplierModel
{
public:
	int                                                          Level;                                             // 0x0(0x4)
	float                                                        Multiplier;                                        // 0x4(0x4)
};


// Size 0x90
struct EmissaryDisplayInformation
{
public:
	struct FText                                                 Title;                                             // 0x0(0x38)
	struct FText                                                 Description;                                       // 0x38(0x38)
	struct StringAssetReference                                  KeyArt;                                            // 0x70(0x10)
	struct StringAssetReference                                  Icon;                                              // 0x80(0x10)
};


// Size 0xc8
struct EmoteFlourishCategoryMapping
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	struct StringAssetReference                                  IconPath;                                          // 0x8(0x10)
	struct EmoteData                                             EmoteData;                                         // 0x18(0xa0)
	struct FString                                               PairName;                                          // 0xb8(0x10)
};


// Size 0x10
struct EntitlementsFailedEvent
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
};


// Size 0x20
struct EntitlementsResponseEvent
{
public:
	TArray<struct EntitlementItem>                               Entitlements;                                      // 0x0(0x10)
	struct FString                                               Id;                                                // 0x10(0x10)
};


// Size 0xa8
struct EntitlementItem
{
public:
	struct FText                                                 Description;                                       // 0x0(0x38)
	bool                                                         Owned;                                             // 0x38(0x1)
	char                                                         pad0x7_K7ACZ[0x7];                                 // 0x39(0x7)
	struct StringAssetReference                                  PreviewImageUrl;                                   // 0x40(0x10)
	struct StringAssetReference                                  ThumbnailImageUrl;                                 // 0x50(0x10)
	struct FText                                                 DisplayName;                                       // 0x60(0x38)
	struct FString                                               Id;                                                // 0x98(0x10)
};


// Size 0x20
struct EntitlementsRequestEvent
{
public:
	TArray<Str EntitlementIds>                                   EntitlementIds;                                    // 0x0(0x10)
	struct FString                                               Id;                                                // 0x10(0x10)
};


// Size 0x18
struct RequiredClothingData
{
public:
	int                                                          RequiredNumberToMatch;                             // 0x0(0x4)
	char                                                         pad0x4_ZZDE9[0x4];                                 // 0x4(0x4)
	TArray<class Class*>                                         RequiredClothing;                                  // 0x8(0x10)
};


// Size 0x18
struct ItemRequirementData
{
public:
	int                                                          RequiredNumberToMatch;                             // 0x0(0x4)
	char                                                         pad0x4_WU9NQ[0x4];                                 // 0x4(0x4)
	TArray<class Class*>                                         RequiredItemsInLoadout;                            // 0x8(0x10)
};


// Size 0x18
struct EventTaleQuestServiceEntry
{
public:
	char                                                         pad0x18_9K87V[0x18];                               // 0x0(0x18)
};


// Size 0x10
struct EventObjectStateMigrationImpl
{
public:
	char                                                         pad0x10_R3W62[0x10];                               // 0x0(0x10)
};


// Size 0x8
struct EventReceiveExplosiveComponentState
{
public:
	class ExplosiveComponent*                                    Source;                                            // 0x0(0x8)
};


// Size 0x10
struct ShipHullDamageParams
{
public:
	TArray<struct ShipHullDamageLevel>                           DamageLevels;                                      // 0x0(0x10)
};


// Size 0x18
struct ShipHullDamageLevel
{
public:
	class UClass*                                                SpeedBand;                                         // 0x0(0x8)
	TArray<struct ShipHullDamageTypeEntry>                       Params;                                            // 0x8(0x10)
};


// Size 0x48
struct ShipHullDamageTypeEntry
{
public:
	byte                                                         DamageType;                                        // 0x0(0x1)
	char                                                         pad0x7_4SIQY[0x7];                                 // 0x1(0x7)
	struct ShipHullLandscapeDamageEntry                          LandscapeDamageParams;                             // 0x8(0x30)
	struct ShipHullRammingSpurDamageEntry                        RammingSpurDamageParams;                           // 0x38(0x10)
};


// Size 0x10
struct ShipHullRammingSpurDamageEntry
{
public:
	TArray<struct ShipDamageEntry>                               DamageAppliedToSelf;                               // 0x0(0x10)
};


// Size 0x50
struct ShipDamageEntry
{
public:
	class UClass*                                                OtherShipSize;                                     // 0x0(0x8)
	class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x8(0x8)
	struct Int32Range                                            NumZonesToDamageForInstigator;                     // 0x10(0x10)
	struct Int32Range                                            DamageLevelForInstigator;                          // 0x20(0x10)
	struct Int32Range                                            NumZonesToDamageForReceiver;                       // 0x30(0x10)
	struct Int32Range                                            DamageLevelForReceiver;                            // 0x40(0x10)
};


// Size 0x30
struct ShipHullLandscapeDamageEntry
{
public:
	byte                                                         PhysicalSurface;                                   // 0x0(0x1)
	char                                                         pad0x7_2UUB7[0x7];                                 // 0x1(0x7)
	class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x8(0x8)
	struct Int32Range                                            NumZonesToDamage;                                  // 0x10(0x10)
	struct Int32Range                                            DamageLevel;                                       // 0x20(0x10)
};


// Size 0x10
struct RammableExplosiveEntry
{
public:
	class UClass*                                                RammerType;                                        // 0x0(0x8)
	class UClass*                                                MinimumSpeedForExplosion;                          // 0x8(0x8)
};


// Size 0x8
struct ChargedAttackProjectileWeights
{
public:
	float                                                        ChargeTime;                                        // 0x0(0x4)
	float                                                        Weight;                                            // 0x4(0x4)
};


// Size 0x30
struct QuestVariablePlayerStat
{
public:
	char                                                         pad0x30_IYFA1[0x30];                               // 0x0(0x30)
};


// Size 0x70
struct ClassicFireworkDebugList
{
public:
	TArray<class ItemDescSpawnData*>                             Peony;                                             // 0x0(0x10)
	TArray<class ItemDescSpawnData*>                             Crackle;                                           // 0x10(0x10)
	TArray<class ItemDescSpawnData*>                             Strobe;                                            // 0x20(0x10)
	TArray<class ItemDescSpawnData*>                             Brocade;                                           // 0x30(0x10)
	TArray<class ItemDescSpawnData*>                             Comet;                                             // 0x40(0x10)
