// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0
struct CharacterSocketCollisionResult
{
public:
	bool                                                         HasHit;                                            // 0x0(0x1)
	char                                                         pad0x3_DYKH9[0x3];                                 // 0x1(0x3)
	Struct HitResult                                             HitResult;                                         // 0x4(0x80)
	Struct Vector                                                SocketVelocity;                                    // 0x84(0xc)
	Struct Transform                                             SocketTransform;                                   // 0x90(0x30)
};


// Size 0xc
struct CharacterSocketCollisionHandle
{
public:
};


// Size 0x58
struct ImpactDamageEvent
{
public:
	Struct Guid                                                  AttackId;                                          // 0x0(0x10)
	class                                                        DamagerType;                                       // 0x10(0x8)
	Class Actor*                                                 DirectInstigator;                                  // 0x18(0x8)
	Class Actor*                                                 RootInstigator;                                    // 0x20(0x8)
	Struct Vector                                                Location;                                          // 0x28(0xc)
	Struct Vector                                                SurfaceNormal;                                     // 0x34(0xc)
	Struct Vector                                                Velocity;                                          // 0x40(0xc)
	float                                                        DamageAmount;                                      // 0x4c(0x4)
	int                                                          DamageSpread;                                      // 0x50(0x4)
	byte                                                         Reason;                                            // 0x54(0x1)
	bool                                                         DealFriendlyFireDamage;                            // 0x55(0x1)
};


// Size 0x50
struct ProjectileAim
{
public:
	Struct Vector                                                AimDirection;                                      // 0x0(0xc)
	Struct Vector                                                AimPosition;                                       // 0xc(0xc)
	Class PrimitiveComponent*                                    AimBase;                                           // 0x18(0x8)
	Struct Transform                                             AimBaseTransform;                                  // 0x20(0x30)
};


// Size 0x8
struct RewardId
{
public:
	struct FName                                                 RewardId;                                          // 0x0(0x8)
};


// Size 0x18
struct AchievementDefinition
{
public:
	struct FName                                                 DevCenterId;                                       // 0x0(0x8)
	TArray<struct UnlockCriteria>                                UnlockCriteria;                                    // 0x8(0x10)
};


// Size 0x18
struct AchievementCriteria
{
public:
	Struct PlayerStat                                            PlayerStat;                                        // 0x0(0x4)
	char                                                         pad0x4_LK8ZG[0x4];                                 // 0x4(0x4)
	byte                                                         Operator;                                          // 0x10(0x1)
};


// Size 0x4
struct PlayerStat
{
public:
};


// Size 0x18
struct FeatureToggledFogBankManagerAsset
{
public:
	Struct FeatureFlag                                           FeatureToggle;                                     // 0x0(0xc)
	char                                                         pad0x4_15CL6[0x4];                                 // 0xc(0x4)
	Class FogBankManagerDataAsset*                               Asset;                                             // 0x10(0x8)
};


// Size 0x10
struct FogBankManagerFogAvoidanceArea
{
public:
	Struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
};


// Size 0xc
struct WaterPuzzleWaterLevel
{
public:
	float                                                        WaterLevel;                                        // 0x0(0x4)
	float                                                        FillTransitionTime;                                // 0x4(0x4)
	float                                                        DrainTransitionTime;                               // 0x8(0x4)
};


// Size 0x8
struct WaterPuzzleRepData
{
public:
	int                                                          CurrentWaterLevelIndex;                            // 0x0(0x4)
	bool                                                         TransitionDueToReset;                              // 0x4(0x1)
};


// Size 0x20
struct AdventuresActorBundleInfo
{
public:
	Struct StringAssetReference                                  Actor;                                             // 0x0(0x10)
	TArray<struct Pages>                                         Pages;                                             // 0x10(0x10)
};


// Size 0x10
struct AudioEmitterParameters
{
public:
	Class WwiseObjectPoolWrapper*                                LocalEmitterPool;                                  // 0x0(0x8)
	Class WwiseObjectPoolWrapper*                                RemoteEmitterPool;                                 // 0x8(0x8)
};


// Size 0x68
struct WeaponProjectileEffectParams
{
public:
	bool                                                         ApplyStun;                                         // 0x0(0x1)
	char                                                         pad0x3_NNLTU[0x3];                                 // 0x1(0x3)
	float                                                        StunDuration;                                      // 0x4(0x4)
	bool                                                         ApplyKnockback;                                    // 0x8(0x1)
	char                                                         pad0x3_BN4GD[0x3];                                 // 0x9(0x3)
	Struct KnockBackInfo                                         KnockbackParams;                                   // 0xc(0x50)
	int                                                          MinimumHitProjectilesForKnockback;                 // 0x5c(0x4)
	float                                                        MaximumKnockbackDistance;                          // 0x60(0x4)
	bool                                                         EnableKnockbackFalloffOverDistance;                // 0x64(0x1)
};


// Size 0x50
struct KnockBackInfo
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	float                                                        HorizontalVelocity;                                // 0x8(0x4)
	float                                                        VerticalVelocity;                                  // 0xc(0x4)
	float                                                        MinHorizontalVelocity;                             // 0x10(0x4)
	float                                                        MinVerticalVelocity;                               // 0x14(0x4)
	float                                                        SwimmingVelocity;                                  // 0x18(0x4)
	float                                                        DockedHorizontalVelocity;                          // 0x1c(0x4)
	float                                                        DockedVerticalVelocity;                            // 0x20(0x4)
	bool                                                         UseDockedVelocitiesWhenDocked;                     // 0x24(0x1)
	char                                                         pad0x3_MQ5JB[0x3];                                 // 0x25(0x3)
	struct FName                                                 RumbleTag;                                         // 0x28(0x8)
	float                                                        StunDuration;                                      // 0x30(0x4)
	float                                                        AIKnockbackDistance;                               // 0x34(0x4)
	float                                                        AIKnockbackSpeed;                                  // 0x38(0x4)
	float                                                        AIKnockbackAcceleration;                           // 0x3c(0x4)
	byte                                                         AIKnockbackStrengthType;                           // 0x40(0x1)
	bool                                                         UseOverrideLaunchDirection;                        // 0x41(0x1)
	char                                                         pad0x2_KM78N[0x2];                                 // 0x42(0x2)
	Struct Vector                                                OverrideLaunchDirectionInWorldSpace;               // 0x44(0xc)
};


// Size 0xb0
struct WeaponProjectileParams
{
public:
	float                                                        Damage;                                            // 0x0(0x4)
	float                                                        DamageMultiplierAtMaximumRange;                    // 0x4(0x4)
	float                                                        LifeTime;                                          // 0x8(0x4)
	float                                                        TrailFadeOutTime;                                  // 0xc(0x4)
	float                                                        Velocity;                                          // 0x10(0x4)
	float                                                        TimeBeforeApplyingGravity;                         // 0x14(0x4)
	float                                                        DownForceVelocityFractionPerSecond;                // 0x18(0x4)
	float                                                        VelocityDampeningPerSecond;                        // 0x1c(0x4)
	Struct LinearColor                                           Color;                                             // 0x20(0x10)
	class                                                        ProjectileId;                                      // 0x30(0x8)
	byte                                                         HealthChangeReason;                                // 0x38(0x1)
	char                                                         pad0x3_EJLUJ[0x3];                                 // 0x39(0x3)
	Struct WeaponProjectileEffectParams                          ProjectileEffects;                                 // 0x3c(0x68)
	int                                                          SuggestedMaxSimulationIterations;                  // 0xa4(0x4)
	float                                                        SuggestedMinTickTimeSecs;                          // 0xa8(0x4)
	float                                                        SuggestedMaxSimulationTimeStep;                    // 0xac(0x4)
};


// Size 0x1e8
struct ProjectileWeaponParameters
{
public:
	int                                                          AmmoClipSize;                                      // 0x0(0x4)
	int                                                          AmmoCostPerShot;                                   // 0x4(0x4)
	float                                                        EquipDuration;                                     // 0x8(0x4)
	float                                                        IntoAimingDuration;                                // 0xc(0x4)
	float                                                        RecoilDuration;                                    // 0x10(0x4)
	float                                                        ReloadDuration;                                    // 0x14(0x4)
	Struct ProjectileShotParams                                  HipFireProjectileShotParams;                       // 0x18(0x1c)
	Struct ProjectileShotParams                                  AimDownSightsProjectileShotParams;                 // 0x34(0x1c)
	int                                                          InaccuracySeed;                                    // 0x50(0x4)
	float                                                        ProjectileDistributionMaxAngle;                    // 0x54(0x4)
	int                                                          NumberOfProjectiles;                               // 0x58(0x4)
	float                                                        ProjectileMaximumRange;                            // 0x5c(0x4)
	float                                                        ProjectileHitScanMaximumRange;                     // 0x60(0x4)
	float                                                        ProjectileDamage;                                  // 0x64(0x4)
	float                                                        ProjectileDamageMultiplierAtMaximumRange;          // 0x68(0x4)
	char                                                         pad0x4_9DJZL[0x4];                                 // 0x6c(0x4)
	class                                                        DamagerType;                                       // 0x70(0x8)
	class                                                        ProjectileId;                                      // 0x78(0x8)
	Struct WeaponProjectileParams                                AmmoParams;                                        // 0x80(0xb0)
	bool                                                         UsesScope;                                         // 0x130(0x1)
	char                                                         pad0x3_X0LJS[0x3];                                 // 0x131(0x3)
	float                                                        ZoomedRecoilDurationIncrease;                      // 0x134(0x4)
	float                                                        SecondsUntilZoomStarts;                            // 0x138(0x4)
	float                                                        SecondsUntilPostStarts;                            // 0x13c(0x4)
	float                                                        WeaponFiredAINoiseRange;                           // 0x140(0x4)
	float                                                        MaximumRequestPositionDelta;                       // 0x144(0x4)
	float                                                        MaximumRequestAngleDelta;                          // 0x148(0x4)
	float                                                        TimeoutTolerance;                                  // 0x14c(0x4)
	float                                                        AimingMoveSpeedScalar;                             // 0x150(0x4)
	byte                                                         AimSensitivitySettingCategory;                     // 0x154(0x1)
	char                                                         pad0x3_CAETF[0x3];                                 // 0x155(0x3)
	float                                                        InAimFOV;                                          // 0x158(0x4)
	float                                                        BlendSpeed;                                        // 0x15c(0x4)
	Class WwiseEvent*                                            DryFireSfx;                                        // 0x160(0x8)
	Struct AudioEmitterParameters                                AudioEmitterParameters;                            // 0x168(0x10)
	struct FName                                                 RumbleTag;                                         // 0x178(0x8)
	bool                                                         KnockbackEnabled;                                  // 0x180(0x1)
	char                                                         pad0x3_4IABF[0x3];                                 // 0x181(0x3)
	Struct KnockBackInfo                                         KnockbackParams;                                   // 0x184(0x50)
	bool                                                         StunEnabled;                                       // 0x1d4(0x1)
	char                                                         pad0x3_C05RZ[0x3];                                 // 0x1d5(0x3)
	float                                                        StunDuration;                                      // 0x1d8(0x4)
	Struct Vector                                                TargetingOffset;                                   // 0x1dc(0xc)
};


// Size 0x1c
struct ProjectileShotParams
{
public:
	int                                                          InaccuracySeed;                                    // 0x0(0x4)
	float                                                        ProjectileDistributionMaxAngle;                    // 0x4(0x4)
	int                                                          NumberOfProjectiles;                               // 0x8(0x4)
	float                                                        ProjectileMaximumRange;                            // 0xc(0x4)
	float                                                        ProjectileHitScanMaximumRange;                     // 0x10(0x4)
	float                                                        ProjectileDamage;                                  // 0x14(0x4)
	float                                                        ProjectileDamageMultiplierAtMaximumRange;          // 0x18(0x4)
};


// Size 0x1c
struct Projectile
{
public:
	Struct Vector                                                Origin;                                            // 0x0(0xc)
	Struct Vector                                                Direction;                                         // 0xc(0xc)
	float                                                        MaxDistance;                                       // 0x18(0x4)
};


// Size 0x90
struct FireBroadcast
{
public:
	Class Actor*                                                 Instigator;                                        // 0x0(0x8)
	TArray<struct HitResults>                                    HitResults;                                        // 0x8(0x10)
	Struct Vector                                                FirePosition;                                      // 0x18(0xc)
	Struct Vector                                                FireDirection;                                     // 0x24(0xc)
	Struct ProjectileAim                                         ProjectileAim;                                     // 0x30(0x50)
	int                                                          InaccuracySeed;                                    // 0x80(0x4)
};


// Size 0xb0
struct FireRequest
{
public:
	Class Actor*                                                 Instigator;                                        // 0x0(0x8)
	char                                                         pad0x8_BXSG5[0x8];                                 // 0x8(0x8)
	Struct RemoteProjectileAim                                   RemoteAimData;                                     // 0x10(0x60)
	TArray<struct HitResults>                                    HitResults;                                        // 0x70(0x10)
	bool                                                         HitResultsAreFromShadowHitScan;                    // 0x80(0x1)
	char                                                         pad0x7_7QIQI[0x7];                                 // 0x81(0x7)
	TArray<struct HitActorWorldTransforms>                       HitActorWorldTransforms;                           // 0x88(0x10)
	Struct Guid                                                  TelemetryAttackId;                                 // 0x98(0x10)
	int                                                          InaccuracySeed;                                    // 0xa8(0x4)
};


// Size 0x20
struct FireRequestHitActorWorldTransform
{
public:
	Class Actor*                                                 Actor;                                             // 0x0(0x8)
	Struct Vector                                                Location;                                          // 0x8(0xc)
	Struct Rotator                                               Rotation;                                          // 0x14(0xc)
};


// Size 0x60
struct RemoteProjectileAim
{
public:
	Struct ProjectileAim                                         AimData;                                           // 0x0(0x50)
	bool                                                         IsRelativeAim;                                     // 0x50(0x1)
	char                                                         pad0x7_UM0WR[0x7];                                 // 0x51(0x7)
	Struct ProjectileTimeStamp                                   TimeStamp;                                         // 0x58(0x8)
};


// Size 0x8
struct ProjectileTimeStamp
{
public:
};


// Size 0x10
struct AchievementBlockThenHitAndGetBlockedThenTakeHit
{
public:
	Class AthenaPlayerCharacter*                                 Character;                                         // 0x0(0x8)
	float                                                        TimeWindowInSeconds;                               // 0x8(0x4)
};


// Size 0x20
struct AchievementHaveADrinkWithAnotherCrewAtAnOutpost
{
public:
	Class AthenaPlayerCharacter*                                 Character;                                         // 0x0(0x8)
	char                                                         pad0x10_AZHHD[0x10];                               // 0x8(0x10)
	float                                                        RangeOfCheckInMetres;                              // 0x18(0x4)
	float                                                        DrinkConsumedVolumeThreshold;                      // 0x1c(0x4)
};


// Size 0x10
struct AchievementHeavyAttackRivalOffTheirShip
{
public:
	Class AthenaCharacter*                                       Character;                                         // 0x0(0x8)
	float                                                        TimeWindowInSeconds;                               // 0x8(0x4)
};


// Size 0x4
struct AchievementKillOpponentFromBehindWithBlunderbuss
{
public:
	float                                                        FacingDirAngleTolerance;                           // 0x0(0x4)
};


// Size 0x8
struct AchievementKillOpponentInContest
{
public:
};


// Size 0xc
struct SprintConditionsParams
{
public:
	float                                                        ForwardInputVectorTolerance;                       // 0x0(0x4)
	float                                                        MinVelocityForwardDot;                             // 0x4(0x4)
	float                                                        MinVelocityMagnitude;                              // 0x8(0x4)
};


// Size 0x48
struct SprintLogicHandler
{
public:
};


// Size 0x18
struct CloudTypeNormalizedWeight
{
public:
	Struct LinearColor                                           LodScreenPercentages;                              // 0x0(0x10)
	float                                                        ProbabilityWeight;                                 // 0x10(0x4)
	float                                                        MeshRadius;                                        // 0x14(0x4)
};


// Size 0x30
struct CloudTypeDefinition
{
public:
	Class StaticMesh*                                            CloudMesh;                                         // 0x0(0x8)
	Class StaticMesh*                                            CloudFluffyMesh;                                   // 0x8(0x8)
	Struct Vector2D                                              ScaleRange;                                        // 0x10(0x8)
	Struct Vector2D                                              StorminessRange;                                   // 0x18(0x8)
	float                                                        ProbabilityWeight;                                 // 0x20(0x4)
	float                                                        OverlapTolerance;                                  // 0x24(0x4)
	bool                                                         IsStreetCloud;                                     // 0x28(0x1)
	bool                                                         CastsShadow;                                       // 0x29(0x1)
};


// Size 0x30
struct RenderedCloudProperties
{
public:
	Struct Vector                                                WorldPosition;                                     // 0x0(0xc)
	float                                                        Fade;                                              // 0xc(0x4)
	float                                                        Storminess;                                        // 0x10(0x4)
	float                                                        RotationYaw;                                       // 0x14(0x4)
	float                                                        StreetRotationFront;                               // 0x18(0x4)
	float                                                        StreetRotationBack;                                // 0x1c(0x4)
	bool                                                         Visible;                                           // 0x20(0x1)
	bool                                                         FluffVisible;                                      // 0x21(0x1)
	bool                                                         IsStreetCloud;                                     // 0x22(0x1)
	bool                                                         UpdatesThisFrame;                                  // 0x23(0x1)
};


// Size 0x24
struct TiledCloudProperties
{
public:
	Struct Vector2D                                              TilePosition;                                      // 0x0(0x8)
	int                                                          CloudTypeIndex;                                    // 0x8(0x4)
	float                                                        RelativeRadius;                                    // 0xc(0x4)
	float                                                        Scale;                                             // 0x10(0x4)
	float                                                        PressureThreshold;                                 // 0x14(0x4)
	float                                                        RotationYaw;                                       // 0x18(0x4)
	float                                                        OverlapTolerance;                                  // 0x1c(0x4)
};


// Size 0x70
struct CloudVisualParameters
{
public:
	bool                                                         RenderInMainPass;                                  // 0x0(0x1)
	char                                                         pad0x3_ZU23H[0x3];                                 // 0x1(0x3)
	Struct Vector                                                ScalingVector;                                     // 0x4(0xc)
	Struct Vector2D                                              BillboardScale;                                    // 0x10(0x8)
	Struct Vector2D                                              BillboardRandomScale;                              // 0x18(0x8)
	Struct Vector2D                                              BillboardRearCutOff;                               // 0x20(0x8)
	Struct Vector2D                                              BillboardForeCutOff;                               // 0x28(0x8)
	Struct Vector2D                                              BillboardSink;                                     // 0x30(0x8)
	float                                                        BillboardScaleAlphaDependence;                     // 0x38(0x4)
	float                                                        BillboardRotationRate;                             // 0x3c(0x4)
	float                                                        DistanceFadeExponent;                              // 0x40(0x4)
	float                                                        TurbulenceScale;                                   // 0x44(0x4)
	float                                                        TurbulenceStrength;                                // 0x48(0x4)
	float                                                        FluffCullDistance;                                 // 0x4c(0x4)
	Class MaterialInterface*                                     MaterialTemplatePointCloudSolid;                   // 0x50(0x8)
	Class MaterialInterface*                                     MaterialTemplatePointCloudFluffy;                  // 0x58(0x8)
	Class MaterialInterface*                                     MaterialTemplateStreetCloudSolid;                  // 0x60(0x8)
	Class MaterialInterface*                                     MaterialTemplateStreetCloudFluffy;                 // 0x68(0x8)
};


// Size 0x8
struct WalkConditionsParams
{
public:
	float                                                        WalkSpeedMultiplier;                               // 0x0(0x4)
	float                                                        WalkStopThreshold;                                 // 0x4(0x4)
};


// Size 0xc
struct WalkLogicHandler
{
public:
};


// Size 0x68
struct AthenaPlayerCharacterModelSwap
{
public:
	Class SkeletalMesh*                                          FirstPersonMesh;                                   // 0x0(0x8)
	class                                                        FirstPersonAnimSetDataId;                          // 0x8(0x8)
	Struct PirateGeneratorAdditionalBakeInfo                     FirstPersonAdditionalBakeInfo;                     // 0x10(0x20)
	Class SkeletalMesh*                                          ThirdPersonMesh;                                   // 0x30(0x8)
	class                                                        ThirdPersonAnimSetDataId;                          // 0x38(0x8)
	Struct PirateGeneratorAdditionalBakeInfo                     ThirdPersonAdditionalBakeInfo;                     // 0x40(0x20)
};


// Size 0x28
struct Alliance
{
public:
	Struct Guid                                                  AllianceId;                                        // 0x0(0x10)
	TArray<struct Crews>                                         Crews;                                             // 0x10(0x10)
	byte                                                         AllianceIndex;                                     // 0x20(0x1)
};


// Size 0x14
struct CrewAllianceJoinStatus
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	byte                                                         AllianceJoinStatus;                                // 0x10(0x1)
	byte                                                         LastAllianceJoinStatus;                            // 0x11(0x1)
};


// Size 0x68
struct NPCCustomAnimationBlueprintData
{
public:
	bool                                                         SequenceActive;                                    // 0x0(0x1)
	bool                                                         LoopActive;                                        // 0x1(0x1)
	char                                                         pad0x2_AIFSB[0x2];                                 // 0x2(0x2)
	int                                                          ActiveSequenceIndex;                               // 0x4(0x4)
	bool                                                         IsOneShot;                                         // 0x8(0x1)
	char                                                         pad0x7_CQXJU[0x7];                                 // 0x9(0x7)
	Struct NPCCustomAnimationBlueprintPlayingAnimations          BlueprintPlayingAnimations;                        // 0x10(0x28)
	Struct NPCCustomAnimationBlueprintPlayingMontage             BlueprintPlayingFacialMontages;                    // 0x38(0x28)
	byte                                                         CustomAnimationState;                              // 0x60(0x1)
};


// Size 0x28
struct NPCCustomAnimationBlueprintPlayingMontage
{
public:
	Class AnimMontage*                                           OneShot;                                           // 0x0(0x8)
	Class AnimMontage*                                           ContinouousIn;                                     // 0x8(0x8)
	Class AnimMontage*                                           ContinouousLoop_A;                                 // 0x10(0x8)
	Class AnimMontage*                                           ContinouousLoop_B;                                 // 0x18(0x8)
	Class AnimMontage*                                           ContinouousOut;                                    // 0x20(0x8)
};


// Size 0x28
struct NPCCustomAnimationBlueprintPlayingAnimations
{
public:
	Class AnimSequenceBase*                                      OneShot;                                           // 0x0(0x8)
	Class AnimSequenceBase*                                      ContinouousIn;                                     // 0x8(0x8)
	Class AnimSequenceBase*                                      ContinouousLoop_A;                                 // 0x10(0x8)
	Class AnimSequenceBase*                                      ContinouousLoop_B;                                 // 0x18(0x8)
	Class AnimSequenceBase*                                      ContinouousOut;                                    // 0x20(0x8)
};


// Size 0x38
struct NPCCustomAnimationDataStructure
{
public:
	TArray<struct OneShotSequences>                              OneShotSequences;                                  // 0x0(0x10)
	TArray<struct ContinuousSequences>                           ContinuousSequences;                               // 0x10(0x10)
	Class NPCHeldObjectData*                                     WieldableCosmeticItemList;                         // 0x20(0x8)
	TArray<struct InitialSpawnedCosmeticItems>                   InitialSpawnedCosmeticItems;                       // 0x28(0x10)
};


// Size 0x10
struct NPCInitialSpawnedCosmeticItems
{
public:
	class                                                        CosmeticItemObject;                                // 0x0(0x8)
	struct FName                                                 AttachSocketName;                                  // 0x8(0x8)
};


// Size 0x38
struct NPCContinuousAnimationElement
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	Struct NPCAnimationContinuousCycle                           ContinuousSequence;                                // 0x8(0x30)
};


// Size 0x30
struct NPCAnimationContinuousCycle
{
public:
	Struct NPCAnimationSequence                                  In;                                                // 0x0(0x10)
	TArray<struct Loop>                                          Loop;                                              // 0x10(0x10)
	Struct NPCAnimationSequence                                  Out;                                               // 0x20(0x10)
};


// Size 0x10
struct NPCAnimationSequence
{
public:
	Class AnimSequenceBase*                                      AnimationSequence;                                 // 0x0(0x8)
	Class AnimMontage*                                           FacialAdditive;                                    // 0x8(0x8)
};


// Size 0x18
struct NPCOneShotAnimationElement
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	TArray<struct OneShotSequence>                               OneShotSequence;                                   // 0x8(0x10)
};


// Size 0x20
struct AnimNotifyWwiseObserver
{
public:
	Class WwiseEvent*                                            OnEventPosted;                                     // 0x0(0x8)
	bool                                                         PreventPlayingPostedEvent;                         // 0x8(0x1)
	char                                                         pad0x7_CMV6Q[0x7];                                 // 0x9(0x7)
	TArray<class WwiseEvent*>                                    AdditionalEventsToTrigger;                         // 0x10(0x10)
};


// Size 0x14
struct JoinedCrew
{
public:
};


// Size 0x58
struct AthenaAnimationCustomSkeletonAnimationBlueprintData
{
public:
	bool                                                         SequenceActive;                                    // 0x0(0x1)
	bool                                                         LoopActive;                                        // 0x1(0x1)
	char                                                         pad0x2_X02PI[0x2];                                 // 0x2(0x2)
	int                                                          ActiveSequenceIndex;                               // 0x4(0x4)
	bool                                                         IsOneShot;                                         // 0x8(0x1)
	char                                                         pad0x7_Z3VUG[0x7];                                 // 0x9(0x7)
	Struct SkeletonCustomAnimationBlueprintPlayingAnimations     BlueprintPlayingAnimations;                        // 0x10(0x38)
	Class NPCHeldObjectData*                                     WieldableCosmeticItemList;                         // 0x48(0x8)
	byte                                                         CustomAnimationState;                              // 0x50(0x1)
	char                                                         pad0x3_01LXJ[0x3];                                 // 0x51(0x3)
	float                                                        BlendTime;                                         // 0x54(0x4)
};


// Size 0x38
struct SkeletonCustomAnimationBlueprintPlayingAnimations
{
public:
	Class AnimSequence*                                          OneShot;                                           // 0x0(0x8)
	Class AnimSequence*                                          ContinuousIn;                                      // 0x8(0x8)
	Class AnimSequence*                                          ContinuousLoop_A;                                  // 0x10(0x8)
	Class AnimSequence*                                          ContinuousLoop_B;                                  // 0x18(0x8)
	Class AnimSequence*                                          ContinuousOut;                                     // 0x20(0x8)
	TArray<class AnimSequence*>                                  AlternateContinuousOuts;                           // 0x28(0x10)
};


// Size 0x38
struct SkeletonCustomAnimationDataStructure
{
public:
	TArray<struct OneShotSequences>                              OneShotSequences;                                  // 0x0(0x10)
	TArray<struct ContinuousSequences>                           ContinuousSequences;                               // 0x10(0x10)
	Class NPCHeldObjectData*                                     WieldableCosmeticItemList;                         // 0x20(0x8)
	TArray<class WwiseEvent*>                                    AudioEvents;                                       // 0x28(0x10)
};


// Size 0x58
struct ContinuousAnimationElement
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	Struct AnimationContinuousCycle                              ContinuousSequence;                                // 0x8(0x48)
	float                                                        BlendTime;                                         // 0x50(0x4)
};


// Size 0x48
struct AnimationContinuousCycle
{
public:
	Class AnimSequence*                                          In;                                                // 0x0(0x8)
	float                                                        InEffectTime;                                      // 0x8(0x4)
	char                                                         pad0x4_4L5PO[0x4];                                 // 0xc(0x4)
	TArray<class AnimSequence*>                                  Loop;                                              // 0x10(0x10)
	Class BlendSpace1D*                                          LoopHitReact;                                      // 0x20(0x8)
	Class AnimSequence*                                          Out;                                               // 0x28(0x8)
	TArray<class AnimSequence*>                                  OutAlternates;                                     // 0x30(0x10)
	float                                                        OutUndockTime;                                     // 0x40(0x4)
};


// Size 0x20
struct OneShotAnimationElement
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	TArray<class AnimSequence*>                                  OneShotSequence;                                   // 0x8(0x10)
	float                                                        EffectTime;                                        // 0x18(0x4)
	float                                                        BlendTime;                                         // 0x1c(0x4)
};


// Size 0x68
struct AthenaAnimationLocomotion
{
public:
	Struct Vector                                                CharacterVelocity;                                 // 0x0(0xc)
	float                                                        WantedMovementSpeed;                               // 0xc(0x4)
	float                                                        HalfWantedMovementSpeed;                           // 0x10(0x4)
	bool                                                         CharacterMoving;                                   // 0x14(0x1)
	bool                                                         RunStopWanted;                                     // 0x15(0x1)
	char                                                         pad0x2_VBF8T[0x2];                                 // 0x16(0x2)
	float                                                        TurnRate;                                          // 0x18(0x4)
	float                                                        CurrentYaw;                                        // 0x1c(0x4)
	float                                                        CurrentDirection;                                  // 0x20(0x4)
	bool                                                         TurningActive;                                     // 0x24(0x1)
	bool                                                         TurningLeft;                                       // 0x25(0x1)
	bool                                                         IsSwimming;                                        // 0x26(0x1)
	bool                                                         IsUnderwaterSwimming;                              // 0x27(0x1)
	float                                                        BlendedTurnRate;                                   // 0x28(0x4)
	float                                                        MinimumMoveSpeedToTriggerRunStop;                  // 0x2c(0x4)
	float                                                        InterpSpeed;                                       // 0x30(0x4)
	float                                                        TurnRateToDisableTurns;                            // 0x34(0x4)
	float                                                        TurningAnimationExplicitTime;                      // 0x38(0x4)
	float                                                        FixedBlendedTurnRateForAI;                         // 0x3c(0x4)
	bool                                                         IsInAITurn;                                        // 0x40(0x1)
	char                                                         pad0x17_7WX9N[0x17];                               // 0x41(0x17)
	Class AthenaAnimationInstance*                               CachedOwner;                                       // 0x58(0x8)
};


// Size 0x340
struct AthenaAnimationFishing
{
public:
	bool                                                         AnimationOverride;                                 // 0x0(0x1)
	char                                                         pad0x31f_2SWCW[0x31f];                             // 0x1(0x31f)
	Class Actor*                                                 FishingRodActor;                                   // 0x320(0x8)
	Class Actor*                                                 FishingFloat;                                      // 0x328(0x8)
	Class AthenaAnimationInstance*                               OwningAnimationInstance;                           // 0x330(0x8)
};


// Size 0x34
struct AthenaAnimationFishingParams
{
public:
	byte                                                         FishingState;                                      // 0x0(0x1)
	bool                                                         InFishing;                                         // 0x1(0x1)
	char                                                         pad0x2_M5B99[0x2];                                 // 0x2(0x2)
	Struct Vector2D                                              RodBend;                                           // 0x4(0x8)
	float                                                        ReelSpeed;                                         // 0xc(0x4)
	bool                                                         CastFailed;                                        // 0x10(0x1)
	bool                                                         IsFishHookedAndVisible;                            // 0x11(0x1)
	char                                                         pad0x2_03IOH[0x2];                                 // 0x12(0x2)
	Struct Vector2D                                              PlayerInputForce;                                  // 0x14(0x8)
	float                                                        TensionShake;                                      // 0x1c(0x4)
	float                                                        LineSnapShake;                                     // 0x20(0x4)
	bool                                                         IKIsActive;                                        // 0x24(0x1)
	char                                                         pad0x3_LEJ71[0x3];                                 // 0x25(0x3)
	float                                                        IKBlendInSpeed;                                    // 0x28(0x4)
	float                                                        IKBlendIOutSpeed;                                  // 0x2c(0x4)
	bool                                                         IsComedyItem;                                      // 0x30(0x1)
	byte                                                         FishingJIPState;                                   // 0x31(0x1)
};


// Size 0x10
struct AthenaAnimationIdleVariantChange
{
public:
	float                                                        CurrentTime;                                       // 0x0(0x4)
	float                                                        TriggerTime;                                       // 0x4(0x4)
	int                                                          VariantID;                                         // 0x8(0x4)
	bool                                                         VariantCompleted;                                  // 0xc(0x1)
};


// Size 0xc8
struct AthenaAnimationRowboatParams
{
public:
	bool                                                         InLeftArmRow;                                      // 0x0(0x1)
	bool                                                         InLeftArmRecover;                                  // 0x1(0x1)
	bool                                                         InRightArmRow;                                     // 0x2(0x1)
	bool                                                         InRightArmRecover;                                 // 0x3(0x1)
	float                                                        LeftArmForce;                                      // 0x4(0x4)
	float                                                        LeftArmRecover;                                    // 0x8(0x4)
	float                                                        RightArmForce;                                     // 0xc(0x4)
	float                                                        RightArmRecover;                                   // 0x10(0x4)
	byte                                                         Braking;                                           // 0x14(0x1)
	bool                                                         BrakingLeftOrBoth;                                 // 0x15(0x1)
	bool                                                         BrakingRightOrBoth;                                // 0x16(0x1)
	char                                                         pad0x1_7HIU4[0x1];                                 // 0x17(0x1)
	int                                                          Direction;                                         // 0x18(0x4)
	bool                                                         PlayIdle;                                          // 0x1c(0x1)
	bool                                                         LeftArmInactive;                                   // 0x1d(0x1)
	bool                                                         RightArmInactive;                                  // 0x1e(0x1)
	char                                                         pad0x1_I1ZVO[0x1];                                 // 0x1f(0x1)
	Struct Vector                                                CameraAdjustment;                                  // 0x20(0xc)
	bool                                                         IsSeated;                                          // 0x2c(0x1)
	char                                                         pad0x3_ELPKC[0x3];                                 // 0x2d(0x3)
	Struct AthenaAnimationRowboatAnimationsFirstPerson           RowBoatAnimationsFirstPerson;                      // 0x30(0x30)
	Struct AthenaAnimationRowboatAnimationsThirdPerson           RowBoatAnimationsThirdPerson;                      // 0x60(0x50)
	Struct AthenaAnimationRowboatAnimationsPassenger             RowBoatAnimationsPassenger;                        // 0xb0(0x18)
};


// Size 0x18
struct AthenaAnimationRowboatAnimationsPassenger
{
public:
	Class AnimSequence*                                          PassengerIntoSitting;                              // 0x0(0x8)
	Class AnimSequence*                                          PassengerSittingIdle;                              // 0x8(0x8)
	Class AnimSequence*                                          PassengerStand;                                    // 0x10(0x8)
};


// Size 0x50
struct AthenaAnimationRowboatAnimationsThirdPerson
{
public:
	Class AnimSequence*                                          SitDown;                                           // 0x0(0x8)
	Class AnimSequence*                                          Stand;                                             // 0x8(0x8)
	Class AnimSequence*                                          Idle;                                              // 0x10(0x8)
	Class BlendSpace1D*                                          Row;                                               // 0x18(0x8)
	Class BlendSpace1D*                                          Recover;                                           // 0x20(0x8)
	Class BlendSpace1D*                                          IntoRow;                                           // 0x28(0x8)
	Class BlendSpace1D*                                          IntoRowBrake;                                      // 0x30(0x8)
	Class BlendSpace1D*                                          BrakeRow;                                          // 0x38(0x8)
	Class BlendSpace1D*                                          BrakeRecover;                                      // 0x40(0x8)
	Class BlendSpace1D*                                          BrakeIdle;                                         // 0x48(0x8)
};


// Size 0x30
struct AthenaAnimationRowboatAnimationsFirstPerson
{
public:
	Class AnimSequence*                                          SitDown;                                           // 0x0(0x8)
	Class AnimSequence*                                          Stand;                                             // 0x8(0x8)
	Class AnimSequence*                                          Idle;                                              // 0x10(0x8)
	Class AnimSequence*                                          Row;                                               // 0x18(0x8)
	Class AnimSequence*                                          Recover;                                           // 0x20(0x8)
	Class AnimSequence*                                          Brake;                                             // 0x28(0x8)
};


// Size 0xc0
struct AthenaAnimationRowing
{
public:
	Class Actor*                                                 ControlledObject;                                  // 0x0(0x8)
	Class Actor*                                                 CachedPlayerCharacter;                             // 0x8(0x8)
	class                                                        CosmeticOarClass;                                  // 0x10(0x8)
};


// Size 0x510
struct AthenaAnimationWieldedItemStateMachine
{
public:
	byte                                                         CurrentState;                                      // 0x0(0x1)
	byte                                                         PreviousState;                                     // 0x1(0x1)
	bool                                                         ExpectingTransition;                               // 0x2(0x1)
	char                                                         pad0x5_H58TO[0x5];                                 // 0x3(0x5)
	class                                                        ContinuousUseInputId;                              // 0x8(0x8)
	class                                                        OutOfContinuousUseInputId;                         // 0x10(0x8)
	class                                                        OneShotUseInputId;                                 // 0x18(0x8)
	bool                                                         OneShotIsAlternate;                                // 0x20(0x1)
	bool                                                         ContinuousIsAlternate;                             // 0x21(0x1)
	byte                                                         OneShotAnimationVariant;                           // 0x22(0x1)
	bool                                                         IdleIsAlternate;                                   // 0x23(0x1)
	bool                                                         UsePrimaryContinuousAnimations;                    // 0x24(0x1)
	bool                                                         UsePrimaryContinuousOutOfAnimations;               // 0x25(0x1)
	bool                                                         UsePrimaryOneShotAnimations;                       // 0x26(0x1)
	char                                                         pad0x29_PVIUT[0x29];                               // 0x27(0x29)
	Class AnimSequence*                                          LastValidAnimSequence;                             // 0x50(0x8)
	Class BlendSpace1D*                                          LastValidBlendspace;                               // 0x58(0x8)
	Class Actor*                                                 PreviousWieldedItem;                               // 0x60(0x8)
	bool                                                         DuplicateTransition;                               // 0x68(0x1)
	char                                                         pad0x3_F0KI3[0x3];                                 // 0x69(0x3)
	struct FName                                                 WieldSockets;                                      // 0x6c(0x8)
};


// Size 0x28
struct AthenaAnimationSkeletonCurseAnimations
{
public:
	Class AnimSequence*                                          SkeletonDrunk;                                     // 0x0(0x8)
	Class AnimSequence*                                          SkeletonDance;                                     // 0x8(0x8)
	Class AnimSequence*                                          SkeletonSleepInto;                                 // 0x10(0x8)
	Class AnimSequence*                                          SkeletonSleepLoop;                                 // 0x18(0x8)
	Class AnimSequence*                                          SkeletonSleepOut;                                  // 0x20(0x8)
};


// Size 0x8
struct AthenaAnimationSkeletonScream
{
public:
	Class AnimSequence*                                          SkeletonScream;                                    // 0x0(0x8)
};


// Size 0x38
struct AthenaAnimationSkeletonFleeInGraph
{
public:
	Class AnimSequence*                                          TurnLeft;                                          // 0x0(0x8)
	Class AnimSequence*                                          TurnRight;                                         // 0x8(0x8)
	Class BlendSpace*                                            LocomotionBase;                                    // 0x10(0x8)
	Class BlendSpace*                                            LocomotionVariant;                                 // 0x18(0x8)
	TArray<class BlendSpace*>                                    LocomotionVariantSelection;                        // 0x20(0x10)
	int                                                          PrecentageChanceOfVariantOccuring;                 // 0x30(0x4)
};


// Size 0x40
struct AthenaAnimationSkeletonFlee
{
public:
	class                                                        UseWithObject;                                     // 0x0(0x8)
	TArray<class AnimSequence*>                                  FleeTurnLeft;                                      // 0x8(0x10)
	TArray<class AnimSequence*>                                  FleeTurnRight;                                     // 0x18(0x10)
	Class BlendSpace*                                            FleeLocomotionBase;                                // 0x28(0x8)
	TArray<class BlendSpace*>                                    FleeLocomotionVariants;                            // 0x30(0x10)
};


// Size 0x38
struct AthenaAnimationSkeletonEmoteActionParams
{
public:
	TArray<struct AllLoadedAIEmoteActionAnimations>              AllLoadedAIEmoteActionAnimations;                  // 0x0(0x10)
	byte                                                         CurrentEmoteActionState;                           // 0x10(0x1)
	char                                                         pad0x7_GT6AK[0x7];                                 // 0x11(0x7)
	Class AnimSequence*                                          TauntAnimation;                                    // 0x18(0x8)
	Class AnimSequence*                                          CheerAnimation;                                    // 0x20(0x8)
	Class AnimSequence*                                          TauntAnimationB;                                   // 0x28(0x8)
	Class AnimSequence*                                          CheerAnimationB;                                   // 0x30(0x8)
};


// Size 0x28
struct AthenaAnimationSkeletonEmoteActionAnimations
{
public:
	class                                                        UseWithObject;                                     // 0x0(0x8)
	TArray<class AnimSequence*>                                  Taunt;                                             // 0x8(0x10)
	TArray<class AnimSequence*>                                  Cheer;                                             // 0x18(0x10)
};


// Size 0x60
struct AthenaAnimationSkeletonShipCaptainParams
{
public:
	Struct AthenaAnimationSkeletonShipCaptainAnimations          AllSkeletonShipCaptainAnimations;                  // 0x0(0x48)
	Class AnimSequence*                                          ShipCaptainIdleCycleA;                             // 0x48(0x8)
	Class AnimSequence*                                          ShipCaptainIdleCycleB;                             // 0x50(0x8)
	byte                                                         DockedAnimationState;                              // 0x58(0x1)
};


// Size 0x48
struct AthenaAnimationSkeletonShipCaptainAnimations
{
public:
	Class AnimSequence*                                          EnterDockedPose;                                   // 0x0(0x8)
	TArray<class AnimSequence*>                                  DockedIdles;                                       // 0x8(0x10)
	Class AnimSequence*                                          ExitDockedPose;                                    // 0x18(0x8)
	Class AnimSequence*                                          Taunt;                                             // 0x20(0x8)
	Class AnimSequence*                                          RamInto;                                           // 0x28(0x8)
	Class AnimSequence*                                          RamCycle;                                          // 0x30(0x8)
	Class AnimSequence*                                          RamImpact;                                         // 0x38(0x8)
	Class AnimSequence*                                          RamOutOf;                                          // 0x40(0x8)
};


// Size 0x38
struct AthenaAnimationSkeletonSensingParams
{
public:
	TArray<struct AllLoadedAISensingAnimations>                  AllLoadedAISensingAnimations;                      // 0x0(0x10)
	byte                                                         CurrentSensingState;                               // 0x10(0x1)
	char                                                         pad0x7_P4JU6[0x7];                                 // 0x11(0x7)
	Class AnimSequence*                                          InitialReactionAnimation;                          // 0x18(0x8)
	Class BlendSpace1D*                                          SearchingAnimation;                                // 0x20(0x8)
	Class AnimSequence*                                          AlertingOthersAnimation;                           // 0x28(0x8)
	Class BlendSpace1D*                                          PursuitAnimation;                                  // 0x30(0x8)
};


// Size 0x28
struct AthenaAnimationSkeletonSensingAnimations
{
public:
	class                                                        UseWithObject;                                     // 0x0(0x8)
	Class AnimSequence*                                          InitialReaction;                                   // 0x8(0x8)
	Class BlendSpace1D*                                          Searching;                                         // 0x10(0x8)
	Class AnimSequence*                                          AlertingOthers;                                    // 0x18(0x8)
	Class BlendSpace1D*                                          Pursuit;                                           // 0x20(0x8)
};


// Size 0x2e8
struct AthenaAnimationAI
{
public:
	bool                                                         SpawnAnimationActive;                              // 0x0(0x1)
	bool                                                         SpawnAnimationReadyToBegin;                        // 0x1(0x1)
	char                                                         pad0x6_OEFSN[0x6];                                 // 0x2(0x6)
	Class AnimSequence*                                          AISpawn;                                           // 0x8(0x8)
	Class AnimSequence*                                          AIDespawn;                                         // 0x10(0x8)
	float                                                        AIAnimationSpawnTime;                              // 0x18(0x4)
	bool                                                         AISpawnOnLand;                                     // 0x1c(0x1)
	bool                                                         AIFleeActive;                                      // 0x1d(0x1)
	char                                                         pad0x2_NGUO4[0x2];                                 // 0x1e(0x2)
	Struct AthenaAnimationSkeletonSensingParams                  AISensing;                                         // 0x20(0x38)
	Struct AthenaAnimationSkeletonEmoteActionParams              AIEmoteActions;                                    // 0x58(0x38)
	Struct AthenaAnimationSkeletonShipCaptainParams              SkeletonShipCaptainParams;                         // 0x90(0x60)
};


// Size 0x30
struct AthenaAnimationAIKnockback
{
public:
	Struct AthenaAnimationSkeletonKnockbackLocomotionStrength    KnockbackAnimations;                               // 0x0(0x20)
	byte                                                         AIKnockbackDirection;                              // 0x20(0x1)
	char                                                         pad0x3_YICLQ[0x3];                                 // 0x21(0x3)
	bool                                                         KnockbackActive;                                   // 0x24(0x1)
	char                                                         pad0x3_HQ6FN[0x3];                                 // 0x25(0x3)
	Class AnimSequence*                                          KnockbackAnimToUse;                                // 0x28(0x8)
};


// Size 0x20
struct AthenaAnimationSkeletonKnockbackLocomotionStrength
{
public:
	Struct AthenaAnimationSkeletonKnockbackLocomotion            LowStrength;                                       // 0x0(0x10)
	Struct AthenaAnimationSkeletonKnockbackLocomotion            HighStrength;                                      // 0x10(0x10)
};


// Size 0x10
struct AthenaAnimationSkeletonKnockbackLocomotion
{
public:
	Class AnimSequence*                                          Forwards;                                          // 0x0(0x8)
	Class AnimSequence*                                          Backwards;                                         // 0x8(0x8)
};


// Size 0x48
struct AthenaAnimationFootPlanting
{
public:
	Struct CollisionResponseContainer                            OverrideRaycast;                                   // 0x8(0x20)
	float                                                        HipHeight;                                         // 0x28(0x4)
	float                                                        HipPullStrength;                                   // 0x2c(0x4)
	float                                                        DownDistance;                                      // 0x30(0x4)
	float                                                        DownDistanceRangeStart;                            // 0x34(0x4)
	float                                                        DownDistanceRangeEnd;                              // 0x38(0x4)
	float                                                        IKLegStretch;                                      // 0x3c(0x4)
	float                                                        SlopeAngle;                                        // 0x40(0x4)
	bool                                                         Active;                                            // 0x44(0x1)
	bool                                                         FeetContact;                                       // 0x45(0x1)
};


// Size 0x8
struct AthenaAnimationStunData
{
public:
	byte                                                         StunAnimType;                                      // 0x0(0x1)
	char                                                         pad0x3_410QD[0x3];                                 // 0x1(0x3)
	bool                                                         IsCursedVariant;                                   // 0x4(0x1)
};


// Size 0x28
struct AthenaAnimationHarpoonLauncherAnimData
{
public:
	TArray<class BlendSpace1D*>                                  Idle;                                              // 0x0(0x10)
	Class BlendSpace1D*                                          FireInto;                                          // 0x10(0x8)
	Class BlendSpace1D*                                          FireOutOf;                                         // 0x18(0x8)
	Class BlendSpace1D*                                          FireAction;                                        // 0x20(0x8)
};


// Size 0xf8
struct AthenaAnimationMountedWeapon
{
public:
	bool                                                         IsFiring;                                          // 0x0(0x1)
	char                                                         pad0x3_LVR1I[0x3];                                 // 0x1(0x3)
	float                                                        Pitch;                                             // 0x4(0x4)
	float                                                        Yaw;                                               // 0x8(0x4)
	char                                                         pad0x4_19F6N[0x4];                                 // 0xc(0x4)
	Class Actor*                                                 ControlledObject;                                  // 0x10(0x8)
};


// Size 0x40
struct AssetDelayLoadEntry
{
public:
	Struct FString                                               Comment;                                           // 0x0(0x10)
	byte                                                         LoadAtPhase;                                       // 0x10(0x1)
	byte                                                         Persistence;                                       // 0x11(0x1)
	bool                                                         LoadForClient;                                     // 0x12(0x1)
	bool                                                         LoadForServer;                                     // 0x13(0x1)
	struct FName                                                 Feature;                                           // 0x14(0x8)
	char                                                         pad0x4_JZOOZ[0x4];                                 // 0x1c(0x4)
	TArray<struct AssetsToLoad>                                  AssetsToLoad;                                      // 0x20(0x10)
	TArray<Assetclass BlueprintsToLoad>                          BlueprintsToLoad;                                  // 0x30(0x10)
};


// Size 0x10
struct RequestedLoopAnims
{
public:
	struct FName                                                 RequestedLoopingAnimName;                          // 0x0(0x8)
	int                                                          RequestedOutOfAnimIndex;                           // 0x8(0x4)
	int                                                          AnimationAssetRequired;                            // 0xc(0x4)
};


// Size 0xc8
struct VoyageParticipantViewContainer
{
public:
	Struct VoyageParticipantView                                 State;                                             // 0x0(0xc8)
};


// Size 0xc8
struct VoyageParticipantView
{
public:
	Struct FText                                                 Title;                                             // 0x0(0x38)
	Struct Guid                                                  Id;                                                // 0x38(0x10)
	int                                                          ChapterIndex;                                      // 0x48(0x4)
	int                                                          ChapterCount;                                      // 0x4c(0x4)
	int                                                          ActiveQuestCount;                                  // 0x50(0x4)
	byte                                                         History;                                           // 0x54(0x1)
	char                                                         pad0x3_C21A8[0x3];                                 // 0x55(0x3)
	class                                                        Company;                                           // 0x58(0x8)
	bool                                                         IsEmergent;                                        // 0x60(0x1)
	bool                                                         IsTale;                                            // 0x61(0x1)
	byte                                                         EmergentSource;                                    // 0x62(0x1)
	Struct ViewVoyageBanners                                     ViewVoyageBanners;                                 // 0x63(0x2)
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x65(0x1)
	char                                                         pad0x2_QW6VT[0x2];                                 // 0x66(0x2)
	int                                                          Rank;                                              // 0x68(0x4)
	Struct NetActorPtr                                           PlayerStateOfDiscoverer;                           // 0x6c(0x14)
	bool                                                         IsDiscovererMe;                                    // 0x80(0x1)
	char                                                         pad0x3_A5QFJ[0x3];                                 // 0x81(0x3)
	struct FName                                                 ChestRarity;                                       // 0x84(0x8)
	bool                                                         PlayAudio;                                         // 0x8c(0x1)
	char                                                         pad0x3_R7F3E[0x3];                                 // 0x8d(0x3)
	int                                                          ChestDiscoveredId;                                 // 0x90(0x4)
	char                                                         pad0x4_K10IK[0x4];                                 // 0x94(0x4)
	Class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x98(0x8)
	int                                                          CollectCratesPopUpId;                              // 0xa0(0x4)
	char                                                         pad0x4_SDA52[0x4];                                 // 0xa4(0x4)
	TArray<struct VoyageCompletionStats>                         VoyageCompletionStats;                             // 0xa8(0x10)
	TArray<struct ReapersMarkCompletionStats>                    ReapersMarkCompletionStats;                        // 0xb8(0x10)
};


// Size 0x2
struct ViewVoyageBanners
{
public:
	byte                                                         ShowIntroBanners;                                  // 0x0(0x1)
	byte                                                         ShowOutroBanners;                                  // 0x1(0x1)
};


// Size 0x9c
struct AthenaCharacterSwimParams
{
public:
	float                                                        EnterSwimmingDepth;                                // 0x0(0x4)
	float                                                        ExitSwimmingDepth;                                 // 0x4(0x4)
	float                                                        FloatHeight;                                       // 0x8(0x4)
	float                                                        ThirdPersonMeshOffset;                             // 0xc(0x4)
	float                                                        ThirdPersonMeshAdjustTime;                         // 0x10(0x4)
	float                                                        FullGravityHeight;                                 // 0x14(0x4)
	float                                                        SurfaceSwimDepth;                                  // 0x18(0x4)
	float                                                        SurfaceSwimExitDepth;                              // 0x1c(0x4)
	float                                                        SubmergedBuoyancyDepth;                            // 0x20(0x4)
	float                                                        ZeroDragDepth;                                     // 0x24(0x4)
	float                                                        MaxBuoyancyAcceleration;                           // 0x28(0x4)
	float                                                        SubmergedBuoyancyAcceleration;                     // 0x2c(0x4)
	float                                                        SubmergedBuoyancyTime;                             // 0x30(0x4)
	float                                                        DragFactor;                                        // 0x34(0x4)
	float                                                        MaxDragAcceleration;                               // 0x38(0x4)
	float                                                        MinPushDownRoofAngle;                              // 0x3c(0x4)
	float                                                        MinPushDownRoofZ;                                  // 0x40(0x4)
	float                                                        MinCorrectionVelForSurfaceSwim;                    // 0x44(0x4)
	float                                                        SurfaceVelBlendTime;                               // 0x48(0x4)
	float                                                        UnderwaterSwimmingEntryPitch;                      // 0x4c(0x4)
	float                                                        UnderwaterSwimmingEntryAccel;                      // 0x50(0x4)
	float                                                        UnderwaterSwimDepth;                               // 0x54(0x4)
	float                                                        UnderwaterSwimmingDragSpeed;                       // 0x58(0x4)
	float                                                        UnderwaterSwimmingSpeed;                           // 0x5c(0x4)
	float                                                        PitchBlendOffRate;                                 // 0x60(0x4)
	float                                                        MaxSwimDepth;                                      // 0x64(0x4)
	float                                                        MaxSwimDepthBuoyancy;                              // 0x68(0x4)
	float                                                        MaxSwimDepthBuoyancyRange;                         // 0x6c(0x4)
	float                                                        MaxSwimDepthDragFactor;                            // 0x70(0x4)
	float                                                        CharacterCentreOffset;                             // 0x74(0x4)
	byte                                                         WaterDepthTraceQueryType;                          // 0x78(0x1)
	char                                                         pad0x3_S6PTZ[0x3];                                 // 0x79(0x3)
	Struct AthenaCharacterSwimSpeed                              SurfaceSwimSpeeds;                                 // 0x7c(0xc)
	Struct AthenaCharacterSwimSpeed                              UnderwaterSwimSpeeds;                              // 0x88(0xc)
	float                                                        SurfaceSwimmingDepthWhenEnteredWater;              // 0x94(0x4)
};


// Size 0xc
struct AthenaCharacterSwimSpeed
{
public:
	float                                                        SprintSpdAmp;                                      // 0x0(0x4)
	float                                                        SprintAccelAmp;                                    // 0x4(0x4)
	float                                                        TurnSpeedScalar;                                   // 0x8(0x4)
};


// Size 0x10
struct AthenaCharacterDodgeParams
{
public:
	float                                                        DodgeCooldown;                                     // 0x0(0x4)
	float                                                        DodgeForce;                                        // 0x4(0x4)
	float                                                        GroundLaunchAngle;                                 // 0x8(0x4)
	bool                                                         DodgePerpendicularToGround;                        // 0xc(0x1)
	bool                                                         Disabled;                                          // 0xd(0x1)
};


// Size 0x8
struct NetPositionErrorTolerance
{
public:
	float                                                        ZDistance;                                         // 0x0(0x4)
	float                                                        XYDistance;                                        // 0x4(0x4)
};


// Size 0x48
struct AthenaAnimationOverrideEntry
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	Struct StringAssetReference                                  MeshFirstPerson;                                   // 0x8(0x10)
	Struct StringAssetReference                                  MeshThirdPerson;                                   // 0x18(0x10)
	Struct StringAssetReference                                  AnimationDataStore;                                // 0x28(0x10)
	class                                                        ALKFirstPerson;                                    // 0x38(0x8)
	class                                                        ALKThirdPerson;                                    // 0x40(0x8)
};


// Size 0x20
struct PlayModeLevelArray
{
public:
	TArray<struct PlayModeLevels>                                PlayModeLevels;                                    // 0x0(0x10)
	TArray<struct SubModes>                                      SubModes;                                          // 0x10(0x10)
};


// Size 0x20
struct SubModeLevel
{
public:
	Struct FString                                               SubMode;                                           // 0x0(0x10)
	Struct StringAssetReference                                  Level;                                             // 0x10(0x10)
};


// Size 0x18
struct FirstInteractableTelemetryEvent
{
public:
	float                                                        StartTime;                                         // 0x0(0x4)
	float                                                        FirstSpinnerShownTime;                             // 0x4(0x4)
	float                                                        StartEntryLevelLoadTime;                           // 0x8(0x4)
	float                                                        StartLegalSplashTime;                              // 0xc(0x4)
	float                                                        EndLegalSplashTime;                                // 0x10(0x4)
	float                                                        FirstInteractableTime;                             // 0x14(0x4)
};


// Size 0x28
struct LoadingTelemetryEvent
{
public:
	Struct FString                                               LoadingEvent;                                      // 0x0(0x10)
	Struct FString                                               MapName;                                           // 0x10(0x10)
	float                                                        StartTime;                                         // 0x20(0x4)
	float                                                        EndTime;                                           // 0x24(0x4)
};


// Size 0xd8
struct StorageContainerRefresher
{
public:
};


// Size 0x18
struct OnlineAthenaGameModeConfigurationSettings
{
public:
	Struct Timespan                                              PreLoginEntitlementQueryTimeout;                   // 0x0(0x8)
	Struct Timespan                                              PreLoginPirateValidationTimeout;                   // 0x8(0x8)
	bool                                                         ConfigAllowCrossWorld;                             // 0x10(0x1)
};


// Size 0xc
struct ServerLifetimeConfigurationSettings
{
public:
	float                                                        ServerTimeToLiveSeconds;                           // 0x0(0x4)
	float                                                        HeartbeatFrequencySeconds;                         // 0x4(0x4)
	float                                                        MaxTimeToAcceptShutdownRequestSeconds;             // 0x8(0x4)
};


// Size 0x10
struct ServerTelemetryConfigurationSettings
{
public:
	float                                                        PlayerHeartbeatInterval;                           // 0x0(0x4)
	bool                                                         TelemetryEnabled_ItemEquip;                        // 0x4(0x1)
	bool                                                         TelemetryEnabled_ItemUsageEnd;                     // 0x5(0x1)
	bool                                                         TelemetryEnabled_ItemUsageStart;                   // 0x6(0x1)
	bool                                                         TelemetryEnabled_ObjectUsageEnd;                   // 0x7(0x1)
	bool                                                         TelemetryEnabled_ObjectUsageStart;                 // 0x8(0x1)
	bool                                                         TelemetryEnabled_PlayerAction;                     // 0x9(0x1)
	bool                                                         TelemetryEnabled_PlayerChangedLoadout;             // 0xa(0x1)
	bool                                                         TelemetryEnabled_PlayerChangedShipLoadout;         // 0xb(0x1)
	bool                                                         TelemetryEnabled_PlayerHeartbeat;                  // 0xc(0x1)
	bool                                                         TelemetryEnabled_PlayerPerformedEmote;             // 0xd(0x1)
};


// Size 0x20
struct DebugReplicatedAbilityData
{
public:
	Struct AIAbilityDebugReplicatedIntervals                     AbilityIntervals;                                  // 0x0(0xc)
	char                                                         pad0x4_1GZZ8[0x4];                                 // 0xc(0x4)
	class                                                        TypeClass;                                         // 0x10(0x8)
	bool                                                         AbilityInRange;                                    // 0x18(0x1)
	bool                                                         AbilityDebugBlocked;                               // 0x19(0x1)
	bool                                                         UseTimerBetween;                                   // 0x1a(0x1)
	bool                                                         UseDamageBetween;                                  // 0x1b(0x1)
	byte                                                         DamageIntervalBlockMode;                           // 0x1c(0x1)
};


// Size 0x18
struct MakeFriendsEmoteParams
{
public:
	TArray<struct FName>                                         TriggerEmoteNames;                                 // 0x0(0x10)
	float                                                        TriggerDistanceThreshold;                          // 0x10(0x4)
};


// Size 0x8
struct CharacterSocketCollisionServiceParams
{
public:
	float                                                        MaxCharacterDistanceSqr;                           // 0x0(0x4)
	int                                                          MaxSockets;                                        // 0x4(0x4)
};


// Size 0x28
struct MermaidRespawnConfig
{
public:
	float                                                        ScorePenaltyForEachMeterAwayFromShipwreck;         // 0x0(0x4)
	float                                                        MinRespawnLocDistanceFromSunkShip;                 // 0x4(0x4)
	float                                                        MinScorePenaltyForEnemyShipProximity;              // 0x8(0x4)
	float                                                        MaxScorePenaltyForEnemyShipProximity;              // 0xc(0x4)
	float                                                        MaxDistanceFromEnemyShipToApplyPenalty;            // 0x10(0x4)
	float                                                        MinScorePenaltyForAlliedShipProximity;             // 0x14(0x4)
	float                                                        MaxScorePenaltyForAlliedShipProximity;             // 0x18(0x4)
	float                                                        MaxDistanceFromAlliedShipToApplyPenalty;           // 0x1c(0x4)
	float                                                        MaxDistanceFromIslandWeHaveMapForToApplyPenalty;   // 0x20(0x4)
	float                                                        ScorePenaltyForIslandsWeHaveMapFor;                // 0x24(0x4)
};


// Size 0x38
struct DigSurfaceTypeParams
{
public:
	byte                                                         SurfaceType;                                       // 0x0(0x1)
	char                                                         pad0x7_544UW[0x7];                                 // 0x1(0x7)
	Struct DigEventFxParams                                      EnterGroundFx;                                     // 0x8(0x18)
	Struct DigEventFxParams                                      LeaveGroundFx;                                     // 0x20(0x18)
};


// Size 0x18
struct DigEventFxParams
{
public:
	Class Object*                                                Particles;                                         // 0x0(0x8)
	bool                                                         bAttachParticlesToShovel;                          // 0x8(0x1)
	char                                                         pad0x7_FCW7P[0x7];                                 // 0x9(0x7)
	Class ForceFeedbackEffect*                                   Rumble;                                            // 0x10(0x8)
};


// Size 0x18
struct SurfaceDigHole
{
public:
	byte                                                         SurfaceType;                                       // 0x0(0x1)
	char                                                         pad0x7_O2C81[0x7];                                 // 0x1(0x7)
	class                                                        DigHoleClass;                                      // 0x8(0x8)
	float                                                        DigAINoiseRange;                                   // 0x10(0x4)
};


// Size 0x60
struct SharedShovelParams
{
public:
	Struct ShovelSurfaceDigType                                  DigSurfaceDigType;                                 // 0x0(0x10)
	byte                                                         SandSurfaceType;                                   // 0x10(0x1)
	byte                                                         WetSandSurfaceType;                                // 0x11(0x1)
	char                                                         pad0x2_RNJQC[0x2];                                 // 0x12(0x2)
	float                                                        MaxHeightDifferenceToNotBeConsideredWetSand;       // 0x14(0x4)
	Struct Vector                                                DigPosOffsetFromPlayerPos;                         // 0x18(0xc)
	float                                                        SurfaceTypeRaycastLength;                          // 0x24(0x4)
	float                                                        MaxSurfaceAngleForDig;                             // 0x28(0x4)
	float                                                        InitialSphereCastRadiusForSuccessfulDig;           // 0x2c(0x4)
	byte                                                         ItemProxyCollisionChannel;                         // 0x30(0x1)
	char                                                         pad0x3_X9W2G[0x3];                                 // 0x31(0x3)
	float                                                        SphereRadiusForItemProxySweep;                     // 0x34(0x4)
	float                                                        RequiredObstacleFreeRadiusForSuccessfulDig;        // 0x38(0x4)
	float                                                        ObstacleCheckStartOffsetZFromSphereTestPos;        // 0x3c(0x4)
	int                                                          NumSamplesForBlockingSurfacesTest;                 // 0x40(0x4)
	float                                                        MaxWaterDepthToStartSuccessfulDig;                 // 0x44(0x4)
	byte                                                         HitTestTraceChannel;                               // 0x48(0x1)
	char                                                         pad0x3_ATRZ7[0x3];                                 // 0x49(0x3)
	float                                                        MinPlanarTestRadius;                               // 0x4c(0x4)
	int                                                          NumSamplesForPlanarityTest;                        // 0x50(0x4)
	float                                                        MaxBumpinessForPlanarityTestInCm;                  // 0x54(0x4)
	float                                                        AssumedPlayerWaistHeight;                          // 0x58(0x4)
	bool                                                         bDrawDebug;                                        // 0x5c(0x1)
};


// Size 0x10
struct ShovelSurfaceDigType
{
public:
	TArray<struct SurfaceDigType>                                SurfaceDigType;                                    // 0x0(0x10)
};


// Size 0x2
struct SurfaceDigType
{
public:
	byte                                                         SurfaceType;                                       // 0x0(0x1)
	byte                                                         DigType;                                           // 0x1(0x1)
};


// Size 0x60
struct CrewServiceParams
{
public:
	float                                                        MinSafeDistanceToShip;                             // 0x0(0x4)
	float                                                        SpawnDistAroundSunkenShip;                         // 0x4(0x4)
	TArray<Int VotesRequiredForSendToBrig>                       VotesRequiredForSendToBrig;                        // 0x8(0x10)
	TArray<Int VotesRequiredForReleaseFromBrig>                  VotesRequiredForReleaseFromBrig;                   // 0x18(0x10)
	TArray<Int VotesRequiredForScuttleShip>                      VotesRequiredForScuttleShip;                       // 0x28(0x10)
	TArray<Int VotesRequiredForChangeMatchmakingVisibility>      VotesRequiredForChangeMatchmakingVisibility;       // 0x38(0x10)
	TArray<Int VotesRequiredForArenaRivalVote>                   VotesRequiredForArenaRivalVote;                    // 0x48(0x10)
	float                                                        BrigMinReleaseTime;                                // 0x58(0x4)
	float                                                        BrigServerTimeToRememberPastCrewMates;             // 0x5c(0x4)
};


// Size 0x88
struct MermaidServiceParams
{
public:
	float                                                        LocallyActiveMermaidCheckInterval;                 // 0x0(0x4)
	float                                                        PlayerAbandonedCheckInterval;                      // 0x4(0x4)
	float                                                        MinDestroyDistancePlayerToMermaidIfPlayerNearEnemyShip; // 0x8(0x4)
	float                                                        MinDestroyDistancePlayerToMermaidIfPlayerNearIsland; // 0xc(0x4)
	float                                                        MinDestroyDistancePlayerToMermaidIfPlayerNotNearIsland; // 0x10(0x4)
	float                                                        MaxDistFromCoastForPlayerToCountAsNearIsland;      // 0x14(0x4)
	float                                                        MaxDistFromCoastForShipToCountAsNearIsland;        // 0x18(0x4)
	float                                                        MinPlayerToShipDistForPlayerToQualifyAsAbandoned;  // 0x1c(0x4)
	float                                                        MinPlayerToShipDistForPlayerToBeClearedOfAbandonedStatus; // 0x20(0x4)
	float                                                        MinPlayerToEnemyShipDistForPlayerToQualifyForStealthSpawns; // 0x24(0x4)
	float                                                        MinPlayerToWatercraftDistForPlayerToQualifyAsAbandoned; // 0x28(0x4)
	float                                                        MinDistFromAnyMermaidForPlayerToBeAbandonedIfPlayerNotNearIsland; // 0x2c(0x4)
	float                                                        MinDistFromAnyMermaidForPlayerToBeAbandonedIfPlayerNearIsland; // 0x30(0x4)
	int                                                          MaxNumberOfConcurrentMermaids;                     // 0x34(0x4)
	float                                                        MinLifeTimeOfMermaidBeforeCanBeCulledInPopulationCheck; // 0x38(0x4)
	float                                                        SpawnDistAroundSaviourMermaid;                     // 0x3c(0x4)
	Struct MermaidServiceMermaidSpawnParams                      SpawnParams;                                       // 0x40(0x48)
};


// Size 0x48
struct MermaidServiceMermaidSpawnParams
{
public:
	float                                                        MinDistFromSpawnOrigin;                            // 0x0(0x4)
	float                                                        MinDistFromSpawnOriginForDestroyedShip;            // 0x4(0x4)
	float                                                        MaxDistFromSpawnOriginBeforeGivingUp;              // 0x8(0x4)
	float                                                        DistIncrementPerFailedSpawnCircle;                 // 0xc(0x4)
	int                                                          NumSamplesInSpawnCircle;                           // 0x10(0x4)
	float                                                        SpawnCastStartZ;                                   // 0x14(0x4)
	float                                                        MinSpawnDepth;                                     // 0x18(0x4)
	float                                                        SpawnHalfConeAngleRestrictIfSpawningForPlayer;     // 0x1c(0x4)
	byte                                                         HitTestTraceChannel;                               // 0x20(0x1)
	char                                                         pad0x3_FAAXU[0x3];                                 // 0x21(0x3)
	float                                                        AssumedMermaidRadius;                              // 0x24(0x4)
	float                                                        MinDistanceOfFinalSpawnPosToAnyActiveMermaid;      // 0x28(0x4)
	float                                                        MinDistanceOfFinalSpawnPosToAnyActiveMermaidWhenNearEnemyShip; // 0x2c(0x4)
	float                                                        MinDistFromEdgeOfWorld;                            // 0x30(0x4)
	float                                                        MinAngularStepSize;                                // 0x34(0x4)
	float                                                        MaxAngularStepSize;                                // 0x38(0x4)
	float                                                        MinDistanceIncrementPerFail;                       // 0x3c(0x4)
	float                                                        MaxDistanceIncrementPerFail;                       // 0x40(0x4)
	float                                                        AdditionalDistanceFromOriginMultiplierPerMeter;    // 0x44(0x4)
};


// Size 0xc
struct PlayerModerationParams
{
public:
	float                                                        PlayerReportableDistance;                          // 0x0(0x4)
	float                                                        PlayerReportableTimeBetweenChecksInSeconds;        // 0x4(0x4)
	float                                                        RemovePlayerFromListAfterSeconds;                  // 0x8(0x4)
};


// Size 0x18
struct ToggleableAIShipServiceDataAssetFileLocation
{
public:
	struct FName                                                 ToggleName;                                        // 0x0(0x8)
	Struct StringAssetReference                                  Location;                                          // 0x8(0x10)
};


// Size 0x60
struct FirstPersonAnimaticActionStateConstructionInfo
{
public:
	Struct FirstPersonAnimaticSettings                           FirstPersonAnimaticSettings;                       // 0x30(0x2c)
};


// Size 0x2c
struct FirstPersonAnimaticSettings
{
public:
	Struct Vector                                                CutsceneFirstPersonMeshOffset;                     // 0x0(0xc)
	Struct Rotator                                               CutsceneRotation;                                  // 0xc(0xc)
	float                                                        TimeBeforeFadeIn;                                  // 0x18(0x4)
	float                                                        FadeInDuration;                                    // 0x1c(0x4)
	float                                                        FirstPersonMeshBoundsScale;                        // 0x20(0x4)
	struct FName                                                 FirstPersonAnimName;                               // 0x24(0x8)
};


// Size 0x58
struct CharacterAnimaticSettings
{
public:
};


// Size 0x10
struct UIReturnedToPlayerEvent
{
public:
};


// Size 0x10
struct NetworkEventStruct
{
public:
};


// Size 0x1
struct EventPlayerControllerKillNotification
{
public:
	bool                                                         PlaySfx;                                           // 0x0(0x1)
};


// Size 0x1
struct EventPlayerControllerHitNotification
{
public:
	bool                                                         PlaySfx;                                           // 0x0(0x1)
};


// Size 0x1
struct EventPlayerControllerHitNotificationOld
{
public:
	bool                                                         PlaySfx;                                           // 0x0(0x1)
};


// Size 0x10
struct EventClientPlayerSpawnedBeforeGameState
{
public:
};


// Size 0x10
struct EventPlayerTeleportToSafety
{
public:
};


// Size 0x8
struct EventPlayerControllerUnPossess
{
public:
	Class Pawn*                                                  Pawn;                                              // 0x0(0x8)
};


// Size 0x8
struct EventPlayerControllerPossess
{
public:
	Class Pawn*                                                  Pawn;                                              // 0x0(0x8)
};


// Size 0x8
struct EventAthenaPlayerControllerEndingPlay
{
public:
	Class AthenaPlayerController*                                Controller;                                        // 0x0(0x8)
};


// Size 0x8
struct EventAthenaPlayerControllerBegunPlay
{
public:
	Class AthenaPlayerController*                                Controller;                                        // 0x0(0x8)
};


// Size 0x8
struct EventPlayerControllerDestroyedCalled
{
public:
	Class AthenaPlayerController*                                Controller;                                        // 0x0(0x8)
};


// Size 0x30
struct QuestTypeParams
{
public:
	Class WeightedTreasureChestDescAsset*                        ReferencedRewards;                                 // 0x8(0x8)
	TArray<struct Rewards>                                       Rewards;                                           // 0x10(0x10)
	Class WeightedItemDescSpawnDataAsset*                        RewardsAsset;                                      // 0x20(0x8)
	class                                                        OverrideTreasureMapItemDesc;                       // 0x28(0x8)
};


// Size 0x18
struct WeightedTreasureChestDesc
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	struct FName                                                 Feature;                                           // 0x4(0x8)
	char                                                         pad0x4_AY16W[0x4];                                 // 0xc(0x4)
	class                                                        Desc;                                              // 0x10(0x8)
};


// Size 0x180
struct BountyQuestParams
{
public:
	Class AIBountySpawner*                                       Spawner;                                           // 0x30(0x8)
	Struct BountyQuestRandomSpawnGeneratorParams                 BountyQuestRandomSpawnGeneratorParams;             // 0x38(0x148)
};


// Size 0x148
struct BountyQuestRandomSpawnGeneratorParams
{
public:
	Struct WeightedProbabilityRange                              NumberOfWaves;                                     // 0x0(0x20)
	Struct WeightedProbabilityRange                              NumberOfWaveGroups;                                // 0x20(0x20)
	int                                                          MinNumberOfAIPerWave;                              // 0x40(0x4)
	int                                                          MaxNumberOfAIPerWave;                              // 0x44(0x4)
	TArray<Int AdditionalAIPerPlayer>                            AdditionalAIPerPlayer;                             // 0x48(0x10)
	int                                                          MinFormsPerEncounter;                              // 0x58(0x4)
	int                                                          MaxFormsPerEncounter;                              // 0x5c(0x4)
	bool                                                         AllowMultipleFormsPerWave;                         // 0x60(0x1)
	char                                                         pad0x7_0NRX2[0x7];                                 // 0x61(0x7)
	Struct WeightedProbabilityRange                              FormsPerWave;                                      // 0x68(0x20)
	int                                                          MinVarietiesPerEncounter;                          // 0x88(0x4)
	int                                                          MaxVarietiesPerEncounter;                          // 0x8c(0x4)
	float                                                        MinTimeBetweenSpawns;                              // 0x90(0x4)
	float                                                        MaxTimeBetweenSpawns;                              // 0x94(0x4)
	float                                                        MinTimeBetweenWaves;                               // 0x98(0x4)
	float                                                        MaxTimeBetweenWaves;                               // 0x9c(0x4)
	Struct WeightedProbabilityRange                              WavesPerRelocate;                                  // 0xa0(0x20)
	Struct WeightedProbabilityRange                              WaveSplitChance;                                   // 0xc0(0x20)
	TArray<Float WaveSuicideTime>                                WaveSuicideTime;                                   // 0xe0(0x10)
	float                                                        WaveSuicideMinDist;                                // 0xf0(0x4)
	char                                                         pad0x4_PJ908[0x4];                                 // 0xf4(0x4)
	Class AIEncounterGenerationRecipeRankOrderList*              Recipes;                                           // 0xf8(0x8)
	Struct WeightedProbabilityRange                              NumberOfTargetsTotal;                              // 0x100(0x20)
	Struct WeightedProbabilityRange                              NumberOfTargetsWhichAreCaptains;                   // 0x120(0x20)
	float                                                        ChanceOfAllTargetsBeingOnTheLastWave;              // 0x140(0x4)
	float                                                        ChanceOfFemale;                                    // 0x144(0x4)
};


// Size 0x88
struct CargoRunQuestParams
{
public:
	Struct WeightedProbabilityRange                              NumberOfRequiredItems;                             // 0x30(0x20)
	Struct WeightedProbabilityRangeOfRanges                      TimeLimitInMinutes;                                // 0x50(0x30)
	Class CargoRunQuestRandomRequiredItemsDataAsset*             RequiredItemsDataAsset;                            // 0x80(0x8)
};


// Size 0x1
struct EmergantVoyageQuestParams
{
public:
};


// Size 0x1
struct MatchmakingQuestParams
{
public:
};


// Size 0x1
struct RewardQuestParams
{
public:
};


// Size 0x1
struct StagingQuestParams
{
public:
};


// Size 0x18
struct MerchantQuestCategoryGroup
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	TArray<struct RequiredItemEntries>                           RequiredItemEntries;                               // 0x8(0x10)
};


// Size 0x10
struct MerchantQuestRandomRequiredItemsEntry
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	int                                                          MaxNum;                                            // 0x4(0x4)
	Class MerchantQuestItemData*                                 RequiredItem;                                      // 0x8(0x8)
};


// Size 0x1c
struct MerchantQuestCategoryGroupBounds
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	int                                                          MinNum;                                            // 0xc(0x4)
	int                                                          MaxNum;                                            // 0x10(0x4)
	int                                                          MinDifferent;                                      // 0x14(0x4)
	int                                                          MaxDifferent;                                      // 0x18(0x4)
};


// Size 0xc0
struct MerchantQuestParams
{
public:
	Struct WeightedProbabilityRange                              NumberOfRequiredItems;                             // 0x30(0x20)
	Struct WeightedProbabilityRangeOfRanges                      TimeLimitInMinutes;                                // 0x50(0x30)
	Class MerchantQuestRequiredItemsDataAsset*                   RequiredItemsDataAsset;                            // 0x80(0x8)
	Class MerchantQuestRandomRequiredItemsDataAsset*             RandomRequiredItemsDataAsset;                      // 0x88(0x8)
	Struct WeightedProbabilityRange                              NumberOfGroups;                                    // 0x90(0x20)
	TArray<struct CategoryGroupBounds>                           CategoryGroupBounds;                               // 0xb0(0x10)
};


// Size 0x40
struct RiddleQuestParams
{
public:
	Class BoobyTrapSpawnerDataAsset*                             BoobyTrapSpawnerDataAsset;                         // 0x38(0x8)
};


// Size 0x38
struct TaleQuestParams
{
public:
	Class TaleQuestDescAsset*                                    TaleQuestAsset;                                    // 0x30(0x8)
};


// Size 0x88
struct XMarksTheSpotQuestParams
{
public:
	Struct WeightedProbabilityRange                              NumTreasureLocations;                              // 0x30(0x20)
	Class BoobyTrapSpawnerDataAsset*                             BoobyTrapSpawnerDataAsset;                         // 0x50(0x8)
	TArray<class BoobyTrapSpawnerDataAsset*>                     UniqueTreasureLocationBoobyTraps;                  // 0x58(0x10)
	TArray<class WeightedTreasureChestDescAsset*>                UniqueTreasureLocationRewards;                     // 0x68(0x10)
	TArray<class WeightedItemDescSpawnDataAsset*>                UniqueTreasureLocationRewardsAssets;               // 0x78(0x10)
};


// Size 0x3f0
struct WeightedQuestParams
{
public:
	TArray<Byte LocationFilters>                                 LocationFilters;                                   // 0x0(0x10)
	float                                                        Weight;                                            // 0x10(0x4)
	char                                                         pad0x4_S0DMO[0x4];                                 // 0x14(0x4)
	Struct QuestParams                                           Params;                                            // 0x18(0x3d8)
};


// Size 0x3d8
struct QuestParams
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	char                                                         pad0x7_IX00O[0x7];                                 // 0x1(0x7)
	Struct XMarksTheSpotQuestParams                              XMarksTheSpot;                                     // 0x8(0x88)
	Struct RiddleQuestParams                                     Riddle;                                            // 0x90(0x40)
	Struct BountyQuestParams                                     Bounty;                                            // 0xd0(0x180)
	Struct MerchantQuestParams                                   Merchant;                                          // 0x250(0xc0)
	Struct CargoRunQuestParams                                   CargoRun;                                          // 0x310(0x88)
	Struct TaleQuestParams                                       Tale;                                              // 0x398(0x38)
	Struct MatchmakingQuestParams                                Matchmake;                                         // 0x3d0(0x1)
	Struct StagingQuestParams                                    Staging;                                           // 0x3d1(0x1)
	Struct EmergantVoyageQuestParams                             EmergantVoyage;                                    // 0x3d2(0x1)
	Struct RewardQuestParams                                     Reward;                                            // 0x3d3(0x1)
};


// Size 0x18
struct WeightedVoyageLocationParams
{
public:
	byte                                                         Filter;                                            // 0x0(0x1)
	char                                                         pad0x3_0TCHG[0x3];                                 // 0x1(0x3)
	float                                                        Weight;                                            // 0x4(0x4)
	TArray<struct Locations>                                     Locations;                                         // 0x8(0x10)
};


// Size 0x58
struct VoyageLocationParams
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	char                                                         pad0x3_9UHPV[0x3];                                 // 0x1(0x3)
	Struct VoyageLocationFixedParams                             Fixed;                                             // 0x4(0x8)
	char                                                         pad0x4_5PIU3[0x4];                                 // 0xc(0x4)
	Struct VoyageLocationRandomParams                            Random;                                            // 0x10(0x48)
};


// Size 0x48
struct VoyageLocationRandomParams
{
public:
	bool                                                         NPCsOnly;                                          // 0x0(0x1)
	bool                                                         CargoRunNPCsOnly;                                  // 0x1(0x1)
	bool                                                         Feature;                                           // 0x2(0x1)
	bool                                                         Resource;                                          // 0x3(0x1)
	bool                                                         Outpost;                                           // 0x4(0x1)
	bool                                                         Fort;                                              // 0x5(0x1)
	bool                                                         SeaPost;                                           // 0x6(0x1)
	bool                                                         HasLandmarks;                                      // 0x7(0x1)
	bool                                                         OnlyNamedIslands;                                  // 0x8(0x1)
	char                                                         pad0x7_73BFX[0x7];                                 // 0x9(0x7)
	Class VoyageLocationOnlyNamedIslandListDataAsset*            OnlyNamedIslandsListDataAsset;                     // 0x10(0x8)
	TArray<class Class*>                                         Seas;                                              // 0x18(0x10)
	bool                                                         WithinDistance;                                    // 0x28(0x1)
	char                                                         pad0x3_ALHPA[0x3];                                 // 0x29(0x3)
	Struct VoyageLocationDistance                                Distance;                                          // 0x2c(0x8)
};


// Size 0x8
struct VoyageLocationDistance
{
public:
	float                                                        Min;                                               // 0x0(0x4)
	float                                                        Max;                                               // 0x4(0x4)
};


// Size 0x8
struct VoyageLocationFixedParams
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
};


// Size 0x30
struct QuestPoolParams
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	char                                                         pad0x4_DTXET[0x4];                                 // 0x4(0x4)
	TArray<struct Quests>                                        Quests;                                            // 0x8(0x10)
	TArray<struct Location>                                      Location;                                          // 0x18(0x10)
	bool                                                         ChainLocations;                                    // 0x28(0x1)
	bool                                                         AllowRepeatIslandsWithinQuest;                     // 0x29(0x1)
	bool                                                         LimitTimesCanBeSelected;                           // 0x2a(0x1)
	char                                                         pad0x1_YKITU[0x1];                                 // 0x2b(0x1)
	int                                                          MaxTimesCanBeSelected;                             // 0x2c(0x4)
};


// Size 0x140
struct VoyageRecipe
{
public:
	Struct QuestDistributionParams                               QuestDistribution;                                 // 0x0(0xc8)
	Struct QuestSelectionParams                                  QuestSelection;                                    // 0xc8(0x8)
	TArray<struct QuestPools>                                    QuestPools;                                        // 0xd0(0x10)
	bool                                                         UseFixedFinalQuestPool;                            // 0xe0(0x1)
	bool                                                         RandomiseChapters;                                 // 0xe1(0x1)
	char                                                         pad0x6_C3JYJ[0x6];                                 // 0xe2(0x6)
	Struct QuestPoolParams                                       FixedFinalQuestPool;                               // 0xe8(0x30)
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x118(0x1)
	bool                                                         DoNotNotifyParticipantsOnQuestsReceived;           // 0x119(0x1)
	char                                                         pad0x6_E9XQU[0x6];                                 // 0x11a(0x6)
	TArray<struct CompletionStats>                               CompletionStats;                                   // 0x120(0x10)
	TArray<struct ReapersMarkCompletionStats>                    ReapersMarkCompletionStats;                        // 0x130(0x10)
};


// Size 0x8
struct QuestSelectionParams
{
public:
	byte                                                         PoolSelectionMethod;                               // 0x0(0x1)
	byte                                                         LocationSelectionMethod;                           // 0x1(0x1)
	bool                                                         UseChapterBasedVoyageHistory;                      // 0x2(0x1)
	char                                                         pad0x1_PFA5R[0x1];                                 // 0x3(0x1)
	int                                                          MaxNumberOfPoolRetries;                            // 0x4(0x4)
};


// Size 0xc8
struct QuestDistributionParams
{
public:
	byte                                                         Method;                                            // 0x0(0x1)
	char                                                         pad0x7_PFLKP[0x7];                                 // 0x1(0x7)
	Struct QuestDistributionAllAtOnceParams                      AllAtOnce;                                         // 0x8(0x40)
	Struct QuestDistributionPerChapterParams                     PerChapter;                                        // 0x48(0x68)
	Struct QuestDistributionFixedChaptersParams                  FixedChapters;                                     // 0xb0(0x18)
};


// Size 0x18
struct QuestDistributionFixedChaptersParams
{
public:
	bool                                                         UseProceduralQuestRewards;                         // 0x0(0x1)
	char                                                         pad0x3_QRAW0[0x3];                                 // 0x1(0x3)
	int                                                          NumChapters;                                       // 0x4(0x4)
	TArray<struct Chapters>                                      Chapters;                                          // 0x8(0x10)
};


// Size 0x10
struct ChapterDataEntry
{
public:
	int                                                          NumQuests;                                         // 0x0(0x4)
	char                                                         pad0x4_BLTBV[0x4];                                 // 0x4(0x4)
	Class VoyageRewardDataAsset*                                 PerChapterRewardAsset;                             // 0x8(0x8)
};


// Size 0x68
struct QuestDistributionPerChapterParams
{
public:
	int                                                          MinNumChapters;                                    // 0x0(0x4)
	char                                                         pad0x4_2CCMH[0x4];                                 // 0x4(0x4)
	Struct WeightedProbabilityRange                              NumQuests;                                         // 0x8(0x20)
	Struct WeightedProbabilityRange                              NumQuestsInFirstChapter;                           // 0x28(0x20)
	Struct WeightedProbabilityRange                              NumQuestsInOtherChapters;                          // 0x48(0x20)
};


// Size 0x40
struct QuestDistributionAllAtOnceParams
{
public:
	Struct WeightedProbabilityRange                              NumQuests;                                         // 0x0(0x20)
	Struct WeightedProbabilityRange                              QuestsPerChapter;                                  // 0x20(0x20)
};


// Size 0x18
struct ContestTimerData
{
public:
	float                                                        Time;                                              // 0x0(0x4)
	char                                                         pad0x4_AIYT8[0x4];                                 // 0x4(0x4)
	Struct FString                                               ServicesConfigRetrievalString;                     // 0x8(0x10)
};


// Size 0x1b8
struct EmergentContestVoyageRecipe
{
public:
	bool                                                         IsSharableVoyage;                                  // 0x140(0x1)
	char                                                         pad0x7_G76HT[0x7];                                 // 0x141(0x7)
	Struct ContestZoneDistribution                               WeightedContestZonesToActivate;                    // 0x148(0x10)
	Struct ContestTimerData                                      ContestVoyageTime;                                 // 0x158(0x18)
	Struct StringClassReference                                  ScoreSystemToLoad;                                 // 0x170(0x10)
	Struct FText                                                 ContestArenaName;                                  // 0x180(0x38)
};


// Size 0x10
struct ContestZoneDistribution
{
public:
	TArray<struct WeightedContestZones>                          WeightedContestZones;                              // 0x0(0x10)
};


// Size 0xc
struct WeightedContestZone
{
public:
	struct FName                                                 ContestZoneName;                                   // 0x0(0x8)
	int                                                          Weight;                                            // 0x8(0x4)
};


// Size 0x10
struct ContestIslandArchetype
{
public:
	TArray<struct AvailableIslands>                              AvailableIslands;                                  // 0x0(0x10)
};


// Size 0x10
struct WeightedContestIslandData
{
public:
	Struct ContestVoyageIslandData                               IslandData;                                        // 0x0(0xc)
	int                                                          WeightedChance;                                    // 0xc(0x4)
};


// Size 0xc
struct ContestVoyageIslandData
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	int                                                          MaxItemCountForIsland;                             // 0x8(0x4)
};


// Size 0x58
struct EventCharacterHitReaction
{
public:
	Struct ImpactDamageEvent                                     ImpactDamage;                                      // 0x0(0x58)
};


// Size 0x1
struct EventPlayerCharacterPuzzleVaultIncorrect
{
public:
};


// Size 0x1
struct EventPlayerCharacterPuzzleVaultComplete
{
public:
};


// Size 0x8
struct EventPlayerCharacterInPuzzleVaultChanged
{
public:
	bool                                                         IsInPuzzleVault;                                   // 0x0(0x1)
	char                                                         pad0x3_04X77[0x3];                                 // 0x1(0x3)
	float                                                        CurrentWaterLevel;                                 // 0x4(0x4)
};


// Size 0xc
struct EventItemUseAINoiseEvent
{
public:
	float                                                        NoiseRange;                                        // 0x0(0x4)
	struct FName                                                 NoiseTag;                                          // 0x4(0x8)
};


// Size 0x10
struct EventAnimationShopInteraction
{
public:
	bool                                                         Active;                                            // 0x0(0x1)
	byte                                                         Type;                                              // 0x1(0x1)
	char                                                         pad0x6_HMILA[0x6];                                 // 0x2(0x6)
	Class Actor*                                                 Interactor;                                        // 0x8(0x8)
};


// Size 0x1
struct EventFaceTargetEnabled
{
public:
	bool                                                         Enabled;                                           // 0x0(0x1)
};


// Size 0x1
struct EventRemoteCharacterStartedDig
{
public:
};


// Size 0xc
struct EventRequestVomit
{
public:
};


// Size 0x1
struct EventIsDrunk
{
public:
	bool                                                         bIsDrunk;                                          // 0x0(0x1)
};


// Size 0x8
struct EventFallWithDamageLegNotBroken
{
public:
	struct FName                                                 RumbleTag;                                         // 0x0(0x8)
};


// Size 0x1
struct EventHealedLeg
{
public:
};


// Size 0x8
struct EventBrokeLeg
{
public:
	struct FName                                                 RumbleTag;                                         // 0x0(0x8)
};


// Size 0x1
struct EventPlayerGhostShipWhiteOutStarted
{
public:
};


// Size 0x1
struct EventCharacterRestarted
{
public:
};


// Size 0x84
struct EventCharacterLanded
{
public:
	Struct HitResult                                             HitResult;                                         // 0x0(0x80)
	float                                                        VerticalSpeed;                                     // 0x80(0x4)
};


// Size 0x1
struct EventCharacterJumped
{
public:
};


// Size 0x1
struct EventCharacterDestroyed
{
public:
};


// Size 0x8
struct EventCharacterInteraction
{
public:
	Class Object*                                                Interactable;                                      // 0x0(0x8)
};


// Size 0x1c
struct ClientTelemetryConfigurationSettings
{
public:
	float                                                        HighMemoryPerformanceHeartbeatIntervalSeconds;     // 0x0(0x4)
	float                                                        HighMemoryThresholdDurango;                        // 0x4(0x4)
	float                                                        HighMemoryThresholdEdmonton;                       // 0x8(0x4)
	float                                                        HighMemoryThresholdScorpio;                        // 0xc(0x4)
	float                                                        HighMemoryThresholdLockhart;                       // 0x10(0x4)
	float                                                        HighMemoryThresholdAnaconda;                       // 0x14(0x4)
	float                                                        PlayerAggregatePositionInterval;                   // 0x18(0x4)
};


// Size 0x4
struct UISlatePerformanceTelemetryFragment
{
public:
};


// Size 0x10
struct ResolutionTelemetryFragment
{
public:
	float                                                        ScreenPercentage;                                  // 0x8(0x4)
	bool                                                         DynamicResolution;                                 // 0xc(0x1)
};


// Size 0x18
struct ShippingStatsTelemetryFragment
{
public:
	Struct JsonObjectWrapper                                     Json;                                              // 0x0(0x18)
};


// Size 0xe0
struct AudioDataTelemetryFragment
{
public:
	TArray<UInt32 WwiseStateGroups>                              WwiseStateGroups;                                  // 0x20(0x10)
	TArray<UInt32 WwiseStateValues>                              WwiseStateValues;                                  // 0x30(0x10)
	TArray<UInt32 PeakProxyCountsPools>                          PeakProxyCountsPools;                              // 0x40(0x10)
	TArray<UInt32 PeakProxyCounts>                               PeakProxyCounts;                                   // 0x50(0x10)
	TArray<UInt32 StreamFindFailedIDs>                           StreamFindFailedIDs;                               // 0x60(0x10)
	TArray<UInt32 StreamOpenFailedIDs>                           StreamOpenFailedIDs;                               // 0x70(0x10)
	TArray<UInt32 StreamReadFailedIDs>                           StreamReadFailedIDs;                               // 0x80(0x10)
	TArray<struct FailedToLoadBankIDs>                           FailedToLoadBankIDs;                               // 0x90(0x10)
	float                                                        AverageIOBytesPerSecondRead;                       // 0xac(0x4)
	Struct FrameDurationDataTelemetryFragment                    FrameKickoffTimesInMs;                             // 0xb0(0x10)
	Struct FrameDurationDataTelemetryFragment                    UpdateDurationsInMs;                               // 0xc0(0x10)
	Struct FrameDurationDataTelemetryFragment                    TritonQueryAcousticsTimesInMs;                     // 0xd0(0x10)
};


// Size 0x10
struct FrameDurationDataTelemetryFragment
{
public:
	float                                                        Min;                                               // 0x0(0x4)
	float                                                        Max;                                               // 0x4(0x4)
	float                                                        Average;                                           // 0x8(0x4)
	float                                                        StdDeviation;                                      // 0xc(0x4)
};


// Size 0x8
struct SoundBankFailureTelemetryEntry
{
public:
};


// Size 0x20
struct PlayFabPartyTelemetryFragment
{
public:
	TArray<struct PerNetworkStats>                               PerNetworkStats;                                   // 0x10(0x10)
};


// Size 0x28
struct PlayFabPartyNetworkStats
{
public:
};


// Size 0x18
struct FrameTypeTelemetryFragment
{
public:
};


// Size 0x8
struct RefreshRateTelemetryFragment
{
public:
	bool                                                         Supports120Hz;                                     // 0x0(0x1)
	char                                                         pad0x3_4WFLY[0x3];                                 // 0x1(0x3)
};


// Size 0x1
struct HDRTelemetryFragment
{
public:
	bool                                                         HDR;                                               // 0x0(0x1)
};


// Size 0x10
struct UIFrameDurationDataTelemetryFragment
{
public:
	float                                                        Min;                                               // 0x0(0x4)
	float                                                        Max;                                               // 0x4(0x4)
	float                                                        Average;                                           // 0x8(0x4)
	float                                                        StdDeviation;                                      // 0xc(0x4)
};


// Size 0x18
struct GarbageCollectionFrametimeTelemetryFragment
{
public:
	TArray<Float GCFrametimesMs>                                 GCFrametimesMs;                                    // 0x0(0x10)
	float                                                        MaxGCFrametimeMs;                                  // 0x10(0x4)
};


// Size 0x20
struct HitchDataTelemetryFragment
{
public:
};


// Size 0xc
struct StutterDataTelemetryFragment
{
public:
	float                                                        StutterFramePercentage;                            // 0x0(0x4)
	float                                                        StutterFrameDeltaMax;                              // 0x4(0x4)
	float                                                        StutterFrameDeltaAverage;                          // 0x8(0x4)
};


// Size 0x20
struct ServerNetworkDataTelemetryFragment
{
public:
	Struct PacketDiscardStats                                    DiscardedPackets;                                  // 0x0(0x20)
};


// Size 0x28
struct NetworkDataTelemetryFragmentInput
{
public:
};


// Size 0x1
struct TelemetryFragmentInput
{
public:
};


// Size 0x28
struct NetworkDataTelemetryFragment
{
public:
};


// Size 0x18
struct PerformanceTelemetryFragmentInput
{
public:
};


// Size 0x170
struct MemoryDataTelemetryFragment
{
public:
	TArray<struct TableInfo>                                     TableInfo;                                         // 0xd0(0x10)
	int                                                          HighMemoryThresholdPercentage;                     // 0x118(0x4)
	char                                                         pad0x4_PZQEX[0x4];                                 // 0x11c(0x4)
};


// Size 0x18
struct MemoryTableData
{
public:
};


// Size 0x50
struct InventoryMemory
{
public:
};


// Size 0x10
struct IslandEventIcons
{
public:
	Class Texture*                                               ActiveEventIcon;                                   // 0x0(0x8)
	Class Texture*                                               InactiveEventIcon;                                 // 0x8(0x8)
};


// Size 0x58
struct CanvasWorldMapShipLocation
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	class                                                        ShipSize;                                          // 0x10(0x8)
	Struct Vector2D                                              Location;                                          // 0x18(0x8)
	float                                                        Rotation;                                          // 0x20(0x4)
	Struct CanvasLerpData                                        LerpData;                                          // 0x24(0x10)
	bool                                                         IsInAlliance;                                      // 0x34(0x1)
	bool                                                         IsInFaction;                                       // 0x35(0x1)
	bool                                                         IsFactionMaxRank;                                  // 0x36(0x1)
	bool                                                         IsInvadingShip;                                    // 0x37(0x1)
	struct FName                                                 CrewFactionName;                                   // 0x38(0x8)
	byte                                                         ReapersMarkLevel;                                  // 0x40(0x1)
	byte                                                         EmissaryLevel;                                     // 0x41(0x1)
	bool                                                         IsContestShip;                                     // 0x42(0x1)
	char                                                         pad0x5_GH6KD[0x5];                                 // 0x43(0x5)
	Class Texture*                                               CrewLiveryOverlayIcon;                             // 0x48(0x8)
	bool                                                         IsReapersTrackedShip;                              // 0x50(0x1)
	bool                                                         IsInTunnel;                                        // 0x51(0x1)
};


// Size 0x10
struct CanvasLerpData
{
public:
	float                                                        LerpTime;                                          // 0x0(0x4)
	float                                                        EaseExponent;                                      // 0x4(0x4)
};


// Size 0x20
struct CanvasWorldMapGeneric
{
public:
	Class Actor*                                                 MarkerActor;                                       // 0x0(0x8)
	Class Texture*                                               Icon;                                              // 0x8(0x8)
	Struct Vector                                                Location;                                          // 0x10(0xc)
};


// Size 0x18
struct CanvasWorldMapReaperTrackedBootItemIcon
{
public:
	byte                                                         BootyItemType;                                     // 0x0(0x1)
	char                                                         pad0x7_BVN7K[0x7];                                 // 0x1(0x7)
	Class Texture*                                               Texture;                                           // 0x8(0x8)
};


// Size 0x18
struct CanvasWorldMapShipIcons
{
public:
	class                                                        ShipSize;                                          // 0x0(0x8)
	Class Texture*                                               ShipTexture;                                       // 0x8(0x8)
	Class Texture*                                               OffscreenTexture;                                  // 0x10(0x8)
};


// Size 0x20
struct CanvasWorldMapWorldData
{
public:
	Struct Vector2D                                              Min;                                               // 0x0(0x8)
	Struct Vector2D                                              Max;                                               // 0x8(0x8)
	TArray<struct Islands>                                       Islands;                                           // 0x10(0x10)
};


// Size 0x60
struct CanvasWorldMapIslandData
{
public:
	Struct FText                                                 Name;                                              // 0x0(0x38)
	Class Texture*                                               IslandTex;                                         // 0x38(0x8)
	Struct Box2D                                                 Bounds;                                            // 0x40(0x14)
	float                                                        Rotation;                                          // 0x54(0x4)
	float                                                        LabelOffset;                                       // 0x58(0x4)
};


// Size 0x30
struct MapTableCanvasDetails
{
public:
	TArray<struct BackgroundDetails>                             BackgroundDetails;                                 // 0x0(0x10)
	TArray<struct ForegroundDetails>                             ForegroundDetails;                                 // 0x10(0x10)
	TArray<struct SeaDetails>                                    SeaDetails;                                        // 0x20(0x10)
};


// Size 0x50
struct CanvasWorldMapSeaAreaItems
{
public:
	Class Texture*                                               Texture;                                           // 0x0(0x8)
	Struct FText                                                 Name;                                              // 0x8(0x38)
	Struct Vector2D                                              Location;                                          // 0x40(0x8)
	struct FName                                                 FeatureName;                                       // 0x48(0x8)
};


// Size 0x20
struct CanvasWorldMapForegroundItems
{
public:
	Class Texture*                                               Texture;                                           // 0x0(0x8)
	struct FName                                                 FeatureToggle;                                     // 0x8(0x8)
	TArray<struct Locations>                                     Locations;                                         // 0x10(0x10)
};


// Size 0x20
struct CanvasWorldMapBackgroundItems
{
public:
	Class Texture*                                               Texture;                                           // 0x0(0x8)
	Struct Vector2D                                              WorldSize;                                         // 0x8(0x8)
	TArray<struct Locations>                                     Locations;                                         // 0x10(0x10)
};


// Size 0x118
struct VoyageProposalDescViewModel
{
public:
	Struct FString                                               ProposalDesc;                                      // 0x100(0x10)
	byte                                                         State;                                             // 0x110(0x1)
	char                                                         pad0x3_30E6Z[0x3];                                 // 0x111(0x3)
	int                                                          VoyageIndex;                                       // 0x114(0x4)
};


// Size 0x100
struct VoyageDisplayInformation
{
public:
	Struct FText                                                 Title;                                             // 0x0(0x38)
	Struct FText                                                 Description;                                       // 0x38(0x38)
	Struct FText                                                 StateDescription;                                  // 0x70(0x38)
	Struct FString                                               KeyArtUrl;                                         // 0xa8(0x10)
	Struct FString                                               IconUrl;                                           // 0xb8(0x10)
	int                                                          RumouredHaulMin;                                   // 0xc8(0x4)
	bool                                                         Locked;                                            // 0xcc(0x1)
	char                                                         pad0x3_LWFHM[0x3];                                 // 0xcd(0x3)
	Struct FString                                               Category;                                          // 0xd0(0x10)
	Struct FString                                               PreviewImageUrl;                                   // 0xe0(0x10)
	Struct FString                                               ThumbnailImageUrl;                                 // 0xf0(0x10)
};


// Size 0x1c
struct EventUpdateIslandEventToggle
{
public:
	Struct Guid                                                  EventID;                                           // 0x0(0x10)
	Struct Vector2D                                              EventScreenPos;                                    // 0x10(0x8)
	bool                                                         IsInverted;                                        // 0x18(0x1)
};


// Size 0x1
struct EventRefreshIslandEventData
{
public:
};


// Size 0x1
struct EventUpdateIslandEventHighlight
{
public:
	bool                                                         IsHighlightActive;                                 // 0x0(0x1)
};


// Size 0x110
struct IslandEventTooltipData
{
public:
	Struct VoyageDisplayInformation                              DisplayInfo;                                       // 0x0(0x100)
	Struct Guid                                                  EventID;                                           // 0x100(0x10)
};


// Size 0x58
struct IslandEventIconData
{
public:
	Struct IslandEventData                                       EventData;                                         // 0x0(0x38)
	Struct IslandEventIcons                                      IslandIcons;                                       // 0x38(0x10)
	Struct IslandEventIcons                                      HeaderIcons;                                       // 0x48(0x10)
};


// Size 0x38
struct IslandEventData
{
public:
	class                                                        EventType;                                         // 0x0(0x8)
	Struct FString                                               VoyageDescAssetString;                             // 0x8(0x10)
	Struct Vector2D                                              WorldPos;                                          // 0x18(0x8)
	bool                                                         IsActive;                                          // 0x20(0x1)
	char                                                         pad0x3_NJGNA[0x3];                                 // 0x21(0x3)
	Struct Guid                                                  EventID;                                           // 0x24(0x10)
};


// Size 0x1c
struct IslandNameAndBounds
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	Struct Box2D                                                 IslandBounds;                                      // 0x8(0x14)
};


// Size 0x1
struct EventIslandEventDataChanged
{
public:
};


// Size 0x18
struct WorldSafeZone
{
public:
};


// Size 0x18
struct AthenaWorldSettingsGameEventSchedulerSettingsConfiguration
{
public:
	struct FName                                                 FeatureFlag;                                       // 0x0(0x8)
	byte                                                         RequiredPlayMode;                                  // 0x8(0x1)
	char                                                         pad0x7_RKKHU[0x7];                                 // 0x9(0x7)
	Class GameEventSchedulerSettingsAsset*                       EventSchedulerSettings;                            // 0x10(0x8)
};


// Size 0x18
struct HoopData
{
public:
	float                                                        HoopRadius;                                        // 0x0(0x4)
	char                                                         pad0x4_FVZJZ[0x4];                                 // 0x4(0x4)
	TArray<struct EventIcons>                                    EventIcons;                                        // 0x8(0x10)
};


// Size 0x18
struct WwiseEventsIcon
{
public:
	Class Texture2D*                                             IconTexture;                                       // 0x0(0x8)
	TArray<class WwiseEvent*>                                    WwiseEvents;                                       // 0x8(0x10)
};


// Size 0x20
struct ActiveHudIconData
{
public:
	Class Texture2D*                                             IconTexture;                                       // 0x18(0x8)
};


// Size 0x38
struct DeferredBakedDecal
{
public:
};


// Size 0xc0
struct MerchantCrateItemInfoFaunaBreedRarityEntry
{
public:
	class                                                        FaunaBreed;                                        // 0x0(0x8)
	struct FName                                                 Rarity;                                            // 0x8(0x8)
	Struct BootyItemStats                                        HandInStats;                                       // 0x10(0x90)
	Struct CompanyBootyStatList                                  CompanySpecificStats;                              // 0xa0(0x10)
	TArray<struct CompanySpecificHandInRewardIds>                CompanySpecificHandInRewardIds;                    // 0xb0(0x10)
};


// Size 0x18
struct CompanySpecificBootyReward
{
public:
	class                                                        CompanyId;                                         // 0x0(0x8)
	Struct RewardId                                              RewardId;                                          // 0x8(0x8)
	bool                                                         RequirePirateLegend;                               // 0x10(0x1)
};


// Size 0x10
struct CompanyBootyStatList
{
public:
	TArray<struct CompanyList>                                   CompanyList;                                       // 0x0(0x10)
};


// Size 0x98
struct CompanyBootyStats
{
public:
	class                                                        CompanyId;                                         // 0x0(0x8)
	Struct BootyItemStats                                        Stats;                                             // 0x8(0x90)
};


// Size 0x90
struct BootyItemStats
{
public:
	TArray<struct HandInPlayerStats>                             HandInPlayerStats;                                 // 0x0(0x10)
	TArray<struct HandInStolenPlayerStats>                       HandInStolenPlayerStats;                           // 0x10(0x10)
	TArray<struct HandInAsPirateLegendPlayerStats>               HandInAsPirateLegendPlayerStats;                   // 0x20(0x10)
	TArray<struct HandInOnSchedulePlayerStats>                   HandInOnSchedulePlayerStats;                       // 0x30(0x10)
	TArray<struct HandInAsPirateLegendOnSchedulePlayerStats>     HandInAsPirateLegendOnSchedulePlayerStats;         // 0x40(0x10)
	TArray<struct HandInAsEmissaryPlayerStats>                   HandInAsEmissaryPlayerStats;                       // 0x50(0x10)
	TArray<struct HandInAsMaxLevelEmissaryPlayerStats>           HandInAsMaxLevelEmissaryPlayerStats;               // 0x60(0x10)
	TArray<struct HandInStolenAsEmissaryPlayerStats>             HandInStolenAsEmissaryPlayerStats;                 // 0x70(0x10)
	TArray<struct HandInStolenAsMaxLevelEmissaryPlayerStats>     HandInStolenAsMaxLevelEmissaryPlayerStats;         // 0x80(0x10)
};


// Size 0x18
struct EmissaryBootyItemStats
{
public:
	class                                                        EmissaryCompany;                                   // 0x0(0x8)
	TArray<struct Stats>                                         Stats;                                             // 0x8(0x10)
};


// Size 0x20
struct MerchantCrateSfx
{
public:
	Class WwiseEvent*                                            EquipSfx;                                          // 0x0(0x8)
	Class WwiseEvent*                                            UnequipSfx;                                        // 0x8(0x8)
	Class WwiseEvent*                                            WielderLandedJumpSfx;                              // 0x10(0x8)
	Class WwiseEvent*                                            WielderFootstepLayerOneshot;                       // 0x18(0x8)
};


// Size 0x18
struct BeaconLitWithFlameOfFateStatsToFire
{
public:
	byte                                                         FlameOfFateType;                                   // 0x0(0x1)
	char                                                         pad0x7_BKKHB[0x7];                                 // 0x1(0x7)
	TArray<struct StatsToFire>                                   StatsToFire;                                       // 0x8(0x10)
};


// Size 0x2
struct BeaconData
{
public:
	bool                                                         LightIsOn_Server;                                  // 0x0(0x1)
	byte                                                         FlameOfFateType;                                   // 0x1(0x1)
};


// Size 0x1
struct BeaconExtinguishedEvent
{
public:
};


// Size 0x1
struct BeaconLitEvent
{
public:
};


// Size 0x8
struct DeactivateHatchEvent
{
public:
	struct FName                                                 EventID;                                           // 0x0(0x8)
};


// Size 0xc
struct ActivateHatchEvent
{
public:
	struct FName                                                 EventID;                                           // 0x0(0x8)
	byte                                                         FlameSpecificPhobia;                               // 0x8(0x1)
};


// Size 0x10
struct BedPartDesc
{
public:
	Class MaterialInterface*                                     BedMaterial;                                       // 0x0(0x8)
	Class MaterialInterface*                                     DrapesMaterial;                                    // 0x8(0x8)
};


// Size 0x10
struct BellPlayerStats
{
public:
	TArray<struct StatsToFireUponBellRing>                       StatsToFireUponBellRing;                           // 0x0(0x10)
};


// Size 0x18
struct BellDesc
{
public:
	Class StaticMesh*                                            BellMesh;                                          // 0x0(0x8)
	Class WwiseEvent*                                            BellRingSFX;                                       // 0x8(0x8)
	Class WwiseEvent*                                            BellRingTurbulenceSFX;                             // 0x10(0x8)
};


// Size 0x18
struct BoobyTrapSpawnerRankEntry
{
public:
	int                                                          Rank;                                              // 0x0(0x4)
	float                                                        ChanceOfBeingBoobyTrapped;                         // 0x4(0x4)
	TArray<struct WeightedSpawners>                              WeightedSpawners;                                  // 0x8(0x10)
};


// Size 0x10
struct WeightedAIBoobyTrapSpawner
{
public:
	Class AIBoobyTrapSpawner*                                    Spawner;                                           // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
};


// Size 0x28
struct PageLayoutRepInfo
{
public:
	TArray<struct Images>                                        Images;                                            // 0x8(0x10)
	TArray<struct GeneralText>                                   GeneralText;                                       // 0x18(0x10)
};


// Size 0x78
struct TreasureMapWidgetLocalisedTextWithFontOverride
{
public:
	Class Font*                                                  FontOverride;                                      // 0x70(0x8)
};


// Size 0x70
struct TreasureMapWidgetLocalisedText
{
public:
	Struct FText                                                 Text;                                              // 0x38(0x38)
};


// Size 0x38
struct TreasureMapWidgetText
{
public:
	float                                                        Scale;                                             // 0x18(0x4)
	bool                                                         CutoutTextStyle;                                   // 0x1c(0x1)
	bool                                                         ShouldStrikethroughOnStart;                        // 0x1d(0x1)
	char                                                         pad0x2_0ZLML[0x2];                                 // 0x1e(0x2)
	float                                                        StrikethroughThickness;                            // 0x20(0x4)
	float                                                        StrikethroughOffset;                               // 0x24(0x4)
	Struct LinearColor                                           StrikethroughColor;                                // 0x28(0x10)
};


// Size 0x18
struct TreasureMapWidget
{
public:
	Struct Vector2D                                              Position;                                          // 0x0(0x8)
	byte                                                         HorizontalAlignment;                               // 0x8(0x1)
	byte                                                         VerticalAlignment;                                 // 0x9(0x1)
	char                                                         pad0x2_8ZDLI[0x2];                                 // 0xa(0x2)
	float                                                        Angle;                                             // 0xc(0x4)
	float                                                        Width;                                             // 0x10(0x4)
	float                                                        Opacity;                                           // 0x14(0x4)
};


// Size 0x28
struct TreasureMapWidgetTexture
{
public:
	Class Texture*                                               Image;                                             // 0x18(0x8)
	float                                                        RelativeHeightModifier;                            // 0x20(0x4)
	bool                                                         FlipX;                                             // 0x24(0x1)
	bool                                                         ScaleHeightOnMultipleLines;                        // 0x25(0x1)
};


// Size 0x18
struct QuestBookPageRenderer
{
public:
	Class Font*                                                  Font;                                              // 0x0(0x8)
	float                                                        FontScale;                                         // 0x8(0x4)
	float                                                        FontMaxScale;                                      // 0xc(0x4)
	float                                                        FontLineSpacingScale;                              // 0x10(0x4)
};


// Size 0x140
struct QuestBookMaterialHandler
{
public:
	int                                                          PageWidth;                                         // 0x0(0x4)
	int                                                          PageHeight;                                        // 0x4(0x4)
	Struct QuestBookPageRenderer                                 PageTextRenderer;                                  // 0x8(0x18)
	Class MaybeCompressedCanvasRenderTarget2D*                   LeftSpreadLeftPageRenderTarget;                    // 0x20(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   LeftSpreadRightPageRenderTarget;                   // 0x28(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   RightSpreadLeftPageRenderTarget;                   // 0x30(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   RightSpreadRightPageRenderTarget;                  // 0x38(0x8)
	Class QuestBookPageLayout*                                   LeftSpreadLeftPageContents;                        // 0x40(0x8)
	char                                                         pad0x10_WQQ3E[0x10];                               // 0x48(0x10)
	Class QuestBookPageLayout*                                   LeftSpreadRightPageContents;                       // 0x58(0x8)
	char                                                         pad0x10_UMEVC[0x10];                               // 0x60(0x10)
	Class QuestBookPageLayout*                                   RightSpreadLeftPageContents;                       // 0x70(0x8)
	char                                                         pad0x10_BF3O8[0x10];                               // 0x78(0x10)
	Class QuestBookPageLayout*                                   RightSpreadRightPageContents;                      // 0x88(0x8)
};


// Size 0x18
struct PageReference
{
public:
	Struct StringAssetReference                                  PageReference;                                     // 0x0(0x10)
	byte                                                         NumberOfPages;                                     // 0x10(0x1)
};


// Size 0x28
struct QuestBookRepInfo
{
public:
	int                                                          LeftPageIndex;                                     // 0x0(0x4)
	char                                                         pad0x4_UMSUR[0x4];                                 // 0x4(0x4)
	TArray<Int CurrentBookContents>                              CurrentBookContents;                               // 0x8(0x10)
	TArray<struct ProcPageList>                                  ProcPageList;                                      // 0x18(0x10)
};


// Size 0x50
struct BountyMapTargetDesc
{
public:
	Struct TreasureMapTextDesc                                   Name;                                              // 0x0(0x48)
	Class Texture*                                               MugShotImage;                                      // 0x48(0x8)
};


// Size 0x48
struct TreasureMapTextDesc
{
public:
	Struct FText                                                 Pattern;                                           // 0x0(0x38)
	TArray<struct Substitutions>                                 Substitutions;                                     // 0x38(0x10)
};


// Size 0x48
struct TreasureMapTextEntry
{
public:
	Struct FString                                               Name;                                              // 0x0(0x10)
	Struct FText                                                 Substitution;                                      // 0x10(0x38)
};


// Size 0x68
struct BountyMapContents
{
public:
	Struct TreasureMapTextDesc                                   Location;                                          // 0x0(0x48)
	TArray<struct Descriptions>                                  Descriptions;                                      // 0x48(0x10)
	TArray<struct Targets>                                       Targets;                                           // 0x58(0x10)
};


// Size 0x28
struct CompanySkillsetProgressions
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	Struct TargetSkillsetProgressionPair                         TargetSkillsets;                                   // 0x8(0x20)
};


// Size 0x20
struct LoadoutSubstitution
{
public:
	Struct StringAssetReference                                  LoadoutToSubstituteOut;                            // 0x0(0x10)
	TArray<struct LoadoutsToSubstituteIn>                        LoadoutsToSubstituteIn;                            // 0x10(0x10)
};


// Size 0x28
struct BountyQuestMugShotSet
{
public:
	Class AthenaAIFormDataAsset*                                 Form;                                              // 0x0(0x8)
	Class Texture*                                               MaleCaptainMugShot;                                // 0x8(0x8)
	Class Texture*                                               FemaleCaptainMugShot;                              // 0x10(0x8)
	Class Texture*                                               MaleCrewMugShot;                                   // 0x18(0x8)
	Class Texture*                                               FemaleCrewMugShot;                                 // 0x20(0x8)
};


// Size 0x10
struct BountyQuestLayoutOption
{
public:
	int                                                          NumCaptains;                                       // 0x0(0x4)
	int                                                          NumCrew;                                           // 0x4(0x4)
	Class BountyMapLayout*                                       Layout;                                            // 0x8(0x8)
};


// Size 0x30
struct CannonDesc
{
public:
	Struct StringAssetReference                                  CannonBarrelMesh;                                  // 0x0(0x10)
	Struct StringAssetReference                                  CannonBoxMesh;                                     // 0x18(0x10)
};


// Size 0x8
struct EventCannonFiredOnServer
{
public:
	Class Cannon*                                                Cannon;                                            // 0x0(0x8)
};


// Size 0x20
struct EventCannonFired
{
public:
	Class Cannon*                                                FiredCannon;                                       // 0x0(0x8)
};


// Size 0x1
struct EventCannonAimingStoppedYaw
{
public:
	bool                                                         IsAtEnd;                                           // 0x0(0x1)
};


// Size 0x1
struct EventCannonAimingStoppedPitch
{
public:
	bool                                                         IsAtEnd;                                           // 0x0(0x1)
};


// Size 0x1
struct EventCannonAimingStartedYaw
{
public:
};


// Size 0x1
struct EventCannonAimingStartedPitch
{
public:
};


// Size 0x1
struct EventCannonAimingCenteredYaw
{
public:
};


// Size 0x1
struct EventCannonAimingCenteredPitch
{
public:
};


// Size 0x18
struct AchievementSailCloseToShipWithoutFiring
{
public:
	float                                                        RangeToRemainWithinInMetres;                       // 0x0(0x4)
	float                                                        DistanceToTravelInMetres;                          // 0x4(0x4)
};


// Size 0x8
struct AchievementSailFullyWithTheWind
{
public:
	float                                                        DistanceToTravelInMetres;                          // 0x0(0x4)
};


// Size 0x80
struct AchievementSailThroughStormAtNightWithLightsOff
{
public:
	Class Ship*                                                  Ship;                                              // 0x50(0x8)
};


// Size 0xf8
struct AchievementSailWithFlameOfFateColoursAboard
{
public:
	Class Ship*                                                  Ship;                                              // 0x8(0x8)
	TArray<class ShipInteractableLight*>                         ShipLights;                                        // 0x10(0x10)
};


// Size 0x98
struct ShipPartConnections
{
public:
	struct FName                                                 AnchorName;                                        // 0x0(0x8)
	struct FName                                                 CapstanName;                                       // 0x8(0x8)
	struct FName                                                 RudderName;                                        // 0x10(0x8)
	struct FName                                                 WheelName;                                         // 0x18(0x8)
	struct FName                                                 MainMastName;                                      // 0x20(0x8)
	struct FName                                                 MainMastSailHoistRightName;                        // 0x28(0x8)
	struct FName                                                 MainMastSailHoistLeftName;                         // 0x30(0x8)
	struct FName                                                 MainMastSailAngleRightName;                        // 0x38(0x8)
	struct FName                                                 MainMastSailAngleLeftName;                         // 0x40(0x8)
	struct FName                                                 MizzenMastName;                                    // 0x48(0x8)
	struct FName                                                 MizzenMastSailHoistRightName;                      // 0x50(0x8)
	struct FName                                                 MizzenMastSailHoistLeftName;                       // 0x58(0x8)
	struct FName                                                 MizzenMastSailAngleRightName;                      // 0x60(0x8)
	struct FName                                                 MizzenMastSailAngleLeftName;                       // 0x68(0x8)
	struct FName                                                 ForeMastName;                                      // 0x70(0x8)
	struct FName                                                 ForeMastSailHoistRightName;                        // 0x78(0x8)
	struct FName                                                 ForeMastSailHoistLeftName;                         // 0x80(0x8)
	struct FName                                                 ForeMastSailAngleRightName;                        // 0x88(0x8)
	struct FName                                                 ForeMastSailAngleLeftName;                         // 0x90(0x8)
};


// Size 0x30
struct ShipCurseFXData
{
public:
	byte                                                         ShipCurseTag;                                      // 0x0(0x1)
	char                                                         pad0x7_JAYIW[0x7];                                 // 0x1(0x7)
	TArray<struct VFXTemplates>                                  VFXTemplates;                                      // 0x8(0x10)
	Struct ShipCurseAudioLoop                                    AudioLoop;                                         // 0x18(0x18)
};


// Size 0x18
struct ShipCurseAudioLoop
{
public:
	Class WwiseEvent*                                            PlayLoop;                                          // 0x0(0x8)
	Class WwiseEvent*                                            StopLoop;                                          // 0x8(0x8)
	Class WwiseObjectPoolWrapper*                                PoolWrapper;                                       // 0x10(0x8)
};


// Size 0x20
struct ShipCurseVFXTemplate
{
public:
	class                                                        ActorClass;                                        // 0x0(0x8)
	Class ParticleSystem*                                        Template;                                          // 0x8(0x8)
	Struct FString                                               SocketNameSubstring;                               // 0x10(0x10)
};


// Size 0x1
struct EventApplyStatusShipCurseEnd
{
public:
};


// Size 0x20
struct EventApplyStatusShipCurse
{
public:
	Struct Status                                                Status;                                            // 0x8(0x18)
};


// Size 0x1
struct EventCurseWheelLockEnd
{
public:
};


// Size 0x8
struct EventCurseWheelLock
{
public:
	byte                                                         CurseTag;                                          // 0x0(0x1)
	char                                                         pad0x3_F1KTK[0x3];                                 // 0x1(0x3)
	float                                                        AngleThreshold;                                    // 0x4(0x4)
};


// Size 0x8
struct EventCurseSpawnAIOnShip
{
public:
	Class AIFixedWavesSpawner*                                   AISpawner;                                         // 0x0(0x8)
};


// Size 0x1
struct EventCurseBallastEnd
{
public:
};


// Size 0x4
struct EventCurseBallast
{
public:
};


// Size 0x30
struct EventShipCurseFXEnd
{
public:
	Struct ShipCurseFXData                                       CurseFXData;                                       // 0x0(0x30)
};


// Size 0x30
struct EventShipCurseFX
{
public:
	Struct ShipCurseFXData                                       CurseFXData;                                       // 0x0(0x30)
};


// Size 0xc
struct CurseShipCannonsEvent
{
public:
	float                                                        PitchAngle;                                        // 0x0(0x4)
	float                                                        YawAngle;                                          // 0x4(0x4)
	float                                                        BlendTime;                                         // 0x8(0x4)
};


// Size 0x18
struct EventEnableInteractionPoints
{
public:
	byte                                                         ShipCurseTag;                                      // 0x0(0x1)
	byte                                                         CurseTag;                                          // 0x1(0x1)
	char                                                         pad0x6_9C6GA[0x6];                                 // 0x2(0x6)
	TArray<class Class*>                                         InteractionPointsToEnable;                         // 0x8(0x10)
};


// Size 0x18
struct EventDisableInteractionPoints
{
public:
	byte                                                         ShipCurseTag;                                      // 0x0(0x1)
	byte                                                         CurseTag;                                          // 0x1(0x1)
	char                                                         pad0x6_NYBMI[0x6];                                 // 0x2(0x6)
	TArray<class Class*>                                         InteractionPointsToDisable;                        // 0x8(0x10)
};


// Size 0x4
struct EventCurseCapstan
{
public:
	float                                                        DurationToToggleCapstanPosition;                   // 0x0(0x4)
};


// Size 0x4
struct EventCurseChangeSailHeight
{
public:
	float                                                        Duration;                                          // 0x0(0x4)
};


// Size 0x30
struct TimedResponseAction
{
public:
	TArray<class Actor*>                                         TargetActors;                                      // 0x0(0x10)
	float                                                        Duration;                                          // 0x10(0x4)
	bool                                                         IsActive;                                          // 0x14(0x1)
};


// Size 0x18
struct ShipCurseSpawnedFXForCurse
{
public:
	TArray<struct SpawnedFXObjects>                              SpawnedFXObjects;                                  // 0x8(0x10)
};


// Size 0x30
struct ShipCurseSpawnedFXObject
{
public:
	Class WwiseEvent*                                            StopAudioLoopEvent;                                // 0x28(0x8)
};


// Size 0x30
struct ShipActiveCurseFXData
{
public:
	Struct ShipCurseFXData                                       CurseFXData;                                       // 0x0(0x30)
};


// Size 0x18
struct ShipConfigurationSettings
{
public:
	float                                                        MetresSailedStatSendFrequency;                     // 0x0(0x4)
	float                                                        MinimumDistanceSailedBeforeSendingUpdate;          // 0x4(0x4)
	float                                                        MaxVelocityAllowedForServerMigration;              // 0x8(0x4)
	float                                                        MaxAngularVelocityAllowedForServerMigration;       // 0xc(0x4)
	float                                                        ShipHeartbeatFrequencySeconds;                     // 0x10(0x4)
	bool                                                         MigrationBasedOnVelocityEnabled;                   // 0x14(0x1)
};


// Size 0x40
struct LiquidContents
{
public:
	Class Ship*                                                  LiquidSource;                                      // 0x0(0x8)
	TArray<class Ship*>                                          LiquidTargets;                                     // 0x8(0x10)
	Class Actor*                                                 Container;                                         // 0x18(0x8)
	float                                                        LiquidVolume;                                      // 0x20(0x4)
	Struct Guid                                                  ScoopID;                                           // 0x24(0x10)
	float                                                        LiquidTransferFillAmountModifier;                  // 0x34(0x4)
	byte                                                         ContainerType;                                     // 0x38(0x1)
};


// Size 0x58
struct BucketContentsInfo
{
public:
	byte                                                         ThrowableLiquidType;                               // 0x0(0x1)
	char                                                         pad0x7_IA05I[0x7];                                 // 0x1(0x7)
	class                                                        ProjectileClassToSpawn;                            // 0x8(0x8)
	class                                                        ProjectileClassToSpawnAtWielder;                   // 0x10(0x8)
	Class WwiseEvent*                                            ThrowSfx;                                          // 0x18(0x8)
	Class Object*                                                ThrowVfxFirstPerson;                               // 0x20(0x8)
	Class Object*                                                ThrowVfxThirdPerson;                               // 0x28(0x8)
	Class Object*                                                DrenchWielderVfxThirdPerson;                       // 0x30(0x8)
	Class Object*                                                BucketContentsParticleSystemFirstPerson;           // 0x38(0x8)
	Class Object*                                                BucketContentsParticleSystemThirdPerson;           // 0x40(0x8)
	struct FName                                                 SwitchState;                                       // 0x48(0x8)
	float                                                        LiquidLevel;                                       // 0x50(0x4)
};


// Size 0x30
struct QuestVariablePlayerActor
{
public:
};


// Size 0x30
struct QuestVariable
{
public:
	struct FName                                                 ParamName;                                         // 0x18(0x8)
};


// Size 0x1c
struct LocationGeneratorSample
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	char                                                         pad0x3_6H7LI[0x3];                                 // 0x1(0x3)
	Struct Vector                                                Location;                                          // 0x4(0xc)
	Struct Vector                                                Normal;                                            // 0x10(0xc)
};


// Size 0x10
struct CampaignPopUpNotificationInfo
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	Class PopUpMessageDesc*                                      PopUp;                                             // 0x8(0x8)
};


// Size 0x18
struct CannonEnchantmentDesc
{
public:
	Class Object*                                                MuzzleFlashVfxFirstPerson;                         // 0x0(0x8)
	Class Object*                                                MuzzleFlashVfxThirdPerson;                         // 0x8(0x8)
	Class WwiseEvent*                                            FireSfx;                                           // 0x10(0x8)
};


// Size 0xc
struct CentreWorldMapOnLocationEvent
{
public:
	Struct Vector                                                WorldLocation;                                     // 0x0(0xc)
};


// Size 0x1
struct RemoveBoundaryFromWorldMapEvent
{
public:
};


// Size 0x10
struct ApplyBoundaryToWorldMapEvent
{
public:
	Struct LinearColor                                           BoundaryData;                                      // 0x0(0x10)
};


// Size 0x4
struct WorldMapSetMapLabelsRotation
{
public:
	float                                                        Rotation;                                          // 0x0(0x4)
};


// Size 0xc
struct WorldMapSetShipLocation
{
public:
	float                                                        ShipX;                                             // 0x0(0x4)
	float                                                        ShipY;                                             // 0x4(0x4)
	float                                                        Rotation;                                          // 0x8(0x4)
};


// Size 0x28
struct WorldMapSetLocation
{
public:
	TArray<struct MapPins>                                       MapPins;                                           // 0x0(0x10)
	int                                                          MaxMapPins;                                        // 0x10(0x4)
	int                                                          SelectedPin;                                       // 0x14(0x4)
	float                                                        WorldX;                                            // 0x18(0x4)
	float                                                        WorldY;                                            // 0x1c(0x4)
	float                                                        Zoom;                                              // 0x20(0x4)
};


// Size 0x20
struct WorldMapRequestWorldResponse
{
public:
	Struct WorldMapWorldData                                     WorldData;                                         // 0x0(0x20)
};


// Size 0x20
struct WorldMapWorldData
{
public:
	float                                                        MinX;                                              // 0x0(0x4)
	float                                                        MinY;                                              // 0x4(0x4)
	float                                                        MaxX;                                              // 0x8(0x4)
	float                                                        MaxY;                                              // 0xc(0x4)
	TArray<struct Islands>                                       Islands;                                           // 0x10(0x10)
};


// Size 0x60
struct WorldMapIslandData
{
public:
	Struct FText                                                 Name;                                              // 0x0(0x38)
	Struct FString                                               IslandUrl;                                         // 0x38(0x10)
	float                                                        MinX;                                              // 0x48(0x4)
	float                                                        MinY;                                              // 0x4c(0x4)
	float                                                        MaxX;                                              // 0x50(0x4)
	float                                                        MaxY;                                              // 0x54(0x4)
	float                                                        Rotation;                                          // 0x58(0x4)
	float                                                        LabelOffset;                                       // 0x5c(0x4)
};


// Size 0x1
struct WorldMapRequestWorld
{
public:
};


// Size 0x10
struct FactionStreakIcon
{
public:
	Class Texture*                                               FactionStreakIcon;                                 // 0x0(0x8)
	class                                                        Faction;                                           // 0x8(0x8)
};


// Size 0x48
struct CapstanDesc
{
public:
	Struct StringAssetReference                                  CapstanBodyMesh;                                   // 0x0(0x10)
	Struct StringAssetReference                                  CapstanArmMesh;                                    // 0x18(0x10)
	Struct StringAssetReference                                  CapstanReleaseMesh;                                // 0x30(0x10)
};


// Size 0x68
struct CapstanAudioParams
{
public:
	Class WwiseEvent*                                            CapstanStart;                                      // 0x0(0x8)
	Class WwiseEvent*                                            CapstanStop;                                       // 0x8(0x8)
	Class WwiseEvent*                                            CapstanDamagedStart;                               // 0x10(0x8)
	Class WwiseEvent*                                            CapstanDamagedStop;                                // 0x18(0x8)
	Class WwiseEvent*                                            CapstanStopFullyRaised;                            // 0x20(0x8)
	Class WwiseEvent*                                            CapstanStopFullyLowered;                           // 0x28(0x8)
	Class WwiseObjectPoolWrapper*                                CapstanEmitterPool;                                // 0x30(0x8)
	struct FName                                                 CapstanTurnRateRtpc;                               // 0x38(0x8)
	float                                                        CapstanTurnMinRtpcValue;                           // 0x40(0x4)
	float                                                        CapstanTurnMaxRtpcValue;                           // 0x44(0x4)
	struct FName                                                 BoatVelocityRtpc;                                  // 0x48(0x8)
	float                                                        BoatVelocityMinRtpcValue;                          // 0x50(0x4)
	float                                                        BoatVelocityMaxRtpcValue;                          // 0x54(0x4)
	float                                                        EmpiricalMaxShipVelocity;                          // 0x58(0x4)
	struct FName                                                 CapstanDamageRtpc;                                 // 0x5c(0x8)
	float                                                        CapstanDamageRtpcMaxValue;                         // 0x64(0x4)
};


// Size 0x8
struct CapstanNetState
{
public:
	float                                                        TargetRatio;                                       // 0x0(0x4)
	bool                                                         IsLocked;                                          // 0x4(0x1)
};


// Size 0x14
struct CapstanParams
{
public:
	float                                                        MaxVelocityPerPlayer;                              // 0x0(0x4)
	float                                                        MaxFreeLoweringVelocity;                           // 0x4(0x4)
	float                                                        MaxError;                                          // 0x8(0x4)
	float                                                        CorrectiveForceMultiplier;                         // 0xc(0x4)
	float                                                        PlayerAnimationOnCapstanMultiplier;                // 0x10(0x4)
};


// Size 0xc
struct RepairableComponentMaxDamageLevelOverride
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	int                                                          MaxDamageLevel;                                    // 0x8(0x4)
};


// Size 0x18
struct RepairableAuthoritiveRepairState
{
public:
	byte                                                         RepairableState;                                   // 0x0(0x1)
	char                                                         pad0x7_AZMYX[0x7];                                 // 0x1(0x7)
	TArray<Weakclass RepairingList>                              RepairingList;                                     // 0x8(0x10)
};


// Size 0x20
struct CaptainCurtainsPartDesc
{
public:
	Struct StringAssetReference                                  PrimaryCurtainMesh;                                // 0x0(0x10)
	Class MaterialInterface*                                     SecondaryCurtainMaterial;                          // 0x10(0x8)
};


// Size 0x38
struct CompanyCargoRunHandInStats
{
public:
	class                                                        CompanyId;                                         // 0x0(0x8)
	TArray<struct StatsToFireOnHandIn>                           StatsToFireOnHandIn;                               // 0x8(0x10)
	TArray<struct StatsToFireOnDamagedHandIn>                    StatsToFireOnDamagedHandIn;                        // 0x18(0x10)
	TArray<struct StatsToFirePerHealthTierOnHandIn>              StatsToFirePerHealthTierOnHandIn;                  // 0x28(0x10)
};


// Size 0x18
struct CompanySpecificCargoRunStats
{
public:
	class                                                        CompanyId;                                         // 0x0(0x8)
	TArray<struct StatsToFireUponPerfectOnTimeHandIn>            StatsToFireUponPerfectOnTimeHandIn;                // 0x8(0x10)
};


// Size 0x28
struct CompanySpecificCargoRunReward
{
public:
	class                                                        CompanyId;                                         // 0x0(0x8)
	Struct CargoRunReward                                        Reward;                                            // 0x8(0x20)
};


// Size 0x20
struct CargoRunReward
{
public:
	TArray<struct OnTimeRewards>                                 OnTimeRewards;                                     // 0x0(0x10)
	TArray<struct LateRewards>                                   LateRewards;                                       // 0x10(0x10)
};


// Size 0x18
struct CargoRunMapContents
{
public:
	Struct Guid                                                  NPCId;                                             // 0x0(0x10)
	int                                                          CompanyIndex;                                      // 0x10(0x4)
	int                                                          NumOfItems;                                        // 0x14(0x4)
};


// Size 0x20
struct CargoRunQuestCategoryGroup
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	struct FName                                                 GroupName;                                         // 0x4(0x8)
	char                                                         pad0x4_PYP0P[0x4];                                 // 0xc(0x4)
	TArray<struct RequiredItemEntries>                           RequiredItemEntries;                               // 0x10(0x10)
};


// Size 0x10
struct CargoRunQuestRandomRequiredItemsEntry
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	int                                                          MaxNum;                                            // 0x4(0x4)
	class                                                        RequiredItem;                                      // 0x8(0x8)
};


// Size 0x30
struct CarouselPirateDesc
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
	byte                                                         Gender;                                            // 0x4(0x1)
	byte                                                         Ethnicity;                                         // 0x5(0x1)
	char                                                         pad0x2_AGRTU[0x2];                                 // 0x6(0x2)
	float                                                        Age;                                               // 0x8(0x4)
	Struct RadialCoordinate                                      BodyShape;                                         // 0xc(0x8)
	float                                                        Dirtiness;                                         // 0x14(0x4)
	float                                                        Wonkiness;                                         // 0x18(0x4)
	char                                                         pad0x4_6HL0Q[0x4];                                 // 0x1c(0x4)
	TArray<class Class*>                                         Outfit;                                            // 0x20(0x10)
};


// Size 0xc8
struct CarouselPirateGeneratorParams
{
public:
	int                                                          MinNumOfEachGender;                                // 0x0(0x4)
	int                                                          MinNumOfEachEthnicity;                             // 0x4(0x4)
	TArray<struct Groups>                                        Groups;                                            // 0x8(0x10)
	Struct CarouselPirateGroup                                   Default;                                           // 0x18(0x6c)
	char                                                         pad0x4_XGV9P[0x4];                                 // 0x84(0x4)
	Struct CarouselPirateClothing                                MaleClothing;                                      // 0x88(0x20)
	Struct CarouselPirateClothing                                FemaleClothing;                                    // 0xa8(0x20)
};


// Size 0x20
struct CarouselPirateClothing
{
public:
	TArray<struct AvailableItems>                                AvailableItems;                                    // 0x0(0x10)
	TArray<struct Probabilities>                                 Probabilities;                                     // 0x10(0x10)
};


// Size 0x10
struct CarouselPirateClothingCategoryBias
{
public:
	class                                                        Category;                                          // 0x0(0x8)
	float                                                        LikelihoodOfHaving;                                // 0x8(0x4)
	bool                                                         ProgressivlyDecreaseChance;                        // 0xc(0x1)
};


// Size 0x10
struct CarouselPirateClothingItem
{
public:
	class                                                        Item;                                              // 0x0(0x8)
	byte                                                         EthnicityFilter;                                   // 0x8(0x1)
};


// Size 0x6c
struct CarouselPirateGroup
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	int                                                          Count;                                             // 0x8(0x4)
	Struct FloatRange                                            Age;                                               // 0xc(0x10)
	Struct FloatRange                                            Wonkiness;                                         // 0x1c(0x10)
	Struct FloatRange                                            Dirt;                                              // 0x2c(0x10)
	Struct CarouselPirateBodyshape                               MaleBodyShape;                                     // 0x3c(0x18)
	Struct CarouselPirateBodyshape                               FemaleBodyShape;                                   // 0x54(0x18)
};


// Size 0x18
struct CarouselPirateBodyshape
{
public:
	float                                                        RandomizationBias;                                 // 0x0(0x4)
	Struct FloatRange                                            ShapeMagnitude;                                    // 0x4(0x10)
	Struct CarouselPirateBodyshapeCompass                        BodyShapeCompass;                                  // 0x14(0x2)
};


// Size 0x2
struct CarouselPirateBodyshapeCompass
{
public:
	byte                                                         StartDirection;                                    // 0x0(0x1)
	byte                                                         EndDirection;                                      // 0x1(0x1)
};


// Size 0x18
struct CatalogOfferCommodity
{
public:
	class                                                        RequiredEmissary;                                  // 0x0(0x8)
	Struct CommoditySelectionType                                Type;                                              // 0x8(0x8)
	byte                                                         Demand;                                            // 0x10(0x1)
};


// Size 0x18
struct CatalogOfferBundleDataAsset
{
public:
	Struct StringAssetReference                                  TileImage;                                         // 0x8(0x10)
};


// Size 0x10
struct CatalogOfferRewardDataAsset
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	Struct RewardId                                              Reward;                                            // 0x8(0x8)
};


// Size 0x28
struct CatalogOfferPrerequisitesDataAsset
{
public:
	TArray<class Class*>                                         Entitlements;                                      // 0x0(0x10)
	TArray<struct CompanyLevel>                                  CompanyLevel;                                      // 0x10(0x10)
};


// Size 0x10
struct CatalogOfferCompanyLevelDataAsset
{
public:
	class                                                        Company;                                           // 0x0(0x8)
};


// Size 0x18
struct CategoryDefaultsUnit
{
public:
	TArray<Str PartialStrings>                                   PartialStrings;                                    // 0x0(0x10)
	class                                                        Category;                                          // 0x10(0x8)
};


// Size 0x30
struct ChandelierPartDesc
{
public:
	Struct StringAssetReference                                  ChandelierMesh;                                    // 0x0(0x10)
	Struct StringAssetReference                                  FlamesMesh;                                        // 0x10(0x10)
};


// Size 0x210
struct PlayerMusicController
{
public:
	Class PlayerMusicControllerParams*                           PlayerMusicParams;                                 // 0x0(0x8)
	char                                                         pad0x30_LTZR2[0x30];                               // 0x8(0x30)
	Class Actor*                                                 LocalPlayerActor;                                  // 0x38(0x8)
	Class PlayerOceanAudioComponent*                             PlayerOceanAudioComponent;                         // 0x40(0x8)
	Class PlayerAtmosphericsAudioComponent*                      AtmosphericsAudioComponent;                        // 0x48(0x8)
	Class AthenaPlayerCharacter*                                 AthenaPlayerCharacter;                             // 0x50(0x8)
	Class AthenaWorldSettings*                                   AthenaWorldSettings;                               // 0x58(0x8)
	char                                                         pad0x160_RQ410[0x160];                             // 0x60(0x160)
	Struct TimeStampedInvasionMusicState                         TimeStampedInvaderMatchmakingState;                // 0x1c0(0x18)
	char                                                         pad0x10_BAURH[0x10];                               // 0x1d8(0x10)
	TArray<struct RelevantAudioStingShips>                       RelevantAudioStingShips;                           // 0x1e8(0x10)
	TArray<struct AudioStingShipsSpottedRecently>                AudioStingShipsSpottedRecently;                    // 0x1f8(0x10)
};


// Size 0x10
struct AudioStingShipsSpotted
{
public:
	Class Actor*                                                 SpottedShip;                                       // 0x0(0x8)
	double                                                       TimeSpotted;                                       // 0x8(0x8)
};


// Size 0x10
struct AudioStingRelevantShips
{
public:
	Class Actor*                                                 Ship;                                              // 0x0(0x8)
	bool                                                         IsAIShip;                                          // 0x8(0x1)
	bool                                                         IsEmissary;                                        // 0x9(0x1)
	bool                                                         IsCaptainedShip;                                   // 0xa(0x1)
};


// Size 0x18
struct NamedStateSelector
{
public:
	TArray<struct NamedStates>                                   NamedStates;                                       // 0x0(0x10)
	struct FName                                                 DefaultStateName;                                  // 0x10(0x8)
};


// Size 0xc
struct NameActiveStatePair
{
public:
	struct FName                                                 StateName;                                         // 0x0(0x8)
	bool                                                         IsActive;                                          // 0x8(0x1)
};


// Size 0x18
struct FogTypeToAudio
{
public:
	byte                                                         FogBankType;                                       // 0x0(0x1)
	char                                                         pad0x7_3LBRB[0x7];                                 // 0x1(0x7)
	Class WwiseEvent*                                            FogMusicPlayEvent;                                 // 0x8(0x8)
	Class WwiseEvent*                                            FogMusicStopEvent;                                 // 0x10(0x8)
};


// Size 0x20
struct StateCategoryGroup
{
public:
	struct FName                                                 GroupName;                                         // 0x18(0x8)
};


// Size 0x10
struct HealthChangeAudio
{
public:
	byte                                                         Reason;                                            // 0x0(0x1)
	char                                                         pad0x7_KB9I5[0x7];                                 // 0x1(0x7)
	Class WwiseEvent*                                            Sfx;                                               // 0x8(0x8)
};


// Size 0x28
struct DamageTypeToAudio
{
public:
	class                                                        DamagerType;                                       // 0x0(0x8)
	struct FName                                                 AudioState;                                        // 0x8(0x8)
	Class WwiseEvent*                                            StartAudioEvent;                                   // 0x10(0x8)
	Class WwiseEvent*                                            EndAudioEvent;                                     // 0x18(0x8)
	float                                                        Duration;                                          // 0x20(0x4)
};


// Size 0x1c
struct CharacterSocketFootWaterImpactResult
{
public:
	Struct Vector                                                Position;                                          // 0x0(0xc)
	Struct Vector                                                SocketVelocity;                                    // 0xc(0xc)
	int                                                          FootIndex;                                         // 0x18(0x4)
};


// Size 0x20
struct CharacterFootWaterImpactResult
{
public:
	Struct CharacterSocketFootWaterImpactResult                  SocketFootImpactResult;                            // 0x0(0x1c)
	int                                                          FootIndex;                                         // 0x1c(0x4)
};


// Size 0xd0
struct CharacterFootImpactResult
{
public:
	Struct HitResult                                             HitResult;                                         // 0x0(0x80)
	byte                                                         FootImpactType;                                    // 0x80(0x1)
	char                                                         pad0xf_Q0U1Y[0xf];                                 // 0x81(0xf)
	Struct Transform                                             SocketTransform;                                   // 0x90(0x30)
	Struct Vector                                                SocketVelocity;                                    // 0xc0(0xc)
	int                                                          FootIndex;                                         // 0xcc(0x4)
};


// Size 0x28
struct CharacterSocketCollisionDesc
{
public:
	struct FName                                                 SocketName;                                        // 0x0(0x8)
	Class SkeletalMeshComponent*                                 SkeletalMeshComponent;                             // 0x8(0x8)
	byte                                                         TraceType;                                         // 0x10(0x1)
	char                                                         pad0x3_AE8E2[0x3];                                 // 0x11(0x3)
	float                                                        TraceDistance;                                     // 0x14(0x4)
	float                                                        TraceOffset;                                       // 0x18(0x4)
	byte                                                         ResultType;                                        // 0x1c(0x1)
	char                                                         pad0x3_991QJ[0x3];                                 // 0x1d(0x3)
	int                                                          FootIndex;                                         // 0x20(0x4)
};


// Size 0x28
struct SocketCollisionExitWaterEvent
{
public:
};


// Size 0x28
struct SocketCollisionEnterWaterEvent
{
public:
};


// Size 0xd0
struct SocketCollisionEvent
{
public:
};


// Size 0xc
struct ChestOfRageReplicatedData
{
public:
	byte                                                         State;                                             // 0x0(0x1)
	char                                                         pad0x3_CTE9W[0x3];                                 // 0x1(0x3)
	float                                                        RageValue;                                         // 0x4(0x4)
	bool                                                         HasBeenActivated;                                  // 0x8(0x1)
};


// Size 0x8
struct EventReceiveChestOfRageComponentState
{
public:
	Class ChestOfRageComponent*                                  Source;                                            // 0x0(0x8)
};


// Size 0x8
struct ChestOfRageDamageTableEntry
{
public:
	byte                                                         Reason;                                            // 0x0(0x1)
	char                                                         pad0x3_TLF5L[0x3];                                 // 0x1(0x3)
	float                                                        TimeToAdd;                                         // 0x4(0x4)
};


// Size 0x10
struct ClothingLoadout
{
public:
	TArray<class Class*>                                         Items;                                             // 0x0(0x10)
};


// Size 0x10
struct ClothingChestRandomFilter
{
public:
	class                                                        Category;                                          // 0x0(0x8)
	float                                                        Likelihood;                                        // 0x8(0x4)
};


// Size 0x18
struct ClothingLoadoutContainer
{
public:
	Struct ClothingLoadout                                       Loadout;                                           // 0x0(0x10)
	bool                                                         HasBeenSet;                                        // 0x10(0x1)
};


// Size 0x28
struct CloudWeatherParameters
{
public:
	Struct Vector2D                                              DefaultCloudVelocity;                              // 0x0(0x8)
	Class MaterialParameterCollection*                           AtmosphericMaterialParams;                         // 0x8(0x8)
	float                                                        GlobalAtmosphericPressure;                         // 0x10(0x4)
	float                                                        AtmosphericPressureThresholdSize;                  // 0x14(0x4)
	float                                                        MaxWindDelayLength;                                // 0x18(0x4)
	float                                                        WindSpeedMultiplier;                               // 0x1c(0x4)
	bool                                                         UsesGlobalWindService;                             // 0x20(0x1)
	bool                                                         UsesPressureZones;                                 // 0x20(0x1)
	bool                                                         CloudsCastShadows;                                 // 0x20(0x1)
	bool                                                         PressureIsControlledByParameterCollection;         // 0x20(0x1)
};


// Size 0x20
struct CloudTileParameters
{
public:
	TArray<struct Meshes>                                        Meshes;                                            // 0x0(0x10)
	int                                                          Samples;                                           // 0x10(0x4)
	int                                                          Seed;                                              // 0x14(0x4)
	float                                                        MeshScaleMultiplier;                               // 0x18(0x4)
	bool                                                         ShouldCloudTileBeGenerated;                        // 0x1c(0x1)
};


// Size 0x28
struct CloudDomeParameters
{
public:
	float                                                        Width;                                             // 0x0(0x4)
	float                                                        DomeToTileProportion;                              // 0x4(0x4)
	float                                                        Height;                                            // 0x8(0x4)
	float                                                        HighPressureExtraHeight;                           // 0xc(0x4)
	float                                                        FadeProportion;                                    // 0x10(0x4)
	float                                                        DistanceCurvatureOvershoot;                        // 0x14(0x4)
	float                                                        DistantStreetCloudRotation;                        // 0x18(0x4)
	float                                                        ProportionOfCloudDomeToAlwaysUpdate;               // 0x1c(0x4)
	int                                                          SplitRemainingCloudsOverThisManyUpdates;           // 0x20(0x4)
	bool                                                         UpdateClosestProportionEveryOtherFrame;            // 0x24(0x1)
	bool                                                         EnableDistanceCurvature;                           // 0x25(0x1)
};


// Size 0x50
struct CoastObject
{
public:
	Class SplineComponent*                                       CoastSplineInternal;                               // 0x0(0x8)
	Class SplineComponent*                                       InnerSplineInternal;                               // 0x8(0x8)
	Struct Vector                                                SplineOrigin;                                      // 0x10(0xc)
	float                                                        CoastalLookupSquaredDistance;                      // 0x1c(0x4)
};


// Size 0x18
struct HUDBlur
{
public:
	Class MaterialParameterCollectionInstance*                   ScreenEffectsMaterialParameterCollectionInstance;  // 0x0(0x8)
};


// Size 0x18
struct HUDBlurParams
{
public:
	Class MaterialParameterCollection*                           ScreenEffectsMaterialParameterCollection;          // 0x0(0x8)
	Struct HUDBlurSourceParams                                   MenuBlurParams;                                    // 0x8(0x8)
	Struct HUDBlurSourceParams                                   MigrationBlurParams;                               // 0x10(0x8)
};


// Size 0x8
struct HUDBlurSourceParams
{
public:
	float                                                        SecondsToFullyBlur;                                // 0x0(0x4)
	float                                                        SecondsToFullyUnblur;                              // 0x4(0x4)
};


// Size 0x98
struct HttpClientComponentRequestEvent
{
public:
	Struct FString                                               Uri;                                               // 0x0(0x10)
	Struct FString                                               Body;                                              // 0x10(0x10)
	bool                                                         ShouldEncrypt;                                     // 0x20(0x1)
	bool                                                         ShouldAuthorize;                                   // 0x21(0x1)
	char                                                         pad0x6_1EPRU[0x6];                                 // 0x22(0x6)
	Struct FString                                               Method;                                            // 0x28(0x10)
	Struct FString                                               Id;                                                // 0x88(0x10)
};


// Size 0x28
struct HttpClientComponentResponseEvent
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
	char                                                         pad0x7_VK1CA[0x7];                                 // 0x1(0x7)
	Struct FString                                               Body;                                              // 0x8(0x10)
	Struct FString                                               Id;                                                // 0x18(0x10)
};


// Size 0x30
struct PlayerTalkingSettings
{
public:
	Struct LinearColor                                           IconTint;                                          // 0x0(0x10)
	Class Texture2D*                                             Icon;                                              // 0x10(0x8)
	float                                                        ScreenEdgePadding;                                 // 0x18(0x4)
	float                                                        Scale;                                             // 0x1c(0x4)
	float                                                        FadeInTimeInSeconds;                               // 0x20(0x4)
};


// Size 0x78
struct UpdateShipPreviewWorldEvent
{
public:
	class                                                        ShipSize;                                          // 0x0(0x8)
	TArray<class Class*>                                         ShipCustomizationClasses;                          // 0x8(0x10)
	Struct ShipPersistenceModel                                  DamageState;                                       // 0x18(0x50)
	Struct FString                                               Name;                                              // 0x68(0x10)
};


// Size 0x50
struct ShipPersistenceModel
{
public:
	TArray<struct PartDamagePersistenceModels>                   PartDamagePersistenceModels;                       // 0x0(0x10)
	Struct HullDamagePersistenceModel                            HullDamageModel;                                   // 0x10(0x10)
	Struct HullCharringPersistenceModel                          HullCharringModel;                                 // 0x20(0x18)
	Struct MapTablePersistenceModel                              MapTablePersistenceModel;                          // 0x38(0x10)
	Struct ShipInternalWaterPersistenceModel                     InternalWaterModel;                                // 0x48(0x4)
};


// Size 0x1
struct PersistenceModel
{
public:
};


// Size 0x4
struct ShipInternalWaterPersistenceModel
{
public:
	float                                                        InternalWaterLevel;                                // 0x0(0x4)
};


// Size 0x10
struct MapTablePersistenceModel
{
public:
	TArray<struct MapPins>                                       MapPins;                                           // 0x0(0x10)
};


// Size 0x1
struct ShipPreviewFailedEvent
{
public:
};


// Size 0x1
struct CachingOfShipPreviewLoadoutsCompleteEvent
{
public:
};


// Size 0x30
struct RequestCachingOfShipPreviewLoadoutsEvent
{
public:
	TArray<Str Ids>                                              Ids;                                               // 0x0(0x10)
	TArray<Str Names>                                            Names;                                             // 0x10(0x10)
	TArray<Str DamageStates>                                     DamageStates;                                      // 0x20(0x10)
};


// Size 0x80
struct CachedShipLoadout
{
public:
	Struct Guid                                                  ShipId;                                            // 0x0(0x10)
	Struct FString                                               Name;                                              // 0x10(0x10)
	TArray<struct ShipPartCustomisations>                        ShipPartCustomisations;                            // 0x20(0x10)
	Struct ShipPersistenceModel                                  DamageState;                                       // 0x30(0x50)
};


// Size 0x8
struct ShipPartCustomizationModel
{
public:
	struct FName                                                 EntitlementId;                                     // 0x0(0x8)
};


// Size 0x30
struct ShipPreviewData
{
public:
	Struct FString                                               Id;                                                // 0x0(0x10)
	Struct FString                                               Name;                                              // 0x10(0x10)
	Struct FString                                               DamageState;                                       // 0x20(0x10)
};


// Size 0x20
struct RequestShipPreviewUpdateEvent
{
public:
	Struct FString                                               ShipId;                                            // 0x0(0x10)
	Struct FString                                               ShipType;                                          // 0x10(0x10)
};


// Size 0x1
struct ShipPreviewLoadingEvent
{
public:
};


// Size 0x1
struct ShipPreviewLoadedEvent
{
public:
};


// Size 0x10
struct ShipPreviewCreatedEvent
{
public:
	Struct FString                                               PreviewURL;                                        // 0x0(0x10)
};


// Size 0x1
struct RequestDestroyShipPreviewEvent
{
public:
};


// Size 0x8
struct RequestCreateShipPreviewEvent
{
public:
	int                                                          ResolutionX;                                       // 0x0(0x4)
	int                                                          ResolutionY;                                       // 0x4(0x4)
};


// Size 0x18
struct CoherentToWwiseEventDataAssetEntry
{
public:
	Struct FString                                               CueKey;                                            // 0x0(0x10)
	Class WwiseEvent*                                            AudioEvent;                                        // 0x10(0x8)
};


// Size 0xf8
struct AmmoUI
{
public:
	Class Pawn*                                                  TargetPawn;                                        // 0x18(0x8)
};


// Size 0x170
struct HealthUI
{
public:
	float                                                        MinVisibleHealth;                                  // 0x0(0x4)
	float                                                        ContinuousTimePerUpdate;                           // 0x4(0x4)
	char                                                         pad0x18_VNSS1[0x18];                               // 0x8(0x18)
	Class Pawn*                                                  TargetPawn;                                        // 0x20(0x8)
};


// Size 0x10
struct CompanyRankData
{
public:
	TArray<struct RankGradeData>                                 RankGradeData;                                     // 0x0(0x10)
};


// Size 0x18
struct CompanyRankGradeData
{
public:
	class                                                        Rank;                                              // 0x0(0x8)
	Struct StringAssetReference                                  Ribbon;                                            // 0x8(0x10)
};


// Size 0x60
struct CompanyShopInfo
{
public:
	bool                                                         ShouldShowCompanyInfo;                             // 0x0(0x1)
	char                                                         pad0x7_MT3C9[0x7];                                 // 0x1(0x7)
	Struct StringAssetReference                                  InfoSkin;                                          // 0x8(0x10)
	Struct FText                                                 InfoTitle;                                         // 0x18(0x38)
	TArray<struct FText>                                         InfoTips;                                          // 0x50(0x10)
};


// Size 0x20
struct CompanyShopSkin
{
public:
	Struct StringAssetReference                                  TopBanner;                                         // 0x0(0x10)
	Struct StringAssetReference                                  BottomBanner;                                      // 0x10(0x10)
};


// Size 0xb8
struct CompanySkin
{
public:
	Struct StringAssetReference                                  BackgroundImage;                                   // 0x0(0x10)
	Struct StringAssetReference                                  RibbonImage;                                       // 0x10(0x10)
	byte                                                         Style;                                             // 0x20(0x1)
	char                                                         pad0x7_QQKIT[0x7];                                 // 0x21(0x7)
	Struct FString                                               RankIncreaseAudioCue;                              // 0x28(0x10)
	Struct FString                                               RankIncreaseStopAudioCue;                          // 0x38(0x10)
	Struct FString                                               RankLevelUpAudioCue;                               // 0x48(0x10)
	Struct FString                                               RankTriggerAudioCue;                               // 0x58(0x10)
	Struct FString                                               EmissaryRankIncreaseAudioCue;                      // 0x68(0x10)
	Struct FString                                               EmissaryRankIncreaseStopAudioCue;                  // 0x78(0x10)
	Struct FString                                               EmissaryRankLevelUpAudioCue;                       // 0x88(0x10)
	Struct FString                                               EmissaryRankTriggerAudioCue;                       // 0x98(0x10)
	Struct FString                                               EmissaryRankLevelUpMusicCue;                       // 0xa8(0x10)
};


// Size 0x18
struct CompanyProgressIcons
{
public:
	TArray<struct Icons>                                         Icons;                                             // 0x0(0x10)
};


// Size 0x10
struct CompanyProgressIcon
{
public:
	Struct StringAssetReference                                  Icon;                                              // 0x0(0x10)
};


// Size 0x10
struct CompanyReputationProgressModelCollection
{
public:
	TArray<struct CompanyProgress>                               CompanyProgress;                                   // 0x0(0x10)
};


// Size 0x28
struct CompanyReputationProgressModel
{
public:
	struct FName                                                 CompanyId;                                         // 0x0(0x8)
	Struct CompanyLevelDefinition                                NextCompanyLevel;                                  // 0x10(0x8)
	Struct FString                                               Sig;                                               // 0x18(0x10)
};


// Size 0x8
struct CompanyLevelDefinition
{
public:
};


// Size 0x10
struct PlayerNewLevelEvent
{
public:
	struct FName                                                 CompanyId;                                         // 0x8(0x8)
};


// Size 0x10
struct EventCompanyRankProgressUpdateNotification
{
public:
	struct FName                                                 Company;                                           // 0x0(0x8)
};


// Size 0x1
struct PlayerCompanyProgressUpdatedEvent
{
public:
};


// Size 0x50
struct EventCompanyProgressUpdateNotification
{
public:
	Struct CompanyReputationProgressModel                        CurrentProgress;                                   // 0x0(0x28)
	Struct CompanyReputationProgressModel                        PreviousProgress;                                  // 0x28(0x28)
};


// Size 0x10
struct AssociatedCompanies
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	struct FName                                                 FeatureToggle;                                     // 0x8(0x8)
};


// Size 0x10
struct CompanyValidationAssetUnit
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	bool                                                         ShouldHaveLevels;                                  // 0x8(0x1)
	bool                                                         ShouldHaveEmblems;                                 // 0x9(0x1)
};


// Size 0x18
struct ConstellationAudioPair
{
public:
	class                                                        ConstellationClass;                                // 0x0(0x8)
	Class WwiseEvent*                                            AudioStartEvent;                                   // 0x8(0x8)
	Class WwiseEvent*                                            AudioStopEvent;                                    // 0x10(0x8)
};


// Size 0x18
struct NPCPurchaseList
{
public:
	Class Actor*                                                 NPC;                                               // 0x0(0x8)
	TArray<class Class*>                                         Items;                                             // 0x8(0x10)
};


// Size 0x10
struct RegisterCeremonyInterface
{
public:
};


// Size 0x98
struct ContestCeremonyEvent
{
public:
	TArray<class WwiseEvent*>                                    AudioEvents;                                       // 0x0(0x10)
	TArray<Byte SpecialEvents>                                   SpecialEvents;                                     // 0x10(0x10)
	Struct FText                                                 NPCName;                                           // 0x20(0x38)
	Struct FText                                                 NPCMessageToAllPlayers;                            // 0x58(0x38)
	float                                                        TimeToEvent;                                       // 0x90(0x4)
};


// Size 0x18
struct ContestEventSet
{
public:
	TArray<struct Events>                                        Events;                                            // 0x0(0x10)
	byte                                                         BelongingStage;                                    // 0x10(0x1)
	byte                                                         StageTimePivot;                                    // 0x11(0x1)
};


// Size 0x180
struct ShipIdentityOwnership
{
public:
	Struct Guid                                                  OwningCrewID;                                      // 0x0(0x10)
	Struct ShipLiveryCatalogueEntry                              Identity;                                          // 0x10(0x170)
};


// Size 0x170
struct ShipLiveryCatalogueEntry
{
public:
	Struct Guid                                                  Id;                                                // 0x0(0x10)
	Struct StringAssetReference                                  Desc;                                              // 0x10(0x10)
	Struct StringAssetReference                                  RowboatLiveryDesc;                                 // 0x20(0x10)
	TArray<struct FText>                                         Names;                                             // 0x30(0x10)
	class                                                        ShipSize;                                          // 0x40(0x8)
	bool                                                         AvailableToGame;                                   // 0x48(0x1)
	char                                                         pad0x3_IZ3HX[0x3];                                 // 0x49(0x3)
	struct FName                                                 FeatureName;                                       // 0x4c(0x8)
	char                                                         pad0x4_CAN7J[0x4];                                 // 0x54(0x4)
	Struct FText                                                 ShipTeamName;                                      // 0x58(0x38)
	Struct FText                                                 ArenaCrewWelcomeMessage;                           // 0x90(0x38)
	Struct FText                                                 ShipUINotificationTeamName;                        // 0xc8(0x38)
	Class Texture*                                               ShipScrollTeamIcon;                                // 0x100(0x8)
	Struct StringAssetReference                                  ShipToastTeamIcon;                                 // 0x108(0x10)
	Struct StringAssetReference                                  ShipToastTeamBackgroundImage;                      // 0x118(0x10)
	Struct StringAssetReference                                  ShipToastForegroundArtWork;                        // 0x128(0x10)
	Struct StringAssetReference                                  ShipTeamBackgroundImage;                           // 0x138(0x10)
	struct FName                                                 AudioEventName;                                    // 0x148(0x8)
	Struct StringAssetReference                                  TeamTavernBannerTexture;                           // 0x150(0x10)
	Class Texture*                                               CrewLiveryOverlayIcon;                             // 0x160(0x8)
	bool                                                         AvailableWhenFeatureEnabled;                       // 0x168(0x1)
	bool                                                         AvailableWhenFeatureDisabled;                      // 0x169(0x1)
};


// Size 0x10
struct ShipLiveryCatalogue
{
public:
	TArray<struct Liveries>                                      Liveries;                                          // 0x0(0x10)
};


// Size 0x20
struct OwnedCrewCostumes
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	TArray<Assetclass Costumes>                                  Costumes;                                          // 0x10(0x10)
};


// Size 0x8
struct CaptureChatPerformanceTelemetryFragment
{
public:
};


// Size 0xe8
struct TimedContestEventAction
{
public:
	Struct FText                                                 NPCName;                                           // 0x8(0x38)
	Struct FText                                                 NPCMessageToAllPlayers;                            // 0x40(0x38)
	float                                                        Duration;                                          // 0x78(0x4)
	char                                                         pad0x4_IZEGI[0x4];                                 // 0x7c(0x4)
	TArray<Byte SpecialEvents>                                   SpecialEvents;                                     // 0x80(0x10)
	TArray<class WwiseEvent*>                                    AudioEvents;                                       // 0x90(0x10)
};


// Size 0x68
struct ContestMapLayoutScoreInfo
{
public:
	Struct TreasureMapWidgetTexture                              ScoreInfoIcon;                                     // 0x0(0x28)
	Struct TreasureMapWidgetText                                 ScoreInfoText;                                     // 0x28(0x38)
	byte                                                         ScoreReason;                                       // 0x60(0x1)
};


// Size 0xe8
struct ContestMapLayoutCrew
{
public:
	Struct TreasureMapWidgetTexture                              CrewIcon;                                          // 0x0(0x28)
	Struct TreasureMapWidgetTexture                              ScoreIcon;                                         // 0x28(0x28)
	Struct TreasureMapWidgetTexture                              UnderlineIcon;                                     // 0x50(0x28)
	Struct TreasureMapWidgetText                                 CrewName;                                          // 0x78(0x38)
	Struct TreasureMapWidgetText                                 Score;                                             // 0xb0(0x38)
};


// Size 0x50
struct MerchantSpawnData
{
public:
	Struct Transform                                             MerchantTransform;                                 // 0x20(0x30)
};


// Size 0x30
struct QuestVariableContestIslandArchetype
{
public:
};


// Size 0x28
struct ContestCrewRequirementData
{
public:
	int                                                          CrewCount;                                         // 0x0(0x4)
	char                                                         pad0x4_KBLKB[0x4];                                 // 0x4(0x4)
	Struct FString                                               CrewCountServicesConfigRetrievalString;            // 0x8(0x10)
	TArray<struct OpenCrewRequirementData>                       OpenCrewRequirementData;                           // 0x18(0x10)
};


// Size 0x20
struct ShipSizeRequirementData
{
public:
	class                                                        ShipSize;                                          // 0x0(0x8)
	int                                                          OpenCrewMemberCount;                               // 0x8(0x4)
	char                                                         pad0x4_Q0J6E[0x4];                                 // 0xc(0x4)
	Struct FString                                               OpenCrewCountRetrivalString;                       // 0x10(0x10)
};


// Size 0x80
struct ContestUIDescriptions
{
public:
	Class PopUpMessageDesc*                                      NewMapDesc;                                        // 0x0(0x8)
	Class PopUpMessageDesc*                                      ShipSunkDesc;                                      // 0x8(0x8)
	Struct FText                                                 ContestStartBlindText;                             // 0x10(0x38)
	Struct FText                                                 ContestEndBlindText;                               // 0x48(0x38)
};


// Size 0x10
struct ShipLiveryTeamSet
{
public:
	TArray<struct ShipCatalogue>                                 ShipCatalogue;                                     // 0x0(0x10)
};


// Size 0x60
struct ContestShipLiverySet
{
public:
	Struct Guid                                                  OwningCrewID;                                      // 0x0(0x10)
};


// Size 0x1
struct OtherCrewMuteStateResponse
{
public:
	byte                                                         MuteState;                                         // 0x0(0x1)
};


// Size 0x1
struct OtherCrewMuteStateRequest
{
public:
};


// Size 0x1
struct CrewMuteOthersPhrasesEvent
{
public:
	bool                                                         IsMuted;                                           // 0x0(0x1)
};


// Size 0x18
struct CrewMutePlayerPhrasesEvent
{
public:
	Struct FString                                               XUID;                                              // 0x0(0x10)
	bool                                                         IsMuted;                                           // 0x10(0x1)
};


// Size 0x1
struct CrewMuteOthersChatEvent
{
public:
	bool                                                         IsMuted;                                           // 0x0(0x1)
};


// Size 0x18
struct CrewMutePlayerChatEvent
{
public:
	Struct FString                                               XUID;                                              // 0x0(0x10)
	bool                                                         IsMuted;                                           // 0x10(0x1)
};


// Size 0x1
struct CrewMuteOthersVoiceEvent
{
public:
	bool                                                         IsMuted;                                           // 0x0(0x1)
};


// Size 0x18
struct CrewMutePlayerVoiceEvent
{
public:
	Struct FString                                               XUID;                                              // 0x0(0x10)
	bool                                                         IsMuted;                                           // 0x10(0x1)
};


// Size 0x10
struct ContestCrewManagementMemberDataEvent
{
public:
	TArray<struct Members>                                       Members;                                           // 0x0(0x10)
};


// Size 0x38
struct ContestCrewManagementMemberData
{
public:
	Struct FString                                               XUID;                                              // 0x0(0x10)
	Struct FString                                               GamerTag;                                          // 0x10(0x10)
	byte                                                         Muted;                                             // 0x20(0x1)
	char                                                         pad0x7_K9GF8[0x7];                                 // 0x21(0x7)
	Struct FString                                               CrewIcon;                                          // 0x28(0x10)
};


// Size 0x1
struct ContestStopCrewManagementEvent
{
public:
};


// Size 0x1
struct ContestRequestCrewManagementEvent
{
public:
};


// Size 0x10
struct ContestUpdateScoreBoardTimer
{
public:
	Struct FString                                               TimeRemaining;                                     // 0x0(0x10)
};


// Size 0x28
struct ContestLaunchStartBlinds
{
public:
	Struct Guid                                                  CrewId;                                            // 0x10(0x10)
	float                                                        DisplayDuration;                                   // 0x20(0x4)
};


// Size 0x20
struct StagingPlayerWelcomingPopup
{
public:
	Struct Guid                                                  LiveryID;                                          // 0x10(0x10)
};


// Size 0x20
struct ContestShipSinkNetworkEvent
{
public:
	Struct Guid                                                  CrewLiveryId;                                      // 0x10(0x10)
};


// Size 0x30
struct ContestEndEvent
{
public:
	int                                                          Position;                                          // 0x0(0x4)
	char                                                         pad0x4_L4JUA[0x4];                                 // 0x4(0x4)
	Struct FString                                               Message;                                           // 0x8(0x10)
	TArray<struct Scores>                                        Scores;                                            // 0x18(0x10)
	float                                                        HoldDuration;                                      // 0x28(0x4)
};


// Size 0x38
struct ScoreboardItems
{
public:
	Struct FString                                               Icon;                                              // 0x0(0x10)
	Struct FString                                               CrewName;                                          // 0x10(0x10)
	Struct FString                                               Score;                                             // 0x20(0x10)
	bool                                                         IsMyCrew;                                          // 0x30(0x1)
};


// Size 0x48
struct ContestStartEvent
{
public:
	Struct FString                                               Message;                                           // 0x0(0x10)
	Struct FString                                               CrewIcon;                                          // 0x10(0x10)
	Struct FString                                               CrewName;                                          // 0x20(0x10)
	TArray<Str CrewMembers>                                      CrewMembers;                                       // 0x30(0x10)
	float                                                        HoldDuration;                                      // 0x40(0x4)
};


// Size 0x18
struct ContestNotificationNetworkEvent
{
public:
	Class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x10(0x8)
};


// Size 0x10
struct ContestRequestScoreBoardData
{
public:
};


// Size 0x10
struct RequestContestStateEvent
{
public:
};


// Size 0x18
struct ContestStateChangedEvent
{
public:
	byte                                                         ContestState;                                      // 0x10(0x1)
};


// Size 0x20
struct UpdateScoreBalanceHUDEvent
{
public:
	TArray<struct ContestLeaderboard>                            ContestLeaderboard;                                // 0x10(0x10)
};


// Size 0x38
struct ContestLeaderboardEntry
{
public:
	Struct FString                                               CrewIconPath;                                      // 0x10(0x10)
	bool                                                         IsMyCrew;                                          // 0x20(0x1)
	char                                                         pad0x3_QH0ZW[0x3];                                 // 0x21(0x3)
	int                                                          Amount;                                            // 0x24(0x4)
	Struct FString                                               DisplayAmount;                                     // 0x28(0x10)
};


// Size 0x30
struct ScoreGrantedNotificationUIEvent
{
public:
	byte                                                         ScoreId;                                           // 0x0(0x1)
	char                                                         pad0x7_NN6P1[0x7];                                 // 0x1(0x7)
	Struct FString                                               DisplayAmount;                                     // 0x8(0x10)
	int                                                          Amount;                                            // 0x18(0x4)
	char                                                         pad0x4_ULPH6[0x4];                                 // 0x1c(0x4)
	Struct FString                                               ScoringIconPath;                                   // 0x20(0x10)
};


// Size 0x28
struct WeightedContestList
{
public:
	TArray<struct WeightedContests>                              WeightedContests;                                  // 0x8(0x10)
	TArray<struct WeightedTallTaleContests>                      WeightedTallTaleContests;                          // 0x18(0x10)
};


// Size 0x10
struct WeightedTallTaleContestRecipe
{
public:
	Class TallTaleContestRecipeDataAsset*                        TallTaleContest;                                   // 0x0(0x8)
	int                                                          WeightedChance;                                    // 0x8(0x4)
};


// Size 0x10
struct WeightedEmergentContestVoyageRecipe
{
public:
	Class EmergentContestVoyageRecipeDataAsset*                  ContestVoyage;                                     // 0x0(0x8)
	int                                                          WeightedChance;                                    // 0x8(0x4)
};


// Size 0x20
struct TallTaleContestInfo
{
public:
	TArray<class Class*>                                         ValidShipTypes;                                    // 0x0(0x10)
	Struct WeightedTallTaleContestRecipe                         WeightedTallTaleContest;                           // 0x10(0x10)
};


// Size 0x20
struct ContestVoyageInfo
{
public:
	TArray<class Class*>                                         ValidShipTypes;                                    // 0x0(0x10)
	Struct WeightedEmergentContestVoyageRecipe                   WeightedContestVoyage;                             // 0x10(0x10)
};


// Size 0x10
struct ContestVoyagesSelectorUnit
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x0(0x8)
	Class ContestVoyagesDataAsset*                               ContestVoyages;                                    // 0x8(0x8)
};


// Size 0x50
struct CachedRespawnPoint
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	Struct Transform                                             AllocatedRespawnPoint;                             // 0x10(0x30)
	Class ShipSpawnLocation*                                     AllocatedSpawnLocation;                            // 0x40(0x8)
};


// Size 0x50
struct ContestZoneVendorShipData
{
public:
	Struct Transform                                             ContestZoneWorldLocation;                          // 0x20(0x30)
};


// Size 0xc0
struct CoordinatedKrakenTentacleSpawnInfo
{
public:
	Struct Transform                                             SpawnTransform;                                    // 0x0(0x30)
	Struct Transform                                             FinalSpawnTransform;                               // 0x30(0x30)
	int                                                          ClientCapsuleCullCount;                            // 0x60(0x4)
	bool                                                         ShouldDockToTargetActor;                           // 0x64(0x1)
	bool                                                         RequiresBoxCollider;                               // 0x65(0x1)
	bool                                                         RequiresKnockback;                                 // 0x66(0x1)
	char                                                         pad0x1_PVGA2[0x1];                                 // 0x67(0x1)
	Struct Vector                                                BoxExtents;                                        // 0x68(0xc)
	char                                                         pad0xc_3CZIT[0xc];                                 // 0x74(0xc)
	Struct Transform                                             BoxOffset;                                         // 0x80(0x30)
};


// Size 0x18
struct CrestPartDesc
{
public:
	Class StaticMesh*                                            CrestMesh;                                         // 0x0(0x8)
	TArray<class MaterialInterface*>                             CrestMaterials;                                    // 0x8(0x10)
};


// Size 0x18
struct ProposedTaleEntry
{
public:
	Class VoyageDescDataAsset*                                   TaleData;                                          // 0x0(0x8)
	Class Actor*                                                 ProposingObject;                                   // 0x8(0x8)
	bool                                                         CanStartTale;                                      // 0x10(0x1)
};


// Size 0x18
struct ProposedVoyageEntry
{
public:
	Class VoyageProposalDesc*                                    ProposalDesc;                                      // 0x0(0x8)
	Class AthenaPlayerState*                                     ProposingPlayerState;                              // 0x8(0x8)
	bool                                                         VoyageIsShipEntitlement;                           // 0x10(0x1)
};


// Size 0x10
struct ShipCustomizationLoadoutPartCustomizations
{
public:
	TArray<struct Parts>                                         Parts;                                             // 0x0(0x10)
};


// Size 0x20
struct PartDesc
{
public:
	Struct FString                                               Name;                                              // 0x0(0x10)
	TArray<struct Customisations>                                Customisations;                                    // 0x10(0x10)
};


// Size 0x20
struct PartCustomisation
{
public:
	Struct FString                                               Category;                                          // 0x0(0x10)
	Struct StringAssetReference                                  Customisation;                                     // 0x10(0x10)
};


// Size 0x4
struct SinkShipData
{
public:
	int                                                          ShipNetGUID;                                       // 0x0(0x4)
};


// Size 0xb8
struct CustomTriggerData
{
public:
	Class TriggerBase*                                           TriggerObject;                                     // 0x0(0x8)
	bool                                                         DetectingPlayers;                                  // 0xa8(0x1)
	bool                                                         DetectingShips;                                    // 0xa9(0x1)
	bool                                                         DetectingEnemies;                                  // 0xaa(0x1)
	char                                                         pad0x5_AE5P8[0x5];                                 // 0xab(0x5)
	Class TriggerCollisionHelper*                                CollisionHelper;                                   // 0xb0(0x8)
};


// Size 0x10
struct CustomItemDetectionData
{
public:
};


// Size 0x40
struct ObjectHitDetectedEvent
{
public:
};


// Size 0x40
struct ProjectileLauncherMechanismSourceShipParams
{
public:
	class                                                        ShipSize;                                          // 0x0(0x8)
	Struct ProjectileLauncherMechanismSourceWatercraftParams     Params;                                            // 0x8(0x38)
};


// Size 0x38
struct ProjectileLauncherMechanismSourceWatercraftParams
{
public:
	float                                                        ShipBoundsMultiplier;                              // 0x0(0x4)
	float                                                        NearMissChance;                                    // 0x4(0x4)
	Struct WeightedProbabilityRangeOfRanges                      NearMissShipOffsetInMetres;                        // 0x8(0x30)
};


// Size 0x90
struct LevelOfDamageProperties
{
public:
	float                                                        LeakAmount;                                        // 0x0(0x4)
	float                                                        RepairTime;                                        // 0x4(0x4)
	float                                                        UndoRepairTime;                                    // 0x8(0x4)
	float                                                        NonOwningCrewUndoRepairTime;                       // 0xc(0x4)
	Class MaterialInterface*                                     HoleDecalMaterial;                                 // 0x10(0x8)
	char                                                         pad0x8_BZE59[0x8];                                 // 0x18(0x8)
	Struct Transform                                             HoleDecalComponentTransform;                       // 0x20(0x30)
	Struct Vector                                                ParticleSystemComponentLocation;                   // 0x50(0xc)
	float                                                        InternalWaterSamplePositionTopOffset;              // 0x5c(0x4)
	float                                                        InternalWaterSamplePositionBottomOffset;           // 0x60(0x4)
	char                                                         pad0x4_5L5TY[0x4];                                 // 0x64(0x4)
	Class ParticleSystem*                                        ParticleSystem_WaterLeakAboveWater;                // 0x68(0x8)
	Class ParticleSystem*                                        ParticleSystem_WaterLeakBelowWater;                // 0x70(0x8)
	Class ParticleSystem*                                        ParticleSystem_RepairLeakAboveWater;               // 0x78(0x8)
	Class ParticleSystem*                                        ParticleSystem_RepairLeakBelowWater;               // 0x80(0x8)
	Class ParticleSystem*                                        ParticleSystem_SplashOnInternalWaterSurface;       // 0x88(0x8)
};


// Size 0x18
struct AuthorityRepairableState
{
public:
	byte                                                         RepairableState;                                   // 0x0(0x1)
	char                                                         pad0x7_TK6IM[0x7];                                 // 0x1(0x7)
	TArray<Weakclass RepairingList>                              RepairingList;                                     // 0x8(0x10)
};


// Size 0x18
struct DeferralReasonPopUpNotificationInfo
{
public:
	Struct FString                                               DeferralReason;                                    // 0x0(0x10)
	Class PopUpMessageDesc*                                      PopUp;                                             // 0x10(0x8)
};


// Size 0x48
struct MultipleNPCCompaniesRedirectionData
{
public:
	TArray<class Class*>                                         Companies;                                         // 0x0(0x10)
	Struct FText                                                 VisitNPCTooltip;                                   // 0x10(0x38)
};


// Size 0x40
struct SingleNPCCompanyRedirectionData
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	Struct FText                                                 VisitNPCTooltip;                                   // 0x8(0x38)
};


// Size 0x18
struct ItemDiggingAnimationOverride
{
public:
	TArray<Assetclass Classes>                                   Classes;                                           // 0x0(0x10)
	Class ItemDiggingAnimationConfig*                            DiggingAnimationConfig;                            // 0x10(0x8)
};


// Size 0x18
struct ItemDiggingAudioOverride
{
public:
	TArray<Assetclass Classes>                                   Classes;                                           // 0x0(0x10)
	Class ItemDiggingAudioConfig*                                DiggingAudioConfig;                                // 0x10(0x8)
};


// Size 0x18
struct ItemDiggingBaseOverride
{
public:
	TArray<Assetclass Classes>                                   Classes;                                           // 0x0(0x10)
	Class ItemDiggingBaseConfig*                                 DiggingBaseConfig;                                 // 0x10(0x8)
};


// Size 0x18
struct ItemBuryingBaseOverride
{
public:
	TArray<Assetclass Classes>                                   Classes;                                           // 0x0(0x10)
	Class ItemDiggingBuryConfig*                                 BuryingConfig;                                     // 0x10(0x8)
};


// Size 0x18
struct ItemDiggingEffectsOverride
{
public:
	TArray<Assetclass Classes>                                   Classes;                                           // 0x0(0x10)
	Class ItemDiggingEffectsConfig*                              DiggingEffectsConfig;                              // 0x10(0x8)
};


// Size 0x30
struct DioramaDebugMenuEntry
{
public:
	Class AISpawner*                                             Spawner;                                           // 0x0(0x8)
	Class AIDioramaDesc*                                         DioramaDesc;                                       // 0x8(0x8)
	Struct FString                                               DioramaName;                                       // 0x10(0x10)
	Struct FString                                               TaleId;                                            // 0x20(0x10)
};


// Size 0x8
struct DrapesPartDesc
{
public:
	Class MaterialInterface*                                     DrapesMaterial;                                    // 0x0(0x8)
};


// Size 0x14
struct DrunkennessSetupData
{
public:
	byte                                                         DrunkennessType;                                   // 0x0(0x1)
	char                                                         pad0x3_GDGHU[0x3];                                 // 0x1(0x3)
	float                                                        MaxDrunkenness;                                    // 0x4(0x4)
	float                                                        GettingDrunkDrunkennessChangePerSec;               // 0x8(0x4)
	float                                                        SoberingUpDrunkennessChangePerSec;                 // 0xc(0x4)
	bool                                                         AutoSoberUpWhenFullyDrunk;                         // 0x10(0x1)
};


// Size 0x18
struct EmissaryRewardMultiplierModel
{
public:
	struct FName                                                 EmissaryName;                                      // 0x0(0x8)
	TArray<struct Multipliers>                                   Multipliers;                                       // 0x8(0x10)
};


// Size 0x8
struct EmissaryLevelMultiplierModel
{
public:
	int                                                          Level;                                             // 0x0(0x4)
	float                                                        Multiplier;                                        // 0x4(0x4)
};


// Size 0x90
struct EmissaryDisplayInformation
{
public:
	Struct FText                                                 Title;                                             // 0x0(0x38)
	Struct FText                                                 Description;                                       // 0x38(0x38)
	Struct StringAssetReference                                  KeyArt;                                            // 0x70(0x10)
	Struct StringAssetReference                                  Icon;                                              // 0x80(0x10)
};


// Size 0xc8
struct EmoteFlourishCategoryMapping
{
public:
	class                                                        ItemCategory;                                      // 0x0(0x8)
	Struct StringAssetReference                                  IconPath;                                          // 0x8(0x10)
	Struct EmoteData                                             EmoteData;                                         // 0x18(0xa0)
	Struct FString                                               PairName;                                          // 0xb8(0x10)
};


// Size 0x10
struct EntitlementsFailedEvent
{
public:
	Struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x10
struct EntitlementsResponseEvent
{
public:
	TArray<struct Entitlements>                                  Entitlements;                                      // 0x0(0x10)
};


// Size 0xa8
struct EntitlementItem
{
public:
	Struct FText                                                 Description;                                       // 0x0(0x38)
	bool                                                         Owned;                                             // 0x38(0x1)
	char                                                         pad0x7_O3FSS[0x7];                                 // 0x39(0x7)
	Struct StringAssetReference                                  PreviewImageUrl;                                   // 0x40(0x10)
	Struct StringAssetReference                                  ThumbnailImageUrl;                                 // 0x50(0x10)
	Struct FText                                                 DisplayName;                                       // 0x60(0x38)
	Struct FString                                               Id;                                                // 0x98(0x10)
};


// Size 0x10
struct EntitlementsRequestEvent
{
public:
	TArray<Str EntitlementIds>                                   EntitlementIds;                                    // 0x0(0x10)
};


// Size 0x18
struct RequiredClothingData
{
public:
	int                                                          RequiredNumberToMatch;                             // 0x0(0x4)
	char                                                         pad0x4_Q1YYB[0x4];                                 // 0x4(0x4)
	TArray<class Class*>                                         RequiredClothing;                                  // 0x8(0x10)
};


// Size 0x18
struct ItemRequirementData
{
public:
	int                                                          RequiredNumberToMatch;                             // 0x0(0x4)
	char                                                         pad0x4_NECHI[0x4];                                 // 0x4(0x4)
	TArray<class Class*>                                         RequiredItemsInLoadout;                            // 0x8(0x10)
};


// Size 0x18
struct EventTaleQuestServiceEntry
{
public:
};


// Size 0x10
struct EventObjectStateMigrationImpl
{
public:
};


// Size 0x8
struct EventReceiveExplosiveComponentState
{
public:
	Class ExplosiveComponent*                                    Source;                                            // 0x0(0x8)
};


// Size 0x10
struct ShipHullDamageParams
{
public:
	TArray<struct DamageLevels>                                  DamageLevels;                                      // 0x0(0x10)
};


// Size 0x18
struct ShipHullDamageLevel
{
public:
	class                                                        SpeedBand;                                         // 0x0(0x8)
	TArray<struct Params>                                        Params;                                            // 0x8(0x10)
};


// Size 0x48
struct ShipHullDamageTypeEntry
{
public:
	byte                                                         DamageType;                                        // 0x0(0x1)
	char                                                         pad0x7_TBTLY[0x7];                                 // 0x1(0x7)
	Struct ShipHullLandscapeDamageEntry                          LandscapeDamageParams;                             // 0x8(0x30)
	Struct ShipHullRammingSpurDamageEntry                        RammingSpurDamageParams;                           // 0x38(0x10)
};


// Size 0x10
struct ShipHullRammingSpurDamageEntry
{
public:
	TArray<struct DamageAppliedToSelf>                           DamageAppliedToSelf;                               // 0x0(0x10)
};


// Size 0x50
struct ShipDamageEntry
{
public:
	class                                                        OtherShipSize;                                     // 0x0(0x8)
	Class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x8(0x8)
	Struct Int32Range                                            NumZonesToDamageForInstigator;                     // 0x10(0x10)
	Struct Int32Range                                            DamageLevelForInstigator;                          // 0x20(0x10)
	Struct Int32Range                                            NumZonesToDamageForReceiver;                       // 0x30(0x10)
	Struct Int32Range                                            DamageLevelForReceiver;                            // 0x40(0x10)
};


// Size 0x30
struct ShipHullLandscapeDamageEntry
{
public:
	byte                                                         PhysicalSurface;                                   // 0x0(0x1)
	char                                                         pad0x7_A4U46[0x7];                                 // 0x1(0x7)
	Class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x8(0x8)
	Struct Int32Range                                            NumZonesToDamage;                                  // 0x10(0x10)
	Struct Int32Range                                            DamageLevel;                                       // 0x20(0x10)
};


// Size 0x10
struct RammableExplosiveEntry
{
public:
	class                                                        RammerType;                                        // 0x0(0x8)
	class                                                        MinimumSpeedForExplosion;                          // 0x8(0x8)
};


// Size 0x8
struct ChargedAttackProjectileWeights
{
public:
	float                                                        ChargeTime;                                        // 0x0(0x4)
	float                                                        Weight;                                            // 0x4(0x4)
};


// Size 0x30
struct QuestVariablePlayerStat
{
public:
};


// Size 0x70
struct ClassicFireworkDebugList
{
public:
	TArray<class ItemDescSpawnData*>                             Peony;                                             // 0x0(0x10)
	TArray<class ItemDescSpawnData*>                             Crackle;                                           // 0x10(0x10)
	TArray<class ItemDescSpawnData*>                             Strobe;                                            // 0x20(0x10)
	TArray<class ItemDescSpawnData*>                             Brocade;                                           // 0x30(0x10)
	TArray<class ItemDescSpawnData*>                             Comet;                                             // 0x40(0x10)
	TArray<class ItemDescSpawnData*>                             HummingSnakes;                                     // 0x50(0x10)
	TArray<class ItemDescSpawnData*>                             Cakes;                                             // 0x60(0x10)
};


// Size 0x20
struct FireworkDebugListByFireworkType
{
public:
	TArray<class ItemDescSpawnData*>                             Rockets;                                           // 0x0(0x10)
	TArray<class ItemDescSpawnData*>                             Cakes;                                             // 0x10(0x10)
};


// Size 0xc
struct FlameOfFateEffectParams
{
public:
	bool                                                         ShouldAffectShadowFormAI;                          // 0x0(0x1)
	char                                                         pad0x3_50Z4W[0x3];                                 // 0x1(0x3)
	float                                                        FlameOfFateEffectRadiusIdle;                       // 0x4(0x4)
	float                                                        FlameOfFateEffectRadiusActive;                     // 0x8(0x4)
};


// Size 0x78
struct CycleFlameOfFateParams
{
public:
	bool                                                         IncludeCycleFlameOfFateOneShotResponse;            // 0x0(0x1)
	char                                                         pad0x7_4I919[0x7];                                 // 0x1(0x7)
	class                                                        OneShotResponseNotificationInputId;                // 0x8(0x8)
	bool                                                         IncludeCycleFlameOfFateActionRule;                 // 0x10(0x1)
	char                                                         pad0x7_IECYK[0x7];                                 // 0x11(0x7)
	class                                                        ActionRuleNotificationInputId;                     // 0x18(0x8)
	byte                                                         ActionRulePriority;                                // 0x20(0x1)
	char                                                         pad0x7_IQMOP[0x7];                                 // 0x21(0x7)
	Struct FText                                                 CycleFlameOfFateActionRuleVerbiage;                // 0x28(0x38)
	Struct CycleFlameOfFateSequence                              FlameOfFateSequence;                               // 0x60(0x18)
};


// Size 0xf8
struct TakeFlameOfFateParams
{
public:
	bool                                                         IncludeTakeFlameOfFateActionRule;                  // 0x0(0x1)
	char                                                         pad0x7_IHUZN[0x7];                                 // 0x1(0x7)
	class                                                        ActionRuleNotificationInputId;                     // 0x8(0x8)
	byte                                                         ActionRulePriority;                                // 0x10(0x1)
	char                                                         pad0x7_5SMPE[0x7];                                 // 0x11(0x7)
	Struct FText                                                 TakeFlameOfFateTooltipText;                        // 0x18(0x38)
	Struct FText                                                 LanternNotRaisedToolTipText;                       // 0x50(0x38)
	Struct FText                                                 NotWieldingFlameTooltipText;                       // 0x88(0x38)
	Struct FText                                                 CannotSetFlameTooltipText;                         // 0xc0(0x38)
};


// Size 0x10
struct FlameOfFateAudioParams
{
public:
	Class WwiseObjectPoolWrapper*                                SfxPool;                                           // 0x0(0x8)
	Class WwiseEvent*                                            FlameOfFateTypeChangedAudioEvent;                  // 0x8(0x8)
};


// Size 0xc
struct SailWithFlameOfFateColoursAboardStatData
{
public:
	Struct PlayerStat                                            DefaultStatToFire;                                 // 0x4(0x4)
	Struct PlayerStat                                            AllianceStatToFire;                                // 0x8(0x4)
};


// Size 0x10
struct FlamesOfFateShipInfo
{
public:
	class                                                        ShipSize;                                          // 0x0(0x8)
};


// Size 0x28
struct FlamesOfFateFlameInfo
{
public:
	byte                                                         FlameOfFateType;                                   // 0x0(0x1)
	char                                                         pad0x3_D87Y8[0x3];                                 // 0x1(0x3)
	Struct Color                                                 LightColour;                                       // 0x4(0x4)
	Struct Color                                                 FXColour;                                          // 0x8(0x4)
	Struct Color                                                 GlowColour;                                        // 0xc(0x4)
	Struct Color                                                 FlameColour;                                       // 0x10(0x4)
	char                                                         pad0x4_S2A0H[0x4];                                 // 0x14(0x4)
	Class Texture*                                               FlameTexture;                                      // 0x18(0x8)
	Struct PlayerStat                                            StatToFireWhenTaken;                               // 0x20(0x4)
	Struct PlayerStat                                            StatToFireWhenTakenInAlliance;                     // 0x24(0x4)
};


// Size 0x24
struct FogBankStoryRelatedSettings
{
public:
	Struct StoryFlag                                             Story;                                             // 0x0(0x8)
	float                                                        Density;                                           // 0x8(0x4)
	Struct LinearColor                                           FogColour;                                         // 0xc(0x10)
	float                                                        FadeInDuration;                                    // 0x1c(0x4)
	float                                                        MaximumAudioFogIntensityRTPC;                      // 0x20(0x4)
};


// Size 0x18
struct FeatureToggledFogBankAsset
{
public:
	Struct FeatureFlag                                           FeatureToggle;                                     // 0x0(0xc)
	char                                                         pad0x4_2M6V2[0x4];                                 // 0xc(0x4)
	Class FogBankDataAsset*                                      Asset;                                             // 0x10(0x8)
};


// Size 0x4c
struct FogBankSettings
{
public:
	byte                                                         FogState;                                          // 0x0(0x1)
	char                                                         pad0x3_3L9RF[0x3];                                 // 0x1(0x3)
	float                                                        Density;                                           // 0x4(0x4)
	Struct Vector                                                Scale;                                             // 0x8(0xc)
	Struct LinearColor                                           FogColour;                                         // 0x14(0x10)
	float                                                        FadeInDuration;                                    // 0x24(0x4)
	float                                                        ActiveDuration;                                    // 0x28(0x4)
	float                                                        FadeOutDuration;                                   // 0x2c(0x4)
	bool                                                         Persistent;                                        // 0x30(0x1)
	char                                                         pad0x3_BBNLS[0x3];                                 // 0x31(0x3)
	float                                                        PreviousDensity;                                   // 0x34(0x4)
	Struct LinearColor                                           PreviousFogColour;                                 // 0x38(0x10)
	float                                                        MaximumAudioFogIntensityRTPC;                      // 0x48(0x4)
};


// Size 0x18
struct FogColourForSea
{
public:
	class                                                        Sea;                                               // 0x0(0x8)
	Struct LinearColor                                           Colour;                                            // 0x8(0x10)
};


// Size 0xc
struct FogBankManagerIslandNamesToKeepAwayFrom
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	float                                                        MinimumDistanceFromIslandInKm;                     // 0x8(0x4)
};


// Size 0x8
struct FogBankManagerIslandTypesToKeepAwayFrom
{
public:
	byte                                                         IslandType;                                        // 0x0(0x1)
	char                                                         pad0x3_OWO81[0x3];                                 // 0x1(0x3)
	float                                                        MinimumDistanceFromIslandInKm;                     // 0x4(0x4)
};


// Size 0x48
struct FogBankManagerFogBankTemplate
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	char                                                         pad0x4_D0Q1B[0x4];                                 // 0x4(0x4)
	TArray<class Class*>                                         FogBanks;                                          // 0x8(0x10)
	Struct WeightedProbabilityRangeOfRanges                      DistanceFromIslandInKm;                            // 0x18(0x30)
};


// Size 0x28
struct DecalEntry
{
public:
	Class DecalComponent*                                        DecalComponent;                                    // 0x0(0x8)
	Class MaterialInstanceDynamic*                               DecalMaterial;                                     // 0x8(0x8)
	Struct LinearColor                                           DecalColour;                                       // 0x10(0x10)
	int                                                          LocationIndex;                                     // 0x20(0x4)
};


// Size 0x18
struct FootstepLocation
{
public:
	Struct Vector                                                Location;                                          // 0x0(0xc)
	Struct Rotator                                               Rotation;                                          // 0xc(0xc)
};


// Size 0x8
struct FragileComponentHealthScalarEntry
{
public:
	byte                                                         HealthChangedReason;                               // 0x0(0x1)
	char                                                         pad0x3_ND8KU[0x3];                                 // 0x1(0x3)
	float                                                        HealthChangeScalar;                                // 0x4(0x4)
};


// Size 0x10
struct FragileComponentShipDamageTypeEntry
{
public:
	class                                                        ShipDamagerType;                                   // 0x0(0x8)
	float                                                        HealthChangePropagated;                            // 0x8(0x4)
};


// Size 0x28
struct FuseComponentMetaWrapper
{
public:
	bool                                                         FuseEnabled;                                       // 0x20(0x1)
	char                                                         pad0x3_13YJZ[0x3];                                 // 0x21(0x3)
	float                                                        FuseTimeScale;                                     // 0x24(0x4)
};


// Size 0x18
struct ItemMetaBase
{
public:
	Struct StringAssetReference                                  StoredStructType;                                  // 0x8(0x10)
};


// Size 0xe8
struct ActivePlayerState
{
public:
};


// Size 0x80
struct EventInactivityDetectionActionPerformed
{
public:
	Struct PirateIdentity                                        PirateIdentity;                                    // 0x0(0x78)
	struct FName                                                 ActionName;                                        // 0x78(0x8)
};


// Size 0x78
struct PirateIdentity
{
public:
	Struct UniqueNetIdRepl                                       UserId;                                            // 0x0(0x18)
	Struct FString                                               PirateId;                                          // 0x18(0x10)
};


// Size 0x10
struct AnimationLODParameters
{
public:
	int                                                          MaxIKEntities;                                     // 0x0(0x4)
	float                                                        MaxIKDistance;                                     // 0x4(0x4)
	float                                                        MinLODSolverDistance;                              // 0x8(0x4)
	float                                                        MinFootPlantingActiveDistance;                     // 0xc(0x4)
};


// Size 0x18
struct GenericPartDesc
{
public:
	Struct StringAssetReference                                  Mesh;                                              // 0x0(0x10)
};


// Size 0x78
struct TQStructGenParams
{
public:
	int                                                          GenerationIterations;                              // 0x0(0x4)
	bool                                                         FailIfNoLocationData;                              // 0x4(0x1)
	char                                                         pad0x3_DVMBT[0x3];                                 // 0x5(0x3)
	float                                                        PreferredDistance;                                 // 0x8(0x4)
	float                                                        EventExclusionZoneRadius;                          // 0xc(0x4)
	float                                                        TransientActorExclusionZoneRadius;                 // 0x10(0x4)
	int                                                          ModuleCount;                                       // 0x14(0x4)
	Struct TQStructGenEntry                                      FinalModuleOverride;                               // 0x18(0x30)
	float                                                        CombatWeight;                                      // 0x48(0x4)
	int                                                          MaxCombatOccurrences;                              // 0x4c(0x4)
	TArray<struct CombatGroups>                                  CombatGroups;                                      // 0x50(0x10)
	int                                                          MaxNonCombatOccurrences;                           // 0x60(0x4)
	char                                                         pad0x4_44PPK[0x4];                                 // 0x64(0x4)
	TArray<struct NonCombatGroups>                               NonCombatGroups;                                   // 0x68(0x10)
};


// Size 0x28
struct TQStructGenGroup
{
public:
	struct FName                                                 FeatureName;                                       // 0x10(0x8)
	TArray<struct Entries>                                       Entries;                                           // 0x18(0x10)
};


// Size 0x10
struct TQStructGenWeightedContainer
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	int                                                          MaxOccurrences;                                    // 0xc(0x4)
};


// Size 0x30
struct TQStructGenEntry
{
public:
	Class TaleQuestDescAsset*                                    TaleQuestDesc;                                     // 0x10(0x8)
	Class PLQuestLocationDataBundle*                             LocationBundle;                                    // 0x18(0x8)
	bool                                                         LocationFiltering;                                 // 0x20(0x1)
	char                                                         pad0x3_58RE6[0x3];                                 // 0x21(0x3)
	Struct Vector2D                                              AcceptableAreaLocation;                            // 0x24(0x8)
	float                                                        AcceptableAreaRadius;                              // 0x2c(0x4)
};


// Size 0x10
struct TQStructGenSelection
{
public:
	Class TaleQuestDescAsset*                                    TaleQuestDesc;                                     // 0x0(0x8)
	Class PLQuestLocationDataAsset*                              LocationData;                                      // 0x8(0x8)
};


// Size 0x30
struct QuestVarLocationData
{
public:
};


// Size 0x30
struct QuestVarTaleQuest
{
public:
};


// Size 0x10
struct VoyageHandInEntry
{
public:
	Class VoyageRecipeDataAsset*                                 VoyageRecipe;                                      // 0x0(0x8)
	class                                                        Item;                                              // 0x8(0x8)
};


// Size 0x1
struct GlintVisibilityLock
{
public:
};


// Size 0x18
struct DirectorSettingEntry
{
public:
	Class VoyageDescDataAsset*                                   VoyageDesc;                                        // 0x0(0x8)
	Struct FeatureFlag                                           Feature;                                           // 0x8(0xc)
};


// Size 0x30
struct QuestVariablePageBundle
{
public:
};


// Size 0x10
struct HarpoonItemSlot
{
public:
	Struct Vector                                                Location;                                          // 0x0(0xc)
	int                                                          ItemsInSlot;                                       // 0xc(0x4)
};


// Size 0x18
struct PlayerHideoutInfo
{
public:
	Class PlayerState*                                           PlayerState;                                       // 0x0(0x8)
	TArray<class SpawnLocation*>                                 ExitPoints;                                        // 0x8(0x10)
};


// Size 0x28
struct HoleItemToSpawn
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	char                                                         pad0x4_MS9BZ[0x4];                                 // 0x4(0x4)
	class                                                        ItemDesc;                                          // 0x8(0x8)
	TArray<Byte RestrictToSurface>                               RestrictToSurface;                                 // 0x10(0x10)
	struct FName                                                 FeatureFlag;                                       // 0x20(0x8)
};


// Size 0xc
struct MaxHolePerIslandDataAsset
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	int                                                          MaxHoles;                                          // 0x8(0x4)
};


// Size 0x18
struct HoleContainer
{
public:
	TArray<Weakclass Holes>                                      Holes;                                             // 0x0(0x10)
	struct FName                                                 IslandName;                                        // 0x10(0x8)
};


// Size 0x48
struct BuriedBuriable
{
public:
	Struct Vector                                                Location;                                          // 0x18(0xc)
	float                                                        Radius;                                            // 0x24(0x4)
};


// Size 0x70
struct Leak
{
public:
	Struct WwiseEmitter                                          SFXEmitter;                                        // 0x30(0x20)
	Class ParticleSystemComponent*                               WaterLeakParticleSystem;                           // 0x50(0x8)
};


// Size 0x58
struct ShipLeak
{
public:
	Struct ShipLeakParams                                        Params;                                            // 0x0(0x1c)
	char                                                         pad0x24_2XF4D[0x24];                               // 0x1c(0x24)
	Class ParticleSystemComponent*                               SplashParticleSystem;                              // 0x40(0x8)
};


// Size 0x1c
struct ShipLeakParams
{
public:
	float                                                        InternalWaterSamplePositionTopOffset;              // 0x0(0x4)
	float                                                        InternalWaterSamplePositionBottomOffset;           // 0x4(0x4)
	float                                                        WaterSplashDelayMin;                               // 0x8(0x4)
	float                                                        WaterSplashDelayMax;                               // 0xc(0x4)
	float                                                        HullFloodedPercentageToShiftWaterSamplingPos;      // 0x10(0x4)
	float                                                        WaterSampleOffsetBelowHullFloodThreshold;          // 0x14(0x4)
	float                                                        WaterSampleOffsetAboveHullFloodThreshold;          // 0x18(0x4)
};


// Size 0x70
struct HullDamageNamedParamSet
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	char                                                         pad0x8_RTGOX[0x8];                                 // 0x8(0x8)
	Struct HullDamageParamSet                                    Params;                                            // 0x10(0x60)
};


// Size 0x60
struct HullDamageParamSet
{
public:
	Struct ShipLeakParams                                        LeakParams;                                        // 0x0(0x1c)
	float                                                        LeakAmount;                                        // 0x1c(0x4)
	Struct Transform                                             InternalHoleDecalOffset;                           // 0x20(0x30)
	byte                                                         Deck;                                              // 0x50(0x1)
};


// Size 0x10
struct DebugSuperSailorActionStateParams
{
public:
	float                                                        BaseForwardSpeed;                                  // 0x0(0x4)
	float                                                        YawSpeed;                                          // 0x4(0x4)
	float                                                        RightTriggerHeldSpdAmp;                            // 0x8(0x4)
	float                                                        RightTriggerHeldYawAmp;                            // 0xc(0x4)
};


// Size 0x34
struct DockableCutsceneActionStateParams
{
public:
	Struct LookAtOffsetParams                                    LookAtOffsetParams;                                // 0x18(0x1c)
};


// Size 0x18
struct ControlObjectActionStateParams
{
public:
	bool                                                         UndockToLastKnownLocation;                         // 0x10(0x1)
	char                                                         pad0x3_NH6HU[0x3];                                 // 0x11(0x3)
	float                                                        UndockDuration;                                    // 0x14(0x4)
};


// Size 0x10
struct DockToObjectActionStateParams
{
public:
	float                                                        DockTime;                                          // 0x0(0x4)
	float                                                        DelayAfterDockingTime;                             // 0x4(0x4)
	float                                                        ForcedFieldOfView;                                 // 0x8(0x4)
	bool                                                         ForceStash;                                        // 0xc(0x1)
};


// Size 0x1c
struct LookAtOffsetParams
{
public:
	bool                                                         UseLookAtPosition;                                 // 0x0(0x1)
	bool                                                         UseSpring;                                         // 0x1(0x1)
	char                                                         pad0x2_FQRCK[0x2];                                 // 0x2(0x2)
	float                                                        SpringAccel;                                       // 0x4(0x4)
	float                                                        MinYaw;                                            // 0x8(0x4)
	float                                                        MaxYaw;                                            // 0xc(0x4)
	float                                                        MinPitch;                                          // 0x10(0x4)
	float                                                        MaxPitch;                                          // 0x14(0x4)
	byte                                                         CameraLookatAnimationType;                         // 0x18(0x1)
};


// Size 0x58
struct UseMountedWeaponActionStateParams
{
public:
	float                                                        CameraDockTime;                                    // 0x18(0x4)
	char                                                         pad0x4_PK8YG[0x4];                                 // 0x1c(0x4)
	Class ForceFeedbackEffect*                                   FireForceFeedbackEffect;                           // 0x20(0x8)
	class                                                        FireCameraShake;                                   // 0x28(0x8)
	class                                                        FireInputId;                                       // 0x30(0x8)
	TArray<class Class*>                                         AimYawInputId;                                     // 0x38(0x10)
	TArray<class Class*>                                         AimPitchInputId;                                   // 0x48(0x10)
};


// Size 0x60
struct UseCannonActionStateParams
{
public:
	Struct UseMountedWeaponActionStateParams                     MountedWeaponParams;                               // 0x0(0x58)
	float                                                        ReloadAttemptRepeatRate;                           // 0x58(0x4)
};


// Size 0x40
struct CapturedByKrakenActionStateParams
{
public:
	Class CurveFloat*                                            MovementAlphaXY;                                   // 0x0(0x8)
	Class CurveFloat*                                            MovementAlphaZ;                                    // 0x8(0x8)
	Class CurveFloat*                                            MovementRotation;                                  // 0x10(0x8)
	float                                                        MovementTime;                                      // 0x18(0x4)
	float                                                        DistanceFromTentacleToStartFade;                   // 0x1c(0x4)
	float                                                        FadeInDuration;                                    // 0x20(0x4)
	float                                                        ClientConditionsCompleteTimeout;                   // 0x24(0x4)
	float                                                        MinCameraPitch;                                    // 0x28(0x4)
	float                                                        MaxCameraPitch;                                    // 0x2c(0x4)
	float                                                        MinCameraYaw;                                      // 0x30(0x4)
	float                                                        MaxCameraYaw;                                      // 0x34(0x4)
	float                                                        AnimationProgressionToStopCameraFade;              // 0x38(0x4)
