#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xc
struct TinyCreatureDestroyedTelemetryEvent
{
public:
	struct Vector                                                SpawnedLocation;                                   // 0x0(0xc)
};


// Size 0x38
struct EventTinySharkRepositioning
{
public:
	struct Guid                                                  TinySharkExperienceId;                             // 0x0(0x10)
	struct FString                                               TinySharkPartIndex;                                // 0x10(0x10)
	struct Vector                                                DespawnLocation;                                   // 0x20(0xc)
	bool                                                         IsTaleTinyShark;                                   // 0x2c(0x1)
	char                                                         pad0x3_O7NGX[0x3];                                 // 0x2d(0x3)
	int                                                          NumTimesRepositioned;                              // 0x30(0x4)
	char                                                         pad0x4_CGLY9[0x4];                                 // 0x34(0x4)
};


// Size 0x30
struct AINameplateVisibilitySettings
{
public:
	float                                                        VisibleFromWorldDistance;                          // 0x0(0x4)
	float                                                        VisibleUntilWorldDistance;                         // 0x4(0x4)
	float                                                        VisibleAfterDeathDuration;                         // 0x8(0x4)
	bool                                                         OverrideFriendlyVisibility;                        // 0xc(0x1)
	char                                                         pad0x3_3CKIF[0x3];                                 // 0xd(0x3)
	float                                                        FriendlyVisibleFromWorldDistance;                  // 0x10(0x4)
	float                                                        FriendlyVisibleUntilWorldDistance;                 // 0x14(0x4)
	bool                                                         ShouldFriendlyNameplatesOcclude;                   // 0x18(0x1)
	bool                                                         ActivityIconsEnabled;                              // 0x19(0x1)
	char                                                         pad0x6_CO16X[0x6];                                 // 0x1a(0x6)
	struct StringAssetReference                                  DefaultNameplateIcon;                              // 0x20(0x10)
};


// Size 0x10
struct TinySharkTrackedShipDistanceThresholdByFeature
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x0(0xc)
	float                                                        TrackedShipDistanceThreshold;                      // 0xc(0x4)
};


// Size 0x30
struct AIPerPlayerSpawnerPlayerDetailsUnit
{
public:
	char                                                         pad0x30_J0LIA[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct EventPlayerSetFootUponAISpawnRegion
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	char                                                         pad0x18_P6CLQ[0x18];                               // 0x8(0x18)
};


// Size 0x20
struct TargetSkillsetProgressionPair
{
public:
	struct StringAssetReference                                  CrewSkillset;                                      // 0x0(0x10)
	struct StringAssetReference                                  CaptainSkillset;                                   // 0x10(0x10)
};


// Size 0x1
struct EventAllAIProgressiveWavesCompleted
{
public:
	char                                                         pad0x1_ONVR4[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct AIDebugSpawnAmount
{
public:
	class AIEncounterSettings*                                   EncounterSettings;                                 // 0x0(0x8)
	int                                                          NumToSpawn;                                        // 0x8(0x4)
	char                                                         pad0x4_L7RWZ[0x4];                                 // 0xc(0x4)
};


// Size 0x30
struct AIDropSpawnerRankMapping
{
public:
	char                                                         pad0x20_42MVX[0x20];                               // 0x0(0x20)
	TArray<float>                                                Weights;                                           // 0x20(0x10)
};


// Size 0x14
struct AthenaAIControllerDamageTargetScoreFromPerceivedTarget
{
public:
	float                                                        MinDamageTargetScore;                              // 0x0(0x4)
	float                                                        MaxDamageTargetScore;                              // 0x4(0x4)
	float                                                        DamageForMinDamageTargetScore;                     // 0x8(0x4)
	float                                                        DamageForMaxDamageTargetScore;                     // 0xc(0x4)
	float                                                        RateToDecayDamagedFromTarget;                      // 0x10(0x4)
};


// Size 0x18
struct AISkillsetRankMapping
{
public:
	class AthenaAIControllerParamsDataAsset*                     Skillset;                                          // 0x0(0x8)
	TArray<float>                                                Weights;                                           // 0x8(0x10)
};


// Size 0x40
struct EventTaleQuestTinySharkSpawned
{
public:
	char                                                         pad0x30_P2RFT[0x30];                               // 0x0(0x30)
	struct Guid                                                  VoyageID;                                          // 0x30(0x10)
};


// Size 0xa0
struct DioramaCategoryEntries
{
public:
	char                                                         pad0xa0_PAE8T[0xa0];                               // 0x0(0xa0)
};


// Size 0x8
struct PetPartSizeMapping
{
public:
	char                                                         PetSize;                                           // 0x0(0x1)
	char                                                         pad0x3_5LKHD[0x3];                                 // 0x1(0x3)
	float                                                        PetScale;                                          // 0x4(0x4)
};


// Size 0x10
struct AIProgressiveWavesSpawnerArchive
{
public:
	char                                                         pad0x8_AV701[0x8];                                 // 0x0(0x8)
	int                                                          CurrentWaveIndex;                                  // 0x8(0x4)
	char                                                         pad0x4_B8SXS[0x4];                                 // 0xc(0x4)
};


// Size 0x8
struct EventAIPawnCarrierChange
{
public:
	class Actor*                                                 Carrier;                                           // 0x0(0x8)
};


// Size 0x30
struct QuestVariableSharkPawn
{
public:
	char                                                         pad0x30_8RULY[0x30];                               // 0x0(0x30)
};


// Size 0x28
struct EventAIBountySpawnerWaveCompleted
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	TArray<struct Guid>                                          ParticipatingCrewIds;                              // 0x8(0x10)
	int                                                          WaveIndex;                                         // 0x18(0x4)
	int                                                          TotalWaves;                                        // 0x1c(0x4)
	class Actor*                                                 InstigatorOfFinalAIPawnDeath;                      // 0x20(0x8)
};


// Size 0x2c
struct AIExclusionZone
{
public:
	struct Guid                                                  Id;                                                // 0x0(0x10)
	struct Vector                                                Location;                                          // 0x10(0xc)
	float                                                        RadiusSquared;                                     // 0x1c(0x4)
	float                                                        Radius;                                            // 0x20(0x4)
	float                                                        Height;                                            // 0x24(0x4)
	struct TimerHandle                                           RemoveTimer;                                       // 0x28(0x4)
};


// Size 0x10
struct WeightedAmmoType
{
public:
	float                                                        ProbabilityAtRange;                                // 0x0(0x4)
	char                                                         pad0x4_RNLMP[0x4];                                 // 0x4(0x4)
	class UClass*                                                AmmoType;                                          // 0x8(0x8)
};


// Size 0x18
struct AISpawnWaveSequenceRankMapping
{
public:
	class AISpawnWaveSequence*                                   SpawnWaveSequence;                                 // 0x0(0x8)
	TArray<float>                                                Weights;                                           // 0x8(0x10)
};


// Size 0x18
struct AthenaAIFormComponentVfxCustomisation
{
public:
	class UClass*                                                VfxCustomisationType;                              // 0x0(0x8)
	bool                                                         VfxEnabled;                                        // 0x8(0x1)
	char                                                         pad0x7_B4WPU[0x7];                                 // 0x9(0x7)
	class Object*                                                VfxTemplate;                                       // 0x10(0x8)
};


// Size 0xc
struct ChanceForSharksToBlockSirenEncounterData
{
public:
	int                                                          NumberOfSharks;                                    // 0x0(0x4)
	float                                                        ChanceToSpawn;                                     // 0x4(0x4)
	float                                                        RadiusToCheck;                                     // 0x8(0x4)
};


// Size 0x1
struct TinySharkWorldSettingsParams
{
public:
	bool                                                         TinySharkEnabled;                                  // 0x0(0x1)
};


// Size 0x10
struct PetTurnRateModifier
{
public:
	class UClass*                                                Strategy;                                          // 0x0(0x8)
	float                                                        TurnRateModifier;                                  // 0x8(0x4)
	char                                                         pad0x4_XKX85[0x4];                                 // 0xc(0x4)
};


// Size 0xd0
struct AIEncounterSpecification
{
public:
	char                                                         pad0x20_8G2QF[0x20];                               // 0x0(0x20)
	class AthenaAIControllerParamsDataAsset*                     Skillset;                                          // 0x20(0x8)
	class LoadoutAsset*                                          Loadout;                                           // 0x28(0x8)
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x30(0x8)
	class AthenaAIAmmoDataAsset*                                 Ammo;                                              // 0x38(0x8)
	class UClass*                                                AIClass;                                           // 0x40(0x8)
	class AIPartsCategory*                                       PartsCategory;                                     // 0x48(0x8)
	int                                                          TeamColorIndex;                                    // 0x70(0x4)
	struct FName                                                 DioramaRole;                                       // 0x74(0x8)
	char                                                         pad0x4_PGQRC[0x4];                                 // 0x7c(0x4)
	struct FText                                                 LocalisableName;                                   // 0x80(0x38)
	struct EncounterParams                                       EncounterTrackingParams;                           // 0xb8(0xc)
	int                                                          MinPlayersToEnable;                                // 0xc4(0x4)
	bool                                                         ShowNameplate;                                     // 0xc8(0x1)
	bool                                                         IsUsingDialogue;                                   // 0xc9(0x1)
	char                                                         pad0x6_C01L6[0x6];                                 // 0xca(0x6)
};


// Size 0x18
struct AIAmmoRankMapping
{
public:
	class AthenaAIAmmoDataAsset*                                 Ammo;                                              // 0x0(0x8)
	TArray<float>                                                Weights;                                           // 0x8(0x10)
};


// Size 0x10
struct ExperienceTracker
{
public:
	class TaleQuestTinySharkExperienceTracker*                   Tracker;                                           // 0x0(0x8)
	char                                                         pad0x8_5PRH2[0x8];                                 // 0x8(0x8)
};


// Size 0x18
struct TinySharkKilledNetworkEvent
{
public:
	char                                                         pad0x18_QKBJB[0x18];                               // 0x0(0x18)
};


// Size 0x48
struct AITeleportActionStateConstructionInfo
{
public:
	char                                                         pad0x48_22KGE[0x48];                               // 0x0(0x48)
};


// Size 0x20
struct AICustomClassIdNameOverrides
{
public:
	TArray<class Class*>                                         ClassIds;                                          // 0x0(0x10)
	TArray<struct Text>                                          Names;                                             // 0x10(0x10)
};


// Size 0x30
struct AIIndividualVarietyEntry
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	char                                                         pad0x4_2FGZO[0x4];                                 // 0xc(0x4)
	TArray<struct StringAssetReference>                          Loadouts;                                          // 0x10(0x10)
	int                                                          RankOffset;                                        // 0x20(0x4)
	float                                                        Weight;                                            // 0x24(0x4)
	int                                                          MaxPerEncounter;                                   // 0x28(0x4)
	char                                                         pad0x4_S4EB6[0x4];                                 // 0x2c(0x4)
};


// Size 0x30
struct EventAILoadoutSelected
{
public:
	struct ItemLoadout                                           Loadout;                                           // 0x0(0x20)
	class UClass*                                                NonStorableItem;                                   // 0x20(0x8)
	char                                                         pad0x8_VO2IK[0x8];                                 // 0x28(0x8)
};


// Size 0x58
struct EventTaleQuestTinySharkDespawned
{
public:
	char                                                         pad0x48_9E133[0x48];                               // 0x0(0x48)
	struct Guid                                                  VoyageID;                                          // 0x48(0x10)
};


// Size 0x28
struct TinyCreatureFleeRpc
{
public:
	char                                                         pad0x18_MCWHX[0x18];                               // 0x0(0x18)
	class Actor*                                                 TinyCreatureManager;                               // 0x18(0x8)
	int                                                          TinyCreatureIndex;                                 // 0x20(0x4)
	char                                                         pad0x4_8VDD4[0x4];                                 // 0x24(0x4)
};


// Size 0x10
struct PerDepthSpawnChance
{
public:
	float                                                        DepthUpperBound;                                   // 0x0(0x4)
	float                                                        DepthLowerBound;                                   // 0x4(0x4)
	float                                                        ChanceToSpawn;                                     // 0x8(0x4)
	float                                                        ChanceToSpawnWithLureActive;                       // 0xc(0x4)
};


// Size 0x50
struct AIEmoteActionStateConstructionInfo
{
public:
	char                                                         pad0x48_94TL8[0x48];                               // 0x0(0x48)
	bool                                                         ShouldStopMovementImmediatelyOnStart;              // 0x48(0x1)
	char                                                         pad0x7_5D7V9[0x7];                                 // 0x49(0x7)
};


// Size 0x18
struct DamageModifierCrewProximityVulnerabilityPairs
{
public:
	int                                                          NumPlayersInRange;                                 // 0x0(0x4)
	float                                                        GlobalDamageMultiplier;                            // 0x4(0x4)
	TArray<struct DamageableVulnerabilityPair>                   DamageMultipliers;                                 // 0x8(0x10)
};


// Size 0x10
struct AISpawnOverride
{
public:
	struct StringAssetReference                                  FormOverride;                                      // 0x0(0x10)
};


// Size 0x1
struct AthenaAIDebugCostDisplay
{
public:
	char                                                         pad0x1_T6HDN[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct AthenaAIItemParamValue
{
public:
	char                                                         pad0x20_8BMCK[0x20];                               // 0x0(0x20)
	struct FName                                                 ParamName;                                         // 0x20(0x8)
	float                                                        Value;                                             // 0x28(0x4)
	char                                                         pad0x4_ZGSWX[0x4];                                 // 0x2c(0x4)
};


// Size 0x88
struct AITelemetryFragment
{
public:
	struct FString                                               AIType;                                            // 0x0(0x10)
	struct FString                                               AIID;                                              // 0x10(0x10)
	TArray<String>                                               AILoadOut;                                         // 0x20(0x10)
	struct FString                                               AIPawnType;                                        // 0x30(0x10)
	struct FString                                               AISkillset;                                        // 0x40(0x10)
	struct FString                                               AiForm;                                            // 0x50(0x10)
	struct FString                                               AIClass;                                           // 0x60(0x10)
	bool                                                         IsEmergent;                                        // 0x70(0x1)
	char                                                         pad0x3_OGYQ8[0x3];                                 // 0x71(0x3)
	struct Guid                                                  AICrewId;                                          // 0x74(0x10)
	char                                                         pad0x4_WZ3LT[0x4];                                 // 0x84(0x4)
};


// Size 0x38
struct AthenaAIAbilityPlayerBasedRange
{
public:
	int                                                          MaxPlayers;                                        // 0x0(0x4)
	char                                                         pad0x4_G3LCA[0x4];                                 // 0x4(0x4)
	struct WeightedProbabilityRangeOfRanges                      WeightedArray;                                     // 0x8(0x30)
};


// Size 0x10
struct EventAIStartedDeadActionState
{
public:
	char                                                         DeathReason;                                       // 0x0(0x1)
	char                                                         pad0x7_7QJ62[0x7];                                 // 0x1(0x7)
	class Actor*                                                 Killer;                                            // 0x8(0x8)
};


// Size 0x20
struct EventAIFormEncounteredByLocalPlayer
{
public:
	char                                                         pad0x18_OKA9H[0x18];                               // 0x0(0x18)
	class UClass*                                                FormType;                                          // 0x18(0x8)
};


// Size 0x58
struct ChanceAndBlackboardKeyPair
{
public:
	struct AIDataProviderFloatValue                              Chance;                                            // 0x0(0x30)
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x30(0x28)
};


// Size 0x1
struct EventOceanCrawlerAIBuffAudioRequest
{
public:
	bool                                                         IsBuffGiver;                                       // 0x0(0x1)
};


// Size 0x1
struct EventFaunaThreatLevelChanged
{
public:
	char                                                         ThreatLevel;                                       // 0x0(0x1)
};


// Size 0x2c
struct AIHealthChangeTelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	float                                                        CurrentHealth;                                     // 0x10(0x4)
	float                                                        PreviousHealth;                                    // 0x14(0x4)
	float                                                        HealthDelta;                                       // 0x18(0x4)
	struct Vector                                                Position;                                          // 0x1c(0xc)
	char                                                         Reason;                                            // 0x28(0x1)
	char                                                         pad0x3_GTF7F[0x3];                                 // 0x29(0x3)
};


// Size 0x38
struct TemporaryPlayerDetailsUnitEntry
{
public:
	char                                                         pad0x38_Q58D2[0x38];                               // 0x0(0x38)
};


// Size 0x48
struct MerchantCrateMetaWrapper
{
public:
	char                                                         pad0x18_BJGAH[0x18];                               // 0x0(0x18)
	float                                                        Health;                                            // 0x18(0x4)
	char                                                         pad0x4_J0W85[0x4];                                 // 0x1c(0x4)
	struct StringAssetReference                                  FaunaType;                                         // 0x20(0x10)
	float                                                        TimeSpentStarving;                                 // 0x30(0x4)
	float                                                        TimeToStarveInSeconds;                             // 0x34(0x4)
	struct Vector                                                TempSpawnLocationForActor;                         // 0x38(0xc)
	char                                                         pad0x4_S829V[0x4];                                 // 0x44(0x4)
};


// Size 0x60
struct EventTinySharkDamaged
{
public:
	struct ImpactDamageEvent                                     ImpactDamageEvent;                                 // 0x0(0x58)
	char                                                         TinySharkVariant;                                  // 0x58(0x1)
	char                                                         pad0x3_HM0WT[0x3];                                 // 0x59(0x3)
	float                                                        VulnerabilityModifier;                             // 0x5c(0x4)
};


// Size 0x2
struct AttitudeOverrideEntry
{
public:
	char                                                         TeamToOverride;                                    // 0x0(0x1)
	char                                                         AttitudeOverride;                                  // 0x1(0x1)
};


// Size 0x58
struct TaleQuestTinySharkDespawnTelemetryEvent
{
public:
	char                                                         pad0x48_5EODX[0x48];                               // 0x0(0x48)
	struct Guid                                                  VoyageID;                                          // 0x48(0x10)
};


// Size 0x2c
struct AIDebugVisualisationCone
{
public:
	struct Vector                                                Origin;                                            // 0x0(0xc)
	struct Vector                                                Direction;                                         // 0xc(0xc)
	float                                                        Length;                                            // 0x18(0x4)
	float                                                        AngleWidthRadians;                                 // 0x1c(0x4)
	float                                                        AngleHeightRadians;                                // 0x20(0x4)
	float                                                        LifeTime;                                          // 0x24(0x4)
	char                                                         Colour;                                            // 0x28(0x1)
	char                                                         pad0x3_ZT4HB[0x3];                                 // 0x29(0x3)
};


// Size 0x18
struct AIDebugVisualisationSphere
{
public:
	struct Vector                                                Centre;                                            // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
	float                                                        LifeTime;                                          // 0x10(0x4)
	char                                                         Colour;                                            // 0x14(0x1)
	char                                                         pad0x3_IQ65E[0x3];                                 // 0x15(0x3)
};


// Size 0xc
struct AthenaAIControllerParamValue
{
public:
	struct FName                                                 ParamName;                                         // 0x0(0x8)
	float                                                        Value;                                             // 0x8(0x4)
};


// Size 0x18
struct AIPerCrewSpawnerRespawnUnit
{
public:
	char                                                         pad0x18_KBAVN[0x18];                               // 0x0(0x18)
};


// Size 0x1
struct EventSporeBreathAIAbilityFinished
{
public:
	char                                                         pad0x1_EKGLV[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct AIActorTimeout
{
public:
	class Actor*                                                 AIActor;                                           // 0x0(0x8)
	float                                                        Timer;                                             // 0x8(0x4)
	char                                                         pad0x4_0Z2B7[0x4];                                 // 0xc(0x4)
};


// Size 0x20
struct FeatureToggledAIEncounterSpecificSkillSet
{
public:
	struct StringAssetReference                                  ToggledSpecificSkillset;                           // 0x0(0x10)
	struct FeatureFlag                                           Feature;                                           // 0x10(0xc)
	char                                                         pad0x4_DSMX2[0x4];                                 // 0x1c(0x4)
};


// Size 0x10
struct AIFormDamageResponse
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	float                                                        DamageMultiplier;                                  // 0x8(0x4)
	char                                                         HitReaction;                                       // 0xc(0x1)
	bool                                                         IsKnockbackDisabled;                               // 0xd(0x1)
	bool                                                         IsStunDisabled;                                    // 0xe(0x1)
	char                                                         pad0x1_GWUZ0[0x1];                                 // 0xf(0x1)
};


// Size 0x30
struct EventOnFaunaSpawnaExploded
{
public:
	class Actor*                                                 RootInstigator;                                    // 0x0(0x8)
	class Actor*                                                 HitActor;                                          // 0x8(0x8)
	char                                                         pad0x10_KYZ3G[0x10];                               // 0x10(0x10)
	class Object*                                                FaunaSpawnaSpawnId;                                // 0x20(0x8)
	bool                                                         HitWater;                                          // 0x28(0x1)
	char                                                         pad0x7_VFBBI[0x7];                                 // 0x29(0x7)
};


// Size 0x38
struct AthenaAIControllerTargetPickingData
{
public:
	struct FString                                               TargetName;                                        // 0x0(0x10)
	bool                                                         BestTargetByScore;                                 // 0x10(0x1)
	bool                                                         IsCurrentTargetActor;                              // 0x11(0x1)
	char                                                         pad0x2_A61FL[0x2];                                 // 0x12(0x2)
	float                                                        TargetScore;                                       // 0x14(0x4)
	float                                                        DistScore;                                         // 0x18(0x4)
	float                                                        FacingScore;                                       // 0x1c(0x4)
	float                                                        TargetWeightScore;                                 // 0x20(0x4)
	float                                                        DamageScore;                                       // 0x24(0x4)
	float                                                        TargetDistance;                                    // 0x28(0x4)
	float                                                        TargetAngle;                                       // 0x2c(0x4)
	int                                                          NumTargeting;                                      // 0x30(0x4)
	float                                                        RecentDamage;                                      // 0x34(0x4)
};


// Size 0x8
struct AISpawnerArchive
{
public:
	char                                                         pad0x8_TSS33[0x8];                                 // 0x0(0x8)
};


// Size 0x48
struct EventTinySharkDespawned
{
public:
	struct Guid                                                  TinySharkExperienceId;                             // 0x0(0x10)
	struct FString                                               TinySharkPartTag;                                  // 0x10(0x10)
	char                                                         DespawnReason;                                     // 0x20(0x1)
	char                                                         pad0x7_GIAY4[0x7];                                 // 0x21(0x7)
	double                                                       TimeToCompleteAfterEngagedInSeconds;               // 0x28(0x8)
	float                                                        TotalTrackingIdleTime;                             // 0x30(0x4)
	float                                                        TotalIdleTimeAfterEngaged;                         // 0x34(0x4)
	TArray<struct Guid>                                          ParticipatingCrewIds;                              // 0x38(0x10)
};


// Size 0x10
struct PetWieldableReactMapping
{
public:
	class UClass*                                                WieldableType;                                     // 0x0(0x8)
	struct FName                                                 ReactId;                                           // 0x8(0x8)
};


// Size 0x1
struct EventAIVulnerabilityAbilityStarted
{
public:
	char                                                         pad0x1_AJ0W9[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct AIStategyControllerMovementMod
{
public:
	class UClass*                                                AIStrategy;                                        // 0x0(0x8)
	float                                                        OverrideControlRotationInterpSpeed;                // 0x8(0x4)
	char                                                         pad0x4_2C4SB[0x4];                                 // 0xc(0x4)
};


// Size 0x68
struct TinySharkShipSpawnData
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	struct WeightedProbabilityRangeOfRanges                      Timer;                                             // 0x8(0x30)
	TArray<Class>                                                ControllerParams;                                  // 0x38(0x10)
	struct WeightedProbabilityRange                              ControllerParamsToUse;                             // 0x48(0x20)
};


// Size 0x4
struct AIBountySpawnerArchiveWaveEntry
{
public:
	int                                                          NumPawnsToSpawn;                                   // 0x0(0x4)
};


// Size 0x18
struct EventPlayerLeftAISpawnRegion
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	char                                                         pad0x10_QKIIH[0x10];                               // 0x8(0x10)
};


// Size 0x80
struct TinyCreatureInfo
{
public:
	class UClass*                                                TinyCreatureClass;                                 // 0x0(0x8)
	char                                                         pad0x8_EDCWT[0x8];                                 // 0x8(0x8)
	struct Transform                                             OriginalTransform;                                 // 0x10(0x30)
	char                                                         pad0x40_P3V00[0x40];                               // 0x40(0x40)
};


// Size 0x1
struct EventOwnedPawnFinishedDying
{
public:
	char                                                         DeathType;                                         // 0x0(0x1)
};


// Size 0x50
struct TinySharkEQSRequest
{
public:
	char                                                         pad0x50_35FXD[0x50];                               // 0x0(0x50)
};


// Size 0x20
struct TargetItemDropProgressionPair
{
public:
	struct StringAssetReference                                  CrewItemSpawn;                                     // 0x0(0x10)
	struct StringAssetReference                                  CaptainItemSpawn;                                  // 0x10(0x10)
};


// Size 0x10
struct FaunaBreedRequirement
{
public:
	class UClass*                                                Breed;                                             // 0x0(0x8)
	int                                                          Count;                                             // 0x8(0x4)
	char                                                         pad0x4_MU94X[0x4];                                 // 0xc(0x4)
};


// Size 0x8
struct EventAIFormSelected
{
public:
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x0(0x8)
};


// Size 0x2
struct EventAthenaAISpawnActive
{
public:
	char                                                         SpawnType;                                         // 0x0(0x1)
	bool                                                         SpawnActive;                                       // 0x1(0x1)
};


// Size 0x20
struct BountySpawnerTargetDesc
{
public:
	char                                                         Gender;                                            // 0x0(0x1)
	char                                                         Rank;                                              // 0x1(0x1)
	char                                                         pad0x6_CH4XY[0x6];                                 // 0x2(0x6)
	class UClass*                                                AIClassIdOverride;                                 // 0x8(0x8)
	char                                                         pad0x10_BCI1Z[0x10];                               // 0x10(0x10)
};


// Size 0x50
struct LimitedInteractbaleAICreatureSplineInteractionParams
{
public:
	class UClass*                                                PressedNotificationInputId;                        // 0x0(0x8)
	class UClass*                                                ReleasedNotificationInputId;                       // 0x8(0x8)
	struct FText                                                 DescriptorVerb;                                    // 0x10(0x38)
	float                                                        HoldTime;                                          // 0x48(0x4)
	char                                                         pad0x4_RXCDM[0x4];                                 // 0x4c(0x4)
};


// Size 0x68
struct TinySharkCollidedTelemetryEvent
{
public:
	struct FString                                               TinySharkId;                                       // 0x0(0x10)
	struct FString                                               TinySharkName;                                     // 0x10(0x10)
	struct FString                                               ObstacleName;                                      // 0x20(0x10)
	struct Vector                                                CollisionLocation;                                 // 0x30(0xc)
	struct Vector                                                HomeLocation;                                      // 0x3c(0xc)
	struct FString                                               BehaviourTreeInfo;                                 // 0x48(0x10)
	struct FString                                               BlackboardInfo;                                    // 0x58(0x10)
};


// Size 0x20
struct SpawnLocationGroup
{
public:
	TArray<struct Name>                                          AllowedSpawnTypes;                                 // 0x0(0x10)
	TArray<struct Vector>                                        SpawnLocations;                                    // 0x10(0x10)
};


// Size 0x1
struct EventAthenaAISpawnBeginAnim
{
public:
	char                                                         SpawnType;                                         // 0x0(0x1)
};


// Size 0x28
struct AIEncounterAndWaveSettingsOverride
{
public:
	class AIEncounterSettings*                                   EncounterSettings;                                 // 0x0(0x8)
	class AISpawnWaveSequenceRankProgression*                    SpawnWaveProgression;                              // 0x8(0x8)
	float                                                        Chance;                                            // 0x10(0x4)
	char                                                         pad0x4_P8K45[0x4];                                 // 0x14(0x4)
	TArray<class AISpawnerPrerequisiteBase*>                     Prerequisites;                                     // 0x18(0x10)
};


// Size 0x18
struct TinySharkDespawnedNetworkEvent
{
public:
	char                                                         pad0x18_GT3W4[0x18];                               // 0x0(0x18)
};


// Size 0x30
struct BountySpawnerNewWaveGroupSpawnedEvent
{
public:
	bool                                                         IsFinalWave;                                       // 0x0(0x1)
	char                                                         pad0x3_LJZ9V[0x3];                                 // 0x1(0x3)
	struct FName                                                 IslandName;                                        // 0x4(0x8)
	char                                                         pad0x4_WABWP[0x4];                                 // 0xc(0x4)
	TArray<struct Guid>                                          ParticipatingCrewIds;                              // 0x10(0x10)
	int                                                          WaveIndex;                                         // 0x20(0x4)
	int                                                          TotalWaves;                                        // 0x24(0x4)
	class Actor*                                                 Instigator;                                        // 0x28(0x8)
};


// Size 0x10
struct AthenaAIAbilityDamageStage
{
public:
	TArray<class AthenaAIAbilityStageParams*>                    AbilitiesInStage;                                  // 0x0(0x10)
};


// Size 0x68
struct EventAIBountySpawnerTargetKilled
{
public:
	struct FText                                                 TargetName;                                        // 0x0(0x38)
	class Actor*                                                 TargetActor;                                       // 0x38(0x8)
	struct FName                                                 RewardId;                                          // 0x40(0x8)
	class ItemInfo*                                              ItemDropped;                                       // 0x48(0x8)
	char                                                         Rank;                                              // 0x50(0x1)
	char                                                         pad0x3_IJDMK[0x3];                                 // 0x51(0x3)
	struct Vector                                                DeathLocation;                                     // 0x54(0xc)
	class Actor*                                                 Instigator;                                        // 0x60(0x8)
};


// Size 0x10
struct FaunaSpawnaReplicatedFishState
{
public:
	class FishingFish*                                           FishingFish;                                       // 0x0(0x8)
	char                                                         FishingFishState;                                  // 0x8(0x1)
	bool                                                         FishHasEscaped;                                    // 0x9(0x1)
	char                                                         pad0x6_ZHVQX[0x6];                                 // 0xa(0x6)
};


// Size 0x68
struct EventAttachableArmourDestroyed
{
public:
	struct ImpactDamageEvent                                     ImpactDamageEvent;                                 // 0x0(0x58)
	class Actor*                                                 ArmourOwningActor;                                 // 0x58(0x8)
	float                                                        VulnerabilityModifier;                             // 0x60(0x4)
	char                                                         pad0x4_48GA2[0x4];                                 // 0x64(0x4)
};


// Size 0x10
struct AISpawnTelemetryEvent
{
public:
	struct FString                                               LocationName;                                      // 0x0(0x10)
};


// Size 0x8
struct EventFaunaChargeAttack
{
public:
	char                                                         pad0x8_GKMKQ[0x8];                                 // 0x0(0x8)
};


// Size 0x1
struct EventFaunaAnimationStartMeleeAttack
{
public:
	bool                                                         MeleeAttacked;                                     // 0x0(0x1)
};


// Size 0x10
struct AISpawnContextData
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	class UClass*                                                Id;                                                // 0x8(0x8)
};


// Size 0x28
struct AIDioramaRoleDesc
{
public:
	struct FName                                                 RoleName;                                          // 0x0(0x8)
	struct StringAssetReference                                  CustomAnimationAsset;                              // 0x8(0x10)
	struct FName                                                 CustomAnimationToRunOnSpawn;                       // 0x18(0x8)
	class UClass*                                                StartingItemCategory;                              // 0x20(0x8)
};


// Size 0x20
struct PlayerInWaterData
{
public:
	char                                                         pad0x20_SCHSC[0x20];                               // 0x0(0x20)
};


// Size 0xe8
struct AISpawnTypeParams
{
public:
	char                                                         pad0x20_D1Q1R[0x20];                               // 0x0(0x20)
	struct StringAssetReference                                  SkillsetOverride;                                  // 0x20(0x10)
	struct StringAssetReference                                  LoadoutOverride;                                   // 0x30(0x10)
	struct StringAssetReference                                  FormOverride;                                      // 0x40(0x10)
	struct StringAssetReference                                  AmmoOverride;                                      // 0x50(0x10)
	class UClass*                                                AIClassIdOverride;                                 // 0x80(0x8)
	struct StringAssetReference                                  TeamColorOverride;                                 // 0x88(0x10)
	struct EncounterParams                                       EncounterTrackingParams;                           // 0x98(0xc)
	struct FName                                                 DioramaRole;                                       // 0xa4(0x8)
	char                                                         pad0x4_K77B0[0x4];                                 // 0xac(0x4)
	struct FText                                                 LocalisableName;                                   // 0xb0(0x38)
};


// Size 0x4
struct StartFleeEvent
{
public:
	int                                                          TinyCreatureIndex;                                 // 0x0(0x4)
};


// Size 0x8
struct EventAIAmmoSelected
{
public:
	class AthenaAIAmmoDataAsset*                                 Ammo;                                              // 0x0(0x8)
};


// Size 0x1
struct EventAIVulnerabilityAbilityEnded
{
public:
	char                                                         pad0x1_7GSJD[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct AICountTelemetryEvent
{
public:
	int                                                          NumTotalSpawns;                                    // 0x0(0x4)
	int                                                          CurrentTotalWorldAICostUnits;                      // 0x4(0x4)
	int                                                          NumActiveRegions;                                  // 0x8(0x4)
	int                                                          NumPlayers;                                        // 0xc(0x4)
};


// Size 0x8
struct LureDartProxyRemovedFromWaterEvent
{
public:
	class Actor*                                                 Proxy;                                             // 0x0(0x8)
};


// Size 0x8
struct EventNewAIStrategy
{
public:
	class UClass*                                                NewAIStrategy;                                     // 0x0(0x8)
};


// Size 0x110
struct AIFaunaSpawnerWave
{
public:
	char                                                         pad0x110_RBIJ8[0x110];                             // 0x0(0x110)
};


// Size 0x18
struct EventPawnStartedDying
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
	char                                                         DeathType;                                         // 0x8(0x1)
	char                                                         pad0x7_OWZDC[0x7];                                 // 0x9(0x7)
	class Actor*                                                 Instigator;                                        // 0x10(0x8)
};


// Size 0x38
struct BlackboardValueCondition
{
public:
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x0(0x28)
	char                                                         Comparison;                                        // 0x28(0x1)
	char                                                         pad0x3_SII1Z[0x3];                                 // 0x29(0x3)
	float                                                        Value;                                             // 0x2c(0x4)
	bool                                                         OnEntry;                                           // 0x30(0x1)
	bool                                                         OnExit;                                            // 0x31(0x1)
	char                                                         pad0x6_LE1KN[0x6];                                 // 0x32(0x6)
};


// Size 0x58
struct AITypeData
{
public:
	struct FName                                                 AITypeName;                                        // 0x0(0x8)
	struct StringClassReference                                  AIPawnClass;                                       // 0x8(0x10)
	struct StringAssetReference                                  DefaultDebugSkillset;                              // 0x18(0x10)
	struct StringAssetReference                                  DefaultDebugLoadout;                               // 0x28(0x10)
	class UClass*                                                DefaultDebugAIClassId;                             // 0x38(0x8)
	bool                                                         RequireNavMesh;                                    // 0x40(0x1)
	char                                                         pad0x3_N7EKG[0x3];                                 // 0x41(0x3)
	int                                                          AIRegionCostUnits;                                 // 0x44(0x4)
	int                                                          AIWorldCostUnits;                                  // 0x48(0x4)
	struct FName                                                 FeatureToggle;                                     // 0x4c(0x8)
	char                                                         pad0x4_KZ0ZB[0x4];                                 // 0x54(0x4)
};


// Size 0x18
struct EventOnFaunaSpawnaExplodedWithFishSpawn
{
public:
	class UClass*                                                FishingFishSpawnerClass;                           // 0x0(0x8)
	struct Vector                                                ExplosionOrigin;                                   // 0x8(0xc)
	char                                                         pad0x4_TDDW0[0x4];                                 // 0x14(0x4)
};


// Size 0x8
struct EventNewAIStrategyBPReadable
{
public:
	class UClass*                                                NewAIStrategy;                                     // 0x0(0x8)
};


// Size 0x8
struct EventFaunaMeleeAttack
{
public:
	char                                                         pad0x8_61SRU[0x8];                                 // 0x0(0x8)
};


// Size 0x10
struct AIAbilityFollowUp
{
public:
	class UClass*                                                AbilityType;                                       // 0x0(0x8)
	float                                                        Chance;                                            // 0x8(0x4)
	char                                                         pad0x4_RIRQ8[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct EventFaunaPickedup
{
public:
	class Actor*                                                 Interactor;                                        // 0x0(0x8)
	class Actor*                                                 PickedUpFauna;                                     // 0x8(0x8)
};


// Size 0x50
struct EventOwnedPawnFinishedSpawning
{
public:
	class Object*                                                AICoordinator;                                     // 0x0(0x8)
	struct FName                                                 Region;                                            // 0x8(0x8)
	struct Vector                                                SpawnPos;                                          // 0x10(0xc)
	char                                                         pad0x4_7GSDD[0x4];                                 // 0x1c(0x4)
	class Actor*                                                 ActorToPerceiveOnSpawn;                            // 0x20(0x8)
	float                                                        MaximumDistanceToPerceiveOnSpawn;                  // 0x28(0x4)
	char                                                         pad0x4_FWUTO[0x4];                                 // 0x2c(0x4)
	class AthenaAIControllerParamsDataAsset*                     Skillset;                                          // 0x30(0x8)
	struct FName                                                 HomeRegionZone;                                    // 0x38(0x8)
	class Object*                                                TargetInteractableOnSpawn;                         // 0x40(0x8)
	class AISpawner*                                             OwnerAISpawner;                                    // 0x48(0x8)
};


// Size 0x1
struct EventAIKnockbackEnded
{
public:
	char                                                         pad0x1_4S7MN[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct AIDioramaPawn
{
public:
	class Pawn*                                                  Pawn;                                              // 0x0(0x8)
	char                                                         pad0x40_9ARLB[0x40];                               // 0x8(0x40)
};


// Size 0x10
struct AIPartsCategoryMapping
{
public:
	class UClass*                                                ClassId;                                           // 0x0(0x8)
	class AIPartsCategory*                                       PartsCategory;                                     // 0x8(0x8)
};


// Size 0x18
struct TinySharkBiteAttackShipTelemetryEvent
{
public:
	struct FString                                               TinySharkPartTag;                                  // 0x0(0x10)
	bool                                                         BiteCancelled;                                     // 0x10(0x1)
	char                                                         pad0x7_ZYY3D[0x7];                                 // 0x11(0x7)
};


// Size 0xc
struct AIPerCrewSpawnerRespawnSettings
{
public:
	float                                                        MinRespawnTimeInterval;                            // 0x0(0x4)
	float                                                        MaxRespawnTimeInterval;                            // 0x4(0x4)
	float                                                        RespawnChance;                                     // 0x8(0x4)
};


// Size 0x18
struct AITargetBounds
{
public:
	struct Vector                                                Offset;                                            // 0x0(0xc)
	struct Vector                                                Extents;                                           // 0xc(0xc)
};


// Size 0x18
struct EventAIKnockbackStarted
{
public:
	char                                                         pad0x18_29M1S[0x18];                               // 0x0(0x18)
};


// Size 0x198
struct AIBountySpawnerWave
{
public:
	char                                                         pad0x130_SW5C4[0x130];                             // 0x0(0x130)
	bool                                                         IsTarget;                                          // 0x130(0x1)
	bool                                                         UseTaggedWaveSpawnLocations;                       // 0x131(0x1)
	char                                                         pad0x2_Z9CXP[0x2];                                 // 0x132(0x2)
	struct FName                                                 SpawnLocationTag;                                  // 0x134(0x8)
	bool                                                         IsUsingDialogue;                                   // 0x13c(0x1)
	char                                                         pad0x3_BK6U1[0x3];                                 // 0x13d(0x3)
	int                                                          MinPlayersToEnable;                                // 0x140(0x4)
	char                                                         Gender;                                            // 0x144(0x1)
	char                                                         Rank;                                              // 0x145(0x1)
	char                                                         pad0x2_V4QE0[0x2];                                 // 0x146(0x2)
	class PostBountyAIPawnSpawnedAction*                         PostSpawnAction;                                   // 0x148(0x8)
	char                                                         pad0x38_3311V[0x38];                               // 0x150(0x38)
	class UClass*                                                BountyReward;                                      // 0x188(0x8)
	char                                                         pad0x8_6OBS0[0x8];                                 // 0x190(0x8)
};


// Size 0x10
struct AIControllerDynamicBalancingPlayerShipValueDesc
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	int                                                          ShipValue;                                         // 0x8(0x4)
	char                                                         pad0x4_Y6YC4[0x4];                                 // 0xc(0x4)
};


// Size 0x40
struct AIDebugVisualisationBox
{
public:
	struct Vector                                                Centre;                                            // 0x0(0xc)
	struct Vector                                                Extents;                                           // 0xc(0xc)
	char                                                         pad0x8_26E47[0x8];                                 // 0x18(0x8)
	struct Quat                                                  Rotation;                                          // 0x20(0x10)
	float                                                        LifeTime;                                          // 0x30(0x4)
	char                                                         Colour;                                            // 0x34(0x1)
	char                                                         pad0xb_VLZUY[0xb];                                 // 0x35(0xb)
};


// Size 0x1
struct AthenaAIDebugCostData
{
public:
	char                                                         pad0x1_TGC8R[0x1];                                 // 0x0(0x1)
};


// Size 0x50
struct TaleQuestTinySharkSpawnTelemetryEvent
{
public:
	char                                                         pad0x40_V1OCT[0x40];                               // 0x0(0x40)
	struct Guid                                                  VoyageID;                                          // 0x40(0x10)
};


// Size 0x1
struct EventPawnRequestDespawn
{
public:
	char                                                         pad0x1_GP74F[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct AthenaAICharacterControllerItemCategoryProjectileEffectivenessProperties
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	class CurveFloat*                                            DistanceInMToProjectileHitChanceCurve;             // 0x8(0x8)
};


// Size 0x18
struct AIFormAssetToSandboxPerformanceConstraintActivity
{
public:
	struct StringAssetReference                                  Asset;                                             // 0x0(0x10)
	class UClass*                                                RelatedActivityType;                               // 0x10(0x8)
};


// Size 0x10
struct EventAIPawnAddedToAIRegion
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
	char                                                         pad0x8_LLGGA[0x8];                                 // 0x8(0x8)
};


// Size 0x10
struct HearingThreat
{
public:
	struct FName                                                 SoundTag;                                          // 0x0(0x8)
	float                                                        Threat;                                            // 0x8(0x4)
	float                                                        CarrierSpeedThreshold;                             // 0xc(0x4)
};


// Size 0x1c
struct AIBountySpawnerWaveLocation
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        SelectionWeight;                                   // 0xc(0x4)
	bool                                                         AllowForTarget;                                    // 0x10(0x1)
	char                                                         pad0x3_QY9C7[0x3];                                 // 0x11(0x3)
	struct FName                                                 SpawnTag;                                          // 0x14(0x8)
};


// Size 0xc
struct TinyCreatureSpawnedTelemetryEvent
{
public:
	struct Vector                                                SpawnedLocation;                                   // 0x0(0xc)
};


// Size 0x1
struct EventTinySharkKilled
{
public:
	char                                                         pad0x1_4EX4E[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct TinySharkSpawnTelemetryEvent
{
public:
	struct FString                                               TinySharkId;                                       // 0x0(0x10)
	struct FString                                               TinySharkType;                                     // 0x10(0x10)
	struct Guid                                                  ConfigSpawnId;                                     // 0x20(0x10)
	int                                                          NumTinySharkOnServer;                              // 0x30(0x4)
	struct Vector                                                SpawnLocation;                                     // 0x34(0xc)
};


// Size 0x18
struct AILoadoutRankMapping
{
public:
	class LoadoutAsset*                                          Loadout;                                           // 0x0(0x8)
	TArray<float>                                                Weights;                                           // 0x8(0x10)
};


// Size 0x18
struct AIWeightedProbabilityRangeOfRangesRankMapping
{
public:
	class AIWeightedProbabilityRangeOfRangesAsset*               RangeOfRanges;                                     // 0x0(0x8)
	TArray<float>                                                Weights;                                           // 0x8(0x10)
};


// Size 0x68
struct EventAttachableArmourDamaged
{
public:
	struct ImpactDamageEvent                                     ImpactDamageEvent;                                 // 0x0(0x58)
	class Actor*                                                 ArmourOwningActor;                                 // 0x58(0x8)
	float                                                        VulnerabilityModifier;                             // 0x60(0x4)
	char                                                         pad0x4_L2U1P[0x4];                                 // 0x64(0x4)
};


// Size 0x10
struct CarriedItemThreatOverride
{
public:
	class UClass*                                                ItemDesc;                                          // 0x0(0x8)
	float                                                        Threat;                                            // 0x8(0x4)
	char                                                         pad0x4_D69OC[0x4];                                 // 0xc(0x4)
};


// Size 0x40
struct AICustomNameTitleMapping
{
public:
	class UClass*                                                AIClassId;                                         // 0x0(0x8)
	struct FText                                                 Title;                                             // 0x8(0x38)
};


// Size 0xc
struct AIPartIdNumVariantInfo
{
public:
	struct FName                                                 AIPartId;                                          // 0x0(0x8)
	int                                                          NumVariants;                                       // 0x8(0x4)
};


// Size 0x8
struct EventPlayerLeftAISpawnableWater
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x1
struct BountySpawnerRequestGhostShipProgression
{
public:
	char                                                         pad0x1_SAW4F[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct WeightedAIStrategyChance
{
public:
	class UClass*                                                Strategy;                                          // 0x0(0x8)
	struct AIDataProviderFloatValue                              WeightedChance;                                    // 0x8(0x30)
};


// Size 0x8
struct EventOceanCrawlerAIAbilityAudioRequest
{
public:
	char                                                         RequestAudioKey;                                   // 0x0(0x1)
	char                                                         pad0x3_9Y2QM[0x3];                                 // 0x1(0x3)
	float                                                        AudioDelay;                                        // 0x4(0x4)
};


// Size 0x50
struct AISpawnerTelemetryEvent
{
public:
	struct FString                                               AISpawnerSourceAsset;                              // 0x0(0x10)
	struct FString                                               AISpawnerType;                                     // 0x10(0x10)
	struct FString                                               AISpawnerRegion;                                   // 0x20(0x10)
	TArray<String>                                               AISpawnerContexts;                                 // 0x30(0x10)
	int                                                          AISpawnerWaveSpawnNumber;                          // 0x40(0x4)
	float                                                        AISpawnerWaveDelayBefore;                          // 0x44(0x4)
	float                                                        AISpawnerWaveDelayAfter;                           // 0x48(0x4)
	char                                                         pad0x4_YUKRF[0x4];                                 // 0x4c(0x4)
};


// Size 0xc
struct AthenaAIControllerHealthCustomisation
{
public:
	bool                                                         OverrideMaxHealth;                                 // 0x0(0x1)
	bool                                                         OverrideMaxHealthWithMinMax;                       // 0x1(0x1)
	char                                                         pad0x2_XDF0E[0x2];                                 // 0x2(0x2)
	float                                                        MinHealth;                                         // 0x4(0x4)
	float                                                        MaxHealth;                                         // 0x8(0x4)
};


// Size 0x8
struct MinMaxAbilityRange
{
public:
	float                                                        MinDistanceToTarget;                               // 0x0(0x4)
	float                                                        MaxDistanceToTarget;                               // 0x4(0x4)
};


// Size 0x10
struct AthenaAICharacterControllerSpawnItemDescForItemCategory
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	class UClass*                                                ItemDesc;                                          // 0x8(0x8)
};


// Size 0x30
struct QuestVariableTinySharkExperience
{
public:
	char                                                         pad0x30_Q536A[0x30];                               // 0x0(0x30)
};


// Size 0x1
struct EventAIPartRetrievalRequestFailed
{
public:
	char                                                         pad0x1_VWSCQ[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct AIDioramaLocationSourceComponentData
{
public:
	struct Transform                                             RelativeTransform;                                 // 0x0(0x30)
	class Actor*                                                 Interactable;                                      // 0x30(0x8)
	char                                                         pad0x8_A4NNC[0x8];                                 // 0x38(0x8)
};


// Size 0x30
struct EventTinySharkSpawned
{
public:
	struct FString                                               TinySharkPartTag;                                  // 0x0(0x10)
	struct Guid                                                  SpawnConfigId;                                     // 0x10(0x10)
	struct Vector                                                SpawnLocation;                                     // 0x20(0xc)
	int                                                          NumTinySharksOnServer;                             // 0x2c(0x4)
};


// Size 0x8
struct EventFaunaAgitationBegun
{
public:
	class Actor*                                                 SourceActor;                                       // 0x0(0x8)
};


// Size 0x18
struct PetMaterialEntry
{
public:
	struct StringAssetReference                                  MaterialReference;                                 // 0x0(0x10)
	bool                                                         CastShadows;                                       // 0x10(0x1)
	char                                                         pad0x7_TQITJ[0x7];                                 // 0x11(0x7)
};


// Size 0x10
struct IslandDioramas
{
public:
	TArray<class Interface*>                                     Entries;                                           // 0x0(0x10)
};


// Size 0x10
struct PetLoadedMaterial
{
public:
	class MaterialInstance*                                      MaterialInstance;                                  // 0x0(0x8)
	bool                                                         CastShadows;                                       // 0x8(0x1)
	char                                                         pad0x7_WHS67[0x7];                                 // 0x9(0x7)
};


// Size 0x8
struct AIPartId
{
public:
	struct FName                                                 PartId;                                            // 0x0(0x8)
};


// Size 0x1
struct EventAIPartsRetrievalComponentBeforeBeginLoad
{
public:
	char                                                         pad0x1_W1TAS[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct AIClassIdToSandboxPerformanceConstraintActivity
{
public:
	class UClass*                                                ClassId;                                           // 0x0(0x8)
	class UClass*                                                RelatedActivityType;                               // 0x8(0x8)
};


// Size 0x38
struct SwimAttackTargetShipImpulseData
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	float                                                        PushImpulseForce;                                  // 0x8(0x4)
	struct Vector                                                PushImpulseLocation;                               // 0xc(0xc)
	float                                                        PushForceScalingFactorForeAndAftOfShipLowerBound;  // 0x18(0x4)
	float                                                        PushForceScalingFactorForeAndAftOfShipUpperBound;  // 0x1c(0x4)
	float                                                        RollImpulseForce;                                  // 0x20(0x4)
	struct Vector                                                RollImpulseLocation;                               // 0x24(0xc)
	float                                                        RollForceScalingFactorForeAndAftOfShipLowerBound;  // 0x30(0x4)
	float                                                        RollForceScalingFactorForeAndAftOfShipUpperBound;  // 0x34(0x4)
};


// Size 0x10
struct AthenaAICharacterControllerWeightedAmmoType
{
public:
	class UClass*                                                AmmoType;                                          // 0x0(0x8)
	float                                                        Weighting;                                         // 0x8(0x4)
	char                                                         pad0x4_7EZR6[0x4];                                 // 0xc(0x4)
};


// Size 0x30
struct BountySpawnerAudioChangedNetworkEvent
{
public:
	char                                                         pad0x18_DX0MH[0x18];                               // 0x0(0x18)
	char                                                         AudioState;                                        // 0x18(0x1)
	char                                                         pad0x3_47MFM[0x3];                                 // 0x19(0x3)
	float                                                        Intensity;                                         // 0x1c(0x4)
	char                                                         BountyType;                                        // 0x20(0x1)
	char                                                         pad0x3_JEE0D[0x3];                                 // 0x21(0x3)
	struct Vector                                                BountyPosition;                                    // 0x24(0xc)
};


// Size 0x14
struct AthenaAICharacterParams
{
public:
	float                                                        MissFiringHeightOffset;                            // 0x0(0x4)
	float                                                        MissFiringTargetInFrontOffset;                     // 0x4(0x4)
	float                                                        MinMissFiringTargetInFrontOffset;                  // 0x8(0x4)
	float                                                        MaxMissFiringTargetInFrontOffset;                  // 0xc(0x4)
	float                                                        BufferTimeWhenChangingItems;                       // 0x10(0x4)
};


// Size 0x18
struct AIStrategyVulnerabilityData
{
public:
	class UClass*                                                Strategy;                                          // 0x0(0x8)
	TArray<char>                                                 PreventedHealthChanges;                            // 0x8(0x10)
};


// Size 0x10
struct AdditionalSpawnerBehaviour
{
public:
	class SpawnerBehaviourStrategy*                              BehaviourStrategy;                                 // 0x0(0x8)
	char                                                         pad0x8_OOVHX[0x8];                                 // 0x8(0x8)
};


// Size 0x18
struct RequestAIAssistanceTelemetryEvent
{
public:
	struct FString                                               BootyName;                                         // 0x0(0x10)
	bool                                                         WasSuccess;                                        // 0x10(0x1)
	char                                                         pad0x7_7OL0V[0x7];                                 // 0x11(0x7)
};


// Size 0x8
struct EventExplosiveCrateDropped
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
};


// Size 0x18
struct EventPlayerEnterAISpawnableWater
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	char                                                         pad0x10_54OUD[0x10];                               // 0x8(0x10)
};


// Size 0x20
struct EventCrewedShipLeftAISpawnRegion
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	char                                                         pad0x18_C3IZM[0x18];                               // 0x8(0x18)
};


// Size 0x1
struct EventAIPawnReadyToConstructDebugText
{
public:
	char                                                         pad0x1_U0991[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct TinySharkRepositionTelemetryEvent
{
public:
	struct Guid                                                  TinySharkExperienceId;                             // 0x0(0x10)
	struct FString                                               TinySharkPartTag;                                  // 0x10(0x10)
	struct Vector                                                DespawnLocation;                                   // 0x20(0xc)
	bool                                                         IsTaleTinyShark;                                   // 0x2c(0x1)
	char                                                         pad0x3_NRC0X[0x3];                                 // 0x2d(0x3)
	int                                                          NumTimesRepositioned;                              // 0x30(0x4)
	char                                                         pad0x4_4OU0T[0x4];                                 // 0x34(0x4)
};


// Size 0x8
struct EventAIAbilityStarted
{
public:
	class UClass*                                                AbilityTypeCategory;                               // 0x0(0x8)
};


// Size 0x38
struct AthenaAIControllerWeightedRangesParamValue
{
public:
	struct FName                                                 ParamName;                                         // 0x0(0x8)
	struct WeightedProbabilityRangeOfRanges                      Value;                                             // 0x8(0x30)
};


// Size 0x20
struct AthenaAISharedControllerParamToggledValues
{
public:
	TArray<class AthenaAIControllerSharedParamValuesDataAsset*>  Assets;                                            // 0x0(0x10)
	struct FeatureFlag                                           FeatureName;                                       // 0x10(0xc)
	char                                                         pad0x4_RLOR1[0x4];                                 // 0x1c(0x4)
};


// Size 0x8
struct LureDartProxyActivatedInWaterEvent
{
public:
	class Actor*                                                 Proxy;                                             // 0x0(0x8)
};


// Size 0x8
struct EventSwimRotationModeChanged
{
public:
	char                                                         NewSwimRotationMode;                               // 0x0(0x1)
	char                                                         pad0x3_IJGZJ[0x3];                                 // 0x1(0x3)
	float                                                        NewRotationRate;                                   // 0x4(0x4)
};


// Size 0x18
struct EventOwnedPawnStartedDying
{
public:
	char                                                         DeathType;                                         // 0x0(0x1)
	char                                                         pad0x7_W27UD[0x7];                                 // 0x1(0x7)
	class Actor*                                                 Instigator;                                        // 0x8(0x8)
	char                                                         KillReason;                                        // 0x10(0x1)
	char                                                         pad0x7_90TDY[0x7];                                 // 0x11(0x7)
};


// Size 0x18
struct AIEncounterGenerationRecipeFeatureBasedRankOrderList
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	TArray<class AIEncounterGenerationRecipe*>                   Recipes;                                           // 0x8(0x10)
};


// Size 0x24
struct AIDebugVisualisationCylinder
{
public:
	struct Vector                                                To;                                                // 0x0(0xc)
	struct Vector                                                From;                                              // 0xc(0xc)
	float                                                        Radius;                                            // 0x18(0x4)
	float                                                        LifeTime;                                          // 0x1c(0x4)
	char                                                         Colour;                                            // 0x20(0x1)
	char                                                         pad0x3_S7I98[0x3];                                 // 0x21(0x3)
};


// Size 0x20
struct EventCrewedShipEnteredAISpawnRegion
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	char                                                         pad0x18_2PA0N[0x18];                               // 0x8(0x18)
};


// Size 0x1
struct StartCreatureSplineMovementEvent
{
public:
	char                                                         pad0x1_QS6ZY[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventAIDebugTextUpdated
{
public:
	char                                                         pad0x1_JS847[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct AttackableTypeToAnimMapping
{
public:
	char                                                         AttackType;                                        // 0x0(0x1)
	char                                                         pad0x7_OAE8Y[0x7];                                 // 0x1(0x7)
	class Object*                                                AnimMontage;                                       // 0x8(0x8)
	bool                                                         PlayAsDynamicMontage;                              // 0x10(0x1)
	char                                                         pad0x3_D11A0[0x3];                                 // 0x11(0x3)
	float                                                        AnimLength;                                        // 0x14(0x4)
	float                                                        TimeIntoAnimOfAttack;                              // 0x18(0x4)
	float                                                        TargetKnockBackStrength;                           // 0x1c(0x4)
	struct FName                                                 RumbleTag;                                         // 0x20(0x8)
};


// Size 0x8
struct LureDartInWaterData
{
public:
	char                                                         pad0x8_LM00K[0x8];                                 // 0x0(0x8)
};


// Size 0x130
struct AIPersistentSpawnerWave
{
public:
	char                                                         pad0x100_0YXYL[0x100];                             // 0x0(0x100)
	bool                                                         CacheHealthOnDespawn;                              // 0x100(0x1)
	char                                                         pad0x7_KR62J[0x7];                                 // 0x101(0x7)
	class UClass*                                                AITypeToCache;                                     // 0x108(0x8)
	char                                                         pad0x20_CHSN4[0x20];                               // 0x110(0x20)
};


// Size 0x10
struct FaunaAnimationBoarAttackStructure
{
public:
	class AnimSequence*                                          MeleeAttack;                                       // 0x0(0x8)
	class AnimSequence*                                          ChargeAttack;                                      // 0x8(0x8)
};


// Size 0x8
struct EventAIBountySpawnerFinalPawnKilled
{
public:
	class Actor*                                                 Instigator;                                        // 0x0(0x8)
};


// Size 0x8
struct EventPawnRemoveOwnership
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
};


// Size 0x10
struct EventPawnFinishedDying
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
	char                                                         DeathType;                                         // 0x8(0x1)
	char                                                         pad0x7_KNVI8[0x7];                                 // 0x9(0x7)
};


// Size 0x18
struct PetFlyingStrategyProperties
{
public:
	class UClass*                                                Strategy;                                          // 0x0(0x8)
	float                                                        ChanceOfFlying;                                    // 0x8(0x4)
	float                                                        MinFlyingMeshZOffset;                              // 0xc(0x4)
	float                                                        MaxFlyingMeshZOffset;                              // 0x10(0x4)
	char                                                         pad0x4_DVQMZ[0x4];                                 // 0x14(0x4)
};


// Size 0x20
struct AIFaunaSpawnerTelemetryEvents
{
public:
	struct FString                                               SpawnedFauna;                                      // 0x0(0x10)
	struct FString                                               IslandName;                                        // 0x10(0x10)
};


// Size 0x18
struct AIFormRankMapping
{
public:
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x0(0x8)
	TArray<float>                                                Weights;                                           // 0x8(0x10)
};


// Size 0x18
struct TinySharkSpawnedNetworkEvent
{
public:
	char                                                         pad0x18_YKEG4[0x18];                               // 0x0(0x18)
};


// Size 0x20
struct BountySpawnerIntensityUpdateNetworkEvent
{
public:
	char                                                         pad0x18_DCWZ6[0x18];                               // 0x0(0x18)
	bool                                                         IsFinalWave;                                       // 0x18(0x1)
	char                                                         pad0x3_FGQ63[0x3];                                 // 0x19(0x3)
	float                                                        Intensity;                                         // 0x1c(0x4)
};


// Size 0x48
struct TinySharkDespawnTelemetryEvent
{
public:
	struct FString                                               TinySharkId;                                       // 0x0(0x10)
	struct Guid                                                  TinySharkExperienceId;                             // 0x10(0x10)
	struct FString                                               TinySharkPartTag;                                  // 0x20(0x10)
	char                                                         TinySharkDespawnReason;                            // 0x30(0x1)
	char                                                         pad0x7_8H56K[0x7];                                 // 0x31(0x7)
	double                                                       TimeToCompleteAfterEngagedInSeconds;               // 0x38(0x8)
	float                                                        TotalTrackingIdleTime;                             // 0x40(0x4)
	float                                                        TotalIdleTimeAfterEngaged;                         // 0x44(0x4)
};


// Size 0x18
struct AIIncrementalWaveSpawnerArchive
{
public:
	char                                                         pad0x8_8ZMUX[0x8];                                 // 0x0(0x8)
	struct Vector                                                LastTargetPosition;                                // 0x8(0xc)
	int                                                          CurrentNumSpawnedPawns;                            // 0x14(0x4)
};


// Size 0x20
struct PlayerFaunaSpawnaData
{
public:
	char                                                         pad0x20_ZWZC9[0x20];                               // 0x0(0x20)
};


// Size 0x1
struct EventFaunaAgitationEnded
{
public:
	char                                                         pad0x1_GKEBE[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct ConditionalBasedOnBlackboardKey
{
public:
	bool                                                         UseCondition;                                      // 0x0(0x1)
	char                                                         pad0x7_ATZ2I[0x7];                                 // 0x1(0x7)
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x8(0x28)
	bool                                                         NegateCondition;                                   // 0x30(0x1)
	char                                                         pad0x7_O1QHM[0x7];                                 // 0x31(0x7)
};


// Size 0x1
struct EventFaunaAnimationStartChargeAttack
{
public:
	bool                                                         ChargeAttacked;                                    // 0x0(0x1)
};


// Size 0xc
struct AthenaAICharacterCannonTarget
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	struct FName                                                 TargetLocation;                                    // 0x4(0x8)
};


// Size 0x1
struct EventSporeBreathAIAbilityStarted
{
public:
	char                                                         pad0x1_KK8HQ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventAIControllerUnPossess
{
public:
	char                                                         pad0x1_SZPLN[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct AIDebugVisualisationLine
{
public:
	struct Vector                                                From;                                              // 0x0(0xc)
	struct Vector                                                To;                                                // 0xc(0xc)
	float                                                        LifeTime;                                          // 0x18(0x4)
	char                                                         Colour;                                            // 0x1c(0x1)
	char                                                         pad0x3_YAVF7[0x3];                                 // 0x1d(0x3)
};


// Size 0x24
struct AthenaAIControllerSenseSettings
{
public:
	bool                                                         EnableSight;                                       // 0x0(0x1)
	bool                                                         EnableHearing;                                     // 0x1(0x1)
	bool                                                         EnableDamage;                                      // 0x2(0x1)
	char                                                         pad0x1_BVRXE[0x1];                                 // 0x3(0x1)
	float                                                        SightRadius;                                       // 0x4(0x4)
	float                                                        LoseSightRadius;                                   // 0x8(0x4)
	float                                                        PeripheralVisionAngleDegrees;                      // 0xc(0x4)
	float                                                        MaxHearingRange;                                   // 0x10(0x4)
	float                                                        MaxHearingRangeForCrouching;                       // 0x14(0x4)
	float                                                        SightRadiusForCrouching;                           // 0x18(0x4)
	float                                                        LoseSightRadiusForCrouching;                       // 0x1c(0x4)
	float                                                        PeripheralVisionAngleDegreesForCrouching;          // 0x20(0x4)
};


// Size 0x20
struct AIFixedWavesSpawnerArchive
{
public:
	char                                                         pad0x8_PFKBZ[0x8];                                 // 0x0(0x8)
	TArray<int>                                                  NumSpawnedPawnsInWaves;                            // 0x8(0x10)
	bool                                                         WavesSpawnedOnSpottedNewTarget;                    // 0x18(0x1)
	char                                                         pad0x7_5DZG9[0x7];                                 // 0x19(0x7)
};


// Size 0xc
struct AIAbilityDebugReplicatedIntervals
{
public:
	float                                                        ActivationTimerCooldown;                           // 0x0(0x4)
	float                                                        TimeBeforeNextExecution;                           // 0x4(0x4)
	float                                                        DamageBeforeNextExecution;                         // 0x8(0x4)
};


// Size 0x30
struct EventTinySharkLootSpawned
{
public:
	struct Guid                                                  TinySharkExperienceId;                             // 0x0(0x10)
	struct FString                                               TinySharkPartIndex;                                // 0x10(0x10)
	struct Vector                                                LootSpawnLocation;                                 // 0x20(0xc)
	char                                                         pad0x4_507AM[0x4];                                 // 0x2c(0x4)
};


// Size 0x20
struct CustomPlayersAITrackerData
{
public:
	class AIPlayerTracker*                                       Tracker;                                           // 0x0(0x8)
	char                                                         pad0x18_38XXN[0x18];                               // 0x8(0x18)
};


// Size 0x1
struct EventOwnedPawnRemoveOwnership
{
public:
	char                                                         pad0x1_YULX2[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventExplosiveItemDropped
{
public:
	class Actor*                                                 Item;                                              // 0x0(0x8)
};


// Size 0xc
struct PetMovementRequest
{
public:
	char                                                         State;                                             // 0x0(0x1)
	char                                                         pad0x3_BIN78[0x3];                                 // 0x1(0x3)
	float                                                        TargetMeshZOffset;                                 // 0x4(0x4)
	bool                                                         AdjustingFlight;                                   // 0x8(0x1)
	char                                                         pad0x3_EN6UN[0x3];                                 // 0x9(0x3)
};


// Size 0x28
struct SirenEncounterData
{
public:
	class World*                                                 GameWorld;                                         // 0x0(0x8)
	class AIPerPlayerSpawner*                                    SirenSpawner;                                      // 0x8(0x8)
	class SimpleAIRegion*                                        AIRegion;                                          // 0x10(0x8)
	class AIProximityPlayerTracker*                              ProximityPlayerTracker;                            // 0x18(0x8)
	float                                                        ShutdownTime;                                      // 0x20(0x4)
	char                                                         SirenEncounterState;                               // 0x24(0x1)
	char                                                         pad0x3_AG5RK[0x3];                                 // 0x25(0x3)
};


// Size 0x18
struct AIStrategyMovementProperties
{
public:
	class UClass*                                                AIStrategy;                                        // 0x0(0x8)
	float                                                        MaxSpeedAmp;                                       // 0x8(0x4)
	float                                                        MaxAccelAmp;                                       // 0xc(0x4)
	float                                                        OverrideRVOAvoidanceRadius;                        // 0x10(0x4)
	float                                                        OverrideBlendSpeed;                                // 0x14(0x4)
};


// Size 0x8
struct MinMaxBurrowAbility
{
public:
	float                                                        MinValue;                                          // 0x0(0x4)
	float                                                        MaxValue;                                          // 0x4(0x4)
};


// Size 0x10
struct EventAIPawnRemovedFromAIRegion
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
	char                                                         pad0x8_MLC13[0x8];                                 // 0x8(0x8)
};


// Size 0x10
struct PlayerKillAITelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
};


// Size 0x20
struct EventPlayerEnteredAISpawnRegion
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	char                                                         pad0x18_4YEU3[0x18];                               // 0x8(0x18)
};


// Size 0x10
struct CoralArmourDamagedTelemetryEvent
{
public:
	float                                                        CurrentHealth;                                     // 0x0(0x4)
	float                                                        PreviousHealth;                                    // 0x4(0x4)
	float                                                        HealthDelta;                                       // 0x8(0x4)
	char                                                         Reason;                                            // 0xc(0x1)
	char                                                         pad0x3_APPGL[0x3];                                 // 0xd(0x3)
};


// Size 0x28
struct TinySharkServiceParams
{
public:
	class TinySharkParamsDataAsset*                              TinySharkParams;                                   // 0x0(0x8)
	TArray<struct TinySharkShipSpawnData>                        SpawnForShipData;                                  // 0x8(0x10)
	class EnvQuery*                                              SpawnForShipQuery;                                 // 0x18(0x8)
	float                                                        SpawnFailureTimer;                                 // 0x20(0x4)
	char                                                         pad0x4_AYAPL[0x4];                                 // 0x24(0x4)
};


// Size 0x18
struct WeightedAmmoTypeRange
{
public:
	float                                                        MinRange;                                          // 0x0(0x4)
	char                                                         pad0x4_6X5NS[0x4];                                 // 0x4(0x4)
	TArray<struct WeightedAmmoType>                              AmmoTypeProbabilities;                             // 0x8(0x10)
};


// Size 0xf0
struct WeightedAISpawnTypeParams
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	int                                                          MaxTimesCanBeSelected;                             // 0x4(0x4)
	struct AISpawnTypeParams                                     Params;                                            // 0x8(0xe8)
};


// Size 0x38
struct AIFormVarietyEntry
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	char                                                         pad0x4_4Y29R[0x4];                                 // 0xc(0x4)
	struct StringAssetReference                                  Form;                                              // 0x10(0x10)
	float                                                        Weight;                                            // 0x20(0x4)
	int                                                          MaxPerEncounter;                                   // 0x24(0x4)
	TArray<struct AIIndividualVarietyEntry>                      Individuals;                                       // 0x28(0x10)
};


// Size 0x14
struct AIPerCrewSpawnerStoryBasedRespawnSettings
{
public:
	struct AIPerCrewSpawnerRespawnSettings                       RespawnSettings;                                   // 0x0(0xc)
	struct StoryFlag                                             Story;                                             // 0xc(0x8)
};


// Size 0x30
struct AthenaAIControllerSenseSettingOverride
{
public:
	class UClass*                                                AIStrategy;                                        // 0x0(0x8)
	struct AthenaAIControllerSenseSettings                       SenseSettings;                                     // 0x8(0x24)
	bool                                                         ClearPerceivedData;                                // 0x2c(0x1)
	char                                                         pad0x3_IYV0A[0x3];                                 // 0x2d(0x3)
};


// Size 0x10
struct AthenaAICharacterCannonTargetingParams
{
public:
	TArray<struct AthenaAICharacterCannonTarget>                 Params;                                            // 0x0(0x10)
};


// Size 0x18
struct ReplicatedAIPartsData
{
public:
	class AIPartsCategory*                                       PartsCategory;                                     // 0x0(0x8)
	struct AIPartId                                              AIPartId;                                          // 0x8(0x8)
	int                                                          MeshIndex;                                         // 0x10(0x4)
	int                                                          TeamColorIndex;                                    // 0x14(0x4)
};


// Size 0x18
struct EventVisualAppearanceSelected
{
public:
	class AIPartsCategory*                                       PartsCategory;                                     // 0x0(0x8)
	struct AIPartId                                              AIPartId;                                          // 0x8(0x8)
	int                                                          PartsIndexToUse;                                   // 0x10(0x4)
	int                                                          ColorTextureIndex;                                 // 0x14(0x4)
};


// Size 0x18
struct FaunaSpeciesRequirement
{
public:
	class UClass*                                                Species;                                           // 0x0(0x8)
	TArray<struct FaunaBreedRequirement>                         Breeds;                                            // 0x8(0x10)
};


// Size 0x18
struct ConditionalAISpawnOverride
{
public:
	class AISpawnOverrideCondition*                              Condition;                                         // 0x0(0x8)
	struct AISpawnOverride                                       Override;                                          // 0x8(0x10)
};


// Size 0x20
struct AIEncounterWave
{
public:
	TArray<struct AIEncounterSpecification>                      Specifications;                                    // 0x0(0x10)
	TArray<int>                                                  SpecificationSpawnOrder;                           // 0x10(0x10)
};


// Size 0xd0
struct TinySharkParams
{
public:
	class UClass*                                                TinySharkType;                                     // 0x0(0x8)
	float                                                        TargetRadius;                                      // 0x8(0x4)
	struct Vector                                                SpawnOffset;                                       // 0xc(0xc)
	class UClass*                                                TinySharkClassID;                                  // 0x78(0x8)
	struct WeightedProbabilityRangeOfRanges                      LifetimeTimeout;                                   // 0x80(0x30)
	float                                                        DespawnRequestTimeout;                             // 0xb0(0x4)
	char                                                         pad0x4_Y55YT[0x4];                                 // 0xb4(0x4)
	TArray<struct TinySharkTrackedShipDistanceThresholdByFeature> TrackedShipDistanceThresholdByFeatureInPriorityOrder; // 0xb8(0x10)
	float                                                        RepositionTime;                                    // 0xc8(0x4)
	char                                                         pad0x4_GLIBS[0x4];                                 // 0xcc(0x4)
};


// Size 0xd8
struct AITelemetryFragmentInput
{
public:
	char                                                         pad0x8_0PDUF[0x8];                                 // 0x0(0x8)
	struct AIEncounterSpecification                              AIEncounterSpecification;                          // 0x8(0xd0)
};


// Size 0x10
struct AthenaAIAbilityPlayerBasedRanges
{
public:
	TArray<struct AthenaAIAbilityPlayerBasedRange>               AbilityRanges;                                     // 0x0(0x10)
};


// Size 0x18
struct AIControllerDynamicBalancingNamedParamMapping
{
public:
	int                                                          MaxCrewStrength;                                   // 0x0(0x4)
	char                                                         pad0x4_X5HKB[0x4];                                 // 0x4(0x4)
	TArray<struct AthenaAIControllerParamValue>                  CrewStrengthDynamicNamedParamOverrides;            // 0x8(0x10)
};


// Size 0x34
struct AITargetInfo
{
public:
	struct AITargetBounds                                        Bounds;                                            // 0x0(0x18)
	struct Vector                                                TargetPos;                                         // 0x18(0xc)
	struct Vector                                                TargetVelocity;                                    // 0x24(0xc)
	float                                                        TargetYaw;                                         // 0x30(0x4)
};


// Size 0x28
struct AIDebugSpawnConfiguration
{
public:
	int                                                          NumIslandsToSpawnOn;                               // 0x0(0x4)
	char                                                         pad0x4_2HW1X[0x4];                                 // 0x4(0x4)
	TArray<struct Name>                                          SpecificRegionsToSpawnOn;                          // 0x8(0x10)
	TArray<struct AIDebugSpawnAmount>                            WhatToSpawn;                                       // 0x18(0x10)
};


// Size 0x80
struct AIBountySpawnerWaveGroup
{
public:
	TArray<struct AIBountySpawnerWave>                           Waves;                                             // 0x0(0x10)
	TArray<struct AIBountySpawnerWave>                           AdditionalCaptainWaves;                            // 0x10(0x10)
	int                                                          NumNonTargetAIToKillToMoveToNextWaveGroup;         // 0x20(0x4)
	char                                                         pad0x4_BGZ60[0x4];                                 // 0x24(0x4)
	class UClass*                                                CombatDialogueForWaveGroup;                        // 0x28(0x8)
	float                                                        DynamicDelayBeforeStart;                           // 0x30(0x4)
	bool                                                         WantsAdditionalWaveAI;                             // 0x34(0x1)
	char                                                         pad0x3_YE9UG[0x3];                                 // 0x35(0x3)
	TArray<int>                                                  AdditionalWaveAIPerPlayer;                         // 0x38(0x10)
	TArray<int>                                                  AdditionalWaveCaptainAIPerPlayer;                  // 0x48(0x10)
	float                                                        WaveMusicIntensity;                                // 0x58(0x4)
	bool                                                         GhostShipWaveProgressionPoint;                     // 0x5c(0x1)
	char                                                         pad0x23_J0F7C[0x23];                               // 0x5d(0x23)
};


// Size 0x18
struct AIBountySpawnerArchiveWaveGroupEntry
{
public:
	int                                                          NumNonTargetAIKills;                               // 0x0(0x4)
	int                                                          NumTargetAIKills;                                  // 0x4(0x4)
	TArray<struct AIBountySpawnerArchiveWaveEntry>               WaveEntries;                                       // 0x8(0x10)
};


// Size 0x18
struct AIPartsCategoryFormMapping
{
public:
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x0(0x8)
	TArray<struct AIPartsCategoryMapping>                        CategoryMappings;                                  // 0x8(0x10)
};


// Size 0x48
struct FaunaSpawnaImpactIdToSpawner
{
public:
	class UClass*                                                FaunaSpawnaSpawnId;                                // 0x0(0x8)
	bool                                                         UseLandRandomSpeciesAssortmentSpawner;             // 0x8(0x1)
	char                                                         pad0x7_762QQ[0x7];                                 // 0x9(0x7)
	class AIFixedWavesSpawner*                                   LandRandomSpeciesAssortmentSpawner;                // 0x10(0x8)
	class AIFixedWavesSpawner*                                   LandPigSpawner;                                    // 0x18(0x8)
	class AIFixedWavesSpawner*                                   LandChickenSpawner;                                // 0x20(0x8)
	class AIFixedWavesSpawner*                                   LandSnakeSpawner;                                  // 0x28(0x8)
	class AIFixedWavesSpawner*                                   SharkSpawner;                                      // 0x30(0x8)
	TArray<struct AttitudeOverrideEntry>                         SpawnedPawnAttitudeOverrides;                      // 0x38(0x10)
};


// Size 0x10
struct FeatureToggledAIEncounterSpecificSkillSetCollection
{
public:
	TArray<struct FeatureToggledAIEncounterSpecificSkillSet>     ToggledSkillsets;                                  // 0x0(0x10)
};


// Size 0x20
struct AthenaAIControllerFeatureToggledParams
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x0(0xc)
	char                                                         pad0x4_AJUG5[0x4];                                 // 0xc(0x4)
	TArray<struct AthenaAIControllerParamValue>                  Params;                                            // 0x10(0x10)
};


// Size 0x18
struct AthenaAICharacterControllerItemCategoryNamedParams
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	TArray<struct AthenaAIControllerParamValue>                  NamedControllerParams;                             // 0x8(0x10)
};


// Size 0x38
struct AISpawnContextIdEncounterSettingsPair
{
public:
	TArray<class Class*>                                         SpawnContexts;                                     // 0x0(0x10)
	bool                                                         DisableSpawning;                                   // 0x10(0x1)
	char                                                         pad0x7_AMDEW[0x7];                                 // 0x11(0x7)
	class AIEncounterSettings*                                   EncounterSettings;                                 // 0x18(0x8)
	class AISpawnWaveSequenceRankProgression*                    SpawnWaveProgression;                              // 0x20(0x8)
	TArray<struct AIEncounterAndWaveSettingsOverride>            EncounterAndWaveSettingsOverride;                  // 0x28(0x10)
};


// Size 0xd0
struct AIBountySpawnerParams
{
public:
	TArray<struct AIEncounterWave>                               AISpawnerCreationDesc;                             // 0x0(0x10)
	struct StringAssetReference                                  TeamColor;                                         // 0x10(0x10)
	TArray<int>                                                  NumTargetsInWave;                                  // 0x20(0x10)
	TArray<int>                                                  NumCaptainsInWave;                                 // 0x30(0x10)
	float                                                        MinTimeBetweenSpawns;                              // 0x40(0x4)
	float                                                        MaxTimeBetweenSpawns;                              // 0x44(0x4)
	float                                                        MinTimeBetweenWaves;                               // 0x48(0x4)
	float                                                        MaxTimeBetweenWaves;                               // 0x4c(0x4)
	struct WeightedProbabilityRange                              WavesPerRelocate;                                  // 0x50(0x20)
	struct WeightedProbabilityRange                              WaveSplitChance;                                   // 0x70(0x20)
	TArray<float>                                                WaveSuicideTime;                                   // 0x90(0x10)
	float                                                        WaveSuicideMinDist;                                // 0xa0(0x4)
	int                                                          NumWavesPerGroup;                                  // 0xa4(0x4)
	int                                                          NumWaveGroups;                                     // 0xa8(0x4)
	int                                                          NumTotalWaves;                                     // 0xac(0x4)
	int                                                          NumTargetsPerWaveGroup;                            // 0xb0(0x4)
	int                                                          NumCaptainsPerWaveGroup;                           // 0xb4(0x4)
	TArray<class Class*>                                         AICombatDialogue;                                  // 0xb8(0x10)
	bool                                                         ConvertFinalCaptainToSkeletonLord;                 // 0xc8(0x1)
	char                                                         pad0x7_P10YI[0x7];                                 // 0xc9(0x7)
};


// Size 0x48
struct AISpawnTypeParamsCollection
{
public:
	char                                                         pad0x8_TLJAP[0x8];                                 // 0x0(0x8)
	TArray<struct WeightedAISpawnTypeParams>                     SpawnParams;                                       // 0x8(0x10)
	char                                                         pad0x30_MHTEC[0x30];                               // 0x18(0x30)
};


// Size 0x20
struct AIAbilityContinuousCooldownParameterData
{
public:
	struct AthenaAIAbilityPlayerBasedRanges                      InitialCooldown;                                   // 0x0(0x10)
	struct AthenaAIAbilityPlayerBasedRanges                      CooldownBetweenActivations;                        // 0x10(0x10)
};


// Size 0x28
struct AIBountySpawnerArchive
{
public:
	char                                                         pad0x8_6B9WB[0x8];                                 // 0x0(0x8)
	int                                                          CurrentWaveIndex;                                  // 0x8(0x4)
	char                                                         pad0x4_SA6NI[0x4];                                 // 0xc(0x4)
	TArray<struct AIBountySpawnerArchiveWaveGroupEntry>          WaveGroupEntries;                                  // 0x10(0x10)
	float                                                        BountyAudioIntensity;                              // 0x20(0x4)
	char                                                         pad0x4_ONSPA[0x4];                                 // 0x24(0x4)
};


// Size 0x100
struct AISpawnerWave
{
public:
	float                                                        SpawnChance;                                       // 0x0(0x4)
	char                                                         pad0x4_K0IUQ[0x4];                                 // 0x4(0x4)
	struct WeightedProbabilityRange                              NumOfSpawnsInWave;                                 // 0x8(0x20)
	struct AISpawnTypeParamsCollection                           SpawnTypeParamsOverride;                           // 0x28(0x48)
	struct WeightedProbabilityRangeOfRanges                      DelayBeforeWave;                                   // 0x70(0x30)
	struct WeightedProbabilityRangeOfRanges                      DelayBetweenSpawns;                                // 0xa0(0x30)
	struct WeightedProbabilityRangeOfRanges                      DelayBeforeNextWaveIfSuccessful;                   // 0xd0(0x30)
};


// Size 0x40
struct AIPerCrewSpawnerCrewUnit
{
public:
	char                                                         pad0x20_M7R9S[0x20];                               // 0x0(0x20)
	TArray<struct AISpawnerWave>                                 SelectedWaves;                                     // 0x20(0x10)
	TArray<class AISpawnerPrerequisiteBase*>                     Prerequisites;                                     // 0x30(0x10)
};


// Size 0x108
struct EscalatingWave
{
public:
	int                                                          WaveNumber;                                        // 0x0(0x4)
	char                                                         pad0x4_IQYNB[0x4];                                 // 0x4(0x4)
	struct AISpawnerWave                                         SpawnedWave;                                       // 0x8(0x100)
};


