// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaLoadingScreenBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x208 (Full Size[0x230] - InheritedSize[0x28]
class SlateLoadingScreenParams: public DataAsset
{
public:
	bool                                                         DrawBackground;                                    // 0x28(0x1)
	bool                                                         DrawBackgroundImage;                               // 0x29(0x1)
	bool                                                         DrawTips;                                          // 0x2a(0x1)
	bool                                                         DrawSpinner;                                       // 0x2b(0x1)
	float                                                        ViewportWidth;                                     // 0x2c(0x4)
	float                                                        ViewportHeight;                                    // 0x30(0x4)
	float                                                        FooterHeight;                                      // 0x34(0x4)
	bool                                                         DrawSpinnerText;                                   // 0x38(0x1)
	char                                                         pad0x7_FVU9H[0x7];                                 // 0x39(0x7)
	struct StringAssetReference                                  PlaceholderSpinnerTexture;                         // 0x40(0x10)
	struct LinearColor                                           BackgroundColour;                                  // 0x50(0x10)
	bool                                                         StartWithCyclingImage;                             // 0x60(0x1)
	char                                                         pad0x7_O60TG[0x7];                                 // 0x61(0x7)
	struct SlateLoadingScreenImageParams                         PrimaryImage;                                      // 0x68(0x30)
	TArray<struct SlateLoadingScreenImageParams>                 CyclingImages;                                     // 0x98(0x10)
	int                                                          MaxNumImagesPerLoad;                               // 0xa8(0x4)
	char                                                         pad0x4_E61GV[0x4];                                 // 0xac(0x4)
	struct FText                                                 SpinnerText;                                       // 0xb0(0x38)
	struct SlateColor                                            SpinnerTextColour;                                 // 0xe8(0x30)
	struct SlateFontInfo                                         SpinnerTextFont;                                   // 0x118(0x40)
	float                                                        SpinnerSize;                                       // 0x158(0x4)
	struct Margin                                                SpinnerMargin;                                     // 0x15c(0x10)
	float                                                        SpinnerPadding;                                    // 0x16c(0x4)
	struct StringAssetReference                                  SpinnerIcon;                                       // 0x170(0x10)
	struct Margin                                                TipsMargin;                                        // 0x180(0x10)
	float                                                        TipWrapLength;                                     // 0x190(0x4)
	float                                                        TipDisplayDuration;                                // 0x194(0x4)
	float                                                        TipDurationBetweenTips;                            // 0x198(0x4)
	int                                                          NumTipsPerImage;                                   // 0x19c(0x4)
	struct SlateFontInfo                                         LoadingTipFont;                                    // 0x1a0(0x40)
	float                                                        LoadingTipFontLineHeightPercentage;                // 0x1e0(0x4)
	char                                                         pad0x4_J3X0B[0x4];                                 // 0x1e4(0x4)
	TArray<struct FText>                                         LoadingScreenTips;                                 // 0x1e8(0x10)
	struct SlateColor                                            LoadingScreenTipColour;                            // 0x1f8(0x30)
	bool                                                         AllowSyncronousAssetLoad;                          // 0x228(0x1)
	char                                                         pad0x7_0YOSG[0x7];                                 // 0x229(0x7)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class AthenaLoadingScreenParams: public DeveloperSettings
{
public:
	struct StringAssetReference                                  BootLoadingScreen;                                 // 0x38(0x10)
	struct StringAssetReference                                  TeleportLoadingScreen;                             // 0x48(0x10)
	struct StringAssetReference                                  AdventureLoadingScreens;                           // 0x58(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LoadingUtilities: public BlueprintFunctionLibrary
{
public:
};


}