// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0
class MetalAIFormComponent: public AthenaAIFormComponent
{
public:
	Class ParticleSystem*                                        RustyParticlesTemplate;                            // 0x160(0x8)
	Class SkeletonAudioFootfallControllerParams*                 DefaultFootfallParams;                             // 0x168(0x8)
	Class SkeletonAudioFootfallControllerParams*                 RustyFootfallParams;                               // 0x170(0x8)
	struct FName                                                 RustShaderParamName;                               // 0x198(0x8)
	float                                                        NotRustyShaderParamValue;                          // 0x1a0(0x4)
	float                                                        RustyShaderParamValue;                             // 0x1a4(0x4)
	float                                                        ShaderParamBlendSpeed;                             // 0x1a8(0x4)
	struct FName                                                 SeedShaderParamName;                               // 0x1ac(0x8)
	int                                                          MaxSeedShaderValue;                                // 0x1b4(0x4)
	bool                                                         IsWet;                                             // 0x1b8(0x1)
	Class ParticleSystemComponent*                               RustyParticleSystemComponent;                      // 0x1c0(0x8)
	Class DamageableVulnerabilityLayer*                          DefaultVulnerabilityLayer;                         // 0x1d0(0x8)
	Class DamageableVulnerabilityLayer*                          RustyVulnerabilityLayer;                           // 0x1d8(0x8)
	Class CharacterHitReactionDamagerTypeToAnimTypeLayer*        RustyHitReactionsLayer;                            // 0x1e0(0x8)
	Class MaterialInstanceDynamic*                               MetalDynamicMaterialInstance;                      // 0x1e8(0x8)
};


// Size 0xa0
class PlantAIFormComponent: public AthenaAIFormComponent
{
public:
	Class ParticleSystem*                                        HealingParticlesTemplate;                          // 0x160(0x8)
	Class WwiseEvent*                                            StartHealingAudioLoopEvent;                        // 0x168(0x8)
	Class WwiseEvent*                                            StopHealingAudioLoopEvent;                         // 0x170(0x8)
	Class ParticleSystem*                                        WeakParticlesTemplate;                             // 0x178(0x8)
	struct FName                                                 HealingShaderParamName;                            // 0x1a0(0x8)
	float                                                        IsNotHealingShaderParamValue;                      // 0x1a8(0x4)
	float                                                        IsHealingShaderParamValue;                         // 0x1ac(0x4)
	float                                                        ShaderParamBlendSpeed;                             // 0x1b0(0x4)
	bool                                                         IsWet;                                             // 0x1b4(0x1)
	bool                                                         IsWeak;                                            // 0x1b5(0x1)
	Class ParticleSystemComponent*                               HealingParticleSystemComponent;                    // 0x1b8(0x8)
	Class ParticleSystemComponent*                               WeakParticleSystemComponent;                       // 0x1c0(0x8)
	Class MaterialInstanceDynamic*                               PlantDynamicMaterialInstance;                      // 0x1c8(0x8)
};


// Size 0x130
class ShadowAIFormComponent: public AthenaAIFormComponent
{
public:
	byte                                                         FlameSpecificPhobia;                               // 0x138(0x1)
	Class ParticleSystem*                                        LightStateConstantParticlesTemplate;               // 0x140(0x8)
	Class ParticleSystem*                                        DarkStateConstantParticlesTemplate;                // 0x148(0x8)
	Class ParticleSystem*                                        ToLightTransitionParticlesTemplate;                // 0x150(0x8)
	Class ParticleSystem*                                        ToDarkTransitionParticlesTemplate;                 // 0x158(0x8)
	Class PhysicalMaterial*                                      ClientLightStatePhysMaterialOverride;              // 0x160(0x8)
	Class PhysicalMaterial*                                      ClientDarkStatePhysMaterialOverride;               // 0x168(0x8)
	Class WwiseEvent*                                            StartDarkStateAudioLoopEvent;                      // 0x170(0x8)
	Class WwiseEvent*                                            StopDarkStateAudioLoopEvent;                       // 0x178(0x8)
	TArray<Assetclass ShadowBaseMaterials>                       ShadowBaseMaterials;                               // 0x180(0x10)
	struct FName                                                 ShadowShaderParamName;                             // 0x190(0x8)
	float                                                        LightStateShaderParamValue;                        // 0x198(0x4)
	float                                                        DarkStateShaderParamValue;                         // 0x19c(0x4)
	float                                                        ShaderParamBlendSpeed;                             // 0x1a0(0x4)
	struct FName                                                 SeedShaderParamName;                               // 0x1a4(0x8)
	int                                                          MaxSeedShaderValue;                                // 0x1ac(0x4)
	byte                                                         CurrentState;                                      // 0x1b0(0x1)
	Class ParticleSystemComponent*                               LightStateConstantParticleSystemComponent;         // 0x1b8(0x8)
	Class ParticleSystemComponent*                               DarkStateConstantParticleSystemComponent;          // 0x1c0(0x8)
	TArray<class MaterialInstanceDynamic*>                       ShadowDynamicMaterialInstances;                    // 0x1c8(0x10)
	TArray<class Lantern*>                                       LanternArray;                                      // 0x230(0x10)
	TArray<Struct FlameSpecificDataEntry>                        FlameSpecificDataMap;                              // 0x240(0x10)
};


// Size 0xa0
class EntitlementDesc: public DataAsset
{
public:
	Struct FText                                                 Title;                                             // 0x28(0x38)
	Struct FText                                                 Description;                                       // 0x60(0x38)
	Struct StringAssetReference                                  IconInvPath;                                       // 0x98(0x10)
	Struct StringAssetReference                                  IconPrvPath;                                       // 0xa8(0x10)
	class                                                        Category;                                          // 0xb8(0x8)
	class                                                        Company;                                           // 0xc0(0x8)
};


// Size 0x8
class ClothingDesc: public EntitlementDesc
{
public:
	struct FName                                                 WardrobeKey;                                       // 0xc8(0x8)
};


// Size 0x30
class ShipCustomizationDesc: public EntitlementDesc
{
public:
	Struct StringAssetReference                                  CustomizationInfo;                                 // 0xc8(0x10)
	Struct FString                                               PreviousItem;                                      // 0xd8(0x10)
	Struct FString                                               NextItem;                                          // 0xe8(0x10)
};


// Size 0x0
class TaleRankDesc: public EntitlementDesc
{
public:
};


// Size 0x0
class TitleDesc: public ClothingDesc
{
public:
};


// Size 0x40
class ShantyItemDesc: public EntitlementDesc
{
public:
	Struct ShantyData                                            ShantyData;                                        // 0xc8(0x30)
	Struct StringAssetReference                                  BackgroundPath;                                    // 0xf8(0x10)
};


// Size 0x0
class SeasonPassEntitlementDesc: public EntitlementDesc
{
public:
};


// Size 0x0
class PrimaryItemUsePressedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0
class SecondaryItemUsePressedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x38
class InteractableBase: public Actor
{
public:
	bool                                                         RequiresFacingFront;                               // 0x3d8(0x1)
	bool                                                         RequiresNotBeingAirborne;                          // 0x3d9(0x1)
	bool                                                         RequiresNotSwimming;                               // 0x3da(0x1)
	bool                                                         InteractionsCanBeDisabled;                         // 0x3db(0x1)
	bool                                                         CanSetInteractionState;                            // 0x3dc(0x1)
	TArray<class InteractionPrerequisiteBase*>                   InteractionPrerequisites;                          // 0x3e0(0x10)
	Class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x3f0(0x8)
	byte                                                         InteractableIdentifier;                            // 0x3f8(0x1)
	byte                                                         CurrentInteractionState;                           // 0x3fa(0x1)
};


// Size 0x110
class ControllableObject: public InteractableBase
{
public:
	Struct ControlObjectActionRuleParams                         ControlObjectActionRuleParams;                     // 0x430(0x10)
	Class PhrasesRadialDataAsset*                                Phrases;                                           // 0x440(0x8)
	bool                                                         AllowDisconnectWhenIdle;                           // 0x448(0x1)
};


// Size 0x10
class ControllablePulley: public ControllableObject
{
public:
	Class ControllableIntentComponent*                           IntentComponent;                                   // 0x518(0x8)
};


// Size 0x2a8
class SailManipulator: public ControllablePulley
{
public:
	Struct RopeVisualParams                                      RopeVisuals;                                       // 0x520(0xc)
	float                                                        RopeLength;                                        // 0x52c(0x4)
	Class StaticMeshComponent*                                   BaseMeshComponent;                                 // 0x530(0x8)
	Class StaticMeshComponent*                                   TopMeshComponent;                                  // 0x538(0x8)
	Class FixedIntentComponent*                                  CurseIntentComponent;                              // 0x540(0x8)
	Class WwiseObjectPoolWrapper*                                ManipulatorAudioPool;                              // 0x548(0x8)
	Struct SocketId                                              MastSocketId;                                      // 0x550(0x20)
	Class SailManipulatorAudioParams*                            AudioParams;                                       // 0x570(0x8)
	Class SceneComponent*                                        MastSocketSceneComponent;                          // 0x578(0x8)
	Struct WwiseEmitter                                          AudioEmitter;                                      // 0x580(0x20)
	Class Mast*                                                  BoundMast;                                         // 0x7a0(0x8)
	Class Mast*                                                  PendingBoundMast;                                  // 0x7a8(0x8)
	bool                                                         Locked;                                            // 0x7b0(0x1)
	Class MobileInstancedStaticMeshComponent*                    TopMeshInstanceComponent;                          // 0x7b8(0x8)
};


// Size 0x28
class SailHoist: public SailManipulator
{
public:
	float                                                        RopeUVSpeed;                                       // 0x7d0(0x4)
	Class RiggingSystemComponent*                                Rigging;                                           // 0x7d8(0x8)
	int                                                          RiggingRopeIndex;                                  // 0x7e0(0x4)
	bool                                                         PlayAudio;                                         // 0x7e4(0x1)
};


// Size 0x5d0
class Mast: public Actor
{
public:
	byte                                                         MastType;                                          // 0x408(0x1)
	Class MastAudioParams*                                       MastAudioParams;                                   // 0x410(0x8)
	Class SceneComponent*                                        SceneRootComponent;                                // 0x418(0x8)
	Class IntentCombinerComponent*                               AngleCombinerComponent;                            // 0x420(0x8)
	Class IntentCombinerComponent*                               SailHoistIntentCombinerComponent;                  // 0x428(0x8)
	Class IntentCombinerComponent*                               MastHoistIntentCombinerComponent;                  // 0x430(0x8)
	Class SceneComponent*                                        MastMovingAttachComponent;                         // 0x438(0x8)
	Class SceneComponent*                                        SailAnglePivotComponent;                           // 0x440(0x8)
	Class ReplicatedShipPartCustomizationComponent*              CustomizationComponent;                            // 0x448(0x8)
	Class RepairableComponent*                                   RepairableComponentFirst;                          // 0x450(0x8)
	Class RepairableComponent*                                   RepairableComponentSecond;                         // 0x458(0x8)
	Class RepairableComponent*                                   RepairableComponentThird;                          // 0x460(0x8)
	Class ShipDamageableComponent*                               DamageableComponent;                               // 0x468(0x8)
	Class MastFlammableComponent*                                MastFlammableComponent;                            // 0x470(0x8)
	float                                                        AngleBlend;                                        // 0x478(0x4)
	float                                                        LoweredBlend;                                      // 0x47c(0x4)
	float                                                        LoweringSpeed;                                     // 0x480(0x4)
	float                                                        RaisingSpeed;                                      // 0x484(0x4)
	float                                                        TurnSpeed;                                         // 0x488(0x4)
	float                                                        MaxTurnAngle;                                      // 0x48c(0x4)
	float                                                        SailOffsetFromMast;                                // 0x490(0x4)
	float                                                        SailWidth;                                         // 0x494(0x4)
	float                                                        SailHeight;                                        // 0x498(0x4)
	float                                                        SailStartOffset;                                   // 0x49c(0x4)
	Struct Vector                                                LookAtPosLow;                                      // 0x4a0(0xc)
	Struct Vector                                                LookAtPosHigh;                                     // 0x4ac(0xc)
	Class WwiseObjectPoolWrapper*                                SailAudioPool;                                     // 0x4b8(0x8)
	Class WwiseEvent*                                            AmbientSailFlapsSfx;                               // 0x4c0(0x8)
	Class WwiseEvent*                                            AmbientSailFlapsStopSfx;                           // 0x4c8(0x8)
	Class WwiseEvent*                                            PerfectSailInflationOneShot;                       // 0x4d0(0x8)
	Class WwiseEvent*                                            SailLostPerfectWindOneShot;                        // 0x4d8(0x8)
	struct FName                                                 InflationRTPC;                                     // 0x4e0(0x8)
	struct FName                                                 SailLengthRTPC;                                    // 0x4e8(0x8)
	float                                                        ClientSailBlendSpeed;                              // 0x4f0(0x4)
	TArray<class StaticMeshComponent*>                           YardArms;                                          // 0x4f8(0x10)
	struct FName                                                 TelemetryIdentifier;                               // 0x508(0x8)
	bool                                                         MastShouldBeFractured;                             // 0x510(0x1)
	Struct MastCollisionProfiles                                 MastCollisionProfiles;                             // 0x514(0x28)
	Struct MastPhysicsComponents                                 MastPhysicsComponents;                             // 0x540(0x38)
	Class StaticMesh*                                            MastIntactMesh;                                    // 0x578(0x8)
	Class StaticMesh*                                            MastFractureMeshBottom;                            // 0x580(0x8)
	float                                                        MastFractureMeshBottomScale;                       // 0x588(0x4)
	float                                                        MastFractureMeshOriginalScale;                     // 0x58c(0x4)
	Class StaticMesh*                                            MastFractureMeshTop;                               // 0x590(0x8)
	Class ParticleSystem*                                        DamageParticleSystem;                              // 0x598(0x8)
	float                                                        HingeHeight;                                       // 0x5a0(0x4)
	float                                                        HingeDistanceFromCentre;                           // 0x5a4(0x4)
	float                                                        HingeDirectionAngle;                               // 0x5a8(0x4)
	float                                                        MaxFallAngle;                                      // 0x5ac(0x4)
	float                                                        MastLiftingSpeed;                                  // 0x5b0(0x4)
	bool                                                         OverrideSailLengthWhenFalling;                     // 0x5b4(0x1)
	float                                                        MaxFallenSailLength;                               // 0x5b8(0x4)
	float                                                        SailFoldingSpeed;                                  // 0x5bc(0x4)
	bool                                                         OverrideSailAngleWhenFalling;                      // 0x5c0(0x1)
	float                                                        DesiredFallingSailAngle;                           // 0x5c4(0x4)
	float                                                        SailTwistingSpeed;                                 // 0x5c8(0x4)
	Class MastHinge*                                             Hinge;                                             // 0x5d0(0x8)
	Struct WeightedProbabilityRangeOfRanges                      MastImpactForceToApplyToShip;                      // 0x5d8(0x30)
	float                                                        MastImpactForceModifierToApplyToKrakenWrappedShip; // 0x608(0x4)
	float                                                        MastImpactHeightLocation;                          // 0x60c(0x4)
	class                                                        CameraShake;                                       // 0x610(0x8)
	float                                                        CameraShakeInnerRadius;                            // 0x618(0x4)
	float                                                        CameraShakeOuterRadius;                            // 0x61c(0x4)
	bool                                                         PreviewMastFallenPosition;                         // 0x620(0x1)
	TArray<class RepairableComponent*>                           RepairableComponents;                              // 0x628(0x10)
	Struct MastDamageAudioParams                                 DamageAudioParameters;                             // 0x638(0xb0)
	Class TetherCustomisationComponent*                          TetherCustomisationComponent;                      // 0x6f0(0x8)
	TArray<class ChildActorComponent*>                           LinkedSails;                                       // 0x798(0x10)
	Struct IntentPredictor                                       LengthIntentPredictor;                             // 0x7a8(0x1c)
	Struct IntentPredictor                                       AngleIntentPredictor;                              // 0x7c4(0x1c)
	Struct IntentPredictor                                       MastHoistIntentPredictor;                          // 0x7e0(0x1c)
	bool                                                         MastHoistingControlSchemeActive;                   // 0x7fc(0x1)
	Struct ObjectMessagingHandle                                 SailGotPerfectWindEventHandle;                     // 0x800(0x48)
	Struct ObjectMessagingHandle                                 SailLostPerfectWindEventHandle;                    // 0x848(0x48)
	Struct ObjectMessagingHandle                                 MastRepairStoppedHandle;                           // 0x890(0x48)
	Struct WwiseEmitter                                          SailsAudioEmitter;                                 // 0x8e8(0x20)
	float                                                        ServerAngleRatio;                                  // 0x908(0x4)
	float                                                        ServerLoweredProportion;                           // 0x90c(0x4)
	byte                                                         ForceBillowingState;                               // 0x910(0x1)
	float                                                        ServerMastFallingProportion;                       // 0x914(0x4)
	bool                                                         AllowedToFall;                                     // 0x934(0x1)
	bool                                                         PlayAudio;                                         // 0x935(0x1)
	bool                                                         IsCursed;                                          // 0x970(0x1)
};


// Size 0x30
class SailAngle: public SailManipulator
{
public:
	float                                                        RopeUVSpeed;                                       // 0x7d0(0x4)
	Class RiggingSystemComponent*                                Rigging;                                           // 0x7d8(0x8)
	int                                                          RiggingLeftRopeIndex;                              // 0x7e0(0x4)
	int                                                          RiggingRightRopeIndex;                             // 0x7e4(0x4)
	bool                                                         PlayAudio;                                         // 0x7e8(0x1)
};


// Size 0x0
class PrimaryInteractNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0
class InteractOrDisengageNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0
class SecondaryInteractNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0
class CompositeQuickSwitchWeaponSecondaryInteractNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0
class PrimaryItemUseReleasedNotificationInputId: public PrimaryItemUsePressedNotificationInputId
{
public:
};


// Size 0x0
class SecondaryItemUseReleasedNotificationInputId: public SecondaryItemUsePressedNotificationInputId
{
public:
};


// Size 0x0
class SecondaryInteractReleasedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0
class PrimaryInteractReleasedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0
class AbsorbsLiquidInterface: public Interface
{
public:
};


// Size 0x10
class AbsorbsLiquidComponent: public ActorComponent
{
public:
};


// Size 0x10
class AchievementDefinitionDataAsset: public DataAsset
{
public:
	TArray<Struct AchievementDefinition>                         AchievementDefintions;                             // 0x28(0x10)
};


// Size 0x0
class ActionRulesBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0
class ActionRuleTestActor: public Actor
{
public:
};


// Size 0x0
class RadialContextBase: public Object
{
public:
};


// Size 0x18
class ActionStateRadialContext: public RadialContextBase
{
public:
	TArray<Class TargetActionStates>                             TargetActionStates;                                // 0x28(0x10)
	bool                                                         AreDockablePhrasesRequired;                        // 0x38(0x1)
};


// Size 0xa8
class ActorCoherentViewComponent: public CoherentUIGTComponent
{
public:
	struct FName                                                 TargetPrimitiveName;                               // 0x3e8(0x8)
};


// Size 0x0
class ActorRelevancyTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0
class AddFogBankAvoidanceAreaStep: public TaleQuestStep
{
public:
};


// Size 0x8
class FogBankManager: public Actor
{
public:
	Class FogBankManagerDataAsset*                               FogBankManagerDataAsset;                           // 0x3c8(0x8)
};


// Size 0x18
class FogBankTaleService: public TaleQuestService
{
public:
	Class FogBankTaleServiceDesc*                                Desc;                                              // 0x60(0x8)
	TArray<Struct FogBankManagerFogAvoidanceArea>                FogBankAvoidanceAreas;                             // 0x68(0x10)
};


// Size 0x0
class FogBankTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x60
class AddFogBankAvoidanceAreaStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableVector                                   Location;                                          // 0x80(0x30)
	Struct QuestVariableFloat                                    Radius;                                            // 0xb0(0x30)
};


// Size 0x8
class AddMechanismTriggerStep: public TaleQuestStep
{
public:
	Class AddMechanismTriggerStepDesc*                           Desc;                                              // 0x98(0x8)
};


// Size 0x60
class AddMechanismTriggerStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    Action;                                            // 0x80(0x30)
	Struct QuestVariableActor                                    Trigger;                                           // 0xb0(0x30)
};


// Size 0x10
class AddOpenContainerActionRuleComponent: public ActorComponent
{
public:
	class                                                        NotificationInputId;                               // 0xc8(0x8)
	byte                                                         DisplayPriority;                                   // 0xd0(0x1)
};


// Size 0x10
class AddReloadAmmoActionRuleComponent: public ActorComponent
{
public:
	class                                                        NotificationInputId;                               // 0xc8(0x8)
	byte                                                         DisplayPriority;                                   // 0xd0(0x1)
};


// Size 0x100
class AdjustableWaterLevelPuzzle: public Actor
{
public:
	Class SceneComponent*                                        RootComp;                                          // 0x3d0(0x8)
	Class ChildActorComponent*                                   WaterVolumeComponent;                              // 0x3d8(0x8)
	Class VariableFillRateWaterVolume*                           WaterVolumeActor;                                  // 0x3e0(0x8)
	TArray<Struct WaterPuzzleWaterLevel>                         WaterLevels;                                       // 0x3e8(0x10)
	int                                                          DefaultWaterLevelIndex;                            // 0x3f8(0x4)
	Class CurveFloat*                                            FillCurve;                                         // 0x400(0x8)
	Class CurveFloat*                                            DrainCurve;                                        // 0x408(0x8)
	Class CurveFloat*                                            ResetCurve;                                        // 0x410(0x8)
	float                                                        PuzzleResetTimeout;                                // 0x418(0x4)
	Struct WaterPuzzleRepData                                    ReppedData;                                        // 0x41c(0x8)
};


// Size 0x28
class AdjustableWaterLevelPuzzleAudioParams: public DataAsset
{
public:
	Class WwiseObjectPoolWrapper*                                WaterLevelPuzzlePool;                              // 0x28(0x8)
	Class WwiseEvent*                                            PuzzleWaterRiseStartEvent;                         // 0x30(0x8)
	Class WwiseEvent*                                            PuzzleWaterRiseEndEvent;                           // 0x38(0x8)
	Class WwiseEvent*                                            PuzzleWaterFallStartEvent;                         // 0x40(0x8)
	Class WwiseEvent*                                            PuzzleWaterFallEndEvent;                           // 0x48(0x8)
};


// Size 0x0
class AdventureSettings: public DeveloperSettings
{
public:
};


// Size 0x0
class AgitatedAIStrategyId: public AIStrategyId
{
public:
};


// Size 0x0
class AIBuffStatus: public StatusBase
{
public:
};


// Size 0x18
class AIDockableObject: public ControllableObject
{
public:
	class                                                        InteractableType;                                  // 0x518(0x8)
	float                                                        InteractableOffset;                                // 0x520(0x4)
};


// Size 0x0
class AIDockableWheel: public AIDockableObject
{
public:
};


// Size 0x10
class AIEmergentCaptainSpawner: public AIPerCrewSpawner
{
public:
	Class NamedAIDataAsset*                                      NamedAIDataAsset;                                  // 0x580(0x8)
};


// Size 0x18
class AIFormWithVFXComponent: public AthenaAIFormComponent
{
public:
	Class ParticleSystem*                                        ParticlesTemplate;                                 // 0x138(0x8)
	Class ParticleSystemComponent*                               ParticleSystemComponent;                           // 0x140(0x8)
	float                                                        ParticleActivationDelay;                           // 0x148(0x4)
	Struct TimerHandle                                           ActivationTimerHandle;                             // 0x14c(0x4)
};


// Size 0x10
class AIFormWithVFXDataAsset: public AthenaAIFormDataAsset
{
public:
	Class ParticleSystem*                                        ParticlesTemplate;                                 // 0x90(0x8)
	float                                                        ParticleActivationDelay;                           // 0x98(0x4)
};


// Size 0x0
class AIKnockbackActionStateId: public ActionStateId
{
public:
};


// Size 0x28
class LoadoutAsset: public DataAsset
{
public:
	Struct ItemLoadout                                           ItemLoadout;                                       // 0x28(0x20)
	struct FName                                                 FeatureName;                                       // 0x48(0x8)
};


// Size 0x10
class AILoadoutWithNonStoreableAsset: public LoadoutAsset
{
public:
	class                                                        NonStoreableItem;                                  // 0x58(0x8)
};


// Size 0x40
class AimSensitivityComponent: public ActorComponent
{
public:
};


// Size 0x0
class AimWeaponPressedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0
class AimWeaponReleasedNotificationInputId: public AimWeaponPressedNotificationInputId
{
public:
};


// Size 0x0
class AIOnShipManagerInterface: public Interface
{
public:
};


// Size 0x20
class AIOnShipManagerComponent: public ActorComponent
{
public:
	Class AIProximityPlayerTracker*                              AIProximityPlayerTracker;                          // 0xd0(0x8)
	TArray<class AIFixedWavesSpawner*>                           AIOnShipAIFixedWavesSpawners;                      // 0xd8(0x10)
};


// Size 0x0
class ProjectileWeaponFiringIntentionInterface: public Interface
{
public:
};


// Size 0x38
class AIProjectileWeaponFiringIntentionComponent: public ActorComponent
{
public:
	Class Pawn*                                                  PawnOwner;                                         // 0xd0(0x8)
	Class AthenaAIControllerBase*                                AIController;                                      // 0xd8(0x8)
	float                                                        DefaultHitChance;                                  // 0xfc(0x4)
};


// Size 0x0
class AIQuickDeathInterface: public Interface
{
public:
};


// Size 0x0
class AIShipCaptainActionStateId: public ActionStateId
{
public:
};


// Size 0x160
class ItemSpawnComponent: public SceneComponent
{
public:
	bool                                                         SpawnOnStart;                                      // 0x2e0(0x1)
	Struct ItemSpawnParams                                       SpawnParams;                                       // 0x2e8(0x28)
	Class WeightedItemDescSpawnDataAsset*                        ReferencedSpawnDistributionAsset;                  // 0x310(0x8)
	TArray<Struct ItemSpawnTransform>                            SpawnTransforms;                                   // 0x318(0x10)
	TArray<Struct ItemSpawnTransformWithRandomQuantity>          SpawnTransformsWithRandomQuantities;               // 0x328(0x10)
	struct FName                                                 FeatureToggle;                                     // 0x338(0x8)
	byte                                                         SpawnSource;                                       // 0x340(0x1)
	float                                                        SpawnRate;                                         // 0x344(0x4)
	bool                                                         DestroyProxiesOnEndPlay;                           // 0x348(0x1)
	bool                                                         SpawnWithPhysicsEnabled;                           // 0x349(0x1)
	bool                                                         DoNotAttachToOwnerWhenSpawned;                     // 0x34a(0x1)
	bool                                                         DropItemsOnSpawn;                                  // 0x34b(0x1)
	bool                                                         DropItemsUsingPriorityAIDropParams;                // 0x34c(0x1)
	TArray<Struct SpawnInstance>                                 SpawnList;                                         // 0x350(0x10)
	TArray<Struct SpawnInstance>                                 SingleItemInstances;                               // 0x360(0x10)
	TArray<Struct SpawnedItem>                                   SpawnedItems;                                      // 0x370(0x10)
};


// Size 0x50
class AIShipItemSpawnComponent: public ItemSpawnComponent
{
public:
	bool                                                         SpawnAlways;                                       // 0x440(0x1)
	bool                                                         SpawnForBattleFinalShip;                           // 0x441(0x1)
	bool                                                         SpawnForPassiveShip;                               // 0x442(0x1)
	bool                                                         SpawnForAggressiveShip;                            // 0x443(0x1)
};


// Size 0x0
class EmotesInterface: public Interface
{
public:
};


// Size 0xb8
class LookAtOffsetComponent: public ActorComponent
{
public:
};


// Size 0x0
class CharacterMeshInterface: public Interface
{
public:
};


// Size 0x0
class CharacterInterface: public CharacterMeshInterface
{
public:
};


// Size 0x48
class FireSettingsDataAsset: public DataAsset
{
public:
	float                                                        CharacterOnFireEffectRadius;                       // 0x28(0x4)
	byte                                                         TraceChannel;                                      // 0x2c(0x1)
	float                                                        CharacterToCharacterPropagationInterval;           // 0x30(0x4)
	float                                                        MaxInitialPropagationOffset;                       // 0x34(0x4)
	Struct Status                                                BurnStatus;                                        // 0x38(0x18)
	Struct Status                                                FirePropagationStatus;                             // 0x50(0x18)
};


// Size 0x160
class CharacterFlammableComponent: public ActorFlammableComponent
{
public:
	float                                                        FireFalloffDuration;                               // 0x140(0x4)
	float                                                        FireRateOfFalloffInRain;                           // 0x144(0x4)
	float                                                        FireFalloffMultiplier;                             // 0x148(0x4)
	struct FName                                                 VfxSocketName;                                     // 0x14c(0x8)
	Struct Transform                                             SocketRelativeOffset;                              // 0x160(0x30)
	Class World*                                                 CachedWorld;                                       // 0x218(0x8)
	Class FireSettingsDataAsset*                                 FireSettingsAsset;                                 // 0x228(0x8)
};


// Size 0x0
class CharacterFootImpactMeshInterface: public Interface
{
public:
};


// Size 0x0
class ObscuredVisionInterface: public Interface
{
public:
};


// Size 0x0
class PlayerPrivilegeInterface: public Interface
{
public:
};


// Size 0x0
class PirateDescInterface: public Interface
{
public:
};


// Size 0x0
class CloudDomeInterface: public Interface
{
public:
};


// Size 0x2e8
class CloudDome: public Actor
{
public:
	Class LocalPlayer*                                           LocalPlayer;                                       // 0x480(0x8)
};


// Size 0x5d0
class AthenaCharacter: public Character
{
public:
	Class LookAtOffsetComponent*                                 LookAtOffsetComponent;                             // 0x700(0x8)
	Class AnimationDataStoreAsset*                               AnimationDataStoreAsset;                           // 0x708(0x8)
	Class AthenaAnimationSittingDataAsset*                       SittingAnimationDataAssets;                        // 0x710(0x8)
	Class AthenaCharacterMovementComponent*                      AthenaCharacterMovementComponent;                  // 0x718(0x8)
	Struct Docker                                                Docker;                                            // 0x720(0x50)
	Class ActionStateMachineComponent*                           ActionStateMachineComponent;                       // 0x770(0x8)
	Class ActionStatePriorityTableData*                          ActionStatePriorityTableData;                      // 0x778(0x8)
	class                                                        ActionStateCreatorDefinition;                      // 0x780(0x8)
	Struct ObjectMessagingDispatcher                             ObjectMessageDispatcher;                           // 0x788(0xa0)
	Class WieldableItemSetComponent*                             WieldableItemSetComponent;                         // 0x828(0x8)
	Class WieldedItemComponent*                                  WieldedItemComponent;                              // 0x830(0x8)
	Class SceneComponent*                                        MeshAdjustmentComponent;                           // 0x838(0x8)
	Class InventoryManipulatorComponent*                         InventoryManipulatorComponent;                     // 0x840(0x8)
	Class LoadoutComponent*                                      LoadoutComponent;                                  // 0x848(0x8)
	Class ItemLoadoutComponent*                                  ItemLoadoutComponent;                              // 0x850(0x8)
	Class HealthComponent*                                       HealthComponent;                                   // 0x858(0x8)
	Class AthenaCharacterStateManagerComponent*                  StateManagerComponent;                             // 0x860(0x8)
	Class RewindComponent*                                       RewindComponent;                                   // 0x868(0x8)
	Class ActorDamageableComponent*                              ActorDamageableComponent;                          // 0x870(0x8)
	Class CharacterHitReactionComponent*                         CharacterHitReactionComponent;                     // 0x878(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitterComponent;                   // 0x880(0x8)
	Class MeleeAttackProcessorComponent*                         MeleeAttackProcessor;                              // 0x888(0x8)
	Class HitDetectionComponent*                                 HitDetectionComponent;                             // 0x890(0x8)
	Class AthenaCharacterKnockbackComponent*                     KnockBackComponent;                                // 0x898(0x8)
	Class AthenaCharacterDodgeComponent*                         DodgeComponent;                                    // 0x8a0(0x8)
	Class CharacterAINoiseEventComponent*                        CharacterAINoiseEventComponent;                    // 0x8a8(0x8)
	Class ActionRulesComponent*                                  PrivateActionRulesComponent;                       // 0x8b0(0x8)
	Class ShipTrackerComponent*                                  ShipTrackerComponent;                              // 0x8b8(0x8)
	Class WatercraftTrackerComponent*                            WatercraftTrackerComponent;                        // 0x8c0(0x8)
	Class ItemLoaderComponent*                                   ItemLoaderComponent;                               // 0x8c8(0x8)
	Class RetractableCharacterComponent*                         RetractableCharacterComponent;                     // 0x8d0(0x8)
	Class ResourceProviderComponent*                             ResourceProviderComponent;                         // 0x8d8(0x8)
	Class CharacterFlammableComponent*                           CharacterFlammableComponent;                       // 0x8e0(0x8)
	Class SoakableComponent*                                     SoakableComponent;                                 // 0x8e8(0x8)
	Class WaterExposureComponent*                                WaterExposureComponent;                            // 0x8f0(0x8)
	Class ShelteredComponent*                                    ShelteredComponent;                                // 0x8f8(0x8)
	Class BoxedRpcDispatcherComponent*                           BoxedRpcDispatcherComponent;                       // 0x900(0x8)
	Class CosmeticItemAnimationComponent*                        CosmeticItemAnimationComponent;                    // 0x908(0x8)
	Class InteractionPreventionComponent*                        InteractionPreventionComponent;                    // 0x910(0x8)
	Class MovementInterferenceComponent*                         InterferenceComponent;                             // 0x938(0x8)
	Class WaterInteractionComponent*                             WaterInteractionComponent;                         // 0x940(0x8)
	class                                                        ThirdPersonAnimSetDataId;                          // 0x948(0x8)
	bool                                                         OverrideEncroachesBlockingGeometry;                // 0x950(0x1)
	byte                                                         OverrideEncroachesBlockingGeometryChannel;         // 0x951(0x1)
	struct FName                                                 OverrideFloorSweepCollisionProfileName;            // 0x954(0x8)
	float                                                        MovementThresholdToRecordRewindTransform;          // 0x97c(0x4)
	Class AnimationDataStore*                                    AnimationDataStore;                                // 0x9f8(0x8)
	Class PlayerState*                                           OldPlayerState;                                    // 0xa40(0x8)
	float                                                        RelativeTargetYawOnMovingBase;                     // 0xa84(0x4)
	float                                                        SmoothYawOnMovingBaseTime;                         // 0xab8(0x4)
	int                                                          RandomAnimationSeed;                               // 0xabc(0x4)
	bool                                                         RandomBool;                                        // 0xac8(0x1)
	Class SkeletalMeshSocket*                                    CameraSocket;                                      // 0xae0(0x8)
	TArray<class InputComponent*>                                RegisteredInputComponents;                         // 0xb30(0x10)
};


// Size 0x0
class BriggableInterface: public Interface
{
public:
};


// Size 0x0
class SwimAttackableInterface: public Interface
{
public:
};


// Size 0x0
class PlayerManagerServiceInterface: public Interface
{
public:
};


// Size 0x0
class CloudDomeServiceInterface: public Interface
{
public:
};


// Size 0x10c0
class AthenaPlayerCharacter: public AthenaCharacter
{
public:
	Class SceneComponent*                                        FirstPersonMeshOffsetComponent;                    // 0xcc8(0x8)
	Class SkeletalMeshComponent*                                 FirstPersonMesh;                                   // 0xcd0(0x8)
	Class AthenaCameraComponent*                                 FirstPersonCamera;                                 // 0xcd8(0x8)
	TArray<class ParticleSystemComponent*>                       FirstPersonParticleComponents;                     // 0xce0(0x10)
	Class AthenaCameraComponent*                                 ThirdPersonCamera;                                 // 0xcf0(0x8)
	TArray<class ParticleSystemComponent*>                       ThirdPersonParticleComponents;                     // 0xcf8(0x10)
	Class AthenaCameraComponent*                                 SpringArmCamera;                                   // 0xd08(0x8)
	Class LookAtEmoteCameraComponent*                            LookAtEmoteCameraComponent;                        // 0xd10(0x8)
	Class AthenaSpringArmComponent*                              SpringArm;                                         // 0xd18(0x8)
	Class ChildActorComponent*                                   LocalCloudDome;                                    // 0xd20(0x8)
	Class CharacterInteractionComponent*                         InteractionComponent;                              // 0xd28(0x8)
	Class ClimbingComponent*                                     ClimbingComponent;                                 // 0xd30(0x8)
	Class DrunkennessComponent*                                  DrunkennessComponent;                              // 0xd38(0x8)
	Class StaggerComponent*                                      StaggerComponent;                                  // 0xd40(0x8)
	Class DrowningComponent*                                     DrowningComponent;                                 // 0xd48(0x8)
	Class RumbleHandlerComponent*                                RumbleHandlerComponent;                            // 0xd50(0x8)
	Class ScreenSpaceVfxComponent*                               ScreenSpaceVfxComponent;                           // 0xd58(0x8)
	Class TreasureMapCollectionComponent*                        TreasureMapCollectionComponent;                    // 0xd60(0x8)
	Class PhrasesRadialComponent*                                PhrasesRadialComponent;                            // 0xd68(0x8)
	Class QuickInventoryComponent*                               QuickInventoryComponent;                           // 0xd70(0x8)
	Class PointOfInterestTrackerComponent*                       PointOfInterestTrackerComponent;                   // 0xd78(0x8)
	Class LimpingComponent*                                      LimpingComponent;                                  // 0xd80(0x8)
	Class PacingComponent*                                       PacingComponent;                                   // 0xd88(0x8)
	Class BurpComponent*                                         BurpComponent;                                     // 0xd90(0x8)
	Class MeleeAttackLockOnComponent*                            MeleeLockOnComponent;                              // 0xd98(0x8)
	Class DeathSelfInteractionComponent*                         DeathSelfInteractionComponent;                     // 0xda0(0x8)
	Class WaterSlidePlayerComponent*                             WaterSlidePlayerComponent;                         // 0xda8(0x8)
	Class ReviveDebugComponent*                                  ReviveDebugComponent;                              // 0xdb0(0x8)
	Class FlashbangEffectComponent*                              FlashbangEffectComponent;                          // 0xdb8(0x8)
	Class WorldLocationVisitorComponent*                         WorldLocationVisitorComponent;                     // 0xdc0(0x8)
	Class MeleeAttackLockOnComponentSettings*                    MeleeAttackLockOnSettings;                         // 0xdc8(0x8)
	Class StatusEffectManagerComponent*                          StatusEffectManagerComponent;                      // 0xdd0(0x8)
	Class StatusEffectPersistenceComponent*                      StatusEffectPersistenceComponent;                  // 0xdd8(0x8)
	Class PlayerCurseComponent*                                  PlayerCurseComponent;                              // 0xde0(0x8)
	Class MaterialStatusSusceptibilityComponent*                 MaterialStatusSusceptibilityComponent;             // 0xde8(0x8)
	Class HealthRegenerationPoolComponent*                       HealthRegenerationPoolComponent;                   // 0xdf0(0x8)
	Class SicknessComponent*                                     SicknessComponent;                                 // 0xdf8(0x8)
	Class RewindComponent*                                       PlayerViewRewindComponent;                         // 0xe00(0x8)
	Class CapsuleComponent*                                      ProjectileTraceHitVolume;                          // 0xe08(0x8)
	Class PlayerMerchantContractsComponent*                      PlayerMerchantContractsComponent;                  // 0xe10(0x8)
	Class PlayerShroudBreakerTrackerComponent*                   PlayerShroudBreakerTrackerComponent;               // 0xe18(0x8)
	Class PetOwnerComponent*                                     PetOwnerComponent;                                 // 0xe20(0x8)
	Class AISpawnContextContainerComponent*                      SpawnContextContainerComponent;                    // 0xe28(0x8)
	Class RadialManagerComponent*                                RadialManager;                                     // 0xe30(0x8)
	Class StreamingLocationComponent*                            StreamingLocationComponent;                        // 0xe38(0x8)
	Class EquipClothingComponent*                                EquipClothingComponent;                            // 0xe40(0x8)
	float                                                        CameraFOVWhenSprinting;                            // 0xe48(0x4)
	Class CurveVector*                                           ApproximateCamPitchToLocalCamOffsetCurve;          // 0xe50(0x8)
	Struct WalkConditionsParams                                  WalkConditionParams;                               // 0xe58(0x8)
	Struct SprintConditionsParams                                ServerSprintConditionParams;                       // 0xe60(0xc)
	Struct SprintConditionsParams                                ClientSprintConditionParams;                       // 0xe6c(0xc)
	float                                                        SprintingServerTimeTolerance;                      // 0xe78(0x4)
	float                                                        PostSprintResetTime;                               // 0xe7c(0x4)
	Class AthenaSpringArmComponentParams*                        EmoteSpringArmParameters;                          // 0xe80(0x8)
	Class AthenaSpringArmComponentParams*                        DeathSpringArmParameters;                          // 0xe88(0x8)
	Class EmotesRadialDataAsset*                                 EmotesRadialDataAsset;                             // 0xe90(0x8)
	bool                                                         AllowAnimationTickAggregation;                     // 0xe98(0x1)
	Struct AchievementKillOpponentFromBehindWithBlunderbuss      AchievementKillOpponentFromBehindWithBlunderbuss;  // 0xe9c(0x4)
	Struct AchievementHeavyAttackRivalOffTheirShip               AchievementHeavyAttackRivalOffTheirShip;           // 0xea0(0x10)
	Struct AchievementBlockThenHitAndGetBlockedThenTakeHit       AchievementBlockThenHitAndGetBlockedThenTakeHit;   // 0xeb0(0x10)
	Struct AchievementHaveADrinkWithAnotherCrewAtAnOutpost       AchievementHaveADrinkWithAnotherCrewAtAnOutpost;   // 0xec0(0x20)
	Struct AchievementKillOpponentInContest                      AchievementKillOpponentInContest;                  // 0xee0(0x8)
	class                                                        ConditionalStatsTriggerForKillingAnotherPlayer;    // 0xee8(0x8)
	Class AICreatureMovementModifierParamsDataAsset*             PirateLegendHideoutPetMovementData;                // 0xef0(0x8)
	Class AICreatureMovementModifierParamsDataAsset*             OnShipPetMovementData;                             // 0xef8(0x8)
	Class AsyncLoadoutRepairComponent*                           RepairComponent;                                   // 0xf00(0x8)
	Class SeasonProgressionUIComponent*                          SeasonUIComponent;                                 // 0xf08(0x8)
	Class AimAssistComponent*                                    AimAssistComponent;                                // 0xf10(0x8)
	Class SequencerCameraDockingComponent*                       SequencerCameraDockingComponent;                   // 0xf18(0x8)
	Class EmotePropData*                                         EmotePropData;                                     // 0xf20(0x8)
	class                                                        FirstPersonAnimSetDataId;                          // 0xfd8(0x8)
	Class AnimationDataStoreWeakReferenceAsset*                  FirstPersonAnimationDataStoreWeakReferencesAsset;  // 0xfe0(0x8)
	byte                                                         CharacterType;                                     // 0xfe8(0x1)
	bool                                                         IsWearingSkeletonCurseCached;                      // 0x1009(0x1)
	bool                                                         IsWearingGhostCurseCached;                         // 0x100a(0x1)
	Class ClothingLoadoutComponent*                              ClothingLoadoutComponent;                          // 0x1a38(0x8)
	Class PetLoadoutComponent*                                   PetLoadoutComponent;                               // 0x1a40(0x8)
	Class VoyageParticipantComponent*                            PrimaryVoyageParticipantComponent;                 // 0x1a48(0x8)
	Class VoyageParticipantComponent*                            TaleVoyageParticipantComponent;                    // 0x1a50(0x8)
	Class VoyageParticipantComponent*                            EmergentVoyageParticipantComponent;                // 0x1a58(0x8)
	Class PlayerWorldLocationComponent*                          PlayerWorldLocationComponent;                      // 0x1a60(0x8)
	Class ChainLightningReceiverComponent*                       ChainLightningReceiverComponent;                   // 0x1a68(0x8)
	Struct AthenaPlayerCharacterModelSwap                        PendingModelSwap;                                  // 0x1a70(0x68)
	struct FName                                                 ReplicatedOverrideAnimationEntry;                  // 0x1af8(0x8)
	bool                                                         ReplicatedEmoteExitAllowed;                        // 0x1b09(0x1)
	bool                                                         FinishedWaitingForSpawn;                           // 0x1b88(0x1)
	bool                                                         AutoFloatInWater;                                  // 0x1bba(0x1)
	bool                                                         ReplicatedIsSprinting;                             // 0x1bbc(0x1)
	float                                                        AutoMoveCancelThreshold;                           // 0x1bd8(0x4)
	int                                                          ReplicatedOverridePirateDescSeed;                  // 0x1bdc(0x4)
	bool                                                         PreventJumping;                                    // 0x1be0(0x1)
	bool                                                         StopMovementAndPreventSwimming;                    // 0x1be1(0x1)
};


// Size 0xc8
class AIShipPlayerTracker: public AISpawnerPlayerTracker
{
public:
};


// Size 0x30
class AIShipRegionPlayerTracker: public AISpawnerPlayerTracker
{
public:
};


// Size 0x0
class AIShipWheelAIInteractableType: public AIInteractableType
{
public:
};


// Size 0x20
class AISignalTargetWaveSpawner: public AIWaveSpawner
{
public:
	TArray<Struct StringAssetReference>                          SignalMechanismAssetRefs;                          // 0x570(0x10)
};


// Size 0x30
class AISpawnContextTaleQuestService: public TaleQuestService
{
public:
	Class AISpawnContextTaleQuestServiceDesc*                    Desc;                                              // 0x60(0x8)
};


// Size 0x40
class AISpawnContextTaleQuestServiceDesc: public TaleQuestServiceDesc
{
public:
	struct FName                                                 AISpawnContextName;                                // 0x28(0x8)
	bool                                                         SpecificToIsland;                                  // 0x30(0x1)
	Struct QuestVariableAsset                                    ActorLocatedOnIsland;                              // 0x38(0x30)
};


// Size 0x20
class AIWieldableUseInputComponent: public AthenaCharacterBaseInputComponent
{
public:
};


// Size 0x0
class AlcoholStatus: public StatusBase
{
public:
};


// Size 0x0
class AllianceBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0xe0
class AllianceService: public Actor
{
public:
	Class AllianceSettingsAsset*                                 Settings;                                          // 0x3d0(0x8)
	TArray<Struct Alliance>                                      Alliances;                                         // 0x3d8(0x10)
	Class AllianceServiceTelemetryComponent*                     TelemetryComponent;                                // 0x3e8(0x8)
	TArray<Struct CrewAllianceJoinStatus>                        CrewAllianceJoinStatuses;                          // 0x3f0(0x10)
};


// Size 0x40
class AllianceServiceTelemetryComponent: public ActorComponent
{
public:
};


// Size 0x28
class AllianceSettingsAsset: public DataAsset
{
public:
	float                                                        MaximumAllianceDistance;                           // 0x28(0x4)
	float                                                        PollDelay;                                         // 0x2c(0x4)
	class                                                        OfferFlag;                                         // 0x30(0x8)
	class                                                        AcceptFlag;                                        // 0x38(0x8)
	class                                                        LeaveFlag;                                         // 0x40(0x8)
	Class AlliancePennantAsset*                                  AlliancePennantAsset;                              // 0x48(0x8)
};


// Size 0x8
class AlwaysRelevantLightweightActor: public Actor
{
public:
	Class Actor*                                                 OwningActor;                                       // 0x3c8(0x8)
};


// Size 0x30
class NameplateComponent: public SceneComponent
{
public:
	float                                                        FadeTime;                                          // 0x2e0(0x4)
	Class SkeletalMeshSocket*                                    NameplateSocket;                                   // 0x2e8(0x8)
};


// Size 0xa0
class PlayerNameplateComponent: public NameplateComponent
{
public:
	float                                                        VisibleFromWorldDistance;                          // 0x318(0x4)
	float                                                        VisibleUntilWorldDistanceCrew;                     // 0x31c(0x4)
	float                                                        VisibleUntilWorldDistanceNonCrew;                  // 0x320(0x4)
	float                                                        EmoteForcedRevealTime;                             // 0x324(0x4)
	Class AthenaPlayerCharacter*                                 PlayerCharacter;                                   // 0x330(0x8)
};


// Size 0x20
class AlwaysRelevantPlayerNameplateComponent: public PlayerNameplateComponent
{
public:
	Class AthenaPlayerState*                                     PlayerStatePtr;                                    // 0x3a8(0x8)
};


// Size 0x70
class AlwaysRelevantLightweightPlayerNameplate: public AlwaysRelevantLightweightActor
{
public:
	Class AlwaysRelevantPlayerNameplateComponent*                PlayerNameplateComponent;                          // 0x3f0(0x8)
	Struct Guid                                                  OwnedActorsCrewId;                                 // 0x3f8(0x10)
	Class AthenaPlayerState*                                     PlayerStatePtr;                                    // 0x430(0x8)
	bool                                                         IsOwnerInert;                                      // 0x438(0x1)
};


// Size 0x38
class Anchor: public Actor
{
public:
	Struct Vector                                                PositionForAnchorDynamicsRelativeToAnchorActor;    // 0x3d0(0xc)
	Class BaseAnchorDynamicsDesc*                                AnchorDynamicsDesc;                                // 0x3e0(0x8)
};


// Size 0x28
class AncientAIFormComponent: public AthenaAIFormComponent
{
public:
};


// Size 0x10
class AncientAIFormDataAsset: public AthenaAIFormDataAsset
{
public:
	class                                                        AwardableComponentType;                            // 0x90(0x8)
	float                                                        TimeBeforeDespawn;                                 // 0x98(0x4)
};


// Size 0x70
class NPCHeldObjectData: public DataAsset
{
public:
	struct FName                                                 LeftHandWieldSocket;                               // 0x28(0x8)
	struct FName                                                 RightHandWieldSocket;                              // 0x30(0x8)
	struct FName                                                 DetachSocketA;                                     // 0x38(0x8)
	struct FName                                                 DetachSocketB;                                     // 0x40(0x8)
	class                                                        Object1;                                           // 0x48(0x8)
	class                                                        Object2;                                           // 0x50(0x8)
	class                                                        Object3;                                           // 0x58(0x8)
	class                                                        Object4;                                           // 0x60(0x8)
	class                                                        Object5;                                           // 0x68(0x8)
	class                                                        Object6;                                           // 0x70(0x8)
	class                                                        Object7;                                           // 0x78(0x8)
	class                                                        Object8;                                           // 0x80(0x8)
	class                                                        Object9;                                           // 0x88(0x8)
	class                                                        Object10;                                          // 0x90(0x8)
};


// Size 0x0
class AnimatedCosmeticItemInterface: public Interface
{
public:
};


// Size 0x70
class AnimatedCosmeticItemAnimationInstance: public AnimInstance
{
public:
	TArray<Struct NPCOneShotAnimationElement>                    OneShotSequences;                                  // 0x448(0x10)
	TArray<Struct NPCContinuousAnimationElement>                 ContinuousSequences;                               // 0x458(0x10)
	Class AnimInstance*                                          ParentCharacterAnimationInstance;                  // 0x468(0x8)
	Class AnimMontage*                                           CurrentPlayingMontage;                             // 0x470(0x8)
	Class AnimSequenceBase*                                      OneShot;                                           // 0x478(0x8)
	Class AnimSequenceBase*                                      ContinuousIn;                                      // 0x480(0x8)
	Class AnimSequenceBase*                                      ContinuousLoopA;                                   // 0x488(0x8)
	Class AnimSequenceBase*                                      ContinuousLoopB;                                   // 0x490(0x8)
	Class AnimSequenceBase*                                      ContinuousOut;                                     // 0x498(0x8)
};


// Size 0x28
class AnimatedStepsComponent: public ActorComponent
{
public:
	Class PoseableSkeletalMeshComponent*                         Mesh;                                              // 0xc8(0x8)
	TArray<class BoxComponent*>                                  Boxes;                                             // 0xd0(0x10)
	TArray<Struct Vector>                                        BoxOrigins;                                        // 0xe0(0x10)
};


// Size 0x38
class AnimationDataOverriderComponent: public ActorComponent
{
public:
	Struct StringAssetReference                                  AnimationDataStoreAssetReference;                  // 0xd0(0x10)
	Class AnimationDataStoreAsset*                               AnimationDataStoreAsset;                           // 0xe0(0x8)
};


// Size 0x50
class AnimNotify_AthenaPlayParticleEffect: public AnimNotify
{
public:
	Class Object*                                                PSTemplate;                                        // 0x38(0x8)
	struct FName                                                 SocketName;                                        // 0x40(0x8)
	Struct Vector                                                LocationOffset;                                    // 0x48(0xc)
	Struct Rotator                                               RotationOffset;                                    // 0x54(0xc)
	Struct Vector                                                RelativeScale;                                     // 0x60(0xc)
	Struct LinearColor                                           ColorTint;                                         // 0x6c(0x10)
	float                                                        CustomParameter;                                   // 0x7c(0x4)
	bool                                                         Attached;                                          // 0x80(0x1)
	bool                                                         KeepWorldScale;                                    // 0x80(0x1)
	bool                                                         OwnerOnlySee;                                      // 0x80(0x1)
	bool                                                         OwnerNoSee;                                        // 0x80(0x1)
	bool                                                         OwnedByWorld;                                      // 0x80(0x1)
	byte                                                         UnderwaterMode;                                    // 0x84(0x1)
	byte                                                         CustomLocalSpaceMode;                              // 0x85(0x1)
};


// Size 0x8
class AnimNotify_AthenaPlayParticleEffectWithOwnerCustomisation: public AnimNotify_AthenaPlayParticleEffect
{
public:
	class                                                        VfxCustomisationType;                              // 0x88(0x8)
};


// Size 0x8
class AnimNotify_CutSceneSubtitle: public AnimNotify
{
public:
};


// Size 0x0
class AnimNotify_DockableCutscene: public AnimNotify
{
public:
};


// Size 0x18
class AnimNotify_RumbleController: public AnimNotify
{
public:
	Class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x38(0x8)
	struct FName                                                 ForceFeedbackTag;                                  // 0x40(0x8)
	Class ForceFeedbackCondition*                                ForceFeedbackCondition;                            // 0x48(0x8)
};


// Size 0x10
class AnimNotifyAdditionalEventsWwiseEmitterComponent: public AnimNotifyWwiseEmitterComponent
{
public:
	TArray<Struct AnimNotifyWwiseObserver>                       AnimNotifyObservers;                               // 0x310(0x10)
};


// Size 0x0
class AnimNotifyQuestBookForcePageRedraw: public AnimNotify
{
public:
};


// Size 0x28
class AnimNotifyState_AthenaTimedParticleEffect: public AnimNotifyState_TimedParticleEffect
{
public:
	Struct Vector                                                RelativeScale;                                     // 0x58(0xc)
	Struct LinearColor                                           ColorTint;                                         // 0x64(0x10)
	float                                                        CustomParameter;                                   // 0x74(0x4)
	bool                                                         Attached;                                          // 0x78(0x1)
	bool                                                         KeepWorldScale;                                    // 0x78(0x1)
	byte                                                         UnderwaterMode;                                    // 0x7c(0x1)
	byte                                                         CustomLocalSpaceMode;                              // 0x7d(0x1)
};


// Size 0x50
class AnimNotifyStateQuestBookRenderingModeRequest: public AnimNotifyState
{
public:
};


// Size 0x0
class AnimNotifyStateQuestBookLeftSpreadCurrentRightSpreadNext: public AnimNotifyStateQuestBookRenderingModeRequest
{
public:
};


// Size 0x0
class AnimNotifyStateQuestBookLeftSpreadPreviousRightSpreadCurrent: public AnimNotifyStateQuestBookRenderingModeRequest
{
public:
};


// Size 0x10
class AnimNotifyTriggerPlaceableReaction: public AnimNotify
{
public:
	Struct StringAssetReference                                  PlaceableReactionToTrigger;                        // 0x38(0x10)
};


// Size 0x8
class ApplicationSettings: public Object
{
public:
	int                                                          GameLanguage;                                      // 0x28(0x4)
};


// Size 0x28
class ArenaVendorShip: public Actor
{
public:
	Class SceneComponent*                                        ArenaVendorShipRootComponent;                      // 0x3c8(0x8)
	Class ContestMerchantSpawnerComponent*                       ContestMerchantSpawnerComponent;                   // 0x3d0(0x8)
	Class GenericWorldMapMarker*                                 VendorShipWorldMarkerComponent;                    // 0x3d8(0x8)
	Class SphereComponent*                                       VendorDeadZoneComponent;                           // 0x3e0(0x8)
	float                                                        VendorShipDeadZoneRadius;                          // 0x3e8(0x4)
};


// Size 0x60
class ViewModelComponentBase: public ActorComponent
{
public:
};


// Size 0x48
class PossessionsChestViewModel: public ViewModelComponentBase
{
public:
	Struct FText                                                 AllTabLabel;                                       // 0x128(0x38)
	Struct StringAssetReference                                  AllTabIcon;                                        // 0x160(0x10)
};


// Size 0x28
class ArmoryChestViewModelComponent: public PossessionsChestViewModel
{
public:
	TArray<Class Categories>                                     Categories;                                        // 0x180(0x10)
	bool                                                         IncludeAllCategory;                                // 0x190(0x1)
};


// Size 0x0
class AshCloudAIAbilityType: public AthenaAIAbilityType
{
public:
};


// Size 0x0
class AshCloudAbilityStageParams: public AthenaAIAbilityStageParams
{
public:
};


// Size 0x18
class AshCloudAIAbility: public AthenaAIAbility
{
public:
	Class Pawn*                                                  Owner;                                             // 0x78(0x8)
	Class AshCloudAIAbilityParams*                               SetupAbilityParams;                                // 0x80(0x8)
	Class AshenLordAshCloud*                                     AshCloudInstance;                                  // 0x88(0x8)
};


// Size 0x8
class AshCloudAIAbilityParams: public AthenaAIAbilityParams
{
public:
	class                                                        AshCloudClass;                                     // 0xc8(0x8)
};


// Size 0x68
class AshenLordAIFormComponent: public AthenaAIFormComponent
{
public:
	Class WwiseEvent*                                            AshenLordVulnerabilityDamageAudioEvent;            // 0x138(0x8)
	struct FName                                                 AshenLordHeartBeatShaderParamName;                 // 0x140(0x8)
	class                                                        CameraShake;                                       // 0x168(0x8)
	float                                                        ShakeInnerRadius;                                  // 0x170(0x4)
	float                                                        ShakeOuterRadius;                                  // 0x174(0x4)
	Class MaterialInstanceDynamic*                               AshenLordDynamicMaterialInstance;                  // 0x178(0x8)
	float                                                        CachedNormalisedHealthScalar;                      // 0x180(0x4)
	bool                                                         IsInVulnerability;                                 // 0x184(0x1)
};


// Size 0x10
class AssetListDataAsset: public DataAsset
{
public:
	TArray<Struct StringAssetReference>                          AssetList;                                         // 0x28(0x10)
};


// Size 0x8
class AssignItemStep: public TaleQuestStep
{
public:
	Class AssignItemStepDesc*                                    StepDesc;                                          // 0x98(0x8)
};


// Size 0x38
class AssignItemStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableClass                                    TypeVar;                                           // 0x80(0x30)
	class                                                        TypeValue;                                         // 0xb0(0x8)
};


// Size 0x38
class AssociateActorToCrewTaskStep: public TaleQuestStep
{
public:
	Class AssociateActorToCrewTaskStepDesc*                      Desc;                                              // 0x98(0x8)
};


// Size 0x38
class AssociateActorToCrewTaskStepDesc: public TaleQuestStepDesc
{
public:
	Class TaleQuestStepDesc*                                     TaskDesc;                                          // 0x80(0x8)
	Struct QuestVariableActor                                    ActorToAssociate;                                  // 0x88(0x30)
};


// Size 0x0
class LoadoutRepairerInterface: public Interface
{
public:
};


// Size 0x58
class AsyncLoadoutRepairComponent: public ActorComponent
{
public:
};


// Size 0x130
class AthenaAIInteractableComponent: public AIInteractableComponent
{
public:
	bool                                                         Moveable;                                          // 0x108(0x1)
	Struct Vector                                                InteractableRelativeVectorToSpawnPos;              // 0x10c(0xc)
	Struct Vector                                                TriggerSphereCentreOffset;                         // 0x118(0xc)
	float                                                        TriggerSphereRadiusOffset;                         // 0x124(0x4)
	float                                                        TimeToCacheLastBestTargetResult;                   // 0x128(0x4)
	byte                                                         OwnerAITeam;                                       // 0x12c(0x1)
};


// Size 0x0
class AthenaAITeamsServiceInterface: public Interface
{
public:
};


// Size 0x5b8
class AthenaAITeamsService: public Object
{
public:
};


// Size 0x38
class AthenaAnimationCustomSkeletonAnimationData: public DataAsset
{
public:
	Struct SkeletonCustomAnimationDataStructure                  SkeletonCustomAnimData;                            // 0x28(0x38)
};


// Size 0x0
class CharacterAnimationInterface: public Interface
{
public:
};


// Size 0x0
class AthenaAnimationLocomotionComponentFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x2910
class AthenaAnimationInstance: public CharacterAnimationInstance
{
public:
	byte                                                         ControllableObjectType;                            // 0x698(0x1)
	TArray<Struct AthenaAnimationLoadObjectsWrapper>             AllLoadedItemData;                                 // 0x6a0(0x10)
	Struct AthenaAnimationHandHeldItemParams                     HandHeldItemParams;                                // 0x6b0(0x20)
	Struct AthenaAnimationIdleVariantChange                      IdleVariantParams;                                 // 0x6d0(0x10)
	Struct AthenaAnimationWheel                                  WheelAnimationParams;                              // 0x6e0(0x1d0)
	Struct AthenaAnimationCapstan                                CapstanAnimationParams;                            // 0x8b0(0x158)
	Struct AthenaAnimationFacialAnimData                         FacialParams;                                      // 0xa08(0x90)
	Struct AthenaAnimationFire                                   Fire;                                              // 0xa98(0x20)
	byte                                                         MeleeSpecialState;                                 // 0xab8(0x1)
	float                                                        DodgeDirection;                                    // 0xabc(0x4)
	Struct AthenaAnimationRowboatParams                          RowboatParams;                                     // 0xac0(0xc8)
	Struct AthenaAnimationRowing                                 Rowing;                                            // 0xb88(0xc0)
	Struct AthenaAnimationWaterPumpAnimData                      WaterPumpAnimations;                               // 0xc48(0x28)
	Struct AthenaAnimationWaterPumpParams                        WaterPumpAnimationParams;                          // 0xc70(0xc)
	Struct AthenaAnimationFishingParams                          FishingParams;                                     // 0xc7c(0x34)
	Struct AthenaAnimationFishing                                Fishing;                                           // 0xcb0(0x340)
	Struct AthenaAnimationWaterSlideControlAnimData              WaterSlideControlAnimData;                         // 0xff0(0x20)
	Class AthenaCharacter*                                       AthenaCharacter;                                   // 0x1010(0x8)
	Struct AthenaAnimationJumping                                JumpingAnimationParams;                            // 0x1018(0xd0)
	float                                                        SpineBlendAlpha;                                   // 0x10e8(0x4)
	float                                                        DockingTransitionAlpha;                            // 0x10ec(0x4)
	Struct AthenaAnimationWaterPump                              AthenaAnimationWaterPump;                          // 0x10f0(0x30)
	Struct AthenaAnimationLODSettings                            AnimationLODSettings;                              // 0x1120(0x3)
	Struct AthenaAnimationLocomotion                             Locomotion;                                        // 0x1128(0x68)
	Struct AthenaAnimationWieldedItemStateMachine                WieldedItemStateMachine;                           // 0x1190(0x510)
	Struct AthenaAnimationLoadObjectByID                         ItemLoading;                                       // 0x16a0(0x930)
	class                                                        CurrentWieldedItemALK;                             // 0x1fd0(0x8)
	Struct AthenaAnimationObjectActionContinuousStruct           ItemPrimaryContinousUseAnims;                      // 0x1fd8(0xa8)
	Struct AthenaAnimationObjectActionContinuousStruct           ItemSecondaryContinousUseAnims;                    // 0x2080(0xa8)
	Struct AthenaAnimationObjectActionContinuousStruct           ItemPrimaryContinousUseAlternateAnims;             // 0x2128(0xa8)
	Struct AthenaAnimationObjectActionContinuousStruct           ItemSecondaryContinousUseAlternateAnims;           // 0x21d0(0xa8)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemPrimaryContinousUseSwimmingAnims;              // 0x2278(0x20)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemSecondaryContinousUseSwimmingAnims;            // 0x2298(0x20)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemPrimaryContinousUseSwimmingAlternateAnims;     // 0x22b8(0x20)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemSecondaryContinousUseSwimmingAlternateAnims;   // 0x22d8(0x20)
	Struct AthenaAnimationObjectJumpingAnimations                ItemPrimaryContinousUseJumpingAnims;               // 0x22f8(0x20)
	Struct AthenaAnimationObjectJumpingAnimations                ItemSecondaryContinousUseJumpingAnims;             // 0x2318(0x20)
	Struct AthenaAnimationObjectJumpingAnimations                ItemPrimaryContinousUseJumpingAlternateAnims;      // 0x2338(0x20)
	Struct AthenaAnimationObjectJumpingAnimations                ItemSecondaryContinousUseJumpingAlternateAnims;    // 0x2358(0x20)
	Struct AthenaAnimationActiveOneShotAnimationStruct           ActiveOneShotAnimations;                           // 0x2378(0x20)
	Struct AthenaAnimationActiveOneShotAnimationStruct           DuplicateActiveOneShotAnimations;                  // 0x2398(0x20)
	Struct AthenaAnimationObjectActionOneShotPlayingStruct       ItemPrimaryOneShotAnims;                           // 0x23b8(0x28)
	Struct AthenaAnimationObjectActionOneShotPlayingStruct       ItemSecondaryOneShotAnims;                         // 0x23e0(0x28)
	Struct AthenaAnimationObjectActionOneShotPlayingStruct       ItemPrimaryOneShotAlternateAnims;                  // 0x2408(0x28)
	Struct AthenaAnimationObjectActionOneShotPlayingStruct       ItemSecondaryOneShotAlternateAnims;                // 0x2430(0x28)
	Struct AthenaAnimationActiveItemComplexAnimData              CurrentComplexOneShotData;                         // 0x2458(0x38)
	Struct AthenaAnimationObjectComplexOneShotPlaySpeeds         CurrentMeleeAttackSequencePlaySpeeds;              // 0x2490(0x14)
	Struct AthenaAnimationObjectMeleeBlocking                    ItemCombatBlockingAnims;                           // 0x24a8(0x60)
	class                                                        FishingRodAnimStoreID;                             // 0x2508(0x8)
	class                                                        QuestBookAnimStoreID;                              // 0x2510(0x8)
	class                                                        WoodenPlankAnimStoreID;                            // 0x2518(0x8)
	float                                                        UnequipPlayRate;                                   // 0x2520(0x4)
	Struct AthenaAnimationLoadOnDemandItemsAnimgraphStructure    LoadOnDemandItemParams;                            // 0x2528(0x760)
	byte                                                         ControllableSocketGroup;                           // 0x2c88(0x1)
	byte                                                         ControllableSocketGroupCharacterSize;              // 0x2c89(0x1)
	byte                                                         LocomotionState;                                   // 0x2c8a(0x1)
	Struct AthenaAnimationDebugTrackingParams                    DebugTrackingParams;                               // 0x2c8b(0x4)
	Struct AthenaAnimationDeath                                  Death;                                             // 0x2c90(0x100)
	Struct AthenaAnimationUndoRepair                             UndoRepair;                                        // 0x2d90(0x70)
	Struct AthenaAnimationSitting                                Sitting;                                           // 0x2e00(0x70)
	byte                                                         PropWieldLocation;                                 // 0x2e70(0x1)
	Struct Vector                                                PropOffsetLocation;                                // 0x2e74(0xc)
	Struct Rotator                                               PropOffsetRotation;                                // 0x2e80(0xc)
	Struct Vector                                                PropOffsetScale;                                   // 0x2e8c(0xc)
	bool                                                         FaunaAddedToCrate;                                 // 0x2e98(0x1)
	bool                                                         InDockingTransition;                               // 0x2e98(0x1)
	bool                                                         WieldedItemIsMeleeWeapon;                          // 0x2e98(0x1)
	bool                                                         InMeleeCombat;                                     // 0x2e98(0x1)
	bool                                                         IsBlockingLeft;                                    // 0x2e98(0x1)
	bool                                                         IsFishingWithWieldedRod;                           // 0x2e98(0x1)
	bool                                                         UsePropOffset;                                     // 0x2e98(0x1)
	bool                                                         IsOnLadder;                                        // 0x2e98(0x1)
	bool                                                         IsUsingAdditiveHandOverlayPose;                    // 0x2e99(0x1)
	bool                                                         IgnoreIdleBlendTransition;                         // 0x2e99(0x1)
	bool                                                         UseDuplicateOneShotState;                          // 0x2e99(0x1)
};


// Size 0xd0
class FirstPersonAnimationInstance: public AthenaAnimationInstance
{
public:
	float                                                        SpineRotationTime;                                 // 0x2f78(0x4)
	Struct Vector                                                RangedWeaponTargetingOffset;                       // 0x2f7c(0xc)
	float                                                        RangedWeaponAlpha;                                 // 0x2f88(0x4)
	Struct AthenaAnimationCamera                                 CameraParams;                                      // 0x2f8c(0x18)
	Struct AthenaAnimationFirstPersonAnimatic                    FirstPersonAnimatic;                               // 0x2fa8(0x80)
	byte                                                         CameraAdditiveBlendPoseType;                       // 0x3028(0x1)
	float                                                        RowboatCameraAlpha;                                // 0x302c(0x4)
	bool                                                         UseAdditiveHandOverlay;                            // 0x3030(0x1)
	bool                                                         CameraAttachmentTypeNotDefault;                    // 0x3030(0x1)
	bool                                                         BlendUpperBodyAndArmOverlay;                       // 0x3030(0x1)
	bool                                                         UseArmOverlayJumpContinuous;                       // 0x3030(0x1)
	bool                                                         IsSwimming;                                        // 0x3030(0x1)
	bool                                                         IsControllableObjectActive;                        // 0x3030(0x1)
	bool                                                         UseSwimmingEquip;                                  // 0x3030(0x1)
	float                                                        EquipAnimationPlayRate;                            // 0x3034(0x4)
	bool                                                         ActivateIK;                                        // 0x3038(0x1)
	bool                                                         UseOneShotIntoAnimInContinuousUse;                 // 0x3038(0x1)
};


// Size 0x1360
class ThirdPersonAnimationInstance: public AthenaAnimationInstance
{
public:
	float                                                        ItemAnimPausedTimeRemaining;                       // 0x2f70(0x4)
	bool                                                         IsItemAnimPaused;                                  // 0x2f74(0x1)
	bool                                                         UseContinualLoopInOneShotState;                    // 0x2f74(0x1)
	Struct AthenaAnimationIKLimbStretch                          IKLimbStretchParams;                               // 0x2f78(0xc)
	Struct AthenaAnimationLadder                                 LadderAnimationParams;                             // 0x2f88(0x2b0)
	Struct AthenaAnimationTalking                                Talking;                                           // 0x3238(0x40)
	Struct AthenaAnimationPitchControlStates                     PitchTargetingControlStates;                       // 0x3278(0x168)
	Struct AthenaAnimationObjectTargetingOptions                 PitchTargetingParameters;                          // 0x33e0(0x3c)
	Struct AthenaAnimationObjectTargetingOptions                 WantedPitchTargetingParameters;                    // 0x341c(0x3c)
	Struct AthenaAnimationPitchAlpha                             PitchTargetingAlpha;                               // 0x3458(0x14)
	Struct AthenaAnimationPitchShoulders                         PitchShoulderParams;                               // 0x346c(0x1c)
	Struct AthenaAnimationMountedWeapon                          MountedWeaponAnimationParams;                      // 0x3488(0xf8)
	Struct AthenaAnimationFootPlanting                           FootPlanting;                                      // 0x3580(0x48)
	byte                                                         StairAnimationState;                               // 0x35c8(0x1)
	Struct AthenaAnimationPulleyControl                          PulleyControl;                                     // 0x35d0(0x40)
	Struct AthenaAnimationPulleyControlAnimData                  PulleyControlAnimData;                             // 0x3610(0x48)
	Struct AthenaAnimationKeyedInstrumentAnimData                KeyedInstrumentAnimData;                           // 0x3658(0x18)
	Struct AthenaAnimationAI                                     AIAnimationParams;                                 // 0x3670(0x2e8)
	Struct AthenaAnimationLocomotionAlternateAnimData            LocomotionDrunk;                                   // 0x3958(0x50)
	Struct AthenaAnimationLocomotionAlternateAnimData            LocomotionLimp;                                    // 0x39a8(0x50)
	Struct AthenaAnimationLocomotionAlternateAnimData            LocomotionPegLeg;                                  // 0x39f8(0x50)
	Struct AthenaAnimationLocomotionAlternateAnimData            LocomotionHotCoals;                                // 0x3a48(0x50)
	TArray<Struct AthenaAnimationSpawnBase>                      AISpawnStruct;                                     // 0x3a98(0x10)
	TArray<Struct AthenaAnimationSkeletonFlee>                   AIFleeLoadingStruct;                               // 0x3aa8(0x10)
	Struct AthenaAnimationSkeletonFleeInGraph                    AIFleePlayingStruct;                               // 0x3ab8(0x38)
	Struct AthenaAnimationSkeletonScream                         SkeletonScream;                                    // 0x3af0(0x8)
	Class BlendSpace1D*                                          PitchAnimationToPlay;                              // 0x3af8(0x8)
	Struct AthenaAnimationShopInteractionParams                  ShopInteractionParams;                             // 0x3b00(0x30)
	Struct AthenaAnimationEmoteAnimgraphStructure                EmoteParams;                                       // 0x3b30(0x128)
	Struct AthenaAnimationSkeletonCurseAnimations                SkeletonCurseAnims;                                // 0x3c58(0x28)
	Struct AthenaAnimationHarpoonLauncherAnimData                HarpoonLauncherAnims;                              // 0x3c80(0x28)
	Struct AthenaAnimationAIKnockback                            AIKnockbackStruct;                                 // 0x3ca8(0x30)
	Struct AthenaAnimationHitReactsAnimData                      HitReactionsAnimationData;                         // 0x3cd8(0x40)
	Struct AthenaAnimationHitReactsSelectedAnimations            HitReactionsSelectedAnimationData;                 // 0x3d18(0x48)
	Struct AthenaAnimationHitReactParams                         HitReactionsAnimationParams;                       // 0x3d60(0x2c)
	Struct AthenaAnimationSinkingTunnel                          Sinking;                                           // 0x3d90(0x68)
	float                                                        HitReactAdditiveBlendAmount;                       // 0x3df8(0x4)
	float                                                        WieldedItemPoseBlendTime;                          // 0x3dfc(0x4)
	float                                                        UpperBodyPoseBlendTime;                            // 0x3e00(0x4)
	float                                                        AimingAndPitchOverride;                            // 0x3e04(0x4)
	float                                                        FacialOverlayBlendWeight;                          // 0x3e08(0x4)
	Struct Rotator                                               PitchShoulderRotation;                             // 0x3e0c(0xc)
	Struct Rotator                                               PitchClavicleRotation;                             // 0x3e18(0xc)
	float                                                        RightArmPitchAlpha;                                // 0x3e24(0x4)
	float                                                        LeftArmPitchAlpha;                                 // 0x3e28(0x4)
	float                                                        SpineRotation;                                     // 0x3e2c(0x4)
	Struct AthenaAnimationStunData                               StunData;                                          // 0x3e30(0x8)
	Class BlendSpace1D*                                          HitReactItem;                                      // 0x3e38(0x8)
	float                                                        WorldDelta;                                        // 0x3e40(0x4)
	float                                                        CapstanAngularVelocityWanted;                      // 0x3e44(0x4)
	Struct AthenaAnimationPlayingFacialAnimations                PlayingFacialAnimations;                           // 0x3e48(0x40)
	Struct AthenaAnimationPlayingEquipAnimations                 PlayingEquipAnimations;                            // 0x3e88(0x18)
	float                                                        CharacterPitch;                                    // 0x3ea0(0x4)
	float                                                        TargetingPitch;                                    // 0x3ea4(0x4)
	Struct AthenaAnimationObjectLocomotionAnimations             ItemAlternateLocomotionAnims;                      // 0x3ea8(0x40)
	Struct AthenaAnimationObjectIdleAnimations                   ItemAlternateIdleAnims;                            // 0x3ee8(0x18)
	Struct AthenaAnimationObjectActionContinuousStructPitchOverride ItemPrimaryContinousUseAnimsPitchOverride;         // 0x3f00(0x78)
	Struct AthenaAnimationObjectActionContinuousStructPitchOverride ItemSecondaryContinousUseAnimsPitchOverride;       // 0x3f78(0x78)
	Struct AthenaAnimationObjectActionContinuousStructPitchOverride ItemPrimaryContinousUseAlternateAnimsPitchOverride; // 0x3ff0(0x78)
	Struct AthenaAnimationObjectActionContinuousStructPitchOverride ItemSecondaryContinousUseAlternateAnimsPitchOverride; // 0x4068(0x78)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemPrimaryContinousUseSwimmingAnimsPitchOverride; // 0x40e0(0x20)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemSecondaryContinousUseSwimmingAnimsPitchOverride; // 0x4100(0x20)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemPrimaryContinousUseSwimmingAlternateAnimsPitchOverride; // 0x4120(0x20)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemSecondaryContinousUseSwimmingAlternateAnimsPitchOverride; // 0x4140(0x20)
	Struct AthenaAnimationObjectJumpingAnimationsPitchOverride   ItemPrimaryContinousUseJumpingAnimsPitchOverride;  // 0x4160(0x20)
	Struct AthenaAnimationObjectJumpingAnimationsPitchOverride   ItemSecondaryContinousUseJumpingAnimsPitchOverride; // 0x4180(0x20)
	Struct AthenaAnimationObjectJumpingAnimationsPitchOverride   ItemPrimaryContinousUseJumpingAlternateAnimsPitchOverride; // 0x41a0(0x20)
	Struct AthenaAnimationObjectJumpingAnimationsPitchOverride   ItemSecondaryContinousUseJumpingAlternateAnimsPitchOverride; // 0x41c0(0x20)
	Struct AthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemPrimaryOneShotAnimsPitchOverride;              // 0x41e0(0x28)
	Struct AthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemSecondaryOneShotAnimsPitchOverride;            // 0x4208(0x28)
	Struct AthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemPrimaryOneShotAlternateAnimsPitchOverride;     // 0x4230(0x28)
	Struct AthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemSecondaryOneShotAlternateAnimsPitchOverride;   // 0x4258(0x28)
	bool                                                         ZeroLocomotionForced;                              // 0x4280(0x1)
	bool                                                         ConcealedInLoadable;                               // 0x4280(0x1)
	bool                                                         AIUseAlternateLocomotion;                          // 0x4280(0x1)
	bool                                                         EmoteIKIsOff;                                      // 0x4280(0x1)
	bool                                                         InBlockingInto;                                    // 0x4280(0x1)
	bool                                                         IsAI;                                              // 0x4280(0x1)
	bool                                                         IsLocallyControlled;                               // 0x4280(0x1)
	bool                                                         IsHit;                                             // 0x4280(0x1)
	bool                                                         InRecover;                                         // 0x4281(0x1)
	bool                                                         InWarmUp;                                          // 0x4281(0x1)
	bool                                                         PlayingFullBodyAnimation;                          // 0x4281(0x1)
	bool                                                         PlayingUpperBodyAnimation;                         // 0x4281(0x1)
	bool                                                         PlayingRightArmOverlayAnimation;                   // 0x4281(0x1)
	bool                                                         PlayingSpineOverlayAnimation;                      // 0x4281(0x1)
	bool                                                         PlayingLeftArmOverlayAnimation;                    // 0x4281(0x1)
	bool                                                         IsUsingFullBodyOverlayPose;                        // 0x4281(0x1)
	bool                                                         IsUsingLocalIKPose;                                // 0x4282(0x1)
	bool                                                         IsRightShoulderActive;                             // 0x4282(0x1)
	bool                                                         IsLeftShoulderActive;                              // 0x4282(0x1)
	bool                                                         ControllableObjectTypeHasValidTarget;              // 0x4282(0x1)
	bool                                                         UseHandsAndFootplantingIK;                         // 0x4282(0x1)
	bool                                                         IKLODActive;                                       // 0x4282(0x1)
	bool                                                         LODSolverActive;                                   // 0x4282(0x1)
	bool                                                         ObjectPitchTargetingActive;                        // 0x4282(0x1)
	bool                                                         ObjectOrIKEmoteActive;                             // 0x4283(0x1)
	bool                                                         ObjectOrWheelCapstanAndNotDocking;                 // 0x4283(0x1)
	bool                                                         HitReact1Active;                                   // 0x4283(0x1)
	bool                                                         HitReact2Active;                                   // 0x4283(0x1)
	bool                                                         AthenaCharacterIsValid;                            // 0x4283(0x1)
	bool                                                         UsePrimaryActionPitchOverride;                     // 0x4283(0x1)
	bool                                                         UseSecondaryActionPitchOverride;                   // 0x4283(0x1)
};


// Size 0x140
class SkeletonAnimationInstance: public ThirdPersonAnimationInstance
{
public:
	Struct AthenaAnimationSkeletonAIFastPathData                 SkeletonAIFastPathData;                            // 0x42d8(0x4)
	Class NPCHeldObjectData*                                     HeldObjectList;                                    // 0x42e0(0x8)
	Class Actor*                                                 LeftHandObject;                                    // 0x42e8(0x8)
	Class Actor*                                                 RightHandObject;                                   // 0x42f0(0x8)
	float                                                        ObjectOverlayBlendOutTime;                         // 0x42f8(0x4)
	Class AthenaAnimationCustomSkeletonAnimationData*            CustomAnimationData;                               // 0x4300(0x8)
	Struct AthenaAnimationCustomSkeletonAnimationBlueprintData   CustomAnimationBlueprintData;                      // 0x4308(0x58)
	byte                                                         PreviousCustomAnimationState;                      // 0x4360(0x1)
	Class AnimMontage*                                           CustomAnimationCurrentMontage;                     // 0x4368(0x8)
};


// Size 0x0
class AthenaAnimationInstanceTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0
class AthenaAnimationMountedWeaponBlueprintFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0
class AthenaAnimationWieldedItemAnimationOverlayFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0
class AthenaAnimationWieldedItemFunctions: public Object
{
public:
};


// Size 0x40
class AthenaAssetSettings: public Object
{
public:
	TArray<Struct AssetDelayLoadEntry>                           DelayLoadedAssets;                                 // 0x28(0x10)
	TArray<Struct AssetDelayLoadEntry>                           SteamOnlyDelayLoadedAssets;                        // 0x38(0x10)
	TArray<Str PhysicsAuditBlueprintExceptions>                  PhysicsAuditBlueprintExceptions;                   // 0x48(0x10)
	TArray<Struct FName>                                         PhysicsAuditExemptedCollisionProfiles;             // 0x58(0x10)
};


// Size 0x80
class AthenaCameraComponent: public CameraComponent
{
public:
	float                                                        OffsetBlendSpeed;                                  // 0x850(0x4)
	float                                                        AboveWaterOffset;                                  // 0x854(0x4)
	float                                                        UnderWaterOffset;                                  // 0x858(0x4)
	float                                                        SubmersionDistanceBeforeSurfacing;                 // 0x85c(0x4)
	float                                                        SubmersionDistanceBeforeUnderwater;                // 0x860(0x4)
	float                                                        SubmersionDistanceBeforeUnderwaterOnShip;          // 0x864(0x4)
	bool                                                         IsInsideShipHull;                                  // 0x888(0x1)
	float                                                        CurrentCameraOffset;                               // 0x88c(0x4)
};


// Size 0x60
class CustomAnimationHandlerComponent: public ActorComponent
{
public:
	TArray<Struct StringAssetReference>                          CurrentCustomAnimationDataAssetReferences;         // 0xd8(0x10)
	Struct RequestedLoopAnims                                    RequestedLoopingAnim;                              // 0xe8(0x10)
	Class AthenaAnimationCustomSkeletonAnimationData*            MergedCustomAnimationData;                         // 0xf8(0x8)
};


// Size 0x0
class HitDetectionVisualisationInterface: public Interface
{
public:
};


// Size 0x6d0
class AthenaAICharacter: public AthenaCharacter
{
public:
	class                                                        DefaultAmmoItemDescType;                           // 0xc50(0x8)
	class                                                        DefaultInteractableAmmoItemDescType;               // 0xc58(0x8)
	Class CurveFloat*                                            DistanceInMToCannonShotHitChanceCurve;             // 0xc60(0x8)
	bool                                                         AimNoiseEnabled;                                   // 0xc68(0x1)
	float                                                        AmplitudeChangeSpeed;                              // 0xc6c(0x4)
	float                                                        AmplitudeOffset;                                   // 0xc70(0x4)
	float                                                        Frequency;                                         // 0xc74(0x4)
	float                                                        InteractableMissFallShortMinProportion;            // 0xc78(0x4)
	float                                                        InteractableMissFallShortMaxProportion;            // 0xc7c(0x4)
	byte                                                         TrackedActorType;                                  // 0xc80(0x1)
	Class FaceTargetComponent*                                   FaceTargetComponent;                               // 0xc88(0x8)
	Class AIPartsRetrievalComponent*                             AIPartsRetrievalComponent;                         // 0xc90(0x8)
	Class AthenaAIFormComponent*                                 FormComponent;                                     // 0xc98(0x8)
	Class AICharacterAudioComponent*                             AICharacterAudioComponent;                         // 0xca0(0x8)
	Class StatusEffectManagerComponent*                          StatusEffectManagerComponent;                      // 0xca8(0x8)
	Class StatusEffectPersistenceComponent*                      StatusEffectPersistenceComponent;                  // 0xcb0(0x8)
	Class PlayerCurseComponent*                                  PlayerCurseComponent;                              // 0xcb8(0x8)
	Class VulnerabilityDuringAIStrategyComponent*                VulnerabilityDuringAIStrategyComponent;            // 0xcc0(0x8)
	Class CapsuleComponent*                                      ProjectileTraceHitVolume;                          // 0xcc8(0x8)
	Class AnimationDataOverriderComponent*                       AnimationDataOverriderComponent;                   // 0xcd0(0x8)
	Class CustomAnimationHandlerComponent*                       CustomAnimationHandlerComponent;                   // 0xcd8(0x8)
	Class AIProjectileWeaponFiringIntentionComponent*            FiringIntentionComponent;                          // 0xce0(0x8)
	Class Object*                                                KilledVfxTemplate;                                 // 0xce8(0x8)
	Class Object*                                                PartSpecificKilledVfxTemplate;                     // 0xcf0(0x8)
	Struct ItemLoadout                                           AISpawnLoadout;                                    // 0xcf8(0x20)
	bool                                                         KillOnFallingIntoWater;                            // 0xd18(0x1)
	class                                                        MeleeAttackStrategyId;                             // 0xd20(0x8)
	class                                                        GunpowderKegAnimationStoreId;                      // 0xd28(0x8)
	Struct PlayerStat                                            OnFireStat;                                        // 0xd30(0x4)
	Class SkeletalMesh*                                          AssignedMesh;                                      // 0xd80(0x8)
	Class ColorTexture*                                          TeamColorTexture;                                  // 0xd88(0x8)
	Struct GenericTeamId                                         TeamID;                                            // 0xd90(0x1)
	Class Actor*                                                 CurrentShip;                                       // 0xd98(0x8)
	float                                                        MeshScale;                                         // 0xda0(0x4)
	bool                                                         DamageResponsesDisabled;                           // 0xda4(0x1)
	bool                                                         TurnActive;                                        // 0xda5(0x1)
	class                                                        CurrentAIStrategy;                                 // 0xda8(0x8)
	class                                                        CurrentAnimationState;                             // 0xdb0(0x8)
	class                                                        AlternateLocomotionItemType;                       // 0xdb8(0x8)
	Class AthenaAIAmmoDataAsset*                                 Ammo;                                              // 0x10d0(0x8)
	Struct AIEncounterSpecification                              PawnEncounterSpec;                                 // 0x10d8(0xd0)
};


// Size 0xd0
class OceanCrawlerAICharacter: public AthenaAICharacter
{
public:
	Class HealthGemComponent*                                    HealthGemComponent;                                // 0x12e0(0x8)
	Class BuffReceiverComponent*                                 BuffReceiver;                                      // 0x12e8(0x8)
	byte                                                         OceanCrawlerType;                                  // 0x12f0(0x1)
	Class CustomAnimationMontageComponent*                       MontageComponent;                                  // 0x12f8(0x8)
	Class AnimationServerData*                                   OceanCrawlerAnimationServerData;                   // 0x1300(0x8)
	float                                                        StaticCollisionRampAngleLimit;                     // 0x1308(0x4)
	bool                                                         ShouldPlayersInterruptBullRush;                    // 0x130c(0x1)
	bool                                                         SporeBreathActive;                                 // 0x130d(0x1)
};


// Size 0x100
class AthenaGhostPlayerCharacter: public AthenaPlayerCharacter
{
public:
	Class GhostShipTickManager*                                  GhostShipTickManager;                              // 0x1d00(0x8)
};


// Size 0x0
class AthenaGhostPlayerCharacterMock: public AthenaGhostPlayerCharacter
{
public:
};


// Size 0x2b0
class VoyageParticipantComponent: public ActorComponent
{
public:
	Class Actor*                                                 OwningPlayer;                                      // 0x170(0x8)
	Struct VoyageParticipantViewContainer                        ViewContainer;                                     // 0x178(0xc8)
	Struct VoyageParticipantViewContainer                        PreviousViewContainer;                             // 0x240(0xc8)
};


// Size 0x30
class AthenaPlayerCharacterMock: public AthenaPlayerCharacter
{
public:
	Class AICreatureMovementModifierParamsDataAsset*             PetMovementParamsDataAsset;                        // 0x1c70(0x8)
	bool                                                         AllowedToSwim;                                     // 0x1c78(0x1)
};


// Size 0x160
class AthenaPlayerCharacterUnitTestMock: public AthenaPlayerCharacterMock
{
public:
	class                                                        ExpectedActionStateId;                             // 0x1de0(0x8)
};


// Size 0x50
class AthenaPlayerCharacterMockWithAnimSeq: public AthenaPlayerCharacterMock
{
public:
};


// Size 0x120
class AthenaCharacterMovementUnderwater: public DataAsset
{
public:
	bool                                                         bSphere;                                           // 0x28(0x1)
	float                                                        Radius;                                            // 0x2c(0x4)
	float                                                        HalfHeight;                                        // 0x30(0x4)
	float                                                        PenResolveInflation;                               // 0x34(0x4)
	float                                                        PullBackDistance;                                  // 0x38(0x4)
	float                                                        FanOutAngle;                                       // 0x3c(0x4)
	float                                                        MaxFanOutScalar;                                   // 0x40(0x4)
	float                                                        IdleBobSpeed;                                      // 0x48(0x4)
	float                                                        IdleBobDuration;                                   // 0x4c(0x4)
	struct FName                                                 CollisionProfileName;                              // 0x50(0x8)
	Class CurveFloat*                                            VelocityToAngle;                                   // 0x58(0x8)
	bool                                                         bDrawDebugCapsule;                                 // 0x64(0x1)
	bool                                                         bDebugOldMovement;                                 // 0x65(0x1)
};


// Size 0x0
class LocalDisturbanceFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x2a0
class AthenaCharacterMovementComponent: public CharacterMovementComponent
{
public:
	Struct AthenaCharacterSwimParams                             SwimParams;                                        // 0x598(0x9c)
	float                                                        SprintSpdAmp;                                      // 0x634(0x4)
	float                                                        SprintAccelAmp;                                    // 0x638(0x4)
	float                                                        LookAtYawRate;                                     // 0x63c(0x4)
	float                                                        LookAtPitchRate;                                   // 0x640(0x4)
	float                                                        MaxSpeedRatioWhenWalkingInNonSwimWater;            // 0x648(0x4)
	float                                                        MaxAccelerationRatioWhenWalkingInNonSwimWater;     // 0x64c(0x4)
	bool                                                         bCharacterCollisionSweepsEnabled;                  // 0x650(0x1)
	float                                                        CharacterCollisionRadius;                          // 0x654(0x4)
	Struct CollisionProfileName                                  CharacterCollisionProfile;                         // 0x658(0x8)
	Struct CollisionProfileName                                  CollisionPanicFallbackProfileName;                 // 0x660(0x8)
	float                                                        CharacterCollisionWalkingFriction;                 // 0x668(0x4)
	float                                                        CharacterCollisionSwimmingFriction;                // 0x66c(0x4)
	float                                                        CharacterCollisionUnderwaterOffset;                // 0x670(0x4)
	Class AthenaCharacterMovementUnderwater*                     UnderwaterMovement;                                // 0x678(0x8)
	bool                                                         bCreateDisturbance;                                // 0x680(0x1)
	float                                                        DisturbanceSize;                                   // 0x684(0x4)
	float                                                        DisturbanceVelocityScale;                          // 0x688(0x4)
	bool                                                         UseAsRVOObstacleOnly;                              // 0x68c(0x1)
	float                                                        FanPushOutAngle;                                   // 0x6f0(0x4)
	int                                                          FanPushOutNumSteps;                                // 0x6f4(0x4)
	float                                                        MaxFanPushOutScalar;                               // 0x6f8(0x4)
	Class CurveFloat*                                            UnderwaterVelocityToAnglePitchProjectileHitVolume; // 0x700(0x8)
	Class CurveFloat*                                            UnderwaterVelocityToAngleRollProjectileHitVolume;  // 0x708(0x8)
	Class CurveFloat*                                            UnderwaterVelocityToZOffsetProjectileHitVolume;    // 0x710(0x8)
	Class CurveFloat*                                            OnLandVelocityToAnglePitchProjectileHitVolume;     // 0x718(0x8)
	Class CurveFloat*                                            OnLandVelocityToXOffsetProjectileHitVolume;        // 0x720(0x8)
	Class CurveFloat*                                            OnLandVelocityToYOffsetProjectileHitVolume;        // 0x728(0x8)
	Class CurveFloat*                                            OnLandVelocityToZOffsetProjectileHitVolume;        // 0x730(0x8)
	Class CurveFloat*                                            FallingVelocityToAnglePitchProjectileHitVolume;    // 0x738(0x8)
	Class CurveFloat*                                            FallingVelocityToXOffsetProjectileHitVolume;       // 0x740(0x8)
	Class CurveFloat*                                            FallingVelocityToZOffsetProjectileHitVolume;       // 0x748(0x8)
	struct FName                                                 NonUnderwaterCollisionProfileName;                 // 0x800(0x8)
	struct FName                                                 UnderwaterCollisionProfileName;                    // 0x808(0x8)
};


// Size 0x130
class AthenaPlayerCharacterMovementComponent: public AthenaCharacterMovementComponent
{
public:
	Class CurveFloat*                                            LandingSpeedToFallDamageCurve;                     // 0x830(0x8)
	float                                                        MinFallSpeedToPossiblyCauseDamage;                 // 0x838(0x4)
	float                                                        MinTimeBetweenDamagingImpactsOnUnwalkableSurface;  // 0x83c(0x4)
	float                                                        MinFallDamageToBreakLeg;                           // 0x840(0x4)
	float                                                        FiredFromActorFallDamageScalar;                    // 0x844(0x4)
	float                                                        TimeUntilRecoverFallDamageAudioState;              // 0x848(0x4)
	Struct Status                                                FallDamageLimpingStatus;                           // 0x850(0x18)
	float                                                        SwimmingStateFilterTime;                           // 0x868(0x4)
};


// Size 0x0
class MockAthenaPlayerCharacterMovementComponent: public AthenaPlayerCharacterMovementComponent
{
public:
};


// Size 0x0
class MockAthenaPlayerCharacterWithAthenaPlayerCharacterMovementComponent: public AthenaPlayerCharacterMock
{
public:
};


// Size 0x0
class StreamingLocationInterface: public Interface
{
public:
};


// Size 0x18
class StreamingLocationComponent: public ActorComponent
{
public:
	Struct Vector                                                StreamingLocationOverride;                         // 0xd0(0xc)
	bool                                                         StreamingLocationActive;                           // 0xdc(0x1)
};


// Size 0x70
class AthenaTavernPlayerCharacter: public AthenaPlayerCharacter
{
public:
	Class AICreatureMovementModifierParamsDataAsset*             ArenaTavernPetMovementData;                        // 0x1c70(0x8)
	Class AthenaPlayerController*                                PlayerController;                                  // 0x1ca8(0x8)
	bool                                                         VoteForRivalsHasPassed;                            // 0x1cd0(0x1)
};


// Size 0x0
class AthenaTavernPlayerCharacterMock: public AthenaTavernPlayerCharacter
{
public:
};


// Size 0x68
class AthenaCharacterBaseLocomotionInputComponent: public AthenaCharacterBaseInputComponent
{
public:
	class                                                        ThrowablesItemCategory;                            // 0x2f8(0x8)
};


// Size 0x0
class DebugFlyingInputComponent: public AthenaCharacterBaseLocomotionInputComponent
{
public:
};


// Size 0x0
class LocomotionInputComponent: public AthenaCharacterBaseLocomotionInputComponent
{
public:
};


// Size 0x0
class AthenaCharacterDockingFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x40
class AthenaCharacterDodgeComponent: public ActorComponent
{
public:
	Struct AthenaCharacterDodgeParams                            Params;                                            // 0xc8(0x10)
	float                                                        ConsecutiveDodgeCountResetTimer;                   // 0xd8(0x4)
	Class CurveFloat*                                            BunnyHoppingScalarCurve;                           // 0xe0(0x8)
	Class AthenaCharacter*                                       Character;                                         // 0xe8(0x8)
};


// Size 0x0
class AthenaCharacterFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x70
class AthenaCharacterKnockbackComponent: public ActorComponent
{
public:
	bool                                                         Disabled;                                          // 0xd0(0x1)
	Class AthenaCharacter*                                       Character;                                         // 0xd8(0x8)
};


// Size 0x0
class AthenaCharacterKnockbackComponentMock: public AthenaCharacterKnockbackComponent
{
public:
};


// Size 0x8
class AthenaCharacterMovementCheatDetectionSettings: public Object
{
public:
	float                                                        MinLifetime;                                       // 0x28(0x4)
	float                                                        MinRatioLifetimeToLifetimeRawTimeDiscrepancy;      // 0x2c(0x4)
};


// Size 0x120
class AthenaAICharacterMovementComponent: public AthenaCharacterMovementComponent
{
public:
	Struct AIStrategyMovementProperties                          DefaultMovementProperties;                         // 0x838(0x18)
	TArray<Struct AIStrategyMovementProperties>                  AIStrategyMovementProperties;                      // 0x850(0x10)
	TArray<Struct ItemCategoryAIStrategyMovementPropertiesOverride> ItemCategoryAIStrategyMovementPropertiesOverrides; // 0x860(0x10)
	float                                                        BlendSpeed;                                        // 0x870(0x4)
	float                                                        KeepOnNavMeshProjectionDistance;                   // 0x874(0x4)
	bool                                                         bDebugKeepOnNavMesh;                               // 0x878(0x1)
	bool                                                         DisableNavMeshChecks;                              // 0x879(0x1)
	bool                                                         OverrideSmoothNetUpdateDistancesDuringCharge;      // 0x87a(0x1)
	float                                                        ChargeMaxSmoothNetUpdateDist;                      // 0x87c(0x4)
	float                                                        ChargeNoSmoothNetUpdateDist;                       // 0x880(0x4)
	float                                                        ChargeSmoothNetUpdateGracePeriod;                  // 0x884(0x4)
	float                                                        DesiredMaxSpeedAmp;                                // 0x928(0x4)
	float                                                        DesiredMaxAccelAmp;                                // 0x92c(0x4)
};


// Size 0x30
class AthenaCharacterMovementSettings: public Object
{
public:
	Struct NetPositionErrorTolerance                             StandardError;                                     // 0x28(0x8)
	Struct NetPositionErrorTolerance                             SwimmingError;                                     // 0x30(0x8)
	float                                                        SwimmingClientTrustThreshold;                      // 0x38(0x4)
	float                                                        MaxSwimmingTimeStep;                               // 0x3c(0x4)
	int                                                          MaxSwimmingIterations;                             // 0x40(0x4)
	float                                                        RebaseToServerErrorSqrDist;                        // 0x44(0x4)
	float                                                        OnlyInterpolationAfterSqrDist;                     // 0x48(0x4)
	float                                                        NoVisualUpdateAfterSqrDist;                        // 0x4c(0x4)
	float                                                        TimeBetweenPlayerDistanceChecks;                   // 0x50(0x4)
	float                                                        TimeToSimulateNewCharacters;                       // 0x54(0x4)
};


// Size 0xc0
class AthenaCharacterStateManagerComponent: public ActorComponent
{
public:
};


// Size 0x0
class AthenaCharacterTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x38
class AthenaContestTavern: public Actor
{
public:
	TArray<class SpawnLocation*>                                 TavernSpawnPoints;                                 // 0x3c8(0x10)
	TArray<class Actor*>                                         TavernLevelActorsToPrepare;                        // 0x3d8(0x10)
};


// Size 0x8
class PlayerPermissionsComponent: public ActorComponent
{
public:
	bool                                                         AllowDebugMenuAccess;                              // 0xc8(0x1)
	bool                                                         AllowDebugMenuButtonShortcutsAccess;               // 0xc9(0x1)
	bool                                                         AllowExecuteOnServer;                              // 0xca(0x1)
	bool                                                         DisableWatermark;                                  // 0xcb(0x1)
};


// Size 0x10
class AthenaDebugMenuComponent: public DebugMenuComponent
{
public:
};


// Size 0x10
class TestAthenaDebugMenuComponent: public AthenaDebugMenuComponent
{
public:
	Class PlayerPermissionsComponent*                            TestPermissionComponent;                           // 0x128(0x8)
};


// Size 0x10
class AthenaDebugSettings: public Object
{
public:
	Struct StringAssetReference                                  Dioramas;                                          // 0x28(0x10)
};


// Size 0x28
class AthenaEditorRuntimeSettings: public DeveloperSettings
{
public:
	int                                                          PIECrewSize;                                       // 0x38(0x4)
	bool                                                         PIEWithBootflow;                                   // 0x3c(0x1)
	class                                                        PIEShipSize;                                       // 0x40(0x8)
	bool                                                         PIEIsInitialTutorial;                              // 0x48(0x1)
	bool                                                         PIEIsArenaGame;                                    // 0x49(0x1)
	bool                                                         PIEIsCustomServer;                                 // 0x4a(0x1)
	TArray<Struct AthenaAnimationOverrideEntry>                  AnimationOverrideEntries;                          // 0x50(0x10)
};


// Size 0x90
class AthenaPlayModeLevelsDataAsset: public DataAsset
{
public:
	Struct PlayModeLevelArray                                    PlayModeSpecificLevels;                            // 0x28(0x20)
	TArray<Struct StringAssetReference>                          CommonLevels;                                      // 0xa8(0x10)
};


// Size 0x0
class UserBannedHandlerRetrievalInterface: public Interface
{
public:
};


// Size 0x6a8
class AthenaGameContext: public Object
{
public:
	Class VoiceChatRenderer*                                     VoiceChatRenderer;                                 // 0x98(0x8)
	Class AthenaPlayModeLevelsDataAsset*                         PlayModeLevels;                                    // 0xa0(0x8)
	Class FeatureToggledLevelsDataAsset*                         FeatureToggledLevels;                              // 0xa8(0x8)
	Class GameInstance*                                          PrimaryGameInstance;                               // 0x250(0x8)
	Class AthenaServerIdentityManager*                           AthenaServerIdentityManager;                       // 0x258(0x8)
	Struct GameServiceCoordinator                                ServiceCoordinator;                                // 0x260(0x20)
	Class AthenaLocalPlayerManager*                              AthenaLocalPlayerManager;                          // 0x478(0x8)
	Class AthenaLocalPlayerReengage*                             AthenaLocalPlayerReengage;                         // 0x480(0x8)
	Class GameNarrationCoordinator*                              GameNarrationCoordinator;                          // 0x488(0x8)
	Class ApplicationSettings*                                   ApplicationSettings;                               // 0x490(0x8)
};


// Size 0x20
class AthenaGameEngine: public RareGameEngine
{
public:
	Class AthenaGameEngineSettings*                              EngineSettings;                                    // 0xa90(0x8)
};


// Size 0x0
class AthenaGameEngineSettingsInterface: public Interface
{
public:
};


// Size 0x28
class AthenaGameEngineSettings: public Object
{
public:
};


// Size 0x20
class AthenaGameEngineSettingsWindows: public AthenaGameEngineSettings
{
public:
};


// Size 0x48
class AthenaGameInstance: public GameInstance
{
public:
	Class AthenaPlayModeLevelsDataAsset*                         AdditionalPlayModeLevels;                          // 0x90(0x8)
	Class AthenaGameContext*                                     GameContext;                                       // 0xa0(0x8)
};


// Size 0x5c0
class AthenaGameMode: public GameMode
{
public:
	class                                                        GhostShipPawnClass;                                // 0x4e8(0x8)
	class                                                        ServerNetworkedEventsWhitelistDefinition;          // 0x4f0(0x8)
	Struct GhostShipCoordinator                                  GhostShipCoordinator;                              // 0x690(0x2e0)
	Struct StorageContainerRefresher                             StorageContainerRefresher;                         // 0x970(0xd8)
	Class RiddleQuestDescGeneratorData*                          RiddleQuestDescGeneratorData;                      // 0xa48(0x8)
	float                                                        RespawnTimer;                                      // 0xa50(0x4)
	float                                                        SoloPlayerRespawnTimer;                            // 0xa54(0x4)
	float                                                        ContestRespawnTimer;                               // 0xa58(0x4)
	Struct CrewBasedRespawnTimes                                 CrewBasedRespawnTimes;                             // 0xa5c(0x10)
	float                                                        StorageContainerRefreshInterval;                   // 0xa6c(0x4)
	int                                                          ContainerRefreshBatchSize;                         // 0xa70(0x4)
};


// Size 0x1d0
class OnlineAthenaGameMode: public AthenaGameMode
{
public:
};


// Size 0x8
class TestAthenaGameMode: public AthenaGameMode
{
public:
};


// Size 0x0
class TestAthenaGameModeWithHUD: public TestAthenaGameMode
{
public:
};


// Size 0x0
class TestInventoryAthenaGameMode: public AthenaGameMode
{
public:
};


// Size 0x90
class AthenaGameplayDebuggingComponent: public GameplayDebuggingComponent
{
public:
	TArray<Str CurrentServerActionStates>                        CurrentServerActionStates;                         // 0x7e8(0x10)
	class                                                        CurrentAIStrategyId;                               // 0x7f8(0x8)
	TArray<Struct DebugReplicatedAbilityData>                    CachedAIAbilities;                                 // 0x800(0x10)
	TArray<Struct AthenaAIControllerTargetPickingData>           CachedAITargetPickingData;                         // 0x810(0x10)
	class                                                        NextAbility;                                       // 0x820(0x8)
	class                                                        QueuedAbility;                                     // 0x828(0x8)
	TArray<Class ReadiedAbilities>                               ReadiedAbilities;                                  // 0x830(0x10)
	Class AthenaAIAbilityHandlerComponent*                       AIAbilityComponent;                                // 0x840(0x8)
	bool                                                         FollowUpAbilitySet;                                // 0x848(0x1)
	int                                                          CurrentAbilityStageIndex;                          // 0x84c(0x4)
	TArray<Class AbilitiesActiveInCurrentStage>                  AbilitiesActiveInCurrentStage;                     // 0x850(0x10)
};


// Size 0x0
class AthenaGameplayDebuggingHUDComponent: public GameplayDebuggingHUDComponent
{
public:
};


// Size 0x10
class ShovelSurfaceFxDataAsset: public DataAsset
{
public:
	TArray<Struct DigSurfaceTypeParams>                          SurfaceParams;                                     // 0x28(0x10)
};


// Size 0x10
class ShovelSurfaceHoleDataAsset: public DataAsset
{
public:
	TArray<Struct SurfaceDigHole>                                SurfaceDigHoleClass;                               // 0x28(0x10)
};


// Size 0x838
class AthenaGameSettings: public Object
{
public:
	int                                                          NumberOfDaysInEachMonth;                           // 0x28(0x4)
	Struct FString                                               EntryMap;                                          // 0x30(0x10)
	Struct FString                                               FrontendMap;                                       // 0x40(0x10)
	Struct FString                                               InGameMap;                                         // 0x50(0x10)
	Struct FString                                               TutorialMap;                                       // 0x60(0x10)
	Struct StringAssetReference                                  PlayModeLevels;                                    // 0x70(0x10)
	Struct StringAssetReference                                  FeatureToggledLevels;                              // 0x80(0x10)
	Struct FString                                               OverrideServerURL;                                 // 0x90(0x10)
	float                                                        LoadLevelTimeoutTime;                              // 0xa0(0x4)
	float                                                        ServiceBridgeConnectTimeout;                       // 0xa4(0x4)
	Struct StringAssetReference                                  CinematicCameraControllerClass;                    // 0x108(0x10)
	Struct StringAssetReference                                  CinematicCameraSpectatorPawnClass;                 // 0x118(0x10)
	Struct StringAssetReference                                  MaterialTranslationTableFileLocation;              // 0x128(0x10)
	Struct StringAssetReference                                  MaterialAudioTableFileLocation;                    // 0x138(0x10)
	Struct StringAssetReference                                  MaterialVFXTableFileLocation;                      // 0x148(0x10)
	Struct StringAssetReference                                  ShipAssetClassDatabaseFileLocation;                // 0x158(0x10)
	Struct StringAssetReference                                  AIPersistentPartsServiceAssetClassFileLocation;    // 0x168(0x10)
	Struct StringAssetReference                                  AIPartsServiceAssetClassFileLocation;              // 0x178(0x10)
	Struct StringAssetReference                                  DebugMenuFileLocation;                             // 0x188(0x10)
	Struct StringAssetReference                                  SpawnLocationKeywordPriorityListLocation;          // 0x198(0x10)
	Struct StringAssetReference                                  CrewSpawnLocationVariablesListAsset;               // 0x1a8(0x10)
	Struct StringAssetReference                                  SkellyFortDataFileLocation;                        // 0x1b8(0x10)
	Struct StringAssetReference                                  SkellyFortListDataFileLocation;                    // 0x1c8(0x10)
	Struct StringAssetReference                                  AIShipServiceDataAssetFileLocation;                // 0x1d8(0x10)
	Struct ToggleableAIShipServiceDataAssetFileLocation          AIShipServiceDataAssetFileLocationOverride;        // 0x1e8(0x18)
	Struct StringAssetReference                                  ProjectileServiceDataFileLocation;                 // 0x200(0x10)
	Struct StringAssetReference                                  ThrottledProjectileTickDataAssetLocation;          // 0x210(0x10)
	Struct StringAssetReference                                  HoleDataFileLocation;                              // 0x220(0x10)
	Struct StringAssetReference                                  PlayerBuriedItemServiceDataFileLocation;           // 0x230(0x10)
	Struct StringAssetReference                                  ItemLifetimeIslandCapsDataFileLocation;            // 0x240(0x10)
	Struct StringAssetReference                                  CursedCannonballDataAsset;                         // 0x250(0x10)
	Struct StringAssetReference                                  Throwables;                                        // 0x260(0x10)
	class                                                        ThrowablesItemCategory;                            // 0x270(0x8)
	Struct StringAssetReference                                  SpawnableItemsDataAssetLocation;                   // 0x278(0x10)
	Struct StringAssetReference                                  FireworksDebugSpawnItemsDataAsset;                 // 0x288(0x10)
	Struct StringAssetReference                                  UnlockableEntitlementsDataAssetLocation;           // 0x298(0x10)
	Struct StringAssetReference                                  DebugWieldablesDataAsset;                          // 0x2a8(0x10)
	Struct StringAssetReference                                  StrongholdKeyDataAsset;                            // 0x2b8(0x10)
	Struct StringAssetReference                                  MigrationUIContentsFileLocation;                   // 0x2c8(0x10)
	Struct StringAssetReference                                  ArenaMigrationUIContentsFileLocation;              // 0x2d8(0x10)
	Struct StringAssetReference                                  InventoryRemappingAssetLocation;                   // 0x2e8(0x10)
	Struct StringAssetReference                                  AllianceSettingsAssetLocation;                     // 0x2f8(0x10)
	Struct StringAssetReference                                  ReapersMarkSettingsAssetLocation;                  // 0x308(0x10)
	Struct StringAssetReference                                  EmissaryLevelSettingsAssetLocation;                // 0x318(0x10)
	Struct StringAssetReference                                  EmissaryRewardSettingsAssetLocation;               // 0x328(0x10)
	Struct StringAssetReference                                  FactionSettingsAssetLocation;                      // 0x338(0x10)
	Struct StringAssetReference                                  FactionLootLevelRewardsAssetLocation;              // 0x348(0x10)
	Struct StringAssetReference                                  FlamesOfFateSettingsAssetLocation;                 // 0x358(0x10)
	Struct StringAssetReference                                  DiggingConfigResolverAssetLocation;                // 0x368(0x10)
	Struct StringAssetReference                                  ContestSettingsDataAsset;                          // 0x378(0x10)
	Struct StringAssetReference                                  ContestEventsDataAsset;                            // 0x388(0x10)
	Struct StringAssetReference                                  CrewNotificationToastSettings;                     // 0x398(0x10)
	Struct StringAssetReference                                  FireSettingsDataAsset;                             // 0x3a8(0x10)
	Struct FString                                               InventoryDefaultItemURL;                           // 0x3b8(0x10)
	float                                                        CheatFlyingSpeedSlow;                              // 0x3c8(0x4)
	float                                                        CheatFlyingSpeedDefault;                           // 0x3cc(0x4)
	float                                                        CheatFlyingSpeedFast;                              // 0x3d0(0x4)
	float                                                        CheatFlyingAcceleration;                           // 0x3d4(0x4)
	Struct EncounterServiceParams                                EncounterServiceParams;                            // 0x3d8(0x20)
	Struct WindServiceParams                                     WindParams;                                        // 0x3f8(0x24)
	Struct CrewServiceParams                                     CrewServiceParams;                                 // 0x420(0x60)
	Struct SharedShovelParams                                    SharedShovelParams;                                // 0x480(0x60)
	Struct MermaidServiceParams                                  MermaidServiceParams;                              // 0x4e0(0x88)
	Struct MermaidServiceParams                                  ContestSpecificMermaidServiceParamsToggleLocked;   // 0x568(0x88)
	Struct MakeFriendsEmoteParams                                MakeFriendsEmoteParams;                            // 0x5f0(0x18)
	Struct MermaidRespawnConfig                                  MermaidRespawnConfiguration;                       // 0x608(0x28)
	Struct CharacterSocketCollisionServiceParams                 CharacterSocketCollisionServiceParams;             // 0x630(0x8)
	Struct AthenaAICharacterParams                               AAthenaAICharacterParams;                          // 0x638(0x14)
	int                                                          AssumedMaxFPSOnServer;                             // 0x64c(0x4)
	struct FName                                                 WwiseObjectUnderwaterStateSwitchGroup;             // 0x650(0x8)
	struct FName                                                 WwiseObjectUnderwaterSwitchDefaultState;           // 0x658(0x8)
	struct FName                                                 WwiseObjectUnderwaterSwitchUnderwaterState;        // 0x660(0x8)
	float                                                        StormQuantisePrecision;                            // 0x668(0x4)
	Struct StringAssetReference                                  ShipLiveryCatalogueDataAssetLocation;              // 0x670(0x10)
	Struct StringAssetReference                                  ShipPartsCatalogueDataAssetLocation;               // 0x680(0x10)
	Struct StringAssetReference                                  RowboatSpawnParamsDataAssetLocation;               // 0x690(0x10)
	Struct StringAssetReference                                  KrakenTentacleClassLocation;                       // 0x6a0(0x10)
	Struct StringAssetReference                                  KrakenShipTentacleClassLocation;                   // 0x6b0(0x10)
	Struct StringAssetReference                                  KrakenServiceParamsDataAssetLocation;              // 0x6c0(0x10)
	Struct StringAssetReference                                  AmbientTinySharkServiceParamsDataAssetLocation;    // 0x6d0(0x10)
	Struct StringAssetReference                                  SunkenIslandSettings;                              // 0x6e0(0x10)
	Struct StringAssetReference                                  CompanyDataListAssetLocation;                      // 0x6f0(0x10)
	Struct StringAssetReference                                  CoherentUIGTAssetRootLocation;                     // 0x700(0x10)
	Struct StringAssetReference                                  CoherentUIGTPersistentDataAssetLocation;           // 0x710(0x10)
	Struct StringAssetReference                                  CoherentContentEngagementMessageLocation;          // 0x720(0x10)
	Struct StringAssetReference                                  NestedWorldRootDataAssetLocation;                  // 0x730(0x10)
	Struct StringAssetReference                                  AshenLordEncounterServiceParams;                   // 0x740(0x10)
	Struct StringAssetReference                                  PortalServiceParams;                               // 0x750(0x10)
	Struct StringAssetReference                                  AggressiveGhostShipsEncounterServiceParams;        // 0x760(0x10)
	TArray<AssetClass RequiredLoadoutCategories>                 RequiredLoadoutCategories;                         // 0x770(0x10)
	Struct StringAssetReference                                  CarouselGenerationParams;                          // 0x780(0x10)
	float                                                        SinkingShipDestructionDistanceThreshold;           // 0x790(0x4)
	Struct StringAssetReference                                  DefaultItemsToBeDisplayedOnInventoryPanel;         // 0x798(0x10)
	class                                                        DefaultFogBank;                                    // 0x7a8(0x8)
	class                                                        DefaultFogBankManager;                             // 0x7b0(0x8)
	Struct StringAssetReference                                  TunnelsOfTheDamnedServiceParamsDataAssetLocation;  // 0x7b8(0x10)
	Struct PlayerModerationParams                                PlayerModerationParams;                            // 0x7c8(0xc)
	Struct StringAssetReference                                  SpireServiceParamsDataAssetLocation;               // 0x7d8(0x10)
	class                                                        GhostCurseEntitlement;                             // 0x7e8(0x8)
	struct FName                                                 GhostCurseRewardId;                                // 0x7f0(0x8)
	class                                                        SkeletonCurseEntitlement;                          // 0x7f8(0x8)
	struct FName                                                 SkeletonCurseRewardId;                             // 0x800(0x8)
	struct FName                                                 SkeletonCurseWardrobeKey;                          // 0x808(0x8)
	TArray<Class SkeletonClothingCategories>                     SkeletonClothingCategories;                        // 0x810(0x10)
	Struct StringAssetReference                                  SkeletonClothingEntitlementMapDataAsset;           // 0x820(0x10)
	TArray<Byte KillNotificationHealthChangeReasons>             KillNotificationHealthChangeReasons;               // 0x830(0x10)
	Struct StringAssetReference                                  ShipStorageJettisonParamsDataAsset;                // 0x840(0x10)
	Struct StringAssetReference                                  WorldEdgeItemParamsDataAsset;                      // 0x850(0x10)
};


// Size 0x648
class AthenaGameState: public ServiceProviderGameState
{
public:
	Class WindService*                                           WindService;                                       // 0x5b8(0x8)
	Class PlayerManagerService*                                  PlayerManagerService;                              // 0x5c0(0x8)
	Class ShipService*                                           ShipService;                                       // 0x5c8(0x8)
	Class WatercraftService*                                     WatercraftService;                                 // 0x5d0(0x8)
	Class TimeService*                                           TimeService;                                       // 0x5d8(0x8)
	Class HealthCustomizationService*                            HealthService;                                     // 0x5e0(0x8)
	Class CustomWeatherService*                                  CustomWeatherService;                              // 0x5e8(0x8)
	Class CustomStatusesService*                                 CustomStatusesService;                             // 0x5f0(0x8)
	Class FFTWaterService*                                       WaterService;                                      // 0x5f8(0x8)
	Class StormService*                                          StormService;                                      // 0x600(0x8)
	Class CrewService*                                           CrewService;                                       // 0x608(0x8)
	Class CaptainedSessionService*                               CaptainedSessionService;                           // 0x610(0x8)
	Class ContestZoneService*                                    ContestZoneService;                                // 0x618(0x8)
	Class ContestRowboatsService*                                ContestRowboatsService;                            // 0x620(0x8)
	Class IslandService*                                         IslandService;                                     // 0x628(0x8)
	Class NPCService*                                            NPCService;                                        // 0x630(0x8)
	Class SkellyFortService*                                     SkellyFortService;                                 // 0x638(0x8)
	Class DeepSeaRegionService*                                  DeepSeaRegionService;                              // 0x640(0x8)
	Class AIDioramaService*                                      AIDioramaService;                                  // 0x648(0x8)
	Class AshenLordEncounterService*                             AshenLordEncounterService;                         // 0x650(0x8)
	Class AggressiveGhostShipsEncounterService*                  AggressiveGhostShipsEncounterService;              // 0x658(0x8)
	Class TallTaleService*                                       TallTaleService;                                   // 0x660(0x8)
	Class AIShipObstacleService*                                 AIShipObstacleService;                             // 0x668(0x8)
	Class AIShipService*                                         AIShipService;                                     // 0x670(0x8)
	Class AITargetService*                                       AITargetService;                                   // 0x678(0x8)
	Class ShipLiveryCatalogueService*                            ShipLiveryCatalogueService;                        // 0x680(0x8)
	Class DrawDebugService*                                      DrawDebugService;                                  // 0x688(0x8)
	Class WorldEventZoneService*                                 WorldEventZoneService;                             // 0x690(0x8)
	Class WorldResourceRegistry*                                 WorldResourceRegistry;                             // 0x698(0x8)
	Class KrakenService*                                         KrakenService;                                     // 0x6a0(0x8)
	Class PlayerNameService*                                     PlayerNameService;                                 // 0x6a8(0x8)
	Class TinySharkService*                                      TinySharkService;                                  // 0x6b0(0x8)
	Class ProjectileService*                                     ProjectileService;                                 // 0x6b8(0x8)
	Class LaunchableProjectileService*                           LaunchableProjectileService;                       // 0x6c0(0x8)
	Class ServerNotificationsService*                            ServerNotificationsService;                        // 0x6c8(0x8)
	Class AIManagerService*                                      AIManagerService;                                  // 0x6d0(0x8)
	Class AIEncounterService*                                    AIEncounterService;                                // 0x6d8(0x8)
	Class AIEncounterGenerationService*                          AIEncounterGenerationService;                      // 0x6e0(0x8)
	Class EncounterService*                                      EncounterService;                                  // 0x6e8(0x8)
	Class GameEventSchedulerService*                             GameEventSchedulerService;                         // 0x6f0(0x8)
	Class HideoutService*                                        HideoutService;                                    // 0x6f8(0x8)
	Class AthenaStreamedLevelService*                            StreamedLevelService;                              // 0x700(0x8)
	Class LocationProviderService*                               LocationProviderService;                           // 0x708(0x8)
	Class HoleService*                                           HoleService;                                       // 0x710(0x8)
	Class PlayerBuriedItemService*                               PlayerBuriedItemService;                           // 0x718(0x8)
	Class LoadoutService*                                        LoadoutService;                                    // 0x720(0x8)
	Class OcclusionService*                                      OcclusionService;                                  // 0x728(0x8)
	Class PetsService*                                           PetsService;                                       // 0x730(0x8)
	Class AthenaAITeamsService*                                  AthenaAITeamsService;                              // 0x738(0x8)
	Class AllianceService*                                       AllianceService;                                   // 0x740(0x8)
	Class MaterialAccessibilityService*                          MaterialAccessibilityService;                      // 0x748(0x8)
	Class NPCLoadedOnClientService*                              NPCLoadedOnClientService;                          // 0x750(0x8)
	Class ReapersMarkService*                                    ReapersMarkService;                                // 0x758(0x8)
	Class EmissaryLevelService*                                  EmissaryLevelService;                              // 0x760(0x8)
	Class FactionService*                                        FactionService;                                    // 0x768(0x8)
	Class CampaignService*                                       CampaignService;                                   // 0x770(0x8)
	Class StoryService*                                          StoryService;                                      // 0x778(0x8)
	Class StorySpawnedActorsService*                             StorySpawnedActorsService;                         // 0x780(0x8)
	Class StoryClaimedResourcesService*                          StoryClaimedResourcesService;                      // 0x788(0x8)
	Class GlobalVoyageDirectorService*                           GlobalVoyageDirector;                              // 0x790(0x8)
	Class FlamesOfFateSettingsService*                           FlamesOfFateSettingsService;                       // 0x798(0x8)
	Class ServiceStatusNotificationsService*                     ServiceStatusNotificationsService;                 // 0x7a0(0x8)
	Class MigrationService*                                      MigrationService;                                  // 0x7a8(0x8)
	Class ShipStockService*                                      ShipStockService;                                  // 0x7b0(0x8)
	Class ShroudBreakerService*                                  ShroudBreakerService;                              // 0x7b8(0x8)
	Class ServerUpdateReportingService*                          ServerUpdateReportingService;                      // 0x7c0(0x8)
	Class GenericMarkerService*                                  GenericMarkerService;                              // 0x7c8(0x8)
	Class MechanismsService*                                     MechanismsService;                                 // 0x7d0(0x8)
	Class MerchantContractsService*                              MerchantContractsService;                          // 0x7d8(0x8)
	Class ShipFactory*                                           ShipFactory;                                       // 0x7e0(0x8)
	Class RewindPhysicsService*                                  RewindPhysicsService;                              // 0x7e8(0x8)
	Class NotificationMessagesDataAsset*                         NotificationMessagesDataAsset;                     // 0x7f0(0x8)
	Class ProjectileCooldownService*                             ProjectileCooldownService;                         // 0x7f8(0x8)
	Class IslandReservationService*                              IslandReservationService;                          // 0x800(0x8)
	Class PortalService*                                         PortalService;                                     // 0x808(0x8)
	Class MeshMemoryConstraintService*                           MeshMemoryConstraintService;                       // 0x810(0x8)
	Class BootyStorageService*                                   BootyStorageService;                               // 0x818(0x8)
	Class LoadoutCostService*                                    LoadoutCostService;                                // 0x820(0x8)
	Class SpireService*                                          SpireService;                                      // 0x828(0x8)
	Class FireworkService*                                       FireworkService;                                   // 0x830(0x8)
	Class InvasionService*                                       InvasionService;                                   // 0x838(0x8)
	Class AirGivingService*                                      AirGivingService;                                  // 0x840(0x8)
	Class CutsceneService*                                       CutsceneService;                                   // 0x848(0x8)
	Class CargoRunService*                                       CargoRunService;                                   // 0x850(0x8)
	Class CommodityDemandService*                                CommodityDemandService;                            // 0x858(0x8)
	Class DebugTeleportationDestinationService*                  DebugTeleportationDestinationService;              // 0x860(0x8)
	Class SeasonProgressionUIService*                            SeasonProgressionUIService;                        // 0x868(0x8)
	Class TransientActorService*                                 TransientActorService;                             // 0x870(0x8)
	Class TunnelsOfTheDamnedService*                             TunnelsOfTheDamnedService;                         // 0x878(0x8)
	Class WorldSequenceService*                                  WorldSequenceService;                              // 0x880(0x8)
	Class ItemLifetimeManagerService*                            ItemLifetimeManagerService;                        // 0x888(0x8)
	Class ShipStorageJettisonService*                            ShipStorageJettisonService;                        // 0x890(0x8)
	Class SeaFortsService*                                       SeaFortsService;                                   // 0x898(0x8)
	Class CustomServerLocalisationService*                       CustomServerLocalisationService;                   // 0x8a0(0x8)
	Class BeckonService*                                         BeckonService;                                     // 0x8a8(0x8)
	Class VolcanoService*                                        VolcanoService;                                    // 0x8b0(0x8)
	Class ShipAnnouncementService*                               ShipAnnouncementService;                           // 0x8b8(0x8)
	Class ShipsLogService*                                       ShipsLogService;                                   // 0x8c0(0x8)
	Class AsyncLoadingMonitoringService*                         AsyncLoadingMonitoringService;                     // 0x8c8(0x8)
	Class ActorOfInterestService*                                ActorOfInterestService;                            // 0x8d0(0x8)
	Class UserSettingsService*                                   UserSettingsService;                               // 0x8d8(0x8)
	Struct GameServiceCoordinator                                ServiceCoordinator;                                // 0xa60(0x20)
	TArray<Interface ChatComponents>                             ChatComponents;                                    // 0xaa8(0x10)
	bool                                                         IsXboxGamePadOnlyServer;                           // 0xb38(0x1)
	bool                                                         ShouldDisableAsyncOcclusionCheck;                  // 0xb39(0x1)
	Struct FString                                               SubPlayMode;                                       // 0xb40(0x10)
	Class CustomVaultService*                                    CustomVaultService;                                // 0xb50(0x8)
	Class EntityEnumerationService*                              EntityEnumerationService;                          // 0xb58(0x8)
	Class LevelAssetCachingService*                              LevelAssetCachingService;                          // 0xb60(0x8)
	Class CrewSkillRatingService*                                CrewSkillRatingService;                            // 0xb68(0x8)
};


// Size 0x40
class AthenaGameUserSettings: public GameUserSettings
{
public:
	int                                                          MaxVerticalResolution;                             // 0x78(0x4)
	int                                                          MaxFPS;                                            // 0x7c(0x4)
	int                                                          VSync;                                             // 0x80(0x4)
	int                                                          LightingDetail;                                    // 0x84(0x4)
	int                                                          ModelDetail;                                       // 0x88(0x4)
	int                                                          ShadowDetail;                                      // 0x8c(0x4)
	int                                                          TextureDetail;                                     // 0x90(0x4)
	int                                                          WaterDetail;                                       // 0x94(0x4)
	int                                                          AnimationQuality;                                  // 0x98(0x4)
	int                                                          MMCThresholdScale;                                 // 0x9c(0x4)
	float                                                        ResolutionScaling;                                 // 0xa0(0x4)
	int                                                          ParticleEmitterQuality;                            // 0xa4(0x4)
	int                                                          ParticleResolutionQuality;                         // 0xa8(0x4)
	int                                                          BackBufferCount;                                   // 0xac(0x4)
	int                                                          ShowPerformanceCounters;                           // 0xb0(0x4)
	bool                                                         SmoothFPS;                                         // 0xb4(0x1)
	bool                                                         HDR;                                               // 0xb5(0x1)
	bool                                                         AudioOutputSpatialAudio;                           // 0xb6(0x1)
	bool                                                         Fullscreen;                                        // 0xb7(0x1)
};


// Size 0x10
class AthenaGameViewportClient: public GameViewportClient
{
public:
};


// Size 0x2a8
class AthenaLocalPlayerManager: public Object
{
public:
};


// Size 0x120
class AthenaLocalPlayerReengage: public Object
{
public:
};


// Size 0x0
class AthenaPlayerCharacterTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0
class CharacterAnimaticSettingsInterface: public Interface
{
public:
};


// Size 0x78
class CharacterAnimaticSettingsComponent: public ActorComponent
{
public:
	bool                                                         HasPlayedWakeUpAnimation;                          // 0x138(0x1)
};


// Size 0x3a0
class AthenaPlayerState: public PlayerState
{
public:
	Class VoiceChatComponent*                                    VoiceChatComponent;                                // 0x498(0x8)
	Struct FString                                               Sandbox;                                           // 0x4f8(0x10)
	Struct FString                                               ClientPlatform;                                    // 0x508(0x10)
	Struct FString                                               DeviceID;                                          // 0x518(0x10)
	Struct PirateIdentity                                        PirateIdentity;                                    // 0x528(0x78)
	Struct Guid                                                  PlayerGameId;                                      // 0x640(0x10)
	Struct PirateDescription                                     PirateDesc;                                        // 0x650(0x80)
	int                                                          PlayerIndexOnServer;                               // 0x6d0(0x4)
	Struct FString                                               PlayerNameDebug;                                   // 0x710(0x10)
	byte                                                         PlayerActivity;                                    // 0x720(0x1)
};


// Size 0x10
class MerchantQuestRandomRequiredItemsDataAsset: public DataAsset
{
public:
	TArray<Struct MerchantQuestCategoryGroup>                    CategoryGroups;                                    // 0x28(0x10)
};


// Size 0x148
class VoyageRecipeDataAsset: public DataAsset
{
public:
	Struct VoyageRecipe                                          Recipe;                                            // 0x28(0x140)
	bool                                                         IsVoyageLocationBound;                             // 0x168(0x1)
};


// Size 0x1b8
class EmergentContestVoyageRecipeDataAsset: public VoyageRecipeDataAsset
{
public:
	Struct EmergentContestVoyageRecipe                           ContestVoyageRecipe;                               // 0x170(0x1b8)
};


// Size 0x140
class VoyageDescDataAsset: public DataAsset
{
public:
	TArray<Struct ChapterQuests>                                 Chapters;                                          // 0x28(0x10)
	TArray<Struct FeatureToggledChapters>                        FeatureToggledChapters;                            // 0x38(0x10)
	Struct FText                                                 Title;                                             // 0x48(0x38)
	Struct FText                                                 Description;                                       // 0x80(0x38)
	Struct FText                                                 LockedDescription;                                 // 0xb8(0x38)
	Struct StringAssetReference                                  KeyArtUrl;                                         // 0xf0(0x10)
	Struct StringAssetReference                                  IconUrl;                                           // 0x100(0x10)
	class                                                        Company;                                           // 0x110(0x8)
	bool                                                         IsEmergent;                                        // 0x118(0x1)
	bool                                                         IsTale;                                            // 0x119(0x1)
	bool                                                         IsStarlightTale;                                   // 0x11a(0x1)
	bool                                                         IsUtilityVoyage;                                   // 0x11b(0x1)
	bool                                                         IsAdventure;                                       // 0x11c(0x1)
	bool                                                         IsCrossWorld;                                      // 0x11d(0x1)
	bool                                                         IsAthenaVoyage2;                                   // 0x11e(0x1)
	Struct ViewVoyageBanners                                     ViewVoyageBanners;                                 // 0x11f(0x2)
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x121(0x1)
	bool                                                         DoNotNotifyParticipantsOfQuestPages;               // 0x122(0x1)
	int                                                          Rank;                                              // 0x124(0x4)
	TArray<Struct PlayerStat>                                    VoyageCompletionStats;                             // 0x128(0x10)
	TArray<Struct PlayerStat>                                    ReapersMarkCompletionStats;                        // 0x138(0x10)
	struct FName                                                 CampaignId;                                        // 0x148(0x8)
	Struct StringAssetReference                                  TaleCancelVoteMesh;                                // 0x150(0x10)
	byte                                                         EmergentSource;                                    // 0x160(0x1)
};


// Size 0x48
class TallTaleContestRecipeDataAsset: public VoyageDescDataAsset
{
public:
	Struct ContestZoneDistribution                               WeightedContestZonesToActivate;                    // 0x168(0x10)
	TArray<Struct ContestIslandArchetype>                        AvailableIslandArchetypes;                         // 0x178(0x10)
	Struct ContestTimerData                                      ContestVoyageTime;                                 // 0x188(0x18)
	Struct StringClassReference                                  ScoreSystemToLoad;                                 // 0x1a0(0x10)
};


// Size 0x0
class ContestManagerServiceInterface: public Interface
{
public:
};


// Size 0x90
class UIResponceComponent: public ActorComponent
{
public:
	Class AthenaPlayerController*                                OwningPlayerController;                            // 0xc8(0x8)
};


// Size 0x1d8
class PlayerTelemetryComponent: public ActorComponent
{
public:
	float                                                        HeartbeatInterval;                                 // 0x12c(0x4)
	Struct DateTime                                              SpawnTimestamp;                                    // 0x270(0x8)
};


// Size 0x20
class IslandEventType: public Object
{
public:
	Struct IslandEventIcons                                      IslandIcons;                                       // 0x28(0x10)
	Struct IslandEventIcons                                      HeaderIcons;                                       // 0x38(0x10)
};


// Size 0x0
class TallTaleIslandEventType: public IslandEventType
{
public:
};


// Size 0x30
class MapTableCanvasDataAsset: public DataAsset
{
public:
	Struct MapTableCanvasDetails                                 CanvasDetails;                                     // 0x28(0x30)
};


// Size 0x60
class VoyageProposalDesc: public EntitlementDesc
{
public:
	class                                                        TradingCompany;                                    // 0xc8(0x8)
	int                                                          Rank;                                              // 0xd0(0x4)
	bool                                                         UseDifficultyAsRank;                               // 0xd4(0x1)
	bool                                                         UnlockedForAnyRank;                                // 0xd5(0x1)
	bool                                                         AvailableEvenIfRecentlySeen;                       // 0xd6(0x1)
	int                                                          Difficulty;                                        // 0xd8(0x4)
	Struct StringAssetReference                                  TooltipBackgroundImageUrl;                         // 0xe0(0x10)
	Class VoyageRecipeDataAsset*                                 VoyageRecipe;                                      // 0xf0(0x8)
	Class VoyageDescDataAsset*                                   VoyageDesc;                                        // 0xf8(0x8)
	Struct StringAssetReference                                  OverrideVotingTableVoyageProposalMesh;             // 0x100(0x10)
	Struct StringAssetReference                                  OverrideOpenVoyageProposalMesh;                    // 0x110(0x10)
};


// Size 0x68
class IslandEventHUDData: public DataAsset
{
public:
	TArray<Class EventTypes>                                     EventTypes;                                        // 0x28(0x10)
	Struct Vector2D                                              IslandIconSize;                                    // 0x38(0x8)
	Struct Vector2D                                              HeaderIconSize;                                    // 0x40(0x8)
	float                                                        HeaderYOffset;                                     // 0x48(0x4)
	float                                                        TriggerLerpAtZoomLevel;                            // 0x4c(0x4)
	Struct CanvasLerpData                                        LerpData;                                          // 0x50(0x10)
	Struct CanvasLerpData                                        HighlightLerpData;                                 // 0x60(0x10)
	Struct CanvasLerpData                                        FadeInOutData;                                     // 0x70(0x10)
	float                                                        MarkerHighlightRadiusAdjuster;                     // 0x80(0x4)
	Struct Vector2D                                              MarkerHighlightCentreOffset;                       // 0x84(0x8)
	float                                                        MarkerHighlightScale;                              // 0x8c(0x4)
};


// Size 0x80
class IslandEventTrackerComponent: public ActorComponent
{
public:
	TArray<Struct IslandEventData>                               EventData;                                         // 0xc8(0x10)
};


// Size 0x0
class IslandEventTrackerInterface: public Interface
{
public:
};


// Size 0xdd8
class AthenaPlayerController: public PlayerController
{
public:
	Class PioneerComponent*                                      PioneerComponent;                                  // 0x7e0(0x8)
	Class PlayerPermissionsComponent*                            PlayerPermissionsComponent;                        // 0x7e8(0x8)
	Class PlayerTelemetryComponent*                              PlayerTelemetryComponent;                          // 0x7f0(0x8)
	Class PlayerStatsComponent*                                  PlayerStatsComponent;                              // 0x7f8(0x8)
	Class PlayerSeasonProgressionComponent*                      PlayerSeasonProgressionComponent;                  // 0x800(0x8)
	Class PlayerHeroStatsComponent*                              PlayerHeroStatsComponent;                          // 0x808(0x8)
	Class PlayerWalletComponent*                                 PlayerWalletComponent;                             // 0x810(0x8)
	Class BoxedRpcDispatcherComponent*                           BoxedRpcDispatcherComponent;                       // 0x818(0x8)
	Class PlayerEntitlementComponent*                            PlayerEntitlementComponent;                        // 0x820(0x8)
	Class PlayerMigratableStatusComponent*                       PlayerMigratableStatusComponent;                   // 0x828(0x8)
	Class EmblemComponent*                                       EmblemComponent;                                   // 0x830(0x8)
	Class PlayerCompanyComponent*                                PlayerCompanyComponent;                            // 0x838(0x8)
	Class LeaderboardComponent*                                  LeaderboardComponent;                              // 0x840(0x8)
	Class RewardComponent*                                       RewardComponent;                                   // 0x848(0x8)
	Class PlayerNonVerbalComponent*                              PlayerNonVerbalComponent;                          // 0x850(0x8)
	Class PlayerCrewComponent*                                   PlayerCrewComponent;                               // 0x858(0x8)
	Class PlayerMuteComponent*                                   PlayerMuteComponent;                               // 0x860(0x8)
	Class UIResponceComponent*                                   PlayerUIReturnedResponceComponent;                 // 0x868(0x8)
	Class PopUpNotificationComponent*                            PopUpNotificationComponent;                        // 0x870(0x8)
	Class EncounterListenerComponent*                            EncounterListenerComponent;                        // 0x878(0x8)
	Class CharacterAnimaticSettingsComponent*                    CharacterAnimaticSettingsComponent;                // 0x880(0x8)
	Class AthenaTutorialComponent*                               TutorialComponent;                                 // 0x888(0x8)
	Class ContextualTutorialComponent*                           ContextualTutorialComponent;                       // 0x890(0x8)
	Class ShantySelectionComponent*                              ShantySelectionComponent;                          // 0x898(0x8)
	Class TutorialManager*                                       TutorialManagerComponent;                          // 0x8a0(0x8)
	Class EmissaryActionRewardBoostComponent*                    EmissaryActionRewardBoostComponent;                // 0x8a8(0x8)
	Class PlayerMysteriousNoteComponent*                         PlayerMysteriousNoteComponent;                     // 0x8b0(0x8)
	Class EmissaryParticipantComponent*                          EmissaryParticipantComponent;                      // 0x8b8(0x8)
	Class CommodityPurchaseTrackingComponent*                    CommodityPurchaseTrackingComponent;                // 0x8c0(0x8)
	Class PlayerActivityComponent*                               PlayerActivityComponent;                           // 0x8c8(0x8)
	Class IslandEventTrackerComponent*                           IslandEventTrackerComponent;                       // 0x8d0(0x8)
	Class CampaignComponent*                                     CampaignComponent;                                 // 0x8d8(0x8)
	Class TaleQuestQueryableStatesAccessComponent*               TaleQuestQueryableStatesAccessComponent;           // 0x8e0(0x8)
	float                                                        InputRawYawScale;                                  // 0x8e8(0x4)
	float                                                        InputRawPitchScale;                                // 0x8ec(0x4)
	Struct InventoryMemory                                       InventoryMemory;                                   // 0x8f0(0x50)
	Class CinematicCameraController*                             CinematicCameraController;                         // 0x940(0x8)
	Struct Guid                                                  ClientSessionId;                                   // 0x13c8(0x10)
	Class PromptsLocalService*                                   PromptsLocalService;                               // 0x1448(0x8)
	Class CurveFloat*                                            AutoCentreCurve;                                   // 0x1450(0x8)
	Struct Vector                                                CinematicCameraControllerLocation;                 // 0x1480(0xc)
	Struct Rotator                                               CinematicCameraControllerRotation;                 // 0x148c(0xc)
	Struct PirateIdentity                                        PirateIdentity;                                    // 0x1498(0x78)
	byte                                                         DeathFlameOfFateType;                              // 0x1510(0x1)
	byte                                                         FlameOfFateType;                                   // 0x1511(0x1)
	Class IndividualReplicationChannel*                          IndividualReplicationChannel;                      // 0x1518(0x8)
	Struct FString                                               DebugServerMigrationEndpoint;                      // 0x1538(0x10)
};


// Size 0xc8
class OnlineAthenaPlayerController: public AthenaPlayerController
{
public:
	Struct MysteriousNotesCompletionEventsModelEntry             LogoutNoteCompletionIdent;                         // 0x1550(0x8)
	bool                                                         IdleDisconnectEnabled;                             // 0x1571(0x1)
};


// Size 0x40
class TestAthenaPlayerController: public AthenaPlayerController
{
public:
	Class ForceFeedbackEffect*                                   LastReceivedForceFeedbackEffect;                   // 0x1548(0x8)
};


// Size 0x0
class TestAthenaPlayerControllerWithAthenaPlayerCameraManager: public TestAthenaPlayerController
{
public:
};


// Size 0x0
class PlayerRelevancyServiceInterface: public Interface
{
public:
};


// Size 0x28
class TestPlayerRelevancyAthenaPlayerController: public AthenaPlayerController
{
public:
};


// Size 0x0
class AthenaPlayerControllerTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x18
class TestAthenaPlayerState: public AthenaPlayerState
{
public:
};


// Size 0xf8
class AthenaPlayerZonePenetrationTrackerComponent: public ActorComponent
{
public:
	byte                                                         OverlapType;                                       // 0xd0(0x1)
	float                                                        UpdateInterval;                                    // 0xd4(0x4)
	Class ShapeComponent*                                        ShapeComponent;                                    // 0xd8(0x8)
	TArray<class AthenaPlayerCharacter*>                         PlayersInZone;                                     // 0xe0(0x10)
};


// Size 0x30
class AthenaServerIdentityManager: public Object
{
public:
};


// Size 0xc0
class AthenaTextRender: public StaticMeshActor
{
public:
	Struct FText                                                 Text;                                              // 0x3d8(0x38)
	Struct TreasureMapWidgetText                                 TextDesc;                                          // 0x410(0x38)
	int                                                          CanvasWidth;                                       // 0x448(0x4)
	int                                                          CanvasHeight;                                      // 0x44c(0x4)
	Class Font*                                                  Font;                                              // 0x450(0x8)
	Struct Vector2D                                              FontScale;                                         // 0x458(0x8)
	float                                                        FontLineSpacingScale;                              // 0x460(0x4)
	Class CanvasRenderTarget2D*                                  AthenaTextRenderTarget;                            // 0x470(0x8)
};


// Size 0x8
class VoyageCheckpointProposalDesc: public VoyageProposalDesc
{
public:
	int                                                          TaleIndex;                                         // 0x128(0x4)
	bool                                                         DoConsumeOnUse;                                    // 0x12c(0x1)
	bool                                                         DoCountAsInventoryVoyage;                          // 0x12d(0x1)
};


// Size 0x8
class WorldSafeRegion: public BlockingVolume
{
public:
	bool                                                         RequiresShroudBreaker;                             // 0x401(0x1)
	bool                                                         IsMainWorldSafeZone;                               // 0x402(0x1)
};


// Size 0x1c0
class AthenaWorldSettings: public WorldSettings
{
public:
	Struct Vector2D                                              WorldMax;                                          // 0x5e0(0x8)
	Struct Vector2D                                              WorldMapMin;                                       // 0x5e8(0x8)
	Struct Vector2D                                              WorldMapMax;                                       // 0x5f0(0x8)
	float                                                        AdventureDistanceFromWorldSafeRegionEdgeToKillZone; // 0x5fc(0x4)
	float                                                        ArenaDistanceFromWorldSafeRegionEdgeToKillZone;    // 0x600(0x4)
	float                                                        EndOfWorldWarningOffset;                           // 0x604(0x4)
	float                                                        AdventureDistanceFromWorldSafeRegionEdgeToFullStrainAndLighting; // 0x60c(0x4)
	float                                                        ArenaDistanceFromWorldSafeRegionEdgeToFullStrainAndLighting; // 0x610(0x4)
	int                                                          EndOfWorldWarningLightingIndex;                    // 0x614(0x4)
	Class BuoyantObjectSpawnParamsDataAsset*                     BuoyantObjectSpawnParams;                          // 0x618(0x8)
	Class SeaFortsWorldDataAsset*                                SeaFortsData;                                      // 0x620(0x8)
	Class SeaRockDataAsset*                                      SeaRockLocations;                                  // 0x628(0x8)
	Struct StringAssetReference                                  TradeRoutes;                                       // 0x630(0x10)
	TArray<Struct AthenaStreamedLevelItem>                       ManuallyStreamedLevels;                            // 0x640(0x10)
	Class TunnelWorldConfig*                                     TunnelWorldConfig;                                 // 0x650(0x8)
	Class SpireStreamedLevelDataAsset*                           SpireLevels;                                       // 0x658(0x8)
	Struct KrakenWorldSettingsParams                             KrakenParams;                                      // 0x660(0x1)
	Struct TinySharkWorldSettingsParams                          TinySharkParams;                                   // 0x661(0x1)
	Struct AIShipWorldSettings                                   AIShipParams;                                      // 0x668(0x18)
	Class InvasionLocationsDataAsset*                            InvasionLocationsDataAsset;                        // 0x680(0x8)
	Class IslandDataAsset*                                       IslandDataAsset;                                   // 0x688(0x8)
	Class PrebakedIslandAsset*                                   PrebakedIslandData;                                // 0x690(0x8)
	Class MapTableCanvasDataAsset*                               MapTableCanvasData;                                // 0x698(0x8)
	Class VoyageDescDataAsset*                                   TutorialTale;                                      // 0x6a0(0x8)
	float                                                        DevilsShroudPlayerDamageMaxDamage;                 // 0x6a8(0x4)
	bool                                                         AllowCompanyOnboardingTutorial;                    // 0x6ac(0x1)
	bool                                                         AllowContextualTutorial;                           // 0x6ad(0x1)
	bool                                                         ShowMapTable;                                      // 0x6ae(0x1)
	bool                                                         UseDevDefinition;                                  // 0x6af(0x1)
	bool                                                         EnableGlobalVoyages;                               // 0x6b0(0x1)
	Class GlobalVoyageOverrideAsset*                             GlobalVoyageOverrideAsset;                         // 0x6b8(0x8)
	TArray<Class NPCOnBeachVoyageCheckpoints>                    NPCOnBeachVoyageCheckpoints;                       // 0x6c0(0x10)
	Class GameEventSchedulerSettingsAsset*                       DefaultGameEventSchedulerSettings;                 // 0x6d0(0x8)
	Class GameEventSchedulerStoryCustomiserSettings*             GameEventSchedulerStoryCustomiserSettings;         // 0x6d8(0x8)
	TArray<Struct AthenaWorldSettingsGameEventSchedulerSettingsConfiguration> GameEventSchedulerSettingsConfigurations;          // 0x6e0(0x10)
	Class StormServiceAsset*                                     StormServiceSettings;                              // 0x6f0(0x8)
	TArray<Struct WorldSafeZone>                                 SafeZonesIncludingRequiresShroudBreaker;           // 0x6f8(0x10)
	TArray<Struct WorldSafeZone>                                 SafeZonesExcludingRequiresShroudBreaker;           // 0x708(0x10)
	TArray<Struct WorldSafeZone>                                 MainWorldSafeZones;                                // 0x718(0x10)
	TArray<Struct WorldSafeZone>                                 OverridingSafeZones;                               // 0x728(0x10)
};


// Size 0x18
class AtmosphericPressureService: public Object
{
public:
	TArray<Interface RegisteredAtmosphericPressureZones>         RegisteredAtmosphericPressureZones;                // 0x30(0x10)
};


// Size 0x0
class AudioEmitterPoolSourceInterface: public Interface
{
public:
};


// Size 0x0
class AudioUtilities: public BlueprintFunctionLibrary
{
public:
};


// Size 0xa0
class AwaitCrewShipToSailAwayFromCurrentLocationStep: public TaleQuestStep
{
public:
};


// Size 0x8
class AwaitCrewShipToSailAwayFromCurrentLocationStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        MinShipDistanceToTravel;                           // 0x80(0x4)
	bool                                                         CompleteStepIfShipIsDestroyed;                     // 0x84(0x1)
};


// Size 0x50
class RadialContentRule: public Object
{
public:
	Struct FText                                                 RadialTitle;                                       // 0x28(0x38)
	TArray<Class NotificationInputsToBlock>                      NotificationInputsToBlock;                         // 0x68(0x10)
};


// Size 0x98
class BaitRadialContentRule: public RadialContentRule
{
public:
	float                                                        RadialIconScale;                                   // 0xd0(0x4)
	Struct Vector2D                                              RadialIconOffset;                                  // 0xd4(0x8)
	Class InventoryItemDescToSlotRemappingPolicyAsset*           RemappingAsset;                                    // 0xe0(0x8)
	TArray<class ItemInfo*>                                      MappedSlots;                                       // 0xe8(0x10)
	class                                                        BaitItemCategory;                                  // 0xf8(0x8)
};


// Size 0x48
class BakedDecalComponent: public ActorComponent
{
public:
	int                                                          TargetTextureSize;                                 // 0xc8(0x4)
	Struct LinearColor                                           ClearColour;                                       // 0xcc(0x10)
	int                                                          MaxDeferredDecals;                                 // 0xdc(0x4)
	Class TextureRenderTarget2D*                                 TargetTexture;                                     // 0xe0(0x8)
	TArray<class StaticMeshComponent*>                           StaticMeshes;                                      // 0xe8(0x10)
	TArray<Struct DeferredBakedDecal>                            DeferredDecals;                                    // 0xf8(0x10)
};


// Size 0x0
class BallastStatus: public StatusBase
{
public:
};


// Size 0x130
class PickupableObject: public InteractableBase
{
public:
	Struct StartPickupObjectActionRuleParams                     StartPickupObjectActionRuleParams;                 // 0x410(0x10)
	float                                                        PickupTime;                                        // 0x420(0x4)
};


// Size 0x100
class ItemProxy: public PickupableObject
{
public:
	float                                                        InteractionPointRadius;                            // 0x560(0x4)
	Class WwiseEvent*                                            GroundImpactSfx;                                   // 0x568(0x8)
	TArray<Struct ItemProxyImpactVfxParams>                      VFXParams;                                         // 0x570(0x10)
	float                                                        ZOffsetWhenPlacingWorldProxy;                      // 0x580(0x4)
	Struct Rotator                                               RotationWhenPlacingWorldProxy;                     // 0x584(0xc)
	byte                                                         DropOnSurfaceClientTraceChannel;                   // 0x590(0x1)
	Class PrimitiveComponent*                                    ThirdPersonMesh;                                   // 0x598(0x8)
	float                                                        TTL;                                               // 0x5a0(0x4)
	Class WaterInteractionComponent*                             WaterInteractionComponent;                         // 0x5a8(0x8)
	Class BuoyancyComponent*                                     BuoyancyComponent;                                 // 0x5b0(0x8)
	byte                                                         CachedProxySurfaceType;                            // 0x5b9(0x1)
	bool                                                         CachedOnTopOfExistingBuriable;                     // 0x5ba(0x1)
	bool                                                         DroppedInDeepWater;                                // 0x5bb(0x1)
	Class ItemInfo*                                              ItemInfo;                                          // 0x5c0(0x8)
	float                                                        TTLPlayerProximityCutoff;                          // 0x624(0x4)
	float                                                        TTLRecheckPeriod;                                  // 0x628(0x4)
};


// Size 0x1a0
class FloatingItemProxy: public ItemProxy
{
public:
	Struct RigidBodyErrorCorrection                              PhysicsErrorCorrection;                            // 0x638(0x1c)
	Class BoxComponent*                                          BaseComponent;                                     // 0x658(0x8)
	Struct NetTimeStampCalculator                                MovementTimeStamp;                                 // 0x698(0x70)
	Class Actor*                                                 TutorialOwner;                                     // 0x708(0x8)
	bool                                                         IsTutorialProxy;                                   // 0x710(0x1)
	Struct ReplicatedPhysicsState                                ReplicatedPhysicsState;                            // 0x718(0x50)
	bool                                                         ForceKeepTickActive;                               // 0x768(0x1)
	byte                                                         CachedAutoAimCollisionChannel;                     // 0x7c8(0x1)
	byte                                                         CachedVehicleCollisionResponse;                    // 0x7c9(0x1)
};


// Size 0x28
class BootyProxy: public FloatingItemProxy
{
public:
	Class RetractableComponent*                                  RetractableComponent;                              // 0x7e8(0x8)
	Class ItemProxyShipTrackerComponent*                         ItemProxyShipTrackerComponent;                     // 0x7f0(0x8)
};


// Size 0x20
class BaseMerchantCrateItemProxy: public BootyProxy
{
public:
	Class RewindComponent*                                       RewindComponent;                                   // 0x7f8(0x8)
	Class WwiseEvent*                                            FullGroundImpactSfx;                               // 0x810(0x8)
};


// Size 0x0
class MerchantCrateItemProxy: public BaseMerchantCrateItemProxy
{
public:
};


// Size 0x0
class StaticMerchantCrateItemProxy: public BaseMerchantCrateItemProxy
{
public:
};


// Size 0x10
class CargoRunCrateItemProxy: public MerchantCrateItemProxy
{
public:
	Class CargoRunCrateComponent*                                CargoRunCrateComponent;                            // 0x818(0x8)
	Class NPCDialogComponent*                                    NPCDialogComponent;                                // 0x820(0x8)
};


// Size 0x10
class StaticCargoRunCrateItemProxy: public StaticMerchantCrateItemProxy
{
public:
	Class CargoRunCrateComponent*                                CargoRunCrateComponent;                            // 0x818(0x8)
	Class NPCDialogComponent*                                    NPCDialogComponent;                                // 0x820(0x8)
};


// Size 0x18
class DamageableCargoRunCrateItemProxy: public CargoRunCrateItemProxy
{
public:
	Class GatedHealthComponent*                                  GatedHealthComponent;                              // 0x828(0x8)
	Class VisualHealthResponseComponent*                         VisualHealthResponseComponent;                     // 0x830(0x8)
	Class LightWeightStatusEffectManagerComponent*               LightweightStatusEffectComponent;                  // 0x838(0x8)
};


// Size 0x18
class StaticDamageableCargoRunCrateItemProxy: public StaticCargoRunCrateItemProxy
{
public:
	Class GatedHealthComponent*                                  GatedHealthComponent;                              // 0x828(0x8)
	Class VisualHealthResponseComponent*                         VisualHealthResponseComponent;                     // 0x830(0x8)
	Class LightWeightStatusEffectManagerComponent*               LightweightStatusEffectComponent;                  // 0x838(0x8)
};


// Size 0x148
class ItemInfo: public Actor
{
public:
	bool                                                         CanBeStoredInInventory;                            // 0x3e8(0x1)
	class                                                        WieldableType;                                     // 0x428(0x8)
	class                                                        ProxyType;                                         // 0x430(0x8)
	Class WieldableItemPersistentCooldownComponent*              WieldableItemPersistenceCooldownComponent;         // 0x438(0x8)
	Class ItemDesc*                                              Desc;                                              // 0x440(0x8)
	byte                                                         CurrentRepresentation;                             // 0x448(0x1)
	Class Actor*                                                 CurrentRepresentationInstance;                     // 0x450(0x8)
	Class Actor*                                                 CurrentOwner;                                      // 0x458(0x8)
	Class Actor*                                                 TutorialOwner;                                     // 0x460(0x8)
	bool                                                         DoNotConsiderForMigrationGather;                   // 0x509(0x1)
};


// Size 0x0
class NonStorableItemInfo: public ItemInfo
{
public:
};


// Size 0x218
class BootyItemInfo: public NonStorableItemInfo
{
public:
	byte                                                         BootyType;                                         // 0x540(0x1)
	Struct Guid                                                  Id;                                                // 0x544(0x10)
	bool                                                         PlayedFirstTimeEquipSfx;                           // 0x554(0x1)
	TArray<Struct PlayerStat>                                    HandInPlayerStats;                                 // 0x558(0x10)
	TArray<Struct PlayerStat>                                    HandInStolenPlayerStats;                           // 0x568(0x10)
	TArray<Struct PlayerStat>                                    HandInStolenFromPlayerStats;                       // 0x578(0x10)
	TArray<Struct PlayerStat>                                    HandInGiftPlayerStats;                             // 0x588(0x10)
	TArray<Struct PlayerStat>                                    HandInAsPirateLegendPlayerStats;                   // 0x598(0x10)
	TArray<Struct PlayerStat>                                    HandInOnSchedulePlayerStats;                       // 0x5a8(0x10)
	TArray<Struct PlayerStat>                                    HandInAsPirateLegendOnSchedulePlayerStats;         // 0x5b8(0x10)
	TArray<Struct EmissaryBootyItemStats>                        HandInAsEmissaryPlayerStats;                       // 0x5c8(0x10)
	TArray<Struct EmissaryBootyItemStats>                        HandInAsMaxLevelEmissaryPlayerStats;               // 0x5d8(0x10)
	TArray<Struct EmissaryBootyItemStats>                        HandInStolenAsEmissaryPlayerStats;                 // 0x5e8(0x10)
	TArray<Struct EmissaryBootyItemStats>                        HandInStolenAsMaxLevelEmissaryPlayerStats;         // 0x5f8(0x10)
	TArray<Struct PlayerStat>                                    UsePlayerStats;                                    // 0x608(0x10)
	TArray<Struct PlayerStat>                                    UseStolenPlayerStats;                              // 0x618(0x10)
	Struct CompanyBootyStatList                                  CompanySpecificStats;                              // 0x628(0x10)
	Struct ConditionalHandInStat                                 ConditionalHandInStat;                             // 0x638(0x20)
	Class PopUpMessageDesc*                                      DiscoveredPopupDesc;                               // 0x658(0x8)
	Struct BootyItemSellPrerequisites                            SellPrerequisites;                                 // 0x660(0x10)
	Class TrackedOwnerComponent*                                 TrackedOwnerComponent;                             // 0x670(0x8)
	Class ItemQualityComponent*                                  ItemQualityComponent;                              // 0x678(0x8)
	byte                                                         ItemQualityLevel;                                  // 0x680(0x1)
	TArray<Struct PerComanyItemQualityEntry>                     CompanySpecificItemQualityLevel;                   // 0x688(0x10)
	Struct RewardId                                              HandInRewardId;                                    // 0x698(0x8)
	TArray<Struct CompanySpecificBootyReward>                    HandInRewardIdCompanySpecific;                     // 0x6a0(0x10)
	bool                                                         RewardToOwnCrewOnly;                               // 0x6b0(0x1)
	struct FName                                                 Rarity;                                            // 0x6b4(0x8)
	class                                                        AwardAllegianceToFaction;                          // 0x6c0(0x8)
	Class DeliverableComponent*                                  DeliverableComponent;                              // 0x6e0(0x8)
	Class CrewOwnershipTrackingComponent*                        CrewOwnershipTrackingComponent;                    // 0x6e8(0x8)
	Class BootyItemShipOwnershipComponent*                       BootyItemShipOwnershipComponent;                   // 0x6f0(0x8)
	byte                                                         SpawnSource;                                       // 0x6f8(0x1)
};


// Size 0x78
class MerchantCrateItemInfo: public BootyItemInfo
{
public:
	TArray<Struct MerchantCrateItemInfoFaunaBreedRarityEntry>    FaunaBreedRarity;                                  // 0x730(0x10)
	Class Actor*                                                 CurrentShip;                                       // 0x798(0x8)
};


// Size 0x3b8
class WieldableItem: public Actor
{
public:
	Class PrimitiveComponent*                                    FirstPersonMesh;                                   // 0x420(0x8)
	Class PrimitiveComponent*                                    ThirdPersonMesh;                                   // 0x428(0x8)
	Class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x430(0x8)
	class                                                        AnimationKey;                                      // 0x438(0x8)
	Struct ObjectMessagingDispatcher                             MessagingDispatcher;                               // 0x440(0xa0)
	Struct Transform                                             AnimationOffset;                                   // 0x4e0(0x30)
	Class WwiseEvent*                                            EquipSfx;                                          // 0x510(0x8)
	Class WwiseEvent*                                            UnequipSfx;                                        // 0x518(0x8)
	Class WwiseEvent*                                            WielderLandedJumpSfx;                              // 0x520(0x8)
	Class WwiseEvent*                                            WielderFootstepLayerOneshot;                       // 0x528(0x8)
	struct FName                                                 PlayerWalkSpeedRtpc;                               // 0x530(0x8)
	Class WwiseEvent*                                            FirstTimeEquipSfx;                                 // 0x538(0x8)
	bool                                                         ForceUnequipSfx;                                   // 0x540(0x1)
	byte                                                         ItemSize;                                          // 0x541(0x1)
	Struct DetailAppearenceDesc                                  DetailAppearence;                                  // 0x548(0x30)
	bool                                                         PropagateVisibilityToChildren;                     // 0x578(0x1)
	struct FName                                                 AINoiseTag;                                        // 0x57c(0x8)
	TArray<Struct FName>                                         ThirdPersonExtraMeshNames;                         // 0x588(0x10)
	TArray<Struct FName>                                         StashedExtraMeshNames;                             // 0x598(0x10)
	Class MeshComponent*                                         StashedMeshComponent;                              // 0x5a8(0x8)
	struct FName                                                 StashedMeshAttachSocket;                           // 0x5b0(0x8)
	struct FName                                                 ServerWieldAttachSocket;                           // 0x5b8(0x8)
	Class PhrasesRadialDataAsset*                                Phrases;                                           // 0x5c0(0x8)
	Class Object*                                                CachedFirstPersonProxyMesh;                        // 0x5c8(0x8)
	Class Object*                                                CachedThirdPersonProxyMesh;                        // 0x5d0(0x8)
	class                                                        ItemCategory;                                      // 0x700(0x8)
	Class ItemInfo*                                              ItemInfo;                                          // 0x708(0x8)
	Class InterpolatingItem*                                     InterpolatingItem;                                 // 0x710(0x8)
	Class WieldableItemVfxComponent*                             WieldableItemVfxComponent;                         // 0x738(0x8)
	TArray<class MeshComponent*>                                 ThirdPersonExtraMeshes;                            // 0x740(0x10)
	TArray<class MeshComponent*>                                 StashedExtraMeshes;                                // 0x750(0x10)
	bool                                                         OfferingEnabled;                                   // 0x779(0x1)
};


// Size 0x0
class SkeletalMeshWieldableItem: public WieldableItem
{
public:
};


// Size 0x0
class LargeSkeletalMeshWieldableItem: public SkeletalMeshWieldableItem
{
public:
};


// Size 0x30
class MerchantCrate: public LargeSkeletalMeshWieldableItem
{
public:
	Struct MerchantCrateSfx                                      FullCrateSfx;                                      // 0x780(0x20)
};


// Size 0x0
class StaticMeshWieldableItem: public WieldableItem
{
public:
};


// Size 0x0
class LargeStaticMeshWieldableItem: public StaticMeshWieldableItem
{
public:
};


// Size 0x60
class StaticMerchantCrate: public LargeStaticMeshWieldableItem
{
public:
	Class RewindComponent*                                       RewindComponent;                                   // 0x780(0x8)
	Struct MerchantCrateSfx                                      FullCrateSfx;                                      // 0x788(0x20)
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectComponent;                   // 0x7b8(0x8)
	bool                                                         RequiresRewindComponent;                           // 0x7d0(0x1)
};


// Size 0x0
class MockMerchantCrateItemProxy: public BaseMerchantCrateItemProxy
{
public:
};


// Size 0x50
class CategoryBase: public Object
{
public:
	Struct FText                                                 Name;                                              // 0x28(0x38)
	struct FName                                                 UniqueTextIdentifier;                              // 0x60(0x8)
	Struct StringAssetReference                                  IconPath;                                          // 0x68(0x10)
};


// Size 0x8
class ItemCategory: public CategoryBase
{
public:
	class                                                        NotificationInputId;                               // 0x78(0x8)
};


// Size 0x0
class MerchantCrateCategoryMock: public ItemCategory
{
public:
};


// Size 0x8
class MerchantCrateItemInfoMock: public MerchantCrateItemInfo
{
public:
};


// Size 0x0
class CommonMerchantCrateItemInfoMock: public MerchantCrateItemInfoMock
{
public:
};


// Size 0x0
class RareMerchantCrateItemInfoMock: public MerchantCrateItemInfoMock
{
public:
};


// Size 0x0
class LegendaryMerchantCrateItemInfoMock: public MerchantCrateItemInfoMock
{
public:
};


// Size 0x0
class MythicalMerchantCrateItemInfoMock: public MerchantCrateItemInfoMock
{
public:
};


// Size 0x58
class ItemDesc: public EntitlementDesc
{
public:
	bool                                                         CanBeAddedToLoadout;                               // 0xc8(0x1)
	bool                                                         IsTransient;                                       // 0xc8(0x1)
	Struct FString                                               PreviousItem;                                      // 0xd0(0x10)
	Struct FString                                               NextItem;                                          // 0xe0(0x10)
	Struct StringAssetReference                                  IconRadPath;                                       // 0xf0(0x10)
	Struct StringClassReference                                  InstanceClassType;                                 // 0x100(0x10)
	TArray<Struct ItemInfoTogglePair>                            ItemInfoOverrides;                                 // 0x110(0x10)
};


// Size 0x0
class ItemWithoutIconsDesc: public ItemDesc
{
public:
};


// Size 0x0
class BootyItemDesc: public ItemWithoutIconsDesc
{
public:
};


// Size 0x0
class MerchantCrateItemDescMock: public BootyItemDesc
{
public:
};


// Size 0x18
class MerchantCrateFilledItemProxy: public StaticMerchantCrateItemProxy
{
public:
	Class StorageContainerComponent*                             StorageContainerComponent;                         // 0x818(0x8)
	bool                                                         FillCrateToCapacity;                               // 0x820(0x1)
};


// Size 0x28
class ClientNotificationsService: public Object
{
public:
};


// Size 0x58
class PlayNpcAnimationStep: public TaleQuestStep
{
public:
	Class BasePlayNpcAnimationStepDesc*                          StepDesc;                                          // 0x98(0x8)
	Class NPCDialogComponent*                                    NPCDialogComponent;                                // 0xb0(0x8)
	Class CutSceneActor*                                         CutSceneActor;                                     // 0xb8(0x8)
};


// Size 0x88
class BasePlayNpcAnimationStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    PlaceableReaction;                                 // 0x80(0x30)
	Struct QuestVariableActor                                    CutSceneActor;                                     // 0xb0(0x30)
	struct FName                                                 AnimationNameToPlay;                               // 0xe0(0x8)
	float                                                        SubtitleMaxDistance;                               // 0xe8(0x4)
	bool                                                         UseServerDrivenDialogue;                           // 0xec(0x1)
	Class SceneDialogueData*                                     DialogueData;                                      // 0xf0(0x8)
	class                                                        LocalMusicZone;                                    // 0xf8(0x8)
	bool                                                         PreventServerMigration;                            // 0x100(0x1)
};


// Size 0x68
class PlayNpcAnimationStepDesc: public BasePlayNpcAnimationStepDesc
{
public:
	Struct QuestVariableActor                                    TargetNpc;                                         // 0x108(0x30)
	Struct FText                                                 SpeakingActorLocalisableName;                      // 0x138(0x38)
};


// Size 0xa0
class PlayGroupNpcAnimationStepDesc: public BasePlayNpcAnimationStepDesc
{
public:
	Struct QuestVariableActor                                    TargetNpc1;                                        // 0x108(0x30)
	Struct QuestVariableActor                                    TargetNpc2;                                        // 0x138(0x30)
	Struct QuestVariableActor                                    TargetNpc3;                                        // 0x168(0x30)
	TArray<Struct FText>                                         SpeakingActorLocalisableNames;                     // 0x198(0x10)
};


// Size 0x0
class FlamesOfFateSettingsServiceInterface: public Interface
{
public:
};


// Size 0x68
class InteractableObject: public InteractableBase
{
public:
	Class OneShotInteractableFilterDesc*                         FilterDesc;                                        // 0x418(0x8)
	Struct FText                                                 Verb;                                              // 0x420(0x38)
};


// Size 0x370
class Beacon: public InteractableObject
{
public:
	Class StaticMeshComponent*                                   Mesh;                                              // 0x478(0x8)
	Class ParticleSystemComponent*                               BeaconActiveParticleSystem;                        // 0x480(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x488(0x8)
	bool                                                         EnableParticleSystemTint;                          // 0x490(0x1)
	Class InteractableComponent*                                 InteractableComponent;                             // 0x498(0x8)
	Class Object*                                                ExtinguishedVFX;                                   // 0x4a0(0x8)
	struct FName                                                 WwiseEmitterName;                                  // 0x4a8(0x8)
	Class WwiseEvent*                                            StartLoopFlameSfx;                                 // 0x4b0(0x8)
	Class WwiseEvent*                                            StopLoopFlameSfx;                                  // 0x4b8(0x8)
	Class WwiseEvent*                                            FlameTransferSfx;                                  // 0x4c0(0x8)
	Class WwiseEvent*                                            ExtinguishedSfx;                                   // 0x4c8(0x8)
	Class WwiseObjectPoolWrapper*                                BeaconWwisePool;                                   // 0x4d0(0x8)
	float                                                        InteractionRadius;                                 // 0x4d8(0x4)
	Struct FText                                                 TakeFlameTooltipText;                              // 0x4e0(0x38)
	Struct FText                                                 CannotTakeFlameTooltipText;                        // 0x518(0x38)
	Struct FText                                                 LanternNotRaisedToolTipText;                       // 0x550(0x38)
	Struct FText                                                 NotWieldingFlameTooltipText;                       // 0x588(0x38)
	Struct FText                                                 SetFlameTooltipText;                               // 0x5c0(0x38)
	bool                                                         CanTakeFlameFromBeacon;                            // 0x5f8(0x1)
	bool                                                         CanSetFlameOnBeacon;                               // 0x5f9(0x1)
	bool                                                         StartLit;                                          // 0x5fa(0x1)
	byte                                                         StartingType;                                      // 0x5fb(0x1)
	Struct PlayerStat                                            StatToFire;                                        // 0x5fc(0x4)
	TArray<Struct BeaconLitWithFlameOfFateStatsToFire>           StatMap;                                           // 0x600(0x10)
	Class CurveLinearColor*                                      ColourChangeCurveFX;                               // 0x610(0x8)
	Class CurveLinearColor*                                      ColourChangeCurveLight;                            // 0x618(0x8)
	bool                                                         CanExtinguish;                                     // 0x620(0x1)
	float                                                        ExtinguishFadeTime;                                // 0x624(0x4)
	Struct BeaconData                                            BeaconData;                                        // 0x628(0x2)
	Class ParticleSystemComponent*                               ExtinguishFXComponent;                             // 0x630(0x8)
	Struct ObjectMessagingDispatcher                             EventDispatcher;                                   // 0x638(0xa0)
};


// Size 0xb8
class BrazierMechanismTrigger: public Beacon
{
public:
	Class MechanismTriggerComponent*                             MechanismTrigger;                                  // 0x7d8(0x8)
	byte                                                         FlameTypeToActivate;                               // 0x7e0(0x1)
	bool                                                         ActivateWithSpecificLantern;                       // 0x7e1(0x1)
	class                                                        LanternToActivate;                                 // 0x7e8(0x8)
	Struct FText                                                 LanternNotLitToolTipText;                          // 0x7f0(0x38)
	Struct FText                                                 CannotSetBeaconToolTipText;                        // 0x828(0x38)
	class                                                        TakeFlameOfFateNotificationID;                     // 0x860(0x8)
	class                                                        SetFlameOfFateNotificationID;                      // 0x868(0x8)
	float                                                        LanternSwingAmmount;                               // 0x870(0x4)
	float                                                        LanternEmissiveAmmount;                            // 0x874(0x4)
	float                                                        LanternMegaEmmisiveAmount;                         // 0x878(0x4)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0x880(0x10)
};


// Size 0x0
class FortOfTheDamnedBrazierMechanismTrigger: public BrazierMechanismTrigger
{
public:
};


// Size 0x10
class Bed: public Actor
{
public:
	Class StaticMeshComponent*                                   BedMeshComponent;                                  // 0x3c8(0x8)
	Class ReplicatedShipPartCustomizationComponent*              CustomizationComponent;                            // 0x3d0(0x8)
};


// Size 0x0
class ShipPartDescAsset: public DataAsset
{
public:
};


// Size 0x10
class BedPartDescAsset: public ShipPartDescAsset
{
public:
	Struct BedPartDesc                                           BedPartDesc;                                       // 0x28(0x10)
};


// Size 0x0
class BeginBullRushUnarmedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0
class EelSlapNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0
class LungeBeginAshenLordUnarmedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0
class SweepLeftAshenLordUnarmedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0
class SweepRightAshenLordUnarmedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0
class BeingRetractedActionStateId: public ActionStateId
{
public:
};


// Size 0x108
class Bell: public InteractableObject
{
public:
	Class ReplicatedShipPartCustomizationComponent*              CustomisationComponent;                            // 0x468(0x8)
	Struct BellPlayerStats                                       PlayerStats;                                       // 0x470(0x10)
	Class InteractableComponent*                                 InteractableComponent;                             // 0x480(0x8)
	Class StaticMeshComponent*                                   BellMeshComponent;                                 // 0x488(0x8)
	Class WwiseEvent*                                            BellRingSFX;                                       // 0x490(0x8)
	Class WwiseEvent*                                            BellRingSfxStorm;                                  // 0x498(0x8)
	Struct FText                                                 BellName;                                          // 0x4a0(0x38)
	float                                                        TimeBetweenTurbulenceChecks;                       // 0x4d8(0x4)
	float                                                        MinIntervalBetweenRingsLowerBound;                 // 0x4dc(0x4)
	float                                                        MinIntervalBetweenRingsUpperBound;                 // 0x4e0(0x4)
	float                                                        MaxIntervalBetweenRingsLowerBound;                 // 0x4e4(0x4)
	float                                                        MaxIntervalBetweenRingsUpperBound;                 // 0x4e8(0x4)
	Class WwiseObjectPoolWrapper*                                BellPool;                                          // 0x4f0(0x8)
	Struct Vector                                                EmitterOffset;                                     // 0x4f8(0xc)
	Class MaterialInstanceDynamic*                               BellDynamicMaterial;                               // 0x508(0x8)
	int                                                          BellMaterialIndex;                                 // 0x510(0x4)
};


// Size 0x18
class BellDescAsset: public ShipPartDescAsset
{
public:
	Struct BellDesc                                              BellDesc;                                          // 0x28(0x18)
};


// Size 0x20
class AtmosphericPressureZoneComponent: public SceneComponent
{
public:
	Struct AtmosphericPressureZoneParameters                     PressureZoneParameters;                            // 0x2e8(0x14)
};


// Size 0x20
class BlendedAtmosphericPressureZoneComponent: public AtmosphericPressureZoneComponent
{
public:
	Class CurveFloat*                                            WeightFadeCurveNormalised;                         // 0x300(0x8)
	Class CurveFloat*                                            RadiusFadeCurveNormalised;                         // 0x308(0x8)
};


// Size 0xd0
class BlendedPostProcessingZoneComponentBase: public PostProcessComponent
{
public:
	Class CurveFloat*                                            FadeCurveNormalised;                               // 0x850(0x8)
	float                                                        BlendDistance;                                     // 0x858(0x4)
};


// Size 0x0
class BlendedPostProcessingRainZoneComponent: public BlendedPostProcessingZoneComponentBase
{
public:
};


// Size 0x20
class BlinkStrafeComponent: public ActorComponent
{
public:
	Class AthenaAICharacter*                                     Character;                                         // 0xc8(0x8)
	Class AthenaAIControllerBase*                                OwnerAIController;                                 // 0xd0(0x8)
	bool                                                         ShouldBlink;                                       // 0xe0(0x1)
};


// Size 0x0
class BloatingStatus: public StatusBase
{
public:
};


// Size 0x10
class BlockEarthquakeTaleQuestService: public TaleQuestService
{
public:
	Class BlockEarthquakeTaleQuestServiceDesc*                   Desc;                                              // 0x60(0x8)
};


// Size 0x30
class BlockEarthquakeTaleQuestServiceDesc: public TaleQuestServiceDesc
{
public:
	Struct QuestVariableActor                                    ActorNearIsland;                                   // 0x28(0x30)
};


// Size 0x10
class BlockGeysersTaleQuestService: public TaleQuestService
{
public:
	Class BlockGeysersTaleQuestServiceDesc*                      Desc;                                              // 0x60(0x8)
};


// Size 0x30
class BlockGeysersTaleQuestServiceDesc: public TaleQuestServiceDesc
{
public:
	Struct QuestVariableActor                                    ActorNearIsland;                                   // 0x28(0x30)
};


// Size 0x28
class BlockMigrationForCrewTaskStep: public TaleQuestStep
{
public:
	Class BlockMigrationForCrewTaskStepDesc*                     Desc;                                              // 0x98(0x8)
};


// Size 0x20
class BlockMigrationForCrewTaskStepDesc: public TaleQuestStepDesc
{
public:
	Class TaleQuestStepDesc*                                     TaskDesc;                                          // 0x80(0x8)
	struct FName                                                 RemoteConfigKeyBlockServerMigration;               // 0x88(0x8)
	Struct FString                                               Reason;                                            // 0x90(0x10)
};


// Size 0x10
class BlockVolcanoTaleQuestService: public TaleQuestService
{
public:
	Class BlockVolcanoTaleQuestServiceDesc*                      Desc;                                              // 0x60(0x8)
};


// Size 0x30
class BlockVolcanoTaleQuestServiceDesc: public TaleQuestServiceDesc
{
public:
	Struct QuestVariableActor                                    ActorNearIsland;                                   // 0x28(0x30)
};


// Size 0x68
class BlueprintStepBase: public Object
{
public:
	byte                                                         BeginMode;                                         // 0x28(0x1)
	Class TaleQuestBlueprintStepDesc*                            Desc;                                              // 0x30(0x8)
};


// Size 0x0
class BlueprintMechanismStepBase: public BlueprintStepBase
{
public:
};


// Size 0x18
class BlueprintSpawnAIStepBase: public BlueprintStepBase
{
public:
};


// Size 0x0
class BlueprintSpawnAIStepDefault: public BlueprintSpawnAIStepBase
{
public:
};


// Size 0x0
class DamagerType: public Object
{
public:
};


// Size 0x0
class BlunderbussDamagerType: public DamagerType
{
public:
};


// Size 0xa8
class BodyLightControllerComponent: public ActorComponent
{
public:
	Class CurveFloat*                                            HourOfDayToIntensityMultiplierCurve;               // 0xc8(0x8)
	float                                                        BaseLightIntensity;                                // 0xd0(0x4)
	float                                                        IntensitySpringAccel;                              // 0xd4(0x4)
};


// Size 0x0
class BoilingStatus: public StatusBase
{
public:
};


// Size 0x0
class BoneAIFormComponent: public AthenaAIFormComponent
{
public:
};


// Size 0x10
class BoobyTrapSpawnerDataAsset: public DataAsset
{
public:
	TArray<Struct BoobyTrapSpawnerRankEntry>                     RankEntries;                                       // 0x28(0x10)
};


// Size 0x0
class BoogieStatus: public StatusBase
{
public:
};


// Size 0x20
class QuestBookPageLayout: public DataAsset
{
public:
	TArray<Struct TreasureMapWidgetTexture>                      Images;                                            // 0x28(0x10)
	TArray<Struct TreasureMapWidgetLocalisedTextWithFontOverride> GeneralText;                                       // 0x38(0x10)
};


// Size 0x0
class TurnablePageInterface: public Interface
{
public:
};


// Size 0x20
class QuestBookPageList: public DataAsset
{
public:
	TArray<Struct PageReference>                                 Pages;                                             // 0x28(0x10)
	TArray<Struct StringAssetReference>                          InitialPages;                                      // 0x38(0x10)
};


// Size 0x380
class QuestBook: public SkeletalMeshWieldableItem
{
public:
	Class InventoryItemComponent*                                InventoryItem;                                     // 0x798(0x8)
	Struct QuestBookMaterialHandler                              MaterialHandler;                                   // 0x800(0x140)
	float                                                        ExtraPageTurnDurationForForceRedraw;               // 0x940(0x4)
	Struct QuestBookRepInfo                                      ReplicationInfo;                                   // 0x948(0x28)
	Class QuestBookPageList*                                     PageList;                                          // 0x970(0x8)
	class                                                        RemapperClass;                                     // 0x978(0x8)
	Class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x980(0x8)
	Class DirectionalLightComponent*                             DirectionalLightComponent;                         // 0x988(0x8)
	float                                                        ShadowCascadeDistributionExponentWhenUsing;        // 0x990(0x4)
	float                                                        ShadowCascadeDistributionExponentTransitionTime;   // 0x994(0x4)
	float                                                        PageTurnDuration;                                  // 0x9a0(0x4)
	float                                                        PageTurnForceRedrawDuration;                       // 0x9a4(0x4)
	int                                                          PageWidth;                                         // 0xad8(0x4)
	int                                                          PageHeight;                                        // 0xadc(0x4)
	Struct QuestBookPageRenderer                                 PageTextRenderer;                                  // 0xae0(0x18)
};


// Size 0x8
class QuestBookItemDesc: public ItemDesc
{
public:
	Class QuestBookPageList*                                     PageList;                                          // 0x120(0x8)
};


// Size 0xc0
class TaleQuestToolService: public TaleQuestService
{
public:
	Class TaleQuestToolServiceDesc*                              ServiceDesc;                                       // 0x60(0x8)
	TArray<class ItemDesc*>                                      WieldableDescs;                                    // 0x68(0x10)
};


// Size 0x48
class BookTaleQuestService: public TaleQuestToolService
{
public:
	Class BookTaleQuestServiceDesc*                              Desc;                                              // 0x120(0x8)
	TArray<Int BookContents>                                     BookContents;                                      // 0x128(0x10)
	TArray<Struct PageLayoutRepInfo>                             ProcBookContents;                                  // 0x138(0x10)
	TArray<Int CurrentBookContents>                              CurrentBookContents;                               // 0x148(0x10)
	Class QuestBookItemDesc*                                     QuestBookDesc;                                     // 0x158(0x8)
};


// Size 0x8
class TaleQuestToolServiceDesc: public TaleQuestServiceDesc
{
public:
	bool                                                         GiveToolsOnStart;                                  // 0x28(0x1)
};


// Size 0x10
class BookTaleQuestServiceDesc: public TaleQuestToolServiceDesc
{
public:
	class                                                        QuestBookDesc;                                     // 0x30(0x8)
	class                                                        RemapperClass;                                     // 0x38(0x8)
};


// Size 0x50
class TreasureMap: public SkeletalMeshWieldableItem
{
public:
	Class WieldableItemCanvasRenderingComponent*                 WieldableCanvasRenderingComponent;                 // 0x790(0x8)
	Class InventoryItemComponent*                                InventoryItem;                                     // 0x798(0x8)
	Class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x7a0(0x8)
	Class ZoomInOnWieldableItemComponent*                        ZoomInOnWieldableComponent;                        // 0x7a8(0x8)
	byte                                                         QuestMapIcon;                                      // 0x7c1(0x1)
};


// Size 0xf0
class BountyMap: public TreasureMap
{
public:
	int                                                          CanvasWidth;                                       // 0x7c8(0x4)
	int                                                          CanvasHeight;                                      // 0x7cc(0x4)
	Class Font*                                                  Font;                                              // 0x7d0(0x8)
	float                                                        FontScale;                                         // 0x7d8(0x4)
	float                                                        FontLineSpacingScale;                              // 0x7dc(0x4)
	Class BountyMapLayout*                                       BountyMapLayout;                                   // 0x7e8(0x8)
	Struct BountyMapContents                                     Contents;                                          // 0x7f0(0x68)
	Struct StringAssetReference                                  MapInventoryTexturePath;                           // 0x858(0x10)
	float                                                        Rotation;                                          // 0x868(0x4)
};


// Size 0x90
class BountyQuestDescData: public DataAsset
{
public:
	TArray<Class AllBountyRewards>                               AllBountyRewards;                                  // 0x28(0x10)
	Class RiddleTextPhraseDataAsset*                             LocationPhrase;                                    // 0x38(0x8)
	Class RiddleTextPhraseDataAsset*                             LocationUndergroundPhrase;                         // 0x40(0x8)
	TArray<Struct BountyQuestMugShotSet>                         BountyMapMugShotSets;                              // 0x48(0x10)
	TArray<Struct BountyQuestLayoutOption>                       BountyMapLayoutOptions;                            // 0x58(0x10)
	TArray<Struct FText>                                         DefaultBountyMapDescriptions;                      // 0x68(0x10)
	TArray<Struct LoadoutSubstitution>                           TargetLoadoutSubstitutions;                        // 0x98(0x10)
	TArray<Struct CompanySkillsetProgressions>                   Skillsets;                                         // 0xa8(0x10)
};


// Size 0x0
class NonDisplaceableLargeStaticMeshWieldableItem: public LargeStaticMeshWieldableItem
{
public:
};


// Size 0x0
class BountyReward: public NonDisplaceableLargeStaticMeshWieldableItem
{
public:
};


// Size 0x10
class PuzzleStatueBaseAudioParamsDataAsset: public DataAsset
{
public:
	Class WwiseEvent*                                            StatueActivated;                                   // 0x28(0x8)
	Class WwiseObjectPoolWrapper*                                PuzzleStatueAudioPool;                             // 0x30(0x8)
};


// Size 0x40
class BroadcasterPuzzleStatueAudioParamsDataAsset: public DataAsset
{
public:
	Class WwiseEvent*                                            BroadcasterInitiateReactionSequence;               // 0x28(0x8)
	Class WwiseEvent*                                            SuccessHumStart;                                   // 0x30(0x8)
	Class WwiseEvent*                                            SuccessHumStop;                                    // 0x38(0x8)
	Class WwiseEvent*                                            SuccessWaterLevelUp;                               // 0x40(0x8)
	Class WwiseEvent*                                            SuccessWaterLevelDown;                             // 0x48(0x8)
	Class WwiseEvent*                                            SuccessGeneralActivation;                          // 0x50(0x8)
	Class WwiseEvent*                                            UnsuccessfulSequence;                              // 0x58(0x8)
	Class WwiseEvent*                                            ShockwaveEffect;                                   // 0x60(0x8)
};


// Size 0x50
class BTDecorator_ActorWieldedItemCategory: public BTDecorator_BaseConditional
{
public:
	float                                                        Interval;                                          // 0x68(0x4)
	Struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x70(0x28)
};


// Size 0x28
class BTDecorator_ActorWieldedItemClass: public BTDecorator_BlackboardBase
{
public:
	float                                                        Interval;                                          // 0x90(0x4)
};


// Size 0x0
class BTDecorator_CanBlock: public BTDecorator_BaseConditional
{
public:
};


// Size 0x28
class BTDecorator_CanRepair: public BTDecorator_BaseConditional
{
public:
	Struct BlackboardKeySelector                                 RepairActor;                                       // 0x68(0x28)
};


// Size 0x0
class BTDecorator_ShouldCheatPauseBehavior: public BTDecorator_BaseConditional
{
public:
};


// Size 0x0
class BTDecorator_ShouldCurrentActionStatePauseBehavior: public BTDecorator_BaseConditional
{
public:
};


// Size 0x38
class BTService_DetermineEngageTarget: public BTService
{
public:
	Struct BlackboardKeySelector                                 BlockChangeEngageOptionKey;                        // 0x70(0x28)
};


// Size 0x70
class BTService_DetermineRecoveryMethod: public BTService
{
public:
	float                                                        TimeToForgetAfterSuccessfulFlee;                   // 0x70(0x4)
	Class AthenaAICharacterController*                           CachedAICharacterController;                       // 0x78(0x8)
};


// Size 0xf8
class BTService_ObserveTargetMeleeAttacks: public BTService
{
public:
	Struct BlackboardKeySelector                                 TargetActorKey;                                    // 0x70(0x28)
	Struct BlackboardKeySelector                                 IsTargetAttackingResultKey;                        // 0x98(0x28)
};


// Size 0xe8
class BTService_ObserveTargetReceivedDamage: public BTService
{
public:
	Struct BlackboardKeySelector                                 ObservedActorKey;                                  // 0x70(0x28)
	Struct BlackboardKeySelector                                 HasObservedActorReceivedSufficientDamageResultKey; // 0x98(0x28)
	Struct AIDataProviderFloatValue                              ObservedActorDamageThreshold;                      // 0xc0(0x30)
};


// Size 0x108
class BTService_RunLoopingCustomAnimation: public BTService
{
public:
	bool                                                         UseFixedLoopingCustomAnimationName;                // 0x70(0x1)
	struct FName                                                 FixedLoopingCustomAnimationName;                   // 0x74(0x8)
	Struct BlackboardKeySelector                                 LoopingCustomAnimationNameKey;                     // 0x80(0x28)
	bool                                                         GetAnimationDurations;                             // 0xa8(0x1)
	Struct BlackboardKeySelector                                 IntoAnimationEffectTime;                           // 0xb0(0x28)
	Struct BlackboardKeySelector                                 IntoAnimationDuration;                             // 0xd8(0x28)
	Struct BlackboardKeySelector                                 OutOfUndockTime;                                   // 0x100(0x28)
	Struct BlackboardKeySelector                                 OutOfAnimationDuration;                            // 0x128(0x28)
	Struct BlackboardKeySelector                                 AlternateOutOfAnimationIndex;                      // 0x150(0x28)
};


// Size 0x58
class BTTask_AthenaRunEQSQuery: public BTTask_RunEQSQuery
{
public:
	Struct BlackboardKeySelector                                 KeyToSetToTrueIfNoValidLocationFound;              // 0xa8(0x28)
	Struct BlackboardKeySelector                                 ReasonStringKeyIfNoValidLocationFound;             // 0xd0(0x28)
	bool                                                         ThrottleQueryTimePerFrame;                         // 0xf8(0x1)
	float                                                        MaxSecondsToSpendOnQueryPerFrame;                  // 0xfc(0x4)
};


// Size 0x28
class BTTask_AthenaRunEQSQueryFromBlackboard: public BTTask_AthenaRunEQSQuery
{
public:
	Struct BlackboardKeySelector                                 EQSBlackboardKey;                                  // 0x100(0x28)
};


// Size 0x0
class BTTask_DoesEQSQuerySucceed: public BTTask_AthenaRunEQSQuery
{
public:
};


// Size 0x0
class BTTask_CharacterRotateToFaceBBEntry: public BTTask_RotateToFaceBBEntry
{
public:
};


// Size 0x0
class BTTask_FlushQueuedAIAbility: public BTTaskNode
{
public:
};


// Size 0x0
class BTTask_FlushQueuedEngageEnemyMethod: public BTTaskNode
{
public:
};


// Size 0x8
class BTTask_RotateToFaceBBEntryWithTime: public BTTask_RotateToFaceBBEntry
{
public:
	float                                                        Delay;                                             // 0x90(0x4)
	float                                                        RotationTime;                                      // 0x94(0x4)
};


// Size 0x98
class BTTask_RunOneShotCustomAnimation: public BTTaskNode
{
public:
	bool                                                         UseFixedOneShotCustomAnimationName;                // 0x60(0x1)
	struct FName                                                 FixedOneShotCustomAnimationName;                   // 0x64(0x8)
	Struct BlackboardKeySelector                                 OneShotCustomAnimationNameKey;                     // 0x70(0x28)
	bool                                                         GetDurationAndEffectTime;                          // 0x98(0x1)
	Struct BlackboardKeySelector                                 AnimationDuration;                                 // 0xa0(0x28)
	Struct BlackboardKeySelector                                 AnimationEffectTime;                               // 0xc8(0x28)
	bool                                                         StopCurrentLoopingAnimation;                       // 0xf0(0x1)
};


// Size 0x8
class BTTask_SetRecoveryMethod: public BTTaskNode
{
public:
	class                                                        RecoveryMethod;                                    // 0x60(0x8)
};


// Size 0x0
class FuseTargetInterface: public Interface
{
public:
};


// Size 0x30
class CannonDescAsset: public ShipPartDescAsset
{
public:
	Struct CannonDesc                                            CannonDesc;                                        // 0x28(0x30)
};


// Size 0x7b0
class Cannon: public ControllableObject
{
public:
	Class SkeletalMeshMemoryConstraintComponent*                 BaseMeshComponent;                                 // 0x538(0x8)
	Class StaticMeshMemoryConstraintComponent*                   BarrelMeshComponent;                               // 0x540(0x8)
	Class StaticMeshComponent*                                   FuseMeshComponent;                                 // 0x548(0x8)
	Class ReplicatedShipPartCustomizationComponent*              CustomizationComponent;                            // 0x550(0x8)
	Class LoadableComponent*                                     LoadableComponent;                                 // 0x558(0x8)
	Class LoadingPointComponent*                                 LoadingPointComponent;                             // 0x560(0x8)
	Class ChildActorComponent*                                   CannonBarrelInteractionComponent;                  // 0x568(0x8)
	Class FuseComponent*                                         FuseComponent;                                     // 0x570(0x8)
	struct FName                                                 CameraSocket;                                      // 0x578(0x8)
	struct FName                                                 CameraInsideCannonSocket;                          // 0x580(0x8)
	struct FName                                                 LaunchSocket;                                      // 0x588(0x8)
	struct FName                                                 TooltipSocket;                                     // 0x590(0x8)
	struct FName                                                 AudioAimRTPCName;                                  // 0x598(0x8)
	struct FName                                                 InsideCannonRTPCName;                              // 0x5a0(0x8)
	class                                                        ProjectileClass;                                   // 0x5a8(0x8)
	float                                                        TimePerFire;                                       // 0x5b0(0x4)
	float                                                        ProjectileSpeed;                                   // 0x5b4(0x4)
	float                                                        ProjectileGravityScale;                            // 0x5b8(0x4)
	Struct FloatRange                                            PitchRange;                                        // 0x5bc(0x10)
	Struct FloatRange                                            YawRange;                                          // 0x5cc(0x10)
	float                                                        PitchSpeed;                                        // 0x5dc(0x4)
	float                                                        YawSpeed;                                          // 0x5e0(0x4)
	class                                                        CameraShake;                                       // 0x5e8(0x8)
	float                                                        ShakeInnerRadius;                                  // 0x5f0(0x4)
	float                                                        ShakeOuterRadius;                                  // 0x5f4(0x4)
	float                                                        CannonFiredAINoiseRange;                           // 0x5f8(0x4)
	struct FName                                                 AINoiseTag;                                        // 0x5fc(0x8)
	Struct FText                                                 CannonDisabledToolTipText;                         // 0x608(0x38)
	Struct FText                                                 LoadingDisabledToolTipText;                        // 0x640(0x38)
	class                                                        UseCannonInputId;                                  // 0x678(0x8)
	class                                                        StartLoadingCannonInputId;                         // 0x680(0x8)
	class                                                        StopLoadingCannonInputId;                          // 0x688(0x8)
	float                                                        DefaultFOV;                                        // 0x690(0x4)
	float                                                        AimFOV;                                            // 0x694(0x4)
	float                                                        IntoAimBlendSpeed;                                 // 0x698(0x4)
	float                                                        OutOfAimBlendSpeed;                                // 0x69c(0x4)
	Class WwiseEvent*                                            FireSfx;                                           // 0x6a0(0x8)
	Class WwiseEvent*                                            DryFireSfx;                                        // 0x6a8(0x8)
	Class WwiseEvent*                                            LoadingSfx_Play;                                   // 0x6b0(0x8)
	Class WwiseEvent*                                            LoadingSfx_Stop;                                   // 0x6b8(0x8)
	Class WwiseEvent*                                            UnloadingSfx_Play;                                 // 0x6c0(0x8)
	Class WwiseEvent*                                            UnloadingSfx_Stop;                                 // 0x6c8(0x8)
	Class WwiseEvent*                                            LoadedPlayerSfx;                                   // 0x6d0(0x8)
	Class WwiseEvent*                                            UnloadedPlayerSfx;                                 // 0x6d8(0x8)
	Class WwiseEvent*                                            FiredPlayerSfx;                                    // 0x6e0(0x8)
	Class WwiseObjectPoolWrapper*                                SfxPool;                                           // 0x6e8(0x8)
	Class WwiseEvent*                                            StartPitchMovement;                                // 0x6f0(0x8)
	Class WwiseEvent*                                            StopPitchMovement;                                 // 0x6f8(0x8)
	Class WwiseEvent*                                            StartYawMovement;                                  // 0x700(0x8)
	Class WwiseEvent*                                            StopYawMovement;                                   // 0x708(0x8)
	Class WwiseEvent*                                            StopMovementAtEnd;                                 // 0x710(0x8)
	Class WwiseObjectPoolWrapper*                                SfxMovementPool;                                   // 0x718(0x8)
	Class Object*                                                FuseVfxFirstPerson;                                // 0x720(0x8)
	Class Object*                                                FuseVfxThirdPerson;                                // 0x728(0x8)
	Class Object*                                                MuzzleFlashVfxFirstPerson;                         // 0x730(0x8)
	Class Object*                                                MuzzleFlashVfxThirdPerson;                         // 0x738(0x8)
	struct FName                                                 FuseSocketName;                                    // 0x740(0x8)
	struct FName                                                 BarrelSocketName;                                  // 0x748(0x8)
	class                                                        RadialCategoryFilter;                              // 0x750(0x8)
	class                                                        DefaultLoadedItemDesc;                             // 0x758(0x8)
	float                                                        ClientRotationBlendTime;                           // 0x760(0x4)
	Class ItemInfo*                                              LoadedItemInfo;                                    // 0x768(0x8)
	bool                                                         FiringDisabled;                                    // 0x770(0x1)
	Class MemoryConstrainedMeshInitializer*                      BaseMMCMeshInitializer;                            // 0x790(0x8)
	Class MemoryConstrainedMeshInitializer*                      BarrelMMCMeshInitializer;                          // 0x798(0x8)
	Class CannonDescAsset*                                       DescToSetWhenSafe;                                 // 0x7a0(0x8)
	Class CannonDescAsset*                                       CurrentCannonDesc;                                 // 0x7a8(0x8)
	float                                                        ServerPitch;                                       // 0x7b0(0x4)
	float                                                        ServerYaw;                                         // 0x7b4(0x4)
	Class ParticleSystemComponent*                               LoadedItemVFXComp;                                 // 0x7b8(0x8)
	Class StaticMesh*                                            DefaultFuseMesh;                                   // 0x7c0(0x8)
	byte                                                         InteractionState;                                  // 0xcb8(0x1)
};


// Size 0xf0
class ShipCurseComponent: public ActorComponent
{
public:
	TArray<class Actor*>                                         CachedShipAttachedActors;                          // 0xc8(0x10)
	TArray<class Mast*>                                          FoundMasts;                                        // 0xd8(0x10)
	Class Capstan*                                               ShipCapstan;                                       // 0xe8(0x8)
	TArray<class Cannon*>                                        ShipCannons;                                       // 0xf0(0x10)
	Class Wheel*                                                 ShipWheel;                                         // 0x100(0x8)
	TArray<class FixedIntentComponent*>                          SailFixedIntentComponents;                         // 0x108(0x10)
	float                                                        ShipCapstanTargetRatio;                            // 0x184(0x4)
	TArray<Struct ShipActiveCurseFXData>                         ActiveCurseFX;                                     // 0x188(0x10)
	TArray<class Actor*>                                         ActorsAffectedByToggleInteractionsCurse;           // 0x198(0x10)
	TArray<Struct ShipCurseSpawnedFXForCurse>                    SpawnedFXForCurses;                                // 0x1a8(0x10)
};


// Size 0x88
class SinkingComponent: public ActorComponent
{
public:
	Struct SinkingShipParams                                     SinkingParams;                                     // 0xd8(0x38)
	Class Ship*                                                  Ship;                                              // 0x110(0x8)
	byte                                                         ShipState;                                         // 0x118(0x1)
	int                                                          KeelOverConfigIndex;                               // 0x11c(0x4)
};


// Size 0x12d8
class Ship: public Actor
{
public:
	Struct ShipPartConnections                                   PartConnections;                                   // 0x4b0(0x98)
	Class StaticMeshComponent*                                   BoatCollision;                                     // 0x548(0x8)
	Class BasisComponent*                                        BoatBasis;                                         // 0x550(0x8)
	Class StaticMeshComponent*                                   OverlapHit;                                        // 0x558(0x8)
	Class StaticMeshComponent*                                   BelowDeckVolume;                                   // 0x560(0x8)
	Class StaticMeshComponent*                                   CabinVolume;                                       // 0x568(0x8)
	Struct ObjectMessagingDispatcher                             ObjectMessageDispatcher;                           // 0x570(0xa0)
	Class TeleportLocationRetrievalComponent*                    TeleportLocationRetrievalComponent;                // 0x610(0x8)
	Class ChildActorComponent*                                   ShipInternalWaterComponent;                        // 0x618(0x8)
	Class SinkingComponent*                                      SinkingComponent;                                  // 0x620(0x8)
	Class ShipHullCollisionComponent*                            HullCollisionComponent;                            // 0x628(0x8)
	Class TetherCustomisationComponent*                          TetherCustomisationComponent;                      // 0x630(0x8)
	Class ShipStuckDetectionComponent*                           StuckDetectionComponent;                           // 0x638(0x8)
	Class StatusEffectManagerComponent*                          StatusEffectManagerComponent;                      // 0x640(0x8)
	Class StatusEffectPersistenceComponent*                      StatusEffectPersistenceComponent;                  // 0x648(0x8)
	Class ShipCurseComponent*                                    ShipCurseComponent;                                // 0x650(0x8)
	Class AIOnShipManagerComponent*                              AIOnShipManagerComponent;                          // 0x658(0x8)
	Class InstancedNavMeshComponent*                             InstancedNavMeshComponent;                         // 0x660(0x8)
	Class DockableComponent*                                     DockableComponent;                                 // 0x668(0x8)
	Class InvasionBattleBoundsComponent*                         InvasionBattleBoundsComponent;                     // 0x670(0x8)
	Struct WaterBuoyancy                                         Buoyancy;                                          // 0x680(0x130)
	Class CrewOwnershipComponent*                                CrewOwnershipComponent;                            // 0x7b0(0x8)
	Class OnboardCharacterTrackerComponent*                      OnboardCharacterTrackerComponent;                  // 0x7b8(0x8)
	Class RewindComponent*                                       RewindComponent;                                   // 0x7c0(0x8)
	Class ShipLiveryComponent*                                   LiveryComponent;                                   // 0x7c8(0x8)
	Class ShipAnnouncementComponent*                             ShipAnnouncementComponent;                         // 0x7d0(0x8)
	Class ReplicatedShipPartCustomizationComponent*              HullLiveryCustomizationComponent;                  // 0x7d8(0x8)
	Class ReplicatedShipPartCustomizationComponent*              SailsLiveryCustomizationComponent;                 // 0x7e0(0x8)
	Class ReplicatedShipPartCustomizationComponent*              CannonEnchantmentCustomizationComponent;           // 0x7e8(0x8)
	Class ReplicatedShipPartCustomizationComponent*              ShipAnnouncementPartCustomizationComponent;        // 0x7f0(0x8)
	class                                                        RammerType;                                        // 0x7f8(0x8)
	Class GroupedInteractableAreaComponent*                      GroupedInteractableAreaComponent;                  // 0x800(0x8)
	Struct ShipConfigurationSettings                             ShipConfigurationSettings;                         // 0x808(0x18)
	float                                                        RainFillRate;                                      // 0x820(0x4)
	float                                                        RainTimePerDrop;                                   // 0x824(0x4)
	float                                                        RainDropScale;                                     // 0x828(0x4)
	float                                                        RainDropRadius;                                    // 0x82c(0x4)
	float                                                        RainStrengthMinimumToFillShip;                     // 0x830(0x4)
	TArray<Struct Vector>                                        AITargetVisibilityPoints;                          // 0x838(0x10)
	Struct AchievementSailThroughStormAtNightWithLightsOff       AchievementSailThroughStormAtNightWithLightsOff;   // 0x848(0x80)
	Struct AchievementSailCloseToShipWithoutFiring               AchievementSailCloseToShipWithoutFiring;           // 0x8c8(0x18)
	Struct AchievementSailFullyWithTheWind                       AchievementSailFullyIntoTheWind;                   // 0x8e0(0x8)
	Struct AchievementSailWithFlameOfFateColoursAboard           AchievementSailWithFlameOfFateColoursAboard;       // 0x8e8(0xf8)
	Class ShipSunkTrackingComponent*                             ShipSunkTracker;                                   // 0x9e0(0x8)
	Class ImpulseThrottlerComponent*                             ImpulseThrottlerComponent;                         // 0x9e8(0x8)
	Class SphereComponent*                                       ReturnToShipVolume;                                // 0x9f0(0x8)
	float                                                        ReturnToShipVolumeRadius;                          // 0x9f8(0x4)
	byte                                                         BowSplashReturnType;                               // 0x9fc(0x1)
	Struct ShipDynamics                                          ShipDynamics;                                      // 0xa00(0xa0)
	Struct RigidBodyErrorCorrection                              PhysicsErrorCorrection;                            // 0xaa0(0x1c)
	Class ShipSinkingParametersDataAsset*                        AdventureSinkingData;                              // 0xac0(0x8)
	Class ShipSinkingParametersDataAsset*                        ArenaSinkingData;                                  // 0xac8(0x8)
	Struct BuoyancySampleMovement                                BuoyancySampleMovement;                            // 0xad0(0x68)
	Struct BuoyancySampleMovement                                SurfacingBuoyancySampleMovement;                   // 0xb38(0x68)
	bool                                                         AttachPlayersToShipWhenSurfacing;                  // 0xba0(0x1)
	float                                                        SurfacingAttachDuration;                           // 0xba4(0x4)
	Struct BuoyancySampleMovement                                DivingBuoyancySampleMovement;                      // 0xba8(0x68)
	bool                                                         AttachPlayersToShipWhenDiving;                     // 0xc10(0x1)
	float                                                        DivingAttachDuration;                              // 0xc14(0x4)
	Class ShipNosediveBrake*                                     NosediveBrake;                                     // 0xc18(0x8)
	Class ShipRolloverCorrector*                                 RolloverCorrector;                                 // 0xc20(0x8)
	Class BowSplashContainer*                                    BowSplashContainer;                                // 0xc28(0x8)
	Class BowSplashContainer*                                    SurfacingBowSplashContainer;                       // 0xc30(0x8)
	Class BowSplashContainer*                                    DivingBowSplashContainer;                          // 0xc38(0x8)
	Class ShipResurfaceWetnessContainer*                         ShipResurfaceWetnessContainer;                     // 0xc40(0x8)
	bool                                                         DisableSailingBowSplashesWhenDiving;               // 0xc48(0x1)
	Class LocatorContainer*                                      ShipLocators;                                      // 0xc50(0x8)
	Struct Vector                                                LocalSailForceApplicationOffset;                   // 0xc58(0xc)
	Class CurveFloat*                                            ShipSpeedToChoppinessScalarCurve;                  // 0xc68(0x8)
	Class CurveFloat*                                            HullSubmergedValueRemapping;                       // 0xc70(0x8)
	float                                                        FakeBuoyancyZOffsetScalarSpringAccel;              // 0xc78(0x4)
	float                                                        PositionSamplerTimeWindow;                         // 0xc7c(0x4)
	struct FName                                                 ClientConvexHullCollisionProfile;                  // 0xc80(0x8)
	float                                                        EmpiricalMaxSpeedInMPS;                            // 0xc88(0x4)
	Struct Transform                                             BrigSpawnLocation;                                 // 0xc90(0x30)
	float                                                        WaterStrengthThresholdForStormDamage;              // 0xcc0(0x4)
	class                                                        FirePropagationBlueprint;                          // 0xcc8(0x8)
	Class ShipFirePropagationComponent*                          FirePropagationComponent;                          // 0xcd0(0x8)
	Struct EncounterParams                                       SightingEncounterParams;                           // 0xd70(0xc)
	Struct EncounterParams                                       CloseProximityEncounterParams;                     // 0xd7c(0xc)
	class                                                        ShipCategoryObject;                                // 0xd98(0x8)
	class                                                        ShipSizeObject;                                    // 0xda0(0x8)
	class                                                        ShipTypeObject;                                    // 0xda8(0x8)
	TArray<class Actor*>                                         DamageableChildActors;                             // 0xdb0(0x10)
	Class ShipPartsDamageTrackerComponent*                       ShipPartsDamageTrackerComponent;                   // 0xdc0(0x8)
	Class CrewShipManifest*                                      CrewShipManifest;                                  // 0xdc8(0x8)
	bool                                                         IsInCaptainedCrew;                                 // 0xdd0(0x1)
	Class Object*                                                HullDamage;                                        // 0xe40(0x8)
	Class VoyageProposalContainer*                               QuestTable;                                        // 0xe48(0x8)
	Class SurfaceWaterComponent*                                 DeckWater;                                         // 0xe50(0x8)
	Class WaterExposureComponent*                                WaterExposureComponent;                            // 0xe58(0x8)
	Class ShroudBreakerTrackerComponent*                         ShroudBreakerTrackerComponent;                     // 0xe60(0x8)
	Class FlotsamItemSpawnComponent*                             FlotsamComponent;                                  // 0xe68(0x8)
	Struct NetTimeStampCalculator                                MovementTimeStamp;                                 // 0xe70(0x70)
	float                                                        StormStrainWeight;                                 // 0xfd8(0x4)
	float                                                        WorldEdgeWeight;                                   // 0xfdc(0x4)
	float                                                        TetherMassInertiaScaleWhenAnchored;                // 0xfe0(0x4)
	Struct StrainDamage                                          StormStrainDamage;                                 // 0xfe8(0x28)
	Struct StrainDamage                                          WorldEdgeDamage;                                   // 0x1010(0x28)
	Struct StrainDamage                                          ScuttleDamage;                                     // 0x1038(0x28)
	Struct Vector2D                                              WorldEdgeDamageRange;                              // 0x1060(0x8)
	float                                                        ScuttleForceSinkTime;                              // 0x1068(0x4)
	class                                                        ProxyClass;                                        // 0x1070(0x8)
	Class ShipEntitlementProcessingPolicyDataAsset*              ShipEntitlementProcessingPolicyDataAsset;          // 0x1078(0x8)
	bool                                                         HasEverStartedSailing;                             // 0x1081(0x1)
	bool                                                         EmissaryFlagActive;                                // 0x1082(0x1)
	bool                                                         InTunnelOfTheDamned;                               // 0x1083(0x1)
	byte                                                         SurfacingState;                                    // 0x1084(0x1)
	double                                                       FinishedResurfacingTimeStamp;                      // 0x1088(0x8)
	TArray<class MobileInstancedStaticMeshComponent*>            InstancedMeshes;                                   // 0x1090(0x10)
	class                                                        ConstraintBudget;                                  // 0x10a0(0x8)
	float                                                        ScuttleTime;                                       // 0x1614(0x4)
};


// Size 0x8
class BTTask_WaitForWieldBase: public BTTaskNode
{
public:
	bool                                                         WaitForUnstashed;                                  // 0x60(0x1)
};


// Size 0x20
class BTTask_SpawnAndWieldItem: public BTTask_WaitForWieldBase
{
public:
	class                                                        ItemDesc;                                          // 0x68(0x8)
};


// Size 0x0
class BTTask_SpawnAmmoItemForAI: public BTTask_SpawnAndWieldItem
{
public:
};


// Size 0x38
class BTTask_SpawnItemForCategory: public BTTask_SpawnAndWieldItem
{
public:
	bool                                                         EnableOverrideItemCategory;                        // 0x88(0x1)
	class                                                        OverrideItemCategory;                              // 0x90(0x8)
	Struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x98(0x28)
};


// Size 0x40
class BTTask_WieldItemByCategory: public BTTask_WaitForWieldBase
{
public:
	bool                                                         EnableOverrideItemCategory;                        // 0x68(0x1)
	class                                                        OverrideItemCategory;                              // 0x70(0x8)
	Struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x78(0x28)
	bool                                                         AllowWieldNoneWhenNoItemOfCategory;                // 0xa0(0x1)
};


// Size 0x60
class BTTask_WaitWeighted: public BTTaskNode
{
public:
	Struct AIDataProviderStructValue                             WeightedRangesFromParams;                          // 0x60(0x30)
	Struct WeightedProbabilityRangeOfRanges                      WeightedRanges;                                    // 0x90(0x30)
};


// Size 0x238
class LaunchableProjectile: public Actor
{
public:
	Class WaterSplashComponent*                                  WaterSplashComponent;                              // 0x3e8(0x8)
	Class ProjectileMovementComponent*                           ProjectileComponent;                               // 0x3f0(0x8)
	float                                                        LaunchLerpTime;                                    // 0x3f8(0x4)
	class                                                        ImpactProjectileId;                                // 0x400(0x8)
	Class Object*                                                TrailEffectAboveWater;                             // 0x408(0x8)
	Class Object*                                                TrailEffectBelowWater;                             // 0x410(0x8)
	byte                                                         TrailVfxRegion;                                    // 0x418(0x1)
	Struct Vector                                                TrailVFXScale;                                     // 0x41c(0xc)
	struct FName                                                 TrailSocketName;                                   // 0x428(0x8)
	struct FName                                                 TrailEmitterName;                                  // 0x430(0x8)
	Class WwiseEvent*                                            TrailSfxPlay;                                      // 0x438(0x8)
	Class WwiseEvent*                                            TrailSfxStop;                                      // 0x440(0x8)
	Class WwiseObjectPoolWrapper*                                TrailSfxPool;                                      // 0x448(0x8)
	bool                                                         DisableStandardCannonFireSfx;                      // 0x450(0x1)
	Class WwiseEvent*                                            CannonFireSfx;                                     // 0x458(0x8)
	Class WwiseObjectPoolWrapper*                                CannonFireSfxPool;                                 // 0x460(0x8)
	bool                                                         DestroyWhenEnteringWater;                          // 0x468(0x1)
	bool                                                         AutoTriggerTrailEffects;                           // 0x469(0x1)
	Class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x4a8(0x8)
	Class ParticleSystemComponent*                               TrailEffect;                                       // 0x4b0(0x8)
	float                                                        LaunchSpeed;                                       // 0x4e0(0x4)
	float                                                        GravityScale;                                      // 0x4e4(0x4)
};


// Size 0x128
class LiquidProjectile: public LaunchableProjectile
{
public:
	byte                                                         ObjectTypeChannelToEnableInShip;                   // 0x600(0x1)
	Class FireGridCellSelectionParamsDataAsset*                  DousingParameters;                                 // 0x608(0x8)
	TArray<Struct Status>                                        StatusesToApply;                                   // 0x610(0x10)
	struct FName                                                 LiquidProjectileNoiseTag;                          // 0x620(0x8)
	float                                                        LiquidProjectileNoiseRadius;                       // 0x628(0x4)
	Struct LiquidContents                                        Contents;                                          // 0x630(0x40)
};


// Size 0x170
class Bucket: public SkeletalMeshWieldableItem
{
public:
	Class InventoryItemComponent*                                InventoryItem;                                     // 0x788(0x8)
	TArray<Struct BucketContentsInfo>                            BucketContentsInfos;                               // 0x790(0x10)
	Class WwiseEvent*                                            ScoopSfx;                                          // 0x7a0(0x8)
	struct FName                                                 ThrowSocketName;                                   // 0x7a8(0x8)
	struct FName                                                 DrenchWielderSocketName;                           // 0x7b0(0x8)
	float                                                        ScoopActionTime;                                   // 0x7b8(0x4)
	float                                                        ScoopCompleteTime;                                 // 0x7bc(0x4)
	float                                                        ThrowActionTime;                                   // 0x7c0(0x4)
	float                                                        ThrowCompleteTime;                                 // 0x7c4(0x4)
	float                                                        DrenchWielderActionTime;                           // 0x7c8(0x4)
	float                                                        DrenchWielderCompleteTime;                         // 0x7cc(0x4)
	float                                                        RequestToleranceTimeOnServer;                      // 0x7d0(0x4)
	float                                                        ProjectileSpeed;                                   // 0x7d4(0x4)
	float                                                        ProjectileAdditionalLiftAngle;                     // 0x7d8(0x4)
	float                                                        WaterFillFromShip;                                 // 0x7dc(0x4)
	float                                                        WaterFillFromSea;                                  // 0x7e0(0x4)
	float                                                        WaterTransferFillAmountModifier;                   // 0x7e4(0x4)
	float                                                        ScoopBufferDistance;                               // 0x7e8(0x4)
	byte                                                         ScoopHitTestTraceChannel;                          // 0x7ec(0x1)
	class                                                        BucketScoopCooldownType;                           // 0x7f0(0x8)
	class                                                        BucketThrowCooldownType;                           // 0x7f8(0x8)
	class                                                        BucketDouseCooldownType;                           // 0x800(0x8)
	float                                                        ThrowLiquidAINoiseRange;                           // 0x808(0x4)
	Class LiquidContainerComponent*                              LiquidContainer;                                   // 0x810(0x8)
	Struct LiquidContents                                        Contents;                                          // 0x818(0x40)
	byte                                                         FillState;                                         // 0x8d0(0x1)
	Class ParticleSystemComponent*                               BucketContentsEffect;                              // 0x8d8(0x8)
};


// Size 0x8
class BuriedItemStep: public TaleQuestStep
{
public:
	Class BuriedItemStepDesc*                                    StepDesc;                                          // 0x98(0x8)
};


// Size 0x28
class BuryingTaleQuestService: public TaleQuestService
{
public:
};


// Size 0x0
class BuryingTaleQuestServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x168
class BuriedItemStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableClass                                    ItemType;                                          // 0x80(0x30)
	Struct QuestVariableItemSpawnDataType                        ItemSpawnData;                                     // 0xb0(0x30)
	Struct QuestVariableGuid                                     ItemId;                                            // 0xe0(0x30)
	float                                                        DigRadius;                                         // 0x110(0x4)
	Struct QuestVariableActor                                    SpawnedItemInfo;                                   // 0x118(0x30)
	Struct QuestVariablePlayerActor                              DiscoveringCharacter;                              // 0x148(0x30)
	bool                                                         TrackBuriedItem;                                   // 0x178(0x1)
	bool                                                         MarkBuriedItemAsCritical;                          // 0x179(0x1)
	bool                                                         MarkActorAsPhased;                                 // 0x17a(0x1)
	Struct FText                                                 CriticalActorLostMessage;                          // 0x180(0x38)
	Struct QuestVariableClass                                    MarkerClass;                                       // 0x1b8(0x30)
};


// Size 0x30
class BuriedItemStepFromLocationDesc: public BuriedItemStepDesc
{
public:
	Struct QuestVariableVector                                   ItemLocation;                                      // 0x1e8(0x30)
};


// Size 0x30
class BuriedItemStepFromActorDesc: public BuriedItemStepDesc
{
public:
	Struct QuestVariableActor                                    PlaceableActor;                                    // 0x1e8(0x30)
};


// Size 0x10
class GeneratedLocationsDataAsset: public DataAsset
{
public:
	TArray<Struct Vector>                                        Locations;                                         // 0x28(0x10)
};


// Size 0x0
class BuriedTreasureDataAsset: public GeneratedLocationsDataAsset
{
public:
};


// Size 0x0
class BuriedTreasureLocationValidator: public Object
{
public:
};


// Size 0x28
class BuriedTreasureLocation: public Actor
{
public:
	Class SphereComponent*                                       BaseComponent;                                     // 0x3c8(0x8)
	TArray<class PhysicalMaterial*>                              DiggableSurfaceTypes;                              // 0x3d0(0x10)
	bool                                                         StopVerification;                                  // 0x3e0(0x1)
};


// Size 0x38
class BurpComponent: public ActorComponent
{
public:
	float                                                        MinGasToTriggerBurp;                               // 0xc8(0x4)
	float                                                        MinRandomBurpDelay;                                // 0xcc(0x4)
	float                                                        MaxRandomBurpDelay;                                // 0xd0(0x4)
	float                                                        GasDecayPerSecond;                                 // 0xd4(0x4)
	Class WwiseEvent*                                            BurpSfx;                                           // 0xd8(0x8)
	struct FName                                                 BurpStrengthRTPCName;                              // 0xe0(0x8)
};


// Size 0x10
class BurrowEruptArea: public BurrowEruptBase
{
public:
	byte                                                         BurrowState;                                       // 0x3c8(0x1)
	Class ExplosionComponent*                                    ExplosionComponent;                                // 0x3d0(0x8)
};


// Size 0x0
class CalmAIStrategyId: public AIStrategyId
{
public:
};


// Size 0x0
class CameraFadeManagerTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x98
class CampaignComponent: public ActorComponent
{
public:
};


// Size 0x18
class CampaignPopUpNotificationDataAsset: public DataAsset
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x28(0x8)
	TArray<Struct CampaignPopUpNotificationInfo>                 CampaignPopUpNotifications;                        // 0x30(0x10)
};


// Size 0x0
class OneShotInteractableFilterDesc: public Object
{
public:
};


// Size 0x0
class CanBeReloadedOneShotInteractableFilterDesc: public OneShotInteractableFilterDesc
{
public:
};


// Size 0x0
class CannonAnimInterface: public Interface
{
public:
};


// Size 0x20
class CannonAnimInstance: public AnimInstance
{
public:
	bool                                                         CannonIsFiring;                                    // 0x448(0x1)
	float                                                        CannonFiringAnimBlend;                             // 0x44c(0x4)
	float                                                        Pitch;                                             // 0x450(0x4)
	float                                                        YawRangeMapped;                                    // 0x454(0x4)
};


// Size 0x10
class CannonBall: public StaticMeshWieldableItem
{
public:
	Class InventoryItemComponent*                                InventoryItem;                                     // 0x780(0x8)
	Class ConsumableWieldableComponent*                          ConsumableWieldable;                               // 0x788(0x8)
};


// Size 0xf0
class Grenade: public CannonBall
{
public:
	Class GrenadeSetupDataAsset*                                 GrenadeSetupDataAsset;                             // 0x798(0x8)
	Struct WeightedProbabilityRangeOfRanges                      RotationRatePitch;                                 // 0x7a0(0x30)
	Struct WeightedProbabilityRangeOfRanges                      RotationRateRoll;                                  // 0x7d0(0x30)
	Struct WeightedProbabilityRangeOfRanges                      RotationRateYaw;                                   // 0x800(0x30)
	class                                                        ThrownProjectileType;                              // 0x830(0x8)
};


// Size 0x0
class CannonballStatus: public StatusBase
{
public:
};


// Size 0x18
class CannonEnchantmentDescAsset: public ShipPartDescAsset
{
public:
	Struct CannonEnchantmentDesc                                 CannonEnchantmentDesc;                             // 0x28(0x18)
};


// Size 0x0
class CannonPitchRateAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x0
class CannonPitchRateRightStickAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x68
class CannonRecoilComponent: public ActorComponent
{
public:
	float                                                        RecoilForce;                                       // 0xc8(0x4)
	Class CurveFloat*                                            YawToRecoilForceModifierCurve;                     // 0xd0(0x8)
	bool                                                         IgnoreRecoilIfAttachedToParent;                    // 0xd8(0x1)
};


// Size 0x0
class CannonRotationStatus: public StatusBase
{
public:
};


// Size 0x0
class CannonSplashDamagerType: public DamagerType
{
public:
};


// Size 0x0
class CannonYawRateAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x0
class CannonYawRateRightStickAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x0
class CanPerformEmoteRadialContext: public RadialContextBase
{
public:
};


// Size 0x18
class IterativeCanvasRenderTarget2D: public TextureRenderTarget2D
{
public:
};


// Size 0x3c0
class CanvasWorldMapComponent: public ActorComponent
{
public:
	int                                                          CanvasWidth;                                       // 0xc8(0x4)
	int                                                          CanvasHeight;                                      // 0xcc(0x4)
	class                                                        MapClass;                                          // 0xd0(0x8)
	int                                                          NumGridSquares;                                    // 0xd8(0x4)
	int                                                          MaxUpdateDist;                                     // 0xdc(0x4)
	float                                                        SquareShipUpdateDist;                              // 0xe0(0x4)
	float                                                        ShipUpdateRot;                                     // 0xe4(0x4)
	TArray<Struct CanvasWorldMapShipIcons>                       ShipIcons;                                         // 0xe8(0x10)
	Class Texture*                                               OffscreenArrowTexture;                             // 0xf8(0x8)
	Class Texture*                                               CompassTexture;                                    // 0x100(0x8)
	Struct Vector2D                                              CompassPosition;                                   // 0x108(0x8)
	Class Font*                                                  Font;                                              // 0x110(0x8)
	Struct Vector2D                                              GridLabelScreenMin;                                // 0x118(0x8)
	Struct Vector2D                                              GridLabelEdgeOffset;                               // 0x120(0x8)
	float                                                        GridLabelSize;                                     // 0x128(0x4)
	float                                                        IslandLabelSize;                                   // 0x12c(0x4)
	float                                                        IslandLabelFadeoutZoom;                            // 0x130(0x4)
	Struct CanvasLerpData                                        IslandLabelFadeData;                               // 0x134(0x10)
	Struct CanvasLerpData                                        OffscreenIndicatorFadeData;                        // 0x144(0x10)
	Struct Box2D                                                 OffscreenIndicatorSafe;                            // 0x154(0x14)
	Struct Box2D                                                 OffscreenIndicatorBounds;                          // 0x168(0x14)
	float                                                        OffscreenArrowOffset;                              // 0x17c(0x4)
	Struct LinearColor                                           BackgroundColour;                                  // 0x180(0x10)
	TArray<Struct CanvasWorldMapReaperTrackedBootItemIcon>       ReapersMarkBootyItemIcons;                         // 0x190(0x10)
	Struct Vector2D                                              ReapersMarkBootyItemOffset;                        // 0x1a0(0x8)
	Class Texture*                                               CrosshairTexture;                                  // 0x1a8(0x8)
	Class Texture*                                               CrosshairEmptyTexture;                             // 0x1b0(0x8)
	Class Texture*                                               PinTexture;                                        // 0x1b8(0x8)
	Class Texture*                                               PinTextureHighlight;                               // 0x1c0(0x8)
	Class Texture*                                               PathDropTexture;                                   // 0x1c8(0x8)
	float                                                        LineTextureWidth;                                  // 0x1d0(0x4)
	float                                                        LineTextureLength;                                 // 0x1d4(0x4)
	TArray<Struct CanvasWorldMapShipIcons>                       TrackedShipIcons;                                  // 0x1d8(0x10)
	Class Texture*                                               AllianceFlagIcon;                                  // 0x1e8(0x8)
