// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0
class DrawDebugServiceInterface: public Interface
{
public:
};


// Size 0xf8
class DrawDebugService: public Actor
{
public:
	TArray<Struct DrawDebugItemMessage>                          MessagesReplicated;                                // 0x3d0(0x10)
	TArray<Struct DrawDebugItemSphere>                           SpheresReplicated;                                 // 0x3e0(0x10)
	TArray<Struct DrawDebugItemBox>                              BoxesReplicated;                                   // 0x3f0(0x10)
	TArray<Struct DrawDebugItemCapsule>                          CapsulesReplicated;                                // 0x400(0x10)
	TArray<Struct DrawDebugItemLine>                             LinesReplicated;                                   // 0x410(0x10)
	TArray<Struct DrawDebugItemSector>                           SectorsReplicated;                                 // 0x420(0x10)
	TArray<Struct DrawDebugItemString>                           StringsReplicated;                                 // 0x430(0x10)
	bool                                                         IsDrawDebugActive;                                 // 0x440(0x1)
};


// Size 0x10
class ShippingDebugActorSphereCollection: public Actor
{
public:
	TArray<Struct SphereData>                                    SphereList;                                        // 0x3c8(0x10)
};


// Size 0x0
class TickableDebugDrawingServiceInterface: public Interface
{
public:
};


// Size 0x28
class Videprinter: public Actor
{
public:
	TArray<Str OutputRingBuffer>                                 OutputRingBuffer;                                  // 0x3c8(0x10)
	int                                                          AddAt;                                             // 0x3d8(0x4)
	struct FName                                                 Id;                                                // 0x3dc(0x8)
};


// Size 0x0
class VideprinterServiceInterface: public Interface
{
public:
};


// Size 0x18
class VideprinterService: public Object
{
public:
	TArray<class Videprinters*>                                  Videprinters;                                      // 0x30(0x10)
};


}