// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x18
struct VideoPlaybackStateEvent
{
public:
	Struct FString                                               MediaTextureName;                                  // 0x0(0x10)
	byte                                                         State;                                             // 0x10(0x1)
};


// Size 0x28
struct VideoSubtitleEvent
{
public:
	Struct FString                                               MediaTextureName;                                  // 0x0(0x10)
	Struct FString                                               SubtitleString;                                    // 0x10(0x10)
	double                                                       SubtitleDuration;                                  // 0x20(0x8)
};


// Size 0x10
struct VideoPlaybackStopEvent
{
public:
	Struct FString                                               MediaTextureName;                                  // 0x0(0x10)
};


// Size 0x10
struct VideoPlaybackPauseEvent
{
public:
	Struct FString                                               MediaTextureName;                                  // 0x0(0x10)
};


// Size 0x10
struct VideoPlaybackStartEvent
{
public:
	Struct FString                                               MediaTextureName;                                  // 0x0(0x10)
};


// Size 0x20
struct VideoPlaybackLoadEvent
{
public:
	Struct FString                                               MediaTextureName;                                  // 0x0(0x10)
	Struct FString                                               VideoUri;                                          // 0x10(0x10)
};


// Size 0x40
struct MediaPlayedTelemetryEvent
{
public:
	Struct FString                                               MediaName;                                         // 0x0(0x10)
	Struct IntPoint                                              LowestResolution;                                  // 0x10(0x8)
	Struct IntPoint                                              MedianResolution;                                  // 0x18(0x8)
	Struct IntPoint                                              HighestResolution;                                 // 0x20(0x8)
};


}