// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0 (Full Size[0x208] - InheritedSize[0x148]
class MetalAIFormComponent: public AthenaAIFormComponent
{
public:
	char                                                         pad0x28_E6VTF[0x28];                               // 0x148(0x28)
	Class ParticleSystem*                                        RustyParticlesTemplate;                            // 0x170(0x8)
	Class SkeletonAudioFootfallControllerParams*                 DefaultFootfallParams;                             // 0x178(0x8)
	Class SkeletonAudioFootfallControllerParams*                 RustyFootfallParams;                               // 0x180(0x8)
	struct FName                                                 RustShaderParamName;                               // 0x1a8(0x8)
	float                                                        NotRustyShaderParamValue;                          // 0x1b0(0x4)
	float                                                        RustyShaderParamValue;                             // 0x1b4(0x4)
	float                                                        ShaderParamBlendSpeed;                             // 0x1b8(0x4)
	struct FName                                                 SeedShaderParamName;                               // 0x1bc(0x8)
	int                                                          MaxSeedShaderValue;                                // 0x1c4(0x4)
	bool                                                         IsWet;                                             // 0x1c8(0x1)
	char                                                         pad0x7_RNVBQ[0x7];                                 // 0x1c9(0x7)
	Class ParticleSystemComponent*                               RustyParticleSystemComponent;                      // 0x1d0(0x8)
	char                                                         pad0x8_V0F7S[0x8];                                 // 0x1d8(0x8)
	Class DamageableVulnerabilityLayer*                          DefaultVulnerabilityLayer;                         // 0x1e0(0x8)
	Class DamageableVulnerabilityLayer*                          RustyVulnerabilityLayer;                           // 0x1e8(0x8)
	Class CharacterHitReactionDamagerTypeToAnimTypeLayer*        RustyHitReactionsLayer;                            // 0x1f0(0x8)
	Class MaterialInstanceDynamic*                               MetalDynamicMaterialInstance;                      // 0x1f8(0x8)
	char                                                         pad0x8_9ZDHV[0x8];                                 // 0x200(0x8)
};


// Size 0xa0 (Full Size[0x1e8] - InheritedSize[0x148]
class PlantAIFormComponent: public AthenaAIFormComponent
{
public:
	char                                                         pad0x28_21INB[0x28];                               // 0x148(0x28)
	Class ParticleSystem*                                        HealingParticlesTemplate;                          // 0x170(0x8)
	Class WwiseEvent*                                            StartHealingAudioLoopEvent;                        // 0x178(0x8)
	Class WwiseEvent*                                            StopHealingAudioLoopEvent;                         // 0x180(0x8)
	Class ParticleSystem*                                        WeakParticlesTemplate;                             // 0x188(0x8)
	struct FName                                                 HealingShaderParamName;                            // 0x1b0(0x8)
	float                                                        IsNotHealingShaderParamValue;                      // 0x1b8(0x4)
	float                                                        IsHealingShaderParamValue;                         // 0x1bc(0x4)
	float                                                        ShaderParamBlendSpeed;                             // 0x1c0(0x4)
	bool                                                         IsWet;                                             // 0x1c4(0x1)
	bool                                                         IsWeak;                                            // 0x1c5(0x1)
	char                                                         pad0x2_AB5VA[0x2];                                 // 0x1c6(0x2)
	Class ParticleSystemComponent*                               HealingParticleSystemComponent;                    // 0x1c8(0x8)
	Class ParticleSystemComponent*                               WeakParticleSystemComponent;                       // 0x1d0(0x8)
	Class MaterialInstanceDynamic*                               PlantDynamicMaterialInstance;                      // 0x1d8(0x8)
	char                                                         pad0x8_K7D3C[0x8];                                 // 0x1e0(0x8)
};


// Size 0x198 (Full Size[0x2e0] - InheritedSize[0x148]
class ShadowAIFormComponent: public AthenaAIFormComponent
{
public:
	byte                                                         FlameSpecificPhobia;                               // 0x148(0x1)
	char                                                         pad0x7_ZE9D8[0x7];                                 // 0x149(0x7)
	Class ParticleSystem*                                        LightStateConstantParticlesTemplate;               // 0x150(0x8)
	Class ParticleSystem*                                        DarkStateConstantParticlesTemplate;                // 0x158(0x8)
	Class ParticleSystem*                                        ToLightTransitionParticlesTemplate;                // 0x160(0x8)
	Class ParticleSystem*                                        ToDarkTransitionParticlesTemplate;                 // 0x168(0x8)
	Class PhysicalMaterial*                                      ClientLightStatePhysMaterialOverride;              // 0x170(0x8)
	Class PhysicalMaterial*                                      ClientDarkStatePhysMaterialOverride;               // 0x178(0x8)
	Class WwiseEvent*                                            StartDarkStateAudioLoopEvent;                      // 0x180(0x8)
	Class WwiseEvent*                                            StopDarkStateAudioLoopEvent;                       // 0x188(0x8)
	TArray<Assetclass ShadowBaseMaterials>                       ShadowBaseMaterials;                               // 0x190(0x10)
	struct FName                                                 ShadowShaderParamName;                             // 0x1a0(0x8)
	float                                                        LightStateShaderParamValue;                        // 0x1a8(0x4)
	float                                                        DarkStateShaderParamValue;                         // 0x1ac(0x4)
	float                                                        ShaderParamBlendSpeed;                             // 0x1b0(0x4)
	struct FName                                                 SeedShaderParamName;                               // 0x1b4(0x8)
	int                                                          MaxSeedShaderValue;                                // 0x1bc(0x4)
	byte                                                         CurrentState;                                      // 0x1c0(0x1)
	char                                                         pad0x7_U693G[0x7];                                 // 0x1c1(0x7)
	Class ParticleSystemComponent*                               LightStateConstantParticleSystemComponent;         // 0x1c8(0x8)
	Class ParticleSystemComponent*                               DarkStateConstantParticleSystemComponent;          // 0x1d0(0x8)
	TArray<class MaterialInstanceDynamic*>                       ShadowDynamicMaterialInstances;                    // 0x1d8(0x10)
	char                                                         pad0x78_IMND0[0x78];                               // 0x1e8(0x78)
	TArray<struct FlameSpecificDataMap>                          FlameSpecificDataMap;                              // 0x260(0x10)
	char                                                         pad0x70_BLY2O[0x70];                               // 0x270(0x70)
};


// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class EntitlementDesc: public DataAsset
{
public:
	Struct FText                                                 Title;                                             // 0x28(0x38)
	Struct FText                                                 Description;                                       // 0x60(0x38)
	Struct StringAssetReference                                  IconInvPath;                                       // 0x98(0x10)
	Struct StringAssetReference                                  IconPrvPath;                                       // 0xa8(0x10)
	class                                                        Category;                                          // 0xb8(0x8)
	class                                                        Company;                                           // 0xc0(0x8)
};


// Size 0x8 (Full Size[0xd0] - InheritedSize[0xc8]
class ClothingDesc: public EntitlementDesc
{
public:
	struct FName                                                 WardrobeKey;                                       // 0xc8(0x8)
};


// Size 0x30 (Full Size[0xf8] - InheritedSize[0xc8]
class ShipCustomizationDesc: public EntitlementDesc
{
public:
	Struct StringAssetReference                                  CustomizationInfo;                                 // 0xc8(0x10)
	Struct FString                                               PreviousItem;                                      // 0xd8(0x10)
	Struct FString                                               NextItem;                                          // 0xe8(0x10)
};


// Size 0x0 (Full Size[0xc8] - InheritedSize[0xc8]
class TaleRankDesc: public EntitlementDesc
{
public:
};


// Size 0x0 (Full Size[0xd0] - InheritedSize[0xd0]
class TitleDesc: public ClothingDesc
{
public:
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class ShantyItemDesc: public EntitlementDesc
{
public:
	Struct ShantyData                                            ShantyData;                                        // 0xc8(0x30)
	Struct StringAssetReference                                  BackgroundPath;                                    // 0xf8(0x10)
};


// Size 0x0 (Full Size[0xc8] - InheritedSize[0xc8]
class SeasonPassEntitlementDesc: public EntitlementDesc
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class PrimaryItemUsePressedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SecondaryItemUsePressedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class InteractableBase: public Actor
{
public:
	char                                                         pad0x10_VXBKD[0x10];                               // 0x3c8(0x10)
	bool                                                         RequiresFacingFront;                               // 0x3d8(0x1)
	bool                                                         RequiresNotBeingAirborne;                          // 0x3d9(0x1)
	bool                                                         RequiresNotSwimming;                               // 0x3da(0x1)
	bool                                                         InteractionsCanBeDisabled;                         // 0x3db(0x1)
	bool                                                         CanSetInteractionState;                            // 0x3dc(0x1)
	char                                                         pad0x3_742TE[0x3];                                 // 0x3dd(0x3)
	TArray<class InteractionPrerequisiteBase*>                   InteractionPrerequisites;                          // 0x3e0(0x10)
	Class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x3f0(0x8)
	byte                                                         InteractableIdentifier;                            // 0x3f8(0x1)
	char                                                         pad0x1_9ZO41[0x1];                                 // 0x3f9(0x1)
	byte                                                         CurrentInteractionState;                           // 0x3fa(0x1)
	char                                                         pad0x5_KW3E1[0x5];                                 // 0x3fb(0x5)
};


// Size 0x110 (Full Size[0x510] - InheritedSize[0x400]
class ControllableObject: public InteractableBase
{
public:
	char                                                         pad0x30_MY4IA[0x30];                               // 0x400(0x30)
	Struct ControlObjectActionRuleParams                         ControlObjectActionRuleParams;                     // 0x430(0x10)
	Class PhrasesRadialDataAsset*                                Phrases;                                           // 0x440(0x8)
	bool                                                         AllowDisconnectWhenIdle;                           // 0x448(0x1)
	char                                                         pad0x3_H506G[0x3];                                 // 0x449(0x3)
	char                                                         pad0xc4_G6Y8S[0xc4];                               // 0x44c(0xc4)
};


// Size 0x10 (Full Size[0x520] - InheritedSize[0x510]
class ControllablePulley: public ControllableObject
{
public:
	char                                                         pad0x8_RSBZJ[0x8];                                 // 0x510(0x8)
	Class ControllableIntentComponent*                           IntentComponent;                                   // 0x518(0x8)
};


// Size 0x318 (Full Size[0x838] - InheritedSize[0x520]
class SailManipulator: public ControllablePulley
{
public:
	Struct RopeVisualParams                                      RopeVisuals;                                       // 0x520(0xc)
	float                                                        RopeLength;                                        // 0x52c(0x4)
	Class StaticMeshComponent*                                   BaseMeshComponent;                                 // 0x530(0x8)
	Class StaticMeshComponent*                                   TopMeshComponent;                                  // 0x538(0x8)
	Class FixedIntentComponent*                                  CurseIntentComponent;                              // 0x540(0x8)
	Class WwiseObjectPoolWrapper*                                ManipulatorAudioPool;                              // 0x548(0x8)
	Struct SocketId                                              MastSocketId;                                      // 0x550(0x20)
	Class SailManipulatorAudioParams*                            AudioParams;                                       // 0x570(0x8)
	Class SceneComponent*                                        MastSocketSceneComponent;                          // 0x578(0x8)
	Struct WwiseEmitter                                          AudioEmitter;                                      // 0x580(0x20)
	char                                                         pad0x270_66B48[0x270];                             // 0x5a0(0x270)
	Class Mast*                                                  BoundMast;                                         // 0x810(0x8)
	Class Mast*                                                  PendingBoundMast;                                  // 0x818(0x8)
	bool                                                         Locked;                                            // 0x820(0x1)
	char                                                         pad0x7_4Y4Z6[0x7];                                 // 0x821(0x7)
	Class MobileInstancedStaticMeshComponent*                    TopMeshInstanceComponent;                          // 0x828(0x8)
	char                                                         pad0x8_IXHDW[0x8];                                 // 0x830(0x8)
};


// Size 0x28 (Full Size[0x860] - InheritedSize[0x838]
class SailHoist: public SailManipulator
{
public:
	char                                                         pad0x8_OI7XB[0x8];                                 // 0x838(0x8)
	float                                                        RopeUVSpeed;                                       // 0x840(0x4)
	char                                                         pad0x4_F2LG0[0x4];                                 // 0x844(0x4)
	Class RiggingSystemComponent*                                Rigging;                                           // 0x848(0x8)
	int                                                          RiggingRopeIndex;                                  // 0x850(0x4)
	bool                                                         PlayAudio;                                         // 0x854(0x1)
	char                                                         pad0xb_4FCH2[0xb];                                 // 0x855(0xb)
};


// Size 0x600 (Full Size[0x9c8] - InheritedSize[0x3c8]
class Mast: public Actor
{
public:
	char                                                         pad0x40_RS9ES[0x40];                               // 0x3c8(0x40)
	byte                                                         MastType;                                          // 0x408(0x1)
	char                                                         pad0x7_WL88B[0x7];                                 // 0x409(0x7)
	Class MastAudioParams*                                       MastAudioParams;                                   // 0x410(0x8)
	Class SceneComponent*                                        SceneRootComponent;                                // 0x418(0x8)
	Class IntentCombinerComponent*                               AngleCombinerComponent;                            // 0x420(0x8)
	Class IntentCombinerComponent*                               SailHoistIntentCombinerComponent;                  // 0x428(0x8)
	Class IntentCombinerComponent*                               MastHoistIntentCombinerComponent;                  // 0x430(0x8)
	Class SceneComponent*                                        MastMovingAttachComponent;                         // 0x438(0x8)
	Class SceneComponent*                                        SailAnglePivotComponent;                           // 0x440(0x8)
	Class ReplicatedShipPartCustomizationComponent*              CustomizationComponent;                            // 0x448(0x8)
	Class RepairableComponent*                                   RepairableComponentFirst;                          // 0x450(0x8)
	Class RepairableComponent*                                   RepairableComponentSecond;                         // 0x458(0x8)
	Class RepairableComponent*                                   RepairableComponentThird;                          // 0x460(0x8)
	Class ShipDamageableComponent*                               DamageableComponent;                               // 0x468(0x8)
	Class MastFlammableComponent*                                MastFlammableComponent;                            // 0x470(0x8)
	float                                                        AngleBlend;                                        // 0x478(0x4)
	float                                                        LoweredBlend;                                      // 0x47c(0x4)
	float                                                        LoweringSpeed;                                     // 0x480(0x4)
	float                                                        RaisingSpeed;                                      // 0x484(0x4)
	float                                                        TurnSpeed;                                         // 0x488(0x4)
	float                                                        MaxTurnAngle;                                      // 0x48c(0x4)
	float                                                        SailOffsetFromMast;                                // 0x490(0x4)
	float                                                        SailWidth;                                         // 0x494(0x4)
	float                                                        SailHeight;                                        // 0x498(0x4)
	float                                                        SailStartOffset;                                   // 0x49c(0x4)
	Struct Vector                                                LookAtPosLow;                                      // 0x4a0(0xc)
	Struct Vector                                                LookAtPosHigh;                                     // 0x4ac(0xc)
	Class WwiseObjectPoolWrapper*                                SailAudioPool;                                     // 0x4b8(0x8)
	Class WwiseEvent*                                            AmbientSailFlapsSfx;                               // 0x4c0(0x8)
	Class WwiseEvent*                                            AmbientSailFlapsStopSfx;                           // 0x4c8(0x8)
	Class WwiseEvent*                                            PerfectSailInflationOneShot;                       // 0x4d0(0x8)
	Class WwiseEvent*                                            SailLostPerfectWindOneShot;                        // 0x4d8(0x8)
	struct FName                                                 InflationRTPC;                                     // 0x4e0(0x8)
	struct FName                                                 SailLengthRTPC;                                    // 0x4e8(0x8)
	float                                                        ClientSailBlendSpeed;                              // 0x4f0(0x4)
	char                                                         pad0x4_OWJ04[0x4];                                 // 0x4f4(0x4)
	TArray<class StaticMeshComponent*>                           YardArms;                                          // 0x4f8(0x10)
	struct FName                                                 TelemetryIdentifier;                               // 0x508(0x8)
	bool                                                         MastShouldBeFractured;                             // 0x510(0x1)
	char                                                         pad0x3_NQAPX[0x3];                                 // 0x511(0x3)
	Struct MastCollisionProfiles                                 MastCollisionProfiles;                             // 0x514(0x28)
	char                                                         pad0x4_FDS5B[0x4];                                 // 0x53c(0x4)
	Struct MastPhysicsComponents                                 MastPhysicsComponents;                             // 0x540(0x38)
	Class StaticMesh*                                            MastIntactMesh;                                    // 0x578(0x8)
	Class StaticMesh*                                            MastFractureMeshBottom;                            // 0x580(0x8)
	float                                                        MastFractureMeshBottomScale;                       // 0x588(0x4)
	float                                                        MastFractureMeshOriginalScale;                     // 0x58c(0x4)
	Class StaticMesh*                                            MastFractureMeshTop;                               // 0x590(0x8)
	Class ParticleSystem*                                        DamageParticleSystem;                              // 0x598(0x8)
	float                                                        HingeHeight;                                       // 0x5a0(0x4)
	float                                                        HingeDistanceFromCentre;                           // 0x5a4(0x4)
	float                                                        HingeDirectionAngle;                               // 0x5a8(0x4)
	float                                                        MaxFallAngle;                                      // 0x5ac(0x4)
	float                                                        MastLiftingSpeed;                                  // 0x5b0(0x4)
	bool                                                         OverrideSailLengthWhenFalling;                     // 0x5b4(0x1)
	char                                                         pad0x3_IJOU3[0x3];                                 // 0x5b5(0x3)
	float                                                        MaxFallenSailLength;                               // 0x5b8(0x4)
	float                                                        SailFoldingSpeed;                                  // 0x5bc(0x4)
	bool                                                         OverrideSailAngleWhenFalling;                      // 0x5c0(0x1)
	char                                                         pad0x3_M6LZR[0x3];                                 // 0x5c1(0x3)
	float                                                        DesiredFallingSailAngle;                           // 0x5c4(0x4)
	float                                                        SailTwistingSpeed;                                 // 0x5c8(0x4)
	char                                                         pad0x4_F5WNZ[0x4];                                 // 0x5cc(0x4)
	Class MastHinge*                                             Hinge;                                             // 0x5d0(0x8)
	Struct WeightedProbabilityRangeOfRanges                      MastImpactForceToApplyToShip;                      // 0x5d8(0x30)
	float                                                        MastImpactForceModifierToApplyToKrakenWrappedShip; // 0x608(0x4)
	float                                                        MastImpactHeightLocation;                          // 0x60c(0x4)
	class                                                        CameraShake;                                       // 0x610(0x8)
	float                                                        CameraShakeInnerRadius;                            // 0x618(0x4)
	float                                                        CameraShakeOuterRadius;                            // 0x61c(0x4)
	bool                                                         PreviewMastFallenPosition;                         // 0x620(0x1)
	char                                                         pad0x7_JQ0CV[0x7];                                 // 0x621(0x7)
	TArray<class RepairableComponent*>                           RepairableComponents;                              // 0x628(0x10)
	Struct MastDamageAudioParams                                 DamageAudioParameters;                             // 0x638(0xb0)
	char                                                         pad0x8_RULDE[0x8];                                 // 0x6e8(0x8)
	Class TetherCustomisationComponent*                          TetherCustomisationComponent;                      // 0x6f0(0x8)
	char                                                         pad0xa0_FWZZG[0xa0];                               // 0x6f8(0xa0)
	TArray<class ChildActorComponent*>                           LinkedSails;                                       // 0x798(0x10)
	Struct IntentPredictor                                       LengthIntentPredictor;                             // 0x7a8(0x1c)
	Struct IntentPredictor                                       AngleIntentPredictor;                              // 0x7c4(0x1c)
	Struct IntentPredictor                                       MastHoistIntentPredictor;                          // 0x7e0(0x1c)
	bool                                                         MastHoistingControlSchemeActive;                   // 0x7fc(0x1)
	char                                                         pad0x3_JGTDU[0x3];                                 // 0x7fd(0x3)
	Struct ObjectMessagingHandle                                 SailGotPerfectWindEventHandle;                     // 0x800(0x58)
	Struct ObjectMessagingHandle                                 SailLostPerfectWindEventHandle;                    // 0x858(0x58)
	Struct ObjectMessagingHandle                                 MastRepairStoppedHandle;                           // 0x8b0(0x58)
	char                                                         pad0x10_CM10I[0x10];                               // 0x908(0x10)
	Struct WwiseEmitter                                          SailsAudioEmitter;                                 // 0x918(0x20)
	float                                                        ServerAngleRatio;                                  // 0x938(0x4)
	float                                                        ServerLoweredProportion;                           // 0x93c(0x4)
	byte                                                         ForceBillowingState;                               // 0x940(0x1)
	char                                                         pad0x3_7YAQ3[0x3];                                 // 0x941(0x3)
	float                                                        ServerMastFallingProportion;                       // 0x944(0x4)
	char                                                         pad0x1c_8LGX3[0x1c];                               // 0x948(0x1c)
	bool                                                         AllowedToFall;                                     // 0x964(0x1)
	bool                                                         PlayAudio;                                         // 0x965(0x1)
	char                                                         pad0x3a_ARJAU[0x3a];                               // 0x966(0x3a)
	bool                                                         IsCursed;                                          // 0x9a0(0x1)
	char                                                         pad0x27_KH00B[0x27];                               // 0x9a1(0x27)
};


// Size 0x30 (Full Size[0x868] - InheritedSize[0x838]
class SailAngle: public SailManipulator
{
public:
	char                                                         pad0x8_E78L5[0x8];                                 // 0x838(0x8)
	float                                                        RopeUVSpeed;                                       // 0x840(0x4)
	char                                                         pad0x4_BGPCS[0x4];                                 // 0x844(0x4)
	Class RiggingSystemComponent*                                Rigging;                                           // 0x848(0x8)
	int                                                          RiggingLeftRopeIndex;                              // 0x850(0x4)
	int                                                          RiggingRightRopeIndex;                             // 0x854(0x4)
	bool                                                         PlayAudio;                                         // 0x858(0x1)
	char                                                         pad0xf_0V3WK[0xf];                                 // 0x859(0xf)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class PrimaryInteractNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class InteractOrDisengageNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SecondaryInteractNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class CompositeQuickSwitchWeaponSecondaryInteractNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class PrimaryItemUseReleasedNotificationInputId: public PrimaryItemUsePressedNotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SecondaryItemUseReleasedNotificationInputId: public SecondaryItemUsePressedNotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventType: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SkellyFortGameEventTypeBase: public GameEventType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SkellyFortGameEventType: public SkellyFortGameEventTypeBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SkellyFort2022GameEventType: public SkellyFortGameEventType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class KrakenGameEventType: public GameEventType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TinySharkGameEventType: public GameEventType
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SecondaryInteractReleasedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class PrimaryInteractReleasedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AbsorbsLiquidInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class AbsorbsLiquidComponent: public ActorComponent
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AchievementDefinitionDataAsset: public DataAsset
{
public:
	TArray<struct AchievementDefintions>                         AchievementDefintions;                             // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ActionRulesBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class ActionRuleTestActor: public Actor
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RadialContextBase: public Object
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ActionStateRadialContext: public RadialContextBase
{
public:
	TArray<class Class*>                                         TargetActionStates;                                // 0x28(0x10)
	bool                                                         AreDockablePhrasesRequired;                        // 0x38(0x1)
	char                                                         pad0x7_LUNXM[0x7];                                 // 0x39(0x7)
};


// Size 0xa8 (Full Size[0x3f0] - InheritedSize[0x348]
class ActorCoherentViewComponent: public CoherentUIGTComponent
{
public:
	char                                                         pad0xa0_MA2IG[0xa0];                               // 0x348(0xa0)
	struct FName                                                 TargetPrimitiveName;                               // 0x3e8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ActorRelevancyTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AddFogBankAvoidanceAreaStep: public TaleQuestStep
{
public:
};


// Size 0x20 (Full Size[0x3e8] - InheritedSize[0x3c8]
class FogBankManager: public Actor
{
public:
	TArray<struct FeatureToggledManagerAssetsArray>              FeatureToggledManagerAssetsArray;                  // 0x3c8(0x10)
	Class FogBankManagerDataAsset*                               DefaultFogBankManagerDataAsset;                    // 0x3d8(0x8)
	Class FogBankManagerDataAsset*                               ActiveFogBankManagerDataAsset;                     // 0x3e0(0x8)
};


// Size 0x18 (Full Size[0x78] - InheritedSize[0x60]
class FogBankTaleService: public TaleQuestService
{
public:
	Class FogBankTaleServiceDesc*                                Desc;                                              // 0x60(0x8)
	TArray<struct FogBankAvoidanceAreas>                         FogBankAvoidanceAreas;                             // 0x68(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FogBankTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class AddFogBankAvoidanceAreaStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableVector                                   Location;                                          // 0x80(0x30)
	Struct QuestVariableFloat                                    Radius;                                            // 0xb0(0x30)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class AddMechanismTriggerStep: public TaleQuestStep
{
public:
	Class AddMechanismTriggerStepDesc*                           Desc;                                              // 0x98(0x8)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class AddMechanismTriggerStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    Action;                                            // 0x80(0x30)
	Struct QuestVariableActor                                    Trigger;                                           // 0xb0(0x30)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class AddOpenContainerActionRuleComponent: public ActorComponent
{
public:
	class                                                        NotificationInputId;                               // 0xc8(0x8)
	byte                                                         DisplayPriority;                                   // 0xd0(0x1)
	char                                                         pad0x7_WHAQD[0x7];                                 // 0xd1(0x7)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class AddReloadAmmoActionRuleComponent: public ActorComponent
{
public:
	class                                                        NotificationInputId;                               // 0xc8(0x8)
	byte                                                         DisplayPriority;                                   // 0xd0(0x1)
	char                                                         pad0x7_NWBM4[0x7];                                 // 0xd1(0x7)
};


// Size 0x100 (Full Size[0x4c8] - InheritedSize[0x3c8]
class AdjustableWaterLevelPuzzle: public Actor
{
public:
	char                                                         pad0x8_J9X06[0x8];                                 // 0x3c8(0x8)
	Class SceneComponent*                                        RootComp;                                          // 0x3d0(0x8)
	Class ChildActorComponent*                                   WaterVolumeComponent;                              // 0x3d8(0x8)
	Class VariableFillRateWaterVolume*                           WaterVolumeActor;                                  // 0x3e0(0x8)
	TArray<struct WaterLevels>                                   WaterLevels;                                       // 0x3e8(0x10)
	int                                                          DefaultWaterLevelIndex;                            // 0x3f8(0x4)
	char                                                         pad0x4_00XFT[0x4];                                 // 0x3fc(0x4)
	Class CurveFloat*                                            FillCurve;                                         // 0x400(0x8)
	Class CurveFloat*                                            DrainCurve;                                        // 0x408(0x8)
	Class CurveFloat*                                            ResetCurve;                                        // 0x410(0x8)
	float                                                        PuzzleResetTimeout;                                // 0x418(0x4)
	Struct WaterPuzzleRepData                                    ReppedData;                                        // 0x41c(0x8)
	char                                                         pad0xa4_DSIYP[0xa4];                               // 0x424(0xa4)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AdjustableWaterLevelPuzzleAudioParams: public DataAsset
{
public:
	Class WwiseObjectPoolWrapper*                                WaterLevelPuzzlePool;                              // 0x28(0x8)
	Class WwiseEvent*                                            PuzzleWaterRiseStartEvent;                         // 0x30(0x8)
	Class WwiseEvent*                                            PuzzleWaterRiseEndEvent;                           // 0x38(0x8)
	Class WwiseEvent*                                            PuzzleWaterFallStartEvent;                         // 0x40(0x8)
	Class WwiseEvent*                                            PuzzleWaterFallEndEvent;                           // 0x48(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class QuestBookPageBundle: public DataAsset
{
public:
	TArray<struct Pages>                                         Pages;                                             // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AdventuresActorBundleAsset: public DataAsset
{
public:
	TArray<struct Contents>                                      Contents;                                          // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AdventuresBundleListingAsset: public DataAsset
{
public:
	TArray<struct Pages>                                         Pages;                                             // 0x28(0x10)
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class AdventuresActorBundleTaleFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AdventureSettings: public DeveloperSettings
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AgitatedAIStrategyId: public AIStrategyId
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class AIBuffStatus: public StatusBase
{
public:
};


// Size 0x18 (Full Size[0x528] - InheritedSize[0x510]
class AIDockableObject: public ControllableObject
{
public:
	char                                                         pad0x8_TWIS9[0x8];                                 // 0x510(0x8)
	class                                                        InteractableType;                                  // 0x518(0x8)
	float                                                        InteractableOffset;                                // 0x520(0x4)
	char                                                         pad0x4_9TEE4[0x4];                                 // 0x524(0x4)
};


// Size 0x0 (Full Size[0x528] - InheritedSize[0x528]
class AIDockableWheel: public AIDockableObject
{
public:
};


// Size 0x10 (Full Size[0x5a8] - InheritedSize[0x598]
class AIEmergentCaptainSpawner: public AIPerCrewSpawner
{
public:
	char                                                         pad0x8_IA56Y[0x8];                                 // 0x598(0x8)
	Class NamedAIDataAsset*                                      NamedAIDataAsset;                                  // 0x5a0(0x8)
};


// Size 0x18 (Full Size[0x160] - InheritedSize[0x148]
class AIFormWithVFXComponent: public AthenaAIFormComponent
{
public:
	Class ParticleSystem*                                        ParticlesTemplate;                                 // 0x148(0x8)
	Class ParticleSystemComponent*                               ParticleSystemComponent;                           // 0x150(0x8)
	float                                                        ParticleActivationDelay;                           // 0x158(0x4)
	Struct TimerHandle                                           ActivationTimerHandle;                             // 0x15c(0x4)
};


// Size 0x10 (Full Size[0xa0] - InheritedSize[0x90]
class AIFormWithVFXDataAsset: public AthenaAIFormDataAsset
{
public:
	Class ParticleSystem*                                        ParticlesTemplate;                                 // 0x90(0x8)
	float                                                        ParticleActivationDelay;                           // 0x98(0x4)
	char                                                         pad0x4_9FPSK[0x4];                                 // 0x9c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIKnockbackActionStateId: public ActionStateId
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class LoadoutAsset: public DataAsset
{
public:
	Struct ItemLoadout                                           ItemLoadout;                                       // 0x28(0x20)
	struct FName                                                 FeatureName;                                       // 0x48(0x8)
};


// Size 0x10 (Full Size[0x60] - InheritedSize[0x50]
class AILoadoutWithNonStoreableAsset: public LoadoutAsset
{
public:
	char                                                         pad0x8_HRN85[0x8];                                 // 0x50(0x8)
	class                                                        NonStoreableItem;                                  // 0x58(0x8)
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class AimSensitivityComponent: public ActorComponent
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AimWeaponPressedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AimWeaponReleasedNotificationInputId: public AimWeaponPressedNotificationInputId
{
public:
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class AIOnShipManagerComponent: public ActorComponent
{
public:
	char                                                         pad0x8_JQAVZ[0x8];                                 // 0xc8(0x8)
	Class AIProximityPlayerTracker*                              AIProximityPlayerTracker;                          // 0xd0(0x8)
	TArray<class AIFixedWavesSpawner*>                           AIOnShipAIFixedWavesSpawners;                      // 0xd8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ProjectileWeaponFiringIntentionInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0x100] - InheritedSize[0xc8]
class AIProjectileWeaponFiringIntentionComponent: public ActorComponent
{
public:
	char                                                         pad0x8_7RSYD[0x8];                                 // 0xc8(0x8)
	Class Pawn*                                                  PawnOwner;                                         // 0xd0(0x8)
	Class AthenaAIControllerBase*                                AIController;                                      // 0xd8(0x8)
	char                                                         pad0x1c_HOYP0[0x1c];                               // 0xe0(0x1c)
	float                                                        DefaultHitChance;                                  // 0xfc(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIQuickDeathInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIShipCaptainActionStateId: public ActionStateId
{
public:
};


// Size 0x160 (Full Size[0x440] - InheritedSize[0x2e0]
class ItemSpawnComponent: public SceneComponent
{
public:
	bool                                                         SpawnOnStart;                                      // 0x2e0(0x1)
	char                                                         pad0x7_WH6SN[0x7];                                 // 0x2e1(0x7)
	Struct ItemSpawnParams                                       SpawnParams;                                       // 0x2e8(0x28)
	Class WeightedItemDescSpawnDataAsset*                        ReferencedSpawnDistributionAsset;                  // 0x310(0x8)
	TArray<struct SpawnTransforms>                               SpawnTransforms;                                   // 0x318(0x10)
	TArray<struct SpawnTransformsWithRandomQuantities>           SpawnTransformsWithRandomQuantities;               // 0x328(0x10)
	struct FName                                                 FeatureToggle;                                     // 0x338(0x8)
	byte                                                         SpawnSource;                                       // 0x340(0x1)
	char                                                         pad0x3_LN7X8[0x3];                                 // 0x341(0x3)
	float                                                        SpawnRate;                                         // 0x344(0x4)
	bool                                                         DestroyProxiesOnEndPlay;                           // 0x348(0x1)
	bool                                                         SpawnWithPhysicsEnabled;                           // 0x349(0x1)
	bool                                                         DoNotAttachToOwnerWhenSpawned;                     // 0x34a(0x1)
	bool                                                         DropItemsOnSpawn;                                  // 0x34b(0x1)
	bool                                                         DropItemsUsingPriorityAIDropParams;                // 0x34c(0x1)
	char                                                         pad0x3_YYIK0[0x3];                                 // 0x34d(0x3)
	TArray<struct SpawnList>                                     SpawnList;                                         // 0x350(0x10)
	TArray<struct SingleItemInstances>                           SingleItemInstances;                               // 0x360(0x10)
	TArray<struct SpawnedItems>                                  SpawnedItems;                                      // 0x370(0x10)
	char                                                         pad0xc0_9HA61[0xc0];                               // 0x380(0xc0)
};


// Size 0x60 (Full Size[0x4a0] - InheritedSize[0x440]
class AIShipItemSpawnComponent: public ItemSpawnComponent
{
public:
	bool                                                         SpawnAlways;                                       // 0x440(0x1)
	bool                                                         SpawnForBattleFinalShip;                           // 0x441(0x1)
	bool                                                         SpawnForPassiveShip;                               // 0x442(0x1)
	bool                                                         SpawnForAggressiveShip;                            // 0x443(0x1)
	char                                                         pad0x5c_Z6CIJ[0x5c];                               // 0x444(0x5c)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EmotesInterface: public Interface
{
public:
};


// Size 0xb8 (Full Size[0x180] - InheritedSize[0xc8]
class LookAtOffsetComponent: public ActorComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterMeshInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterInterface: public CharacterMeshInterface
{
public:
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class FireSettingsDataAsset: public DataAsset
{
public:
	float                                                        CharacterOnFireEffectRadius;                       // 0x28(0x4)
	byte                                                         TraceChannel;                                      // 0x2c(0x1)
	char                                                         pad0x3_N7TUX[0x3];                                 // 0x2d(0x3)
	float                                                        CharacterToCharacterPropagationInterval;           // 0x30(0x4)
	float                                                        MaxInitialPropagationOffset;                       // 0x34(0x4)
	Struct Status                                                BurnStatus;                                        // 0x38(0x18)
	Struct Status                                                FirePropagationStatus;                             // 0x50(0x18)
	char                                                         pad0x8_H92QR[0x8];                                 // 0x68(0x8)
};


// Size 0x160 (Full Size[0x270] - InheritedSize[0x110]
class CharacterFlammableComponent: public ActorFlammableComponent
{
public:
	char                                                         pad0x30_OIZ0L[0x30];                               // 0x110(0x30)
	float                                                        FireFalloffDuration;                               // 0x140(0x4)
	float                                                        FireRateOfFalloffInRain;                           // 0x144(0x4)
	float                                                        FireFalloffMultiplier;                             // 0x148(0x4)
	struct FName                                                 VfxSocketName;                                     // 0x14c(0x8)
	char                                                         pad0xc_7O1QY[0xc];                                 // 0x154(0xc)
	Struct Transform                                             SocketRelativeOffset;                              // 0x160(0x30)
	char                                                         pad0x88_3FMAC[0x88];                               // 0x190(0x88)
	Class World*                                                 CachedWorld;                                       // 0x218(0x8)
	char                                                         pad0x8_LKW3I[0x8];                                 // 0x220(0x8)
	Class FireSettingsDataAsset*                                 FireSettingsAsset;                                 // 0x228(0x8)
	char                                                         pad0x40_I3UM2[0x40];                               // 0x230(0x40)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterFootImpactMeshInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ObscuredVisionInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayerPrivilegeInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PirateDescInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CloudDomeInterface: public Interface
{
public:
};


// Size 0x2e8 (Full Size[0x6b0] - InheritedSize[0x3c8]
class CloudDome: public Actor
{
public:
	char                                                         pad0xb8_R3IB1[0xb8];                               // 0x3c8(0xb8)
	Class LocalPlayer*                                           LocalPlayer;                                       // 0x480(0x8)
	char                                                         pad0x228_6E0F4[0x228];                             // 0x488(0x228)
};


// Size 0x620 (Full Size[0xc00] - InheritedSize[0x5e0]
class AthenaCharacter: public Character
{
public:
	char                                                         pad0x120_91IDO[0x120];                             // 0x5e0(0x120)
	Class LookAtOffsetComponent*                                 LookAtOffsetComponent;                             // 0x700(0x8)
	Class AnimationDataStoreAsset*                               AnimationDataStoreAsset;                           // 0x708(0x8)
	Class AthenaAnimationSittingDataAsset*                       SittingAnimationDataAssets;                        // 0x710(0x8)
	Class AthenaCharacterMovementComponent*                      AthenaCharacterMovementComponent;                  // 0x718(0x8)
	Struct Docker                                                Docker;                                            // 0x720(0x90)
	Class ActionStateMachineComponent*                           ActionStateMachineComponent;                       // 0x7b0(0x8)
	Class ActionStatePriorityTableData*                          ActionStatePriorityTableData;                      // 0x7b8(0x8)
	class                                                        ActionStateCreatorDefinition;                      // 0x7c0(0x8)
	Struct ObjectMessagingDispatcher                             ObjectMessageDispatcher;                           // 0x7c8(0xa0)
	Class WieldableItemSetComponent*                             WieldableItemSetComponent;                         // 0x868(0x8)
	Class WieldedItemComponent*                                  WieldedItemComponent;                              // 0x870(0x8)
	Class SceneComponent*                                        MeshAdjustmentComponent;                           // 0x878(0x8)
	Class InventoryManipulatorComponent*                         InventoryManipulatorComponent;                     // 0x880(0x8)
	Class LoadoutComponent*                                      LoadoutComponent;                                  // 0x888(0x8)
	Class ItemLoadoutComponent*                                  ItemLoadoutComponent;                              // 0x890(0x8)
	Class HealthComponent*                                       HealthComponent;                                   // 0x898(0x8)
	Class AthenaCharacterStateManagerComponent*                  StateManagerComponent;                             // 0x8a0(0x8)
	Class RewindComponent*                                       RewindComponent;                                   // 0x8a8(0x8)
	Class ActorDamageableComponent*                              ActorDamageableComponent;                          // 0x8b0(0x8)
	Class CharacterHitReactionComponent*                         CharacterHitReactionComponent;                     // 0x8b8(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitterComponent;                   // 0x8c0(0x8)
	Class MeleeAttackProcessorComponent*                         MeleeAttackProcessor;                              // 0x8c8(0x8)
	Class HitDetectionComponent*                                 HitDetectionComponent;                             // 0x8d0(0x8)
	Class AthenaCharacterKnockbackComponent*                     KnockBackComponent;                                // 0x8d8(0x8)
	Class AthenaCharacterDodgeComponent*                         DodgeComponent;                                    // 0x8e0(0x8)
	Class CharacterAINoiseEventComponent*                        CharacterAINoiseEventComponent;                    // 0x8e8(0x8)
	Class ActionRulesComponent*                                  PrivateActionRulesComponent;                       // 0x8f0(0x8)
	Class ShipTrackerComponent*                                  ShipTrackerComponent;                              // 0x8f8(0x8)
	Class WatercraftTrackerComponent*                            WatercraftTrackerComponent;                        // 0x900(0x8)
	Class ItemLoaderComponent*                                   ItemLoaderComponent;                               // 0x908(0x8)
	Class RetractableCharacterComponent*                         RetractableCharacterComponent;                     // 0x910(0x8)
	Class ResourceProviderComponent*                             ResourceProviderComponent;                         // 0x918(0x8)
	Class CharacterFlammableComponent*                           CharacterFlammableComponent;                       // 0x920(0x8)
	Class SoakableComponent*                                     SoakableComponent;                                 // 0x928(0x8)
	Class WaterExposureComponent*                                WaterExposureComponent;                            // 0x930(0x8)
	Class ShelteredComponent*                                    ShelteredComponent;                                // 0x938(0x8)
	Class BoxedRpcDispatcherComponent*                           BoxedRpcDispatcherComponent;                       // 0x940(0x8)
	Class CosmeticItemAnimationComponent*                        CosmeticItemAnimationComponent;                    // 0x948(0x8)
	Class InteractionPreventionComponent*                        InteractionPreventionComponent;                    // 0x950(0x8)
	Class MovementInterferenceComponent*                         InterferenceComponent;                             // 0x978(0x8)
	Class WaterInteractionComponent*                             WaterInteractionComponent;                         // 0x980(0x8)
	class                                                        ThirdPersonAnimSetDataId;                          // 0x988(0x8)
	bool                                                         OverrideEncroachesBlockingGeometry;                // 0x990(0x1)
	byte                                                         OverrideEncroachesBlockingGeometryChannel;         // 0x991(0x1)
	char                                                         pad0x2_9T498[0x2];                                 // 0x992(0x2)
	struct FName                                                 OverrideFloorSweepCollisionProfileName;            // 0x994(0x8)
	char                                                         pad0x20_QB99T[0x20];                               // 0x99c(0x20)
	float                                                        MovementThresholdToRecordRewindTransform;          // 0x9bc(0x4)
	char                                                         pad0xc_4FO6K[0xc];                                 // 0x9c0(0xc)
	int                                                          SpawnAnimIndex;                                    // 0x9cc(0x4)
	char                                                         pad0x70_FWJYQ[0x70];                               // 0x9d0(0x70)
	Class AnimationDataStore*                                    AnimationDataStore;                                // 0xa40(0x8)
	char                                                         pad0x40_6EEOY[0x40];                               // 0xa48(0x40)
	Class PlayerState*                                           OldPlayerState;                                    // 0xa88(0x8)
	char                                                         pad0x3c_U0BUF[0x3c];                               // 0xa90(0x3c)
	float                                                        RelativeTargetYawOnMovingBase;                     // 0xacc(0x4)
	char                                                         pad0x30_HJVEN[0x30];                               // 0xad0(0x30)
	float                                                        SmoothYawOnMovingBaseTime;                         // 0xb00(0x4)
	int                                                          RandomAnimationSeed;                               // 0xb04(0x4)
	char                                                         pad0x8_27I7V[0x8];                                 // 0xb08(0x8)
	bool                                                         RandomBool;                                        // 0xb10(0x1)
	char                                                         pad0x27_LXODL[0x27];                               // 0xb11(0x27)
	Class SkeletalMeshSocket*                                    CameraSocket;                                      // 0xb38(0x8)
	char                                                         pad0x48_DAVYO[0x48];                               // 0xb40(0x48)
	TArray<class InputComponent*>                                RegisteredInputComponents;                         // 0xb88(0x10)
	char                                                         pad0x68_BKG82[0x68];                               // 0xb98(0x68)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BriggableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SwimAttackableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayerManagerServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CloudDomeServiceInterface: public Interface
{
public:
};


// Size 0x1320 (Full Size[0x1f20] - InheritedSize[0xc00]
class AthenaPlayerCharacter: public AthenaCharacter
{
public:
	char                                                         pad0x150_SFXIK[0x150];                             // 0xc00(0x150)
	Class SceneComponent*                                        FirstPersonMeshOffsetComponent;                    // 0xd50(0x8)
	Class SkeletalMeshComponent*                                 FirstPersonMesh;                                   // 0xd58(0x8)
	Class AthenaCameraComponent*                                 FirstPersonCamera;                                 // 0xd60(0x8)
	TArray<class ParticleSystemComponent*>                       FirstPersonParticleComponents;                     // 0xd68(0x10)
	Class AthenaCameraComponent*                                 ThirdPersonCamera;                                 // 0xd78(0x8)
	TArray<class ParticleSystemComponent*>                       ThirdPersonParticleComponents;                     // 0xd80(0x10)
	Class AthenaCameraComponent*                                 SpringArmCamera;                                   // 0xd90(0x8)
	Class LookAtEmoteCameraComponent*                            LookAtEmoteCameraComponent;                        // 0xd98(0x8)
	Class AthenaSpringArmComponent*                              SpringArm;                                         // 0xda0(0x8)
	Class ChildActorComponent*                                   LocalCloudDome;                                    // 0xda8(0x8)
	Class CharacterInteractionComponent*                         InteractionComponent;                              // 0xdb0(0x8)
	Class ClimbingComponent*                                     ClimbingComponent;                                 // 0xdb8(0x8)
	Class DrunkennessComponent*                                  DrunkennessComponent;                              // 0xdc0(0x8)
	Class StaggerComponent*                                      StaggerComponent;                                  // 0xdc8(0x8)
	Class DrowningComponent*                                     DrowningComponent;                                 // 0xdd0(0x8)
	Class RumbleHandlerComponent*                                RumbleHandlerComponent;                            // 0xdd8(0x8)
	Class ScreenSpaceVfxComponent*                               ScreenSpaceVfxComponent;                           // 0xde0(0x8)
	Class TreasureMapCollectionComponent*                        TreasureMapCollectionComponent;                    // 0xde8(0x8)
	Class PhrasesRadialComponent*                                PhrasesRadialComponent;                            // 0xdf0(0x8)
	Class QuickInventoryComponent*                               QuickInventoryComponent;                           // 0xdf8(0x8)
	Class PointOfInterestTrackerComponent*                       PointOfInterestTrackerComponent;                   // 0xe00(0x8)
	Class LimpingComponent*                                      LimpingComponent;                                  // 0xe08(0x8)
	Class PacingComponent*                                       PacingComponent;                                   // 0xe10(0x8)
	Class BurpComponent*                                         BurpComponent;                                     // 0xe18(0x8)
	Class MeleeAttackLockOnComponent*                            MeleeLockOnComponent;                              // 0xe20(0x8)
	Class DeathSelfInteractionComponent*                         DeathSelfInteractionComponent;                     // 0xe28(0x8)
	Class RidePlayerComponent*                                   RidePlayerComponent;                               // 0xe30(0x8)
	Class ReviveDebugComponent*                                  ReviveDebugComponent;                              // 0xe38(0x8)
	Class FlashbangEffectComponent*                              FlashbangEffectComponent;                          // 0xe40(0x8)
	Class WorldLocationVisitorComponent*                         WorldLocationVisitorComponent;                     // 0xe48(0x8)
	Class MeleeAttackLockOnComponentSettings*                    MeleeAttackLockOnSettings;                         // 0xe50(0x8)
	Class StatusEffectManagerComponent*                          StatusEffectManagerComponent;                      // 0xe58(0x8)
	Class StatusEffectPersistenceComponent*                      StatusEffectPersistenceComponent;                  // 0xe60(0x8)
	Class PlayerCurseComponent*                                  PlayerCurseComponent;                              // 0xe68(0x8)
	Class MaterialStatusSusceptibilityComponent*                 MaterialStatusSusceptibilityComponent;             // 0xe70(0x8)
	Class HealthRegenerationPoolComponent*                       HealthRegenerationPoolComponent;                   // 0xe78(0x8)
	Class SicknessComponent*                                     SicknessComponent;                                 // 0xe80(0x8)
	Class RewindComponent*                                       PlayerViewRewindComponent;                         // 0xe88(0x8)
	Class CapsuleComponent*                                      ProjectileTraceHitVolume;                          // 0xe90(0x8)
	Class PlayerMerchantContractsComponent*                      PlayerMerchantContractsComponent;                  // 0xe98(0x8)
	Class PlayerShroudBreakerTrackerComponent*                   PlayerShroudBreakerTrackerComponent;               // 0xea0(0x8)
	Class PetOwnerComponent*                                     PetOwnerComponent;                                 // 0xea8(0x8)
	Class AISpawnContextContainerComponent*                      SpawnContextContainerComponent;                    // 0xeb0(0x8)
	Class RadialManagerComponent*                                RadialManager;                                     // 0xeb8(0x8)
	Class StreamingLocationComponent*                            StreamingLocationComponent;                        // 0xec0(0x8)
	Class EquipClothingComponent*                                EquipClothingComponent;                            // 0xec8(0x8)
	float                                                        CameraFOVWhenSprinting;                            // 0xed0(0x4)
	char                                                         pad0x4_NHV44[0x4];                                 // 0xed4(0x4)
	Class CurveVector*                                           ApproximateCamPitchToLocalCamOffsetCurve;          // 0xed8(0x8)
	Struct WalkConditionsParams                                  WalkConditionParams;                               // 0xee0(0x8)
	Struct SprintConditionsParams                                ServerSprintConditionParams;                       // 0xee8(0xc)
	Struct SprintConditionsParams                                ClientSprintConditionParams;                       // 0xef4(0xc)
	float                                                        SprintingServerTimeTolerance;                      // 0xf00(0x4)
	float                                                        PostSprintResetTime;                               // 0xf04(0x4)
	Class AthenaSpringArmComponentParams*                        EmoteSpringArmParameters;                          // 0xf08(0x8)
	Class AthenaSpringArmComponentParams*                        DeathSpringArmParameters;                          // 0xf10(0x8)
	Class EmotesRadialDataAsset*                                 EmotesRadialDataAsset;                             // 0xf18(0x8)
	bool                                                         AllowAnimationTickAggregation;                     // 0xf20(0x1)
	char                                                         pad0x3_VJRMH[0x3];                                 // 0xf21(0x3)
	Struct AchievementKillOpponentFromBehindWithBlunderbuss      AchievementKillOpponentFromBehindWithBlunderbuss;  // 0xf24(0x4)
	Struct AchievementHeavyAttackRivalOffTheirShip               AchievementHeavyAttackRivalOffTheirShip;           // 0xf28(0x10)
	Struct AchievementBlockThenHitAndGetBlockedThenTakeHit       AchievementBlockThenHitAndGetBlockedThenTakeHit;   // 0xf38(0x10)
	Struct AchievementHaveADrinkWithAnotherCrewAtAnOutpost       AchievementHaveADrinkWithAnotherCrewAtAnOutpost;   // 0xf48(0x20)
	Struct AchievementKillOpponentInContest                      AchievementKillOpponentInContest;                  // 0xf68(0x8)
	class                                                        ConditionalStatsTriggerForKillingAnotherPlayer;    // 0xf70(0x8)
	Class AICreatureMovementModifierParamsDataAsset*             PirateLegendHideoutPetMovementData;                // 0xf78(0x8)
	Class AICreatureMovementModifierParamsDataAsset*             OnShipPetMovementData;                             // 0xf80(0x8)
	Class AsyncLoadoutRepairComponent*                           RepairComponent;                                   // 0xf88(0x8)
	Class SeasonProgressionUIComponent*                          SeasonUIComponent;                                 // 0xf90(0x8)
	Class AimAssistComponent*                                    AimAssistComponent;                                // 0xf98(0x8)
	Class AimAssistTargetComponent*                              AimAssistTargetComponent;                          // 0xfa0(0x8)
	Class SequencerCameraDockingComponent*                       SequencerCameraDockingComponent;                   // 0xfa8(0x8)
	Class EmotePropData*                                         EmotePropData;                                     // 0xfb0(0x8)
	char                                                         pad0xb0_QZLZU[0xb0];                               // 0xfb8(0xb0)
	class                                                        FirstPersonAnimSetDataId;                          // 0x1068(0x8)
	Class AnimationDataStoreWeakReferenceAsset*                  FirstPersonAnimationDataStoreWeakReferencesAsset;  // 0x1070(0x8)
	byte                                                         CharacterType;                                     // 0x1078(0x1)
	char                                                         pad0x20_QBPQN[0x20];                               // 0x1079(0x20)
	bool                                                         IsWearingSkeletonCurseCached;                      // 0x1099(0x1)
	bool                                                         IsWearingGhostCurseCached;                         // 0x109a(0x1)
	char                                                         pad0xc2d_CHIS3[0xc2d];                             // 0x109b(0xc2d)
	Class ClothingLoadoutComponent*                              ClothingLoadoutComponent;                          // 0x1cc8(0x8)
	Class PetLoadoutComponent*                                   PetLoadoutComponent;                               // 0x1cd0(0x8)
	Class VoyageParticipantComponent*                            PrimaryVoyageParticipantComponent;                 // 0x1cd8(0x8)
	Class VoyageParticipantComponent*                            TaleVoyageParticipantComponent;                    // 0x1ce0(0x8)
	Class VoyageParticipantComponent*                            EmergentVoyageParticipantComponent;                // 0x1ce8(0x8)
	Class PlayerWorldLocationComponent*                          PlayerWorldLocationComponent;                      // 0x1cf0(0x8)
	Class ChainLightningReceiverComponent*                       ChainLightningReceiverComponent;                   // 0x1cf8(0x8)
	Class PlayerGuildComponent*                                  PlayerGuildComponent;                              // 0x1d00(0x8)
	Class GuildSignUpComponent*                                  GuildSignUpComponent;                              // 0x1d08(0x8)
	Class ActionRulesInteractableComponent*                      EmoteInteractableComponent;                        // 0x1d10(0x8)
	Struct AthenaPlayerCharacterModelSwap                        PendingModelSwap;                                  // 0x1d18(0x68)
	char                                                         pad0x20_9XVGU[0x20];                               // 0x1d80(0x20)
	struct FName                                                 ReplicatedOverrideAnimationEntry;                  // 0x1da0(0x8)
	char                                                         pad0x9_BL7PI[0x9];                                 // 0x1da8(0x9)
	bool                                                         ReplicatedEmoteExitAllowed;                        // 0x1db1(0x1)
	char                                                         pad0x7e_2RSV4[0x7e];                               // 0x1db2(0x7e)
	bool                                                         FinishedWaitingForSpawn;                           // 0x1e30(0x1)
	char                                                         pad0x31_X5IYS[0x31];                               // 0x1e31(0x31)
	bool                                                         AutoFloatInWater;                                  // 0x1e62(0x1)
	char                                                         pad0x1_K9EE1[0x1];                                 // 0x1e63(0x1)
	bool                                                         ReplicatedIsSprinting;                             // 0x1e64(0x1)
	char                                                         pad0x1b_5O3IV[0x1b];                               // 0x1e65(0x1b)
	float                                                        AutoMoveCancelThreshold;                           // 0x1e80(0x4)
	int                                                          ReplicatedOverridePirateDescSeed;                  // 0x1e84(0x4)
	bool                                                         PreventJumping;                                    // 0x1e88(0x1)
	bool                                                         StopMovementAndPreventSwimming;                    // 0x1e89(0x1)
	char                                                         pad0x96_B4C6U[0x96];                               // 0x1e8a(0x96)
};


// Size 0xe8 (Full Size[0x130] - InheritedSize[0x48]
class AIShipPlayerTracker: public AISpawnerPlayerTracker
{
public:
};


// Size 0x30 (Full Size[0x78] - InheritedSize[0x48]
class AIShipRegionPlayerTracker: public AISpawnerPlayerTracker
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIShipWheelAIInteractableType: public AIInteractableType
{
public:
};


// Size 0x20 (Full Size[0x590] - InheritedSize[0x570]
class AISignalTargetWaveSpawner: public AIWaveSpawner
{
public:
	TArray<struct SignalMechanismAssetRefs>                      SignalMechanismAssetRefs;                          // 0x570(0x10)
	char                                                         pad0x10_H8FDJ[0x10];                               // 0x580(0x10)
};


// Size 0x30 (Full Size[0x90] - InheritedSize[0x60]
class AISpawnContextTaleQuestService: public TaleQuestService
{
public:
	Class AISpawnContextTaleQuestServiceDesc*                    Desc;                                              // 0x60(0x8)
	char                                                         pad0x28_AVU6C[0x28];                               // 0x68(0x28)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class AISpawnContextTaleQuestServiceDesc: public TaleQuestServiceDesc
{
public:
	struct FName                                                 AISpawnContextName;                                // 0x28(0x8)
	bool                                                         SpecificToIsland;                                  // 0x30(0x1)
	char                                                         pad0x7_TRIFL[0x7];                                 // 0x31(0x7)
	Struct QuestVariableAsset                                    ActorLocatedOnIsland;                              // 0x38(0x30)
};


// Size 0x20 (Full Size[0x2b8] - InheritedSize[0x298]
class AIWieldableUseInputComponent: public AthenaCharacterBaseInputComponent
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class AlcoholStatus: public StatusBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AllianceBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0xe0 (Full Size[0x4a8] - InheritedSize[0x3c8]
class AllianceService: public Actor
{
public:
	char                                                         pad0x8_4A8JT[0x8];                                 // 0x3c8(0x8)
	Class AllianceSettingsAsset*                                 Settings;                                          // 0x3d0(0x8)
	TArray<struct Alliances>                                     Alliances;                                         // 0x3d8(0x10)
	Class AllianceServiceTelemetryComponent*                     TelemetryComponent;                                // 0x3e8(0x8)
	TArray<struct CrewAllianceJoinStatuses>                      CrewAllianceJoinStatuses;                          // 0x3f0(0x10)
	char                                                         pad0x28_ZLH0U[0x28];                               // 0x400(0x28)
	char                                                         pad0x80_KUNY9[0x80];                               // 0x428(0x80)
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class AllianceServiceTelemetryComponent: public ActorComponent
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AllianceSettingsAsset: public DataAsset
{
public:
	float                                                        MaximumAllianceDistance;                           // 0x28(0x4)
	float                                                        PollDelay;                                         // 0x2c(0x4)
	class                                                        OfferFlag;                                         // 0x30(0x8)
	class                                                        AcceptFlag;                                        // 0x38(0x8)
	class                                                        LeaveFlag;                                         // 0x40(0x8)
	Class AlliancePennantAsset*                                  AlliancePennantAsset;                              // 0x48(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class AlwaysRelevantLightweightActor: public Actor
{
public:
	Class Actor*                                                 OwningActor;                                       // 0x3c8(0x8)
};


// Size 0x30 (Full Size[0x310] - InheritedSize[0x2e0]
class NameplateComponent: public SceneComponent
{
public:
	float                                                        FadeTime;                                          // 0x2e0(0x4)
	char                                                         pad0x4_2SP04[0x4];                                 // 0x2e4(0x4)
	Class SkeletalMeshSocket*                                    NameplateSocket;                                   // 0x2e8(0x8)
	char                                                         pad0x20_M90JZ[0x20];                               // 0x2f0(0x20)
};


// Size 0xa0 (Full Size[0x3b0] - InheritedSize[0x310]
class PlayerNameplateComponent: public NameplateComponent
{
public:
	char                                                         pad0x8_X5XTH[0x8];                                 // 0x310(0x8)
	float                                                        VisibleFromWorldDistance;                          // 0x318(0x4)
	float                                                        VisibleUntilWorldDistanceCrew;                     // 0x31c(0x4)
	float                                                        VisibleUntilWorldDistanceNonCrew;                  // 0x320(0x4)
	float                                                        EmoteForcedRevealTime;                             // 0x324(0x4)
	char                                                         pad0x8_WMH0S[0x8];                                 // 0x328(0x8)
	Class AthenaPlayerCharacter*                                 PlayerCharacter;                                   // 0x330(0x8)
	char                                                         pad0x78_KZVO7[0x78];                               // 0x338(0x78)
};


// Size 0x20 (Full Size[0x3d0] - InheritedSize[0x3b0]
class AlwaysRelevantPlayerNameplateComponent: public PlayerNameplateComponent
{
public:
	Class AthenaPlayerState*                                     PlayerStatePtr;                                    // 0x3a8(0x8)
	char                                                         pad0x20_Z8D94[0x20];                               // 0x3b0(0x20)
};


// Size 0x70 (Full Size[0x440] - InheritedSize[0x3d0]
class AlwaysRelevantLightweightPlayerNameplate: public AlwaysRelevantLightweightActor
{
public:
	char                                                         pad0x20_36JTO[0x20];                               // 0x3d0(0x20)
	Class AlwaysRelevantPlayerNameplateComponent*                PlayerNameplateComponent;                          // 0x3f0(0x8)
	Struct Guid                                                  OwnedActorsCrewId;                                 // 0x3f8(0x10)
	char                                                         pad0x28_Y9I6K[0x28];                               // 0x408(0x28)
	Class AthenaPlayerState*                                     PlayerStatePtr;                                    // 0x430(0x8)
	bool                                                         IsOwnerInert;                                      // 0x438(0x1)
	char                                                         pad0x7_LFPRB[0x7];                                 // 0x439(0x7)
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class Anchor: public Actor
{
public:
	char                                                         pad0x8_G6SH3[0x8];                                 // 0x3c8(0x8)
	Struct Vector                                                PositionForAnchorDynamicsRelativeToAnchorActor;    // 0x3d0(0xc)
	char                                                         pad0x4_HWCQJ[0x4];                                 // 0x3dc(0x4)
	Class BaseAnchorDynamicsDesc*                                AnchorDynamicsDesc;                                // 0x3e0(0x8)
	char                                                         pad0x18_PUDOB[0x18];                               // 0x3e8(0x18)
};


// Size 0x28 (Full Size[0x170] - InheritedSize[0x148]
class AncientAIFormComponent: public AthenaAIFormComponent
{
public:
};


// Size 0x10 (Full Size[0xa0] - InheritedSize[0x90]
class AncientAIFormDataAsset: public AthenaAIFormDataAsset
{
public:
	class                                                        AwardableComponentType;                            // 0x90(0x8)
	float                                                        TimeBeforeDespawn;                                 // 0x98(0x4)
	char                                                         pad0x4_BVK87[0x4];                                 // 0x9c(0x4)
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class NPCHeldObjectData: public DataAsset
{
public:
	struct FName                                                 LeftHandWieldSocket;                               // 0x28(0x8)
	struct FName                                                 RightHandWieldSocket;                              // 0x30(0x8)
	struct FName                                                 DetachSocketA;                                     // 0x38(0x8)
	struct FName                                                 DetachSocketB;                                     // 0x40(0x8)
	class                                                        Object1;                                           // 0x48(0x8)
	class                                                        Object2;                                           // 0x50(0x8)
	class                                                        Object3;                                           // 0x58(0x8)
	class                                                        Object4;                                           // 0x60(0x8)
	class                                                        Object5;                                           // 0x68(0x8)
	class                                                        Object6;                                           // 0x70(0x8)
	class                                                        Object7;                                           // 0x78(0x8)
	class                                                        Object8;                                           // 0x80(0x8)
	class                                                        Object9;                                           // 0x88(0x8)
	class                                                        Object10;                                          // 0x90(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AnimatedCosmeticItemInterface: public Interface
{
public:
};


// Size 0x70 (Full Size[0x4b0] - InheritedSize[0x440]
class AnimatedCosmeticItemAnimationInstance: public AnimInstance
{
public:
	char                                                         pad0x8_7Y09B[0x8];                                 // 0x440(0x8)
	TArray<struct OneShotSequences>                              OneShotSequences;                                  // 0x448(0x10)
	TArray<struct ContinuousSequences>                           ContinuousSequences;                               // 0x458(0x10)
	Class AnimInstance*                                          ParentCharacterAnimationInstance;                  // 0x468(0x8)
	Class AnimMontage*                                           CurrentPlayingMontage;                             // 0x470(0x8)
	Class AnimSequenceBase*                                      OneShot;                                           // 0x478(0x8)
	Class AnimSequenceBase*                                      ContinuousIn;                                      // 0x480(0x8)
	Class AnimSequenceBase*                                      ContinuousLoopA;                                   // 0x488(0x8)
	Class AnimSequenceBase*                                      ContinuousLoopB;                                   // 0x490(0x8)
	Class AnimSequenceBase*                                      ContinuousOut;                                     // 0x498(0x8)
	char                                                         pad0x10_WVO96[0x10];                               // 0x4a0(0x10)
};


// Size 0x28 (Full Size[0xf0] - InheritedSize[0xc8]
class AnimatedStepsComponent: public ActorComponent
{
public:
	Class PoseableSkeletalMeshComponent*                         Mesh;                                              // 0xc8(0x8)
	TArray<class BoxComponent*>                                  Boxes;                                             // 0xd0(0x10)
	TArray<struct BoxOrigins>                                    BoxOrigins;                                        // 0xe0(0x10)
};


// Size 0x38 (Full Size[0x100] - InheritedSize[0xc8]
class AnimationDataOverriderComponent: public ActorComponent
{
public:
	char                                                         pad0x8_MFDM3[0x8];                                 // 0xc8(0x8)
	Struct StringAssetReference                                  AnimationDataStoreAssetReference;                  // 0xd0(0x10)
	Class AnimationDataStoreAsset*                               AnimationDataStoreAsset;                           // 0xe0(0x8)
	char                                                         pad0x18_EJGZW[0x18];                               // 0xe8(0x18)
};


// Size 0x50 (Full Size[0x88] - InheritedSize[0x38]
class AnimNotify_AthenaPlayParticleEffect: public AnimNotify
{
public:
	Class Object*                                                PSTemplate;                                        // 0x38(0x8)
	struct FName                                                 SocketName;                                        // 0x40(0x8)
	Struct Vector                                                LocationOffset;                                    // 0x48(0xc)
	Struct Rotator                                               RotationOffset;                                    // 0x54(0xc)
	Struct Vector                                                RelativeScale;                                     // 0x60(0xc)
	Struct LinearColor                                           ColorTint;                                         // 0x6c(0x10)
	float                                                        CustomParameter;                                   // 0x7c(0x4)
	bool                                                         Attached;                                          // 0x80(0x1)
	bool                                                         KeepWorldScale;                                    // 0x80(0x1)
	bool                                                         OwnerOnlySee;                                      // 0x80(0x1)
	bool                                                         OwnerNoSee;                                        // 0x80(0x1)
	bool                                                         OwnedByWorld;                                      // 0x80(0x1)
	char                                                         pad0x3_84AKJ[0x3];                                 // 0x81(0x3)
	byte                                                         UnderwaterMode;                                    // 0x84(0x1)
	byte                                                         CustomLocalSpaceMode;                              // 0x85(0x1)
	char                                                         pad0x2_DLJBB[0x2];                                 // 0x86(0x2)
};


// Size 0x8 (Full Size[0x90] - InheritedSize[0x88]
class AnimNotify_AthenaPlayParticleEffectWithOwnerCustomisation: public AnimNotify_AthenaPlayParticleEffect
{
public:
	class                                                        VfxCustomisationType;                              // 0x88(0x8)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class AnimNotify_CutSceneSubtitle: public AnimNotify
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AnimNotify_DockableCutscene: public AnimNotify
{
public:
};


// Size 0x18 (Full Size[0x50] - InheritedSize[0x38]
class AnimNotify_RumbleController: public AnimNotify
{
public:
	Class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x38(0x8)
	struct FName                                                 ForceFeedbackTag;                                  // 0x40(0x8)
	Class ForceFeedbackCondition*                                ForceFeedbackCondition;                            // 0x48(0x8)
};


// Size 0x10 (Full Size[0x320] - InheritedSize[0x310]
class AnimNotifyAdditionalEventsWwiseEmitterComponent: public AnimNotifyWwiseEmitterComponent
{
public:
	TArray<struct AnimNotifyObservers>                           AnimNotifyObservers;                               // 0x310(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AnimNotifyQuestBookForcePageRedraw: public AnimNotify
{
public:
};


// Size 0x28 (Full Size[0x80] - InheritedSize[0x58]
class AnimNotifyState_AthenaTimedParticleEffect: public AnimNotifyState_TimedParticleEffect
{
public:
	Struct Vector                                                RelativeScale;                                     // 0x58(0xc)
	Struct LinearColor                                           ColorTint;                                         // 0x64(0x10)
	float                                                        CustomParameter;                                   // 0x74(0x4)
	bool                                                         Attached;                                          // 0x78(0x1)
	bool                                                         KeepWorldScale;                                    // 0x78(0x1)
	char                                                         pad0x3_03PTY[0x3];                                 // 0x79(0x3)
	byte                                                         UnderwaterMode;                                    // 0x7c(0x1)
	byte                                                         CustomLocalSpaceMode;                              // 0x7d(0x1)
	char                                                         pad0x2_HP4P5[0x2];                                 // 0x7e(0x2)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class AnimNotifyStateQuestBookRenderingModeRequest: public AnimNotifyState
{
public:
};


// Size 0x0 (Full Size[0x78] - InheritedSize[0x78]
class AnimNotifyStateQuestBookLeftSpreadCurrentRightSpreadNext: public AnimNotifyStateQuestBookRenderingModeRequest
{
public:
};


// Size 0x0 (Full Size[0x78] - InheritedSize[0x78]
class AnimNotifyStateQuestBookLeftSpreadPreviousRightSpreadCurrent: public AnimNotifyStateQuestBookRenderingModeRequest
{
public:
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class AnimNotifyTriggerPlaceableReaction: public AnimNotify
{
public:
	Struct StringAssetReference                                  PlaceableReactionToTrigger;                        // 0x38(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ApplicationSettings: public Object
{
public:
	int                                                          GameLanguage;                                      // 0x28(0x4)
	char                                                         pad0x4_BZKXD[0x4];                                 // 0x2c(0x4)
};


// Size 0x28 (Full Size[0x3f0] - InheritedSize[0x3c8]
class ArenaVendorShip: public Actor
{
public:
	Class SceneComponent*                                        ArenaVendorShipRootComponent;                      // 0x3c8(0x8)
	Class ContestMerchantSpawnerComponent*                       ContestMerchantSpawnerComponent;                   // 0x3d0(0x8)
	Class GenericWorldMapMarker*                                 VendorShipWorldMarkerComponent;                    // 0x3d8(0x8)
	Class SphereComponent*                                       VendorDeadZoneComponent;                           // 0x3e0(0x8)
	float                                                        VendorShipDeadZoneRadius;                          // 0x3e8(0x4)
	char                                                         pad0x4_RPQZO[0x4];                                 // 0x3ec(0x4)
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class ViewModelComponentBase: public ActorComponent
{
public:
};


// Size 0x48 (Full Size[0x170] - InheritedSize[0x128]
class PossessionsChestViewModel: public ViewModelComponentBase
{
public:
	Struct FText                                                 AllTabLabel;                                       // 0x128(0x38)
	Struct StringAssetReference                                  AllTabIcon;                                        // 0x160(0x10)
};


// Size 0x28 (Full Size[0x198] - InheritedSize[0x170]
class ArmoryChestViewModelComponent: public PossessionsChestViewModel
{
public:
	char                                                         pad0x10_IEZQ0[0x10];                               // 0x170(0x10)
	TArray<class Class*>                                         Categories;                                        // 0x180(0x10)
	bool                                                         IncludeAllCategory;                                // 0x190(0x1)
	char                                                         pad0x7_QFCCB[0x7];                                 // 0x191(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AshCloudAIAbilityType: public AthenaAIAbilityType
{
public:
};


// Size 0x0 (Full Size[0x40] - InheritedSize[0x40]
class AshCloudAbilityStageParams: public AthenaAIAbilityStageParams
{
public:
};


// Size 0x18 (Full Size[0x90] - InheritedSize[0x78]
class AshCloudAIAbility: public AthenaAIAbility
{
public:
	Class Pawn*                                                  Owner;                                             // 0x78(0x8)
	Class AshCloudAIAbilityParams*                               SetupAbilityParams;                                // 0x80(0x8)
	Class AshenLordAshCloud*                                     AshCloudInstance;                                  // 0x88(0x8)
};


// Size 0x8 (Full Size[0xd0] - InheritedSize[0xc8]
class AshCloudAIAbilityParams: public AthenaAIAbilityParams
{
public:
	class                                                        AshCloudClass;                                     // 0xc8(0x8)
};


// Size 0x68 (Full Size[0x1b0] - InheritedSize[0x148]
class AshenLordAIFormComponent: public AthenaAIFormComponent
{
public:
	Class WwiseEvent*                                            AshenLordVulnerabilityDamageAudioEvent;            // 0x148(0x8)
	struct FName                                                 AshenLordHeartBeatShaderParamName;                 // 0x150(0x8)
	class                                                        CameraShake;                                       // 0x178(0x8)
	float                                                        ShakeInnerRadius;                                  // 0x180(0x4)
	float                                                        ShakeOuterRadius;                                  // 0x184(0x4)
	Class MaterialInstanceDynamic*                               AshenLordDynamicMaterialInstance;                  // 0x188(0x8)
	float                                                        CachedNormalisedHealthScalar;                      // 0x190(0x4)
	bool                                                         IsInVulnerability;                                 // 0x194(0x1)
	char                                                         pad0x1b_YVAHU[0x1b];                               // 0x195(0x1b)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AssetListDataAsset: public DataAsset
{
public:
	TArray<struct AssetList>                                     AssetList;                                         // 0x28(0x10)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class AssignItemStep: public TaleQuestStep
{
public:
	Class AssignItemStepDesc*                                    StepDesc;                                          // 0x98(0x8)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class AssignItemStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableClass                                    TypeVar;                                           // 0x80(0x30)
	class                                                        TypeValue;                                         // 0xb0(0x8)
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class AssociateActorToCrewTaskStep: public TaleQuestStep
{
public:
	Class AssociateActorToCrewTaskStepDesc*                      Desc;                                              // 0x98(0x8)
	char                                                         pad0x30_K1003[0x30];                               // 0xa0(0x30)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class AssociateActorToCrewTaskStepDesc: public TaleQuestStepDesc
{
public:
	Class TaleQuestStepDesc*                                     TaskDesc;                                          // 0x80(0x8)
	Struct QuestVariableActor                                    ActorToAssociate;                                  // 0x88(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LoadoutRepairerInterface: public Interface
{
public:
};


// Size 0x58 (Full Size[0x120] - InheritedSize[0xc8]
class AsyncLoadoutRepairComponent: public ActorComponent
{
public:
};


// Size 0x130 (Full Size[0x230] - InheritedSize[0x100]
class AthenaAIInteractableComponent: public AIInteractableComponent
{
public:
	char                                                         pad0x8_1X2QV[0x8];                                 // 0x100(0x8)
	bool                                                         Moveable;                                          // 0x108(0x1)
	char                                                         pad0x3_Z6JBE[0x3];                                 // 0x109(0x3)
	Struct Vector                                                InteractableRelativeVectorToSpawnPos;              // 0x10c(0xc)
	Struct Vector                                                TriggerSphereCentreOffset;                         // 0x118(0xc)
	float                                                        TriggerSphereRadiusOffset;                         // 0x124(0x4)
	float                                                        TimeToCacheLastBestTargetResult;                   // 0x128(0x4)
	byte                                                         OwnerAITeam;                                       // 0x12c(0x1)
	char                                                         pad0x103_PGIJS[0x103];                             // 0x12d(0x103)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAITeamsServiceInterface: public Interface
{
public:
};


// Size 0x5b8 (Full Size[0x5e0] - InheritedSize[0x28]
class AthenaAITeamsService: public Object
{
public:
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class AthenaAnimationCustomSkeletonAnimationData: public DataAsset
{
public:
	Struct SkeletonCustomAnimationDataStructure                  SkeletonCustomAnimData;                            // 0x28(0x38)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterAnimationInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAnimationLocomotionComponentFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x2b20 (Full Size[0x3180] - InheritedSize[0x660]
class AthenaAnimationInstance: public CharacterAnimationInstance
{
public:
	char                                                         pad0x38_XH8RI[0x38];                               // 0x660(0x38)
	byte                                                         ControllableObjectType;                            // 0x698(0x1)
	char                                                         pad0x7_SWGOI[0x7];                                 // 0x699(0x7)
	TArray<struct AllLoadedItemData>                             AllLoadedItemData;                                 // 0x6a0(0x10)
	Struct AthenaAnimationHandHeldItemParams                     HandHeldItemParams;                                // 0x6b0(0x20)
	Struct AthenaAnimationIdleVariantChange                      IdleVariantParams;                                 // 0x6d0(0x10)
	Struct AthenaAnimationWheel                                  WheelAnimationParams;                              // 0x6e0(0x1f0)
	Struct AthenaAnimationCapstan                                CapstanAnimationParams;                            // 0x8d0(0x178)
	Struct AthenaAnimationFacialAnimData                         FacialParams;                                      // 0xa48(0x90)
	Struct AthenaAnimationFire                                   Fire;                                              // 0xad8(0x20)
	byte                                                         MeleeSpecialState;                                 // 0xaf8(0x1)
	char                                                         pad0x3_S63DB[0x3];                                 // 0xaf9(0x3)
	float                                                        DodgeDirection;                                    // 0xafc(0x4)
	Struct AthenaAnimationRowboatParams                          RowboatParams;                                     // 0xb00(0xc8)
	Struct AthenaAnimationRowing                                 Rowing;                                            // 0xbc8(0xe0)
	Struct AthenaAnimationWaterPumpAnimData                      WaterPumpAnimations;                               // 0xca8(0x28)
	Struct AthenaAnimationWaterPumpParams                        WaterPumpAnimationParams;                          // 0xcd0(0xc)
	Struct AthenaAnimationFishingParams                          FishingParams;                                     // 0xcdc(0x34)
	Struct AthenaAnimationFishing                                Fishing;                                           // 0xd10(0x3f0)
	Struct AthenaAnimationWaterSlideControlAnimData              WaterSlideControlAnimData;                         // 0x1100(0x20)
	Class AthenaCharacter*                                       AthenaCharacter;                                   // 0x1120(0x8)
	Struct AthenaAnimationJumping                                JumpingAnimationParams;                            // 0x1128(0xf0)
	float                                                        SpineBlendAlpha;                                   // 0x1218(0x4)
	float                                                        DockingTransitionAlpha;                            // 0x121c(0x4)
	Struct AthenaAnimationWaterPump                              AthenaAnimationWaterPump;                          // 0x1220(0x30)
	Struct AthenaAnimationLODSettings                            AnimationLODSettings;                              // 0x1250(0x3)
	char                                                         pad0x5_R3PEQ[0x5];                                 // 0x1253(0x5)
	Struct AthenaAnimationLocomotion                             Locomotion;                                        // 0x1258(0x68)
	Struct AthenaAnimationWieldedItemStateMachine                WieldedItemStateMachine;                           // 0x12c0(0x5f0)
	Struct AthenaAnimationLoadObjectByID                         ItemLoading;                                       // 0x18b0(0x930)
	class                                                        CurrentWieldedItemALK;                             // 0x21e0(0x8)
	Struct AthenaAnimationObjectActionContinuousStruct           ItemPrimaryContinousUseAnims;                      // 0x21e8(0xa8)
	Struct AthenaAnimationObjectActionContinuousStruct           ItemSecondaryContinousUseAnims;                    // 0x2290(0xa8)
	Struct AthenaAnimationObjectActionContinuousStruct           ItemPrimaryContinousUseAlternateAnims;             // 0x2338(0xa8)
	Struct AthenaAnimationObjectActionContinuousStruct           ItemSecondaryContinousUseAlternateAnims;           // 0x23e0(0xa8)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemPrimaryContinousUseSwimmingAnims;              // 0x2488(0x20)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemSecondaryContinousUseSwimmingAnims;            // 0x24a8(0x20)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemPrimaryContinousUseSwimmingAlternateAnims;     // 0x24c8(0x20)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemSecondaryContinousUseSwimmingAlternateAnims;   // 0x24e8(0x20)
	Struct AthenaAnimationObjectJumpingAnimations                ItemPrimaryContinousUseJumpingAnims;               // 0x2508(0x20)
	Struct AthenaAnimationObjectJumpingAnimations                ItemSecondaryContinousUseJumpingAnims;             // 0x2528(0x20)
	Struct AthenaAnimationObjectJumpingAnimations                ItemPrimaryContinousUseJumpingAlternateAnims;      // 0x2548(0x20)
	Struct AthenaAnimationObjectJumpingAnimations                ItemSecondaryContinousUseJumpingAlternateAnims;    // 0x2568(0x20)
	Struct AthenaAnimationActiveOneShotAnimationStruct           ActiveOneShotAnimations;                           // 0x2588(0x20)
	Struct AthenaAnimationActiveOneShotAnimationStruct           DuplicateActiveOneShotAnimations;                  // 0x25a8(0x20)
	Struct AthenaAnimationObjectActionOneShotPlayingStruct       ItemPrimaryOneShotAnims;                           // 0x25c8(0x28)
	Struct AthenaAnimationObjectActionOneShotPlayingStruct       ItemSecondaryOneShotAnims;                         // 0x25f0(0x28)
	Struct AthenaAnimationObjectActionOneShotPlayingStruct       ItemPrimaryOneShotAlternateAnims;                  // 0x2618(0x28)
	Struct AthenaAnimationObjectActionOneShotPlayingStruct       ItemSecondaryOneShotAlternateAnims;                // 0x2640(0x28)
	Struct AthenaAnimationActiveItemComplexAnimData              CurrentComplexOneShotData;                         // 0x2668(0x38)
	Struct AthenaAnimationObjectComplexOneShotPlaySpeeds         CurrentMeleeAttackSequencePlaySpeeds;              // 0x26a0(0x14)
	char                                                         pad0x4_PAZQT[0x4];                                 // 0x26b4(0x4)
	Struct AthenaAnimationObjectMeleeBlocking                    ItemCombatBlockingAnims;                           // 0x26b8(0x60)
	class                                                        FishingRodAnimStoreID;                             // 0x2718(0x8)
	class                                                        QuestBookAnimStoreID;                              // 0x2720(0x8)
	class                                                        WoodenPlankAnimStoreID;                            // 0x2728(0x8)
	float                                                        UnequipPlayRate;                                   // 0x2730(0x4)
	char                                                         pad0x4_K8NAY[0x4];                                 // 0x2734(0x4)
	Struct AthenaAnimationLoadOnDemandItemsAnimgraphStructure    LoadOnDemandItemParams;                            // 0x2738(0x760)
	byte                                                         ControllableSocketGroup;                           // 0x2e98(0x1)
	byte                                                         ControllableSocketGroupCharacterSize;              // 0x2e99(0x1)
	byte                                                         LocomotionState;                                   // 0x2e9a(0x1)
	Struct AthenaAnimationDebugTrackingParams                    DebugTrackingParams;                               // 0x2e9b(0x4)
	char                                                         pad0x1_USRRA[0x1];                                 // 0x2e9f(0x1)
	Struct AthenaAnimationDeath                                  Death;                                             // 0x2ea0(0x100)
	Struct AthenaAnimationUndoRepair                             UndoRepair;                                        // 0x2fa0(0x70)
	Struct AthenaAnimationSitting                                Sitting;                                           // 0x3010(0x70)
	byte                                                         PropWieldLocation;                                 // 0x3080(0x1)
	char                                                         pad0x3_PJGX1[0x3];                                 // 0x3081(0x3)
	Struct Vector                                                PropOffsetLocation;                                // 0x3084(0xc)
	Struct Rotator                                               PropOffsetRotation;                                // 0x3090(0xc)
	Struct Vector                                                PropOffsetScale;                                   // 0x309c(0xc)
	bool                                                         FaunaAddedToCrate;                                 // 0x30a8(0x1)
	bool                                                         InDockingTransition;                               // 0x30a8(0x1)
	bool                                                         WieldedItemIsMeleeWeapon;                          // 0x30a8(0x1)
	bool                                                         InMeleeCombat;                                     // 0x30a8(0x1)
	bool                                                         IsBlockingLeft;                                    // 0x30a8(0x1)
	bool                                                         IsFishingWithWieldedRod;                           // 0x30a8(0x1)
	bool                                                         UsePropOffset;                                     // 0x30a8(0x1)
	bool                                                         IsOnLadder;                                        // 0x30a8(0x1)
	bool                                                         IsUsingAdditiveHandOverlayPose;                    // 0x30a9(0x1)
	bool                                                         IgnoreIdleBlendTransition;                         // 0x30a9(0x1)
	bool                                                         UseDuplicateOneShotState;                          // 0x30a9(0x1)
	char                                                         pad0xd6_DK4RU[0xd6];                               // 0x30aa(0xd6)
};


// Size 0xd0 (Full Size[0x3250] - InheritedSize[0x3180]
class FirstPersonAnimationInstance: public AthenaAnimationInstance
{
public:
	char                                                         pad0x8_H8TD4[0x8];                                 // 0x3180(0x8)
	float                                                        SpineRotationTime;                                 // 0x3188(0x4)
	Struct Vector                                                RangedWeaponTargetingOffset;                       // 0x318c(0xc)
	float                                                        RangedWeaponAlpha;                                 // 0x3198(0x4)
	Struct AthenaAnimationCamera                                 CameraParams;                                      // 0x319c(0x18)
	char                                                         pad0x4_OPWLS[0x4];                                 // 0x31b4(0x4)
	Struct AthenaAnimationFirstPersonAnimatic                    FirstPersonAnimatic;                               // 0x31b8(0x80)
	byte                                                         CameraAdditiveBlendPoseType;                       // 0x3238(0x1)
	char                                                         pad0x3_YDMG3[0x3];                                 // 0x3239(0x3)
	float                                                        RowboatCameraAlpha;                                // 0x323c(0x4)
	bool                                                         UseAdditiveHandOverlay;                            // 0x3240(0x1)
	bool                                                         CameraAttachmentTypeNotDefault;                    // 0x3240(0x1)
	bool                                                         BlendUpperBodyAndArmOverlay;                       // 0x3240(0x1)
	bool                                                         UseArmOverlayJumpContinuous;                       // 0x3240(0x1)
	bool                                                         IsSwimming;                                        // 0x3240(0x1)
	bool                                                         IsControllableObjectActive;                        // 0x3240(0x1)
	bool                                                         UseSwimmingEquip;                                  // 0x3240(0x1)
	char                                                         pad0x3_3VBOI[0x3];                                 // 0x3241(0x3)
	float                                                        EquipAnimationPlayRate;                            // 0x3244(0x4)
	bool                                                         ActivateIK;                                        // 0x3248(0x1)
	bool                                                         UseOneShotIntoAnimInContinuousUse;                 // 0x3248(0x1)
	char                                                         pad0x7_ZM0WJ[0x7];                                 // 0x3249(0x7)
};


// Size 0x1490 (Full Size[0x4610] - InheritedSize[0x3180]
class ThirdPersonAnimationInstance: public AthenaAnimationInstance
{
public:
	float                                                        ItemAnimPausedTimeRemaining;                       // 0x3180(0x4)
	bool                                                         IsItemAnimPaused;                                  // 0x3184(0x1)
	bool                                                         UseContinualLoopInOneShotState;                    // 0x3184(0x1)
	char                                                         pad0x3_VSJTU[0x3];                                 // 0x3185(0x3)
	Struct AthenaAnimationIKLimbStretch                          IKLimbStretchParams;                               // 0x3188(0xc)
	char                                                         pad0x4_A8GPI[0x4];                                 // 0x3194(0x4)
	Struct AthenaAnimationLadder                                 LadderAnimationParams;                             // 0x3198(0x330)
	Struct AthenaAnimationTalking                                Talking;                                           // 0x34c8(0x38)
	Struct AthenaAnimationPitchControlStates                     PitchTargetingControlStates;                       // 0x3500(0x168)
	Struct AthenaAnimationObjectTargetingOptions                 PitchTargetingParameters;                          // 0x3668(0x3c)
	Struct AthenaAnimationObjectTargetingOptions                 WantedPitchTargetingParameters;                    // 0x36a4(0x3c)
	Struct AthenaAnimationPitchAlpha                             PitchTargetingAlpha;                               // 0x36e0(0x14)
	Struct AthenaAnimationPitchShoulders                         PitchShoulderParams;                               // 0x36f4(0x1c)
	Struct AthenaAnimationMountedWeapon                          MountedWeaponAnimationParams;                      // 0x3710(0x128)
	Struct AthenaAnimationFootPlanting                           FootPlanting;                                      // 0x3838(0x48)
	byte                                                         StairAnimationState;                               // 0x3880(0x1)
	char                                                         pad0x7_7871Y[0x7];                                 // 0x3881(0x7)
	Struct AthenaAnimationPulleyControl                          PulleyControl;                                     // 0x3888(0x40)
	Struct AthenaAnimationPulleyControlAnimData                  PulleyControlAnimData;                             // 0x38c8(0x48)
	Struct AthenaAnimationKeyedInstrumentAnimData                KeyedInstrumentAnimData;                           // 0x3910(0x18)
	Struct AthenaAnimationAI                                     AIAnimationParams;                                 // 0x3928(0x358)
	Struct AthenaAnimationLocomotionAlternateAnimData            LocomotionDrunk;                                   // 0x3c80(0x50)
	Struct AthenaAnimationLocomotionAlternateAnimData            LocomotionLimp;                                    // 0x3cd0(0x50)
	Struct AthenaAnimationLocomotionAlternateAnimData            LocomotionPegLeg;                                  // 0x3d20(0x50)
	Struct AthenaAnimationLocomotionAlternateAnimData            LocomotionHotCoals;                                // 0x3d70(0x50)
	TArray<struct AISpawnStruct>                                 AISpawnStruct;                                     // 0x3dc0(0x10)
	TArray<struct AIFleeLoadingStruct>                           AIFleeLoadingStruct;                               // 0x3dd0(0x10)
	Struct AthenaAnimationSkeletonFleeInGraph                    AIFleePlayingStruct;                               // 0x3de0(0x38)
	Struct AthenaAnimationSkeletonScream                         SkeletonScream;                                    // 0x3e18(0x8)
	Class BlendSpace1D*                                          PitchAnimationToPlay;                              // 0x3e20(0x8)
	Struct AthenaAnimationShopInteractionParams                  ShopInteractionParams;                             // 0x3e28(0x30)
	Struct AthenaAnimationEmoteAnimgraphStructure                EmoteParams;                                       // 0x3e58(0x148)
	Struct AthenaAnimationSkeletonCurseAnimations                SkeletonCurseAnims;                                // 0x3fa0(0x28)
	Struct AthenaAnimationHarpoonLauncherAnimData                HarpoonLauncherAnims;                              // 0x3fc8(0x28)
	Struct AthenaAnimationAIKnockback                            AIKnockbackStruct;                                 // 0x3ff0(0x30)
	Struct AthenaAnimationHitReactsAnimData                      HitReactionsAnimationData;                         // 0x4020(0x40)
	Struct AthenaAnimationHitReactsSelectedAnimations            HitReactionsSelectedAnimationData;                 // 0x4060(0x48)
	Struct AthenaAnimationHitReactParams                         HitReactionsAnimationParams;                       // 0x40a8(0x2c)
	char                                                         pad0x4_R59Y9[0x4];                                 // 0x40d4(0x4)
	Struct AthenaAnimationSinkingTunnel                          Sinking;                                           // 0x40d8(0x68)
	float                                                        HitReactAdditiveBlendAmount;                       // 0x4140(0x4)
	float                                                        WieldedItemPoseBlendTime;                          // 0x4144(0x4)
	float                                                        UpperBodyPoseBlendTime;                            // 0x4148(0x4)
	float                                                        AimingAndPitchOverride;                            // 0x414c(0x4)
	float                                                        FacialOverlayBlendWeight;                          // 0x4150(0x4)
	Struct Rotator                                               PitchShoulderRotation;                             // 0x4154(0xc)
	Struct Rotator                                               PitchClavicleRotation;                             // 0x4160(0xc)
	float                                                        RightArmPitchAlpha;                                // 0x416c(0x4)
	float                                                        LeftArmPitchAlpha;                                 // 0x4170(0x4)
	float                                                        SpineRotation;                                     // 0x4174(0x4)
	Struct AthenaAnimationStunData                               StunData;                                          // 0x4178(0x8)
	Class BlendSpace1D*                                          HitReactItem;                                      // 0x4180(0x8)
	float                                                        WorldDelta;                                        // 0x4188(0x4)
	float                                                        CapstanAngularVelocityWanted;                      // 0x418c(0x4)
	Struct AthenaAnimationPlayingFacialAnimations                PlayingFacialAnimations;                           // 0x4190(0x40)
	Struct AthenaAnimationPlayingEquipAnimations                 PlayingEquipAnimations;                            // 0x41d0(0x18)
	float                                                        CharacterPitch;                                    // 0x41e8(0x4)
	float                                                        TargetingPitch;                                    // 0x41ec(0x4)
	Struct AthenaAnimationObjectLocomotionAnimations             ItemAlternateLocomotionAnims;                      // 0x41f0(0x40)
	Struct AthenaAnimationObjectIdleAnimations                   ItemAlternateIdleAnims;                            // 0x4230(0x18)
	Struct AthenaAnimationObjectActionContinuousStructPitchOverride ItemPrimaryContinousUseAnimsPitchOverride;         // 0x4248(0x78)
	Struct AthenaAnimationObjectActionContinuousStructPitchOverride ItemSecondaryContinousUseAnimsPitchOverride;       // 0x42c0(0x78)
	Struct AthenaAnimationObjectActionContinuousStructPitchOverride ItemPrimaryContinousUseAlternateAnimsPitchOverride; // 0x4338(0x78)
	Struct AthenaAnimationObjectActionContinuousStructPitchOverride ItemSecondaryContinousUseAlternateAnimsPitchOverride; // 0x43b0(0x78)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemPrimaryContinousUseSwimmingAnimsPitchOverride; // 0x4428(0x20)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemSecondaryContinousUseSwimmingAnimsPitchOverride; // 0x4448(0x20)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemPrimaryContinousUseSwimmingAlternateAnimsPitchOverride; // 0x4468(0x20)
	Struct AthenaAnimationObjectActionContinuousSwimming         ItemSecondaryContinousUseSwimmingAlternateAnimsPitchOverride; // 0x4488(0x20)
	Struct AthenaAnimationObjectJumpingAnimationsPitchOverride   ItemPrimaryContinousUseJumpingAnimsPitchOverride;  // 0x44a8(0x20)
	Struct AthenaAnimationObjectJumpingAnimationsPitchOverride   ItemSecondaryContinousUseJumpingAnimsPitchOverride; // 0x44c8(0x20)
	Struct AthenaAnimationObjectJumpingAnimationsPitchOverride   ItemPrimaryContinousUseJumpingAlternateAnimsPitchOverride; // 0x44e8(0x20)
	Struct AthenaAnimationObjectJumpingAnimationsPitchOverride   ItemSecondaryContinousUseJumpingAlternateAnimsPitchOverride; // 0x4508(0x20)
	Struct AthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemPrimaryOneShotAnimsPitchOverride;              // 0x4528(0x28)
	Struct AthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemSecondaryOneShotAnimsPitchOverride;            // 0x4550(0x28)
	Struct AthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemPrimaryOneShotAlternateAnimsPitchOverride;     // 0x4578(0x28)
	Struct AthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemSecondaryOneShotAlternateAnimsPitchOverride;   // 0x45a0(0x28)
	bool                                                         ZeroLocomotionForced;                              // 0x45c8(0x1)
	bool                                                         ConcealedInLoadable;                               // 0x45c8(0x1)
	bool                                                         AIUseAlternateLocomotion;                          // 0x45c8(0x1)
	bool                                                         EmoteIKIsOff;                                      // 0x45c8(0x1)
	bool                                                         InBlockingInto;                                    // 0x45c8(0x1)
	bool                                                         IsAI;                                              // 0x45c8(0x1)
	bool                                                         IsLocallyControlled;                               // 0x45c8(0x1)
	bool                                                         IsHit;                                             // 0x45c8(0x1)
	bool                                                         InRecover;                                         // 0x45c9(0x1)
	bool                                                         InWarmUp;                                          // 0x45c9(0x1)
	bool                                                         PlayingFullBodyAnimation;                          // 0x45c9(0x1)
	bool                                                         PlayingUpperBodyAnimation;                         // 0x45c9(0x1)
	bool                                                         PlayingRightArmOverlayAnimation;                   // 0x45c9(0x1)
	bool                                                         PlayingSpineOverlayAnimation;                      // 0x45c9(0x1)
	bool                                                         PlayingLeftArmOverlayAnimation;                    // 0x45c9(0x1)
	bool                                                         IsUsingFullBodyOverlayPose;                        // 0x45c9(0x1)
	bool                                                         IsUsingLocalIKPose;                                // 0x45ca(0x1)
	bool                                                         IsRightShoulderActive;                             // 0x45ca(0x1)
	bool                                                         IsLeftShoulderActive;                              // 0x45ca(0x1)
	bool                                                         ControllableObjectTypeHasValidTarget;              // 0x45ca(0x1)
	bool                                                         UseHandsAndFootplantingIK;                         // 0x45ca(0x1)
	bool                                                         IKLODActive;                                       // 0x45ca(0x1)
	bool                                                         LODSolverActive;                                   // 0x45ca(0x1)
	bool                                                         ObjectPitchTargetingActive;                        // 0x45ca(0x1)
	bool                                                         ObjectOrIKEmoteActive;                             // 0x45cb(0x1)
	bool                                                         ObjectOrWheelCapstanAndNotDocking;                 // 0x45cb(0x1)
	bool                                                         HitReact1Active;                                   // 0x45cb(0x1)
	bool                                                         HitReact2Active;                                   // 0x45cb(0x1)
	bool                                                         AthenaCharacterIsValid;                            // 0x45cb(0x1)
	bool                                                         UsePrimaryActionPitchOverride;                     // 0x45cb(0x1)
	bool                                                         UseSecondaryActionPitchOverride;                   // 0x45cb(0x1)
	char                                                         pad0x44_XB3SE[0x44];                               // 0x45cc(0x44)
};


// Size 0x170 (Full Size[0x4780] - InheritedSize[0x4610]
class SkeletonAnimationInstance: public ThirdPersonAnimationInstance
{
public:
	char                                                         pad0x10_FNSWA[0x10];                               // 0x4610(0x10)
	Struct AthenaAnimationSkeletonAIFastPathData                 SkeletonAIFastPathData;                            // 0x4620(0x4)
	char                                                         pad0x4_NEKBH[0x4];                                 // 0x4624(0x4)
	Class NPCHeldObjectData*                                     HeldObjectList;                                    // 0x4628(0x8)
	Class Actor*                                                 LeftHandObject;                                    // 0x4630(0x8)
	Class Actor*                                                 RightHandObject;                                   // 0x4638(0x8)
	float                                                        ObjectOverlayBlendOutTime;                         // 0x4640(0x4)
	char                                                         pad0x4_XPLJS[0x4];                                 // 0x4644(0x4)
	Class AthenaAnimationCustomSkeletonAnimationData*            CustomAnimationData;                               // 0x4648(0x8)
	Struct AthenaAnimationCustomSkeletonAnimationBlueprintData   CustomAnimationBlueprintData;                      // 0x4650(0x58)
	byte                                                         PreviousCustomAnimationState;                      // 0x46a8(0x1)
	char                                                         pad0x7_530C2[0x7];                                 // 0x46a9(0x7)
	Class AnimMontage*                                           CustomAnimationCurrentMontage;                     // 0x46b0(0x8)
	char                                                         pad0xc8_KWT0C[0xc8];                               // 0x46b8(0xc8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAnimationInstanceTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAnimationMountedWeaponBlueprintFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAnimationWieldedItemAnimationOverlayFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAnimationWieldedItemFunctions: public Object
{
public:
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class AthenaAssetSettings: public Object
{
public:
	TArray<struct DelayLoadedAssets>                             DelayLoadedAssets;                                 // 0x28(0x10)
	TArray<struct SteamOnlyDelayLoadedAssets>                    SteamOnlyDelayLoadedAssets;                        // 0x38(0x10)
	TArray<Str PhysicsAuditBlueprintExceptions>                  PhysicsAuditBlueprintExceptions;                   // 0x48(0x10)
	TArray<struct FName>                                         PhysicsAuditExemptedCollisionProfiles;             // 0x58(0x10)
};


// Size 0x80 (Full Size[0x8d0] - InheritedSize[0x850]
class AthenaCameraComponent: public CameraComponent
{
public:
	float                                                        OffsetBlendSpeed;                                  // 0x850(0x4)
	float                                                        AboveWaterOffset;                                  // 0x854(0x4)
	float                                                        UnderWaterOffset;                                  // 0x858(0x4)
	float                                                        SubmersionDistanceBeforeSurfacing;                 // 0x85c(0x4)
	float                                                        SubmersionDistanceBeforeUnderwater;                // 0x860(0x4)
	float                                                        SubmersionDistanceBeforeUnderwaterOnShip;          // 0x864(0x4)
	bool                                                         IsInsideShipHull;                                  // 0x888(0x1)
	char                                                         pad0x3_IUMUQ[0x3];                                 // 0x889(0x3)
	float                                                        CurrentCameraOffset;                               // 0x88c(0x4)
	char                                                         pad0x40_46BWG[0x40];                               // 0x890(0x40)
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class CustomAnimationHandlerComponent: public ActorComponent
{
public:
	char                                                         pad0x10_YTB76[0x10];                               // 0xc8(0x10)
	TArray<struct CurrentCustomAnimationDataAssetReferences>     CurrentCustomAnimationDataAssetReferences;         // 0xd8(0x10)
	Struct RequestedLoopAnims                                    RequestedLoopingAnim;                              // 0xe8(0x10)
	Class AthenaAnimationCustomSkeletonAnimationData*            MergedCustomAnimationData;                         // 0xf8(0x8)
	char                                                         pad0x28_EHCO4[0x28];                               // 0x100(0x28)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class HitDetectionVisualisationInterface: public Interface
{
public:
};


// Size 0x780 (Full Size[0x1380] - InheritedSize[0xc00]
class AthenaAICharacter: public AthenaCharacter
{
public:
	char                                                         pad0xa8_V94M4[0xa8];                               // 0xc00(0xa8)
	class                                                        DefaultAmmoItemDescType;                           // 0xca8(0x8)
	class                                                        DefaultInteractableAmmoItemDescType;               // 0xcb0(0x8)
	Class CurveFloat*                                            DistanceInMToCannonShotHitChanceCurve;             // 0xcb8(0x8)
	bool                                                         AimNoiseEnabled;                                   // 0xcc0(0x1)
	char                                                         pad0x3_S2MVC[0x3];                                 // 0xcc1(0x3)
	float                                                        AmplitudeChangeSpeed;                              // 0xcc4(0x4)
	float                                                        AmplitudeOffset;                                   // 0xcc8(0x4)
	float                                                        Frequency;                                         // 0xccc(0x4)
	float                                                        InteractableMissFallShortMinProportion;            // 0xcd0(0x4)
	float                                                        InteractableMissFallShortMaxProportion;            // 0xcd4(0x4)
	byte                                                         TrackedActorType;                                  // 0xcd8(0x1)
	char                                                         pad0x7_9JQW0[0x7];                                 // 0xcd9(0x7)
	Class FaceTargetComponent*                                   FaceTargetComponent;                               // 0xce0(0x8)
	Class AIPartsRetrievalComponent*                             AIPartsRetrievalComponent;                         // 0xce8(0x8)
	Class AthenaAIFormComponent*                                 FormComponent;                                     // 0xcf0(0x8)
	Class AICharacterAudioComponent*                             AICharacterAudioComponent;                         // 0xcf8(0x8)
	Class StatusEffectManagerComponent*                          StatusEffectManagerComponent;                      // 0xd00(0x8)
	Class StatusEffectPersistenceComponent*                      StatusEffectPersistenceComponent;                  // 0xd08(0x8)
	Class PlayerCurseComponent*                                  PlayerCurseComponent;                              // 0xd10(0x8)
	Class VulnerabilityDuringAIStrategyComponent*                VulnerabilityDuringAIStrategyComponent;            // 0xd18(0x8)
	Class CapsuleComponent*                                      ProjectileTraceHitVolume;                          // 0xd20(0x8)
	Class AnimationDataOverriderComponent*                       AnimationDataOverriderComponent;                   // 0xd28(0x8)
	Class CustomAnimationHandlerComponent*                       CustomAnimationHandlerComponent;                   // 0xd30(0x8)
	Class AIProjectileWeaponFiringIntentionComponent*            FiringIntentionComponent;                          // 0xd38(0x8)
	Class Object*                                                KilledVfxTemplate;                                 // 0xd40(0x8)
	Class Object*                                                PartSpecificKilledVfxTemplate;                     // 0xd48(0x8)
	Struct ItemLoadout                                           AISpawnLoadout;                                    // 0xd50(0x20)
	bool                                                         KillOnFallingIntoWater;                            // 0xd70(0x1)
	char                                                         pad0x7_7FG23[0x7];                                 // 0xd71(0x7)
	class                                                        MeleeAttackStrategyId;                             // 0xd78(0x8)
	class                                                        GunpowderKegAnimationStoreId;                      // 0xd80(0x8)
	Struct PlayerStat                                            OnFireStat;                                        // 0xd88(0x4)
	char                                                         pad0x4c_SHWOR[0x4c];                               // 0xd8c(0x4c)
	Class SkeletalMesh*                                          AssignedMesh;                                      // 0xdd8(0x8)
	Class ColorTexture*                                          TeamColorTexture;                                  // 0xde0(0x8)
	Struct GenericTeamId                                         TeamID;                                            // 0xde8(0x1)
	char                                                         pad0x7_JXH59[0x7];                                 // 0xde9(0x7)
	Class Actor*                                                 CurrentShip;                                       // 0xdf0(0x8)
	float                                                        MeshScale;                                         // 0xdf8(0x4)
	bool                                                         DamageResponsesDisabled;                           // 0xdfc(0x1)
	bool                                                         TurnActive;                                        // 0xdfd(0x1)
	char                                                         pad0x2_F7LEQ[0x2];                                 // 0xdfe(0x2)
	class                                                        CurrentAIStrategy;                                 // 0xe00(0x8)
	class                                                        CurrentAnimationState;                             // 0xe08(0x8)
	class                                                        AlternateLocomotionItemType;                       // 0xe10(0x8)
	char                                                         pad0x3b0_LMC31[0x3b0];                             // 0xe18(0x3b0)
	Class AthenaAIAmmoDataAsset*                                 Ammo;                                              // 0x11c8(0x8)
	Struct AIEncounterSpecification                              PawnEncounterSpec;                                 // 0x11d0(0xd0)
	char                                                         pad0xe0_E029H[0xe0];                               // 0x12a0(0xe0)
};


// Size 0xd0 (Full Size[0x1450] - InheritedSize[0x1380]
class OceanCrawlerAICharacter: public AthenaAICharacter
{
public:
	char                                                         pad0x68_Y5OSC[0x68];                               // 0x1380(0x68)
	Class HealthGemComponent*                                    HealthGemComponent;                                // 0x13e8(0x8)
	Class BuffReceiverComponent*                                 BuffReceiver;                                      // 0x13f0(0x8)
	byte                                                         OceanCrawlerType;                                  // 0x13f8(0x1)
	char                                                         pad0x7_OEU8D[0x7];                                 // 0x13f9(0x7)
	Class CustomAnimationMontageComponent*                       MontageComponent;                                  // 0x1400(0x8)
	Class AnimationServerData*                                   OceanCrawlerAnimationServerData;                   // 0x1408(0x8)
	float                                                        StaticCollisionRampAngleLimit;                     // 0x1410(0x4)
	bool                                                         ShouldPlayersInterruptBullRush;                    // 0x1414(0x1)
	bool                                                         SporeBreathActive;                                 // 0x1415(0x1)
	char                                                         pad0x3a_FUKD9[0x3a];                               // 0x1416(0x3a)
};


// Size 0x160 (Full Size[0x2080] - InheritedSize[0x1f20]
class AthenaGhostPlayerCharacter: public AthenaPlayerCharacter
{
public:
	char                                                         pad0xb0_A82EO[0xb0];                               // 0x1f20(0xb0)
	Class GhostShipTickManager*                                  GhostShipTickManager;                              // 0x1fd0(0x8)
	char                                                         pad0xa8_20GBY[0xa8];                               // 0x1fd8(0xa8)
};


// Size 0x0 (Full Size[0x2080] - InheritedSize[0x2080]
class AthenaGhostPlayerCharacterMock: public AthenaGhostPlayerCharacter
{
public:
};


// Size 0x2e8 (Full Size[0x3b0] - InheritedSize[0xc8]
class VoyageParticipantComponent: public ActorComponent
{
public:
	char                                                         pad0xa8_DI50K[0xa8];                               // 0xc8(0xa8)
	Class Actor*                                                 OwningPlayer;                                      // 0x170(0x8)
	Struct VoyageParticipantViewContainer                        ViewContainer;                                     // 0x178(0xd8)
	Struct VoyageParticipantViewContainer                        PreviousViewContainer;                             // 0x250(0xd8)
	char                                                         pad0x88_5UTFQ[0x88];                               // 0x328(0x88)
};


// Size 0x30 (Full Size[0x1f50] - InheritedSize[0x1f20]
class AthenaPlayerCharacterMock: public AthenaPlayerCharacter
{
public:
	Class AICreatureMovementModifierParamsDataAsset*             PetMovementParamsDataAsset;                        // 0x1f20(0x8)
	bool                                                         AllowedToSwim;                                     // 0x1f28(0x1)
	char                                                         pad0x27_G0QHQ[0x27];                               // 0x1f29(0x27)
};


// Size 0x170 (Full Size[0x20c0] - InheritedSize[0x1f50]
class AthenaPlayerCharacterUnitTestMock: public AthenaPlayerCharacterMock
{
public:
	char                                                         pad0x150_OFFZY[0x150];                             // 0x1f50(0x150)
	class                                                        ExpectedActionStateId;                             // 0x20a0(0x8)
	char                                                         pad0x18_MZVXV[0x18];                               // 0x20a8(0x18)
};


// Size 0x50 (Full Size[0x1fa0] - InheritedSize[0x1f50]
class AthenaPlayerCharacterMockWithAnimSeq: public AthenaPlayerCharacterMock
{
public:
};


// Size 0x120 (Full Size[0x148] - InheritedSize[0x28]
class AthenaCharacterMovementUnderwater: public DataAsset
{
public:
	bool                                                         bSphere;                                           // 0x28(0x1)
	char                                                         pad0x3_X2SOL[0x3];                                 // 0x29(0x3)
	float                                                        Radius;                                            // 0x2c(0x4)
	float                                                        HalfHeight;                                        // 0x30(0x4)
	float                                                        PenResolveInflation;                               // 0x34(0x4)
	float                                                        PullBackDistance;                                  // 0x38(0x4)
	float                                                        FanOutAngle;                                       // 0x3c(0x4)
	float                                                        MaxFanOutScalar;                                   // 0x40(0x4)
	float                                                        IdleBobSpeed;                                      // 0x48(0x4)
	float                                                        IdleBobDuration;                                   // 0x4c(0x4)
	struct FName                                                 CollisionProfileName;                              // 0x50(0x8)
	Class CurveFloat*                                            VelocityToAngle;                                   // 0x58(0x8)
	bool                                                         bDrawDebugCapsule;                                 // 0x64(0x1)
	bool                                                         bDebugOldMovement;                                 // 0x65(0x1)
	char                                                         pad0xe2_XFC6R[0xe2];                               // 0x66(0xe2)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LocalDisturbanceFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x2d0 (Full Size[0x860] - InheritedSize[0x590]
class AthenaCharacterMovementComponent: public CharacterMovementComponent
{
public:
	char                                                         pad0x8_JMMJ1[0x8];                                 // 0x590(0x8)
	Struct AthenaCharacterSwimParams                             SwimParams;                                        // 0x598(0x9c)
	float                                                        SprintSpdAmp;                                      // 0x634(0x4)
	float                                                        SprintAccelAmp;                                    // 0x638(0x4)
	float                                                        LookAtYawRate;                                     // 0x63c(0x4)
	float                                                        LookAtPitchRate;                                   // 0x640(0x4)
	char                                                         pad0x4_XH8GB[0x4];                                 // 0x644(0x4)
	float                                                        MaxSpeedRatioWhenWalkingInNonSwimWater;            // 0x648(0x4)
	float                                                        MaxAccelerationRatioWhenWalkingInNonSwimWater;     // 0x64c(0x4)
	bool                                                         bCharacterCollisionSweepsEnabled;                  // 0x650(0x1)
	char                                                         pad0x3_U5UOM[0x3];                                 // 0x651(0x3)
	float                                                        CharacterCollisionRadius;                          // 0x654(0x4)
	Struct CollisionProfileName                                  CharacterCollisionProfile;                         // 0x658(0x8)
	Struct CollisionProfileName                                  CollisionPanicFallbackProfileName;                 // 0x660(0x8)
	float                                                        CharacterCollisionWalkingFriction;                 // 0x668(0x4)
	float                                                        CharacterCollisionSwimmingFriction;                // 0x66c(0x4)
	float                                                        CharacterCollisionUnderwaterOffset;                // 0x670(0x4)
	char                                                         pad0x4_8RPT7[0x4];                                 // 0x674(0x4)
	Class AthenaCharacterMovementUnderwater*                     UnderwaterMovement;                                // 0x678(0x8)
	bool                                                         bCreateDisturbance;                                // 0x680(0x1)
	char                                                         pad0x3_NFCNO[0x3];                                 // 0x681(0x3)
	float                                                        DisturbanceSize;                                   // 0x684(0x4)
	float                                                        DisturbanceVelocityScale;                          // 0x688(0x4)
	bool                                                         UseAsRVOObstacleOnly;                              // 0x68c(0x1)
	char                                                         pad0x63_VUQCA[0x63];                               // 0x68d(0x63)
	float                                                        FanPushOutAngle;                                   // 0x6f0(0x4)
	int                                                          FanPushOutNumSteps;                                // 0x6f4(0x4)
	float                                                        MaxFanPushOutScalar;                               // 0x6f8(0x4)
	char                                                         pad0x4_3KUAC[0x4];                                 // 0x6fc(0x4)
	Class CurveFloat*                                            UnderwaterVelocityToAnglePitchProjectileHitVolume; // 0x700(0x8)
	Class CurveFloat*                                            UnderwaterVelocityToAngleRollProjectileHitVolume;  // 0x708(0x8)
	Class CurveFloat*                                            UnderwaterVelocityToZOffsetProjectileHitVolume;    // 0x710(0x8)
	Class CurveFloat*                                            OnLandVelocityToAnglePitchProjectileHitVolume;     // 0x718(0x8)
	Class CurveFloat*                                            OnLandVelocityToXOffsetProjectileHitVolume;        // 0x720(0x8)
	Class CurveFloat*                                            OnLandVelocityToYOffsetProjectileHitVolume;        // 0x728(0x8)
	Class CurveFloat*                                            OnLandVelocityToZOffsetProjectileHitVolume;        // 0x730(0x8)
	Class CurveFloat*                                            FallingVelocityToAnglePitchProjectileHitVolume;    // 0x738(0x8)
	Class CurveFloat*                                            FallingVelocityToXOffsetProjectileHitVolume;       // 0x740(0x8)
	Class CurveFloat*                                            FallingVelocityToZOffsetProjectileHitVolume;       // 0x748(0x8)
	char                                                         pad0xd0_38WMY[0xd0];                               // 0x750(0xd0)
	struct FName                                                 NonUnderwaterCollisionProfileName;                 // 0x820(0x8)
	struct FName                                                 UnderwaterCollisionProfileName;                    // 0x828(0x8)
	char                                                         pad0x30_L74S0[0x30];                               // 0x830(0x30)
};


// Size 0x150 (Full Size[0x9b0] - InheritedSize[0x860]
class AthenaPlayerCharacterMovementComponent: public AthenaCharacterMovementComponent
{
public:
	Class CurveFloat*                                            LandingSpeedToFallDamageCurve;                     // 0x860(0x8)
	float                                                        MinFallSpeedToPossiblyCauseDamage;                 // 0x868(0x4)
	float                                                        MinTimeBetweenDamagingImpactsOnUnwalkableSurface;  // 0x86c(0x4)
	float                                                        MinFallDamageToBreakLeg;                           // 0x870(0x4)
	float                                                        FiredFromActorFallDamageScalar;                    // 0x874(0x4)
	float                                                        TimeUntilRecoverFallDamageAudioState;              // 0x878(0x4)
	char                                                         pad0x4_VIC0W[0x4];                                 // 0x87c(0x4)
	Struct Status                                                FallDamageLimpingStatus;                           // 0x880(0x18)
	float                                                        SwimmingStateFilterTime;                           // 0x898(0x4)
	char                                                         pad0x114_F3QEH[0x114];                             // 0x89c(0x114)
};


// Size 0x0 (Full Size[0x9b0] - InheritedSize[0x9b0]
class MockAthenaPlayerCharacterMovementComponent: public AthenaPlayerCharacterMovementComponent
{
public:
};


// Size 0x0 (Full Size[0x1f50] - InheritedSize[0x1f50]
class MockAthenaPlayerCharacterWithAthenaPlayerCharacterMovementComponent: public AthenaPlayerCharacterMock
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StreamingLocationInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0xe0] - InheritedSize[0xc8]
class StreamingLocationComponent: public ActorComponent
{
public:
	char                                                         pad0x8_WG9S5[0x8];                                 // 0xc8(0x8)
	Struct Vector                                                StreamingLocationOverride;                         // 0xd0(0xc)
	bool                                                         StreamingLocationActive;                           // 0xdc(0x1)
	char                                                         pad0x3_EKGWJ[0x3];                                 // 0xdd(0x3)
};


// Size 0x70 (Full Size[0x1f90] - InheritedSize[0x1f20]
class AthenaTavernPlayerCharacter: public AthenaPlayerCharacter
{
public:
	Class AICreatureMovementModifierParamsDataAsset*             ArenaTavernPetMovementData;                        // 0x1f20(0x8)
	char                                                         pad0x30_G5LWV[0x30];                               // 0x1f28(0x30)
	Class AthenaPlayerController*                                PlayerController;                                  // 0x1f58(0x8)
	char                                                         pad0x20_HIVQW[0x20];                               // 0x1f60(0x20)
	bool                                                         VoteForRivalsHasPassed;                            // 0x1f80(0x1)
	char                                                         pad0xf_2Z94L[0xf];                                 // 0x1f81(0xf)
};


// Size 0x0 (Full Size[0x1f90] - InheritedSize[0x1f90]
class AthenaTavernPlayerCharacterMock: public AthenaTavernPlayerCharacter
{
public:
};


// Size 0x68 (Full Size[0x300] - InheritedSize[0x298]
class AthenaCharacterBaseLocomotionInputComponent: public AthenaCharacterBaseInputComponent
{
public:
	char                                                         pad0x60_LSO72[0x60];                               // 0x298(0x60)
	class                                                        ThrowablesItemCategory;                            // 0x2f8(0x8)
};


// Size 0x0 (Full Size[0x300] - InheritedSize[0x300]
class DebugFlyingInputComponent: public AthenaCharacterBaseLocomotionInputComponent
{
public:
};


// Size 0x0 (Full Size[0x300] - InheritedSize[0x300]
class LocomotionInputComponent: public AthenaCharacterBaseLocomotionInputComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaCharacterDockingFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class AthenaCharacterDodgeComponent: public ActorComponent
{
public:
	Struct AthenaCharacterDodgeParams                            Params;                                            // 0xc8(0x10)
	float                                                        ConsecutiveDodgeCountResetTimer;                   // 0xd8(0x4)
	char                                                         pad0x4_CQ8ZY[0x4];                                 // 0xdc(0x4)
	Class CurveFloat*                                            BunnyHoppingScalarCurve;                           // 0xe0(0x8)
	Class AthenaCharacter*                                       Character;                                         // 0xe8(0x8)
	char                                                         pad0x18_NQIFH[0x18];                               // 0xf0(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaCharacterFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x70 (Full Size[0x138] - InheritedSize[0xc8]
class AthenaCharacterKnockbackComponent: public ActorComponent
{
public:
	char                                                         pad0x8_CUXYE[0x8];                                 // 0xc8(0x8)
	bool                                                         Disabled;                                          // 0xd0(0x1)
	char                                                         pad0x7_TCEGB[0x7];                                 // 0xd1(0x7)
	Class AthenaCharacter*                                       Character;                                         // 0xd8(0x8)
	char                                                         pad0x58_9W6RE[0x58];                               // 0xe0(0x58)
};


// Size 0x0 (Full Size[0x138] - InheritedSize[0x138]
class AthenaCharacterKnockbackComponentMock: public AthenaCharacterKnockbackComponent
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class AthenaCharacterMovementCheatDetectionSettings: public Object
{
public:
	float                                                        MinLifetime;                                       // 0x28(0x4)
	float                                                        MinRatioLifetimeToLifetimeRawTimeDiscrepancy;      // 0x2c(0x4)
};


// Size 0x140 (Full Size[0x9a0] - InheritedSize[0x860]
class AthenaAICharacterMovementComponent: public AthenaCharacterMovementComponent
{
public:
	char                                                         pad0x8_KS9LR[0x8];                                 // 0x860(0x8)
	Struct AIStrategyMovementProperties                          DefaultMovementProperties;                         // 0x868(0x18)
	TArray<struct AIStrategyMovementProperties>                  AIStrategyMovementProperties;                      // 0x880(0x10)
	TArray<struct ItemCategoryAIStrategyMovementPropertiesOverrides> ItemCategoryAIStrategyMovementPropertiesOverrides; // 0x890(0x10)
	float                                                        BlendSpeed;                                        // 0x8a0(0x4)
	float                                                        KeepOnNavMeshProjectionDistance;                   // 0x8a4(0x4)
	bool                                                         bDebugKeepOnNavMesh;                               // 0x8a8(0x1)
	bool                                                         DisableNavMeshChecks;                              // 0x8a9(0x1)
	bool                                                         OverrideSmoothNetUpdateDistancesDuringCharge;      // 0x8aa(0x1)
	char                                                         pad0x1_NT8ZB[0x1];                                 // 0x8ab(0x1)
	float                                                        ChargeMaxSmoothNetUpdateDist;                      // 0x8ac(0x4)
	float                                                        ChargeNoSmoothNetUpdateDist;                       // 0x8b0(0x4)
	float                                                        ChargeSmoothNetUpdateGracePeriod;                  // 0x8b4(0x4)
	char                                                         pad0xc0_MQIEY[0xc0];                               // 0x8b8(0xc0)
	float                                                        DesiredMaxSpeedAmp;                                // 0x978(0x4)
	float                                                        DesiredMaxAccelAmp;                                // 0x97c(0x4)
	char                                                         pad0x20_GZHM3[0x20];                               // 0x980(0x20)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class AthenaCharacterMovementSettings: public Object
{
public:
	Struct NetPositionErrorTolerance                             StandardError;                                     // 0x28(0x8)
	Struct NetPositionErrorTolerance                             SwimmingError;                                     // 0x30(0x8)
	float                                                        SwimmingClientTrustThreshold;                      // 0x38(0x4)
	float                                                        MaxSwimmingTimeStep;                               // 0x3c(0x4)
	int                                                          MaxSwimmingIterations;                             // 0x40(0x4)
	float                                                        RebaseToServerErrorSqrDist;                        // 0x44(0x4)
	float                                                        OnlyInterpolationAfterSqrDist;                     // 0x48(0x4)
	float                                                        InterpolationSqrDistWhenWithinConeAngle;           // 0x4c(0x4)
	float                                                        IncreasedInterpolationDistConeAngleDegrees;        // 0x50(0x4)
	bool                                                         OnlyUseInterpolationConeAngleForPlayerCharacters;  // 0x54(0x1)
	char                                                         pad0x3_BOEMH[0x3];                                 // 0x55(0x3)
	float                                                        NoVisualUpdateAfterSqrDist;                        // 0x58(0x4)
	float                                                        TimeBetweenPlayerDistanceChecks;                   // 0x5c(0x4)
	float                                                        TimeBetweenPlayerDistanceChecksWhenConsideringConeAngle; // 0x60(0x4)
	float                                                        TimeToSimulateNewCharacters;                       // 0x64(0x4)
};


// Size 0xc0 (Full Size[0x188] - InheritedSize[0xc8]
class AthenaCharacterStateManagerComponent: public ActorComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaCharacterTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class AthenaContestTavern: public Actor
{
public:
	TArray<class SpawnLocation*>                                 TavernSpawnPoints;                                 // 0x3c8(0x10)
	TArray<class Actor*>                                         TavernLevelActorsToPrepare;                        // 0x3d8(0x10)
	char                                                         pad0x18_JXJ3U[0x18];                               // 0x3e8(0x18)
};


// Size 0x8 (Full Size[0xd0] - InheritedSize[0xc8]
class PlayerPermissionsComponent: public ActorComponent
{
public:
	bool                                                         AllowDebugMenuAccess;                              // 0xc8(0x1)
	bool                                                         AllowDebugMenuButtonShortcutsAccess;               // 0xc9(0x1)
	bool                                                         AllowExecuteOnServer;                              // 0xca(0x1)
	bool                                                         DisableWatermark;                                  // 0xcb(0x1)
	char                                                         pad0x4_RV25J[0x4];                                 // 0xcc(0x4)
};


// Size 0x10 (Full Size[0x128] - InheritedSize[0x118]
class AthenaDebugMenuComponent: public DebugMenuComponent
{
public:
};


// Size 0x10 (Full Size[0x138] - InheritedSize[0x128]
class TestAthenaDebugMenuComponent: public AthenaDebugMenuComponent
{
public:
	Class PlayerPermissionsComponent*                            TestPermissionComponent;                           // 0x128(0x8)
	char                                                         pad0x8_RKAY9[0x8];                                 // 0x130(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AthenaDebugSettings: public Object
{
public:
	Struct StringAssetReference                                  Dioramas;                                          // 0x28(0x10)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class AthenaEditorRuntimeSettings: public DeveloperSettings
{
public:
	int                                                          PIECrewSize;                                       // 0x38(0x4)
	bool                                                         PIEWithBootflow;                                   // 0x3c(0x1)
	char                                                         pad0x3_FNKLD[0x3];                                 // 0x3d(0x3)
	class                                                        PIEShipSize;                                       // 0x40(0x8)
	bool                                                         PIEIsInitialTutorial;                              // 0x48(0x1)
	bool                                                         PIEIsArenaGame;                                    // 0x49(0x1)
	bool                                                         PIEIsCaptain;                                      // 0x4a(0x1)
	bool                                                         PIEIsGuildedSession;                               // 0x4b(0x1)
	int                                                          PIEGuildMembersOnCrew;                             // 0x4c(0x4)
	bool                                                         PIEIsCustomServer;                                 // 0x50(0x1)
	char                                                         pad0x7_0FYP3[0x7];                                 // 0x51(0x7)
	TArray<struct AnimationOverrideEntries>                      AnimationOverrideEntries;                          // 0x58(0x10)
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class AthenaPlayModeLevelsDataAsset: public DataAsset
{
public:
	Struct PlayModeLevelArray                                    PlayModeSpecificLevels;                            // 0x28(0x20)
	char                                                         pad0x60_491XA[0x60];                               // 0x48(0x60)
	TArray<struct CommonLevels>                                  CommonLevels;                                      // 0xa8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class UserBannedHandlerRetrievalInterface: public Interface
{
public:
};


// Size 0x780 (Full Size[0x7a8] - InheritedSize[0x28]
class AthenaGameContext: public Object
{
public:
	char                                                         pad0x70_D0HFU[0x70];                               // 0x28(0x70)
	Class VoiceChatRenderer*                                     VoiceChatRenderer;                                 // 0x98(0x8)
	Class AthenaPlayModeLevelsDataAsset*                         PlayModeLevels;                                    // 0xa0(0x8)
	Class FeatureToggledLevelsDataAsset*                         FeatureToggledLevels;                              // 0xa8(0x8)
	char                                                         pad0x1a0_Z91LW[0x1a0];                             // 0xb0(0x1a0)
	Class GameInstance*                                          PrimaryGameInstance;                               // 0x250(0x8)
	Class AthenaServerIdentityManager*                           AthenaServerIdentityManager;                       // 0x258(0x8)
	Struct GameServiceCoordinator                                ServiceCoordinator;                                // 0x260(0x20)
	char                                                         pad0x1f8_ORL99[0x1f8];                             // 0x280(0x1f8)
	Class AthenaLocalPlayerManager*                              AthenaLocalPlayerManager;                          // 0x478(0x8)
	Class AthenaLocalPlayerReengage*                             AthenaLocalPlayerReengage;                         // 0x480(0x8)
	Class GameNarrationCoordinator*                              GameNarrationCoordinator;                          // 0x488(0x8)
	Class ApplicationSettings*                                   ApplicationSettings;                               // 0x490(0x8)
	char                                                         pad0x310_D5B2K[0x310];                             // 0x498(0x310)
};


// Size 0x20 (Full Size[0xaa8] - InheritedSize[0xa88]
class AthenaGameEngine: public RareGameEngine
{
public:
	char                                                         pad0x8_KQ9X9[0x8];                                 // 0xa88(0x8)
	Class AthenaGameEngineSettings*                              EngineSettings;                                    // 0xa90(0x8)
	char                                                         pad0x10_ITPZ1[0x10];                               // 0xa98(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaGameEngineSettingsInterface: public Interface
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AthenaGameEngineSettings: public Object
{
public:
};


// Size 0x20 (Full Size[0x70] - InheritedSize[0x50]
class AthenaGameEngineSettingsWindows: public AthenaGameEngineSettings
{
public:
};


// Size 0x48 (Full Size[0xd0] - InheritedSize[0x88]
class AthenaGameInstance: public GameInstance
{
public:
	char                                                         pad0x8_YI6A6[0x8];                                 // 0x88(0x8)
	Class AthenaPlayModeLevelsDataAsset*                         AdditionalPlayModeLevels;                          // 0x90(0x8)
	Class AthenaGameContext*                                     GameContext;                                       // 0xa0(0x8)
	char                                                         pad0x28_FRKXP[0x28];                               // 0xa8(0x28)
};


// Size 0x680 (Full Size[0xb40] - InheritedSize[0x4c0]
class AthenaGameMode: public GameMode
{
public:
	char                                                         pad0x28_ZVWHD[0x28];                               // 0x4c0(0x28)
	class                                                        GhostShipPawnClass;                                // 0x4e8(0x8)
	class                                                        ServerNetworkedEventsWhitelistDefinition;          // 0x4f0(0x8)
	char                                                         pad0x1a8_U32SL[0x1a8];                             // 0x4f8(0x1a8)
	Struct GhostShipCoordinator                                  GhostShipCoordinator;                              // 0x6a0(0x370)
	Struct StorageContainerRefresher                             StorageContainerRefresher;                         // 0xa10(0xf8)
	Class RiddleQuestDescGeneratorData*                          RiddleQuestDescGeneratorData;                      // 0xb08(0x8)
	float                                                        RespawnTimer;                                      // 0xb10(0x4)
	float                                                        ContestRespawnTimer;                               // 0xb14(0x4)
	Struct CrewBasedRespawnTimes                                 CrewBasedRespawnTimes;                             // 0xb18(0x10)
	float                                                        StorageContainerRefreshInterval;                   // 0xb28(0x4)
	int                                                          ContainerRefreshBatchSize;                         // 0xb2c(0x4)
	char                                                         pad0x10_WJZ3E[0x10];                               // 0xb30(0x10)
};


// Size 0x210 (Full Size[0xd50] - InheritedSize[0xb40]
class OnlineAthenaGameMode: public AthenaGameMode
{
public:
};


// Size 0x8 (Full Size[0xb48] - InheritedSize[0xb40]
class TestAthenaGameMode: public AthenaGameMode
{
public:
};


// Size 0x0 (Full Size[0xb48] - InheritedSize[0xb48]
class TestAthenaGameModeWithHUD: public TestAthenaGameMode
{
public:
};


// Size 0x0 (Full Size[0xb40] - InheritedSize[0xb40]
class TestInventoryAthenaGameMode: public AthenaGameMode
{
public:
};


// Size 0x90 (Full Size[0x880] - InheritedSize[0x7f0]
class AthenaGameplayDebuggingComponent: public GameplayDebuggingComponent
{
public:
	TArray<Str CurrentServerActionStates>                        CurrentServerActionStates;                         // 0x7e8(0x10)
	class                                                        CurrentAIStrategyId;                               // 0x7f8(0x8)
	TArray<struct CachedAIAbilities>                             CachedAIAbilities;                                 // 0x800(0x10)
	TArray<struct CachedAITargetPickingData>                     CachedAITargetPickingData;                         // 0x810(0x10)
	class                                                        NextAbility;                                       // 0x820(0x8)
	class                                                        QueuedAbility;                                     // 0x828(0x8)
	TArray<class Class*>                                         ReadiedAbilities;                                  // 0x830(0x10)
	Class AthenaAIAbilityHandlerComponent*                       AIAbilityComponent;                                // 0x840(0x8)
	bool                                                         FollowUpAbilitySet;                                // 0x848(0x1)
	char                                                         pad0x3_XO04A[0x3];                                 // 0x849(0x3)
	int                                                          CurrentAbilityStageIndex;                          // 0x84c(0x4)
	TArray<class Class*>                                         AbilitiesActiveInCurrentStage;                     // 0x850(0x10)
	char                                                         pad0x20_IXOJI[0x20];                               // 0x860(0x20)
};


// Size 0x0 (Full Size[0x4b8] - InheritedSize[0x4b8]
class AthenaGameplayDebuggingHUDComponent: public GameplayDebuggingHUDComponent
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ShovelSurfaceFxDataAsset: public DataAsset
{
public:
	TArray<struct SurfaceParams>                                 SurfaceParams;                                     // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ShovelSurfaceHoleDataAsset: public DataAsset
{
public:
	TArray<struct SurfaceDigHoleClass>                           SurfaceDigHoleClass;                               // 0x28(0x10)
};


// Size 0x8a8 (Full Size[0x8d0] - InheritedSize[0x28]
class AthenaGameSettings: public Object
{
public:
	int                                                          NumberOfDaysInEachMonth;                           // 0x28(0x4)
	char                                                         pad0x4_XAJV2[0x4];                                 // 0x2c(0x4)
	Struct FString                                               EntryMap;                                          // 0x30(0x10)
	Struct FString                                               FrontendMap;                                       // 0x40(0x10)
	Struct FString                                               InGameMap;                                         // 0x50(0x10)
	Struct FString                                               TutorialMap;                                       // 0x60(0x10)
	Struct StringAssetReference                                  PlayModeLevels;                                    // 0x70(0x10)
	Struct StringAssetReference                                  FeatureToggledLevels;                              // 0x80(0x10)
	Struct FString                                               OverrideServerURL;                                 // 0x90(0x10)
	float                                                        LoadLevelTimeoutTime;                              // 0xa0(0x4)
	float                                                        ServiceBridgeConnectTimeout;                       // 0xa4(0x4)
	Struct StringAssetReference                                  CinematicCameraControllerClass;                    // 0x108(0x10)
	Struct StringAssetReference                                  CinematicCameraSpectatorPawnClass;                 // 0x118(0x10)
	Struct StringAssetReference                                  MaterialTranslationTableFileLocation;              // 0x128(0x10)
	Struct StringAssetReference                                  MaterialAudioTableFileLocation;                    // 0x138(0x10)
	Struct StringAssetReference                                  MaterialVFXTableFileLocation;                      // 0x148(0x10)
	Struct StringAssetReference                                  ShipAssetClassDatabaseFileLocation;                // 0x158(0x10)
	Struct StringAssetReference                                  AIPersistentPartsServiceAssetClassFileLocation;    // 0x168(0x10)
	Struct StringAssetReference                                  AIPartsServiceAssetClassFileLocation;              // 0x178(0x10)
	Struct StringAssetReference                                  DebugMenuFileLocation;                             // 0x188(0x10)
	Struct StringAssetReference                                  SpawnLocationKeywordPriorityListLocation;          // 0x198(0x10)
	Struct StringAssetReference                                  CrewSpawnLocationVariablesListAsset;               // 0x1a8(0x10)
	Struct StringAssetReference                                  SkellyFortDataFileLocation;                        // 0x1b8(0x10)
	Struct StringAssetReference                                  SkellyFortListDataFileLocation;                    // 0x1c8(0x10)
	Struct StringAssetReference                                  AIShipServiceDataAssetFileLocation;                // 0x1d8(0x10)
	Struct ToggleableAIShipServiceDataAssetFileLocation          AIShipServiceDataAssetFileLocationOverride;        // 0x1e8(0x18)
	Struct StringAssetReference                                  EnemyAIOnShipServiceDataAssetFileLocation;         // 0x200(0x10)
	Struct StringAssetReference                                  ProjectileServiceDataFileLocation;                 // 0x210(0x10)
	Struct StringAssetReference                                  ThrottledProjectileTickDataAssetLocation;          // 0x220(0x10)
	Struct StringAssetReference                                  HoleDataFileLocation;                              // 0x230(0x10)
	Struct StringAssetReference                                  PlayerBuriedItemServiceDataFileLocation;           // 0x240(0x10)
	Struct StringAssetReference                                  ItemLifetimeIslandCapsDataFileLocation;            // 0x250(0x10)
	Struct StringAssetReference                                  CursedCannonballDataAsset;                         // 0x260(0x10)
	Struct StringAssetReference                                  Throwables;                                        // 0x270(0x10)
	class                                                        ThrowablesItemCategory;                            // 0x280(0x8)
	Struct StringAssetReference                                  SpawnableItemsDataAssetLocation;                   // 0x288(0x10)
	Struct StringAssetReference                                  FireworksDebugSpawnItemsDataAsset;                 // 0x298(0x10)
	Struct StringAssetReference                                  UnlockableEntitlementsDataAssetLocation;           // 0x2a8(0x10)
	Struct StringAssetReference                                  DebugWieldablesDataAsset;                          // 0x2b8(0x10)
	Struct StringAssetReference                                  StrongholdKeyDataAsset;                            // 0x2c8(0x10)
	Struct StringAssetReference                                  MigrationUIContentsFileLocation;                   // 0x2d8(0x10)
	Struct StringAssetReference                                  ArenaMigrationUIContentsFileLocation;              // 0x2e8(0x10)
	Struct StringAssetReference                                  InventoryRemappingAssetLocation;                   // 0x2f8(0x10)
	Struct StringAssetReference                                  AllianceSettingsAssetLocation;                     // 0x308(0x10)
	Struct StringAssetReference                                  ReapersMarkSettingsAssetLocation;                  // 0x318(0x10)
	Struct StringAssetReference                                  EmissaryLevelSettingsAssetLocation;                // 0x328(0x10)
	Struct StringAssetReference                                  EmissaryRewardSettingsAssetLocation;               // 0x338(0x10)
	Struct StringAssetReference                                  FactionSettingsAssetLocation;                      // 0x348(0x10)
	Struct StringAssetReference                                  FactionLootLevelRewardsAssetLocation;              // 0x358(0x10)
	Struct StringAssetReference                                  FlamesOfFateSettingsAssetLocation;                 // 0x368(0x10)
	Struct StringAssetReference                                  DiggingConfigResolverAssetLocation;                // 0x378(0x10)
	Struct StringAssetReference                                  ContestSettingsDataAsset;                          // 0x388(0x10)
	Struct StringAssetReference                                  ContestEventsDataAsset;                            // 0x398(0x10)
	Struct StringAssetReference                                  CrewNotificationToastSettings;                     // 0x3a8(0x10)
	Struct StringAssetReference                                  FireSettingsDataAsset;                             // 0x3b8(0x10)
	Struct FString                                               InventoryDefaultItemURL;                           // 0x3c8(0x10)
	float                                                        CheatFlyingSpeedSlow;                              // 0x3d8(0x4)
	float                                                        CheatFlyingSpeedDefault;                           // 0x3dc(0x4)
	float                                                        CheatFlyingSpeedFast;                              // 0x3e0(0x4)
	float                                                        CheatFlyingAcceleration;                           // 0x3e4(0x4)
	Struct EncounterServiceParams                                EncounterServiceParams;                            // 0x3e8(0x20)
	Struct WindServiceParams                                     WindParams;                                        // 0x408(0x24)
	char                                                         pad0x4_4HRFP[0x4];                                 // 0x42c(0x4)
	Struct CrewServiceParams                                     CrewServiceParams;                                 // 0x430(0x70)
	Struct SharedShovelParams                                    SharedShovelParams;                                // 0x4a0(0x60)
	Struct MermaidServiceParams                                  MermaidServiceParams;                              // 0x500(0x88)
	Struct MermaidServiceParams                                  ContestSpecificMermaidServiceParamsToggleLocked;   // 0x588(0x88)
	Struct MakeFriendsEmoteParams                                MakeFriendsEmoteParams;                            // 0x610(0x18)
	Struct MermaidRespawnConfig                                  MermaidRespawnConfiguration;                       // 0x628(0x28)
	Struct CharacterSocketCollisionServiceParams                 CharacterSocketCollisionServiceParams;             // 0x650(0x8)
	Struct AthenaAICharacterParams                               AAthenaAICharacterParams;                          // 0x658(0x14)
	int                                                          AssumedMaxFPSOnServer;                             // 0x66c(0x4)
	struct FName                                                 WwiseObjectUnderwaterStateSwitchGroup;             // 0x670(0x8)
	struct FName                                                 WwiseObjectUnderwaterSwitchDefaultState;           // 0x678(0x8)
	struct FName                                                 WwiseObjectUnderwaterSwitchUnderwaterState;        // 0x680(0x8)
	float                                                        StormQuantisePrecision;                            // 0x688(0x4)
	char                                                         pad0x4_7VIN3[0x4];                                 // 0x68c(0x4)
	Struct StringAssetReference                                  ShipLiveryCatalogueDataAssetLocation;              // 0x690(0x10)
	Struct StringAssetReference                                  ShipPartsCatalogueDataAssetLocation;               // 0x6a0(0x10)
	Struct StringAssetReference                                  RowboatSpawnParamsDataAssetLocation;               // 0x6b0(0x10)
	Struct StringAssetReference                                  HarpoonLauncherItemExclusionDataAssetLocation;     // 0x6c0(0x10)
	Struct StringAssetReference                                  KrakenTentacleClassLocation;                       // 0x6d0(0x10)
	Struct StringAssetReference                                  KrakenShipTentacleClassLocation;                   // 0x6e0(0x10)
	Struct StringAssetReference                                  KrakenServiceParamsDataAssetLocation;              // 0x6f0(0x10)
	Struct StringAssetReference                                  AmbientTinySharkServiceParamsDataAssetLocation;    // 0x700(0x10)
	Struct StringAssetReference                                  SunkenIslandSettings;                              // 0x710(0x10)
	Struct StringAssetReference                                  CompanyDataListAssetLocation;                      // 0x720(0x10)
	Struct StringAssetReference                                  CoherentUIGTAssetRootLocation;                     // 0x730(0x10)
	Struct StringAssetReference                                  CoherentUIGTPersistentDataAssetLocation;           // 0x740(0x10)
	Struct StringAssetReference                                  CoherentContentEngagementMessageLocation;          // 0x750(0x10)
	Struct StringAssetReference                                  NestedWorldRootDataAssetLocation;                  // 0x760(0x10)
	Struct StringAssetReference                                  AshenLordEncounterServiceParams;                   // 0x770(0x10)
	Struct StringAssetReference                                  PortalServiceParams;                               // 0x780(0x10)
	Struct StringAssetReference                                  AggressiveGhostShipsEncounterServiceParams;        // 0x790(0x10)
	TArray<Assetclass RequiredLoadoutCategories>                 RequiredLoadoutCategories;                         // 0x7a0(0x10)
	Struct StringAssetReference                                  CarouselGenerationParams;                          // 0x7b0(0x10)
	float                                                        SinkingShipDestructionDistanceThreshold;           // 0x7c0(0x4)
	char                                                         pad0x4_CSLM2[0x4];                                 // 0x7c4(0x4)
	Struct StringAssetReference                                  DefaultItemsToBeDisplayedOnInventoryPanel;         // 0x7c8(0x10)
	class                                                        DefaultFogBank;                                    // 0x7d8(0x8)
	class                                                        DefaultFogBankManager;                             // 0x7e0(0x8)
	Struct StringAssetReference                                  TunnelsOfTheDamnedServiceParamsDataAssetLocation;  // 0x7e8(0x10)
	Struct PlayerModerationParams                                PlayerModerationParams;                            // 0x7f8(0xc)
	char                                                         pad0x4_3DZ3Q[0x4];                                 // 0x804(0x4)
	Struct StringAssetReference                                  SpireServiceParamsDataAssetLocation;               // 0x808(0x10)
	class                                                        GhostCurseEntitlement;                             // 0x818(0x8)
	struct FName                                                 GhostCurseRewardId;                                // 0x820(0x8)
	class                                                        GoldGhostCurseEntitlement;                         // 0x828(0x8)
	struct FName                                                 GoldGhostCurseRewardId;                            // 0x830(0x8)
	class                                                        SkeletonCurseEntitlement;                          // 0x838(0x8)
	struct FName                                                 SkeletonCurseRewardId;                             // 0x840(0x8)
	struct FName                                                 SkeletonCurseWardrobeKey;                          // 0x848(0x8)
	TArray<class Class*>                                         SkeletonClothingCategories;                        // 0x850(0x10)
	Struct StringAssetReference                                  SkeletonClothingEntitlementMapDataAsset;           // 0x860(0x10)
	TArray<Byte KillNotificationHealthChangeReasons>             KillNotificationHealthChangeReasons;               // 0x870(0x10)
	Struct StringAssetReference                                  ShipStorageJettisonParamsDataAsset;                // 0x880(0x10)
	Struct StringAssetReference                                  WorldEdgeItemParamsDataAsset;                      // 0x890(0x10)
	Struct StringAssetReference                                  PlayerLootMarkerServiceParamsFileLocation;         // 0x8a0(0x10)
	Struct StringAssetReference                                  AdventureOnDemandServiceParamsAssetFileLocation;   // 0x8b0(0x10)
	Struct StringAssetReference                                  AdventureOnDemandVoyageSelectionDataAssetFileLocation; // 0x8c0(0x10)
};


// Size 0x6e0 (Full Size[0xc20] - InheritedSize[0x540]
class AthenaGameState: public ServiceProviderGameState
{
public:
	char                                                         pad0x78_K713P[0x78];                               // 0x540(0x78)
	Class WindService*                                           WindService;                                       // 0x5b8(0x8)
	Class PlayerManagerService*                                  PlayerManagerService;                              // 0x5c0(0x8)
	Class ShipService*                                           ShipService;                                       // 0x5c8(0x8)
	Class WatercraftService*                                     WatercraftService;                                 // 0x5d0(0x8)
	Class TimeService*                                           TimeService;                                       // 0x5d8(0x8)
	Class HealthCustomizationService*                            HealthService;                                     // 0x5e0(0x8)
	Class CustomWeatherService*                                  CustomWeatherService;                              // 0x5e8(0x8)
	Class CustomStatusesService*                                 CustomStatusesService;                             // 0x5f0(0x8)
	Class FFTWaterService*                                       WaterService;                                      // 0x5f8(0x8)
	Class StormService*                                          StormService;                                      // 0x600(0x8)
	Class CrewService*                                           CrewService;                                       // 0x608(0x8)
	Class CaptainedSessionService*                               CaptainedSessionService;                           // 0x610(0x8)
	Class ContestZoneService*                                    ContestZoneService;                                // 0x618(0x8)
	Class ContestRowboatsService*                                ContestRowboatsService;                            // 0x620(0x8)
	Class IslandService*                                         IslandService;                                     // 0x628(0x8)
	Class NPCService*                                            NPCService;                                        // 0x630(0x8)
	Class SkellyFortService*                                     SkellyFortService;                                 // 0x638(0x8)
	Class DeepSeaRegionService*                                  DeepSeaRegionService;                              // 0x640(0x8)
	Class AIActionSpotService*                                   AIActionSpotService;                               // 0x648(0x8)
	Class AIDioramaService*                                      AIDioramaService;                                  // 0x650(0x8)
	Class AshenLordEncounterService*                             AshenLordEncounterService;                         // 0x658(0x8)
	Class AggressiveGhostShipsEncounterService*                  AggressiveGhostShipsEncounterService;              // 0x660(0x8)
	Class TallTaleService*                                       TallTaleService;                                   // 0x668(0x8)
	Class AIShipObstacleService*                                 AIShipObstacleService;                             // 0x670(0x8)
	Class AIShipService*                                         AIShipService;                                     // 0x678(0x8)
	Class AITargetService*                                       AITargetService;                                   // 0x680(0x8)
	Class ShipLiveryCatalogueService*                            ShipLiveryCatalogueService;                        // 0x688(0x8)
	Class DrawDebugService*                                      DrawDebugService;                                  // 0x690(0x8)
	Class WorldEventZoneService*                                 WorldEventZoneService;                             // 0x698(0x8)
	Class WorldResourceRegistry*                                 WorldResourceRegistry;                             // 0x6a0(0x8)
	Class KrakenService*                                         KrakenService;                                     // 0x6a8(0x8)
	Class PlayerNameService*                                     PlayerNameService;                                 // 0x6b0(0x8)
	Class TinySharkService*                                      TinySharkService;                                  // 0x6b8(0x8)
	Class ProjectileService*                                     ProjectileService;                                 // 0x6c0(0x8)
	Class ProjectileHitRegService*                               ProjectileHitRegService;                           // 0x6c8(0x8)
	Class LaunchableProjectileService*                           LaunchableProjectileService;                       // 0x6d0(0x8)
	Class ServerNotificationsService*                            ServerNotificationsService;                        // 0x6d8(0x8)
	Class AIManagerService*                                      AIManagerService;                                  // 0x6e0(0x8)
	Class AIEncounterService*                                    AIEncounterService;                                // 0x6e8(0x8)
	Class AIEncounterGenerationService*                          AIEncounterGenerationService;                      // 0x6f0(0x8)
	Class EncounterService*                                      EncounterService;                                  // 0x6f8(0x8)
	Class GameEventSchedulerService*                             GameEventSchedulerService;                         // 0x700(0x8)
	Class HideoutService*                                        HideoutService;                                    // 0x708(0x8)
	Class AthenaStreamedLevelService*                            StreamedLevelService;                              // 0x710(0x8)
	Class LocationProviderService*                               LocationProviderService;                           // 0x718(0x8)
	Class HoleService*                                           HoleService;                                       // 0x720(0x8)
	Class PlayerBuriedItemService*                               PlayerBuriedItemService;                           // 0x728(0x8)
	Class LoadoutService*                                        LoadoutService;                                    // 0x730(0x8)
	Class OcclusionService*                                      OcclusionService;                                  // 0x738(0x8)
	Class PetsService*                                           PetsService;                                       // 0x740(0x8)
	Class AthenaAITeamsService*                                  AthenaAITeamsService;                              // 0x748(0x8)
	Class AllianceService*                                       AllianceService;                                   // 0x750(0x8)
	Class MaterialAccessibilityService*                          MaterialAccessibilityService;                      // 0x758(0x8)
	Class NPCLoadedOnClientService*                              NPCLoadedOnClientService;                          // 0x760(0x8)
	Class ReapersMarkService*                                    ReapersMarkService;                                // 0x768(0x8)
	Class EmissaryLevelService*                                  EmissaryLevelService;                              // 0x770(0x8)
	Class FactionService*                                        FactionService;                                    // 0x778(0x8)
	Class CampaignService*                                       CampaignService;                                   // 0x780(0x8)
	Class StoryService*                                          StoryService;                                      // 0x788(0x8)
	Class StorySpawnedActorsService*                             StorySpawnedActorsService;                         // 0x790(0x8)
	Class StoryClaimedResourcesService*                          StoryClaimedResourcesService;                      // 0x798(0x8)
	Class GlobalVoyageDirectorService*                           GlobalVoyageDirector;                              // 0x7a0(0x8)
	Class UtilityVoyageService*                                  UtilityVoyageService;                              // 0x7a8(0x8)
	Class FlamesOfFateSettingsService*                           FlamesOfFateSettingsService;                       // 0x7b0(0x8)
	Class ServiceStatusNotificationsService*                     ServiceStatusNotificationsService;                 // 0x7b8(0x8)
	Class MigrationService*                                      MigrationService;                                  // 0x7c0(0x8)
	Class ShipStockService*                                      ShipStockService;                                  // 0x7c8(0x8)
	Class ShroudBreakerService*                                  ShroudBreakerService;                              // 0x7d0(0x8)
	Class ServerUpdateReportingService*                          ServerUpdateReportingService;                      // 0x7d8(0x8)
	Class GenericMarkerService*                                  GenericMarkerService;                              // 0x7e0(0x8)
	Class MechanismsService*                                     MechanismsService;                                 // 0x7e8(0x8)
	Class MerchantContractsService*                              MerchantContractsService;                          // 0x7f0(0x8)
	Class ShipFactory*                                           ShipFactory;                                       // 0x7f8(0x8)
	Class RewindPhysicsService*                                  RewindPhysicsService;                              // 0x800(0x8)
	Class NotificationMessagesDataAsset*                         NotificationMessagesDataAsset;                     // 0x808(0x8)
	Class ProjectileCooldownService*                             ProjectileCooldownService;                         // 0x810(0x8)
	Class IslandReservationService*                              IslandReservationService;                          // 0x818(0x8)
	Class PortalService*                                         PortalService;                                     // 0x820(0x8)
	Class MeshMemoryConstraintService*                           MeshMemoryConstraintService;                       // 0x828(0x8)
	Class BootyStorageService*                                   BootyStorageService;                               // 0x830(0x8)
	Class LoadoutCostService*                                    LoadoutCostService;                                // 0x838(0x8)
	Class SpireService*                                          SpireService;                                      // 0x840(0x8)
	Class FireworkService*                                       FireworkService;                                   // 0x848(0x8)
	Class InvasionService*                                       InvasionService;                                   // 0x850(0x8)
	Class AirGivingService*                                      AirGivingService;                                  // 0x858(0x8)
	Class CutsceneService*                                       CutsceneService;                                   // 0x860(0x8)
	Class CargoRunService*                                       CargoRunService;                                   // 0x868(0x8)
	Class CommodityDemandService*                                CommodityDemandService;                            // 0x870(0x8)
	Class DebugTeleportationDestinationService*                  DebugTeleportationDestinationService;              // 0x878(0x8)
	Class SeasonProgressionUIService*                            SeasonProgressionUIService;                        // 0x880(0x8)
	Class TransientActorService*                                 TransientActorService;                             // 0x888(0x8)
	Class TunnelsOfTheDamnedService*                             TunnelsOfTheDamnedService;                         // 0x890(0x8)
	Class WorldSequenceService*                                  WorldSequenceService;                              // 0x898(0x8)
	Class ItemLifetimeManagerService*                            ItemLifetimeManagerService;                        // 0x8a0(0x8)
	Class ShipStorageJettisonService*                            ShipStorageJettisonService;                        // 0x8a8(0x8)
	Class SeaFortsService*                                       SeaFortsService;                                   // 0x8b0(0x8)
	Class CustomServerLocalisationService*                       CustomServerLocalisationService;                   // 0x8b8(0x8)
	Class BeckonService*                                         BeckonService;                                     // 0x8c0(0x8)
	Class VolcanoService*                                        VolcanoService;                                    // 0x8c8(0x8)
	Class ShipAnnouncementService*                               ShipAnnouncementService;                           // 0x8d0(0x8)
	Class ShipsLogService*                                       ShipsLogService;                                   // 0x8d8(0x8)
	Class AsyncLoadingMonitoringService*                         AsyncLoadingMonitoringService;                     // 0x8e0(0x8)
	Class ActorOfInterestService*                                ActorOfInterestService;                            // 0x8e8(0x8)
	Class EnemyAIOnShipService*                                  EnemyAIOnShipService;                              // 0x8f0(0x8)
	Class UserSettingsService*                                   UserSettingsService;                               // 0x8f8(0x8)
	Class GuildService*                                          GuildService;                                      // 0x900(0x8)
	Class GuildChroniclesService*                                GuildChroniclesService;                            // 0x908(0x8)
	Class PlayerLootMarkerService*                               PlayerLootMarkerService;                           // 0x910(0x8)
	Class AdventureOnDemandService*                              AdventureOnDemandService;                          // 0x918(0x8)
	char                                                         pad0x1c0_RDXBG[0x1c0];                             // 0x920(0x1c0)
	Struct GameServiceCoordinator                                ServiceCoordinator;                                // 0xae0(0x20)
	char                                                         pad0x28_YO3OY[0x28];                               // 0xb00(0x28)
	TArray<Interface ChatComponents>                             ChatComponents;                                    // 0xb28(0x10)
	char                                                         pad0x98_J5QHB[0x98];                               // 0xb38(0x98)
	bool                                                         IsXboxGamePadOnlyServer;                           // 0xbd0(0x1)
	bool                                                         ShouldDisableAsyncOcclusionCheck;                  // 0xbd1(0x1)
	char                                                         pad0x6_8ZVFR[0x6];                                 // 0xbd2(0x6)
	Struct FString                                               SubPlayMode;                                       // 0xbd8(0x10)
	Class CustomVaultService*                                    CustomVaultService;                                // 0xbe8(0x8)
	Class EntityEnumerationService*                              EntityEnumerationService;                          // 0xbf0(0x8)
	Class LevelAssetCachingService*                              LevelAssetCachingService;                          // 0xbf8(0x8)
	Class CrewSkillRatingService*                                CrewSkillRatingService;                            // 0xc00(0x8)
	char                                                         pad0x18_8U15K[0x18];                               // 0xc08(0x18)
};


// Size 0x40 (Full Size[0xb8] - InheritedSize[0x78]
class AthenaGameUserSettings: public GameUserSettings
{
public:
	int                                                          MaxVerticalResolution;                             // 0x78(0x4)
	int                                                          MaxFPS;                                            // 0x7c(0x4)
	int                                                          VSync;                                             // 0x80(0x4)
	int                                                          LightingDetail;                                    // 0x84(0x4)
	int                                                          ModelDetail;                                       // 0x88(0x4)
	int                                                          ShadowDetail;                                      // 0x8c(0x4)
	int                                                          TextureDetail;                                     // 0x90(0x4)
	int                                                          WaterDetail;                                       // 0x94(0x4)
	int                                                          AnimationQuality;                                  // 0x98(0x4)
	int                                                          MMCThresholdScale;                                 // 0x9c(0x4)
	float                                                        ResolutionScaling;                                 // 0xa0(0x4)
	int                                                          ParticleEmitterQuality;                            // 0xa4(0x4)
	int                                                          ParticleResolutionQuality;                         // 0xa8(0x4)
	int                                                          BackBufferCount;                                   // 0xac(0x4)
	int                                                          ShowPerformanceCounters;                           // 0xb0(0x4)
	bool                                                         SmoothFPS;                                         // 0xb4(0x1)
	bool                                                         HDR;                                               // 0xb5(0x1)
	bool                                                         AudioOutputSpatialAudio;                           // 0xb6(0x1)
	bool                                                         Fullscreen;                                        // 0xb7(0x1)
};


// Size 0x10 (Full Size[0x260] - InheritedSize[0x250]
class AthenaGameViewportClient: public GameViewportClient
{
public:
};


// Size 0x318 (Full Size[0x340] - InheritedSize[0x28]
class AthenaLocalPlayerManager: public Object
{
public:
};


// Size 0x150 (Full Size[0x178] - InheritedSize[0x28]
class AthenaLocalPlayerReengage: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaPlayerCharacterTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterAnimaticSettingsInterface: public Interface
{
public:
};


// Size 0x78 (Full Size[0x140] - InheritedSize[0xc8]
class CharacterAnimaticSettingsComponent: public ActorComponent
{
public:
	char                                                         pad0x70_5EHN3[0x70];                               // 0xc8(0x70)
	bool                                                         HasPlayedWakeUpAnimation;                          // 0x138(0x1)
	char                                                         pad0x7_A1JK4[0x7];                                 // 0x139(0x7)
};


// Size 0x3b0 (Full Size[0x800] - InheritedSize[0x450]
class AthenaPlayerState: public PlayerState
{
public:
	char                                                         pad0x48_HSWJP[0x48];                               // 0x450(0x48)
	Class VoiceChatComponent*                                    VoiceChatComponent;                                // 0x498(0x8)
	char                                                         pad0x58_AGBIS[0x58];                               // 0x4a0(0x58)
	Struct FString                                               Sandbox;                                           // 0x4f8(0x10)
	Struct FString                                               ClientPlatform;                                    // 0x508(0x10)
	Struct FString                                               DeviceID;                                          // 0x518(0x10)
	Struct PirateIdentity                                        PirateIdentity;                                    // 0x528(0x78)
	char                                                         pad0xa0_932G1[0xa0];                               // 0x5a0(0xa0)
	Struct Guid                                                  PlayerGameId;                                      // 0x640(0x10)
	Struct PirateDescription                                     PirateDesc;                                        // 0x650(0x80)
	int                                                          PlayerIndexOnServer;                               // 0x6d0(0x4)
	char                                                         pad0x3c_8BP6I[0x3c];                               // 0x6d4(0x3c)
	Struct FString                                               PlayerNameDebug;                                   // 0x710(0x10)
	byte                                                         PlayerActivity;                                    // 0x720(0x1)
	char                                                         pad0xdf_JBK43[0xdf];                               // 0x721(0xdf)
};


// Size 0x158 (Full Size[0x180] - InheritedSize[0x28]
class VoyageRecipeDataAsset: public DataAsset
{
public:
	Struct VoyageRecipe                                          Recipe;                                            // 0x28(0x150)
	bool                                                         IsVoyageLocationBound;                             // 0x178(0x1)
	char                                                         pad0x7_NFKRY[0x7];                                 // 0x179(0x7)
};


// Size 0x1c8 (Full Size[0x348] - InheritedSize[0x180]
class EmergentContestVoyageRecipeDataAsset: public VoyageRecipeDataAsset
{
public:
	Struct EmergentContestVoyageRecipe                           ContestVoyageRecipe;                               // 0x180(0x1c8)
};


// Size 0x150 (Full Size[0x178] - InheritedSize[0x28]
class VoyageDescDataAsset: public DataAsset
{
public:
	TArray<struct Chapters>                                      Chapters;                                          // 0x28(0x10)
	TArray<struct FeatureToggledChapters>                        FeatureToggledChapters;                            // 0x38(0x10)
	Struct FText                                                 Title;                                             // 0x48(0x38)
	Struct FText                                                 Description;                                       // 0x80(0x38)
	Struct FText                                                 LockedDescription;                                 // 0xb8(0x38)
	Struct StringAssetReference                                  KeyArtUrl;                                         // 0xf0(0x10)
	Struct StringAssetReference                                  IconUrl;                                           // 0x100(0x10)
	class                                                        Company;                                           // 0x110(0x8)
	bool                                                         IsEmergent;                                        // 0x118(0x1)
	bool                                                         IsTale;                                            // 0x119(0x1)
	bool                                                         IsStarlightTale;                                   // 0x11a(0x1)
	bool                                                         IsUtilityVoyage;                                   // 0x11b(0x1)
	bool                                                         IsAdventure;                                       // 0x11c(0x1)
	bool                                                         IsCrossWorld;                                      // 0x11d(0x1)
	bool                                                         IsAthenaVoyage2;                                   // 0x11e(0x1)
	Struct ViewVoyageBanners                                     ViewVoyageBanners;                                 // 0x11f(0x2)
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x121(0x1)
	bool                                                         DoNotNotifyParticipantsOfQuestPages;               // 0x122(0x1)
	char                                                         pad0x1_ROTM1[0x1];                                 // 0x123(0x1)
	int                                                          Rank;                                              // 0x124(0x4)
	TArray<struct VoyageCompletionStats>                         VoyageCompletionStats;                             // 0x128(0x10)
	TArray<struct ReapersMarkCompletionStats>                    ReapersMarkCompletionStats;                        // 0x138(0x10)
	TArray<struct VoyageCompletionRewards>                       VoyageCompletionRewards;                           // 0x148(0x10)
	struct FName                                                 CampaignId;                                        // 0x158(0x8)
	Struct StringAssetReference                                  TaleCancelVoteMesh;                                // 0x160(0x10)
	byte                                                         EmergentSource;                                    // 0x170(0x1)
	char                                                         pad0x7_SAVBL[0x7];                                 // 0x171(0x7)
};


// Size 0x48 (Full Size[0x1c0] - InheritedSize[0x178]
class TallTaleContestRecipeDataAsset: public VoyageDescDataAsset
{
public:
	Struct ContestZoneDistribution                               WeightedContestZonesToActivate;                    // 0x178(0x10)
	TArray<struct AvailableIslandArchetypes>                     AvailableIslandArchetypes;                         // 0x188(0x10)
	Struct ContestTimerData                                      ContestVoyageTime;                                 // 0x198(0x18)
	Struct StringClassReference                                  ScoreSystemToLoad;                                 // 0x1b0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ContestManagerServiceInterface: public Interface
{
public:
};


// Size 0xa0 (Full Size[0x168] - InheritedSize[0xc8]
class UIResponceComponent: public ActorComponent
{
public:
	Class AthenaPlayerController*                                OwningPlayerController;                            // 0xc8(0x8)
	char                                                         pad0x98_6I7LW[0x98];                               // 0xd0(0x98)
};


// Size 0x1e8 (Full Size[0x2b0] - InheritedSize[0xc8]
class PlayerTelemetryComponent: public ActorComponent
{
public:
	char                                                         pad0x64_0RYB6[0x64];                               // 0xc8(0x64)
	float                                                        HeartbeatInterval;                                 // 0x12c(0x4)
	char                                                         pad0x150_8JWPY[0x150];                             // 0x130(0x150)
	Struct DateTime                                              SpawnTimestamp;                                    // 0x280(0x8)
	char                                                         pad0x28_N0ETO[0x28];                               // 0x288(0x28)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class IslandEventType: public Object
{
public:
	Struct IslandEventIcons                                      IslandIcons;                                       // 0x28(0x10)
	Struct IslandEventIcons                                      HeaderIcons;                                       // 0x38(0x10)
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class TallTaleIslandEventType: public IslandEventType
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class MapTableCanvasDataAsset: public DataAsset
{
public:
	Struct MapTableCanvasDetails                                 CanvasDetails;                                     // 0x28(0x30)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class IslandEventHUDData: public DataAsset
{
public:
	TArray<class Class*>                                         EventTypes;                                        // 0x28(0x10)
	Struct Vector2D                                              IslandIconSize;                                    // 0x38(0x8)
	Struct Vector2D                                              HeaderIconSize;                                    // 0x40(0x8)
	float                                                        HeaderYOffset;                                     // 0x48(0x4)
	float                                                        TriggerLerpAtZoomLevel;                            // 0x4c(0x4)
	Struct CanvasLerpData                                        LerpData;                                          // 0x50(0x10)
	Struct CanvasLerpData                                        HighlightLerpData;                                 // 0x60(0x10)
	Struct CanvasLerpData                                        FadeInOutData;                                     // 0x70(0x10)
	float                                                        MarkerHighlightRadiusAdjuster;                     // 0x80(0x4)
	Struct Vector2D                                              MarkerHighlightCentreOffset;                       // 0x84(0x8)
	float                                                        MarkerHighlightScale;                              // 0x8c(0x4)
};


// Size 0x90 (Full Size[0x158] - InheritedSize[0xc8]
class IslandEventTrackerComponent: public ActorComponent
{
public:
	TArray<struct EventData>                                     EventData;                                         // 0xc8(0x10)
	char                                                         pad0x80_MWTJZ[0x80];                               // 0xd8(0x80)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class IslandEventTrackerInterface: public Interface
{
public:
};


// Size 0xfb0 (Full Size[0x1720] - InheritedSize[0x770]
class AthenaPlayerController: public PlayerController
{
public:
	char                                                         pad0x80_F5QMR[0x80];                               // 0x770(0x80)
	Class PioneerComponent*                                      PioneerComponent;                                  // 0x7f0(0x8)
	Class PlayerPermissionsComponent*                            PlayerPermissionsComponent;                        // 0x7f8(0x8)
	Class PlayerTelemetryComponent*                              PlayerTelemetryComponent;                          // 0x800(0x8)
	Class PlayerStatsComponent*                                  PlayerStatsComponent;                              // 0x808(0x8)
	Class PlayerSeasonProgressionComponent*                      PlayerSeasonProgressionComponent;                  // 0x810(0x8)
	Class PlayerHeroStatsComponent*                              PlayerHeroStatsComponent;                          // 0x818(0x8)
	Class PlayerWalletComponent*                                 PlayerWalletComponent;                             // 0x820(0x8)
	Class BoxedRpcDispatcherComponent*                           BoxedRpcDispatcherComponent;                       // 0x828(0x8)
	Class PlayerEntitlementComponent*                            PlayerEntitlementComponent;                        // 0x830(0x8)
	Class PlayerMigratableStatusComponent*                       PlayerMigratableStatusComponent;                   // 0x838(0x8)
	Class EmblemComponent*                                       EmblemComponent;                                   // 0x840(0x8)
	Class PlayerCompanyComponent*                                PlayerCompanyComponent;                            // 0x848(0x8)
	Class LeaderboardComponent*                                  LeaderboardComponent;                              // 0x850(0x8)
	Class RewardComponent*                                       RewardComponent;                                   // 0x858(0x8)
	Class PlayerNonVerbalComponent*                              PlayerNonVerbalComponent;                          // 0x860(0x8)
	Class PlayerCrewComponent*                                   PlayerCrewComponent;                               // 0x868(0x8)
	Class PlayerMuteComponent*                                   PlayerMuteComponent;                               // 0x870(0x8)
	Class UIResponceComponent*                                   PlayerUIReturnedResponceComponent;                 // 0x878(0x8)
	Class PopUpNotificationComponent*                            PopUpNotificationComponent;                        // 0x880(0x8)
	Class EncounterListenerComponent*                            EncounterListenerComponent;                        // 0x888(0x8)
	Class CharacterAnimaticSettingsComponent*                    CharacterAnimaticSettingsComponent;                // 0x890(0x8)
	Class AthenaTutorialComponent*                               TutorialComponent;                                 // 0x898(0x8)
	Class ContextualTutorialComponent*                           ContextualTutorialComponent;                       // 0x8a0(0x8)
	Class ShantySelectionComponent*                              ShantySelectionComponent;                          // 0x8a8(0x8)
	Class TutorialManager*                                       TutorialManagerComponent;                          // 0x8b0(0x8)
	Class EmissaryActionRewardBoostComponent*                    EmissaryActionRewardBoostComponent;                // 0x8b8(0x8)
	Class PlayerMysteriousNoteComponent*                         PlayerMysteriousNoteComponent;                     // 0x8c0(0x8)
	Class EmissaryParticipantComponent*                          EmissaryParticipantComponent;                      // 0x8c8(0x8)
	Class CommodityPurchaseTrackingComponent*                    CommodityPurchaseTrackingComponent;                // 0x8d0(0x8)
	Class PlayerActivityComponent*                               PlayerActivityComponent;                           // 0x8d8(0x8)
	Class IslandEventTrackerComponent*                           IslandEventTrackerComponent;                       // 0x8e0(0x8)
	Class CampaignComponent*                                     CampaignComponent;                                 // 0x8e8(0x8)
	Class TaleQuestQueryableStatesAccessComponent*               TaleQuestQueryableStatesAccessComponent;           // 0x8f0(0x8)
	Class AudioReportingComponent*                               AudioReportingComponent;                           // 0x8f8(0x8)
	float                                                        InputRawYawScale;                                  // 0x900(0x4)
	float                                                        InputRawPitchScale;                                // 0x904(0x4)
	Struct InventoryMemory                                       InventoryMemory;                                   // 0x908(0x50)
	Class CinematicCameraController*                             CinematicCameraController;                         // 0x958(0x8)
	char                                                         pad0xc10_667V8[0xc10];                             // 0x960(0xc10)
	Struct Guid                                                  ClientSessionId;                                   // 0x1570(0x10)
	char                                                         pad0x4_3TQOV[0x4];                                 // 0x1580(0x4)
	Class PromptsLocalService*                                   PromptsLocalService;                               // 0x15f0(0x8)
	Class CurveFloat*                                            AutoCentreCurve;                                   // 0x15f8(0x8)
	char                                                         pad0x40_XMJHV[0x40];                               // 0x1600(0x40)
	Struct Vector                                                CinematicCameraControllerLocation;                 // 0x1640(0xc)
	Struct Rotator                                               CinematicCameraControllerRotation;                 // 0x164c(0xc)
	Struct PirateIdentity                                        PirateIdentity;                                    // 0x1658(0x78)
	byte                                                         DeathFlameOfFateType;                              // 0x16d0(0x1)
	byte                                                         FlameOfFateType;                                   // 0x16d1(0x1)
	char                                                         pad0x6_NLN2A[0x6];                                 // 0x16d2(0x6)
	Class IndividualReplicationChannel*                          IndividualReplicationChannel;                      // 0x16d8(0x8)
	char                                                         pad0x18_1KBE1[0x18];                               // 0x16e0(0x18)
	Struct FString                                               DebugServerMigrationEndpoint;                      // 0x16f8(0x10)
	char                                                         pad0x18_SK7PT[0x18];                               // 0x1708(0x18)
};


// Size 0xe8 (Full Size[0x1808] - InheritedSize[0x1720]
class OnlineAthenaPlayerController: public AthenaPlayerController
{
public:
	char                                                         pad0x8_ZFM0A[0x8];                                 // 0x1720(0x8)
	Struct MysteriousNotesCompletionEventsModelEntry             LogoutNoteCompletionIdent;                         // 0x1728(0x8)
	char                                                         pad0x19_1RCD9[0x19];                               // 0x1730(0x19)
	bool                                                         IdleDisconnectEnabled;                             // 0x1749(0x1)
	char                                                         pad0xbe_D8FLO[0xbe];                               // 0x174a(0xbe)
};


// Size 0x40 (Full Size[0x1760] - InheritedSize[0x1720]
class TestAthenaPlayerController: public AthenaPlayerController
{
public:
	Class ForceFeedbackEffect*                                   LastReceivedForceFeedbackEffect;                   // 0x1720(0x8)
	char                                                         pad0x38_3ZFAL[0x38];                               // 0x1728(0x38)
};


// Size 0x0 (Full Size[0x1760] - InheritedSize[0x1760]
class TestAthenaPlayerControllerWithAthenaPlayerCameraManager: public TestAthenaPlayerController
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayerRelevancyServiceInterface: public Interface
{
public:
};


// Size 0x28 (Full Size[0x1748] - InheritedSize[0x1720]
class TestPlayerRelevancyAthenaPlayerController: public AthenaPlayerController
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaPlayerControllerTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x18 (Full Size[0x818] - InheritedSize[0x800]
class TestAthenaPlayerState: public AthenaPlayerState
{
public:
};


// Size 0xf8 (Full Size[0x1c0] - InheritedSize[0xc8]
class AthenaPlayerZonePenetrationTrackerComponent: public ActorComponent
{
public:
	char                                                         pad0x8_NDZOP[0x8];                                 // 0xc8(0x8)
	byte                                                         OverlapType;                                       // 0xd0(0x1)
	char                                                         pad0x3_WDLOZ[0x3];                                 // 0xd1(0x3)
	float                                                        UpdateInterval;                                    // 0xd4(0x4)
	Class ShapeComponent*                                        ShapeComponent;                                    // 0xd8(0x8)
	TArray<class AthenaPlayerCharacter*>                         PlayersInZone;                                     // 0xe0(0x10)
	char                                                         pad0xd0_EYNQ1[0xd0];                               // 0xf0(0xd0)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class AthenaServerIdentityManager: public Object
{
public:
};


// Size 0xc8 (Full Size[0x4a0] - InheritedSize[0x3d8]
class AthenaTextRender: public StaticMeshActor
{
public:
	Struct FText                                                 Text;                                              // 0x3d8(0x38)
	Struct TreasureMapWidgetText                                 TextDesc;                                          // 0x410(0x3c)
	int                                                          CanvasWidth;                                       // 0x44c(0x4)
	int                                                          CanvasHeight;                                      // 0x450(0x4)
	char                                                         pad0x4_W0UBS[0x4];                                 // 0x454(0x4)
	Class Font*                                                  Font;                                              // 0x458(0x8)
	Struct Vector2D                                              FontScale;                                         // 0x460(0x8)
	float                                                        FontLineSpacingScale;                              // 0x468(0x4)
	char                                                         pad0xc_ZBNG1[0xc];                                 // 0x46c(0xc)
	Class CanvasRenderTarget2D*                                  AthenaTextRenderTarget;                            // 0x478(0x8)
	char                                                         pad0x20_7DMYK[0x20];                               // 0x480(0x20)
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class VoyageProposalDesc: public EntitlementDesc
{
public:
	class                                                        TradingCompany;                                    // 0xc8(0x8)
	int                                                          Rank;                                              // 0xd0(0x4)
	bool                                                         UseDifficultyAsRank;                               // 0xd4(0x1)
	bool                                                         UnlockedForAnyRank;                                // 0xd5(0x1)
	bool                                                         AvailableEvenIfRecentlySeen;                       // 0xd6(0x1)
	char                                                         pad0x1_U7VBD[0x1];                                 // 0xd7(0x1)
	int                                                          Difficulty;                                        // 0xd8(0x4)
	char                                                         pad0x4_BOGL5[0x4];                                 // 0xdc(0x4)
	Struct StringAssetReference                                  TooltipBackgroundImageUrl;                         // 0xe0(0x10)
	Class VoyageRecipeDataAsset*                                 VoyageRecipe;                                      // 0xf0(0x8)
	Class VoyageDescDataAsset*                                   VoyageDesc;                                        // 0xf8(0x8)
	Struct StringAssetReference                                  OverrideVotingTableVoyageProposalMesh;             // 0x100(0x10)
	Struct StringAssetReference                                  OverrideOpenVoyageProposalMesh;                    // 0x110(0x10)
	char                                                         pad0x8_CCOLA[0x8];                                 // 0x120(0x8)
};


// Size 0x8 (Full Size[0x130] - InheritedSize[0x128]
class VoyageCheckpointProposalDesc: public VoyageProposalDesc
{
public:
	int                                                          TaleIndex;                                         // 0x128(0x4)
	bool                                                         DoConsumeOnUse;                                    // 0x12c(0x1)
	bool                                                         DoCountAsInventoryVoyage;                          // 0x12d(0x1)
	char                                                         pad0x2_PKTZ3[0x2];                                 // 0x12e(0x2)
};


// Size 0x8 (Full Size[0x408] - InheritedSize[0x400]
class WorldSafeRegion: public BlockingVolume
{
public:
	char                                                         pad0x1_86KOW[0x1];                                 // 0x400(0x1)
	bool                                                         RequiresShroudBreaker;                             // 0x401(0x1)
	bool                                                         IsMainWorldSafeZone;                               // 0x402(0x1)
	char                                                         pad0x5_WXX10[0x5];                                 // 0x403(0x5)
};


// Size 0x1c8 (Full Size[0x748] - InheritedSize[0x580]
class AthenaWorldSettings: public WorldSettings
{
public:
	char                                                         pad0x60_34NQT[0x60];                               // 0x580(0x60)
	Struct Vector2D                                              WorldMax;                                          // 0x5e0(0x8)
	Struct Vector2D                                              WorldMapMin;                                       // 0x5e8(0x8)
	Struct Vector2D                                              WorldMapMax;                                       // 0x5f0(0x8)
	char                                                         pad0x4_N5HVR[0x4];                                 // 0x5f8(0x4)
	float                                                        AdventureDistanceFromWorldSafeRegionEdgeToKillZone; // 0x5fc(0x4)
	float                                                        ArenaDistanceFromWorldSafeRegionEdgeToKillZone;    // 0x600(0x4)
	float                                                        EndOfWorldWarningOffset;                           // 0x604(0x4)
	char                                                         pad0x4_EQ9YV[0x4];                                 // 0x608(0x4)
	float                                                        AdventureDistanceFromWorldSafeRegionEdgeToFullStrainAndLighting; // 0x60c(0x4)
	float                                                        ArenaDistanceFromWorldSafeRegionEdgeToFullStrainAndLighting; // 0x610(0x4)
	int                                                          EndOfWorldWarningLightingIndex;                    // 0x614(0x4)
	Class BuoyantObjectSpawnParamsDataAsset*                     BuoyantObjectSpawnParams;                          // 0x618(0x8)
	Class SeaFortsWorldDataAsset*                                SeaFortsData;                                      // 0x620(0x8)
	Class SeaRockDataAsset*                                      SeaRockLocations;                                  // 0x628(0x8)
	Struct StringAssetReference                                  TradeRoutes;                                       // 0x630(0x10)
	TArray<struct ManuallyStreamedLevels>                        ManuallyStreamedLevels;                            // 0x640(0x10)
	Class TunnelWorldConfig*                                     TunnelWorldConfig;                                 // 0x650(0x8)
	Class SpireStreamedLevelDataAsset*                           SpireLevels;                                       // 0x658(0x8)
	Struct KrakenWorldSettingsParams                             KrakenParams;                                      // 0x660(0x1)
	Struct TinySharkWorldSettingsParams                          TinySharkParams;                                   // 0x661(0x1)
	char                                                         pad0x6_DQS8U[0x6];                                 // 0x662(0x6)
	Struct AIShipWorldSettings                                   AIShipParams;                                      // 0x668(0x18)
	Class InvasionLocationsDataAsset*                            InvasionLocationsDataAsset;                        // 0x680(0x8)
	Class IslandDataAsset*                                       IslandDataAsset;                                   // 0x688(0x8)
	Class PrebakedIslandAsset*                                   PrebakedIslandData;                                // 0x690(0x8)
	Class MapTableCanvasDataAsset*                               MapTableCanvasData;                                // 0x698(0x8)
	Class VoyageDescDataAsset*                                   TutorialTale;                                      // 0x6a0(0x8)
	Class VoyageDescDataAsset*                                   ScuttleShipVoyageDescAsset;                        // 0x6a8(0x8)
	float                                                        DevilsShroudPlayerDamageMaxDamage;                 // 0x6b0(0x4)
	bool                                                         AllowCompanyOnboardingTutorial;                    // 0x6b4(0x1)
	bool                                                         AllowContextualTutorial;                           // 0x6b5(0x1)
	bool                                                         ShowMapTable;                                      // 0x6b6(0x1)
	bool                                                         UseDevDefinition;                                  // 0x6b7(0x1)
	bool                                                         EnableGlobalVoyages;                               // 0x6b8(0x1)
	char                                                         pad0x7_M5ML0[0x7];                                 // 0x6b9(0x7)
	Class GlobalVoyageOverrideAsset*                             GlobalVoyageOverrideAsset;                         // 0x6c0(0x8)
	TArray<class Class*>                                         NPCOnBeachVoyageCheckpoints;                       // 0x6c8(0x10)
	bool                                                         UseGameEventSchedulerRemoteServices;               // 0x6d8(0x1)
	char                                                         pad0x7_N5BXC[0x7];                                 // 0x6d9(0x7)
	Class GameEventSchedulerSettingsAsset*                       DefaultGameEventSchedulerSettings;                 // 0x6e0(0x8)
	TArray<struct GameEventSchedulerSettingsConfigurations>      GameEventSchedulerSettingsConfigurations;          // 0x6e8(0x10)
	Class StormServiceAsset*                                     StormServiceSettings;                              // 0x6f8(0x8)
	TArray<struct SafeZonesIncludingRequiresShroudBreaker>       SafeZonesIncludingRequiresShroudBreaker;           // 0x700(0x10)
	TArray<struct SafeZonesExcludingRequiresShroudBreaker>       SafeZonesExcludingRequiresShroudBreaker;           // 0x710(0x10)
	TArray<struct MainWorldSafeZones>                            MainWorldSafeZones;                                // 0x720(0x10)
	TArray<struct OverridingSafeZones>                           OverridingSafeZones;                               // 0x730(0x10)
	char                                                         pad0x8_OSUEQ[0x8];                                 // 0x740(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AtmosphericPressureService: public Object
{
public:
	char                                                         pad0x8_0V106[0x8];                                 // 0x28(0x8)
	TArray<Interface RegisteredAtmosphericPressureZones>         RegisteredAtmosphericPressureZones;                // 0x30(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AudioEmitterPoolSourceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AudioUtilities: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AudioVisualiserHudComponentInterface: public Interface
{
public:
};


// Size 0x70 (Full Size[0x138] - InheritedSize[0xc8]
class AudioVisualiserHudComponent: public ActorComponent
{
public:
	char                                                         pad0x10_I8NOW[0x10];                               // 0xc8(0x10)
	TArray<struct Hoops>                                         Hoops;                                             // 0xd8(0x10)
	char                                                         pad0x50_SBUIF[0x50];                               // 0xe8(0x50)
};


// Size 0xb0 (Full Size[0x148] - InheritedSize[0x98]
class AwaitCrewShipToSailAwayFromCurrentLocationStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class AwaitCrewShipToSailAwayFromCurrentLocationStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        MinShipDistanceToTravel;                           // 0x80(0x4)
	bool                                                         CompleteStepIfShipIsDestroyed;                     // 0x84(0x1)
	char                                                         pad0x3_Q3HBL[0x3];                                 // 0x85(0x3)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class RadialContentRule: public Object
{
public:
	Struct FText                                                 RadialTitle;                                       // 0x28(0x38)
	char                                                         pad0x8_UAP0Z[0x8];                                 // 0x60(0x8)
	TArray<class Class*>                                         NotificationInputsToBlock;                         // 0x68(0x10)
};


// Size 0x98 (Full Size[0x110] - InheritedSize[0x78]
class BaitRadialContentRule: public RadialContentRule
{
public:
	char                                                         pad0x58_KVX4W[0x58];                               // 0x78(0x58)
	float                                                        RadialIconScale;                                   // 0xd0(0x4)
	Struct Vector2D                                              RadialIconOffset;                                  // 0xd4(0x8)
	char                                                         pad0x4_C241H[0x4];                                 // 0xdc(0x4)
	Class InventoryItemDescToSlotRemappingPolicyAsset*           RemappingAsset;                                    // 0xe0(0x8)
	TArray<class ItemInfo*>                                      MappedSlots;                                       // 0xe8(0x10)
	class                                                        BaitItemCategory;                                  // 0xf8(0x8)
	char                                                         pad0x10_VP962[0x10];                               // 0x100(0x10)
};


// Size 0x48 (Full Size[0x110] - InheritedSize[0xc8]
class BakedDecalComponent: public ActorComponent
{
public:
	int                                                          TargetTextureSize;                                 // 0xc8(0x4)
	Struct LinearColor                                           ClearColour;                                       // 0xcc(0x10)
	int                                                          MaxDeferredDecals;                                 // 0xdc(0x4)
	Class TextureRenderTarget2D*                                 TargetTexture;                                     // 0xe0(0x8)
	TArray<class StaticMeshComponent*>                           StaticMeshes;                                      // 0xe8(0x10)
	TArray<struct DeferredDecals>                                DeferredDecals;                                    // 0xf8(0x10)
	char                                                         pad0x8_9EUQV[0x8];                                 // 0x108(0x8)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class BallastStatus: public StatusBase
{
public:
};


// Size 0x130 (Full Size[0x530] - InheritedSize[0x400]
class PickupableObject: public InteractableBase
{
public:
	char                                                         pad0x10_RZY0W[0x10];                               // 0x400(0x10)
	Struct StartPickupObjectActionRuleParams                     StartPickupObjectActionRuleParams;                 // 0x410(0x10)
	float                                                        PickupTime;                                        // 0x420(0x4)
	char                                                         pad0x10c_M2E0X[0x10c];                             // 0x424(0x10c)
};


// Size 0x110 (Full Size[0x640] - InheritedSize[0x530]
class ItemProxy: public PickupableObject
{
public:
	char                                                         pad0x30_SKJZK[0x30];                               // 0x530(0x30)
	float                                                        InteractionPointRadius;                            // 0x560(0x4)
	char                                                         pad0x4_YYSYM[0x4];                                 // 0x564(0x4)
	Class WwiseEvent*                                            GroundImpactSfx;                                   // 0x568(0x8)
	TArray<struct VFXParams>                                     VFXParams;                                         // 0x570(0x10)
	float                                                        ZOffsetWhenPlacingWorldProxy;                      // 0x580(0x4)
	Struct Rotator                                               RotationWhenPlacingWorldProxy;                     // 0x584(0xc)
	byte                                                         DropOnSurfaceClientTraceChannel;                   // 0x590(0x1)
	char                                                         pad0x7_FU5EP[0x7];                                 // 0x591(0x7)
	Class PrimitiveComponent*                                    ThirdPersonMesh;                                   // 0x598(0x8)
	float                                                        TTL;                                               // 0x5a0(0x4)
	char                                                         pad0x4_YA7R7[0x4];                                 // 0x5a4(0x4)
	Class WaterInteractionComponent*                             WaterInteractionComponent;                         // 0x5a8(0x8)
	Class BuoyancyComponent*                                     BuoyancyComponent;                                 // 0x5b0(0x8)
	char                                                         pad0x1_BQGY0[0x1];                                 // 0x5b8(0x1)
	byte                                                         CachedProxySurfaceType;                            // 0x5b9(0x1)
	bool                                                         CachedOnTopOfExistingBuriable;                     // 0x5ba(0x1)
	bool                                                         DroppedInDeepWater;                                // 0x5bb(0x1)
	char                                                         pad0x4_ETEVD[0x4];                                 // 0x5bc(0x4)
	Class ItemInfo*                                              ItemInfo;                                          // 0x5c0(0x8)
	char                                                         pad0x6c_BLM06[0x6c];                               // 0x5c8(0x6c)
	float                                                        TTLPlayerProximityCutoff;                          // 0x634(0x4)
	float                                                        TTLRecheckPeriod;                                  // 0x638(0x4)
	char                                                         pad0x4_D3QNZ[0x4];                                 // 0x63c(0x4)
};


// Size 0x1a8 (Full Size[0x7e8] - InheritedSize[0x640]
class FloatingItemProxy: public ItemProxy
{
public:
	char                                                         pad0x8_8LLFF[0x8];                                 // 0x640(0x8)
	Struct RigidBodyErrorCorrection                              PhysicsErrorCorrection;                            // 0x648(0x1c)
	char                                                         pad0x4_ZYDCM[0x4];                                 // 0x664(0x4)
	Class BoxComponent*                                          BaseComponent;                                     // 0x668(0x8)
	char                                                         pad0x38_ZFTA8[0x38];                               // 0x670(0x38)
	Struct NetTimeStampCalculator                                MovementTimeStamp;                                 // 0x6a8(0x70)
	Class Actor*                                                 TutorialOwner;                                     // 0x718(0x8)
	bool                                                         IsTutorialProxy;                                   // 0x720(0x1)
	char                                                         pad0x7_PUKLO[0x7];                                 // 0x721(0x7)
	Struct ReplicatedPhysicsState                                ReplicatedPhysicsState;                            // 0x728(0x50)
	Class RetractableComponent*                                  RetractableComponent;                              // 0x778(0x8)
	bool                                                         ForceKeepTickActive;                               // 0x780(0x1)
	char                                                         pad0x5f_TRBOF[0x5f];                               // 0x781(0x5f)
	byte                                                         CachedAutoAimCollisionChannel;                     // 0x7e0(0x1)
	byte                                                         CachedVehicleCollisionResponse;                    // 0x7e1(0x1)
	char                                                         pad0x6_35I4P[0x6];                                 // 0x7e2(0x6)
};


// Size 0x20 (Full Size[0x808] - InheritedSize[0x7e8]
class BootyProxy: public FloatingItemProxy
{
public:
	char                                                         pad0x18_JMTH7[0x18];                               // 0x7e8(0x18)
	Class ItemProxyShipTrackerComponent*                         ItemProxyShipTrackerComponent;                     // 0x800(0x8)
};


// Size 0x20 (Full Size[0x828] - InheritedSize[0x808]
class BaseMerchantCrateItemProxy: public BootyProxy
{
public:
	Class RewindComponent*                                       RewindComponent;                                   // 0x808(0x8)
	Class WwiseEvent*                                            FullGroundImpactSfx;                               // 0x820(0x8)
};


// Size 0x0 (Full Size[0x828] - InheritedSize[0x828]
class MerchantCrateItemProxy: public BaseMerchantCrateItemProxy
{
public:
};


// Size 0x0 (Full Size[0x828] - InheritedSize[0x828]
class StaticMerchantCrateItemProxy: public BaseMerchantCrateItemProxy
{
public:
};


// Size 0x10 (Full Size[0x838] - InheritedSize[0x828]
class CargoRunCrateItemProxy: public MerchantCrateItemProxy
{
public:
	Class CargoRunCrateComponent*                                CargoRunCrateComponent;                            // 0x828(0x8)
	Class NPCDialogComponent*                                    NPCDialogComponent;                                // 0x830(0x8)
};


// Size 0x10 (Full Size[0x838] - InheritedSize[0x828]
class StaticCargoRunCrateItemProxy: public StaticMerchantCrateItemProxy
{
public:
	Class CargoRunCrateComponent*                                CargoRunCrateComponent;                            // 0x828(0x8)
	Class NPCDialogComponent*                                    NPCDialogComponent;                                // 0x830(0x8)
};


// Size 0x28 (Full Size[0x860] - InheritedSize[0x838]
class DamageableCargoRunCrateItemProxy: public CargoRunCrateItemProxy
{
public:
	bool                                                         ProjectileCollisionsEnabledAboveMinimumHealthGate; // 0x838(0x1)
	char                                                         pad0x7_RYLMJ[0x7];                                 // 0x839(0x7)
	Class GatedHealthComponent*                                  GatedHealthComponent;                              // 0x840(0x8)
	char                                                         pad0x8_OWHK3[0x8];                                 // 0x848(0x8)
	Class VisualHealthResponseComponent*                         VisualHealthResponseComponent;                     // 0x850(0x8)
	Class LightWeightStatusEffectManagerComponent*               LightweightStatusEffectComponent;                  // 0x858(0x8)
};


// Size 0x28 (Full Size[0x860] - InheritedSize[0x838]
class StaticDamageableCargoRunCrateItemProxy: public StaticCargoRunCrateItemProxy
{
public:
	bool                                                         ProjectileCollisionsEnabledAboveMinimumHealthGate; // 0x838(0x1)
	char                                                         pad0x7_C8CCP[0x7];                                 // 0x839(0x7)
	Class GatedHealthComponent*                                  GatedHealthComponent;                              // 0x840(0x8)
	char                                                         pad0x8_NV7F2[0x8];                                 // 0x848(0x8)
	Class VisualHealthResponseComponent*                         VisualHealthResponseComponent;                     // 0x850(0x8)
	Class LightWeightStatusEffectManagerComponent*               LightweightStatusEffectComponent;                  // 0x858(0x8)
};


// Size 0x148 (Full Size[0x510] - InheritedSize[0x3c8]
class ItemInfo: public Actor
{
public:
	char                                                         pad0x20_O9HVE[0x20];                               // 0x3c8(0x20)
	bool                                                         CanBeStoredInInventory;                            // 0x3e8(0x1)
	char                                                         pad0x7_0RNGZ[0x7];                                 // 0x3e9(0x7)
	class                                                        WieldableType;                                     // 0x428(0x8)
	class                                                        ProxyType;                                         // 0x430(0x8)
	Class WieldableItemPersistentCooldownComponent*              WieldableItemPersistenceCooldownComponent;         // 0x438(0x8)
	Class ItemDesc*                                              Desc;                                              // 0x440(0x8)
	byte                                                         CurrentRepresentation;                             // 0x448(0x1)
	char                                                         pad0x7_WYRO5[0x7];                                 // 0x449(0x7)
	Class Actor*                                                 CurrentRepresentationInstance;                     // 0x450(0x8)
	Class Actor*                                                 CurrentOwner;                                      // 0x458(0x8)
	Class Actor*                                                 TutorialOwner;                                     // 0x460(0x8)
	char                                                         pad0xa1_F0SEB[0xa1];                               // 0x468(0xa1)
	bool                                                         DoNotConsiderForMigrationGather;                   // 0x509(0x1)
	char                                                         pad0x6_K24L8[0x6];                                 // 0x50a(0x6)
};


// Size 0x0 (Full Size[0x510] - InheritedSize[0x510]
class NonStorableItemInfo: public ItemInfo
{
public:
};


// Size 0x218 (Full Size[0x728] - InheritedSize[0x510]
class BootyItemInfo: public NonStorableItemInfo
{
public:
	char                                                         pad0x30_PI5Q4[0x30];                               // 0x510(0x30)
	byte                                                         BootyType;                                         // 0x540(0x1)
	char                                                         pad0x3_NUHPO[0x3];                                 // 0x541(0x3)
	Struct Guid                                                  Id;                                                // 0x544(0x10)
	bool                                                         PlayedFirstTimeEquipSfx;                           // 0x554(0x1)
	char                                                         pad0x3_SR7SM[0x3];                                 // 0x555(0x3)
	TArray<struct HandInPlayerStats>                             HandInPlayerStats;                                 // 0x558(0x10)
	TArray<struct HandInStolenPlayerStats>                       HandInStolenPlayerStats;                           // 0x568(0x10)
	TArray<struct HandInStolenFromPlayerStats>                   HandInStolenFromPlayerStats;                       // 0x578(0x10)
	TArray<struct HandInGiftPlayerStats>                         HandInGiftPlayerStats;                             // 0x588(0x10)
	TArray<struct HandInAsPirateLegendPlayerStats>               HandInAsPirateLegendPlayerStats;                   // 0x598(0x10)
	TArray<struct HandInOnSchedulePlayerStats>                   HandInOnSchedulePlayerStats;                       // 0x5a8(0x10)
	TArray<struct HandInAsPirateLegendOnSchedulePlayerStats>     HandInAsPirateLegendOnSchedulePlayerStats;         // 0x5b8(0x10)
	TArray<struct HandInAsEmissaryPlayerStats>                   HandInAsEmissaryPlayerStats;                       // 0x5c8(0x10)
	TArray<struct HandInAsMaxLevelEmissaryPlayerStats>           HandInAsMaxLevelEmissaryPlayerStats;               // 0x5d8(0x10)
	TArray<struct HandInStolenAsEmissaryPlayerStats>             HandInStolenAsEmissaryPlayerStats;                 // 0x5e8(0x10)
	TArray<struct HandInStolenAsMaxLevelEmissaryPlayerStats>     HandInStolenAsMaxLevelEmissaryPlayerStats;         // 0x5f8(0x10)
	TArray<struct UsePlayerStats>                                UsePlayerStats;                                    // 0x608(0x10)
	TArray<struct UseStolenPlayerStats>                          UseStolenPlayerStats;                              // 0x618(0x10)
	Struct CompanyBootyStatList                                  CompanySpecificStats;                              // 0x628(0x10)
	Struct ConditionalHandInStat                                 ConditionalHandInStat;                             // 0x638(0x20)
	Class PopUpMessageDesc*                                      DiscoveredPopupDesc;                               // 0x658(0x8)
	Struct BootyItemSellPrerequisites                            SellPrerequisites;                                 // 0x660(0x10)
	Class TrackedOwnerComponent*                                 TrackedOwnerComponent;                             // 0x670(0x8)
	Class ItemQualityComponent*                                  ItemQualityComponent;                              // 0x678(0x8)
	byte                                                         ItemQualityLevel;                                  // 0x680(0x1)
	char                                                         pad0x7_3XGTA[0x7];                                 // 0x681(0x7)
	TArray<struct CompanySpecificItemQualityLevel>               CompanySpecificItemQualityLevel;                   // 0x688(0x10)
	Struct RewardId                                              HandInRewardId;                                    // 0x698(0x8)
	TArray<struct HandInRewardIdCompanySpecific>                 HandInRewardIdCompanySpecific;                     // 0x6a0(0x10)
	bool                                                         RewardToOwnCrewOnly;                               // 0x6b0(0x1)
	char                                                         pad0x3_PN6Z4[0x3];                                 // 0x6b1(0x3)
	struct FName                                                 Rarity;                                            // 0x6b4(0x8)
	char                                                         pad0x4_1R6NX[0x4];                                 // 0x6bc(0x4)
	class                                                        AwardAllegianceToFaction;                          // 0x6c0(0x8)
	char                                                         pad0x18_UMC1K[0x18];                               // 0x6c8(0x18)
	Class DeliverableComponent*                                  DeliverableComponent;                              // 0x6e0(0x8)
	Class CrewOwnershipTrackingComponent*                        CrewOwnershipTrackingComponent;                    // 0x6e8(0x8)
	Class BootyItemShipOwnershipComponent*                       BootyItemShipOwnershipComponent;                   // 0x6f0(0x8)
	byte                                                         SpawnSource;                                       // 0x6f8(0x1)
	char                                                         pad0x2f_6Z6TI[0x2f];                               // 0x6f9(0x2f)
};


// Size 0x88 (Full Size[0x7b0] - InheritedSize[0x728]
class MerchantCrateItemInfo: public BootyItemInfo
{
public:
	char                                                         pad0x8_UZM7M[0x8];                                 // 0x728(0x8)
	TArray<struct FaunaBreedRarity>                              FaunaBreedRarity;                                  // 0x730(0x10)
	char                                                         pad0x68_6SG04[0x68];                               // 0x740(0x68)
	Class Actor*                                                 CurrentShip;                                       // 0x7a8(0x8)
};


// Size 0x418 (Full Size[0x7e0] - InheritedSize[0x3c8]
class WieldableItem: public Actor
{
public:
	char                                                         pad0x60_0VQMZ[0x60];                               // 0x3c8(0x60)
	Class PrimitiveComponent*                                    FirstPersonMesh;                                   // 0x428(0x8)
	Class PrimitiveComponent*                                    ThirdPersonMesh;                                   // 0x430(0x8)
	Class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x438(0x8)
	class                                                        AnimationKey;                                      // 0x440(0x8)
	Struct ObjectMessagingDispatcher                             MessagingDispatcher;                               // 0x448(0xa0)
	char                                                         pad0x8_BKRQN[0x8];                                 // 0x4e8(0x8)
	Struct Transform                                             AnimationOffset;                                   // 0x4f0(0x30)
	Class WwiseEvent*                                            EquipSfx;                                          // 0x520(0x8)
	Class WwiseEvent*                                            UnequipSfx;                                        // 0x528(0x8)
	Class WwiseEvent*                                            WielderLandedJumpSfx;                              // 0x530(0x8)
	Class WwiseEvent*                                            WielderFootstepLayerOneshot;                       // 0x538(0x8)
	struct FName                                                 PlayerWalkSpeedRtpc;                               // 0x540(0x8)
	Class WwiseEvent*                                            FirstTimeEquipSfx;                                 // 0x548(0x8)
	bool                                                         ForceUnequipSfx;                                   // 0x550(0x1)
	byte                                                         ItemSize;                                          // 0x551(0x1)
	char                                                         pad0x6_K4MSX[0x6];                                 // 0x552(0x6)
	Struct DetailAppearenceDesc                                  DetailAppearence;                                  // 0x558(0x30)
	bool                                                         PropagateVisibilityToChildren;                     // 0x588(0x1)
	char                                                         pad0x3_U7AOV[0x3];                                 // 0x589(0x3)
	struct FName                                                 AINoiseTag;                                        // 0x58c(0x8)
	char                                                         pad0x4_3NJ9W[0x4];                                 // 0x594(0x4)
	TArray<struct FName>                                         ThirdPersonExtraMeshNames;                         // 0x598(0x10)
	TArray<struct FName>                                         StashedExtraMeshNames;                             // 0x5a8(0x10)
	Class MeshComponent*                                         StashedMeshComponent;                              // 0x5b8(0x8)
	struct FName                                                 StashedMeshAttachSocket;                           // 0x5c0(0x8)
	struct FName                                                 ServerWieldAttachSocket;                           // 0x5c8(0x8)
	Class PhrasesRadialDataAsset*                                Phrases;                                           // 0x5d0(0x8)
	Class Object*                                                CachedFirstPersonProxyMesh;                        // 0x5d8(0x8)
	Class Object*                                                CachedThirdPersonProxyMesh;                        // 0x5e0(0x8)
	char                                                         pad0x168_RM6XN[0x168];                             // 0x5e8(0x168)
	class                                                        ItemCategory;                                      // 0x750(0x8)
	Class ItemInfo*                                              ItemInfo;                                          // 0x758(0x8)
	Class InterpolatingItem*                                     InterpolatingItem;                                 // 0x760(0x8)
	char                                                         pad0x18_0G5GV[0x18];                               // 0x768(0x18)
	Class WieldableItemVfxComponent*                             WieldableItemVfxComponent;                         // 0x788(0x8)
	TArray<class MeshComponent*>                                 ThirdPersonExtraMeshes;                            // 0x790(0x10)
	TArray<class MeshComponent*>                                 StashedExtraMeshes;                                // 0x7a0(0x10)
	char                                                         pad0x19_W0CX3[0x19];                               // 0x7b0(0x19)
	bool                                                         OfferingEnabled;                                   // 0x7c9(0x1)
	char                                                         pad0x2_TL717[0x2];                                 // 0x7ca(0x2)
	Struct Guid                                                  QuestId;                                           // 0x7cc(0x10)
	char                                                         pad0x4_C57M3[0x4];                                 // 0x7dc(0x4)
};


// Size 0x0 (Full Size[0x7e0] - InheritedSize[0x7e0]
class SkeletalMeshWieldableItem: public WieldableItem
{
public:
};


// Size 0x0 (Full Size[0x7e0] - InheritedSize[0x7e0]
class LargeSkeletalMeshWieldableItem: public SkeletalMeshWieldableItem
{
public:
};


// Size 0x30 (Full Size[0x810] - InheritedSize[0x7e0]
class MerchantCrate: public LargeSkeletalMeshWieldableItem
{
public:
	Struct MerchantCrateSfx                                      FullCrateSfx;                                      // 0x7e0(0x20)
	char                                                         pad0x10_4I59B[0x10];                               // 0x800(0x10)
};


// Size 0x0 (Full Size[0x7e0] - InheritedSize[0x7e0]
class StaticMeshWieldableItem: public WieldableItem
{
public:
};


// Size 0x0 (Full Size[0x7e0] - InheritedSize[0x7e0]
class LargeStaticMeshWieldableItem: public StaticMeshWieldableItem
{
public:
};


// Size 0x60 (Full Size[0x840] - InheritedSize[0x7e0]
class StaticMerchantCrate: public LargeStaticMeshWieldableItem
{
public:
	Class RewindComponent*                                       RewindComponent;                                   // 0x7e0(0x8)
	Struct MerchantCrateSfx                                      FullCrateSfx;                                      // 0x7e8(0x20)
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectComponent;                   // 0x818(0x8)
	char                                                         pad0x10_0HLYY[0x10];                               // 0x820(0x10)
	bool                                                         RequiresRewindComponent;                           // 0x830(0x1)
	char                                                         pad0xf_3DUYL[0xf];                                 // 0x831(0xf)
};


// Size 0x0 (Full Size[0x828] - InheritedSize[0x828]
class MockMerchantCrateItemProxy: public BaseMerchantCrateItemProxy
{
public:
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class CategoryBase: public Object
{
public:
	Struct FText                                                 Name;                                              // 0x28(0x38)
	struct FName                                                 UniqueTextIdentifier;                              // 0x60(0x8)
	Struct StringAssetReference                                  IconPath;                                          // 0x68(0x10)
};


// Size 0x8 (Full Size[0x80] - InheritedSize[0x78]
class ItemCategory: public CategoryBase
{
public:
	class                                                        NotificationInputId;                               // 0x78(0x8)
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class MerchantCrateCategoryMock: public ItemCategory
{
public:
};


// Size 0x8 (Full Size[0x7b8] - InheritedSize[0x7b0]
class MerchantCrateItemInfoMock: public MerchantCrateItemInfo
{
public:
};


// Size 0x0 (Full Size[0x7b8] - InheritedSize[0x7b8]
class CommonMerchantCrateItemInfoMock: public MerchantCrateItemInfoMock
{
public:
};


// Size 0x0 (Full Size[0x7b8] - InheritedSize[0x7b8]
class RareMerchantCrateItemInfoMock: public MerchantCrateItemInfoMock
{
public:
};


// Size 0x0 (Full Size[0x7b8] - InheritedSize[0x7b8]
class LegendaryMerchantCrateItemInfoMock: public MerchantCrateItemInfoMock
{
public:
};


// Size 0x0 (Full Size[0x7b8] - InheritedSize[0x7b8]
class MythicalMerchantCrateItemInfoMock: public MerchantCrateItemInfoMock
{
public:
};


// Size 0x58 (Full Size[0x120] - InheritedSize[0xc8]
class ItemDesc: public EntitlementDesc
{
public:
	bool                                                         CanBeAddedToLoadout;                               // 0xc8(0x1)
	bool                                                         IsTransient;                                       // 0xc8(0x1)
	char                                                         pad0x7_EHJ3I[0x7];                                 // 0xc9(0x7)
	Struct FString                                               PreviousItem;                                      // 0xd0(0x10)
	Struct FString                                               NextItem;                                          // 0xe0(0x10)
	Struct StringAssetReference                                  IconRadPath;                                       // 0xf0(0x10)
	Struct StringClassReference                                  InstanceClassType;                                 // 0x100(0x10)
	TArray<struct ItemInfoOverrides>                             ItemInfoOverrides;                                 // 0x110(0x10)
};


// Size 0x0 (Full Size[0x120] - InheritedSize[0x120]
class ItemWithoutIconsDesc: public ItemDesc
{
public:
};


// Size 0x0 (Full Size[0x120] - InheritedSize[0x120]
class BootyItemDesc: public ItemWithoutIconsDesc
{
public:
};


// Size 0x0 (Full Size[0x120] - InheritedSize[0x120]
class MerchantCrateItemDescMock: public BootyItemDesc
{
public:
};


// Size 0x18 (Full Size[0x840] - InheritedSize[0x828]
class MerchantCrateFilledItemProxy: public StaticMerchantCrateItemProxy
{
public:
	Class StorageContainerComponent*                             StorageContainerComponent;                         // 0x828(0x8)
	bool                                                         FillCrateToCapacity;                               // 0x830(0x1)
	char                                                         pad0xf_N5GWE[0xf];                                 // 0x831(0xf)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class ClientNotificationsService: public Object
{
public:
};


// Size 0x58 (Full Size[0xf0] - InheritedSize[0x98]
class PlayNpcAnimationStep: public TaleQuestStep
{
public:
	Class BasePlayNpcAnimationStepDesc*                          StepDesc;                                          // 0x98(0x8)
	char                                                         pad0x10_WHP10[0x10];                               // 0xa0(0x10)
	Class NPCDialogComponent*                                    NPCDialogComponent;                                // 0xb0(0x8)
	Class CutSceneActor*                                         CutSceneActor;                                     // 0xb8(0x8)
	char                                                         pad0x30_BHYI5[0x30];                               // 0xc0(0x30)
};


// Size 0x88 (Full Size[0x108] - InheritedSize[0x80]
class BasePlayNpcAnimationStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    PlaceableReaction;                                 // 0x80(0x30)
	Struct QuestVariableActor                                    CutSceneActor;                                     // 0xb0(0x30)
	struct FName                                                 AnimationNameToPlay;                               // 0xe0(0x8)
	float                                                        SubtitleMaxDistance;                               // 0xe8(0x4)
	bool                                                         UseServerDrivenDialogue;                           // 0xec(0x1)
	char                                                         pad0x3_YCQGW[0x3];                                 // 0xed(0x3)
	Class SceneDialogueData*                                     DialogueData;                                      // 0xf0(0x8)
	class                                                        LocalMusicZone;                                    // 0xf8(0x8)
	bool                                                         PreventServerMigration;                            // 0x100(0x1)
	char                                                         pad0x7_BZVZ4[0x7];                                 // 0x101(0x7)
};


// Size 0x68 (Full Size[0x170] - InheritedSize[0x108]
class PlayNpcAnimationStepDesc: public BasePlayNpcAnimationStepDesc
{
public:
	Struct QuestVariableActor                                    TargetNpc;                                         // 0x108(0x30)
	Struct FText                                                 SpeakingActorLocalisableName;                      // 0x138(0x38)
};


// Size 0xa0 (Full Size[0x1a8] - InheritedSize[0x108]
class PlayGroupNpcAnimationStepDesc: public BasePlayNpcAnimationStepDesc
{
public:
	Struct QuestVariableActor                                    TargetNpc1;                                        // 0x108(0x30)
	Struct QuestVariableActor                                    TargetNpc2;                                        // 0x138(0x30)
	Struct QuestVariableActor                                    TargetNpc3;                                        // 0x168(0x30)
	TArray<struct FText>                                         SpeakingActorLocalisableNames;                     // 0x198(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FlamesOfFateSettingsServiceInterface: public Interface
{
public:
};


// Size 0x68 (Full Size[0x468] - InheritedSize[0x400]
class InteractableObject: public InteractableBase
{
public:
	char                                                         pad0x18_VZWMT[0x18];                               // 0x400(0x18)
	Class OneShotInteractableFilterDesc*                         FilterDesc;                                        // 0x418(0x8)
	Struct FText                                                 Verb;                                              // 0x420(0x38)
	char                                                         pad0x10_I9E5C[0x10];                               // 0x458(0x10)
};


// Size 0x390 (Full Size[0x7f8] - InheritedSize[0x468]
class Beacon: public InteractableObject
{
public:
	char                                                         pad0x10_ZVWOS[0x10];                               // 0x468(0x10)
	Class StaticMeshComponent*                                   Mesh;                                              // 0x478(0x8)
	Class ParticleSystemComponent*                               BeaconActiveParticleSystem;                        // 0x480(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x488(0x8)
	bool                                                         EnableParticleSystemTint;                          // 0x490(0x1)
	char                                                         pad0x7_KPGDW[0x7];                                 // 0x491(0x7)
	Class InteractableComponent*                                 InteractableComponent;                             // 0x498(0x8)
	Class Object*                                                ExtinguishedVFX;                                   // 0x4a0(0x8)
	struct FName                                                 WwiseEmitterName;                                  // 0x4a8(0x8)
	Class WwiseEvent*                                            StartLoopFlameSfx;                                 // 0x4b0(0x8)
	Class WwiseEvent*                                            StopLoopFlameSfx;                                  // 0x4b8(0x8)
	Class WwiseEvent*                                            FlameTransferSfx;                                  // 0x4c0(0x8)
	Class WwiseEvent*                                            ExtinguishedSfx;                                   // 0x4c8(0x8)
	Class WwiseObjectPoolWrapper*                                BeaconWwisePool;                                   // 0x4d0(0x8)
	float                                                        InteractionRadius;                                 // 0x4d8(0x4)
	char                                                         pad0x4_YZCRU[0x4];                                 // 0x4dc(0x4)
	Struct FText                                                 TakeFlameTooltipText;                              // 0x4e0(0x38)
	Struct FText                                                 CannotTakeFlameTooltipText;                        // 0x518(0x38)
	Struct FText                                                 LanternNotRaisedToolTipText;                       // 0x550(0x38)
	Struct FText                                                 NotWieldingFlameTooltipText;                       // 0x588(0x38)
	Struct FText                                                 SetFlameTooltipText;                               // 0x5c0(0x38)
	bool                                                         CanTakeFlameFromBeacon;                            // 0x5f8(0x1)
	bool                                                         CanSetFlameOnBeacon;                               // 0x5f9(0x1)
	bool                                                         StartLit;                                          // 0x5fa(0x1)
	byte                                                         StartingType;                                      // 0x5fb(0x1)
	Struct PlayerStat                                            StatToFire;                                        // 0x5fc(0x4)
	TArray<struct StatMap>                                       StatMap;                                           // 0x600(0x10)
	Class CurveLinearColor*                                      ColourChangeCurveFX;                               // 0x610(0x8)
	Class CurveLinearColor*                                      ColourChangeCurveLight;                            // 0x618(0x8)
	bool                                                         CanExtinguish;                                     // 0x620(0x1)
	char                                                         pad0x3_18C6O[0x3];                                 // 0x621(0x3)
	float                                                        ExtinguishFadeTime;                                // 0x624(0x4)
	Struct BeaconData                                            BeaconData;                                        // 0x628(0x2)
	char                                                         pad0x6_ODNR1[0x6];                                 // 0x62a(0x6)
	Class ParticleSystemComponent*                               ExtinguishFXComponent;                             // 0x630(0x8)
	Struct ObjectMessagingDispatcher                             EventDispatcher;                                   // 0x638(0xa0)
	char                                                         pad0x120_475LU[0x120];                             // 0x6d8(0x120)
};


// Size 0xb8 (Full Size[0x8b0] - InheritedSize[0x7f8]
class BrazierMechanismTrigger: public Beacon
{
public:
	Class MechanismTriggerComponent*                             MechanismTrigger;                                  // 0x7f8(0x8)
	byte                                                         FlameTypeToActivate;                               // 0x800(0x1)
	bool                                                         ActivateWithSpecificLantern;                       // 0x801(0x1)
	char                                                         pad0x6_2N8GN[0x6];                                 // 0x802(0x6)
	class                                                        LanternToActivate;                                 // 0x808(0x8)
	Struct FText                                                 LanternNotLitToolTipText;                          // 0x810(0x38)
	Struct FText                                                 CannotSetBeaconToolTipText;                        // 0x848(0x38)
	class                                                        TakeFlameOfFateNotificationID;                     // 0x880(0x8)
	class                                                        SetFlameOfFateNotificationID;                      // 0x888(0x8)
	float                                                        LanternSwingAmmount;                               // 0x890(0x4)
	float                                                        LanternEmissiveAmmount;                            // 0x894(0x4)
	float                                                        LanternMegaEmmisiveAmount;                         // 0x898(0x4)
	char                                                         pad0x4_UVTK6[0x4];                                 // 0x89c(0x4)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0x8a0(0x10)
};


// Size 0x10 (Full Size[0x8c0] - InheritedSize[0x8b0]
class FortOfTheDamnedBrazierMechanismTrigger: public BrazierMechanismTrigger
{
public:
	Class ParticleSystemComponent*                               FOTDBeaconActiveParticleSystem;                    // 0x8b0(0x8)
	bool                                                         IsActiveWaveBrazier;                               // 0x8b8(0x1)
	char                                                         pad0x7_U508Z[0x7];                                 // 0x8b9(0x7)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class Bed: public Actor
{
public:
	Class StaticMeshComponent*                                   BedMeshComponent;                                  // 0x3c8(0x8)
	Class ReplicatedShipPartCustomizationComponent*              CustomizationComponent;                            // 0x3d0(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShipPartDescAsset: public DataAsset
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class BedPartDescAsset: public ShipPartDescAsset
{
public:
	Struct BedPartDesc                                           BedPartDesc;                                       // 0x28(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class BeginBullRushUnarmedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class EelSlapNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class LungeBeginAshenLordUnarmedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SweepLeftAshenLordUnarmedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SweepRightAshenLordUnarmedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BeingRetractedActionStateId: public ActionStateId
{
public:
};


// Size 0x108 (Full Size[0x570] - InheritedSize[0x468]
class Bell: public InteractableObject
{
public:
	Class ReplicatedShipPartCustomizationComponent*              CustomisationComponent;                            // 0x468(0x8)
	Struct BellPlayerStats                                       PlayerStats;                                       // 0x470(0x10)
	Class InteractableComponent*                                 InteractableComponent;                             // 0x480(0x8)
	Class StaticMeshComponent*                                   BellMeshComponent;                                 // 0x488(0x8)
	Class WwiseEvent*                                            BellRingSFX;                                       // 0x490(0x8)
	Class WwiseEvent*                                            BellRingSfxStorm;                                  // 0x498(0x8)
	Struct FText                                                 BellName;                                          // 0x4a0(0x38)
	float                                                        TimeBetweenTurbulenceChecks;                       // 0x4d8(0x4)
	float                                                        MinIntervalBetweenRingsLowerBound;                 // 0x4dc(0x4)
	float                                                        MinIntervalBetweenRingsUpperBound;                 // 0x4e0(0x4)
	float                                                        MaxIntervalBetweenRingsLowerBound;                 // 0x4e4(0x4)
	float                                                        MaxIntervalBetweenRingsUpperBound;                 // 0x4e8(0x4)
	char                                                         pad0x4_D3ER9[0x4];                                 // 0x4ec(0x4)
	Class WwiseObjectPoolWrapper*                                BellPool;                                          // 0x4f0(0x8)
	Struct Vector                                                EmitterOffset;                                     // 0x4f8(0xc)
	char                                                         pad0x4_V2X5H[0x4];                                 // 0x504(0x4)
	Class MaterialInstanceDynamic*                               BellDynamicMaterial;                               // 0x508(0x8)
	int                                                          BellMaterialIndex;                                 // 0x510(0x4)
	char                                                         pad0x5c_5TKGX[0x5c];                               // 0x514(0x5c)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class BellDescAsset: public ShipPartDescAsset
{
public:
	Struct BellDesc                                              BellDesc;                                          // 0x28(0x18)
};


// Size 0x20 (Full Size[0x300] - InheritedSize[0x2e0]
class AtmosphericPressureZoneComponent: public SceneComponent
{
public:
	char                                                         pad0x8_PJTE2[0x8];                                 // 0x2e0(0x8)
	Struct AtmosphericPressureZoneParameters                     PressureZoneParameters;                            // 0x2e8(0x14)
	char                                                         pad0x4_S1RSW[0x4];                                 // 0x2fc(0x4)
};


// Size 0x20 (Full Size[0x320] - InheritedSize[0x300]
class BlendedAtmosphericPressureZoneComponent: public AtmosphericPressureZoneComponent
{
public:
	Class CurveFloat*                                            WeightFadeCurveNormalised;                         // 0x300(0x8)
	Class CurveFloat*                                            RadiusFadeCurveNormalised;                         // 0x308(0x8)
	char                                                         pad0x10_AREPD[0x10];                               // 0x310(0x10)
};


// Size 0xf0 (Full Size[0x930] - InheritedSize[0x840]
class BlendedPostProcessingZoneComponentBase: public PostProcessComponent
{
public:
	char                                                         pad0x10_X451J[0x10];                               // 0x840(0x10)
	Class CurveFloat*                                            FadeCurveNormalised;                               // 0x850(0x8)
	float                                                        BlendDistance;                                     // 0x858(0x4)
	char                                                         pad0xd4_PIWBO[0xd4];                               // 0x85c(0xd4)
};


// Size 0x0 (Full Size[0x930] - InheritedSize[0x930]
class BlendedPostProcessingRainZoneComponent: public BlendedPostProcessingZoneComponentBase
{
public:
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class BlinkStrafeComponent: public ActorComponent
{
public:
	Class AthenaAICharacter*                                     Character;                                         // 0xc8(0x8)
	Class AthenaAIControllerBase*                                OwnerAIController;                                 // 0xd0(0x8)
	char                                                         pad0x8_M094M[0x8];                                 // 0xd8(0x8)
	bool                                                         ShouldBlink;                                       // 0xe0(0x1)
	char                                                         pad0x7_VT3ZL[0x7];                                 // 0xe1(0x7)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class BloatingStatus: public StatusBase
{
public:
};


// Size 0x10 (Full Size[0x70] - InheritedSize[0x60]
class BlockEarthquakeTaleQuestService: public TaleQuestService
{
public:
	Class BlockEarthquakeTaleQuestServiceDesc*                   Desc;                                              // 0x60(0x8)
	char                                                         pad0x8_UTEC0[0x8];                                 // 0x68(0x8)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
