#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x20
struct LobbySetupChangedEvent
{
public:
	char                                                         pad0x20_TKL8T[0x20];                               // 0x0(0x20)
};


// Size 0x8
struct EventMeleeAttackStarted
{
public:
	class MeleeAttackDataAsset*                                  AttackData;                                        // 0x0(0x8)
};


// Size 0x18
struct ProcessableActions
{
public:
	char                                                         CurrentStatus;                                     // 0x0(0x1)
	char                                                         pad0x7_7VY5D[0x7];                                 // 0x1(0x7)
	double                                                       StartTime;                                         // 0x8(0x8)
	int                                                          ActionIndex;                                       // 0x10(0x4)
	char                                                         pad0x4_DOAWY[0x4];                                 // 0x14(0x4)
};


// Size 0x20
struct PlayerModerationReportingPlayerDetails
{
public:
	struct FString                                               Gamertag;                                          // 0x0(0x10)
	struct FString                                               Xuid;                                              // 0x10(0x10)
};


// Size 0xc
struct RewardIdCount
{
public:
	struct FName                                                 RewardId;                                          // 0x0(0x8)
	int                                                          Count;                                             // 0x8(0x4)
};


// Size 0x18
struct CategoryDefaultsUnit
{
public:
	TArray<String>                                               PartialStrings;                                    // 0x0(0x10)
	class UClass*                                                Category;                                          // 0x10(0x8)
};


// Size 0x18
struct SetMapTypeOnRadialInventorySlot
{
public:
	int                                                          SlotIndex;                                         // 0x0(0x4)
	char                                                         QuestMapIcon;                                      // 0x4(0x1)
	char                                                         pad0x3_J3KQO[0x3];                                 // 0x5(0x3)
	struct FString                                               BackgroundImageUrl;                                // 0x8(0x10)
};


// Size 0x70
struct ActionSequenceSingleInteractionConditionParam
{
public:
	bool                                                         AlwaysFail;                                        // 0x0(0x1)
	char                                                         pad0x7_JBA6V[0x7];                                 // 0x1(0x7)
	struct ConditionInstance                                     Condition;                                         // 0x8(0x20)
	bool                                                         StillAllowInteraction;                             // 0x28(0x1)
	char                                                         pad0x7_LGGC6[0x7];                                 // 0x29(0x7)
	struct FText                                                 FailedConditionDescriptorVerb;                     // 0x30(0x38)
	bool                                                         ResetInteractionsOnFail;                           // 0x68(0x1)
	char                                                         pad0x3_YK1ZI[0x3];                                 // 0x69(0x3)
	float                                                        TimeBeforeInteractionReenabled;                    // 0x6c(0x4)
};


// Size 0x30
struct AthenaAnimationMapTable
{
public:
	TArray<class AnimSequence*>                                  Into;                                              // 0x0(0x10)
	TArray<class AnimSequence*>                                  IdleCycle;                                         // 0x10(0x10)
	TArray<class AnimSequence*>                                  Outof;                                             // 0x20(0x10)
};


// Size 0x1
struct RequestOpenShipCustomizationSelectionScreenEvent
{
public:
	char                                                         pad0x1_FMVT2[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct EventSetMountpointLocationInUseForUI
{
public:
	char                                                         pad0x38_99LCH[0x38];                               // 0x0(0x38)
};


// Size 0x48
struct AthenaAnimationHitReactsSelectedAnimations
{
public:
	class BlendSpace1D*                                          SelectedHitReact0;                                 // 0x0(0x8)
	class BlendSpace1D*                                          SelectedHitReactItem0;                             // 0x8(0x8)
	class BlendSpace1D*                                          SelectedHitReactItemAction0;                       // 0x10(0x8)
	class BlendSpace1D*                                          SelectedHitReactSubtle0;                           // 0x18(0x8)
	class BlendSpace1D*                                          SelectedHitReact1;                                 // 0x20(0x8)
	class BlendSpace1D*                                          SelectedHitReactItem1;                             // 0x28(0x8)
	class BlendSpace1D*                                          SelectedHitReactItemAction1;                       // 0x30(0x8)
	class BlendSpace1D*                                          SelectedHitReactSubtle1;                           // 0x38(0x8)
	class BlendSpace1D*                                          SelectedOverrideHitReact;                          // 0x40(0x8)
};


// Size 0x1
struct BootFlowLocaleRefreshUIStateEvent
{
public:
	char                                                         pad0x1_AKC5P[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct AthenaAnimationWheelArmOverlayAnimData
{
public:
	class BlendSpace1D*                                          ArmLower;                                          // 0x0(0x8)
	class BlendSpace1D*                                          ArmRaise;                                          // 0x8(0x8)
};


// Size 0x30
struct QuestVariableContestIslandArchetype
{
public:
	char                                                         pad0x30_T490Q[0x30];                               // 0x0(0x30)
};


// Size 0x1
struct QuestTableShipState
{
public:
	bool                                                         HasLoot;                                           // 0x0(0x1)
};


// Size 0x10
struct CrewIdWrapper
{
public:
	struct FString                                               CrewId;                                            // 0x0(0x10)
};


// Size 0x18
struct AthenaAnimationWheelTurnsAnimData
{
public:
	class AnimSequence*                                          Turn;                                              // 0x0(0x8)
	class AnimSequence*                                          TurnFast;                                          // 0x8(0x8)
	class AnimSequence*                                          TurnFast180;                                       // 0x10(0x8)
};


// Size 0x20
struct FishAnimationSwimmingLoopAnimations
{
public:
	class AnimMontage*                                           IdleLoopEndingForwards;                            // 0x0(0x8)
	class AnimMontage*                                           IdleLoopEndingRight;                               // 0x8(0x8)
	class AnimMontage*                                           IdleLoopEndingLeft;                                // 0x10(0x8)
	class AnimMontage*                                           IdleLoopEndingBackwards;                           // 0x18(0x8)
};


// Size 0x1
struct PersistenceModel
{
public:
	char                                                         pad0x1_Z2D7Q[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct WaitForLoadingScreenTelemetryEvent
{
public:
	struct FString                                               OldStateName;                                      // 0x0(0x10)
	struct FString                                               NewStateName;                                      // 0x10(0x10)
	float                                                        OldStateDuration;                                  // 0x20(0x4)
	char                                                         pad0x4_AQPZB[0x4];                                 // 0x24(0x4)
	struct FString                                               ActiveExperiments;                                 // 0x28(0x10)
};


// Size 0x1
struct GameNarrationActivityChangedEvent
{
public:
	bool                                                         IsActive;                                          // 0x0(0x1)
};


// Size 0x30
struct HasRankCondition
{
public:
	char                                                         pad0x28_82SDN[0x28];                               // 0x0(0x28)
	class UClass*                                                Rank;                                              // 0x28(0x8)
};


// Size 0x60
struct CapturedByKrakenActionStateConstructionInfo
{
public:
	char                                                         pad0x48_VIJU1[0x48];                               // 0x0(0x48)
	struct NetActorPtr                                           Tentacle;                                          // 0x48(0x14)
	char                                                         pad0x4_JPCYA[0x4];                                 // 0x5c(0x4)
};


// Size 0x30
struct LaunchableShotActionStartTelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	struct Vector                                                ProjectileSpawnLocation;                           // 0x10(0xc)
	char                                                         pad0x4_64YMD[0x4];                                 // 0x1c(0x4)
	struct FString                                               ProjectileImpactId;                                // 0x20(0x10)
};


// Size 0x8
struct EventPickupableObjectDestroyed
{
public:
	class PickupableObject*                                      PickupableObject;                                  // 0x0(0x8)
};


// Size 0xd8
struct FishingFishSelector
{
public:
	class AvailableFishForSpawning*                              AvailableFish;                                     // 0x0(0x8)
	char                                                         pad0xa8_1YLSO[0xa8];                               // 0x8(0xa8)
	TArray<class FishSpawnParamsDataAsset*>                      SelectedFishCache;                                 // 0xb0(0x10)
	class Object*                                                Root;                                              // 0xc0(0x8)
	class FishSpawnParamsDataAsset*                              GatheredConditions;                                // 0xc8(0x8)
	class VoyageLocationOnlyNamedIslandListDataAsset*            GatheredIsland;                                    // 0xd0(0x8)
};


// Size 0x20
struct BountyQuestTargetKilledTelemetryEvent
{
public:
	struct FString                                               BountyTargetName;                                  // 0x0(0x10)
	struct Guid                                                  BootyId;                                           // 0x10(0x10)
};


// Size 0x70
struct MeshAnimatorInstance
{
public:
	char                                                         pad0x60_SLF2X[0x60];                               // 0x0(0x60)
	TArray<class MeshComponent*>                                 Meshes;                                            // 0x60(0x10)
};


// Size 0x1
struct VoyageFailedTelemetryEvent
{
public:
	char                                                         pad0x1_1VYK9[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ClientOptedIntoMarketingTelemetryEvent
{
public:
	char                                                         pad0x1_EY8W0[0x1];                                 // 0x0(0x1)
};


// Size 0x80
struct MovedByPortableHarpoonRetractionActionStateConstructionInfo
{
public:
	char                                                         pad0x80_BI50Q[0x80];                               // 0x0(0x80)
};


// Size 0x1
struct ApproachedPlayerGeneratedMapsContainer
{
public:
	char                                                         pad0x1_TVJNM[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventApplicationStartRequest
{
public:
	char                                                         pad0x1_D9AD3[0x1];                                 // 0x0(0x1)
};


// Size 0x210
struct HangingActionStateParams
{
public:
	char                                                         pad0x18_W8KYP[0x18];                               // 0x0(0x18)
	char                                                         ControllableObjectType;                            // 0x18(0x1)
	char                                                         pad0x7_Z0ABQ[0x7];                                 // 0x19(0x7)
	class UClass*                                                HangingAnimationId;                                // 0x20(0x8)
	bool                                                         AllowInteractWithOtherObjectsWhileSitting;         // 0x28(0x1)
	char                                                         pad0x7_1VFB9[0x7];                                 // 0x29(0x7)
	TArray<class Class*>                                         AllowedInteractableTypes;                          // 0x30(0x10)
	TArray<class Class*>                                         AllowedInteractionNotificationInputIds;            // 0x40(0x10)
	bool                                                         DisableDisengageInput;                             // 0x50(0x1)
	bool                                                         ThirdPersonCameraEnabled;                          // 0x51(0x1)
	char                                                         pad0x6_Z3GR7[0x6];                                 // 0x52(0x6)
	class AthenaSpringArmComponentParams*                        ThirdPersonCameraParams;                           // 0x58(0x8)
	struct Vector                                                FemaleDefaultOffset;                               // 0x60(0xc)
	struct Rotator                                               FemaleDefaultRotation;                             // 0x6c(0xc)
	struct Vector                                                MaleDefaultOffset;                                 // 0x78(0xc)
	struct Rotator                                               MaleDefaultRotation;                               // 0x84(0xc)
	struct Vector                                                FemaleLargeOffset;                                 // 0x90(0xc)
	struct Rotator                                               FemaleLargeRotation;                               // 0x9c(0xc)
	struct Vector                                                MaleLargeOffset;                                   // 0xa8(0xc)
	struct Rotator                                               MaleLargeRotation;                                 // 0xb4(0xc)
	struct Vector                                                FemaleLargeAthleticOffset;                         // 0xc0(0xc)
	struct Rotator                                               FemaleLargeAthleticRotation;                       // 0xcc(0xc)
	struct Vector                                                MaleLargeAthleticOffset;                           // 0xd8(0xc)
	struct Rotator                                               MaleLargeAthleticRotation;                         // 0xe4(0xc)
	struct Vector                                                FemaleAthleticOffset;                              // 0xf0(0xc)
	struct Rotator                                               FemaleAthleticRotation;                            // 0xfc(0xc)
	struct Vector                                                MaleAthleticOffset;                                // 0x108(0xc)
	struct Rotator                                               MaleAthleticRotation;                              // 0x114(0xc)
	struct Vector                                                FemaleThinAthleticOffset;                          // 0x120(0xc)
	struct Rotator                                               FemaleThinAthleticRotation;                        // 0x12c(0xc)
	struct Vector                                                MaleThinAthleticOffset;                            // 0x138(0xc)
	struct Rotator                                               MaleThinAthleticRotation;                          // 0x144(0xc)
	struct Vector                                                FemaleThinOffset;                                  // 0x150(0xc)
	struct Rotator                                               FemaleThinRotation;                                // 0x15c(0xc)
	struct Vector                                                MaleThinOffset;                                    // 0x168(0xc)
	struct Rotator                                               MaleThinRotation;                                  // 0x174(0xc)
	struct Vector                                                FemaleThinUnfitOffset;                             // 0x180(0xc)
	struct Rotator                                               FemaleThinUnfitRotation;                           // 0x18c(0xc)
	struct Vector                                                MaleThinUnfitOffset;                               // 0x198(0xc)
	struct Rotator                                               MaleThinUnfitRotation;                             // 0x1a4(0xc)
	struct Vector                                                FemaleUnfitOffset;                                 // 0x1b0(0xc)
	struct Rotator                                               FemaleUnfitRotation;                               // 0x1bc(0xc)
	struct Vector                                                MaleUnfitOffset;                                   // 0x1c8(0xc)
	struct Rotator                                               MaleUnfitRotation;                                 // 0x1d4(0xc)
	struct Vector                                                FemaleLargeUnfitOffset;                            // 0x1e0(0xc)
	struct Rotator                                               FemaleLargeUnfitRotation;                          // 0x1ec(0xc)
	struct Vector                                                MaleLargeUnfitOffset;                              // 0x1f8(0xc)
	struct Rotator                                               MaleLargeUnfitRotation;                            // 0x204(0xc)
};


// Size 0x68
struct CaptainsLogInteractableActionStateConstructionInfo
{
public:
	char                                                         pad0x68_7FOB1[0x68];                               // 0x0(0x68)
};


// Size 0x10
struct BedPartDesc
{
public:
	class MaterialInterface*                                     BedMaterial;                                       // 0x0(0x8)
	class MaterialInterface*                                     DrapesMaterial;                                    // 0x8(0x8)
};


// Size 0x40
struct StandingSpyglassAudioParams
{
public:
	class WwiseObjectPoolWrapper*                                WwisePool;                                         // 0x0(0x8)
	struct FName                                                 WwiseEmitterName;                                  // 0x8(0x8)
	char                                                         pad0x20_86VKR[0x20];                               // 0x10(0x20)
	class WwiseEvent*                                            OnDockedEvent;                                     // 0x30(0x8)
	class WwiseEvent*                                            UnDockedEvent;                                     // 0x38(0x8)
};


// Size 0x18
struct ActionStateHistoryTelemetryFragment
{
public:
	struct JsonObjectWrapper                                     Json;                                              // 0x0(0x18)
};


// Size 0x1
struct TeardownAndReloadUICompleted
{
public:
	char                                                         pad0x1_UYDC3[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct GamertagsRequestEvent
{
public:
	TArray<String>                                               XUIDs;                                             // 0x0(0x10)
	struct FString                                               Id;                                                // 0x10(0x10)
};


// Size 0x28
struct CampfireStateData
{
public:
	char                                                         pad0x20_AHUZT[0x20];                               // 0x0(0x20)
	bool                                                         IsBuilt;                                           // 0x20(0x1)
	bool                                                         IsOnFire;                                          // 0x21(0x1)
	bool                                                         IsPartiallyBurned;                                 // 0x22(0x1)
	char                                                         pad0x5_BJ16W[0x5];                                 // 0x23(0x5)
};


// Size 0x10
struct IndefiniteDoorLockEntry
{
public:
	class Controller*                                            Controller;                                        // 0x0(0x8)
	class Object*                                                Owner;                                             // 0x8(0x8)
};


// Size 0x1
struct DartProxyDrenchedEvent
{
public:
	char                                                         pad0x1_V1SGY[0x1];                                 // 0x0(0x1)
};


// Size 0xc
struct AthenaAnimationFirstPersonTurnDelay
{
public:
	float                                                        MaxAngle;                                          // 0x0(0x4)
	float                                                        DelayOutSpeed;                                     // 0x4(0x4)
	float                                                        DelayInSpeed;                                      // 0x8(0x4)
};


// Size 0x1
struct EventFaunaAnimationSnakeInCharmStance
{
public:
	bool                                                         SnakeInCharmStance;                                // 0x0(0x1)
};


// Size 0x20
struct WieldableItemFirstTimeEquipRpc
{
public:
	char                                                         pad0x18_CWX3M[0x18];                               // 0x0(0x18)
	class WwiseEvent*                                            FirstTimeEquipSfx;                                 // 0x18(0x8)
};


// Size 0x1
struct PlayerLeftPremiumStoreEvent
{
public:
	char                                                         pad0x1_MSGX8[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct NetPerformanceMonitorHeartbeat
{
public:
	char                                                         pad0x1_P2Z4T[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct StreamedLevelData
{
public:
	char                                                         StreamedLevelIdentity;                             // 0x0(0x1)
	char                                                         pad0x3_1AHOV[0x3];                                 // 0x1(0x3)
	int                                                          StreamedLevelId;                                   // 0x4(0x4)
	TArray<class SpawnLocation*>                                 ExitPointsFromSpawnedLevel;                        // 0x8(0x10)
	TArray<class SpawnLocation*>                                 ExitPointsFromEntrance;                            // 0x18(0x10)
};


// Size 0x30
struct OtherPartyTelemetryFragment
{
public:
	struct FString                                               OtherPartyType;                                    // 0x0(0x10)
	struct FString                                               OtherPartyId;                                      // 0x10(0x10)
	double                                                       OtherPartySecondsSinceSpawned;                     // 0x28(0x8)
};


// Size 0x1
struct PirateProfiles_DeletionErrorEvent
{
public:
	char                                                         pad0x1_A788Q[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct HuntersCrySuccessEvent
{
public:
	char                                                         pad0x1_ZPWS9[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct CrewCostumeEntitlementHelpers
{
public:
	char                                                         pad0x1_C7AWY[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct UIPremiumStoreOpenTelemetryEvent
{
public:
	bool                                                         IsFrontend;                                        // 0x0(0x1)
	char                                                         pad0x7_R0PTE[0x7];                                 // 0x1(0x7)
	struct FString                                               SessionId;                                         // 0x8(0x10)
};


// Size 0x1
struct ForceGameEventSchedulerServiceRefreshMessage
{
public:
	char                                                         pad0x1_AD2L5[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct JoinSessionFailedEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x3f0
struct AthenaAnimationFishing
{
public:
	bool                                                         AnimationOverride;                                 // 0x0(0x1)
	char                                                         pad0x3cf_VHXU2[0x3cf];                             // 0x1(0x3cf)
	class Actor*                                                 FishingRodActor;                                   // 0x3d0(0x8)
	class Actor*                                                 FishingFloat;                                      // 0x3d8(0x8)
	class AthenaAnimationInstance*                               OwningAnimationInstance;                           // 0x3e0(0x8)
	char                                                         pad0x8_KYFFG[0x8];                                 // 0x3e8(0x8)
};


// Size 0x28
struct GameEventSettingsInfo
{
public:
	struct FString                                               GameEventTypeRef;                                  // 0x0(0x10)
	TArray<String>                                               ExcludedGlobalEvents;                              // 0x10(0x10)
	int                                                          RegenIntervalOverride;                             // 0x20(0x4)
	char                                                         pad0x4_6KB46[0x4];                                 // 0x24(0x4)
};


// Size 0x1
struct PageUpUniversalDescriptorEvent
{
public:
	char                                                         pad0x1_WWAD2[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct EventPlayerAddedToCrew
{
public:
	char                                                         pad0x10_83U9K[0x10];                               // 0x0(0x10)
	class PlayerState*                                           UniqueId;                                          // 0x10(0x8)
};


// Size 0x10
struct NPCDialogCustomLookAtInfo
{
public:
	struct FName                                                 OptionalSocketName;                                // 0x0(0x8)
	class SceneComponent*                                        TargetLookAtComponent;                             // 0x8(0x8)
};


// Size 0x40
struct VoyageGeneratorSimBlackboard
{
public:
	char                                                         pad0x40_DOC9C[0x40];                               // 0x0(0x40)
};


// Size 0x30
struct ActionSequenceInteractableAudioParams
{
public:
	TArray<class WwiseEvent*>                                    InteractionStartedWwiseEvents;                     // 0x0(0x10)
	TArray<class WwiseEvent*>                                    InteractionCompletedWwiseEvents;                   // 0x10(0x10)
	TArray<class WwiseEvent*>                                    StopInteractionWwiseEvents;                        // 0x20(0x10)
};


// Size 0x20
struct ClientScheduleShutdownNetworkEvent
{
public:
	char                                                         pad0x20_O6K00[0x20];                               // 0x0(0x20)
};


// Size 0x78
struct AthenaAnimationAsyncLoadedFacialActionAnimations
{
public:
	char                                                         pad0x8_8S7ZT[0x8];                                 // 0x0(0x8)
	TArray<Class>                                                PrimaryContinuous;                                 // 0x8(0x10)
	TArray<Class>                                                SecondaryContinuous;                               // 0x18(0x10)
	TArray<Class>                                                PrimaryOneShot;                                    // 0x28(0x10)
	TArray<Class>                                                SecondaryOneShot;                                  // 0x38(0x10)
	TArray<Class>                                                MeleeBlocking;                                     // 0x48(0x10)
	TArray<Class>                                                MeleeAttack;                                       // 0x58(0x10)
	TArray<Class>                                                MeleeBlockReact;                                   // 0x68(0x10)
};


// Size 0x1
struct EventToggleScrambleGamertags
{
public:
	char                                                         pad0x1_M24BK[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct LandmarkTreasureLocationEntry
{
public:
	struct FString                                               LandmarkName;                                      // 0x0(0x10)
	TArray<struct Vector>                                        Locations;                                         // 0x10(0x10)
};


// Size 0x10
struct RequestClearClothingCategoryPiratePreviewEvent
{
public:
	TArray<class Class*>                                         ClothingCategories;                                // 0x0(0x10)
};


// Size 0x1
struct ReapersMarkUpdateVoyageProgress
{
public:
	char                                                         pad0x1_6OG45[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct StorageContainerLimit
{
public:
	class UClass*                                                Category;                                          // 0x0(0x8)
	int                                                          Cap;                                               // 0x8(0x4)
	char                                                         pad0x4_HMZI2[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct GpuCrashTelemetryEvent
{
public:
	struct FString                                               Description;                                       // 0x0(0x10)
};


// Size 0x40
struct ShowJupiterAccountLinkingPrompt
{
public:
	struct FString                                               JupiterUsername;                                   // 0x0(0x10)
	struct FString                                               FullUrl;                                           // 0x10(0x10)
	struct FString                                               DisplayUrl;                                        // 0x20(0x10)
	struct FString                                               Code;                                              // 0x30(0x10)
};


// Size 0x1
struct EventCannonAimingStoppedPitch
{
public:
	bool                                                         IsAtEnd;                                           // 0x0(0x1)
};


// Size 0x50
struct MeshMemoryConstraintTelemetryBudgetFragment
{
public:
	struct FString                                               Budget;                                            // 0x0(0x10)
	int                                                          MemoryUsedInBytes;                                 // 0x10(0x4)
	int                                                          MinimumGuaranteeMemoryUsedInBytes;                 // 0x14(0x4)
	int                                                          NumUniqueMeshes;                                   // 0x18(0x4)
	int                                                          NumTotalMeshes;                                    // 0x1c(0x4)
	int                                                          NumUniqueMeshesUsingFallback;                      // 0x20(0x4)
	int                                                          NumTotalMeshesUsingFallback;                       // 0x24(0x4)
	int                                                          MemoryUsedOfNoFallbackMeshesInBytes;               // 0x28(0x4)
	int                                                          NumUniqueNoFallbackMeshes;                         // 0x2c(0x4)
	int                                                          NumTotalNoFallbackMeshes;                          // 0x30(0x4)
	char                                                         pad0x4_M7HVR[0x4];                                 // 0x34(0x4)
	struct JsonObjectWrapper                                     RegisteredMeshes;                                  // 0x38(0x18)
};


// Size 0x20
struct SkeletonCampConstellationPuzzleTelemetryEvent
{
public:
	struct FString                                               CampLocation;                                      // 0x0(0x10)
	struct DateTime                                              StartTime;                                         // 0x10(0x8)
	struct DateTime                                              EndTime;                                           // 0x18(0x8)
};


// Size 0x48
struct ShipHullAudioData
{
public:
	struct WwiseEmitter                                          Emitter;                                           // 0x0(0x20)
	class WwiseObjectPoolWrapper*                                WwiseObjectPoolWrapper;                            // 0x20(0x8)
	class WwiseEvent*                                            WwiseEvent;                                        // 0x28(0x8)
	struct FName                                                 Name;                                              // 0x30(0x8)
	struct Vector                                                Offset;                                            // 0x38(0xc)
	bool                                                         SetRTPC_Pitch;                                     // 0x44(0x1)
	bool                                                         SetRTPC_Roll;                                      // 0x44(0x1)
	bool                                                         SetRTPC_Velocity;                                  // 0x44(0x1)
	char                                                         pad0x3_N0RET[0x3];                                 // 0x45(0x3)
};


// Size 0x1
struct EventRevealableHidden
{
public:
	char                                                         pad0x1_L7SSF[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct QuestVariableShipwreck
{
public:
	char                                                         pad0x30_4IEVH[0x30];                               // 0x0(0x30)
};


// Size 0xf0
struct ChestEntitlementViewModel
{
public:
	char                                                         Action;                                            // 0x0(0x1)
	char                                                         pad0x7_37HC4[0x7];                                 // 0x1(0x7)
	struct FString                                               ItemDesc;                                          // 0x8(0x10)
	struct FString                                               Name;                                              // 0x18(0x10)
	struct FString                                               ThumbnailImageUrl;                                 // 0x28(0x10)
	struct FString                                               PreviewImageUrl;                                   // 0x38(0x10)
	struct FString                                               Description;                                       // 0x48(0x10)
	int                                                          SlotId;                                            // 0x58(0x4)
	char                                                         pad0x4_ZJRX4[0x4];                                 // 0x5c(0x4)
	struct FString                                               Category;                                          // 0x60(0x10)
	struct FString                                               EmoteBackgroundImageUrl;                           // 0x70(0x10)
	struct FString                                               EmoteIconImageUrl;                                 // 0x80(0x10)
	bool                                                         DoesPlayerOwnEntitlement;                          // 0x90(0x1)
	char                                                         pad0x7_OC408[0x7];                                 // 0x91(0x7)
	struct FString                                               Cost;                                              // 0x98(0x10)
	bool                                                         IsLocked;                                          // 0xa8(0x1)
	char                                                         pad0x7_X0EJH[0x7];                                 // 0xa9(0x7)
	TArray<String>                                               PreviewDescriptions;                               // 0xb0(0x10)
	TArray<String>                                               LockedDescriptions;                                // 0xc0(0x10)
	struct FString                                               Identifier;                                        // 0xd0(0x10)
	struct FString                                               RadialEquipType;                                   // 0xe0(0x10)
};


// Size 0x58
struct UseMountedWeaponActionStateParams
{
public:
	char                                                         pad0x18_JI0PT[0x18];                               // 0x0(0x18)
	float                                                        CameraDockTime;                                    // 0x18(0x4)
	char                                                         pad0x4_3HWBO[0x4];                                 // 0x1c(0x4)
	class ForceFeedbackEffect*                                   FireForceFeedbackEffect;                           // 0x20(0x8)
	class UClass*                                                FireCameraShake;                                   // 0x28(0x8)
	class UClass*                                                FireInputId;                                       // 0x30(0x8)
	TArray<class Class*>                                         AimYawInputId;                                     // 0x38(0x10)
	TArray<class Class*>                                         AimPitchInputId;                                   // 0x48(0x10)
};


// Size 0x38
struct DeferredBakedDecal
{
public:
	char                                                         pad0x38_30IGU[0x38];                               // 0x0(0x38)
};


// Size 0x10
struct QuestPageListPopulator
{
public:
	TArray<class QuestBookPageList*>                             PageListsToUpdate;                                 // 0x0(0x10)
};


// Size 0x18
struct ConfigurationRemoteServiceRequestConfigurationResultEvent
{
public:
	char                                                         pad0x18_D1ICF[0x18];                               // 0x0(0x18)
};


// Size 0x30
struct PlayerCompanyProgress
{
public:
	struct FName                                                 CompanyId;                                         // 0x0(0x8)
	struct FString                                               Sig;                                               // 0x20(0x10)
};


// Size 0x18
struct GetLinkedXuidFromPSNIdRequestModel
{
public:
	TArray<String>                                               PsnIds;                                            // 0x0(0x10)
	int                                                          PsnIssuerId;                                       // 0x10(0x4)
	char                                                         pad0x4_XPDUA[0x4];                                 // 0x14(0x4)
};


// Size 0xa0
struct ShipDynamics
{
public:
	bool                                                         bProcessSailBasedFakeRoll;                         // 0x0(0x1)
	char                                                         pad0x3_FFG5Q[0x3];                                 // 0x1(0x3)
	float                                                        SidewaysForceFromSailsForMaxFakeRoll;              // 0x4(0x4)
	float                                                        BuoyancyProbeZOffsetAtMaxFakeRoll;                 // 0x8(0x4)
	float                                                        MinHullSubmersionToApplyNoHullDragOrRudder;        // 0xc(0x4)
	float                                                        CapsizedAngleThreshold;                            // 0x10(0x4)
	char                                                         pad0x8c_4U8WZ[0x8c];                               // 0x14(0x8c)
};


// Size 0x10
struct WeightedPetAnimation
{
public:
	class AnimSequence*                                          Animation;                                         // 0x0(0x8)
	float                                                        Weighting;                                         // 0x8(0x4)
	char                                                         pad0x4_YHW67[0x4];                                 // 0xc(0x4)
};


// Size 0x38
struct ScoreboardItems
{
public:
	struct FString                                               Icon;                                              // 0x0(0x10)
	struct FString                                               CrewName;                                          // 0x10(0x10)
	struct FString                                               Score;                                             // 0x20(0x10)
	bool                                                         IsMyCrew;                                          // 0x30(0x1)
	char                                                         pad0x7_3D4XU[0x7];                                 // 0x31(0x7)
};


// Size 0x98
struct EventCrewsDisbandedAlliance
{
public:
	char                                                         pad0x98_VW27J[0x98];                               // 0x0(0x98)
};


// Size 0x48
struct ReapersChestStateChangedTelemetryEvent
{
public:
	struct Guid                                                  ChestBootyID;                                      // 0x0(0x10)
	struct FString                                               ChestState;                                        // 0x10(0x10)
	struct Guid                                                  AlliedCrewID;                                      // 0x20(0x10)
	struct Vector                                                WorldLocation;                                     // 0x30(0xc)
	struct Vector                                                RelativeShipLocation;                              // 0x3c(0xc)
};


// Size 0x1
struct RowboatStartedSinkingEvent
{
public:
	char                                                         pad0x1_OPTZ0[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct ClientNPCDialogBeganTelemetryEvent
{
public:
	struct Guid                                                  NPCInteractionSessionId;                           // 0x0(0x10)
	struct FString                                               NPCDialogTreeDataAsset;                            // 0x10(0x10)
	struct FString                                               NPCInteracted;                                     // 0x20(0x10)
	struct FString                                               NPCInteractedType;                                 // 0x30(0x10)
};


// Size 0x10
struct DockToObjectActionStateParams
{
public:
	float                                                        DockTime;                                          // 0x0(0x4)
	float                                                        DelayAfterDockingTime;                             // 0x4(0x4)
	float                                                        ForcedFieldOfView;                                 // 0x8(0x4)
	bool                                                         ForceStash;                                        // 0xc(0x1)
	char                                                         pad0x3_AE8YN[0x3];                                 // 0xd(0x3)
};


// Size 0x1
struct EnableDefaultStormsGameServerRequestModel
{
public:
	bool                                                         Enable;                                            // 0x0(0x1)
};


// Size 0x1
struct SecondaryInteractableAvailableEvent
{
public:
	char                                                         pad0x1_H3ZAC[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct SpawnCommandsAIForm
{
public:
	struct FName                                                 AIClassName;                                       // 0x0(0x8)
	TArray<class AthenaAIFormDataAsset*>                         Forms;                                             // 0x8(0x10)
	class AthenaAIFormDataAsset*                                 DefaultForm;                                       // 0x18(0x8)
};


// Size 0x30
struct ConfigurationComboAndTrigger
{
public:
	TArray<int>                                                  RequiredConfigurationCombo;                        // 0x0(0x10)
	class Actor*                                                 TriggerToActivate;                                 // 0x10(0x8)
	TArray<class Actor*>                                         TriggeredActionMechanisms;                         // 0x18(0x10)
	char                                                         ActivatedMechanismType;                            // 0x28(0x1)
	char                                                         pad0x7_63F2G[0x7];                                 // 0x29(0x7)
};


// Size 0x1
struct EventPlayerExittedSleepingState
{
public:
	bool                                                         NoFarting;                                         // 0x0(0x1)
};


// Size 0x1
struct EventBlocked
{
public:
	char                                                         pad0x1_YGF1H[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct BootyItemTransferredToVendor
{
public:
	class BootyItemInfo*                                         ItemInfo;                                          // 0x0(0x8)
	struct Guid                                                  CrewId;                                            // 0x8(0x10)
};


// Size 0x2
struct RequestLobbyUIEvent
{
public:
	char                                                         SessionType;                                       // 0x0(0x1)
	char                                                         SessionVisibility;                                 // 0x1(0x1)
};


// Size 0x28
struct MastCollisionProfiles
{
public:
	struct FName                                                 CollisionDisabledProfile;                          // 0x0(0x8)
	struct FName                                                 PlayerAndItemsCollisionProfile;                    // 0x8(0x8)
	struct FName                                                 PlayerOnlyCollisionProfile;                        // 0x10(0x8)
	struct FName                                                 ItemsOnlyCollisionProfile;                         // 0x18(0x8)
	struct FName                                                 ProjectilesOnlyCollisionProfile;                   // 0x20(0x8)
};


// Size 0x20
struct RecentlyInteractedWithPlayers
{
public:
	TArray<class AthenaPlayerCharacter*>                         RecentlyInteractedPlayers;                         // 0x0(0x10)
	class AthenaPlayerCharacter*                                 ReportingCharacter;                                // 0x10(0x8)
	struct DateTime                                              InteractionTime;                                   // 0x18(0x8)
};


// Size 0x1
struct NarrationStateRequestEvent
{
public:
	char                                                         pad0x1_CAI39[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct GameEventSchedulerSettingsChangeTelemetryEvent
{
public:
	struct StringAssetReference                                  SettingsAssetPath;                                 // 0x0(0x10)
};


// Size 0x78
struct HideInObjectActionStateConstructionInfo
{
public:
	char                                                         pad0x60_T0VU6[0x60];                               // 0x0(0x60)
	struct NetActorPtr                                           LoadableObject;                                    // 0x60(0x14)
	char                                                         pad0x4_1CBLM[0x4];                                 // 0x74(0x4)
};


// Size 0x1
struct EventQueriedPlayerSpawnLocation
{
public:
	char                                                         CrewSpawnState;                                    // 0x0(0x1)
};


// Size 0x20
struct ChainLightningParameters
{
public:
	float                                                        ChainLightningOverlapRadius;                       // 0x0(0x4)
	float                                                        InitialSelectionRadiusSquared;                     // 0x4(0x4)
	int                                                          InitialNumberOfNodesSelected;                      // 0x8(0x4)
	float                                                        MaxDistanceBetweenChainsSquared;                   // 0xc(0x4)
	int                                                          MaxNumberOfLinks;                                  // 0x10(0x4)
	bool                                                         OverrideMaxFramesBeforeReplication;                // 0x14(0x1)
	char                                                         pad0x3_8D3LQ[0x3];                                 // 0x15(0x3)
	int                                                          MaxFramesBeforeReplicationOverride;                // 0x18(0x4)
	float                                                        ChainVisualActorLifetime;                          // 0x1c(0x4)
};


// Size 0x10
struct DestroyingUnsafeWreckTelemetryEvent
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	bool                                                         IsCustomWreck;                                     // 0xc(0x1)
	char                                                         pad0x3_MVYKJ[0x3];                                 // 0xd(0x3)
};


// Size 0x18
struct DeferralReasonPopUpNotificationInfo
{
public:
	struct FString                                               DeferralReason;                                    // 0x0(0x10)
	class PopUpMessageDesc*                                      PopUp;                                             // 0x10(0x8)
};


// Size 0x1
struct DartProxyOwnerKilledEvent
{
public:
	char                                                         pad0x1_8ODB5[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct EventStarvingAmountChanged
{
public:
	float                                                        PercentageStarved;                                 // 0x0(0x4)
};


// Size 0x8
struct EventCharacterStartedOneShotUse
{
public:
	class UClass*                                                InputID;                                           // 0x0(0x8)
};


// Size 0x30
struct QuestVariableVector
{
public:
	char                                                         pad0x30_K6Q8E[0x30];                               // 0x0(0x30)
};


// Size 0x8
struct VengeanceDisabledClientTelemetryEvent
{
public:
	float                                                        VengeanceDuration;                                 // 0x0(0x4)
	float                                                        ElapsedDuration;                                   // 0x4(0x4)
};


// Size 0x20
struct AthenaAnimationObjectJumpingAnimations
{
public:
	class BlendSpace*                                            Start;                                             // 0x0(0x8)
	class BlendSpace*                                            Cycle;                                             // 0x8(0x8)
	class BlendSpace*                                            PreImpact;                                         // 0x10(0x8)
	class BlendSpace*                                            LandLight;                                         // 0x18(0x8)
};


// Size 0x8
struct EventPlayerEnteredProximity
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x10
struct EventEnteredShipLadder
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	class Actor*                                                 Actor;                                             // 0x8(0x8)
};


// Size 0x8
struct ShipAnnouncementShipSpottedEvent
{
public:
	class Actor*                                                 ShipSpotted;                                       // 0x0(0x8)
};


// Size 0x8
struct EventPlayerChangedTableMapPan
{
public:
	struct Vector2D                                              PanDelta;                                          // 0x0(0x8)
};


// Size 0xc
struct SingleStickMappingUserSettingsInteger
{
public:
	struct FName                                                 SettingName;                                       // 0x0(0x8)
	int                                                          Value;                                             // 0x8(0x4)
};


// Size 0x1
struct SkeletonCampOnDemandCompleteTelemetryEvent
{
public:
	char                                                         pad0x1_DKD5C[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct FortTargetKilledTelemetryEvent
{
public:
	struct Guid                                                  FortKeyId;                                         // 0x0(0x10)
	struct FString                                               FortTargetName;                                    // 0x10(0x10)
	struct Vector                                                FortKeyDroppedLocation;                            // 0x20(0xc)
	struct FName                                                 FortType;                                          // 0x2c(0x8)
	char                                                         pad0x4_MTM12[0x4];                                 // 0x34(0x4)
};


// Size 0x48
struct UserSettingsMapMarkDefinition
{
public:
	class UClass*                                                MarkId;                                            // 0x0(0x8)
	char                                                         pad0x40_S80UO[0x40];                               // 0x8(0x40)
};


// Size 0x20
struct PlayerChangedLoadoutTelemetryEvent
{
public:
	struct FString                                               EquippedItemType;                                  // 0x0(0x10)
	struct FString                                               EquippedItemName;                                  // 0x10(0x10)
};


// Size 0x20
struct MessageInABottlePremadeVoyageEntry
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	char                                                         pad0x4_9F2HW[0x4];                                 // 0xc(0x4)
	TArray<class VoyageDescDataAsset*>                           PremadeVoyages;                                    // 0x10(0x10)
};


// Size 0x90
struct PirateProfiles_UpdatePirateProfilePreview
{
public:
	struct PirateDescription                                     PirateDescription;                                 // 0x0(0x80)
	TArray<class Class*>                                         ClothingLoadout;                                   // 0x80(0x10)
};


// Size 0x30
struct PlayerTalkingSettings
{
public:
	struct LinearColor                                           IconTint;                                          // 0x0(0x10)
	class Texture2D*                                             Icon;                                              // 0x10(0x8)
	float                                                        ScreenEdgePadding;                                 // 0x18(0x4)
	float                                                        Scale;                                             // 0x1c(0x4)
	float                                                        FadeInTimeInSeconds;                               // 0x20(0x4)
	char                                                         pad0xc_X5UYW[0xc];                                 // 0x24(0xc)
};


// Size 0x10
struct GameEventCount
{
public:
	class UClass*                                                GameEventType;                                     // 0x0(0x8)
	int                                                          NumAllowed;                                        // 0x8(0x4)
	char                                                         pad0x4_53A1J[0x4];                                 // 0xc(0x4)
};


// Size 0x70
struct BootFlowWhatsNewArticle
{
public:
	struct FString                                               Title;                                             // 0x0(0x10)
	struct FString                                               Description;                                       // 0x10(0x10)
	struct FString                                               HeroImage;                                         // 0x20(0x10)
	struct FString                                               GridImage;                                         // 0x30(0x10)
	struct FString                                               GridPrimaryDescription;                            // 0x40(0x10)
	struct FString                                               GridSecondaryDescription;                          // 0x50(0x10)
	struct FString                                               DescriptionTimes;                                  // 0x60(0x10)
};


// Size 0x10
struct StartPickupObjectActionRuleParams
{
public:
	TArray<char>                                                 WieldableItemSizesDisablePickup;                   // 0x0(0x10)
};


// Size 0x1
struct BootFlowStartCrewMatchmakingStateEvent
{
public:
	char                                                         pad0x1_UGJIL[0x1];                                 // 0x0(0x1)
};


// Size 0xc
struct AthenaCharacterSwimSpeed
{
public:
	float                                                        SprintSpdAmp;                                      // 0x0(0x4)
	float                                                        SprintAccelAmp;                                    // 0x4(0x4)
	float                                                        TurnSpeedScalar;                                   // 0x8(0x4)
};


// Size 0x30
struct PoolDensityData
{
public:
	class WwiseObjectPoolWrapper*                                WwiseObjectPoolDensityWrapper;                     // 0x0(0x8)
	struct WwiseEmitter                                          DensityEmitter;                                    // 0x8(0x20)
	char                                                         pad0x8_W873G[0x8];                                 // 0x28(0x8)
};


// Size 0x48
struct VirtualAxisBindingDefinition
{
public:
	TArray<struct Name>                                          AxisNames;                                         // 0x0(0x10)
	TArray<struct Name>                                          CombinedAxisNamesX;                                // 0x10(0x10)
	TArray<struct Name>                                          CombinedAxisNamesY;                                // 0x20(0x10)
	struct FString                                               BindingName;                                       // 0x30(0x10)
	float                                                        Scale;                                             // 0x40(0x4)
	char                                                         pad0x4_PWKZM[0x4];                                 // 0x44(0x4)
};


// Size 0x1
struct TimedDoorClosedEvent
{
public:
	char                                                         pad0x1_9HMCZ[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct ShipStockOfferDetailsTelemetryEvent
{
public:
	struct Guid                                                  Id;                                                // 0x0(0x10)
	struct FString                                               DisplayName;                                       // 0x10(0x10)
};


// Size 0x8
struct TutorialHideFootstepEvent
{
public:
	char                                                         pad0x8_P5LVO[0x8];                                 // 0x0(0x8)
};


// Size 0x10
struct WorldEventCommandActivateWorldEvent_Event
{
public:
	class UClass*                                                EventType;                                         // 0x0(0x8)
	struct FName                                                 TargetIslandName;                                  // 0x8(0x8)
};


// Size 0x20
struct UIScreenTransitionEvent
{
public:
	struct FString                                               CurrentScreen;                                     // 0x0(0x10)
	struct FString                                               PreviousScreen;                                    // 0x10(0x10)
};


// Size 0x38
struct SpawningCommandKillAllAIInProximity
{
public:
	char                                                         pad0x20_IXQ2R[0x20];                               // 0x0(0x20)
	TArray<class PlayerState*>                                   TargetActors;                                      // 0x20(0x10)
	float                                                        KillRadiusSquared;                                 // 0x30(0x4)
	char                                                         pad0x4_4ISUS[0x4];                                 // 0x34(0x4)
};


// Size 0x28
struct IslandTeleportLocation
{
public:
	struct FString                                               Description;                                       // 0x0(0x10)
	struct Vector                                                TeleportLocation;                                  // 0x10(0xc)
	float                                                        TeleportYaw;                                       // 0x1c(0x4)
	class UClass*                                                SeaId;                                             // 0x20(0x8)
};


// Size 0x1
struct IntroVideoEvent_Advance
{
public:
	bool                                                         HasPlayedVideo;                                    // 0x0(0x1)
};


// Size 0x70
struct ExitTunnelOfTheDamnedActionStateConstructionInfo
{
public:
	char                                                         pad0x48_10T8X[0x48];                               // 0x0(0x48)
	struct Vector                                                TunnelLocation;                                    // 0x48(0xc)
	char                                                         pad0x4_OBKUH[0x4];                                 // 0x54(0x4)
	class CameraAnim*                                            CameraAnim;                                        // 0x58(0x8)
	class CurveFloat*                                            CameraBlendCurve;                                  // 0x60(0x8)
	bool                                                         CheckForMigrationConditions;                       // 0x68(0x1)
	char                                                         pad0x7_5SWKO[0x7];                                 // 0x69(0x7)
};


// Size 0x1
struct PlayerExitedHideoutEvent
{
public:
	char                                                         pad0x1_1Z7BV[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct ClientBootFlowExistingSessionTelemetry
{
public:
	struct FString                                               SessionId;                                         // 0x0(0x10)
	struct FString                                               PlayMode;                                          // 0x10(0x10)
	struct FString                                               SessionType;                                       // 0x20(0x10)
	struct FString                                               OwningUserId;                                      // 0x30(0x10)
};


// Size 0x28
struct PlayerVoyageProposalVoteTelemetryEvent
{
public:
	struct Guid                                                  VoyageProposalSessionId;                           // 0x0(0x10)
	int                                                          VoyageProposalSlot;                                // 0x10(0x4)
	char                                                         pad0x4_G5LZ1[0x4];                                 // 0x14(0x4)
	struct FString                                               VoyageProposalEntitlementId;                       // 0x18(0x10)
};


// Size 0x1
struct EventExposedToRainChanged
{
public:
	bool                                                         IsExposedToRain;                                   // 0x0(0x1)
};


// Size 0x10
struct ShroudBreakerActivatedEvent
{
public:
	struct Guid                                                  ShroudBreakerId;                                   // 0x0(0x10)
};


// Size 0x1
struct PirateProfiles_RequestThemes
{
public:
	char                                                         pad0x1_NBTVO[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct KrakenSpawnLocationParams
{
public:
	float                                                        KrakenRadius;                                      // 0x0(0x4)
	float                                                        MinDistanceFromExistingLocations;                  // 0x4(0x4)
};


// Size 0x1
struct ShipDiveEvent
{
public:
	char                                                         pad0x1_PC4IX[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct ServerTelemetryConfigurationSettings
{
public:
	float                                                        PlayerHeartbeatInterval;                           // 0x0(0x4)
	bool                                                         TelemetryEnabled_ItemEquip;                        // 0x4(0x1)
	bool                                                         TelemetryEnabled_ItemUsageEnd;                     // 0x5(0x1)
	bool                                                         TelemetryEnabled_ItemUsageStart;                   // 0x6(0x1)
	bool                                                         TelemetryEnabled_ObjectUsageEnd;                   // 0x7(0x1)
	bool                                                         TelemetryEnabled_ObjectUsageStart;                 // 0x8(0x1)
	bool                                                         TelemetryEnabled_PlayerAction;                     // 0x9(0x1)
	bool                                                         TelemetryEnabled_PlayerChangedLoadout;             // 0xa(0x1)
	bool                                                         TelemetryEnabled_PlayerChangedShipLoadout;         // 0xb(0x1)
	bool                                                         TelemetryEnabled_PlayerHeartbeat;                  // 0xc(0x1)
	bool                                                         TelemetryEnabled_PlayerPerformedEmote;             // 0xd(0x1)
	char                                                         pad0x2_TMKUA[0x2];                                 // 0xe(0x2)
};


// Size 0x48
struct XPGrantedEvent
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
	struct FName                                                 CompanyId;                                         // 0x14(0x8)
	struct Guid                                                  BootyId;                                           // 0x1c(0x10)
	struct Guid                                                  GuildId;                                           // 0x2c(0x10)
	struct FName                                                 EmissaryAffiliation;                               // 0x3c(0x8)
	char                                                         pad0x4_R0JTR[0x4];                                 // 0x44(0x4)
};


// Size 0x10
struct EventCrewReleasedCapstan
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x40
struct PioneerProgressMessage
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct Guid                                                  PlayerGameId;                                      // 0x10(0x10)
	struct FString                                               ObjectiveKey;                                      // 0x20(0x10)
	struct DateTime                                              DateTimeStampUtc;                                  // 0x38(0x8)
};


// Size 0x18
struct TaleQuestWeightedItemDescSpawnData
{
public:
	class ItemSpawnData*                                         ItemSpawnData;                                     // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	bool                                                         LimitMaxSpawnedItems;                              // 0xc(0x1)
	char                                                         pad0x3_AFR56[0x3];                                 // 0xd(0x3)
	int                                                          MaxTimesCanBeSelected;                             // 0x10(0x4)
	char                                                         pad0x4_BDS0J[0x4];                                 // 0x14(0x4)
};


// Size 0x4
struct AthenaAnimationActionRelevancy
{
public:
	bool                                                         UsePrimary;                                        // 0x0(0x1)
	bool                                                         UsePrimaryAlt;                                     // 0x1(0x1)
	bool                                                         UseSecondary;                                      // 0x2(0x1)
	bool                                                         UseSecondaryAlt;                                   // 0x3(0x1)
};


// Size 0x8
struct SpawnItemGameServerResponseModel
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
	char                                                         pad0x3_ZZ9QH[0x3];                                 // 0x1(0x3)
	char                                                         pad0x4_K70KW[0x4];                                 // 0x4(0x4)
};


// Size 0x20
struct MerchantCrateItemMountedNetworkEvent
{
public:
	char                                                         pad0x18_0KCF2[0x18];                               // 0x0(0x18)
	class UClass*                                                MountableType;                                     // 0x18(0x8)
};


// Size 0x30
struct QuestVariableNameArray
{
public:
	char                                                         pad0x30_WFU8M[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct EntitlementInfosRequestUIEvent
{
public:
	TArray<String>                                               EntitlementIds;                                    // 0x0(0x10)
	struct FString                                               Id;                                                // 0x10(0x10)
};


// Size 0x30
struct PetChestSuccessfulNameChangeTelemetryEvent
{
public:
	struct FString                                               PetName;                                           // 0x0(0x10)
	struct FString                                               PetCategory;                                       // 0x10(0x10)
	struct FString                                               PetVariantName;                                    // 0x20(0x10)
};


// Size 0x10
struct CrewAbandonedCaptainedSessionEvent
{
public:
	char                                                         pad0x10_777AR[0x10];                               // 0x0(0x10)
};


// Size 0x28
struct CaptainsLogInteractableActionStateParams
{
public:
	char                                                         pad0x18_IZAZM[0x18];                               // 0x0(0x18)
	class UClass*                                                ItemToSpawn;                                       // 0x18(0x8)
	float                                                        TimeBeforeUndock;                                  // 0x20(0x4)
	char                                                         pad0x4_O4CC4[0x4];                                 // 0x24(0x4)
};


// Size 0x10
struct PirateProfilesPirateCreationErrorToUI
{
public:
	struct FString                                               State;                                             // 0x0(0x10)
};


// Size 0x28
struct VolcanoActorStateData
{
public:
	char                                                         pad0x20_2TOKD[0x20];                               // 0x0(0x20)
	char                                                         State;                                             // 0x20(0x1)
	char                                                         pad0x7_M9QZI[0x7];                                 // 0x21(0x7)
};


// Size 0x8
struct CreateFogBankGameServerResponseModel
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
	char                                                         pad0x3_QPOP7[0x3];                                 // 0x1(0x3)
	int                                                          FogBankId;                                         // 0x4(0x4)
};


// Size 0x40
struct CutscenePool
{
public:
	struct FName                                                 CutsceneName;                                      // 0x0(0x8)
	int                                                          Priority;                                          // 0x8(0x4)
	int                                                          ActivationChance;                                  // 0xc(0x4)
	bool                                                         ShouldQueue;                                       // 0x10(0x1)
	char                                                         pad0x3_L2TYI[0x3];                                 // 0x11(0x3)
	float                                                        AdditionalPoolCooldown;                            // 0x14(0x4)
	class CutscenePoolType*                                      PoolType;                                          // 0x18(0x8)
	TArray<class SceneDialogueData*>                             DialogueData;                                      // 0x20(0x10)
	TArray<float>                                                CutsceneLengths;                                   // 0x30(0x10)
};


// Size 0x8
struct VengeanceStateChangedEvent
{
public:
	bool                                                         IsVengeanceActive;                                 // 0x0(0x1)
	char                                                         pad0x3_CXKA1[0x3];                                 // 0x1(0x3)
	float                                                        NormalisedVengeanceAmount;                         // 0x4(0x4)
};


// Size 0x40
struct ItemSpawnTelemetryEvent
{
public:
	struct Guid                                                  ItemId;                                            // 0x0(0x10)
	struct FName                                                 SpawnedClass;                                      // 0x10(0x8)
	char                                                         Source;                                            // 0x18(0x1)
	char                                                         pad0x7_31QSJ[0x7];                                 // 0x19(0x7)
	struct FString                                               SourceId;                                          // 0x20(0x10)
	struct Vector                                                SpawnLocation;                                     // 0x30(0xc)
	char                                                         pad0x4_GVX4J[0x4];                                 // 0x3c(0x4)
};


// Size 0x18
struct FaunaAnimationStartledStructure
{
public:
	class AnimSequence*                                          StartledLowAgitation;                              // 0x0(0x8)
	class AnimSequence*                                          StartledHighAgitation;                             // 0x8(0x8)
	class AnimSequence*                                          StartledOneShot;                                   // 0x10(0x8)
};


// Size 0x28
struct CloudWeatherParameters
{
public:
	struct Vector2D                                              DefaultCloudVelocity;                              // 0x0(0x8)
	class MaterialParameterCollection*                           AtmosphericMaterialParams;                         // 0x8(0x8)
	float                                                        GlobalAtmosphericPressure;                         // 0x10(0x4)
	float                                                        AtmosphericPressureThresholdSize;                  // 0x14(0x4)
	float                                                        MaxWindDelayLength;                                // 0x18(0x4)
	float                                                        WindSpeedMultiplier;                               // 0x1c(0x4)
	bool                                                         UsesGlobalWindService;                             // 0x20(0x1)
	bool                                                         UsesPressureZones;                                 // 0x20(0x1)
	bool                                                         CloudsCastShadows;                                 // 0x20(0x1)
	bool                                                         PressureIsControlledByParameterCollection;         // 0x20(0x1)
	char                                                         pad0x7_A9UQD[0x7];                                 // 0x21(0x7)
};


// Size 0x18
struct EventPlayerLoggedIn
{
public:
	class PlayerController*                                      PlayerController;                                  // 0x0(0x8)
	char                                                         pad0x10_Q8GYA[0x10];                               // 0x8(0x10)
};


// Size 0x10
struct PlayerStateAndTopTime
{
public:
	class PlayerState*                                           PlayerState;                                       // 0x0(0x8)
	float                                                        TopTime;                                           // 0x8(0x4)
	char                                                         pad0x4_GPF02[0x4];                                 // 0xc(0x4)
};


// Size 0x28
struct AllowedInteractableTypes
{
public:
	char                                                         pad0x20_JBKUM[0x20];                               // 0x0(0x20)
	struct CollisionProfileName                                  CollisionProfileName;                              // 0x20(0x8)
};


// Size 0x38
struct ShipRemoveSpearTelemetryEvent
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct Vector                                                RemoveSpearLocation;                               // 0x10(0xc)
	char                                                         pad0x4_E1EE4[0x4];                                 // 0x1c(0x4)
	struct FString                                               ShipPart;                                          // 0x20(0x10)
	int                                                          DamageLevel;                                       // 0x30(0x4)
	float                                                        RemoveSpearPercentage;                             // 0x34(0x4)
};


// Size 0x18
struct UIReturnedToPlayerEvent
{
public:
	char                                                         pad0x18_V4L3V[0x18];                               // 0x0(0x18)
};


// Size 0x10
struct ExpireCustomWreckEvent
{
public:
	struct Guid                                                  CrewOwner;                                         // 0x0(0x10)
};


// Size 0x1
struct EventFishingFishBecameTired
{
public:
	char                                                         pad0x1_RILED[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct ExplosionShipSizeMaxNumDamageHolesOverride
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	int                                                          ShipSizeMaxNumDamageHoles;                         // 0x8(0x4)
	char                                                         pad0x4_BD11W[0x4];                                 // 0xc(0x4)
};


// Size 0x8
struct ShipCustomizationChestEquipShipCustomizationEvent
{
public:
	class UClass*                                                Desc;                                              // 0x0(0x8)
};


// Size 0x20
struct ItemLoadoutSlot
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	TArray<class ItemInfo*>                                      Items;                                             // 0x8(0x10)
	int                                                          Capacity;                                          // 0x18(0x4)
	char                                                         pad0x4_4VRZV[0x4];                                 // 0x1c(0x4)
};


// Size 0x30
struct QuestVariablePlayerStat
{
public:
	char                                                         pad0x30_HTXPW[0x30];                               // 0x0(0x30)
};


// Size 0xa0
struct PlayerJoinedCrew
{
public:
	char                                                         pad0x18_NQTEO[0x18];                               // 0x0(0x18)
	struct FText                                                 PlayerName;                                        // 0x18(0x38)
	struct FText                                                 PlayerNameOverride;                                // 0x50(0x38)
	bool                                                         IsJoining;                                         // 0x88(0x1)
	bool                                                         IsCaptain;                                         // 0x89(0x1)
	char                                                         pad0x2_KW9R8[0x2];                                 // 0x8a(0x2)
	struct Guid                                                  GuildId;                                           // 0x8c(0x10)
	char                                                         pad0x4_UGFNP[0x4];                                 // 0x9c(0x4)
};


// Size 0x60
struct DeferredRewardRequestEvent
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
	struct FName                                                 CompanyAffiliation;                                // 0x10(0x8)
	struct FName                                                 RewardId;                                          // 0x18(0x8)
	struct FString                                               UserId;                                            // 0x20(0x10)
	struct FString                                               PirateId;                                          // 0x30(0x10)
	char                                                         AccountLevel;                                      // 0x40(0x1)
	char                                                         NotifyPlayer;                                      // 0x41(0x1)
	char                                                         RewardGold;                                        // 0x42(0x1)
	char                                                         RewardXP;                                          // 0x43(0x1)
	char                                                         RewardSeasonRenown;                                // 0x44(0x1)
	char                                                         pad0x3_LTS7T[0x3];                                 // 0x45(0x3)
	struct FString                                               DeferralReason;                                    // 0x48(0x10)
	double                                                       RewardMultiplier;                                  // 0x58(0x8)
};


// Size 0x128
struct AmmoUI
{
public:
	char                                                         pad0x18_MUK6H[0x18];                               // 0x0(0x18)
	class Pawn*                                                  TargetPawn;                                        // 0x18(0x8)
	char                                                         pad0x108_1A258[0x108];                             // 0x20(0x108)
};


// Size 0x40
struct RewardDefinition
{
public:
	struct FName                                                 RewardIdentifier;                                  // 0x0(0x8)
	class PopUpMessageDesc*                                      PopUp;                                             // 0x8(0x8)
	bool                                                         IgnorePopUp;                                       // 0x10(0x1)
	char                                                         pad0x7_63QB8[0x7];                                 // 0x11(0x7)
	TArray<class Reward*>                                        Rewards;                                           // 0x18(0x10)
	TArray<class Class*>                                         PrerequisiteEntitlements;                          // 0x28(0x10)
	bool                                                         AllowedFromInsecureSources;                        // 0x38(0x1)
	bool                                                         AwardToAccountAndNotJustToPirate;                  // 0x39(0x1)
	bool                                                         EmissaryExempt;                                    // 0x3a(0x1)
	char                                                         pad0x5_VFS6X[0x5];                                 // 0x3b(0x5)
};


// Size 0x30
struct QuestVariableName
{
public:
	char                                                         pad0x30_QQCZZ[0x30];                               // 0x0(0x30)
};


// Size 0x10
struct EventGhostShipRequestIndefiniteDoorLock
{
public:
	class Controller*                                            PlayerController;                                  // 0x0(0x8)
	class Object*                                                Owner;                                             // 0x8(0x8)
};


// Size 0x10
struct CompletionEventsRemoteServiceModel
{
public:
	TArray<String>                                               CompletionEvents;                                  // 0x0(0x10)
};


// Size 0x4
struct ItemBlockingParameters
{
public:
	char                                                         BlockingHalfAngle;                                 // 0x0(0x1)
	char                                                         BlockingDetectionOffset;                           // 0x1(0x1)
	char                                                         BlockingDetectionTruncatedConeRadius;              // 0x2(0x1)
	char                                                         BlockingDetectionCharacterOverlapRadius;           // 0x3(0x1)
};


// Size 0x1
struct RequestSessionEvent
{
public:
	char                                                         pad0x1_YXF5B[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct BootFlowUserSelectedStartCrewMatchmakingEvent
{
public:
	char                                                         pad0x1_Z2FRU[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct WeightedItemDescSpawnData
{
public:
	class ItemSpawnData*                                         ItemSpawnData;                                     // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	bool                                                         LimitMaxSpawnedItems;                              // 0xc(0x1)
	char                                                         pad0x3_SHX4I[0x3];                                 // 0xd(0x3)
	struct FName                                                 Feature;                                           // 0x14(0x8)
	bool                                                         InvertFeatureCheck;                                // 0x1c(0x1)
	char                                                         pad0x3_3255A[0x3];                                 // 0x1d(0x3)
	TArray<class SpawnRequirement*>                              Requirements;                                      // 0x20(0x10)
	bool                                                         CustomLifetimeManagement;                          // 0x30(0x1)
	char                                                         pad0x7_L9AW2[0x7];                                 // 0x31(0x7)
};


// Size 0x20
struct TunnelOfTheDamnedClass
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	class UClass*                                                TunnelClass;                                       // 0x8(0x8)
	struct Vector                                                RelativeSpawnLocation;                             // 0x10(0xc)
	char                                                         pad0x4_WFZ2H[0x4];                                 // 0x1c(0x4)
};


// Size 0x10
struct ContestTavernStagingTelemetryFragmentInput
{
public:
	char                                                         pad0x10_38FL0[0x10];                               // 0x0(0x10)
};


// Size 0x10
struct CrewCancelledTaleEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x14
struct LastCrewMemberEnteredTunnel
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	bool                                                         ShouldCancelEmergentVoyages;                       // 0x10(0x1)
	bool                                                         ShouldCancelPrimaryVoyages;                        // 0x11(0x1)
	bool                                                         ShouldCancelEmergentVoyagesExcludingEmissary;      // 0x12(0x1)
	char                                                         pad0x1_67BLF[0x1];                                 // 0x13(0x1)
};


// Size 0x14
struct ExitTunnelOfTheDamnedActionStateParams
{
public:
	float                                                        ClientSetupResponseTimeout;                        // 0x0(0x4)
	float                                                        CameraAnimationRate;                               // 0x4(0x4)
	float                                                        CameraAnimationScale;                              // 0x8(0x4)
	float                                                        CameraAnimationBlendInTime;                        // 0xc(0x4)
	float                                                        CameraAnimationBlendOutTime;                       // 0x10(0x4)
};


// Size 0x8
struct EventPlayerStoppedPlayingShanty
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x10
struct QuestWeightedDistance
{
public:
	float                                                        Min;                                               // 0x0(0x4)
	float                                                        Max;                                               // 0x4(0x4)
	float                                                        MinWeight;                                         // 0x8(0x4)
	float                                                        MaxWeight;                                         // 0xc(0x4)
};


// Size 0x1
struct TutorialResetMysteriousStrangersEvent
{
public:
	char                                                         pad0x1_UPAAX[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct TunnelOfTheDamnedMigrationSucceededEvent
{
public:
	char                                                         pad0x4_4QFYV[0x4];                                 // 0x0(0x4)
};


// Size 0x40
struct PremiumShopBundleOfferItem
{
public:
	bool                                                         IsPurchasable;                                     // 0x0(0x1)
	char                                                         pad0x7_2GRXQ[0x7];                                 // 0x1(0x7)
	struct FText                                                 LockedReason;                                      // 0x8(0x38)
};


// Size 0x60
struct AIKnockbackActionStateConstructionInfo
{
public:
	char                                                         pad0x48_3TTQT[0x48];                               // 0x0(0x48)
	struct Vector                                                KnockbackDirection;                                // 0x48(0xc)
	float                                                        KnockbackSpeed;                                    // 0x54(0x4)
	float                                                        KnockbackAccel;                                    // 0x58(0x4)
	char                                                         KnockbackStrengthType;                             // 0x5c(0x1)
	char                                                         pad0x3_GOGYN[0x3];                                 // 0x5d(0x3)
};


// Size 0x8
struct ProjectileTimeStamp
{
public:
	char                                                         pad0x8_I3F2B[0x8];                                 // 0x0(0x8)
};


// Size 0x1
struct EventLoadableItemLoadingEnd
{
public:
	char                                                         pad0x1_FK4IT[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct PirateProfilesRenameProfileToGame
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
	struct FString                                               NewName;                                           // 0x10(0x10)
};


// Size 0xb0
struct RewardGrantedNetworkEvent
{
public:
	char                                                         pad0x18_ASFMH[0x18];                               // 0x0(0x18)
	struct FString                                               RewardId;                                          // 0x18(0x10)
	char                                                         CurrencyId;                                        // 0x28(0x1)
	char                                                         pad0x3_T72AZ[0x3];                                 // 0x29(0x3)
	struct FString                                               CompanyId;                                         // 0x30(0x10)
	TArray<String>                                               Entitlements;                                      // 0x48(0x10)
	struct FString                                               DeferralReason;                                    // 0x58(0x10)
	struct FString                                               ShipName;                                          // 0x68(0x10)
	struct FText                                                 ScrambledShipName;                                 // 0x78(0x38)
};


// Size 0x8
struct ShipPartCustomizationModel
{
public:
	struct FName                                                 EntitlementId;                                     // 0x0(0x8)
};


// Size 0x1
struct EventIslandDiscoveredServer
{
public:
	char                                                         pad0x1_WHU35[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct RequestCaptainedSessionCrewDataEvent
{
public:
	char                                                         pad0x1_3718T[0x1];                                 // 0x0(0x1)
};


// Size 0x54
struct TrapSpawnedTelemetryEvent
{
public:
	struct Guid                                                  TrapId;                                            // 0x0(0x10)
	struct Vector                                                SpawnLocation;                                     // 0x10(0xc)
	struct FName                                                 InstigatorWorldLocation;                           // 0x1c(0x8)
	struct FName                                                 InstigatorIslandName;                              // 0x24(0x8)
	struct FName                                                 InstigatorOnShipClass;                             // 0x2c(0x8)
	struct Guid                                                  InstigatorOnShipId;                                // 0x34(0x10)
	struct Guid                                                  InstigatorShipOwningCrew;                          // 0x44(0x10)
};


// Size 0x28
struct ImpactDataParticleParams
{
public:
	class Object*                                                ClientOnlyParticles;                               // 0x0(0x8)
	class Object*                                                ParticleEffect;                                    // 0x8(0x8)
	class Object*                                                SplashParticles;                                   // 0x10(0x8)
	float                                                        MaxDepthForSplash;                                 // 0x18(0x4)
	float                                                        CustomParameter;                                   // 0x1c(0x4)
	struct Color                                                 ColorTint;                                         // 0x20(0x4)
	char                                                         ParticlesVfxRegion;                                // 0x24(0x1)
	bool                                                         ParticleSystemIsPerPoint;                          // 0x25(0x1)
	bool                                                         AttachToPlayer;                                    // 0x26(0x1)
	bool                                                         EnableUnderWaterImpact;                            // 0x27(0x1)
};


// Size 0x10
struct CrewChangeFailedEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x10
struct UIRequestOpenCompanyShopEvent
{
public:
	struct FString                                               CompanyId;                                         // 0x0(0x10)
};


// Size 0x10
struct ShipSurfacingStateUpdateTelemetryEvent
{
public:
	struct FString                                               ShipSurfacingState;                                // 0x0(0x10)
};


// Size 0x1
struct ForceCloseShopEvent
{
public:
	char                                                         pad0x1_GH6BE[0x1];                                 // 0x0(0x1)
};


// Size 0x70
struct ServerTelemetryFragment
{
public:
	char                                                         pad0x4_1Q2HP[0x4];                                 // 0x0(0x4)
	struct Guid                                                  ServerSessionId;                                   // 0x4(0x10)
	char                                                         pad0x4_CN9P9[0x4];                                 // 0x14(0x4)
	struct FString                                               ServerBuildId;                                     // 0x18(0x10)
	struct FString                                               ServerLocation;                                    // 0x28(0x10)
	struct FString                                               ServerPlayMode;                                    // 0x38(0x10)
	struct FString                                               PlayModeState;                                     // 0x48(0x10)
	struct Guid                                                  PrivateServerId;                                   // 0x58(0x10)
	bool                                                         ServerIsPrivateServer;                             // 0x68(0x1)
	bool                                                         ServerIsActive;                                    // 0x69(0x1)
	bool                                                         ServerIsXboxPadOnlySession;                        // 0x6a(0x1)
	char                                                         pad0x5_3FU6F[0x5];                                 // 0x6b(0x5)
};


// Size 0x20
struct TriggerPlaceableReactionEvent
{
public:
	char                                                         pad0x18_0MDQC[0x18];                               // 0x0(0x18)
	class PlaceableReaction*                                     PlaceableReaction;                                 // 0x18(0x8)
};


// Size 0x10
struct VaultPuzzleSolutionPositions
{
public:
	TArray<int>                                                  SolutionPositions;                                 // 0x0(0x10)
};


// Size 0x1
struct EventOnLensSwitched
{
public:
	bool                                                         IsInFarSight;                                      // 0x0(0x1)
};


// Size 0x1
struct DitherFadeOutEvent
{
public:
	char                                                         pad0x1_2OXOI[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct TQStructGenWeightedContainer
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	int                                                          MaxOccurrences;                                    // 0xc(0x4)
};


// Size 0x8
struct EventJustBeenFed
{
public:
	class Actor*                                                 FedBy;                                             // 0x0(0x8)
};


// Size 0x1
struct FlashbangEffectEvent
{
public:
	bool                                                         IsFlashbanged;                                     // 0x0(0x1)
};


// Size 0x1
struct IntroVideoEvent_Start
{
public:
	char                                                         pad0x1_LPVK3[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct BootFlowStartHandleErrorStateEvent
{
public:
	char                                                         pad0x1_PI0CQ[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct StorableLockState
{
public:
	bool                                                         Locked;                                            // 0x0(0x1)
	char                                                         pad0x7_V9CKD[0x7];                                 // 0x1(0x7)
	TArray<struct StringAssetReference>                          AcceptableKeys;                                    // 0x8(0x10)
	bool                                                         IsInUnlockingSequence;                             // 0x18(0x1)
	char                                                         pad0x7_PPXF9[0x7];                                 // 0x19(0x7)
};


// Size 0x28
struct WheelDesc
{
public:
	struct StringAssetReference                                  WheelMesh;                                         // 0x0(0x10)
	TArray<class MaterialInterface*>                             WheelMeshOverrideMaterials;                        // 0x18(0x10)
};


// Size 0x18
struct ClientConditionsCompleteNetworkEvent
{
public:
	char                                                         pad0x18_BA21K[0x18];                               // 0x0(0x18)
};


// Size 0x1
struct EventItemOnShipSunk
{
public:
	char                                                         pad0x1_AR5KV[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct MatchmakingQuestParams
{
public:
	char                                                         pad0x1_TK4GT[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct PeriodicResponse
{
public:
	struct FloatRange                                            PeriodRange;                                       // 0x0(0x10)
	class Object*                                                Owner;                                             // 0x10(0x8)
	char                                                         pad0x18_V7DHR[0x18];                               // 0x18(0x18)
};


// Size 0x1
struct ClientMigrationEndedEvent
{
public:
	char                                                         pad0x1_MR17L[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct ToggledSpawnerOverride
{
public:
	class AISpawner*                                             Spawner;                                           // 0x0(0x8)
	struct FName                                                 Toggle;                                            // 0x8(0x8)
};


// Size 0x40
struct EventPlayerSendOutDirectTextMessage
{
public:
	class PlayerState*                                           Sender;                                            // 0x0(0x8)
	struct FText                                                 Message;                                           // 0x8(0x38)
};


// Size 0x18
struct SendDropDownFromHangingRpc
{
public:
	char                                                         pad0x18_UZ5FN[0x18];                               // 0x0(0x18)
};


// Size 0x20
struct ScoreReasonIcons
{
public:
	char                                                         ReasonForScore;                                    // 0x0(0x1)
	char                                                         pad0x7_NHY9K[0x7];                                 // 0x1(0x7)
	struct StringAssetReference                                  ScoringIconAssetReference;                         // 0x8(0x10)
	class Texture*                                               ScoreScrollScoringIcon;                            // 0x18(0x8)
};


// Size 0x58
struct ScrambledIdentityClient
{
public:
	struct Guid                                                  EntityId;                                          // 0x0(0x10)
	struct FText                                                 ScrambledName;                                     // 0x10(0x38)
	struct FString                                               ClientName;                                        // 0x48(0x10)
};


// Size 0x8
struct EventCharacterDespawned
{
public:
	class Character*                                             Character;                                         // 0x0(0x8)
};


// Size 0x10
struct MermaidSpawnedTelemetryEvent
{
public:
	int                                                          MermaidId;                                         // 0x0(0x4)
	struct Vector                                                MermaidPosition;                                   // 0x4(0xc)
};


// Size 0x38
struct LevelCancelRequestedTelemetryEvent
{
public:
	char                                                         pad0x30_WCTEP[0x30];                               // 0x0(0x30)
	float                                                        TimeCancelRequested;                               // 0x30(0x4)
	char                                                         pad0x4_YCCLV[0x4];                                 // 0x34(0x4)
};


// Size 0x1
struct EventAthenaCharacterMovementTickFinished
{
public:
	char                                                         pad0x1_NVE83[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct TutorialStepEnteredEvent
{
public:
	struct FName                                                 StepName;                                          // 0x0(0x8)
};


// Size 0x38
struct QuestTablePageTransitionTelemetryEvent
{
public:
	struct FString                                               CurrentPage;                                       // 0x0(0x10)
	struct FString                                               PreviousPage;                                      // 0x10(0x10)
	float                                                        TimeOnPreviousPage;                                // 0x20(0x4)
	char                                                         pad0x4_2L211[0x4];                                 // 0x24(0x4)
	struct FString                                               SessionId;                                         // 0x28(0x10)
};


// Size 0x58
struct RiddleQuestParams
{
public:
	char                                                         pad0x50_D9SAE[0x50];                               // 0x0(0x50)
	class BoobyTrapSpawnerDataAsset*                             BoobyTrapSpawnerDataAsset;                         // 0x50(0x8)
};


// Size 0x28
struct SignedGuildId
{
public:
	struct Guid                                                  GuildId;                                           // 0x0(0x10)
	char                                                         GuildAffiliation;                                  // 0x10(0x1)
	char                                                         pad0x7_GA8KO[0x7];                                 // 0x11(0x7)
	struct FString                                               Signature;                                         // 0x18(0x10)
};


// Size 0x8
struct EventRemovePlayerOnLogOut
{
public:
	class Controller*                                            Controller;                                        // 0x0(0x8)
};


// Size 0x20
struct ServicesConnectionServerResultTelemetryEvent
{
public:
	char                                                         Result;                                            // 0x0(0x1)
	char                                                         pad0x7_AI220[0x7];                                 // 0x1(0x7)
	double                                                       TimeInSeconds;                                     // 0x8(0x8)
	struct FString                                               Reason;                                            // 0x10(0x10)
};


// Size 0x8
struct EventPlayerRemoveSpearCompleted
{
public:
	char                                                         pad0x8_DK7C8[0x8];                                 // 0x0(0x8)
};


// Size 0x18
struct ReloadRequest
{
public:
	class Actor*                                                 Instigator;                                        // 0x0(0x8)
	struct Guid                                                  TelemetryReloadId;                                 // 0x8(0x10)
};


// Size 0x18
struct GuildNameChangedOnServerEvent
{
public:
	struct FString                                               GuildName;                                         // 0x0(0x10)
	int                                                          ScrambledGuildNameIndex;                           // 0x10(0x4)
	char                                                         pad0x4_2BH7N[0x4];                                 // 0x14(0x4)
};


// Size 0xe0
struct PirateGeneratorBakeFailureTelemetryEvent
{
public:
	char                                                         pad0xb0_LU594[0xb0];                               // 0x0(0xb0)
	TArray<String>                                               CompleteTextures;                                  // 0xb0(0x10)
	TArray<String>                                               IncompleteTextures;                                // 0xc0(0x10)
	char                                                         BakeStage;                                         // 0xd0(0x1)
	char                                                         pad0x3_YFMUS[0x3];                                 // 0xd1(0x3)
	int                                                          MeshPatchCallsStarted;                             // 0xd4(0x4)
	int                                                          MeshPatchCallsCompleted;                           // 0xd8(0x4)
	char                                                         pad0x4_WX8IU[0x4];                                 // 0xdc(0x4)
};


// Size 0x4
struct EventActorRoleChanged
{
public:
	char                                                         pad0x4_XOOZY[0x4];                                 // 0x0(0x4)
};


// Size 0x40
struct CrewCommandAddPlayerToCrew
{
public:
	char                                                         pad0x20_V0PUW[0x20];                               // 0x0(0x20)
	class PlayerState*                                           PlayerState;                                       // 0x20(0x8)
	struct Guid                                                  CrewId;                                            // 0x28(0x10)
	class UClass*                                                ShipSize;                                          // 0x38(0x8)
};


// Size 0x4
struct VengeanceDurationServerTelemetryEvent
{
public:
	float                                                        VengeanceDuration;                                 // 0x0(0x4)
};


// Size 0xb0
struct ShowTutorialNotificationUIEvent
{
public:
	char                                                         pad0xb0_UXADT[0xb0];                               // 0x0(0xb0)
};


// Size 0x68
struct QuestDistributionPerChapterParams
{
public:
	int                                                          MinNumChapters;                                    // 0x0(0x4)
	char                                                         pad0x4_Z3IZY[0x4];                                 // 0x4(0x4)
	struct WeightedProbabilityRange                              NumQuests;                                         // 0x8(0x20)
	struct WeightedProbabilityRange                              NumQuestsInFirstChapter;                           // 0x28(0x20)
	struct WeightedProbabilityRange                              NumQuestsInOtherChapters;                          // 0x48(0x20)
};


// Size 0x20
struct UserPresence
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
	struct FString                                               Presence;                                          // 0x10(0x10)
};


// Size 0x38
struct TeleportStageCompletedTelemetryEvent
{
public:
	struct Guid                                                  Id;                                                // 0x0(0x10)
	float                                                        Duration;                                          // 0x10(0x4)
	char                                                         pad0x4_MR0GR[0x4];                                 // 0x14(0x4)
	struct FString                                               Reason;                                            // 0x18(0x10)
	struct FString                                               CompletedStage;                                    // 0x28(0x10)
};


// Size 0x10
struct RequestShipCustomizationChestEquipShipCustomizationEvent
{
public:
	struct FString                                               ItemDesc;                                          // 0x0(0x10)
};


// Size 0x10
struct ClientInputBlockedTelemetryEvent
{
public:
	struct FString                                               BlockedKey;                                        // 0x0(0x10)
};


// Size 0x1
struct EventLocalPlayerEnteredHangingState
{
public:
	bool                                                         HangingPointSupportsThirdPersonCamera;             // 0x0(0x1)
};


// Size 0x40
struct HealthChange
{
public:
	float                                                        From;                                              // 0x0(0x4)
	float                                                        To;                                                // 0x4(0x4)
	char                                                         Reason;                                            // 0x8(0x1)
	char                                                         pad0x7_U9EUJ[0x7];                                 // 0x9(0x7)
	class Actor*                                                 DirectInstigator;                                  // 0x10(0x8)
	class Actor*                                                 RootInstigator;                                    // 0x18(0x8)
	struct Guid                                                  IncidentId;                                        // 0x20(0x10)
	struct Vector_NetQuantize10                                  DirectInstigatorLocation;                          // 0x30(0xc)
	char                                                         pad0x4_DPYNS[0x4];                                 // 0x3c(0x4)
};


// Size 0x40
struct VFXHandlerComponentParams
{
public:
	class ParticleSystem*                                        ParticleSystem;                                    // 0x0(0x8)
	struct Vector                                                VFXRelativeOffset;                                 // 0x8(0xc)
	struct Vector                                                VFXScale;                                          // 0x14(0xc)
	struct Rotator                                               VFXRotationOffset;                                 // 0x20(0xc)
	struct FName                                                 VFXAttachSocket;                                   // 0x2c(0x8)
	float                                                        VFXDrivingCurveValue;                              // 0x34(0x4)
	char                                                         VFXCustomLocalSpaceMode;                           // 0x38(0x1)
	char                                                         pad0x7_1DZPT[0x7];                                 // 0x39(0x7)
};


// Size 0x10
struct AggressiveGhostShipImpactDamage
{
public:
	class UClass*                                                ImpactProjectileId;                                // 0x0(0x8)
	float                                                        Damage;                                            // 0x8(0x4)
	char                                                         pad0x4_234K5[0x4];                                 // 0xc(0x4)
};


// Size 0x8
struct EmissaryState
{
public:
	bool                                                         EmissaryActive;                                    // 0x0(0x1)
	char                                                         pad0x3_PEHC8[0x3];                                 // 0x1(0x3)
	float                                                        Level;                                             // 0x4(0x4)
};


// Size 0xd0
struct SocketCollisionEvent
{
public:
	char                                                         pad0xd0_JA2L3[0xd0];                               // 0x0(0xd0)
};


// Size 0x10
struct ActionSequenceInteractableInteractionStateData
{
public:
	int                                                          InteractCount;                                     // 0x0(0x4)
	char                                                         InteractionState;                                  // 0x4(0x1)
	char                                                         pad0x3_RSD4Y[0x3];                                 // 0x5(0x3)
	double                                                       LastInteractionTimestamp;                          // 0x8(0x8)
};


// Size 0x8
struct EventConcealingObjectUsed
{
public:
	class Actor*                                                 UsingActor;                                        // 0x0(0x8)
};


// Size 0x14
struct NetAccoladeModel
{
public:
	struct Guid                                                  GoalId;                                            // 0x0(0x10)
	int                                                          Progress;                                          // 0x10(0x4)
};


// Size 0x20
struct ServerNetworkDataTelemetryFragment
{
public:
	struct PacketDiscardStats                                    DiscardedPackets;                                  // 0x0(0x20)
};


// Size 0x10
struct EventPlayerNameOverrideAssigned
{
public:
	struct FString                                               PlayerNameOverride;                                // 0x0(0x10)
};


// Size 0x20
struct PathObstacleContainer
{
public:
	char                                                         pad0x20_7ZYYS[0x20];                               // 0x0(0x20)
};


// Size 0x8
struct PlayerMapsRegisteredEvent
{
public:
	class Actor*                                                 Map;                                               // 0x0(0x8)
};


// Size 0x1
struct ConnectToServicesStateDiscoverySucceededPreLoginEvent
{
public:
	char                                                         pad0x1_IG2BP[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct PetChestPetNameUpdateSucceedEvent
{
public:
	char                                                         pad0x1_ZW7D4[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct SinkShipGameServerRequestModel
{
public:
	int                                                          ShipNetGUID;                                       // 0x0(0x4)
};


// Size 0x90
struct EmissaryDisplayInformation
{
public:
	struct FText                                                 Title;                                             // 0x0(0x38)
	struct FText                                                 Description;                                       // 0x38(0x38)
	struct StringAssetReference                                  KeyArt;                                            // 0x70(0x10)
	struct StringAssetReference                                  Icon;                                              // 0x80(0x10)
};


// Size 0x1
struct EnterTunnelOfTheDamnedFadeComplete
{
public:
	char                                                         pad0x1_P0LVO[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventIslandsSucessfullyCached
{
public:
	char                                                         pad0x1_VD4SI[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct RadialPageChanged
{
public:
	char                                                         pad0x4_T95N4[0x4];                                 // 0x0(0x4)
};


// Size 0x24
struct WheelAdditiveAlphaSets
{
public:
	float                                                        IsAdditiveRightFingerIdle;                         // 0x0(0x4)
	float                                                        IsAdditiveLeftFingerIdle;                          // 0x4(0x4)
	float                                                        IsAdditiveIdle;                                    // 0x8(0x4)
	float                                                        LeftFingerAdditiveValue;                           // 0xc(0x4)
	float                                                        RightFingerAdditiveValue;                          // 0x10(0x4)
	float                                                        fullBodyAdditiveValue;                             // 0x14(0x4)
	float                                                        RHandAdditiveBlendValue;                           // 0x18(0x4)
	float                                                        LHandAdditiveBlendValue;                           // 0x1c(0x4)
	float                                                        FullBodyAdditiveBlendValue;                        // 0x20(0x4)
};


// Size 0x14
struct RewardRequestFailedEvent
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
	char                                                         FailureReason;                                     // 0x10(0x1)
	char                                                         pad0x3_T07O3[0x3];                                 // 0x11(0x3)
};


// Size 0x10
struct GenericModalContinueEvent
{
public:
	struct FString                                               DisplayMessage;                                    // 0x0(0x10)
};


// Size 0x2
struct SeaFortAlignment
{
public:
	char                                                         IslandType;                                        // 0x0(0x1)
	char                                                         Alignment;                                         // 0x1(0x1)
};


// Size 0x20
struct NetPerformanceMonitorInitialisationErrorTelemetryEvent
{
public:
	struct FString                                               ErrorType;                                         // 0x0(0x10)
	struct FString                                               ErrorMessage;                                      // 0x10(0x10)
};


// Size 0x98
struct ContestCeremonyEvent
{
public:
	TArray<class WwiseEvent*>                                    AudioEvents;                                       // 0x0(0x10)
	TArray<char>                                                 SpecialEvents;                                     // 0x10(0x10)
	struct FText                                                 NPCName;                                           // 0x20(0x38)
	struct FText                                                 NPCMessageToAllPlayers;                            // 0x58(0x38)
	float                                                        TimeToEvent;                                       // 0x90(0x4)
	char                                                         pad0x4_9Q5B8[0x4];                                 // 0x94(0x4)
};


// Size 0x1
struct EventUserGameSettingsRequest
{
public:
	char                                                         pad0x1_IGZNR[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct ScrambledIdentityServer
{
public:
	char                                                         IdentityType;                                      // 0x0(0x1)
	char                                                         pad0x3_YW1MH[0x3];                                 // 0x1(0x3)
	struct Guid                                                  EntityId;                                          // 0x4(0x10)
	char                                                         pad0x4_NBXWO[0x4];                                 // 0x14(0x4)
	struct FString                                               UnscrambledName;                                   // 0x18(0x10)
	struct UniqueNetIdRepl                                       OwnersUserId;                                      // 0x28(0x18)
};


// Size 0x1
struct ConfirmGuildSignUpEvent
{
public:
	char                                                         pad0x1_YUBCT[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct AchievementHeavyAttackRivalOffTheirShip
{
public:
	class AthenaCharacter*                                       Character;                                         // 0x0(0x8)
	float                                                        TimeWindowInSeconds;                               // 0x8(0x4)
	char                                                         pad0x4_ZQ6QQ[0x4];                                 // 0xc(0x4)
};


// Size 0x30
struct PlayerHealthChangeTelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	float                                                        CurrentHealth;                                     // 0x10(0x4)
	float                                                        PreviousHealth;                                    // 0x14(0x4)
	float                                                        HealthDelta;                                       // 0x18(0x4)
	char                                                         Reason;                                            // 0x1c(0x1)
	char                                                         pad0x3_XXD9J[0x3];                                 // 0x1d(0x3)
	double                                                       SecondsSinceSpawned;                               // 0x28(0x8)
};


// Size 0x60
struct AthenaAnimationObjectMeleeBlocking
{
public:
	class AnimSequence*                                          BlockingInto;                                      // 0x0(0x8)
	class AnimSequence*                                          BlockingIntoFromCombat;                            // 0x8(0x8)
	class BlendSpace*                                            BlockingMainBlendSpace;                            // 0x10(0x8)
	class AnimSequence*                                          BlockingFeedbackSequenceA;                         // 0x18(0x8)
	class AnimSequence*                                          BlockingFeedbackSequenceB;                         // 0x20(0x8)
	class AnimSequence*                                          BlockingOut;                                       // 0x28(0x8)
	class BlendSpace*                                            Dodge;                                             // 0x30(0x8)
	class AnimSequence*                                          BlockingIntoSwimming;                              // 0x38(0x8)
	class BlendSpace*                                            BlockingMainBlendSpaceSwimming;                    // 0x40(0x8)
	class AnimSequence*                                          BlockingFeedbackSequenceASwimming;                 // 0x48(0x8)
	class AnimSequence*                                          BlockingFeedbackSequenceBSwimming;                 // 0x50(0x8)
	class AnimSequence*                                          BlockingOutSwimming;                               // 0x58(0x8)
};


// Size 0x10
struct EventStorageContainerItemRemoved
{
public:
	class Actor*                                                 RemovingPlayer;                                    // 0x0(0x8)
	class UClass*                                                ItemDesc;                                          // 0x8(0x8)
};


// Size 0x1
struct HuntingSpearProxyPickupTelemetryEvent
{
public:
	char                                                         pad0x1_7MTIE[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct RowboatSnapshotV1
{
public:
	int                                                          Id;                                                // 0x0(0x4)
	struct Vector                                                Position;                                          // 0x4(0xc)
};


// Size 0x10
struct GuildRemoteErrorMessage
{
public:
	struct FString                                               Error;                                             // 0x0(0x10)
};


// Size 0x1
struct EventMeleeAttackProcessorStrikeEnded
{
public:
	char                                                         pad0x1_C1KNP[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct ItemDiggingBaseOverride
{
public:
	TArray<Class>                                                Classes;                                           // 0x0(0x10)
	class ItemDiggingBaseConfig*                                 DiggingBaseConfig;                                 // 0x10(0x8)
};


// Size 0x10
struct QuestTableOpenTelemetryEvent
{
public:
	struct FString                                               SessionId;                                         // 0x0(0x10)
};


// Size 0x4
struct PlayerMermaidsSuppressedUpdate
{
public:
	float                                                        PercentageRemaining;                               // 0x0(0x4)
};


// Size 0x1
struct ShowRejoinModalEvent
{
public:
	char                                                         pad0x1_TBHO4[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct IntroVideoEvent_End
{
public:
	char                                                         pad0x1_LL4W2[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct PlayerEireneHeartbeatEvent
{
public:
	int                                                          SentEireneMessageCount;                            // 0x0(0x4)
	int                                                          ReceivedEireneMessageCount;                        // 0x4(0x4)
};


// Size 0x20
struct EnableObjectLeakDetectionTelemetryRpc
{
public:
	char                                                         pad0x18_JT99R[0x18];                               // 0x0(0x18)
	float                                                        Interval;                                          // 0x18(0x4)
	char                                                         pad0x4_634LJ[0x4];                                 // 0x1c(0x4)
};


// Size 0x28
struct VoyageDiscardedTelemetryEvent
{
public:
	struct FString                                               VoyageRecipeAsset;                                 // 0x0(0x10)
	struct FString                                               CompanyId;                                         // 0x10(0x10)
	int                                                          VoyageRank;                                        // 0x20(0x4)
	char                                                         pad0x4_OX10Y[0x4];                                 // 0x24(0x4)
};


// Size 0xc
struct SpotLightData
{
public:
	float                                                        InnerConeAngle;                                    // 0x0(0x4)
	float                                                        OuterConeAngle;                                    // 0x4(0x4)
	float                                                        KickBackRatio;                                     // 0x8(0x4)
};


// Size 0x8
struct EventResetSettingsGroup
{
public:
	struct FName                                                 SettingsGroupNameToReset;                          // 0x0(0x8)
};


// Size 0x18
struct AthenaAnimationPlayingEquipAnimations
{
public:
	class AnimSequence*                                          Equip;                                             // 0x0(0x8)
	class BlendSpace*                                            EquipAsBlendSpace;                                 // 0x8(0x8)
	class BlendSpace*                                            EquipSwimming;                                     // 0x10(0x8)
};


// Size 0x28
struct FeaturedEntitlements
{
public:
	struct FName                                                 Feature;                                           // 0x0(0x8)
	struct StringAssetReference                                  EntitlementsAsset;                                 // 0x8(0x10)
	struct StringAssetReference                                  SupplementalEntitlementMap;                        // 0x18(0x10)
};


// Size 0x20
struct ClientNameUpdateEvent
{
public:
	struct Guid                                                  EntityId;                                          // 0x0(0x10)
	struct FString                                               ClientName;                                        // 0x10(0x10)
};


// Size 0x30
struct CannonStateData
{
public:
	char                                                         pad0x20_736BC[0x20];                               // 0x0(0x20)
	struct FString                                               LoadedItemId;                                      // 0x20(0x10)
};


// Size 0x1
struct EventIslandEventDataChanged
{
public:
	char                                                         pad0x1_WIEKJ[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct GuildEntitlement
{
public:
	int                                                          UnlockLevel;                                       // 0x0(0x4)
	char                                                         pad0x4_IL1RT[0x4];                                 // 0x4(0x4)
	struct FText                                                 LockedDescription;                                 // 0x8(0x38)
	class UClass*                                                Entitlement;                                       // 0x40(0x8)
};


// Size 0x28
struct ItemSnapshotSwapInstigatedEvent
{
public:
	struct Guid                                                  SnapshotID;                                        // 0x0(0x10)
	class Actor*                                                 WorldContextObject;                                // 0x20(0x8)
};


// Size 0x8
struct PlayerObjectUsageTelemetryFragmentInput
{
public:
	char                                                         pad0x8_4I2PM[0x8];                                 // 0x0(0x8)
};


// Size 0x68
struct RewardGrantedEvent
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
	struct FString                                               RewardId;                                          // 0x10(0x10)
	char                                                         CurrencyId;                                        // 0x20(0x1)
	char                                                         pad0x3_MQGM5[0x3];                                 // 0x21(0x3)
	struct FString                                               CompanyId;                                         // 0x28(0x10)
	TArray<String>                                               Entitlements;                                      // 0x40(0x10)
	struct FString                                               DeferralReason;                                    // 0x50(0x10)
	char                                                         Propogation;                                       // 0x60(0x1)
	char                                                         pad0x7_6K4CG[0x7];                                 // 0x61(0x7)
};


// Size 0x90
struct AchievementSailThroughStormAtNightWithLightsOff
{
public:
	char                                                         pad0x60_JSOWA[0x60];                               // 0x0(0x60)
	class Ship*                                                  Ship;                                              // 0x60(0x8)
	char                                                         pad0x28_N8YQN[0x28];                               // 0x68(0x28)
};


// Size 0x18
struct SpawnActorPerformanceStatsTelemetryFragmentInput
{
public:
	struct FString                                               ActorClassName;                                    // 0x0(0x10)
	float                                                        ActorSpawnTime;                                    // 0x10(0x4)
	char                                                         pad0x4_JIDP0[0x4];                                 // 0x14(0x4)
};


// Size 0x10
struct AthenaAnimationPetSelectedArrayAnimations
{
public:
	class AnimSequence*                                          HeldBaseIdle_A;                                    // 0x0(0x8)
	class AnimSequence*                                          HeldBaseIdle_B;                                    // 0x8(0x8)
};


// Size 0x48
struct ProjectileHitScanPerWeaponMeshPairings
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	class StaticMesh*                                            TrailsMeshHitScan;                                 // 0x8(0x8)
	class MaterialInterface*                                     MaterialHitScan;                                   // 0x10(0x8)
	int                                                          MaxTrails;                                         // 0x18(0x4)
	char                                                         pad0x2c_0RT78[0x2c];                               // 0x1c(0x2c)
};


// Size 0x40
struct IsWearingClothingCondition
{
public:
	char                                                         pad0x28_HXY5G[0x28];                               // 0x0(0x28)
	TArray<Class>                                                TargetClothes;                                     // 0x28(0x10)
	int                                                          MinimumRequiredClothing;                           // 0x38(0x4)
	char                                                         pad0x4_IQDWE[0x4];                                 // 0x3c(0x4)
};


// Size 0x10
struct EventActiveDialogueInteractorsOnServerChanged
{
public:
	TArray<class Actor*>                                         ActiveDialogueInteractors;                         // 0x0(0x10)
};


// Size 0x10
struct DynamicMaterialsList
{
public:
	TArray<uintptr_t>                                            Materials;                                         // 0x0(0x10)
};


// Size 0x8
struct PlayerEnteredFortVicinityEvent
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x8
struct AchievementCompleteContest
{
public:
	char                                                         pad0x8_7J79J[0x8];                                 // 0x0(0x8)
};


// Size 0x1
struct EventCannonAimingCenteredYaw
{
public:
	char                                                         pad0x1_YB0MK[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct ReactionVOEntry
{
public:
	struct FName                                                 VOGroupName;                                       // 0x0(0x8)
	struct WeightedProbabilityRangeOfRanges                      VOCooldown;                                        // 0x8(0x30)
};


// Size 0x18
struct AggressiveGhostShipNameBucket
{
public:
	struct FName                                                 Key;                                               // 0x0(0x8)
	TArray<struct Text>                                          Names;                                             // 0x8(0x10)
};


// Size 0x18
struct BalanceableWalkwayAnimationsFirstPerson
{
public:
	class AnimSequence*                                          Into;                                              // 0x0(0x8)
	class AnimSequence*                                          SlideAction;                                       // 0x8(0x8)
	class BlendSpace*                                            BlendSpace;                                        // 0x10(0x8)
};


// Size 0x30
struct QuestVariableFishingFishSpawners
{
public:
	char                                                         pad0x30_OL82J[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct ProjectileWeaponFireStatsTelemetryEvent
{
public:
	float                                                        AimPositionDifference;                             // 0x0(0x4)
	float                                                        AimPositionCorrection;                             // 0x4(0x4)
	float                                                        LatencyMs;                                         // 0x8(0x4)
	struct Guid                                                  AttackId;                                          // 0xc(0x10)
	char                                                         pad0x4_0HNZJ[0x4];                                 // 0x1c(0x4)
	struct FString                                               WeaponType;                                        // 0x20(0x10)
};


// Size 0x20
struct EventEncounterEnd
{
public:
	char                                                         pad0x20_K7DJT[0x20];                               // 0x0(0x20)
};


// Size 0x1
struct PrimaryInteractableAvailableEvent
{
public:
	char                                                         pad0x1_2S876[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct RepairObjectActionStateParams
{
public:
	float                                                        MountTime;                                         // 0x0(0x4)
	struct AdaptiveTriggerEffectMode_Vibration                   RightTrigger_Repair;                               // 0x4(0x4)
};


// Size 0x1
struct PurchaseShopOfferSucceededEvent
{
public:
	char                                                         pad0x1_6H7DC[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct DigAnimParams
{
public:
	char                                                         DigType;                                           // 0x0(0x1)
	char                                                         pad0x3_YV57F[0x3];                                 // 0x1(0x3)
	float                                                        Duration;                                          // 0x4(0x4)
	float                                                        TimeStampOfUnlockingWielderMovement;               // 0x8(0x4)
	float                                                        TimeStampOfEnterGround;                            // 0xc(0x4)
	float                                                        TimeStampOfLeaveGround;                            // 0x10(0x4)
	char                                                         AnimVariant;                                       // 0x14(0x1)
	char                                                         pad0x3_0M4HP[0x3];                                 // 0x15(0x3)
};


// Size 0x4
struct RequestScrambledShipNamesEvent
{
public:
	int                                                          NumShipNamesRequested;                             // 0x0(0x4)
};


// Size 0x28
struct SeatAnimationDefinition
{
public:
	class UClass*                                                AnimationID;                                       // 0x0(0x8)
	struct StringAssetReference                                  Into;                                              // 0x8(0x10)
	struct StringAssetReference                                  Loop;                                              // 0x18(0x10)
};


// Size 0x4
struct EventMapPiecedObtained
{
public:
	char                                                         pad0x4_DOLAS[0x4];                                 // 0x0(0x4)
};


// Size 0x10
struct BootyItemLeftShipEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	class ItemInfo*                                              ItemLeavingShip;                                   // 0x8(0x8)
};


// Size 0x58
struct RiddleTextRenderer
{
public:
	float                                                        MaskSizeScale;                                     // 0x0(0x4)
	char                                                         pad0x4_JJKP1[0x4];                                 // 0x4(0x4)
	class Font*                                                  Font;                                              // 0x8(0x8)
	float                                                        FontScale;                                         // 0x10(0x4)
	float                                                        FontMaxScale;                                      // 0x14(0x4)
	float                                                        FontScaleChange;                                   // 0x18(0x4)
	float                                                        FontLineSpacingScale;                              // 0x1c(0x4)
	TArray<String>                                               DroppedTextCharacters;                             // 0x20(0x10)
	bool                                                         VerticallyCentredText;                             // 0x30(0x1)
	bool                                                         HorizontallyCentredText;                           // 0x31(0x1)
	char                                                         pad0x2_GQ51U[0x2];                                 // 0x32(0x2)
	float                                                        MaxTextHeightRatioForRiddleText;                   // 0x34(0x4)
	float                                                        MarginSize;                                        // 0x38(0x4)
	struct Vector2D                                              OriginRatio;                                       // 0x3c(0x8)
	float                                                        StepSpacingRatio;                                  // 0x44(0x4)
	float                                                        StepSpacingWithDroppedTailInLastLineRatio;         // 0x48(0x4)
	float                                                        MaskOffsetRatio;                                   // 0x4c(0x4)
	struct Vector2D                                              MaskBorderRatio;                                   // 0x50(0x8)
};


// Size 0x1
struct PirateProfiles_PirateDetailsErrorEvent
{
public:
	char                                                         pad0x1_WUR01[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct RequestEquipmentChestItemEntitlementsEvent
{
public:
	struct FString                                               ItemCategory;                                      // 0x0(0x10)
};


// Size 0x10
struct PlayerPirateSlotCreationFailedTelemetryFragment
{
public:
	struct FString                                               FailureReason;                                     // 0x0(0x10)
};


// Size 0x4
struct EventAthenaLocalPlayerControllerConnected
{
public:
	int                                                          ControllerId;                                      // 0x0(0x4)
};


// Size 0xc0
struct RPCTelemetryFragment
{
public:
	struct RPCStats                                              RPCStats;                                          // 0x0(0xc0)
};


// Size 0x8
struct CanShowPrimaryActionButton
{
public:
	char                                                         pad0x4_3N1RR[0x4];                                 // 0x0(0x4)
	bool                                                         CanShow;                                           // 0x4(0x1)
	char                                                         pad0x3_MBU2T[0x3];                                 // 0x5(0x3)
};


// Size 0x20
struct IslandMaterialZoneStatusMapping
{
public:
	class PhysicalMaterial*                                      SurfaceMaterial;                                   // 0x0(0x8)
	bool                                                         ActivateOnStart;                                   // 0x8(0x1)
	char                                                         pad0x7_VSBQU[0x7];                                 // 0x9(0x7)
	TArray<struct Status>                                        Status;                                            // 0x10(0x10)
};


// Size 0x10
struct SwimmingCreatureImpactAnimData
{
public:
	class AnimSequenceBase*                                      ImpactAnim;                                        // 0x0(0x8)
	float                                                        MinDamageRange;                                    // 0x8(0x4)
	float                                                        MaxDamageRange;                                    // 0xc(0x4)
};


// Size 0x10
struct PlayerSetFootLocationTelemetryEvent
{
public:
	struct FString                                               LocationName;                                      // 0x0(0x10)
};


// Size 0x18
struct ServerMigrationCompletedTelemetryActorData
{
public:
	struct FString                                               ActorClass;                                        // 0x0(0x10)
	int                                                          Count;                                             // 0x10(0x4)
	char                                                         pad0x4_K3LQO[0x4];                                 // 0x14(0x4)
};


// Size 0x4
struct GraphicalSettingsTelemetryEvent
{
public:
	char                                                         pad0x4_8BHW1[0x4];                                 // 0x0(0x4)
};


// Size 0x20
struct StartedGuildedSessionEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct Guid                                                  GuildId;                                           // 0x10(0x10)
};


// Size 0xc
struct EventItemUseAINoiseEvent
{
public:
	float                                                        NoiseRange;                                        // 0x0(0x4)
	struct FName                                                 NoiseTag;                                          // 0x4(0x8)
};


// Size 0x20
struct PlayModePhrases
{
public:
	char                                                         PlayModeKey;                                       // 0x0(0x1)
	char                                                         pad0x7_HZ4O3[0x7];                                 // 0x1(0x7)
	class PhrasesRadialDataAsset*                                PhraseDataAsset;                                   // 0x8(0x8)
	class NonVerbalRadialDataAsset*                              QuickAccessDataAsset;                              // 0x10(0x8)
	class NonVerbalRadialDataAsset*                              StrategyDataAsset;                                 // 0x18(0x8)
};


// Size 0x1
struct EventCurseBoogie
{
public:
	char                                                         pad0x1_BY1N3[0x1];                                 // 0x0(0x1)
};


// Size 0x50
struct EventArmourHealthChanged
{
public:
	char                                                         pad0x48_UWMQT[0x48];                               // 0x0(0x48)
	bool                                                         ArmourDestroyed;                                   // 0x48(0x1)
	char                                                         pad0x7_T72FV[0x7];                                 // 0x49(0x7)
};


// Size 0x1
struct BootFlowStartWaitForEntryLevelEvent
{
public:
	char                                                         pad0x1_9SGYT[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct ClientReachedInGameTelemetryEvent
{
public:
	struct Guid                                                  PlayerGameId;                                      // 0x0(0x10)
	struct FString                                               SessionType;                                       // 0x10(0x10)
	struct Guid                                                  MatchmakingAttemptId;                              // 0x20(0x10)
	struct FString                                               ActiveExperiments;                                 // 0x30(0x10)
};


// Size 0x1
struct PlayersCompletedContestSpawnInRewardStage
{
public:
	char                                                         pad0x1_JWL1W[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventCapstanStoppedMoving
{
public:
	char                                                         pad0x1_MVNMG[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct CompleteExitTunnelOfTheDamnedActionStateEvent
{
public:
	char                                                         pad0x1_JSSB5[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct LoadoutRepairFailedTelemetryEvent
{
public:
	char                                                         pad0x8_A9SZK[0x8];                                 // 0x0(0x8)
	TArray<int>                                                  CarouselSeeds;                                     // 0x8(0x10)
};


// Size 0x40
struct AssetDelayLoadEntry
{
public:
	struct FString                                               Comment;                                           // 0x0(0x10)
	char                                                         LoadAtPhase;                                       // 0x10(0x1)
	char                                                         Persistence;                                       // 0x11(0x1)
	bool                                                         LoadForClient;                                     // 0x12(0x1)
	bool                                                         LoadForServer;                                     // 0x13(0x1)
	struct FName                                                 Feature;                                           // 0x14(0x8)
	char                                                         pad0x4_13KHL[0x4];                                 // 0x1c(0x4)
	TArray<struct StringAssetReference>                          AssetsToLoad;                                      // 0x20(0x10)
	TArray<Class>                                                BlueprintsToLoad;                                  // 0x30(0x10)
};


// Size 0x28
struct BlockablePlayer
{
public:
	struct FString                                               Gamertag;                                          // 0x0(0x10)
	struct FString                                               Xuid;                                              // 0x10(0x10)
	char                                                         Platform;                                          // 0x20(0x1)
	char                                                         pad0x7_OJP41[0x7];                                 // 0x21(0x7)
};


// Size 0x190
struct TutorialStepEatBanana
{
public:
	char                                                         pad0x190_YEL7Y[0x190];                             // 0x0(0x190)
};


// Size 0x1
struct EventSetFishingAnimationState
{
public:
	char                                                         State;                                             // 0x0(0x1)
};


// Size 0x10
struct DuplicateEmissaryFlagByFeatureToggle
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x0(0xc)
	bool                                                         ShouldDuplicateEmissaryFlagWhenTeleporting;        // 0xc(0x1)
	char                                                         pad0x3_TAY23[0x3];                                 // 0xd(0x3)
};


// Size 0x60
struct VoyageCompleteAnimationEvent
{
public:
	struct FText                                                 VoyageTitle;                                       // 0x0(0x38)
	struct FString                                               AudioSwitchName;                                   // 0x38(0x10)
	struct FString                                               AudioSwitchValue;                                  // 0x48(0x10)
	struct FName                                                 CompanyId;                                         // 0x58(0x8)
};


// Size 0x1
struct PlayerDoesNotRequireMermaidTelemetryEvent
{
public:
	char                                                         Reason;                                            // 0x0(0x1)
};


// Size 0x18
struct EventPlayerStatePawnPossessed
{
public:
	class PlayerState*                                           PlayerState;                                       // 0x0(0x8)
	class Pawn*                                                  PossessedPawn;                                     // 0x8(0x8)
	bool                                                         IsLocalPlayer;                                     // 0x10(0x1)
	char                                                         pad0x7_Z2O8A[0x7];                                 // 0x11(0x7)
};


// Size 0x1
struct EventDockingStateChanged
{
public:
	char                                                         pad0x1_XR4TO[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct ContestShipSinkNetworkEvent
{
public:
	char                                                         pad0x18_TBZLV[0x18];                               // 0x0(0x18)
	struct Guid                                                  CrewLiveryId;                                      // 0x18(0x10)
};


// Size 0x58
struct CategoryTab
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	struct FString                                               UniqueTextIdentifier;                              // 0x38(0x10)
	struct FString                                               IconPath;                                          // 0x48(0x10)
};


// Size 0x1
struct HideUniversalDescriptorEvent
{
public:
	char                                                         pad0x1_VBVAI[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct UseItemOnServerRpc
{
public:
	char                                                         pad0x18_N8M8U[0x18];                               // 0x0(0x18)
	class WieldableItem*                                         Item;                                              // 0x18(0x8)
};


// Size 0x1
struct StickyNotificationUpdatedMessage
{
public:
	char                                                         pad0x1_93FHW[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct SpawnCommandsAIType
{
public:
	struct FName                                                 AIClassName;                                       // 0x0(0x8)
	struct StringClassReference                                  AIPawnClass;                                       // 0x8(0x10)
	bool                                                         IsWaterBased;                                      // 0x18(0x1)
	bool                                                         IsHiddenFromMenu;                                  // 0x19(0x1)
	char                                                         pad0x6_PBFAK[0x6];                                 // 0x1a(0x6)
};


// Size 0x1
struct PirateProfilesSelectProfileErrorToUI
{
public:
	char                                                         pad0x1_MWT67[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct RemoveFogBankGameServerRequestModel
{
public:
	int                                                          ActorId;                                           // 0x0(0x4)
};


// Size 0x14
struct EntitlementMapRedirectorUsedEvent
{
public:
	struct FName                                                 DeprecatedEntitlementId;                           // 0x0(0x8)
	struct FName                                                 RedirectedToValidEntitlementId;                    // 0x8(0x8)
	int                                                          FoundIndex;                                        // 0x10(0x4)
};


// Size 0x1
struct EventAnimationWieldedItemOneShotEntered
{
public:
	char                                                         pad0x1_4IAXJ[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct UISlatePerformanceTelemetryFragment
{
public:
	char                                                         pad0x4_5I6NX[0x4];                                 // 0x0(0x4)
};


// Size 0x90
struct WeaponProjectilePendingImpact
{
public:
	double                                                       TimeStamp;                                         // 0x0(0x8)
	struct HitResult                                             HitResult;                                         // 0x8(0x80)
	bool                                                         RequiresValidation;                                // 0x88(0x1)
	bool                                                         AwaitingValidation;                                // 0x89(0x1)
	char                                                         pad0x2_33IS3[0x2];                                 // 0x8a(0x2)
	float                                                        ProjectileTimeAlive;                               // 0x8c(0x4)
};


// Size 0x1
struct EventChangeMatchmakingVisibility
{
public:
	bool                                                         MatchmakingEnabled;                                // 0x0(0x1)
};


// Size 0x18
struct CutsceneAnimationElement
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	TArray<class AnimSequenceBase*>                              OneShotSequences;                                  // 0x8(0x10)
};


// Size 0x20
struct GameEventServiceDesc
{
public:
	struct StringAssetReference                                  ServiceParamsAssetPath;                            // 0x0(0x10)
	struct StringAssetReference                                  GameEventOnDemandAvailabilityParamsAsset;          // 0x10(0x10)
};


// Size 0x1
struct PirateCreationEvent_UserPirateGenerateRequest
{
public:
	char                                                         pad0x1_9LXMT[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct HUDWalletBalance
{
public:
	char                                                         CurrencyId;                                        // 0x0(0x1)
	char                                                         pad0x7_JXTVN[0x7];                                 // 0x1(0x7)
	struct FText                                                 DisplayBalance;                                    // 0x8(0x38)
	char                                                         pad0x8_O3PC2[0x8];                                 // 0x40(0x8)
};


// Size 0x2
struct VoiceChatStatusTelemetryEvent
{
public:
	char                                                         Device;                                            // 0x0(0x1)
	bool                                                         IsInPartyChat;                                     // 0x1(0x1)
};


// Size 0x1
struct HideRejoinModalEvent
{
public:
	char                                                         pad0x1_Q63GX[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct AmbientWrecksInsRangeRemovedTelemetryEvent
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        Range;                                             // 0xc(0x4)
	int                                                          NumWrecksWithinRange;                              // 0x10(0x4)
	int                                                          NumWrecksEvicted;                                  // 0x14(0x4)
};


// Size 0x50
struct AthenaAnimationJumpingThirdPersonAnimData
{
public:
	TArray<class BlendSpace*>                                    JumpStart;                                         // 0x0(0x10)
	TArray<class BlendSpace*>                                    JumpCycle;                                         // 0x10(0x10)
	TArray<class BlendSpace*>                                    PreImpact;                                         // 0x20(0x10)
	TArray<class BlendSpace*>                                    LandLight;                                         // 0x30(0x10)
	TArray<class BlendSpace*>                                    LandHeavy;                                         // 0x40(0x10)
};


// Size 0x10
struct EventWieldableItemUseStoppedAndFullyHidden
{
public:
	class Actor*                                                 Item;                                              // 0x0(0x8)
	char                                                         PerspectiveType;                                   // 0x8(0x1)
	char                                                         pad0x7_XMYCH[0x7];                                 // 0x9(0x7)
};


// Size 0xf8
struct TakeFlameOfFateParams
{
public:
	bool                                                         IncludeTakeFlameOfFateActionRule;                  // 0x0(0x1)
	char                                                         pad0x7_0TY9Y[0x7];                                 // 0x1(0x7)
	class UClass*                                                ActionRuleNotificationInputId;                     // 0x8(0x8)
	char                                                         ActionRulePriority;                                // 0x10(0x1)
	char                                                         pad0x7_8KTM8[0x7];                                 // 0x11(0x7)
	struct FText                                                 TakeFlameOfFateTooltipText;                        // 0x18(0x38)
	struct FText                                                 LanternNotRaisedToolTipText;                       // 0x50(0x38)
	struct FText                                                 NotWieldingFlameTooltipText;                       // 0x88(0x38)
	struct FText                                                 CannotSetFlameTooltipText;                         // 0xc0(0x38)
};


// Size 0x10
struct AudioEmitterParameters
{
public:
	class WwiseObjectPoolWrapper*                                LocalEmitterPool;                                  // 0x0(0x8)
	class WwiseObjectPoolWrapper*                                RemoteEmitterPool;                                 // 0x8(0x8)
};


// Size 0x2
struct CrewArenaRivalVotingData
{
public:
	bool                                                         IsCrewMemberInFavourOfChangingArenaLobby;          // 0x0(0x1)
	char                                                         NumberOfVotes;                                     // 0x1(0x1)
};


// Size 0x1
struct BootFlowSkadiAgeRatingStateEvent
{
public:
	char                                                         pad0x1_W3J2X[0x1];                                 // 0x0(0x1)
};


// Size 0x60
struct ShovelDigActionStateConstructionInfo
{
public:
	char                                                         pad0x48_0XUZ8[0x48];                               // 0x0(0x48)
	struct NetActorPtr                                           UsableObject;                                      // 0x48(0x14)
	char                                                         pad0x4_84AJW[0x4];                                 // 0x5c(0x4)
};


// Size 0x50
struct PirateIdentifiedCategorisedLoadout
{
public:
	char                                                         pad0x50_ZTB6Z[0x50];                               // 0x0(0x50)
};


// Size 0x10
struct RequestPetChestPetEntitlementsEvent
{
public:
	struct FString                                               ItemCategory;                                      // 0x0(0x10)
};


// Size 0x4
struct MastFallenAngleChangedEvent
{
public:
	float                                                        Angle;                                             // 0x0(0x4)
};


// Size 0x20
struct GameEventItemSpawnCollection
{
public:
	TArray<struct ActorComponentSelector>                        ItemSpawnerReferences;                             // 0x0(0x10)
	bool                                                         IsOnDemand;                                        // 0x10(0x1)
	char                                                         pad0x3_DFHPJ[0x3];                                 // 0x11(0x3)
	float                                                        ChanceForMegaStashToSpawn;                         // 0x14(0x4)
	class UClass*                                                TradingCompany;                                    // 0x18(0x8)
};


// Size 0x1
struct PlayerRequiresMermaidTelemetryEvent
{
public:
	char                                                         Reason;                                            // 0x0(0x1)
};


// Size 0x78
struct TunnelOfTheDamnedInstance
{
public:
	class UClass*                                                CurrentTunnelArtStyle;                             // 0x0(0x8)
	char                                                         pad0x70_7LTUA[0x70];                               // 0x8(0x70)
};


// Size 0xc
struct EncounterParams
{
public:
	char                                                         EncounterType;                                     // 0x0(0x1)
	char                                                         pad0x3_I3RLE[0x3];                                 // 0x1(0x3)
	float                                                        EncounterRadius;                                   // 0x4(0x4)
	char                                                         EncounterDimensions;                               // 0x8(0x1)
	char                                                         EncounterMobility;                                 // 0x9(0x1)
	char                                                         pad0x2_N2GID[0x2];                                 // 0xa(0x2)
};


// Size 0x10
struct FragmentMarker
{
public:
	struct FString                                               Marker;                                            // 0x0(0x10)
};


// Size 0x20
struct TaleQuestFailedNetworkEvent
{
public:
	char                                                         pad0x18_A2S1M[0x18];                               // 0x0(0x18)
	class UClass*                                                FailureRunnable;                                   // 0x18(0x8)
};


// Size 0x8
struct AISwimmingCreatureDeadActionStateEventMapItem
{
public:
	char                                                         Event;                                             // 0x0(0x1)
	char                                                         pad0x3_YH7SL[0x3];                                 // 0x1(0x3)
	float                                                        FireAtTimeLeftInState;                             // 0x4(0x4)
};


// Size 0x30
struct EmissaryLeaderboardScoreUpdatedNetworkEvent
{
public:
	char                                                         pad0x18_1GS0R[0x18];                               // 0x0(0x18)
	struct FName                                                 EmissaryAffiliation;                               // 0x18(0x8)
	char                                                         pad0x10_JU7VN[0x10];                               // 0x20(0x10)
};


// Size 0x24
struct BucketTossTelemetryEvent
{
public:
	struct Vector                                                BucketPosition;                                    // 0x0(0xc)
	struct Vector                                                LaunchPosition;                                    // 0xc(0xc)
	int                                                          DistBucketToLaunch;                                // 0x18(0x4)
	int                                                          DistPlayerToLaunch;                                // 0x1c(0x4)
	int                                                          DistPlayerToBucket;                                // 0x20(0x4)
};


// Size 0x20
struct EventUserGameSettingsSetKeyBindingToInvalid
{
public:
	char                                                         BindingSet;                                        // 0x0(0x1)
	char                                                         pad0x7_67JCU[0x7];                                 // 0x1(0x7)
	struct FString                                               BindingName;                                       // 0x8(0x10)
	char                                                         ControllerType;                                    // 0x18(0x1)
	char                                                         Instigator;                                        // 0x19(0x1)
	char                                                         pad0x6_N38VX[0x6];                                 // 0x1a(0x6)
};


// Size 0x28
struct TextureGroupMemorySummary
{
public:
	struct FString                                               TextureGroupName;                                  // 0x0(0x10)
	char                                                         pad0x18_XWRVB[0x18];                               // 0x10(0x18)
};


// Size 0x24
struct FortCompletedTelemetryEvent
{
public:
	struct Guid                                                  FortId;                                            // 0x0(0x10)
	struct FName                                                 FortIsland;                                        // 0x10(0x8)
	struct FName                                                 FortType;                                          // 0x18(0x8)
	bool                                                         PresentForCompletion;                              // 0x20(0x1)
	char                                                         pad0x3_8ILV9[0x3];                                 // 0x21(0x3)
};


// Size 0x1
struct CachingOfShipPreviewLoadoutsCompleteEvent
{
public:
	char                                                         pad0x1_BE8DY[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct LoadedItemTelemetryEvent
{
public:
	struct FString                                               LoadedItem;                                        // 0x0(0x10)
	struct FString                                               ItemContainer;                                     // 0x10(0x10)
};


// Size 0x20
struct CaptainsLogAccoladesCommittedEvent
{
public:
	TArray<String>                                               PirateAccolades;                                   // 0x0(0x10)
	TArray<String>                                               ShipAccolades;                                     // 0x10(0x10)
};


// Size 0x1
struct EventPlayerExitedSinkingTunnelActionState
{
public:
	char                                                         pad0x1_F9KXH[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct LoadableProjectileData
{
public:
	struct StringAssetReference                                  DataAsset;                                         // 0x0(0x10)
	int                                                          GeneratedDataRNGSeed;                              // 0x10(0x4)
	bool                                                         ShouldProjectileTrailDoReflections;                // 0x14(0x1)
	char                                                         pad0x3_5AJJW[0x3];                                 // 0x15(0x3)
};


// Size 0x8
struct ShipLeftTunnelOfTheDamnedEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
};


// Size 0x1
struct ArenaTutorialFinishedEvent
{
public:
	char                                                         pad0x1_3B6WX[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventHdrSettingsVisible
{
public:
	bool                                                         Visible;                                           // 0x0(0x1)
};


// Size 0x68
struct EmissaryProgressUpdatedNotificationUIEvent
{
public:
	float                                                        Old;                                               // 0x0(0x4)
	float                                                        New;                                               // 0x4(0x4)
	struct FString                                               CompanyId;                                         // 0x8(0x10)
	struct FString                                               RankIncreaseAudioCue;                              // 0x18(0x10)
	struct FString                                               RankIncreaseStopAudioCue;                          // 0x28(0x10)
	struct FString                                               RankLevelUpAudioCue;                               // 0x38(0x10)
	struct FString                                               RankTriggerAudioCue;                               // 0x48(0x10)
	struct FString                                               RankLevelUpMusicCue;                               // 0x58(0x10)
};


// Size 0x20
struct PetLoadoutItem
{
public:
	class UClass*                                                PetEntitlementDesc;                                // 0x0(0x8)
	class UClass*                                                PetCustomizationDesc;                              // 0x8(0x8)
	struct FString                                               PetName;                                           // 0x10(0x10)
};


// Size 0x1
struct PirateCreationEvent_RefreshButtonPressed
{
public:
	char                                                         pad0x1_SGYQ6[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct BuoyancyStateChanged
{
public:
	char                                                         pad0x10_SDH1L[0x10];                               // 0x0(0x10)
};


// Size 0x20
struct MerchantQuestContractExpiredNetworkEvent
{
public:
	char                                                         pad0x18_IBIRO[0x18];                               // 0x0(0x18)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x18(0x8)
};


// Size 0x1
struct ShipSpawnedTelemetryEvent
{
public:
	char                                                         pad0x1_R3DAH[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct StagingPlayerWelcomingPopup
{
public:
	char                                                         pad0x18_FV9O2[0x18];                               // 0x0(0x18)
	struct Guid                                                  LiveryID;                                          // 0x18(0x10)
};


// Size 0x20
struct QueryConfirmInviteResponse
{
public:
	bool                                                         IsInviteConfirmationPending;                       // 0x0(0x1)
	char                                                         pad0x7_J0RO8[0x7];                                 // 0x1(0x7)
	struct FString                                               ErrorMessage;                                      // 0x8(0x10)
	bool                                                         IsErrorMessage;                                    // 0x18(0x1)
	char                                                         pad0x7_DZ59V[0x7];                                 // 0x19(0x7)
};


// Size 0x8
struct EventCurrentShipChanged
{
public:
	class Actor*                                                 CurrentShip;                                       // 0x0(0x8)
};


// Size 0x68
struct EventEmblemUnlockedNotification
{
public:
	struct FName                                                 CompanyName;                                       // 0x0(0x8)
	struct FName                                                 FriendlyName;                                      // 0x8(0x8)
	struct FText                                                 EmblemName;                                        // 0x10(0x38)
	struct FString                                               EmblemUrl;                                         // 0x48(0x10)
	struct FString                                               BackgroundUrl;                                     // 0x58(0x10)
};


// Size 0x1
struct QuestAbortedTelemetryEvent
{
public:
	char                                                         pad0x1_RYLMC[0x1];                                 // 0x0(0x1)
};


// Size 0x50
struct LightingControllerAssetParams
{
public:
	class MaterialParameterCollection*                           AtmosphericMaterialParams;                         // 0x0(0x8)
	class MaterialParameterCollection*                           CloudMaterialParams;                               // 0x8(0x8)
	class MaterialParameterCollection*                           ScreenEffectsMaterialParams;                       // 0x10(0x8)
	class MaterialParameterCollection*                           IslandDangerMaterialParams;                        // 0x18(0x8)
	class LightingControllerSettings*                            UnderworldLightingSet;                             // 0x20(0x8)
	class LightingControllerSettings*                            HideoutLightingSet;                                // 0x28(0x8)
	class LightingControllerSettings*                            ArenaTavernLightingSet;                            // 0x30(0x8)
	class StaticMesh*                                            SkyDomeMesh;                                       // 0x38(0x8)
	class StaticMesh*                                            NorthStarMesh;                                     // 0x40(0x8)
	class StaticMesh*                                            MoonMesh;                                          // 0x48(0x8)
};


// Size 0x50
struct ProposedVoyageEntry
{
public:
	class VoyageProposalDesc*                                    ProposalDesc;                                      // 0x0(0x8)
	class VoyageProposalDesc*                                    VisualsProposalDesc;                               // 0x8(0x8)
	class VoyageProposalDesc*                                    TemplateProposalDesc;                              // 0x10(0x8)
	class VoyageRecipeDataAsset*                                 VoyageRecipe;                                      // 0x18(0x8)
	int                                                          Rank;                                              // 0x20(0x4)
	char                                                         pad0x4_VNY5G[0x4];                                 // 0x24(0x4)
	class UClass*                                                Company;                                           // 0x28(0x8)
	class PlayerState*                                           ProposingPlayerState;                              // 0x30(0x8)
	struct FString                                               InstanceId;                                        // 0x38(0x10)
	bool                                                         VoyageIsShipEntitlement;                           // 0x48(0x1)
	bool                                                         LimitedVoyage;                                     // 0x49(0x1)
	bool                                                         WantDiveToTunnel;                                  // 0x4a(0x1)
	bool                                                         PendingDeferredTunnelCancellation;                 // 0x4b(0x1)
	char                                                         pad0x4_QPQ1Z[0x4];                                 // 0x4c(0x4)
};


// Size 0x10
struct MeleeAttackMoveSpeedValidationTelemetryEvent
{
public:
	char                                                         CorrectionReason;                                  // 0x0(0x1)
	char                                                         pad0x3_8YPX7[0x3];                                 // 0x1(0x3)
	float                                                        AllowedWindowStartTimeSeconds;                     // 0x4(0x4)
	float                                                        AllowedWindowFinishTimeSeconds;                    // 0x8(0x4)
	float                                                        CurrentAttackClientTimeSeconds;                    // 0xc(0x4)
};


// Size 0x110
struct StorageContainerRefresher
{
public:
	char                                                         pad0x110_HIL4L[0x110];                             // 0x0(0x110)
};


// Size 0x30
struct EntitlementInfo
{
public:
	struct FString                                               InstanceId;                                        // 0x0(0x10)
	struct FString                                               CatalogItemId;                                     // 0x10(0x10)
	struct FString                                               Signature;                                         // 0x20(0x10)
};


// Size 0x68
struct TaleQuestParams
{
public:
	char                                                         pad0x68_SDWU2[0x68];                               // 0x0(0x68)
};


// Size 0x1
struct BootFlowStartMarketingOptInStateEvent
{
public:
	char                                                         pad0x1_JC2V6[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct CreateSphereTriggerGameServerRequestModel
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
};


// Size 0x30
struct PirateInventoryItemModel
{
public:
	struct FString                                               InstanceId;                                        // 0x0(0x10)
	struct FString                                               CatalogItemId;                                     // 0x10(0x10)
	struct FString                                               Signature;                                         // 0x20(0x10)
};


// Size 0x78
struct EventPlayerPirateIdentityReady
{
public:
	char                                                         pad0x78_NX0IR[0x78];                               // 0x0(0x78)
};


// Size 0x1
struct EventPlayerOpenChatbox
{
public:
	char                                                         pad0x1_Y88YW[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct RadialInventorySlotHighlighted
{
public:
	char                                                         pad0x4_7RNGS[0x4];                                 // 0x0(0x4)
	int                                                          SlotIndex;                                         // 0x4(0x4)
};


// Size 0x10
struct PirateDeletionSucceededEvent
{
public:
	struct FString                                               PirateId;                                          // 0x0(0x10)
};


// Size 0x1
struct EventThrowingKnifeRestock
{
public:
	char                                                         pad0x1_I7LHI[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct CanvasWorldMapGeneric
{
public:
	class Actor*                                                 MarkerActor;                                       // 0x0(0x8)
	class Texture*                                               Icon;                                              // 0x8(0x8)
	struct Vector                                                Location;                                          // 0x10(0xc)
	bool                                                         HasLocationSet;                                    // 0x1c(0x1)
	char                                                         pad0x3_MBRNQ[0x3];                                 // 0x1d(0x3)
};


// Size 0x10
struct CarouselPirateClothingCategoryBias
{
public:
	class UClass*                                                Category;                                          // 0x0(0x8)
	float                                                        LikelihoodOfHaving;                                // 0x8(0x4)
	bool                                                         ProgressivlyDecreaseChance;                        // 0xc(0x1)
	char                                                         pad0x3_N2G7H[0x3];                                 // 0xd(0x3)
};


// Size 0x30
struct ProjectileWeaponClientDebugLogRPC
{
public:
	char                                                         pad0x18_F8JDU[0x18];                               // 0x0(0x18)
	class ProjectileWeapon*                                      Weapon;                                            // 0x18(0x8)
	TArray<String>                                               ClientDebugStrings;                                // 0x20(0x10)
};


// Size 0x10
struct WaterBarrelFeedbackLevel
{
public:
	float                                                        Strength;                                          // 0x0(0x4)
	char                                                         pad0x4_TAZIV[0x4];                                 // 0x4(0x4)
	class ForceFeedbackEffect*                                   Effect;                                            // 0x8(0x8)
};


// Size 0x14
struct EncounterHandle
{
public:
	char                                                         pad0x14_WXHA0[0x14];                               // 0x0(0x14)
};


// Size 0x30
struct SessionManagementCommandSetSessionLeaderStatus
{
public:
	char                                                         pad0x20_BU6WF[0x20];                               // 0x0(0x20)
	class PlayerState*                                           PlayerState;                                       // 0x20(0x8)
	bool                                                         ShouldBeSessionLeader;                             // 0x28(0x1)
	char                                                         pad0x7_N675C[0x7];                                 // 0x29(0x7)
};


// Size 0x14
struct ReapersMarkLevelChanged
{
public:
	int                                                          NewLevel;                                          // 0x0(0x4)
	struct Guid                                                  AssociatedCrew;                                    // 0x4(0x10)
};


// Size 0x38
struct SinkingTunnelOfTheDamnedActionStateSerialisableData
{
public:
	char                                                         pad0x30_I5NMZ[0x30];                               // 0x0(0x30)
	bool                                                         FadeRequested;                                     // 0x30(0x1)
	char                                                         pad0x7_V2ICK[0x7];                                 // 0x31(0x7)
};


// Size 0x30
struct CachedIslandStore
{
public:
	char                                                         pad0x30_KTVBO[0x30];                               // 0x0(0x30)
};


// Size 0x38
struct AggressiveGhostShipProjectileShotTelemetryEvent
{
public:
	struct Guid                                                  ShipId;                                            // 0x0(0x10)
	struct Guid                                                  ProjectileAttackId;                                // 0x10(0x10)
	struct FString                                               ProjectileType;                                    // 0x20(0x10)
	char                                                         Target;                                            // 0x30(0x1)
	char                                                         pad0x7_MZ8LS[0x7];                                 // 0x31(0x7)
};


// Size 0x48
struct ContestStartEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
	struct FString                                               CrewIcon;                                          // 0x10(0x10)
	struct FString                                               CrewName;                                          // 0x20(0x10)
	TArray<String>                                               CrewMembers;                                       // 0x30(0x10)
	float                                                        HoldDuration;                                      // 0x40(0x4)
	char                                                         pad0x4_Z2M30[0x4];                                 // 0x44(0x4)
};


// Size 0xc
struct AthenaCharacterDodgeEvent
{
public:
	struct Vector                                                DodgeDirection;                                    // 0x0(0xc)
};


// Size 0x10
struct WieldableReplicaAdditionalMeshData
{
public:
	class StaticMesh*                                            StaticMesh;                                        // 0x0(0x8)
	struct FName                                                 AttachSocketName;                                  // 0x8(0x8)
};


// Size 0x58
struct EndedHangingTelemetry
{
public:
	double                                                       TimeSpentHangingFromPoint;                         // 0x0(0x8)
	float                                                        DistanceTravelledWhileHanging;                     // 0x8(0x4)
	char                                                         pad0x4_SG2UT[0x4];                                 // 0xc(0x4)
	struct FString                                               HangingComponentOwner;                             // 0x10(0x10)
	struct FString                                               HangingComponentName;                              // 0x20(0x10)
	bool                                                         IsPlayerOnOwnShip;                                 // 0x30(0x1)
	char                                                         pad0x3_RQJTZ[0x3];                                 // 0x31(0x3)
	struct Guid                                                  ShipId;                                            // 0x34(0x10)
	struct Guid                                                  HangingId;                                         // 0x44(0x10)
	char                                                         pad0x4_MU8RD[0x4];                                 // 0x54(0x4)
};


// Size 0x1
struct EventPlayerControllerHitNotificationOld
{
public:
	bool                                                         PlaySfx;                                           // 0x0(0x1)
};


// Size 0x10
struct ShopUpsellOfferResponse
{
public:
	struct FString                                               OfferId;                                           // 0x0(0x10)
};


// Size 0x28
struct TunnelOfTheDamnedCancellationReminderNetworkEvent
{
public:
	char                                                         pad0x18_188Q2[0x18];                               // 0x0(0x18)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x18(0x8)
	class UClass*                                                Company;                                           // 0x20(0x8)
};


// Size 0x1
struct EventRefreshIslandEventData
{
public:
	char                                                         pad0x1_P61UG[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct AchievementSailCloseToShipWithoutFiring
{
public:
	float                                                        RangeToRemainWithinInMetres;                       // 0x0(0x4)
	float                                                        DistanceToTravelInMetres;                          // 0x4(0x4)
	char                                                         pad0x10_RYIRW[0x10];                               // 0x8(0x10)
};


// Size 0x10
struct PurchasePremiumCurrencyErrorEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x10
struct VoyageHandInEntry
{
public:
	class VoyageRecipeDataAsset*                                 VoyageRecipe;                                      // 0x0(0x8)
	class UClass*                                                Item;                                              // 0x8(0x8)
};


// Size 0xc0
struct CharacterSocketCollisionResult
{
public:
	bool                                                         HasHit;                                            // 0x0(0x1)
	char                                                         pad0x3_IDHNW[0x3];                                 // 0x1(0x3)
	struct HitResult                                             HitResult;                                         // 0x4(0x80)
	struct Vector                                                SocketVelocity;                                    // 0x84(0xc)
	struct Transform                                             SocketTransform;                                   // 0x90(0x30)
};


// Size 0xc
struct MountpointWaterLevelParams
{
public:
	float                                                        WaterLevelDifferenceBetweenUpdates;                // 0x0(0x4)
	float                                                        ZOffsetFromWaterToDisableMountpoint;               // 0x4(0x4)
	char                                                         pad0x4_HXIYM[0x4];                                 // 0x8(0x4)
};


// Size 0x10
struct PlayerGameEndTelemetryEvent
{
public:
	char                                                         pad0xc_CZ7IM[0xc];                                 // 0x0(0xc)
	bool                                                         IsMigration;                                       // 0xc(0x1)
	bool                                                         HadSTTEnabled;                                     // 0xd(0x1)
	bool                                                         HadTTSEnabled;                                     // 0xe(0x1)
	bool                                                         HadTranslationEnabled;                             // 0xf(0x1)
};


// Size 0xc
struct SeaRock
{
public:
	struct Vector2D                                              Location;                                          // 0x0(0x8)
	float                                                        Radius;                                            // 0x8(0x4)
};


// Size 0x38
struct TunnelOfTheDamnedBaseTelemetryFragmentInput
{
public:
	struct Guid                                                  TunnelInstanceId;                                  // 0x0(0x10)
	struct FString                                               TunnelType;                                        // 0x10(0x10)
	struct FString                                               TunnelDescName;                                    // 0x20(0x10)
	double                                                       TunnelLifetimeSeconds;                             // 0x30(0x8)
};


// Size 0x8
struct EmissaryLevelMultiplierModel
{
public:
	int                                                          Level;                                             // 0x0(0x4)
	float                                                        Multiplier;                                        // 0x4(0x4)
};


// Size 0x8
struct MimicTransformAudioEvent
{
public:
	class WwiseEvent*                                            MimicTransform;                                    // 0x0(0x8)
};


// Size 0x48
struct PlayerBaseTelemetryFragment
{
public:
	struct Guid                                                  PlayerGameId;                                      // 0x0(0x10)
	struct FString                                               UserId;                                            // 0x10(0x10)
	struct FString                                               PirateId;                                          // 0x20(0x10)
	char                                                         PlatformId;                                        // 0x30(0x1)
	char                                                         pad0x7_NRNHG[0x7];                                 // 0x31(0x7)
	struct FString                                               DeviceID;                                          // 0x38(0x10)
};


// Size 0x18
struct RequestClothingChestActionEvent
{
public:
	char                                                         Action;                                            // 0x0(0x1)
	char                                                         pad0x7_SLT3P[0x7];                                 // 0x1(0x7)
	struct FString                                               Subject;                                           // 0x8(0x10)
};


// Size 0x40
struct NoiseMakerController
{
public:
	class NoiseMakerControllerParams*                            NoiseMakerParams;                                  // 0x0(0x8)
	float                                                        MaxRunningSpeed;                                   // 0x8(0x4)
	float                                                        SimulatedMaxRunningSpeed;                          // 0xc(0x4)
	char                                                         pad0x30_GFXSI[0x30];                               // 0x10(0x30)
};


// Size 0xc
struct GhostPlayModeParameters
{
public:
	char                                                         PlayMode;                                          // 0x0(0x1)
	char                                                         pad0x3_P1GP3[0x3];                                 // 0x1(0x3)
	float                                                        RotationPerSecond;                                 // 0x4(0x4)
	float                                                        DisplacementPerSecond;                             // 0x8(0x4)
};


// Size 0x1
struct EventFaunaAnimationStartSnakeStrike
{
public:
	char                                                         pad0x1_GG9IQ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct PirateProfiles_RenameErrorEvent
{
public:
	char                                                         pad0x1_SB2SQ[0x1];                                 // 0x0(0x1)
};


// Size 0x5
struct HiddenActionStateParams
{
public:
	bool                                                         MakeInvincibleWhileInState;                        // 0x0(0x1)
	bool                                                         DisableCollisionWhileInState;                      // 0x1(0x1)
	bool                                                         MakeInvisibleWhileInState;                         // 0x2(0x1)
	bool                                                         HideNamePlatesWhileInState;                        // 0x3(0x1)
	bool                                                         DisableGravityWhileInState;                        // 0x4(0x1)
};


// Size 0x28
struct AthenaAnimationLadderTransitionsAnimData
{
public:
	class AnimSequence*                                          ClimbOnTop;                                        // 0x0(0x8)
	class AnimSequence*                                          ClimbOffTop;                                       // 0x8(0x8)
	class AnimSequence*                                          ClimbOnBottom;                                     // 0x10(0x8)
	class AnimSequence*                                          ClimbOffBottom;                                    // 0x18(0x8)
	class AnimSequence*                                          ClamberOffTop;                                     // 0x20(0x8)
};


// Size 0x24
struct ArrivalTunnelOfTheDamnedActionStateParams
{
public:
	float                                                        FadeDuration;                                      // 0x0(0x4)
	float                                                        FadeEventTimeout;                                  // 0x4(0x4)
	float                                                        FadeServerTimeout;                                 // 0x8(0x4)
	struct LinearColor                                           FadeColour;                                        // 0xc(0x10)
	float                                                        ClientSetupResponseTimeout;                        // 0x1c(0x4)
	float                                                        OverrideWaitNetRelevancyTimeout;                   // 0x20(0x4)
};


// Size 0x28
struct GetPirateSlotProfileSummary
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
	struct FString                                               Name;                                              // 0x10(0x10)
	int                                                          Index;                                             // 0x20(0x4)
	char                                                         pad0x4_B1V57[0x4];                                 // 0x24(0x4)
};


// Size 0x1
struct RequestRestoreShopEvent
{
public:
	char                                                         pad0x1_WN3AN[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct CancelLogonQueueEventToGame
{
public:
	char                                                         pad0x1_IBHG7[0x1];                                 // 0x0(0x1)
};


// Size 0xb0
struct VoyageBegunAnimationEvent
{
public:
	struct FText                                                 ShipName;                                          // 0x0(0x38)
	TArray<String>                                               CrewMembers;                                       // 0x38(0x10)
	int                                                          ChapterIndex;                                      // 0x48(0x4)
	int                                                          ChapterCount;                                      // 0x4c(0x4)
	struct FText                                                 VoyageTitle;                                       // 0x50(0x38)
	struct FString                                               AudioSwitchName;                                   // 0x88(0x10)
	struct FString                                               AudioSwitchValue;                                  // 0x98(0x10)
	struct FName                                                 CompanyId;                                         // 0xa8(0x8)
};


// Size 0x10
struct EventPlayerBucketEmpty
{
public:
	bool                                                         ThrownAhead;                                       // 0x0(0x1)
	char                                                         pad0x7_ZYVTD[0x7];                                 // 0x1(0x7)
	class Actor*                                                 LiquidSource;                                      // 0x8(0x8)
};


// Size 0x8
struct EventPlayerLeftProximity
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x1
struct BootFlowCrossInputMatchmakingStateEvent
{
public:
	bool                                                         CrossInput;                                        // 0x0(0x1)
};


// Size 0x20
struct DebugSuperSailorSetFwdSpeedRPCEvent
{
public:
	char                                                         pad0x18_BZDJ0[0x18];                               // 0x0(0x18)
	float                                                        FwdSpd;                                            // 0x18(0x4)
	char                                                         pad0x4_REV75[0x4];                                 // 0x1c(0x4)
};


// Size 0x28
struct QuestTableCompanyVoyageSelectedEvent
{
public:
	struct FString                                               InstanceId;                                        // 0x0(0x10)
	struct FString                                               ProposalDesc;                                      // 0x10(0x10)
	bool                                                         DiveToDestination;                                 // 0x20(0x1)
	char                                                         VoyageType;                                        // 0x21(0x1)
	char                                                         pad0x6_EJMTR[0x6];                                 // 0x22(0x6)
};


// Size 0x10
struct RewindComponentParameters
{
public:
	float                                                        MaxTimeSpan;                                       // 0x0(0x4)
	float                                                        TimeStampModifier;                                 // 0x4(0x4)
	float                                                        MaxPredictionTimeDelta;                            // 0x8(0x4)
	int                                                          MaxRecordPerSecond;                                // 0xc(0x4)
};


// Size 0x20
struct OnlinePermissionsRequestMap
{
public:
	struct UniqueNetIdRepl                                       PlayerUserId;                                      // 0x0(0x18)
	char                                                         HasPermission;                                     // 0x1c(0x1)
	char                                                         pad0x3_4D5D7[0x3];                                 // 0x1d(0x3)
};


// Size 0x40
struct VoyageComplete
{
public:
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x0(0x1)
	char                                                         pad0x7_ZVEBU[0x7];                                 // 0x1(0x7)
	struct FText                                                 Title;                                             // 0x8(0x38)
};


// Size 0x38
struct EventPlayerEnteredIslandVicinityBoxedRpc
{
public:
	char                                                         pad0x18_H5GTG[0x18];                               // 0x0(0x18)
	class Actor*                                                 Player;                                            // 0x18(0x8)
	char                                                         pad0x8_JSPBL[0x8];                                 // 0x20(0x8)
	struct FName                                                 IslandName;                                        // 0x28(0x8)
	char                                                         pad0x8_HWFY0[0x8];                                 // 0x30(0x8)
};


// Size 0x1
struct TutorialLegendaryTavernStrangerPlaySummonSFXEvent
{
public:
	char                                                         pad0x1_WYEKK[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventCapstanStartedMoving
{
public:
	char                                                         pad0x1_9PQBG[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct UnequipAllTrinketsOfClassOnServerLoadoutRpc
{
public:
	char                                                         pad0x18_4EEJ4[0x18];                               // 0x0(0x18)
	struct NetSubObjectPtr                                       TrinketLoadoutComponent;                           // 0x18(0x14)
	char                                                         pad0x4_CDMWI[0x4];                                 // 0x2c(0x4)
	class UClass*                                                TrinketToUnequip;                                  // 0x30(0x8)
	bool                                                         ShouldVerifyCaptainsPermissions;                   // 0x38(0x1)
	char                                                         pad0x7_ZTM9D[0x7];                                 // 0x39(0x7)
};


// Size 0x4
struct ClearRadialInventory
{
public:
	char                                                         pad0x4_GP5ED[0x4];                                 // 0x0(0x4)
};


// Size 0x1c
struct LocationGeneratorSample
{
public:
	char                                                         Type;                                              // 0x0(0x1)
	char                                                         pad0x3_P8TWW[0x3];                                 // 0x1(0x3)
	struct Vector                                                Location;                                          // 0x4(0xc)
	struct Vector                                                Normal;                                            // 0x10(0xc)
};


// Size 0x14
struct VaultReserved
{
public:
	bool                                                         IsReserved;                                        // 0x0(0x1)
	char                                                         pad0x3_KQ1H0[0x3];                                 // 0x1(0x3)
	struct Guid                                                  CrewId;                                            // 0x4(0x10)
};


// Size 0x20
struct ChatModerationRequestPlayerIds
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct FString                                               PirateId;                                          // 0x10(0x10)
};


// Size 0x10
struct ShipNameChangedEvent
{
public:
	struct FString                                               ShipName;                                          // 0x0(0x10)
};


// Size 0x1
struct ShipRestockedTelemetryEvent
{
public:
	char                                                         pad0x1_421Y2[0x1];                                 // 0x0(0x1)
};


// Size 0x58
struct BountyQuestTargetDefeatedNetworkEvent
{
public:
	char                                                         pad0x18_5X3E4[0x18];                               // 0x0(0x18)
	struct FText                                                 TargetName;                                        // 0x18(0x38)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x50(0x8)
};


// Size 0x40
struct LobbyCrewMember
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
	struct FString                                               Gamertag;                                          // 0x10(0x10)
	char                                                         Platform;                                          // 0x20(0x1)
	char                                                         pad0x1f_6AWDI[0x1f];                               // 0x21(0x1f)
};


// Size 0x1
struct InvasionDepartureTunnelRivalCrewFoundEvent
{
public:
	char                                                         pad0x1_FCKB9[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct RequestPremiumShopOffersEvent
{
public:
	struct FString                                               CatalogName;                                       // 0x0(0x10)
};


// Size 0x8
struct EventCutsceneTargetReady
{
public:
	class Actor*                                                 CutsceneTarget;                                    // 0x0(0x8)
};


// Size 0x10
struct EventAIUseAlternateLocomotionSet
{
public:
	bool                                                         UseAlternateLocomotionSet;                         // 0x0(0x1)
	char                                                         pad0x7_APNFS[0x7];                                 // 0x1(0x7)
	class UClass*                                                WieldedItemAnimationStoreId;                       // 0x8(0x8)
};


// Size 0x50
struct HitRegTrailData
{
public:
	TArray<struct Vector>                                        Trail;                                             // 0x0(0x10)
	float                                                        DistanceBeforeGravity;                             // 0x10(0x4)
	bool                                                         GravityActivated;                                  // 0x14(0x1)
	bool                                                         HitSomething;                                      // 0x15(0x1)
	char                                                         pad0x2_B4SCC[0x2];                                 // 0x16(0x2)
	struct Vector                                                GravityStartPoint;                                 // 0x18(0xc)
	struct Vector                                                ImpactPoint;                                       // 0x24(0xc)
	class PrimitiveComponent*                                    ImpactedComponent;                                 // 0x30(0x8)
	struct FString                                               ImpactedActorName;                                 // 0x38(0x10)
	int                                                          ImpactedActorNetId;                                // 0x48(0x4)
	char                                                         pad0x4_K5HMV[0x4];                                 // 0x4c(0x4)
};


// Size 0x1c
struct AthenaAnimationIKFootplantingAnimData
{
public:
	bool                                                         Active;                                            // 0x0(0x1)
	char                                                         pad0x3_ZYD93[0x3];                                 // 0x1(0x3)
	float                                                        HipHeight;                                         // 0x4(0x4)
	float                                                        HipPullStrength;                                   // 0x8(0x4)
	float                                                        DownDistance;                                      // 0xc(0x4)
	float                                                        DownDistanceRangeStart;                            // 0x10(0x4)
	float                                                        DownDistanceRangeEnd;                              // 0x14(0x4)
	float                                                        IKLegStretch;                                      // 0x18(0x4)
};


// Size 0x20
struct PirateProfiles_RenameProfileEvent
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
	struct FString                                               NewName;                                           // 0x10(0x10)
};


// Size 0x1
struct QuitGameEvent
{
public:
	char                                                         pad0x1_S4Q63[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct UIIntegerOptionSelectedTelemetryEvent
{
public:
	struct FString                                               Option;                                            // 0x0(0x10)
	int                                                          Value;                                             // 0x10(0x4)
	char                                                         pad0x4_L90QI[0x4];                                 // 0x14(0x4)
};


// Size 0x20
struct LinkedXuidModel
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct FString                                               Gamertag;                                          // 0x10(0x10)
};


// Size 0x20
struct CrewSizeToCloseDelayDurationInfo
{
public:
	TArray<class Class*>                                         VaultKeyDescs;                                     // 0x0(0x10)
	TArray<float>                                                CrewSizeToCloseDelayDuration;                      // 0x10(0x10)
};


// Size 0x20
struct PiratePreviewView
{
public:
	struct FName                                                 CameraName;                                        // 0x0(0x8)
	struct FName                                                 LookAtBoneName;                                    // 0x8(0x8)
	class AnimationAsset*                                        Anim;                                              // 0x10(0x8)
	bool                                                         ShouldSpin;                                        // 0x18(0x1)
	char                                                         pad0x7_X5RNF[0x7];                                 // 0x19(0x7)
};


// Size 0x80
struct AthenaAnimationAsyncLoadedObjectJumpingAnimationsPitchOverride
{
public:
	char                                                         pad0x80_2L4N3[0x80];                               // 0x0(0x80)
};


// Size 0x8
struct EventPlayerUndoRepairStart
{
public:
	char                                                         pad0x8_P09DD[0x8];                                 // 0x0(0x8)
};


// Size 0x10
struct ShipCustomizationSavedLoadoutUpdatedEvent
{
public:
	char                                                         pad0x10_0MCDR[0x10];                               // 0x0(0x10)
};


// Size 0x18
struct RequiredShipCustomizationData
{
public:
	int                                                          RequiredNumberToMatch;                             // 0x0(0x4)
	char                                                         pad0x4_EQ1FL[0x4];                                 // 0x4(0x4)
	TArray<class Class*>                                         RequiredShipCustomizations;                        // 0x8(0x10)
};


// Size 0x18
struct WeightedItemDescSpawnDataAssetWithWeight
{
public:
	class WeightedItemDescSpawnDataAsset*                        WeightedItemSpawnDataAsset;                        // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	bool                                                         LimitMaxSpawnedItems;                              // 0xc(0x1)
	char                                                         pad0x3_AY2CF[0x3];                                 // 0xd(0x3)
	int                                                          MaxTimesCanBeSelected;                             // 0x10(0x4)
	char                                                         pad0x4_6OA3R[0x4];                                 // 0x14(0x4)
};


// Size 0x1
struct BootFlowStartSessionSelectStateEvent
{
public:
	char                                                         pad0x1_BJ7UW[0x1];                                 // 0x0(0x1)
};


// Size 0xc
struct ClientHitchRegisteredFrameEvent
{
public:
	char                                                         HitchSeverity;                                     // 0x0(0x1)
	char                                                         pad0x3_P0PL9[0x3];                                 // 0x1(0x3)
	float                                                        FrameMs;                                           // 0x4(0x4)
	float                                                        TargetFrameMs;                                     // 0x8(0x4)
};


// Size 0x18
struct PuzzleVaultStartedTelemetryEvent
{
public:
	struct Guid                                                  VaultId;                                           // 0x0(0x10)
	struct FName                                                 VaultType;                                         // 0x10(0x8)
};


// Size 0x18
struct MeshMemoryConstraintShipPartMeshSetDelayedHealthReport
{
public:
	bool                                                         DescIsValid;                                       // 0x0(0x1)
	bool                                                         ShouldDescBeReloaded;                              // 0x1(0x1)
	char                                                         pad0x6_GEWX9[0x6];                                 // 0x2(0x6)
	struct FString                                               DescAssetPathName;                                 // 0x8(0x10)
};


// Size 0x18
struct SplineTransitionLadderActionFinishedMessage
{
public:
	char                                                         pad0x10_BUJ90[0x10];                               // 0x0(0x10)
	float                                                        TimeCompleted;                                     // 0x10(0x4)
	char                                                         pad0x4_DFCPO[0x4];                                 // 0x14(0x4)
};


// Size 0x8
struct LightingZoneBlendValues
{
public:
	int                                                          LightingSetIndex;                                  // 0x0(0x4)
	float                                                        LightingZoneWeight;                                // 0x4(0x4)
};


// Size 0x1
struct TavernBoardClosedEvent
{
public:
	char                                                         pad0x1_A5T28[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct ClientEndEngagementMessageTelemetryEvent
{
public:
	float                                                        ScreenDuration;                                    // 0x0(0x4)
	char                                                         pad0x4_RGRT6[0x4];                                 // 0x4(0x4)
	struct FString                                               EndedScreen;                                       // 0x8(0x10)
};


// Size 0x38
struct LoadingTelemetryEvent
{
public:
	struct FString                                               LoadingEvent;                                      // 0x0(0x10)
	struct FString                                               MapName;                                           // 0x10(0x10)
	float                                                        StartTime;                                         // 0x20(0x4)
	float                                                        EndTime;                                           // 0x24(0x4)
	struct FString                                               ActiveExperiments;                                 // 0x28(0x10)
};


// Size 0x4
struct AIDeadActionStateParams
{
public:
	float                                                        DeathDelay;                                        // 0x0(0x4)
};


// Size 0x30
struct TQStructGenEntry
{
public:
	char                                                         pad0x10_BPXQL[0x10];                               // 0x0(0x10)
	class TaleQuestDescAsset*                                    TaleQuestDesc;                                     // 0x10(0x8)
	class PLQuestLocationDataBundle*                             LocationBundle;                                    // 0x18(0x8)
	bool                                                         LocationFiltering;                                 // 0x20(0x1)
	char                                                         pad0x3_9OWE2[0x3];                                 // 0x21(0x3)
	struct Vector2D                                              AcceptableAreaLocation;                            // 0x24(0x8)
	float                                                        AcceptableAreaRadius;                              // 0x2c(0x4)
};


// Size 0x58
struct WeightedItemDescSpawnDataWithRandomQuantity
{
public:
	char                                                         pad0x38_2RN6K[0x38];                               // 0x0(0x38)
	struct WeightedProbabilityRange                              ProbabilityRange;                                  // 0x38(0x20)
};


// Size 0x20
struct FlagMeshParams
{
public:
	struct StringAssetReference                                  FlagMesh;                                          // 0x0(0x10)
	class UClass*                                                FlagItemInfo;                                      // 0x10(0x8)
	class UClass*                                                TemporaryEntitlement;                              // 0x18(0x8)
};


// Size 0x58
struct IInventoryItemDescription
{
public:
	struct FString                                               ThumbnailImageUrl;                                 // 0x0(0x10)
	struct FString                                               PreviewImageUrl;                                   // 0x10(0x10)
	struct FString                                               DisplayName;                                       // 0x20(0x10)
	struct FString                                               Description;                                       // 0x30(0x10)
	struct FString                                               ItemDesc;                                          // 0x40(0x10)
	class UClass*                                                DescKey;                                           // 0x50(0x8)
};


// Size 0x8
struct AshenLordNewHealthStageTelemetryEvent
{
public:
	char                                                         pad0x8_ZSDBR[0x8];                                 // 0x0(0x8)
};


// Size 0x1
struct PirateProfilesSelectProfileSuccessToUI
{
public:
	char                                                         pad0x1_ADPHG[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct PageDownUniversalDescriptorEvent
{
public:
	char                                                         pad0x1_UKUU2[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct BootFlowStartSelectUserStateEvent
{
public:
	char                                                         pad0x1_1SSGO[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct RevealerDisabledEvent
{
public:
	char                                                         pad0x10_FSEVE[0x10];                               // 0x0(0x10)
};


// Size 0x20
struct ItemSpawnDataLocationInfo
{
public:
	TArray<String>                                               Items;                                             // 0x0(0x10)
	struct Vector                                                Location;                                          // 0x10(0xc)
	int                                                          NumItemsSpawned;                                   // 0x1c(0x4)
};


// Size 0x30
struct PiratePreviewOverridingActorParams
{
public:
	char                                                         pad0x20_WJDTH[0x20];                               // 0x0(0x20)
	struct FString                                               Identifier;                                        // 0x20(0x10)
};


// Size 0x1
struct EventHealthChangeAllContinuousChangesRemoved
{
public:
	char                                                         pad0x1_IEZO9[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct QuestVariableInt
{
public:
	char                                                         pad0x30_U123Y[0x30];                               // 0x0(0x30)
};


// Size 0x8
struct AggressiveGhostShipState
{
public:
	bool                                                         IsShipVisible;                                     // 0x0(0x1)
	bool                                                         IsShipDead;                                        // 0x1(0x1)
	char                                                         pad0x2_O235A[0x2];                                 // 0x2(0x2)
	float                                                        ShipSpeed;                                         // 0x4(0x4)
};


// Size 0x10
struct CrewBeganTaleEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x10
struct RequestPremiumStoreOffersEvent
{
public:
	struct FString                                               CatalogName;                                       // 0x0(0x10)
};


// Size 0x10
struct ItemStoredInChestEvent
{
public:
	class ItemInfo*                                              StoredItem;                                        // 0x0(0x8)
	class ItemInfo*                                              CollectorsChestStoredIn;                           // 0x8(0x8)
};


// Size 0x1
struct BootFlowStartEngageStateEvent
{
public:
	char                                                         pad0x1_70FS4[0x1];                                 // 0x0(0x1)
};


// Size 0x70
struct MeleeBlockingActionStateConstructionInfo
{
public:
	char                                                         pad0x48_W4AUD[0x48];                               // 0x0(0x48)
	struct NetActorPtr                                           WieldedItem;                                       // 0x48(0x14)
	char                                                         pad0x4_LW4FZ[0x4];                                 // 0x5c(0x4)
	class UClass*                                                InputID;                                           // 0x60(0x8)
	float                                                        BlockMovementLockTime;                             // 0x68(0x4)
	char                                                         pad0x4_WEOSN[0x4];                                 // 0x6c(0x4)
};


// Size 0x1
struct EventAnimationWieldedItemOutOfUseFinished
{
public:
	char                                                         pad0x1_411X9[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct CrewMemberData
{
public:
	bool                                                         Vote;                                              // 0x0(0x1)
	char                                                         NumVotes;                                          // 0x1(0x1)
	char                                                         BrigState;                                         // 0x2(0x1)
	char                                                         pad0x5_JXIPT[0x5];                                 // 0x3(0x5)
	class PlayerState*                                           PlayerState;                                       // 0x8(0x8)
};


// Size 0x24
struct CaptainsLogCrewSessionStatsEntry
{
public:
	int                                                          DaysAtSea;                                         // 0x0(0x4)
	int                                                          MilesSailed;                                       // 0x4(0x4)
	int                                                          GoldEarned;                                        // 0x8(0x4)
	int                                                          QuestsCompleted;                                   // 0xc(0x4)
	int                                                          DaysSinceLastSunk;                                 // 0x10(0x4)
	int                                                          FishCaught;                                        // 0x14(0x4)
	int                                                          MetresSailed;                                      // 0x18(0x4)
	int                                                          PreviousDaysSinceLastSunk;                         // 0x1c(0x4)
	int                                                          CaptainsPreviousBalance;                           // 0x20(0x4)
};


// Size 0x60
struct DiscoveryNotificationEvent
{
public:
	int                                                          Count;                                             // 0x0(0x4)
	char                                                         pad0x4_CNUI8[0x4];                                 // 0x4(0x4)
	TArray<String>                                               Images;                                            // 0x8(0x10)
	struct FString                                               Background;                                        // 0x18(0x10)
	struct FText                                                 Text;                                              // 0x28(0x38)
};


// Size 0x30
struct ContestScoreTelemetryGameEvent
{
public:
	char                                                         ScoreReason;                                       // 0x0(0x1)
	char                                                         pad0x3_MDB29[0x3];                                 // 0x1(0x3)
	int                                                          CurrentScore;                                      // 0x4(0x4)
	int                                                          ScoreChangeAmount;                                 // 0x8(0x4)
	char                                                         pad0x4_HTWQH[0x4];                                 // 0xc(0x4)
	struct FString                                               ScoreContext;                                      // 0x10(0x10)
	struct Guid                                                  InstigatorId;                                      // 0x20(0x10)
};


// Size 0x8
struct ItemLoadoutItemRemovedEvent
{
public:
	class ItemInfo*                                              Item;                                              // 0x0(0x8)
};


// Size 0xe8
struct ActivePlayerState
{
public:
	char                                                         pad0xe8_XZ863[0xe8];                               // 0x0(0xe8)
};


// Size 0x4
struct ReapersTributeEarnedTelemetryEvent
{
public:
	int                                                          RitualsCompleted;                                  // 0x0(0x4)
};


// Size 0x28
struct BountyQuestMugShotSet
{
public:
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x0(0x8)
	class Texture*                                               MaleCaptainMugShot;                                // 0x8(0x8)
	class Texture*                                               FemaleCaptainMugShot;                              // 0x10(0x8)
	class Texture*                                               MaleCrewMugShot;                                   // 0x18(0x8)
	class Texture*                                               FemaleCrewMugShot;                                 // 0x20(0x8)
};


// Size 0x18
struct ItemDiggingAnimationOverride
{
public:
	TArray<Class>                                                Classes;                                           // 0x0(0x10)
	class ItemDiggingAnimationConfig*                            DiggingAnimationConfig;                            // 0x10(0x8)
};


// Size 0x10
struct ClearOverrideCrewSpawnTeleportLocation
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x20
struct ReapersTributeShipCrewTributeChangedBoxedRpc
{
public:
	char                                                         pad0x18_JRXVM[0x18];                               // 0x0(0x18)
	int                                                          NewTributeCount;                                   // 0x18(0x4)
	int                                                          OldTributeCount;                                   // 0x1c(0x4)
};


// Size 0x20
struct LightingZoneParameters
{
public:
	int                                                          PriorityLayer;                                     // 0x0(0x4)
	int                                                          TargetLightingIndex;                               // 0x4(0x4)
	float                                                        OuterRadius;                                       // 0x8(0x4)
	float                                                        InnerRadius;                                       // 0xc(0x4)
	float                                                        Weight;                                            // 0x10(0x4)
	bool                                                         IsUnderwaterZone;                                  // 0x14(0x1)
	bool                                                         Is3DLightingZone;                                  // 0x15(0x1)
	char                                                         pad0x2_CU7QI[0x2];                                 // 0x16(0x2)
	float                                                        OuterCylinderHalfHeight;                           // 0x18(0x4)
	float                                                        InnerCylinderHalfHeight;                           // 0x1c(0x4)
};


// Size 0x18
struct ResettableSettingsGroup
{
public:
	struct FName                                                 SettingsGroupName;                                 // 0x0(0x8)
	TArray<struct Name>                                          SettingsNames;                                     // 0x8(0x10)
};


// Size 0x18
struct OverrideDialogOptionUsageCounter
{
public:
	int                                                          OverrideDataIndex;                                 // 0x0(0x4)
	char                                                         pad0x4_EIX74[0x4];                                 // 0x4(0x4)
	TArray<int>                                                  OptionUsageCounter;                                // 0x8(0x10)
};


// Size 0x38
struct CurrencyGrantedNetworkEvent
{
public:
	char                                                         pad0x18_5TZII[0x18];                               // 0x0(0x18)
	char                                                         CurrencyId;                                        // 0x18(0x1)
	char                                                         pad0x3_4RE7T[0x3];                                 // 0x19(0x3)
	struct FName                                                 EmissaryAffiliation;                               // 0x20(0x8)
	float                                                        EmissaryMultiplier;                                // 0x28(0x4)
	struct FName                                                 RewardId;                                          // 0x2c(0x8)
	char                                                         pad0x4_ANNAR[0x4];                                 // 0x34(0x4)
};


// Size 0x1
struct EventLoadableObjectLoaded
{
public:
	char                                                         pad0x1_T62FT[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct FortOfTheDamnedCompletedEvent
{
public:
	char                                                         pad0x1_188P1[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct ServerMigrationClientFailedTelemetryEvent
{
public:
	struct Guid                                                  MigrationId;                                       // 0x0(0x10)
	struct FString                                               Stage;                                             // 0x10(0x10)
	struct FString                                               Error;                                             // 0x20(0x10)
};


// Size 0x1
struct RequestJupiterAccountLinking
{
public:
	char                                                         pad0x1_E9P2W[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct ShipIdentity
{
public:
	struct FString                                               UnscrambledShipName;                               // 0x0(0x10)
	int                                                          ScrambledShipNameIndex;                            // 0x10(0x4)
	char                                                         pad0x4_KWDTL[0x4];                                 // 0x14(0x4)
	struct FString                                               ClientShipName;                                    // 0x18(0x10)
};


// Size 0x1
struct EventAthenaAnimationItemAnimationsAsyncLoaded
{
public:
	char                                                         pad0x1_K848L[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventShipTopDeckBlocked
{
public:
	struct Guid                                                  BlockerId;                                         // 0x0(0x10)
};


// Size 0x1c
struct ServerWieldSet
{
public:
	struct NetActorPtr                                           WieldedItem;                                       // 0x0(0x14)
	int                                                          EpochId;                                           // 0x14(0x4)
	bool                                                         Fast;                                              // 0x18(0x1)
	char                                                         pad0x3_1PSZX[0x3];                                 // 0x19(0x3)
};


// Size 0x24
struct InvaderVsInvaderMigrationCompleteEvent
{
public:
	char                                                         pad0x24_9H1XL[0x24];                               // 0x0(0x24)
};


// Size 0xc
struct AimSensitivitySettingParams
{
public:
	struct FloatInterval                                         Range;                                             // 0x0(0x8)
	float                                                        Default;                                           // 0x8(0x4)
};


// Size 0x1
struct ShipCancelVoteToScuttleAndChangeSeasEvent
{
public:
	char                                                         pad0x1_BQVQ1[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct QuestDistributionAllAtOnceParams
{
public:
	struct WeightedProbabilityRange                              NumQuests;                                         // 0x0(0x20)
	struct WeightedProbabilityRange                              QuestsPerChapter;                                  // 0x20(0x20)
};


// Size 0x4
struct IntentChangedEvent
{
public:
	float                                                        NewIntent;                                         // 0x0(0x4)
};


// Size 0x8
struct GuildDistinctionLevelChangedEvent
{
public:
	int                                                          OldGuildDistinctionLevel;                          // 0x0(0x4)
	int                                                          CurrentGuildDistinctionLevel;                      // 0x4(0x4)
};


// Size 0x1
struct OnRestoreShopStateChangedEvent
{
public:
	bool                                                         CanRestore;                                        // 0x0(0x1)
};


// Size 0x10
struct RequestShopOffersEvent
{
public:
	struct FString                                               CatalogName;                                       // 0x0(0x10)
};


// Size 0x90
struct MovedByPortableHarpoonGrappleActionStateConstructionInfo
{
public:
	char                                                         pad0x80_ONC47[0x80];                               // 0x0(0x80)
	struct Vector                                                TargetRelativeSurfaceNormal;                       // 0x80(0xc)
	char                                                         pad0x4_6OLUJ[0x4];                                 // 0x8c(0x4)
};


// Size 0x10
struct OnEndSlidingOnWalkwayEvent
{
public:
	class WwiseEvent*                                            WalkwaySlideLoopEnd;                               // 0x0(0x8)
	class WwiseEvent*                                            WalkwaySlideEnd;                                   // 0x8(0x8)
};


// Size 0x14
struct SkullOfStormsKnockbackTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	char                                                         KnocbackActorTeam;                                 // 0x10(0x1)
	char                                                         pad0x3_WR1RG[0x3];                                 // 0x11(0x3)
};


// Size 0x38
struct UIPremiumStorePanelHighlightEvent
{
public:
	struct FString                                               CurrentPage;                                       // 0x0(0x10)
	struct FString                                               CurrentPanel;                                      // 0x10(0x10)
	struct FString                                               SessionId;                                         // 0x20(0x10)
	float                                                        TimeOnPanel;                                       // 0x30(0x4)
	char                                                         pad0x4_QFW7S[0x4];                                 // 0x34(0x4)
};


// Size 0x18
struct PlayerDefeatedReapersTributeShip
{
public:
	struct Guid                                                  ControllingCrewId;                                 // 0x0(0x10)
	class Actor*                                                 ReapersTributeShip;                                // 0x10(0x8)
};


// Size 0x18
struct ShipCameraAnimation
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	class CameraAnim*                                            Animation;                                         // 0x8(0x8)
	class CurveFloat*                                            BlendCurve;                                        // 0x10(0x8)
};


// Size 0x40
struct AthenaAnimationHitReactsAnimData
{
public:
	TArray<class BlendSpace1D*>                                  HitReact;                                          // 0x0(0x10)
	TArray<class BlendSpace1D*>                                  HitReactItem;                                      // 0x10(0x10)
	TArray<class BlendSpace1D*>                                  HitReactItemAction;                                // 0x20(0x10)
	TArray<class BlendSpace1D*>                                  HitReactSubtle;                                    // 0x30(0x10)
};


// Size 0x1
struct ThrowingKnifeProxyPickupTelemetryEvent
{
public:
	bool                                                         HasKnivesEquipped;                                 // 0x0(0x1)
};


// Size 0x58
struct BeingRetractedActionStateConstructionInfo
{
public:
	char                                                         pad0x48_203WF[0x48];                               // 0x0(0x48)
	class SceneComponent*                                        RetractingComponent;                               // 0x48(0x8)
	bool                                                         RetainOriginalOrientation;                         // 0x50(0x1)
	char                                                         pad0x7_2UWVE[0x7];                                 // 0x51(0x7)
};


// Size 0x4
struct EventSetFishingTensionShake
{
public:
	float                                                        TensionShake;                                      // 0x0(0x4)
};


// Size 0x8
struct TaleQuestStopAISpawningEvent
{
public:
	char                                                         pad0x8_XMIM3[0x8];                                 // 0x0(0x8)
};


// Size 0x20
struct SwingMechanismMaterialAnimationContext
{
public:
	char                                                         pad0x20_VFSGK[0x20];                               // 0x0(0x20)
};


// Size 0x40
struct StormAvoidanceArea
{
public:
	struct Vector2D                                              Location;                                          // 0x0(0x8)
	float                                                        Radius;                                            // 0x8(0x4)
	char                                                         pad0x34_O98GB[0x34];                               // 0xc(0x34)
};


// Size 0x18
struct CrewManagementMenuRequestNewShipEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	class UClass*                                                NewShipSize;                                       // 0x10(0x8)
};


// Size 0x10
struct LinkedPsnIdModel
{
public:
	struct FString                                               PsnId;                                             // 0x0(0x10)
};


// Size 0x8
struct AchievementKillOpponentInContest
{
public:
	char                                                         pad0x8_JNE8M[0x8];                                 // 0x0(0x8)
};


// Size 0x20
struct OnShipStockEntitlementsProcessedNetworkEvent
{
public:
	char                                                         pad0x18_JS7EH[0x18];                               // 0x0(0x18)
	class ShipEntitlementProcessingPolicyDataAsset*              ShipEntitlementProcessingPolicyDataAsset;          // 0x18(0x8)
};


// Size 0x28
struct QuestTableQuestTileDetails
{
public:
	struct FString                                               TileId;                                            // 0x0(0x10)
	struct FString                                               QuestId;                                           // 0x10(0x10)
	struct FName                                                 QuestType;                                         // 0x20(0x8)
};


// Size 0x8
struct IslandSelectionType
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
};


// Size 0x18
struct EventPlayerInteractedWithObject
{
public:
	char                                                         pad0x18_RIXSY[0x18];                               // 0x0(0x18)
};


// Size 0x14
struct DrunkennessSetupData
{
public:
	char                                                         DrunkennessType;                                   // 0x0(0x1)
	char                                                         pad0x3_CKXCH[0x3];                                 // 0x1(0x3)
	float                                                        MaxDrunkenness;                                    // 0x4(0x4)
	float                                                        GettingDrunkDrunkennessChangePerSec;               // 0x8(0x4)
	float                                                        SoberingUpDrunkennessChangePerSec;                 // 0xc(0x4)
	bool                                                         AutoSoberUpWhenFullyDrunk;                         // 0x10(0x1)
	char                                                         pad0x3_09CQ5[0x3];                                 // 0x11(0x3)
};


// Size 0x1
struct CustomSeasTextboxFocusRequest
{
public:
	bool                                                         shouldFocus;                                       // 0x0(0x1)
};


// Size 0x1
struct EventStartBlocking
{
public:
	char                                                         pad0x1_3XU32[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct PlayerEnteredStormEvent
{
public:
	char                                                         pad0x10_AK4C6[0x10];                               // 0x0(0x10)
};


// Size 0x18
struct WieldableItemTelemetryEvent
{
public:
	struct Vector                                                Before;                                            // 0x0(0xc)
	struct Vector                                                After;                                             // 0xc(0xc)
};


// Size 0x28
struct SessionManagementCommandKickPlayer
{
public:
	char                                                         pad0x20_A05WM[0x20];                               // 0x0(0x20)
	class PlayerState*                                           PlayerState;                                       // 0x20(0x8)
};


// Size 0x208
struct NetworkPerformanceMonitorPayload
{
public:
	char                                                         pad0x208_44BYC[0x208];                             // 0x0(0x208)
};


// Size 0x8
struct TutorialEventControlledObjectDestroyed
{
public:
	class TutorialEventControlledObject*                         TutorialEventControlledObject;                     // 0x0(0x8)
};


// Size 0x60
struct PlayerPanicTeleportTelemetryEvent
{
public:
	struct FString                                               Reason;                                            // 0x0(0x10)
	bool                                                         IsBased;                                           // 0x10(0x1)
	bool                                                         IsTeleporting;                                     // 0x11(0x1)
	bool                                                         IsWaitingToSpawn;                                  // 0x12(0x1)
	char                                                         pad0x1_7ELQH[0x1];                                 // 0x13(0x1)
	struct Vector                                                BasedLocation;                                     // 0x14(0xc)
	struct FString                                               MovementModeName;                                  // 0x20(0x10)
	struct FString                                               ShipType;                                          // 0x30(0x10)
	struct FString                                               ShipRegion;                                        // 0x40(0x10)
	struct FString                                               WieldedItem;                                       // 0x50(0x10)
};


// Size 0x1
struct PlayerControllerTypeTelemetryEvent
{
public:
	char                                                         ControllerType;                                    // 0x0(0x1)
};


// Size 0x1
struct EventStopBlocking
{
public:
	char                                                         pad0x1_VPUD9[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct BellDesc
{
public:
	class StaticMesh*                                            BellMesh;                                          // 0x0(0x8)
	class WwiseEvent*                                            BellRingSFX;                                       // 0x8(0x8)
	class WwiseEvent*                                            BellRingTurbulenceSFX;                             // 0x10(0x8)
};


// Size 0x1c
struct CustomWreckEntry
{
public:
	struct Guid                                                  OwningCrewID;                                      // 0x0(0x10)
	bool                                                         WreckExpired;                                      // 0x18(0x1)
	char                                                         pad0x3_7EP3P[0x3];                                 // 0x19(0x3)
};


// Size 0x14
struct EventHandInMegalodonSoul
{
public:
	char                                                         SoulType;                                          // 0x0(0x1)
	char                                                         pad0x3_KV5P6[0x3];                                 // 0x1(0x3)
	struct Guid                                                  CrewId;                                            // 0x4(0x10)
};


// Size 0x10
struct EventCrewEntitlementUpdatedAndVerified
{
public:
	char                                                         pad0x10_TA7EJ[0x10];                               // 0x0(0x10)
};


// Size 0x50
struct ServerTenancyTelemetryFragment
{
public:
	struct FString                                               VmId;                                              // 0x0(0x10)
	struct FString                                               InstanceId;                                        // 0x10(0x10)
	struct FString                                               ClusterId;                                         // 0x20(0x10)
	struct FString                                               GsiId;                                             // 0x30(0x10)
	struct FString                                               ProcessorType;                                     // 0x40(0x10)
};


// Size 0x3
struct EventUserGameSettingsResetToDefaultBindings
{
public:
	char                                                         ControllerTypeToReset;                             // 0x0(0x1)
	bool                                                         ResetActions;                                      // 0x1(0x1)
	bool                                                         ResetAxes;                                         // 0x2(0x1)
};


// Size 0x1
struct CrewMembershipUpdatedEvent
{
public:
	char                                                         pad0x1_U3I6V[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct DebugSuperSailorSetSpeedAmpRPCEvent
{
public:
	char                                                         pad0x18_NTA7S[0x18];                               // 0x0(0x18)
	float                                                        FwdSpdAmp;                                         // 0x18(0x4)
	float                                                        YawSpdAmp;                                         // 0x1c(0x4)
};


// Size 0x18
struct ConditionalStatsTriggerUnit
{
public:
	class UClass*                                                TriggerType;                                       // 0x0(0x8)
	TArray<class ConditionalStatsAsset*>                         ConditionalStatsAssets;                            // 0x8(0x10)
};


// Size 0xc
struct CreateStormGameServerRequestModel
{
public:
	struct Vector2D                                              StormCentre;                                       // 0x0(0x8)
	float                                                        StormStrength;                                     // 0x8(0x4)
};


// Size 0x50
struct TreasureSpawnedTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	char                                                         BootyType;                                         // 0x10(0x1)
	char                                                         pad0x7_LB649[0x7];                                 // 0x11(0x7)
	struct FString                                               Rarity;                                            // 0x18(0x10)
	char                                                         Source;                                            // 0x28(0x1)
	char                                                         pad0x7_EVW47[0x7];                                 // 0x29(0x7)
	struct FString                                               SourceId;                                          // 0x30(0x10)
	struct Vector                                                TreasureLocation;                                  // 0x40(0xc)
	char                                                         pad0x4_3P0XD[0x4];                                 // 0x4c(0x4)
};


// Size 0x38
struct FogBankSpawnedTelemetryEvent
{
public:
	struct Guid                                                  FogBankId;                                         // 0x0(0x10)
	struct Vector                                                SpawnLocation;                                     // 0x10(0xc)
	struct Vector                                                Scale;                                             // 0x1c(0xc)
	float                                                        Density;                                           // 0x28(0x4)
	float                                                        FadeInDuration;                                    // 0x2c(0x4)
	float                                                        ActiveDuration;                                    // 0x30(0x4)
	float                                                        FadeOutDuration;                                   // 0x34(0x4)
};


// Size 0x30
struct LocText
{
public:
	struct FString                                               Namespace;                                         // 0x0(0x10)
	struct FString                                               Key;                                               // 0x10(0x10)
	struct FString                                               LocalizedText;                                     // 0x20(0x10)
};


// Size 0x10
struct ClothingChestEquipEmoteEvent
{
public:
	class UClass*                                                Desc;                                              // 0x0(0x8)
	int                                                          Index;                                             // 0x8(0x4)
	char                                                         pad0x4_363LR[0x4];                                 // 0xc(0x4)
};


// Size 0x8
struct WaterPuzzleRepData
{
public:
	int                                                          CurrentWaterLevelIndex;                            // 0x0(0x4)
	bool                                                         TransitionDueToReset;                              // 0x4(0x1)
	char                                                         pad0x3_Y8XT6[0x3];                                 // 0x5(0x3)
};


// Size 0x1
struct NarrationRequestedEvent
{
public:
	char                                                         pad0x1_LAY3G[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct QuestStartTelemetryEvent
{
public:
	char                                                         QuestType;                                         // 0x0(0x1)
};


// Size 0x50
struct MigrationActionStateConstructionInfo
{
public:
	char                                                         pad0x48_F2SPJ[0x48];                               // 0x0(0x48)
	bool                                                         EnableMigrationUI;                                 // 0x48(0x1)
	bool                                                         IsCrossLevel;                                      // 0x49(0x1)
	char                                                         pad0x6_V3LXM[0x6];                                 // 0x4a(0x6)
};


// Size 0x10
struct ClientChatModerationConfigUpdateRequestFailedEvent
{
public:
	struct FString                                               FailureReason;                                     // 0x0(0x10)
};


// Size 0x28
struct ClientDeveloperTelemetryEvent
{
public:
	char                                                         pad0x28_BYS0U[0x28];                               // 0x0(0x28)
};


// Size 0x40
struct TreasureSoldTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	char                                                         BootyType;                                         // 0x10(0x1)
	char                                                         pad0x7_OV1F0[0x7];                                 // 0x11(0x7)
	struct FString                                               Rarity;                                            // 0x18(0x10)
	bool                                                         GoldAwarded;                                       // 0x28(0x1)
	char                                                         Source;                                            // 0x29(0x1)
	char                                                         pad0x6_XF4SG[0x6];                                 // 0x2a(0x6)
	struct FString                                               TreasurePurchaser;                                 // 0x30(0x10)
};


// Size 0x18
struct CrewShipEntry
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	class Actor*                                                 Ship;                                              // 0x10(0x8)
};


// Size 0x48
struct CapstanDesc
{
public:
	struct StringAssetReference                                  CapstanBodyMesh;                                   // 0x0(0x10)
	struct StringAssetReference                                  CapstanArmMesh;                                    // 0x18(0x10)
	struct StringAssetReference                                  CapstanReleaseMesh;                                // 0x30(0x10)
	char                                                         pad0x8_7VO5H[0x8];                                 // 0x40(0x8)
};


// Size 0x1
struct EventDeathCameraDeactivated
{
public:
	char                                                         pad0x1_S1DFH[0x1];                                 // 0x0(0x1)
};


// Size 0x120
struct EmoteActionStateConstructionInfo
{
public:
	char                                                         pad0x48_N2JST[0x48];                               // 0x0(0x48)
	struct EmoteData                                             EmoteData;                                         // 0x48(0xc8)
	struct FName                                                 EmoteIdentifier;                                   // 0x110(0x8)
	bool                                                         ForcedEmote;                                       // 0x118(0x1)
	char                                                         pad0x7_GQG8W[0x7];                                 // 0x119(0x7)
};


// Size 0x1
struct BootFlowStartLoadUserSettingsStateEvent
{
public:
	char                                                         pad0x1_97W7Z[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct SkySphereMaterialParams
{
public:
	class MaterialInstanceDynamic*                               DynamicMaterialInstance;                           // 0x0(0x8)
	int                                                          MaterialIndex;                                     // 0x8(0x4)
	struct FName                                                 StarSpinScalarParamName;                           // 0xc(0x8)
	char                                                         pad0x4_J09Q7[0x4];                                 // 0x14(0x4)
};


// Size 0x10
struct PirateProfiles_ProfileDetailsRequestedEvent
{
public:
	TArray<String>                                               ProfileIds;                                        // 0x0(0x10)
};


// Size 0x1
struct EventLoadableObjectUnloaded
{
public:
	char                                                         pad0x1_P3P1S[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventItemDroppedOnWater
{
public:
	class Actor*                                                 DroppedActor;                                      // 0x0(0x8)
};


// Size 0x10
struct SwimmingCreatureLoadedMaterial
{
public:
	class MaterialInstance*                                      MaterialInstance;                                  // 0x0(0x8)
	bool                                                         CastShadows;                                       // 0x8(0x1)
	char                                                         pad0x7_8MMYG[0x7];                                 // 0x9(0x7)
};


// Size 0x2
struct SessionManagementRequestRolePermissionChangeEvent
{
public:
	char                                                         PermissionToChange;                                // 0x0(0x1)
	char                                                         NewRole;                                           // 0x1(0x1)
};


// Size 0x38
struct PlayerEntitlementsCompact
{
public:
	char                                                         Status;                                            // 0x0(0x1)
	char                                                         pad0x27_UFPRQ[0x27];                               // 0x1(0x27)
	TArray<class Class*>                                         Loose;                                             // 0x28(0x10)
};


// Size 0x1
struct EnableDefaultGameEventSchedulerGameServerRequestModel
{
public:
	bool                                                         Enabled;                                           // 0x0(0x1)
};


// Size 0x5
struct SetContestShipTypes
{
public:
	bool                                                         IsGalleonEnabled;                                  // 0x0(0x1)
	bool                                                         IsBrigantineEnabled;                               // 0x1(0x1)
	bool                                                         IsSloopEnabled;                                    // 0x2(0x1)
	bool                                                         IsSloopDuoEnabled;                                 // 0x3(0x1)
	bool                                                         IsMixedGalleonBrigantineEnabled;                   // 0x4(0x1)
};


// Size 0x44
struct LightingControllerLightingParams
{
public:
	float                                                        SunYaw;                                            // 0x0(0x4)
	float                                                        SunElevation;                                      // 0x4(0x4)
	float                                                        UnderworldSunElevation;                            // 0x8(0x4)
	float                                                        MinSunAngle;                                       // 0xc(0x4)
	float                                                        UnderworldZThreshold;                              // 0x10(0x4)
	float                                                        HideoutZThreshold;                                 // 0x14(0x4)
	float                                                        UnderwaterInsideShipBrightnessInBoatSpace;         // 0x18(0x4)
	float                                                        UnderwaterInsideShipBrightnessOutsideBoatSpace;    // 0x1c(0x4)
	float                                                        UnderwaterBrightnessInBoatSpace;                   // 0x20(0x4)
	float                                                        UnderwaterDepthDarkenStart;                        // 0x24(0x4)
	float                                                        UnderwaterDepthDarkenRange;                        // 0x28(0x4)
	float                                                        UnderwaterDepthDarkenMin;                          // 0x2c(0x4)
	float                                                        UnderwaterMurkDensity;                             // 0x30(0x4)
	float                                                        SecondaryLPVCascadeOcclusionIntensityScale;        // 0x34(0x4)
	int                                                          LPVPropagationSteps;                               // 0x38(0x4)
	int                                                          DefaultLightingSet;                                // 0x3c(0x4)
	bool                                                         EnableGodRays;                                     // 0x40(0x1)
	char                                                         pad0x3_D2FR7[0x3];                                 // 0x41(0x3)
};


// Size 0x1
struct PirateProfiles_PirateCreationBeginEvent
{
public:
	char                                                         pad0x1_X56JW[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ArrivalTunnelOfTheDamnedFadeComplete
{
public:
	char                                                         pad0x1_Y63LH[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct CrewScoreAppendedEvent
{
public:
	char                                                         ScoreId;                                           // 0x0(0x1)
	char                                                         pad0x3_ADZ3W[0x3];                                 // 0x1(0x3)
	struct Guid                                                  CrewId;                                            // 0x4(0x10)
	int                                                          CrewScore;                                         // 0x14(0x4)
	char                                                         ScoreReason;                                       // 0x18(0x1)
	char                                                         pad0x7_73JQU[0x7];                                 // 0x19(0x7)
	struct StringAssetReference                                  ScoringIconAssetReference;                         // 0x20(0x10)
};


// Size 0x10
struct PlayerDepartLocationTelemetryEvent
{
public:
	struct FString                                               LocationName;                                      // 0x0(0x10)
};


// Size 0x18
struct ScheduledShutdownSettingsClient
{
public:
	float                                                        StartScreenFadeWithTimeRemainingSeconds;           // 0x0(0x4)
	float                                                        ScreenFadeTimeSeconds;                             // 0x4(0x4)
	float                                                        QuitGameTimeRemainingSeconds;                      // 0x8(0x4)
	float                                                        UpperDisplayPeriodTimeSeconds;                     // 0xc(0x4)
	float                                                        LowerDisplayPeriodTimeSeconds;                     // 0x10(0x4)
	float                                                        SwitchToLowerTimePeriodWithTimeRemainingSeconds;   // 0x14(0x4)
};


// Size 0x18
struct ItemMetaBase
{
public:
	char                                                         pad0x8_C5PLK[0x8];                                 // 0x0(0x8)
	struct StringAssetReference                                  StoredStructType;                                  // 0x8(0x10)
};


// Size 0x8
struct FocusRadialInventorySlot
{
public:
	char                                                         pad0x4_AQC5K[0x4];                                 // 0x0(0x4)
	int                                                          SlotIndex;                                         // 0x4(0x4)
};


// Size 0x20
struct OnlinePermissionsResponseData
{
public:
	struct UniqueNetIdRepl                                       PlayerUserId;                                      // 0x0(0x18)
	bool                                                         HasPermission;                                     // 0x18(0x1)
	char                                                         pad0x7_JJZMA[0x7];                                 // 0x19(0x7)
};


// Size 0x30
struct StreamingTelemetryBaseEvent
{
public:
	struct FString                                               LevelName;                                         // 0x0(0x10)
	int                                                          LodLevel;                                          // 0x10(0x4)
	struct Vector                                                PlayerPosition;                                    // 0x14(0xc)
	float                                                        DistanceFromPlayer;                                // 0x20(0x4)
	float                                                        DistanceFromBoundsToPlayer;                        // 0x24(0x4)
	bool                                                         PlayerIsWaitingToSpawn;                            // 0x28(0x1)
	bool                                                         PlayerIsTeleporting;                               // 0x29(0x1)
	bool                                                         IsLevelAssetCachingEnabled;                        // 0x2a(0x1)
	char                                                         pad0x5_PZH3F[0x5];                                 // 0x2b(0x5)
};


// Size 0x1
struct PirateCreationEvent_End
{
public:
	char                                                         pad0x1_NM8E1[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventObjectStateMigrationImpl
{
public:
	char                                                         pad0x10_18CAD[0x10];                               // 0x0(0x10)
};


// Size 0x18
struct AthenaWorldSettingsGameEventSchedulerSettingsConfiguration
{
public:
	struct FName                                                 FeatureFlag;                                       // 0x0(0x8)
	char                                                         RequiredPlayMode;                                  // 0x8(0x1)
	char                                                         pad0x7_B0JH1[0x7];                                 // 0x9(0x7)
	class GameEventSchedulerSettingsAsset*                       EventSchedulerSettings;                            // 0x10(0x8)
};


// Size 0x10
struct EventSendCapturedKeybind
{
public:
	struct FString                                               CapturedKey;                                       // 0x0(0x10)
};


// Size 0x40
struct WieldAnimationParams
{
public:
	char                                                         WieldLocation;                                     // 0x0(0x1)
	char                                                         pad0xf_ZI4E0[0xf];                                 // 0x1(0xf)
	struct Transform                                             PropOffset;                                        // 0x10(0x30)
};


// Size 0x10
struct GenericConfirmationEvent
{
public:
	struct FString                                               DisplayMessage;                                    // 0x0(0x10)
};


// Size 0x38
struct PlayerServerAssignmentMessage
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct FString                                               ServerAddress;                                     // 0x10(0x10)
	struct FString                                               ConnectionKey;                                     // 0x20(0x10)
	char                                                         pad0x8_KW5AA[0x8];                                 // 0x30(0x8)
};


// Size 0xc
struct NameActiveStatePair
{
public:
	struct FName                                                 StateName;                                         // 0x0(0x8)
	bool                                                         IsActive;                                          // 0x8(0x1)
	char                                                         pad0x3_M8T4S[0x3];                                 // 0x9(0x3)
};


// Size 0x1
struct HideInviteModalEvent
{
public:
	char                                                         pad0x1_WA72S[0x1];                                 // 0x0(0x1)
};


// Size 0x70
struct AthenaAnimationObjectFacial
{
public:
	TArray<class AnimMontage*>                                   PrimaryContinuous;                                 // 0x0(0x10)
	TArray<class AnimMontage*>                                   SecondaryContinuous;                               // 0x10(0x10)
	TArray<class AnimMontage*>                                   PrimaryOneShot;                                    // 0x20(0x10)
	TArray<class AnimMontage*>                                   SecondaryOneShot;                                  // 0x30(0x10)
	TArray<class AnimMontage*>                                   MeleeBlocking;                                     // 0x40(0x10)
	TArray<class AnimMontage*>                                   MeleeAttack;                                       // 0x50(0x10)
	TArray<class AnimMontage*>                                   MeleeBlockReact;                                   // 0x60(0x10)
};


// Size 0x40
struct AthenaAnimationObjectLocomotionAnimations
{
public:
	class BlendSpace*                                            Locomotion1;                                       // 0x0(0x8)
	class BlendSpace*                                            Locomotion2;                                       // 0x8(0x8)
	class BlendSpace*                                            Locomotion3;                                       // 0x10(0x8)
	class BlendSpace*                                            Locomotion4;                                       // 0x18(0x8)
	class AnimSequence*                                          LocomotionTurningLeft;                             // 0x20(0x8)
	class AnimSequence*                                          LocomotionTurningRight;                            // 0x28(0x8)
	class AnimSequence*                                          LocomotionOutOf;                                   // 0x30(0x8)
	class BlendSpace*                                            LocomotionSwimming;                                // 0x38(0x8)
};


// Size 0x38
struct ShipCustomizationLoadout
{
public:
	TArray<class Class*>                                         Customizations;                                    // 0x0(0x10)
	TArray<class Class*>                                         InitialCustomizations;                             // 0x10(0x10)
	TArray<class Class*>                                         SavedCustomizations;                               // 0x20(0x10)
	bool                                                         HasInitialCustomizationsSet;                       // 0x30(0x1)
	char                                                         pad0x7_HVZ7E[0x7];                                 // 0x31(0x7)
};


// Size 0x20
struct PlayerBriggedEndTelemetryEvent
{
public:
	struct Guid                                                  BriggedId;                                         // 0x0(0x10)
	struct DateTime                                              BriggedStartDateTime;                              // 0x10(0x8)
	char                                                         ReleaseReason;                                     // 0x18(0x1)
	char                                                         pad0x7_T5F5N[0x7];                                 // 0x19(0x7)
};


// Size 0x4
struct UndoRepairActionStateParams
{
public:
	float                                                        MountTime;                                         // 0x0(0x4)
};


// Size 0x1
struct OnHUDDestruction
{
public:
	char                                                         pad0x1_DQQHW[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct SetWindMagnitudeGameServerRequestModel
{
public:
	float                                                        Magnitude;                                         // 0x0(0x4)
};


// Size 0x1
struct EventFightingWheelAgainstTurbulenceStop
{
public:
	char                                                         pad0x1_NJCFX[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct DeactivateHatchEvent
{
public:
	struct FName                                                 EventId;                                           // 0x0(0x8)
};


// Size 0x28
struct RewardPouchGivenRewardTelemetryEvent
{
public:
	struct Guid                                                  PouchId;                                           // 0x0(0x10)
	struct FName                                                 RewardId;                                          // 0x10(0x8)
	char                                                         BootyType;                                         // 0x18(0x1)
	char                                                         pad0x3_Z2UZQ[0x3];                                 // 0x19(0x3)
	struct FName                                                 Rarity;                                            // 0x1c(0x8)
	char                                                         TrackedActorType;                                  // 0x24(0x1)
	char                                                         pad0x3_OA1GW[0x3];                                 // 0x25(0x3)
};


// Size 0x1
struct EventPlayerDrinkingStart
{
public:
	char                                                         pad0x1_V5HGK[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct PlayerSpawnTelemetryEvent
{
public:
	struct FString                                               SpawnPointName;                                    // 0x0(0x10)
	struct FString                                               IslandName;                                        // 0x10(0x10)
	char                                                         SpawnType;                                         // 0x24(0x1)
	char                                                         pad0x3_DCXWM[0x3];                                 // 0x25(0x3)
	double                                                       SpawnDuration;                                     // 0x28(0x8)
	int                                                          PlayersCrewSize;                                   // 0x30(0x4)
	char                                                         pad0x4_29C37[0x4];                                 // 0x34(0x4)
	double                                                       DistanceToClosestOpponent;                         // 0x38(0x8)
};


// Size 0x14
struct ServerMatchmakingFailedMessage
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	char                                                         Reason;                                            // 0x10(0x1)
	char                                                         pad0x3_YY65Y[0x3];                                 // 0x11(0x3)
};


// Size 0x8
struct EventReceiveAmmoTransferComponentState
{
public:
	class AmmoTransferComponent*                                 Source;                                            // 0x0(0x8)
};


// Size 0x8
struct EventClientItemUseSpeedScaled
{
public:
	float                                                        ClientTimeStamp;                                   // 0x0(0x4)
	bool                                                         bItemUseSlowed;                                    // 0x4(0x1)
	char                                                         pad0x3_YVPZS[0x3];                                 // 0x5(0x3)
};


// Size 0x4
struct CompanyLevelDataTable
{
public:
	int                                                          XpRequiredForLevel;                                // 0x0(0x4)
};


// Size 0x1
struct PirateProfiles_ThemesError
{
public:
	char                                                         pad0x1_HXJJ3[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct CrewEnteredTunnelOfTheDamnedEvent
{
public:
	char                                                         pad0x4_FL2YI[0x4];                                 // 0x0(0x4)
};


// Size 0x10
struct StrongholdKeyInfo
{
public:
	class UClass*                                                SkellyFortEventType;                               // 0x0(0x8)
	class UClass*                                                StrongholdKey;                                     // 0x8(0x8)
};


// Size 0xc
struct CaptainsLogSetupContext
{
public:
	char                                                         pad0xc_L3E7L[0xc];                                 // 0x0(0xc)
};


// Size 0x1
struct PirateProfiles_SetThemeSuccess
{
public:
	char                                                         pad0x1_VAPH7[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct MastSailAngleBecameStationaryEvent
{
public:
	float                                                        Angle;                                             // 0x0(0x4)
};


// Size 0x1
struct EventIsDrunk
{
public:
	bool                                                         bIsDrunk;                                          // 0x0(0x1)
};


// Size 0x2
struct EmergentVoyageSourceIconInfo
{
public:
	char                                                         IconType;                                          // 0x0(0x1)
	char                                                         VoyageSource;                                      // 0x1(0x1)
};


// Size 0x1
struct BootFlowStartEngagementMessageRetrievalStateEvent
{
public:
	char                                                         pad0x1_1V6EP[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct FeatureConfigTelemetryEvent
{
public:
	struct FString                                               FeatureConfigHash;                                 // 0x0(0x10)
	struct JsonObjectWrapper                                     Json;                                              // 0x10(0x18)
};


// Size 0x10
struct EventShipNameTextboxTextFromVirtualKeyboard
{
public:
	struct FString                                               Text;                                              // 0x0(0x10)
};


// Size 0x10
struct CheckCanPlayerInviteToGuildResponseModel
{
public:
	TArray<String>                                               ReasonsWhyPirateCannotInvite;                      // 0x0(0x10)
};


// Size 0x1
struct EventPrimaryPlayerProfileDisconnected
{
public:
	char                                                         pad0x1_2PLSL[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct LoadoutPetCategory
{
public:
	struct FString                                               PetEntitlementId;                                  // 0x0(0x10)
	struct FString                                               PetCustomizationEntitlementId;                     // 0x10(0x10)
	struct FString                                               PetName;                                           // 0x20(0x10)
};


// Size 0x28
struct MountedOnMountpointEvent
{
public:
	char                                                         pad0x20_1RY1B[0x20];                               // 0x0(0x20)
	class Actor*                                                 MountedByActor;                                    // 0x20(0x8)
};


// Size 0x18
struct FeatureToggledCargoRunCrateCustomData
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x0(0xc)
