// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0 (Full Size[0x680] - InheritedSize[0x5c0]
class InstancedRopeComponent: public PrimitiveComponent
{
public:
	Class StaticMesh*                                            StaticMesh;                                        // 0x5b8(0x8)
	TArray<struct Ropes>                                         Ropes;                                             // 0x5c0(0x10)
	int                                                          ShadowLOD;                                         // 0x5d0(0x4)
	char                                                         pad0xac_DZ7OO[0xac];                               // 0x5d4(0xac)
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class MaterialExpressionRopeParameter: public MaterialExpression
{
public:
	byte                                                         RopeParameterType;                                 // 0x70(0x1)
	char                                                         pad0x7_V74ZA[0x7];                                 // 0x71(0x7)
};


// Size 0x150 (Full Size[0x518] - InheritedSize[0x3c8]
class RiggingSystem: public Actor
{
public:
	char                                                         pad0x8_973P8[0x8];                                 // 0x3c8(0x8)
	Class SceneComponent*                                        Root;                                              // 0x3d0(0x8)
	Class InstancedRopeComponent*                                InstancedRopes;                                    // 0x3d8(0x8)
	TArray<struct Lines>                                         Lines;                                             // 0x3e0(0x10)
	TArray<struct Ropes>                                         Ropes;                                             // 0x3f0(0x10)
	TArray<class MobileInstancedStaticMeshComponent*>            PulleyInstances;                                   // 0x400(0x10)
	Struct RiggingSystemPulleyData                               Pulleys;                                           // 0x410(0x60)
	TArray<struct Sockets>                                       Sockets;                                           // 0x470(0x10)
	TArray<Float InitialMainRopeLengths>                         InitialMainRopeLengths;                            // 0x480(0x10)
	char                                                         pad0x88_2718U[0x88];                               // 0x490(0x88)
};


// Size 0x40 (Full Size[0x320] - InheritedSize[0x2e0]
class RiggingSystemComponent: public SceneComponent
{
public:
	Struct RopeStyleParams                                       RopeStyle;                                         // 0x2e0(0x20)
	TArray<struct LineGroups>                                    LineGroups;                                        // 0x300(0x10)
	Class RiggingSystem*                                         Impl;                                              // 0x310(0x8)
	char                                                         pad0x8_9N2R5[0x8];                                 // 0x318(0x8)
};


// Size 0x0 (Full Size[0x660] - InheritedSize[0x660]
class RopeCatenaryRenderComponent: public CordRenderComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RopeInterface: public Interface
{
public:
};


}