#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x30
struct DrawDebugItemString
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	struct FString                                               String;                                            // 0x10(0x10)
	struct                                                       Colour;                                            // 0x20(0x4)
	struct                                                       StringPos;                                         // 0x24(0xc)
};


// Size 0x48
struct DrawDebugItemSector
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	float                                                        RotationAngle;                                     // 0xc(0x4)
	struct                                                       Centre;                                            // 0x10(0xc)
	float                                                        SectorAngle;                                       // 0x1c(0x4)
	float                                                        Radius;                                            // 0x20(0x4)
	struct                                                       Colour;                                            // 0x24(0x4)
	struct                                                       ZeroAngleVector;                                   // 0x28(0xc)
	struct                                                       RotationAxis;                                      // 0x34(0xc)
	float                                                        SubAngles;                                         // 0x40(0x4)
	float                                                        Thickness;                                         // 0x44(0x4)
};


// Size 0x40
struct DrawDebugItemCapsule
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	struct                                                       CentrePos;                                         // 0xc(0xc)
	float                                                        HalfHeight;                                        // 0x18(0x4)
	float                                                        Radius;                                            // 0x1c(0x4)
	struct                                                       Rotation;                                          // 0x20(0x10)
	struct                                                       Colour;                                            // 0x30(0x4)
};


// Size 0x20
struct DrawDebugItemSphere
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	struct                                                       CentrePos;                                         // 0xc(0xc)
	float                                                        Radius;                                            // 0x18(0x4)
	struct                                                       Colour;                                            // 0x1c(0x4)
};


// Size 0x28
struct DrawDebugItemMessage
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	struct FString                                               Message;                                           // 0x10(0x10)
	struct                                                       Colour;                                            // 0x20(0x4)
};


// Size 0x2c
struct DrawDebugItemLine
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	struct                                                       LineStart;                                         // 0xc(0xc)
	struct                                                       LineEnd;                                           // 0x18(0xc)
	struct                                                       Colour;                                            // 0x24(0x4)
	float                                                        Thickness;                                         // 0x28(0x4)
};


// Size 0x18
struct SphereData
{
public:
	struct                                                       Location;                                          // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
	int                                                          Segments;                                          // 0x10(0x4)
	struct                                                       Colour;                                            // 0x14(0x4)
};


// Size 0x50
struct DrawDebugItemBox
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	struct                                                       CentrePos;                                         // 0xc(0xc)
	struct                                                       Box;                                               // 0x18(0xc)
	struct                                                       Rotation;                                          // 0x30(0x10)
	struct                                                       Colour;                                            // 0x40(0x4)
};


