#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xc0 (Full Size[0x138] - InheritedSize[0x78]
class AthenaCheatManager: public CheatManager
{
public:
	char                                                         pad0x18_62SQC[0x18];                               // 0x78(0x18)
	class CinematicCameraController*                             CinematicCameraController;                         // 0x90(0x8)
	class UClass*                                                CinematicCameraControllerClass;                    // 0x98(0x8)
	char                                                         pad0x28_3CMAN[0x28];                               // 0xa0(0x28)
	TArray<struct WorldMarkerDesc>                               CreatedWorldMarkers;                               // 0xc8(0x10)
	class GameEventSchedulerSettingsAsset*                       DebugSchedulerSettings;                            // 0xd8(0x8)
	class ServerPerformanceReplicator*                           ServerPerformanceReplicator;                       // 0xe0(0x8)
	float                                                        TeleportToDigsiteHeightOffset;                     // 0xe8(0x4)
	char                                                         pad0x4c_OFK6D[0x4c];                               // 0xec(0x4c)
};


