#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Athena_Structs.h"


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayerCompanyControlInterface: public Interface
{
public:
};


// Size 0x300 (Full Size[0x328] - InheritedSize[0x28]
class LightingControllerSettings: public DataAsset
{
public:
	class CurveFloat*                                            FogDensityCurve;                                   // 0x28(0x8)
	class CurveFloat*                                            FogStartDistanceCurve;                             // 0x30(0x8)
	class CurveFloat*                                            LightIntensityCurve;                               // 0x38(0x8)
	class CurveFloat*                                            SkyDomeBrightnessCurve;                            // 0x40(0x8)
	class CurveFloat*                                            SkyDomeMoonVisibilityCurve;                        // 0x48(0x8)
	class CurveFloat*                                            SkyDomeStarBrightnessCurve;                        // 0x50(0x8)
	class CurveFloat*                                            SkyDomeSunBrightnessCurve;                         // 0x58(0x8)
	class CurveFloat*                                            PostLPVIntensityCurve;                             // 0x60(0x8)
	class CurveFloat*                                            PostExposureBiasCurve;                             // 0x68(0x8)
	class CurveFloat*                                            PostLPVOcclusionIntensityCurve;                    // 0x70(0x8)
	class CurveFloat*                                            SkyLightIntensityCurve;                            // 0x78(0x8)
	class CurveFloat*                                            FogBrightnessNearCurve;                            // 0x80(0x8)
	class CurveFloat*                                            FogBrightnessFarCurve;                             // 0x88(0x8)
	class CurveFloat*                                            PostBloomIntensityCurve;                           // 0x90(0x8)
	class CurveFloat*                                            PostBloomThresholdCurve;                           // 0x98(0x8)
	class CurveFloat*                                            SkyDomeAuraBrightnessCurve;                        // 0xa0(0x8)
	class CurveFloat*                                            PostReflectionProbeBrightnessCurve;                // 0xa8(0x8)
	class CurveFloat*                                            PostReflectionProbeShadowBrightnessCurve;          // 0xb0(0x8)
	class CurveFloat*                                            VfxControllerCurve;                                // 0xb8(0x8)
	class CurveFloat*                                            FogMaxOpacityCurve;                                // 0xc0(0x8)
	class CurveFloat*                                            FogScatterExpCurve;                                // 0xc8(0x8)
	class CurveFloat*                                            FogUnderwaterDensityCurve;                         // 0xd0(0x8)
	class CurveFloat*                                            PostLensFlareIntensityCurve;                       // 0xd8(0x8)
	class CurveFloat*                                            EmissiveFoliageCurve;                              // 0xe0(0x8)
	class CurveFloat*                                            EmissiveLightsCurve;                               // 0xe8(0x8)
	class CurveFloat*                                            PostExposureMinBrightnessCurve;                    // 0xf0(0x8)
	class CurveFloat*                                            PostExposureMaxBrightnessCurve;                    // 0xf8(0x8)
	class CurveFloat*                                            SkyDomeMoonBrightnessCurve;                        // 0x100(0x8)
	class CurveFloat*                                            SkyDomeHorizonCloudBrightnessCurve;                // 0x108(0x8)
	class CurveFloat*                                            SkyDomeGreenFlashStrengthCurve;                    // 0x110(0x8)
	class CurveFloat*                                            PostSaturationCurve;                               // 0x118(0x8)
	class CurveFloat*                                            PostContrastCurve;                                 // 0x120(0x8)
	class CurveFloat*                                            CloudRimlightScaleCurve;                           // 0x128(0x8)
	class CurveFloat*                                            CloudSkylightScaleCurve;                           // 0x130(0x8)
	class CurveFloat*                                            CloudSunlightScaleCurve;                           // 0x138(0x8)
	class CurveFloat*                                            CloudGlobalPressureCurve;                          // 0x140(0x8)
	class CurveFloat*                                            PostUnderWaterBrightnessCurve;                     // 0x148(0x8)
	class CurveFloat*                                            VfxCloudBrightnessCurve;                           // 0x150(0x8)
	class CurveFloat*                                            LightGodRayIntensityCurve;                         // 0x158(0x8)
	class CurveFloat*                                            CloudBottomBrightnessCurve;                        // 0x160(0x8)
	class CurveFloat*                                            CloudSunlightShadowingCurve;                       // 0x168(0x8)
	class CurveFloat*                                            SunDiscScaleCurve;                                 // 0x170(0x8)
	class CurveFloat*                                            WaterSpecularBrightnessCurve;                      // 0x178(0x8)
	class CurveFloat*                                            VfxAmbientScaleCurve;                              // 0x180(0x8)
	class CurveFloat*                                            CloudShadowBrightnessCurve;                        // 0x188(0x8)
	class CurveFloat*                                            StormCloudShadowBrightnessCurve;                   // 0x190(0x8)
	class CurveFloat*                                            StormPostBloomIntensityCurve;                      // 0x198(0x8)
	class CurveFloat*                                            StormPostBloomThresholdCurve;                      // 0x1a0(0x8)
	class CurveFloat*                                            DirectionalLightShadowSteppingRateCurve;           // 0x1a8(0x8)
	class CurveFloat*                                            SkullBrightnessCurve;                              // 0x1b0(0x8)
	class CurveLinearColor*                                      FogColourAwayCurve;                                // 0x1b8(0x8)
	class CurveLinearColor*                                      FogColourTowardsCurve;                             // 0x1c0(0x8)
	class CurveLinearColor*                                      LightSunColourCurve;                               // 0x1c8(0x8)
	class CurveLinearColor*                                      SkyDomeHorizonColourCurve;                         // 0x1d0(0x8)
	class CurveLinearColor*                                      SkyDomeZenithColourCurve;                          // 0x1d8(0x8)
	class CurveLinearColor*                                      SkyLightColourCurve;                               // 0x1e0(0x8)
	class CurveLinearColor*                                      PostAmbientShadowColourCurve;                      // 0x1e8(0x8)
	class CurveLinearColor*                                      FogColourAwayFarCurve;                             // 0x1f0(0x8)
	class CurveLinearColor*                                      FogColourUnderwaterCurve;                          // 0x1f8(0x8)
	class CurveLinearColor*                                      FogColourAwayUnderwaterCurve;                      // 0x200(0x8)
	class CurveLinearColor*                                      WaterColourCurve;                                  // 0x208(0x8)
	class CurveLinearColor*                                      WaterColourShallowCurve;                           // 0x210(0x8)
	class CurveLinearColor*                                      WaterBackLitColourCurve;                           // 0x218(0x8)
	class CurveLinearColor*                                      WaterFoamColourCurve;                              // 0x220(0x8)
	class CurveLinearColor*                                      WaterFoamHighlightColourCurve;                     // 0x228(0x8)
	class CurveLinearColor*                                      WaterAmbientColourCurve;                           // 0x230(0x8)
	class CurveLinearColor*                                      PostReflectionProbeTintCurve;                      // 0x238(0x8)
	class CurveLinearColor*                                      CloudRimlightColourCurve;                          // 0x240(0x8)
	class CurveLinearColor*                                      CloudSkylightColourCurve;                          // 0x248(0x8)
	class CurveLinearColor*                                      CloudSunlightColourCurve;                          // 0x250(0x8)
	class CurveLinearColor*                                      PostUnderWaterTintCurve;                           // 0x258(0x8)
	class CurveLinearColor*                                      SkyDomeMoonColourCurve;                            // 0x260(0x8)
	class CurveLinearColor*                                      PostGammaCurve;                                    // 0x268(0x8)
	class CurveLinearColor*                                      SkyDomeSunColourCurve;                             // 0x270(0x8)
	class CurveLinearColor*                                      VFXFoamColourCurve;                                // 0x278(0x8)
	class CurveLinearColor*                                      VFXWindColourCurve;                                // 0x280(0x8)
	class CurveLinearColor*                                      VFXUnderwaterTintCurve;                            // 0x288(0x8)
	class CurveLinearColor*                                      StormRainColourCurve;                              // 0x290(0x8)
	class CurveLinearColor*                                      StormSkyLightColourCurve;                          // 0x298(0x8)
	class CurveLinearColor*                                      StormPostGammaCurve;                               // 0x2a0(0x8)
	class CurveLinearColor*                                      StormFogColourUnderwaterCurve;                     // 0x2a8(0x8)
	class CurveLinearColor*                                      StormFogColourAwayUnderwaterCurve;                 // 0x2b0(0x8)
	class CurveLinearColor*                                      StormWaterColourCurve;                             // 0x2b8(0x8)
	class CurveLinearColor*                                      StormWaterColourShallowCurve;                      // 0x2c0(0x8)
	class CurveLinearColor*                                      StormWaterBackLitColourCurve;                      // 0x2c8(0x8)
	class CurveLinearColor*                                      StormWaterFoamColourCurve;                         // 0x2d0(0x8)
	class CurveLinearColor*                                      StormWaterFoamHighlightColourCurve;                // 0x2d8(0x8)
	class CurveLinearColor*                                      StormWaterAmbientColourCurve;                      // 0x2e0(0x8)
	class CurveLinearColor*                                      StormPostReflectionProbeTintCurve;                 // 0x2e8(0x8)
	class CurveLinearColor*                                      SkullEyeColourCurve;                               // 0x2f0(0x8)
	struct LinearColor                                           SandColourStatic;                                  // 0x2f8(0x10)
	float                                                        FogUnderwaterMaxOpacityStatic;                     // 0x308(0x4)
	float                                                        FogUnderwaterScatterExpStatic;                     // 0x30c(0x4)
	float                                                        FogUnderwaterStartDistanceStatic;                  // 0x310(0x4)
	float                                                        FogUnderwaterBrightnessNearStatic;                 // 0x314(0x4)
	float                                                        FogUnderwaterBrightnessFarStatic;                  // 0x318(0x4)
	float                                                        FogDirectionalInscatteringStartStatic;             // 0x31c(0x4)
	float                                                        FogUnderwaterDirectionalInscatteringStartStatic;   // 0x320(0x4)
	float                                                        UnderwaterDirectionalLightMinBrightnessStatic;     // 0x324(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NPCOnSurfaceVOManagerInterface: public Interface
{
public:
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class CategoryBase: public Object
{
public:
	struct FText                                                 Name;                                              // 0x28(0x38)
	struct FName                                                 UniqueTextIdentifier;                              // 0x60(0x8)
	struct StringAssetReference                                  IconPath;                                          // 0x68(0x10)
	struct FeatureFlag                                           FeatureToggle;                                     // 0x78(0xc)
	char                                                         pad0x4_LBTTI[0x4];                                 // 0x84(0x4)
};


// Size 0x148 (Full Size[0x200] - InheritedSize[0xb8]
class LoadableComponent: public ActorComponent
{
public:
	char                                                         pad0x8_KQW57[0x8];                                 // 0xb8(0x8)
	float                                                        LoadTime;                                          // 0xc0(0x4)
	float                                                        UnloadTime;                                        // 0xc4(0x4)
	TArray<struct LoadableComponentTimerOverride>                TimerOverrides;                                    // 0xc8(0x10)
	class UClass*                                                DefaultObjectToLoad;                               // 0xd8(0x8)
	char                                                         pad0x50_G7VG6[0x50];                               // 0xe0(0x50)
	struct Transform                                             UnloadingPoint;                                    // 0x130(0x30)
	char                                                         pad0x18_GC7SF[0x18];                               // 0x160(0x18)
	struct LoadableComponentState                                LoadableComponentState;                            // 0x178(0x10)
	bool                                                         AlwaysLoaded;                                      // 0x188(0x1)
	char                                                         pad0x77_AN02V[0x77];                               // 0x189(0x77)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class QuickCycleToShovelNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class NPCOnSurfaceVOManager: public Object
{
public:
	char                                                         pad0x10_4I0AS[0x10];                               // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AtlasSlotRenderer: public Interface
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class SetTaleProgressStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    TriggerVolume;                                     // 0x80(0x30)
};


// Size 0xc0 (Full Size[0x178] - InheritedSize[0xb8]
class PlayerCurseComponent: public ActorComponent
{
public:
	class ParticleSystem*                                        TemplateVFX;                                       // 0xb8(0x8)
	class UClass*                                                AudioComponentClass;                               // 0xc0(0x8)
	class WwiseEvent*                                            PlayCurseActiveAudioLoopEvent;                     // 0xc8(0x8)
	class WwiseEvent*                                            StopCurseActiveAudioLoopEvent;                     // 0xd0(0x8)
	struct FName                                                 CurseAudioSwitchGroup;                             // 0xd8(0x8)
	TArray<struct PlayerCurseToAudioSwitchValue>                 CurseToAudioSwitchValues;                          // 0xe0(0x10)
	char                                                         pad0x18_CEN7F[0x18];                               // 0xf0(0x18)
	class ParticleSystemComponent*                               CurseVFX;                                          // 0x108(0x8)
	char                                                         pad0x50_GMIX8[0x50];                               // 0x110(0x50)
	char                                                         ActiveCurseForFX;                                  // 0x160(0x1)
	char                                                         pad0x17_IZHM6[0x17];                               // 0x161(0x17)
};


// Size 0x78 (Full Size[0x418] - InheritedSize[0x3a0]
class Rudder: public Actor
{
public:
	char                                                         pad0x8_OUSO7[0x8];                                 // 0x3a0(0x8)
	float                                                        AngleBlend;                                        // 0x3a8(0x4)
	float                                                        MaxAngle;                                          // 0x3ac(0x4)
	struct Vector                                                PositionForRudderDynamicsRelativeToRudderActor;    // 0x3b0(0xc)
	struct Vector                                                RelativeRightShipDir;                              // 0x3bc(0xc)
	class BaseRudderDynamicsDesc*                                RudderDynamicsDesc;                                // 0x3c8(0x8)
	char                                                         pad0x18_S7HJD[0x18];                               // 0x3d0(0x18)
	float                                                        ServerAngleRatio;                                  // 0x3e8(0x4)
	char                                                         pad0x2c_XWUYC[0x2c];                               // 0x3ec(0x2c)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class RemoveMechanismTriggerStep: public TaleQuestStep
{
public:
	class RemoveMechanismTriggerStepDesc*                        Desc;                                              // 0x98(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestResetShipBuoyancyServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x20 (Full Size[0x2f0] - InheritedSize[0x2d0]
class RainZoneComponent: public SceneComponent
{
public:
	char                                                         pad0x8_1ICSR[0x8];                                 // 0x2d0(0x8)
	struct RainZoneParameters                                    RainZoneParameters;                                // 0x2d8(0xc)
	char                                                         pad0xc_5FRJE[0xc];                                 // 0x2e4(0xc)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class HealthTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x100 (Full Size[0x6b0] - InheritedSize[0x5b0]
class TestClimbingActor: public Character
{
public:
	char                                                         pad0x60_6F2SG[0x60];                               // 0x5b0(0x60)
	class ClimbingComponent*                                     ClimbingComponent;                                 // 0x610(0x8)
	char                                                         pad0x98_TKJSQ[0x98];                               // 0x618(0x98)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class StatusResponseOCReceiveBuffAudio: public StatusResponse
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class MapRadialInventoryActivatedGamepadNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class MapRadialActionRightTriggerGamepadNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class AIControlledWaterFillRateParamsDataAsset: public DataAsset
{
public:
	float                                                        LeakAmountMultiplier;                              // 0x28(0x4)
	float                                                        RepairTimeMultiplier;                              // 0x2c(0x4)
};


// Size 0x98 (Full Size[0x150] - InheritedSize[0xb8]
class ActivateReapersChestComponent: public ActorComponent
{
public:
	class UClass*                                                BreakSealActionInputId;                            // 0xb8(0x8)
	class UClass*                                                BreakSealActionReleasedInputId;                    // 0xc0(0x8)
	struct BreakReapersChestSealActionRuleVerbiage               BreakReapersChestSealActionRuleVerbiage;           // 0xc8(0x70)
	char                                                         pad0x18_6KWLN[0x18];                               // 0x138(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAnimationInstanceTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class LookingAtWieldableCycleForwardsNotificationInputId: public NotificationInputId
{
public:
};


// Size 0xd0 (Full Size[0x188] - InheritedSize[0xb8]
class VisualHealthResponseComponent: public ActorComponent
{
public:
	class ParticleSystemComponent*                               ActiveVfx;                                         // 0xb8(0x8)
	class VisualHealthResponseDataAsset*                         VisualHealthResponseData;                          // 0xc0(0x8)
	TArray<class MaterialInstanceDynamic*>                       HealthResponseMaterials;                           // 0xc8(0x10)
	char                                                         pad0x88_IY9UE[0x88];                               // 0xd8(0x88)
	bool                                                         WaitForAllMeshChange;                              // 0x170(0x1)
	char                                                         pad0x7_DH7KT[0x7];                                 // 0x171(0x7)
	char                                                         pad0x10_XV40R[0x10];                               // 0x178(0x10)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class AllianceSettingsAsset: public DataAsset
{
public:
	float                                                        MaximumAllianceDistance;                           // 0x28(0x4)
	float                                                        PollDelay;                                         // 0x2c(0x4)
	class UClass*                                                OfferFlag;                                         // 0x30(0x8)
	class UClass*                                                AcceptFlag;                                        // 0x38(0x8)
	class UClass*                                                LeaveFlag;                                         // 0x40(0x8)
	class AlliancePennantAsset*                                  AlliancePennantAsset;                              // 0x48(0x8)
	TArray<class Class*>                                         AllianceAllowedShipSizes;                          // 0x50(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SpawnedImpactProxyInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SPC_SharedResource_AggressiveGhostShip_ashen_dragon_skl_figurehead_01_a: public SandboxPerformanceConstraintSharedResourceType
{
public:
};


// Size 0x1c0 (Full Size[0x1e8] - InheritedSize[0x28]
class FragileComponentDataAsset: public DataAsset
{
public:
	float                                                        DefaultDamageScalar;                               // 0x28(0x4)
	char                                                         pad0x4_NU4SL[0x4];                                 // 0x2c(0x4)
	class CurveFloat*                                            DropDistanceToDamageCurve;                         // 0x30(0x8)
	class CurveFloat*                                            FallSpeedToDamageCurve;                            // 0x38(0x8)
	class WwiseEvent*                                            DamageSound;                                       // 0x40(0x8)
	struct FName                                                 ObjectDamageRTPCName;                              // 0x48(0x8)
	class Object*                                                DamageVfx;                                         // 0x50(0x8)
	struct FName                                                 DamageVfxSocketName;                               // 0x58(0x8)
	float                                                        SignificantHealthChangeAbsolute;                   // 0x60(0x4)
	char                                                         pad0x4_Z7CY8[0x4];                                 // 0x64(0x4)
	TArray<struct FragileComponentShipDamageTypeEntry>           ShipDamageTypeValues;                              // 0x1a8(0x10)
	TArray<struct FragileComponentHealthScalarEntry>             DamageTypeScalars;                                 // 0x1b8(0x10)
	TArray<char>                                                 BlockedHealthChangedReasons;                       // 0x1c8(0x10)
	TArray<Class>                                                BlockedWielderTypesForDamage;                      // 0x1d8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WieldableItemCooldownBaseType: public Object
{
public:
};


// Size 0x20 (Full Size[0xd8] - InheritedSize[0xb8]
class SimpleSceneDialogueComponent: public ActorComponent
{
public:
	char                                                         pad0x8_NGR8H[0x8];                                 // 0xb8(0x8)
	TArray<class WwiseEvent*>                                    AudioEvents;                                       // 0xc0(0x10)
	char                                                         pad0x8_JS8YD[0x8];                                 // 0xd0(0x8)
};


// Size 0x18 (Full Size[0xd0] - InheritedSize[0xb8]
class ReapersMarkTrackedItemComponent: public ActorComponent
{
public:
	char                                                         pad0x10_ZZ89K[0x10];                               // 0xb8(0x10)
	char                                                         ItemType;                                          // 0xc8(0x1)
	char                                                         pad0x7_4QT5I[0x7];                                 // 0xc9(0x7)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class LaunchableProjectileService: public Object
{
public:
	char                                                         pad0x8_9HEYE[0x8];                                 // 0x28(0x8)
	class World*                                                 World;                                             // 0x30(0x8)
	TArray<struct LaunchableActiveProjectileData>                ActiveProjectiles;                                 // 0x38(0x10)
};


// Size 0xa0 (Full Size[0x158] - InheritedSize[0xb8]
class PostGrappleComponent: public ActorComponent
{
public:
	struct RuntimeFloatCurve                                     GroundMovementSpeedMultiplierCurve;                // 0xb8(0x80)
	float                                                        Duration;                                          // 0x138(0x4)
	char                                                         pad0x1_OYULP[0x1];                                 // 0x13c(0x1)
	bool                                                         AuthIsInPostGrappleState;                          // 0x13d(0x1)
	char                                                         pad0x2_802EO[0x2];                                 // 0x13e(0x2)
	class AthenaPlayerCharacter*                                 Player;                                            // 0x140(0x8)
	char                                                         pad0x10_U1J9Q[0x10];                               // 0x148(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class VoyageParticipantInterface: public Interface
{
public:
};


// Size 0x110 (Full Size[0x4b0] - InheritedSize[0x3a0]
class MatineeUtility: public Actor
{
public:
	char                                                         pad0x108_KV5L3[0x108];                             // 0x3a0(0x108)
	class AthenaPlayerCharacter*                                 BoundCharacter;                                    // 0x4a8(0x8)
};


// Size 0xb0 (Full Size[0x148] - InheritedSize[0x98]
class AwaitCrewShipToSailAwayFromCurrentLocationStep: public TaleQuestStep
{
public:
	char                                                         pad0xb0_O58Y9[0xb0];                               // 0x98(0xb0)
};


// Size 0xa0 (Full Size[0x120] - InheritedSize[0x80]
class TaleQuestNotificationStepDesc: public TaleQuestStepDesc
{
public:
	class PopUpMessageDesc*                                      Notification;                                      // 0x80(0x8)
	struct QuestVariablePlayerActor                              PreventNotificationForPlayer;                      // 0x88(0x30)
	struct QuestVariablePlayerActor                              Player;                                            // 0xb8(0x30)
	struct QuestVariableActorArray                               ExplicitPlayerList;                                // 0xe8(0x30)
	bool                                                         OnlyShowNotificationForDiscoveringPlayer;          // 0x118(0x1)
	char                                                         pad0x7_EE54Y[0x7];                                 // 0x119(0x7)
};


// Size 0x80 (Full Size[0xa8] - InheritedSize[0x28]
class ShantyService: public Object
{
public:
	char                                                         pad0x8_XDD6R[0x8];                                 // 0x28(0x8)
	TArray<class Ensemble*>                                      EnsembleActors;                                    // 0x30(0x10)
	class ShantySettings*                                        ShantySettings;                                    // 0x40(0x8)
	char                                                         pad0x60_YPQWJ[0x60];                               // 0x48(0x60)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CutsceneResponseMetaData: public Object
{
public:
};


// Size 0x0 (Full Size[0xb8] - InheritedSize[0xb8]
class ActorBuriedByPlayerComponent: public ActorComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetMovementStateModifierInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class HarpoonRetractNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class PlayerPermissionsComponent: public ActorComponent
{
public:
	bool                                                         AllowDebugMenuAccess;                              // 0xb8(0x1)
	bool                                                         AllowDebugMenuButtonShortcutsAccess;               // 0xb9(0x1)
	bool                                                         AllowExecuteOnServer;                              // 0xba(0x1)
	bool                                                         DisableWatermark;                                  // 0xbb(0x1)
	char                                                         pad0x4_1UC81[0x4];                                 // 0xbc(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NPCDialogHeaderInfoInterface: public Interface
{
public:
};


// Size 0x118 (Full Size[0x280] - InheritedSize[0x168]
class SwimmingCreatureMovementComponent: public FloatingPawnMovement
{
public:
	char                                                         pad0x10_GSTWE[0x10];                               // 0x168(0x10)
	float                                                        MinPlayRate;                                       // 0x178(0x4)
	float                                                        MaxPlayRate;                                       // 0x17c(0x4)
	float                                                        NetworkSimulatedSmoothLocationTime;                // 0x180(0x4)
	float                                                        NetworkSimulatedSmoothRotationTime;                // 0x184(0x4)
	float                                                        WaterSurfaceCheckHeightOffset;                     // 0x188(0x4)
	float                                                        DistanceFromWaterSurfaceForMaxAdjustmentVelocity;  // 0x18c(0x4)
	float                                                        MaxWaterSurfaceAdjustmentVelocity;                 // 0x190(0x4)
	float                                                        VelocitySmoothingFactor;                           // 0x194(0x4)
	float                                                        SharkFinHeightCheckOffset;                         // 0x198(0x4)
	char                                                         pad0x4_NTOPU[0x4];                                 // 0x19c(0x4)
	class CurveFloat*                                            SinkingAccelerationOverTime;                       // 0x1a0(0x8)
	int                                                          PushOutHemisphereSteps;                            // 0x1a8(0x4)
	int                                                          PushOutStepsOnNarrowestHemisphereBand;             // 0x1ac(0x4)
	int                                                          PushOutStepsOnWidestHemisphereBand;                // 0x1b0(0x4)
	float                                                        MaxExtraPushOut;                                   // 0x1b4(0x4)
	int                                                          NumStepsToRampUpToMaxPushOut;                      // 0x1b8(0x4)
	struct CollisionProfileName                                  PenetrationPanicCollisionProfile;                  // 0x1bc(0x8)
	bool                                                         ShouldDestroyOnUnresolvedCollision;                // 0x1c4(0x1)
	char                                                         pad0x3_IVS6O[0x3];                                 // 0x1c5(0x3)
	float                                                        SmoothNetUpdateLocationTime;                       // 0x1c8(0x4)
	float                                                        SmoothNetUpdateRotationTime;                       // 0x1cc(0x4)
	float                                                        MaxMovementTimeAllowedForSmoothNetUpdate;          // 0x1d0(0x4)
	float                                                        DebugDrawHeight;                                   // 0x1d4(0x4)
	float                                                        DebugDrawRadius;                                   // 0x1d8(0x4)
	char                                                         ReplicatedSwimmingMode;                            // 0x1dc(0x1)
	char                                                         pad0x23_BCGBH[0x23];                               // 0x1dd(0x23)
	TArray<struct SwimmingCreatureAIStrategyMovementProperties>  AIStrategyMovementProperties;                      // 0x200(0x10)
	struct SwimmingCreatureMovementReplicatedData                ReplicatedMovementData;                            // 0x210(0x30)
	char                                                         pad0x40_7GOZ5[0x40];                               // 0x240(0x40)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIShipCaptainActionStateId: public ActionStateId
{
public:
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class CharacterMeshRetrievalComponent: public ActorComponent
{
public:
	char                                                         pad0x8_3CAQL[0x8];                                 // 0xb8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class VfxFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WorldSequenceInterface: public Interface
{
public:
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class BroadcasterPuzzleStatueAudioParamsDataAsset: public DataAsset
{
public:
	class WwiseEvent*                                            BroadcasterInitiateReactionSequence;               // 0x28(0x8)
	class WwiseEvent*                                            SuccessHumStart;                                   // 0x30(0x8)
	class WwiseEvent*                                            SuccessHumStop;                                    // 0x38(0x8)
	class WwiseEvent*                                            SuccessWaterLevelUp;                               // 0x40(0x8)
	class WwiseEvent*                                            SuccessWaterLevelDown;                             // 0x48(0x8)
	class WwiseEvent*                                            SuccessGeneralActivation;                          // 0x50(0x8)
	class WwiseEvent*                                            UnsuccessfulSequence;                              // 0x58(0x8)
	class WwiseEvent*                                            ShockwaveEffect;                                   // 0x60(0x8)
};


// Size 0x1e8 (Full Size[0x2a0] - InheritedSize[0xb8]
class BootyItemShipOwnershipComponent: public ActorComponent
{
public:
	bool                                                         FirstTimeDroppedConditionalStatTriggerSent;        // 0xb8(0x1)
	char                                                         pad0x7_5NNEQ[0x7];                                 // 0xb9(0x7)
	class Actor*                                                 OwningShip;                                        // 0xc0(0x8)
	TArray<struct Guid>                                          CrewShipsOwnedByHistory;                           // 0xc8(0x10)
	char                                                         pad0x1c8_JDZF7[0x1c8];                             // 0xd8(0x1c8)
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class LoadoutSettings: public Object
{
public:
	struct StringAssetReference                                  DefaultLoadoutAsset;                               // 0x28(0x10)
	struct StringAssetReference                                  InitialLoadoutAsset;                               // 0x38(0x10)
	struct StringAssetReference                                  FallbackLoadoutAsset;                              // 0x48(0x10)
	struct StringAssetReference                                  ContestLoadoutAsset;                               // 0x58(0x10)
	TArray<struct SupplementalLoadout>                           SupplementalLoadouts;                              // 0x68(0x10)
	char                                                         pad0x20_9V29A[0x20];                               // 0x78(0x20)
};


// Size 0x140 (Full Size[0x4e0] - InheritedSize[0x3a0]
class HauntedFort: public Actor
{
public:
	char                                                         pad0x10_JP1OE[0x10];                               // 0x3a0(0x10)
	class StaticMeshComponent*                                   FortMesh;                                          // 0x3b0(0x8)
	class ChildActorComponent*                                   Target_A;                                          // 0x3b8(0x8)
	class ChildActorComponent*                                   Target_B;                                          // 0x3c0(0x8)
	class ChildActorComponent*                                   Target_C;                                          // 0x3c8(0x8)
	class ChildActorComponent*                                   Target_D;                                          // 0x3d0(0x8)
	class ChildActorComponent*                                   Target_E;                                          // 0x3d8(0x8)
	class ChildActorComponent*                                   Target_F;                                          // 0x3e0(0x8)
	class ChildActorComponent*                                   Target_G;                                          // 0x3e8(0x8)
	class ChildActorComponent*                                   Target_H;                                          // 0x3f0(0x8)
	class ChildActorComponent*                                   Target_I;                                          // 0x3f8(0x8)
	class HauntedFortEmplacement*                                Emplacement_A;                                     // 0x400(0x8)
	class HauntedFortEmplacement*                                Emplacement_B;                                     // 0x408(0x8)
	class HauntedFortEmplacement*                                Emplacement_C;                                     // 0x410(0x8)
	TArray<class HauntedFortTarget*>                             TargetsArray;                                      // 0x418(0x10)
	TArray<class HauntedFortTarget*>                             EmplacementsArray;                                 // 0x428(0x10)
	float                                                        ServerMigrationExclusionRadius;                    // 0x438(0x4)
	char                                                         pad0xa4_GEQO0[0xa4];                               // 0x43c(0xa4)
};


// Size 0x1b0 (Full Size[0x2f0] - InheritedSize[0x140]
class BalanceableWalkwayComponent: public InteractableComponent
{
public:
	char                                                         pad0x30_8RBSL[0x30];                               // 0x140(0x30)
	struct Vector                                                StartPoint;                                        // 0x170(0xc)
	struct Vector                                                EndPoint;                                          // 0x17c(0xc)
	struct ReplicatedDataForSimulatedProxy                       ReplicatedDataForSimulatedProxy;                   // 0x188(0x30)
	char                                                         pad0x8_70478[0x8];                                 // 0x1b8(0x8)
	class CurveFloat*                                            UniqueRopeCounterBalanceForceCurve;                // 0x1c0(0x8)
	class BalanceableWalkwayDataAsset*                           WalkwayDataAsset;                                  // 0x1c8(0x8)
	class BalanceableWalkwayFXParams*                            WalkwayFXDataAsset;                                // 0x1d0(0x8)
	char                                                         pad0x14_F42LL[0x14];                               // 0x1d8(0x14)
	bool                                                         IsValidWalkway;                                    // 0x1ec(0x1)
	char                                                         pad0x103_2GF9H[0x103];                             // 0x1ed(0x103)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class UsableItemsActionRulesBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MountpointViewInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RemoteServicesProviderInterface: public Interface
{
public:
};


// Size 0x188 (Full Size[0x240] - InheritedSize[0xb8]
class RewindComponent: public ActorComponent
{
public:
	char                                                         pad0x10_26KK7[0x10];                               // 0xb8(0x10)
	bool                                                         AutoRegister;                                      // 0xc8(0x1)
	char                                                         CollisionChannel;                                  // 0xc9(0x1)
	char                                                         pad0x2_9XJ6E[0x2];                                 // 0xca(0x2)
	struct RewindComponentParameters                             Parameters;                                        // 0xcc(0x10)
	bool                                                         ShouldRegisterToAggregateTick;                     // 0xdc(0x1)
	char                                                         pad0x163_E4Y9K[0x163];                             // 0xdd(0x163)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ItemLifetimeManagerServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DeathCustomisationInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0x98] - InheritedSize[0x80]
class DebugSkipToStepDesc: public TaleQuestStepDesc
{
public:
	class TaleQuestStepDesc*                                     NextDesc;                                          // 0x80(0x8)
	struct FString                                               SkipName;                                          // 0x88(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BaseAnchorDynamicsDesc: public DataAsset
{
public:
};


// Size 0x190 (Full Size[0x1b8] - InheritedSize[0x28]
class GameNarrationCoordinator: public Object
{
public:
	class WwiseEvent*                                            NarrationSpeakEvent;                               // 0x28(0x8)
	struct WwiseEmitter                                          Emitter;                                           // 0x30(0x20)
	char                                                         pad0x138_WEJDY[0x138];                             // 0x50(0x138)
	struct FString                                               CachedPreferredVoice;                              // 0x188(0x10)
	struct FString                                               CachedLanguage;                                    // 0x198(0x10)
	int                                                          CachedGender;                                      // 0x1a8(0x4)
	bool                                                         IsNarrationSettingEnabled;                         // 0x1ac(0x1)
	char                                                         pad0x3_KLJOV[0x3];                                 // 0x1ad(0x3)
	int                                                          NarrationOverride;                                 // 0x1b0(0x4)
	char                                                         pad0x4_VQJ0C[0x4];                                 // 0x1b4(0x4)
};


// Size 0x0 (Full Size[0x460] - InheritedSize[0x460]
class InGameCommandAISpawner: public AISpawner
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class DockableKeyedInstrumentKeyPressNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x30 (Full Size[0x258] - InheritedSize[0x228]
class AthenaLocalPlayer: public LocalPlayer
{
public:
	char                                                         pad0x30_NIAZ0[0x30];                               // 0x228(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CargoRunServiceQueryInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WaterGunInfoInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SinkingInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0xc8] - InheritedSize[0xb8]
class AnimNotifyWwiseEmitterRetrievalComponent: public ActorComponent
{
public:
	char                                                         pad0x8_1A1AA[0x8];                                 // 0xb8(0x8)
	class AnimNotifyWwiseEmitterComponent*                       CachedComponent;                                   // 0xc0(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class StatusResponseSickness: public StatusResponse
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlockReactionInterface: public Interface
{
public:
};


// Size 0xf0 (Full Size[0x170] - InheritedSize[0x80]
class SpawnShipwreckTaleStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableShipwreck                                SpawnedShipwreck;                                  // 0x80(0x30)
	struct QuestVariableClass                                    CustomWreckType;                                   // 0xb0(0x30)
	struct QuestVariableVector                                   CustomWreckLocation;                               // 0xe0(0x30)
	struct QuestVariableRotator                                  CustomWreckRotation;                               // 0x110(0x30)
	struct QuestVariableText                                     CustomWreckVesselName;                             // 0x140(0x30)
};


// Size 0x2c8 (Full Size[0x668] - InheritedSize[0x3a0]
class EmissaryVoteInteractionActor: public Actor
{
public:
	char                                                         pad0x10_IMDQR[0x10];                               // 0x3a0(0x10)
	class BoxedRpcDispatcherComponent*                           BoxedRpcDispatcherComponent;                       // 0x3b0(0x8)
	float                                                        FadeDuration;                                      // 0x3b8(0x4)
	char                                                         pad0x4_E5J9I[0x4];                                 // 0x3bc(0x4)
	struct EmissaryDisplayInformation                            EmissaryActiveInfo;                                // 0x3c0(0x90)
	struct EmissaryDisplayInformation                            EmissaryInactiveInfo;                              // 0x450(0x90)
	struct EmissaryDisplayInformation                            EmissarySaferSeasInfo;                             // 0x4e0(0x90)
	char                                                         pad0xf8_HE5CM[0xf8];                               // 0x570(0xf8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BaseHullDragDynamicsDesc: public DataAsset
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CutsceneActorInterface: public Interface
{
public:
};


// Size 0xa0 (Full Size[0x640] - InheritedSize[0x5a0]
class SurfaceWaterComponent: public PrimitiveComponent
{
public:
	struct Vector                                                BoxExtent;                                         // 0x598(0xc)
	float                                                        UpdateCullDistance;                                // 0x5a4(0x4)
	class Texture2D*                                             AddWaterMaskTexture;                               // 0x5a8(0x8)
	class Texture2D*                                             BaseHeightTexture;                                 // 0x5b0(0x8)
	int                                                          TextureSizeX;                                      // 0x5b8(0x4)
	int                                                          TextureSizeY;                                      // 0x5bc(0x4)
	float                                                        WetnessPerStrength;                                // 0x5c0(0x4)
	float                                                        WetnessDecayRate;                                  // 0x5c4(0x4)
	char                                                         pad0x18_RV4LB[0x18];                               // 0x5c8(0x18)
	struct Vector4                                               SplatData;                                         // 0x5e0(0x10)
	class TextureRenderTarget2D*                                 WaterHeightTexture;                                // 0x5f0(0x8)
	class TextureRenderTarget2D*                                 WaterHeightTexturePingPong;                        // 0x5f8(0x8)
	class TextureRenderTarget2D*                                 NormalTexture;                                     // 0x600(0x8)
	class TextureRenderTarget2D*                                 OutflowTexture;                                    // 0x608(0x8)
	class TextureRenderTarget2D*                                 OutflowTexturePingPong;                            // 0x610(0x8)
	char                                                         pad0x28_DDIYZ[0x28];                               // 0x618(0x28)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NamedObjectInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class QuickSwitchSecondaryWeaponNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DamagerType: public Object
{
public:
};


// Size 0x10 (Full Size[0x650] - InheritedSize[0x640]
class FishingLineRenderComponent: public RopeCatenaryRenderComponent
{
public:
	struct LinearColor                                           LineColour;                                        // 0x640(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SPC_Activity_LegendarySkellyFortEventSignal: public SandboxPerformanceConstraintActivityType
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ShipPartsCatalogueDataAsset: public DataAsset
{
public:
	struct ShipPartsCatalogue                                    Catalogue;                                         // 0x28(0x10)
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class SpawnCollectableQuestObjectStep: public TaleQuestStep
{
public:
	char                                                         pad0x18_LNT2H[0x18];                               // 0x98(0x18)
};


// Size 0x1f0 (Full Size[0x218] - InheritedSize[0x28]
class SirenTridentProjectileParams: public DataAsset
{
public:
	char                                                         ParameterState;                                    // 0x28(0x1)
	char                                                         pad0x7_6BQZG[0x7];                                 // 0x29(0x7)
	struct ExplosionInfo                                         ExplosionParams;                                   // 0x30(0x198)
	float                                                        CollisionRadius;                                   // 0x1c8(0x4)
	float                                                        MaterialScale;                                     // 0x1cc(0x4)
	float                                                        MaterialScaleChangeDuration;                       // 0x1d0(0x4)
	float                                                        LaunchSpeed;                                       // 0x1d4(0x4)
	float                                                        ChargeTime;                                        // 0x1d8(0x4)
	float                                                        Lifespan;                                          // 0x1dc(0x4)
	int                                                          AmmoCost;                                          // 0x1e0(0x4)
	float                                                        VfxCustomParameterValue;                           // 0x1e4(0x4)
	struct FName                                                 ProjectileAudioSwitchState;                        // 0x1e8(0x8)
	class WwiseEvent*                                            TrailSfxEventStart;                                // 0x1f0(0x8)
	class WwiseEvent*                                            TrailSfxEventStop;                                 // 0x1f8(0x8)
	class UClass*                                                ImpactId;                                          // 0x200(0x8)
	class ForceFeedbackEffect*                                   FireForceFeedback;                                 // 0x208(0x8)
	class ForceFeedbackEffect*                                   SizeChangeForceFeedback;                           // 0x210(0x8)
};


// Size 0x2140 (Full Size[0x21f8] - InheritedSize[0xb8]
class CharacterAudioComponent: public ActorComponent
{
public:
	char                                                         pad0x10_M364T[0x10];                               // 0xb8(0x10)
	class CharacterAudioComponentParams*                         Params;                                            // 0xc8(0x8)
	class WwiseEvent*                                            MonsterCallEvent;                                  // 0xd0(0x8)
	int                                                          MonsterCallHourToPlay;                             // 0xd8(0x4)
	struct FName                                                 TimeOfDayRtpc;                                     // 0xdc(0x8)
	char                                                         pad0x4_6UD7G[0x4];                                 // 0xe4(0x4)
	struct PlayerMusicController                                 PlayerMusicController;                             // 0xe8(0x210)
	class CharacterAudioFootfallControllerParams*                FootfallParams;                                    // 0x2f8(0x8)
	class CharacterAudioEventControllerParams*                   EventParams;                                       // 0x300(0x8)
	class UClass*                                                PegLegCategory;                                    // 0x308(0x8)
	class UClass*                                                BootsCategory;                                     // 0x310(0x8)
	char                                                         pad0x48_K9UF8[0x48];                               // 0x318(0x48)
	class AudioSpaceTrackerComponent*                            AudioSpaceTracker;                                 // 0x360(0x8)
	class AthenaPlayerCharacter*                                 AthenaPlayerCharacter;                             // 0x368(0x8)
	char                                                         pad0x1e30_0FKZ8[0x1e30];                           // 0x370(0x1e30)
	class AudioSpaceDataAsset*                                   CurrentSpace;                                      // 0x21a0(0x8)
	char                                                         pad0x18_2VI2B[0x18];                               // 0x21a8(0x18)
	class Ship*                                                  CurrentShip;                                       // 0x21c0(0x8)
	char                                                         pad0x30_RWD4E[0x30];                               // 0x21c8(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CaptainRammingAnimationStateId: public AIAnimationStateId
{
public:
};


// Size 0x38 (Full Size[0xf0] - InheritedSize[0xb8]
class AnimationDataOverriderComponent: public ActorComponent
{
public:
	char                                                         pad0x8_GNOTR[0x8];                                 // 0xb8(0x8)
	struct StringAssetReference                                  AnimationDataStoreAssetReference;                  // 0xc0(0x10)
	class AnimationDataStoreAsset*                               AnimationDataStoreAsset;                           // 0xd0(0x8)
	char                                                         pad0x18_BQZGI[0x18];                               // 0xd8(0x18)
};


// Size 0x978 (Full Size[0x9a0] - InheritedSize[0x28]
class AshenWindsFlamethrowerController: public Object
{
public:
	char                                                         pad0x8_RTTE1[0x8];                                 // 0x28(0x8)
	struct FlamethrowerCollisionsParams                          FlamethrowerCollisionParams;                       // 0x30(0x68)
	class FireGridCellSelectionParamsDataAsset*                  FlamethrowerFirePropagationIgnitionParams;         // 0x98(0x8)
	struct Status                                                FlamethrowerCollisionStatusEffect;                 // 0xa0(0x20)
	float                                                        TimeUntilApplyStatusEffect;                        // 0xc0(0x4)
	float                                                        TimeUntilIgniteFirePropagation;                    // 0xc4(0x4)
	float                                                        TimeToConsiderActorOutsideFlame;                   // 0xc8(0x4)
	float                                                        AngleBehindWielderToIgnoreCollisions;              // 0xcc(0x4)
	float                                                        FlamethrowerCollisionDamageAmount;                 // 0xd0(0x4)
	float                                                        DamagePerSecondInsideFlame;                        // 0xd4(0x4)
	struct PlayerStat                                            DamageableInterfaceStat;                           // 0xd8(0x4)
	char                                                         pad0x4_A0SQF[0x4];                                 // 0xdc(0x4)
	class UClass*                                                DamagerTypeClass;                                  // 0xe0(0x8)
	char                                                         HealthChangedReason;                               // 0xe8(0x1)
	bool                                                         ShouldFireStatsOnActorWithFirePropogationInterface; // 0xe9(0x1)
	char                                                         pad0x6_95XD3[0x6];                                 // 0xea(0x6)
	class AshenWindsSkull*                                       AshenWindsSkull;                                   // 0xf0(0x8)
	char                                                         pad0x8a8_D24GZ[0x8a8];                             // 0xf8(0x8a8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SPC_SharedResource_ReapersTributeShip: public SandboxPerformanceConstraintSharedResourceType
{
public:
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class DeepSeaSettings: public DeveloperSettings
{
public:
	float                                                        DeepSeaStartDepth;                                 // 0x38(0x4)
	float                                                        DepthToRemoveSurfaceNetCluster;                    // 0x3c(0x4)
};


// Size 0xb8 (Full Size[0x458] - InheritedSize[0x3a0]
class EmissaryFlag: public Actor
{
public:
	char                                                         pad0x8_SLQFC[0x8];                                 // 0x3a0(0x8)
	class ReplicatedShipPartCustomizationComponent*              CustomizationComponent;                            // 0x3a8(0x8)
	class WwiseEvent*                                            StartAmbientFlagSfx;                               // 0x3b0(0x8)
	class WwiseEvent*                                            StopAmbientFlagSfx;                                // 0x3b8(0x8)
	class WwiseEvent*                                            AttachFlagSfx;                                     // 0x3c0(0x8)
	class WwiseEvent*                                            DetachFlagSfx;                                     // 0x3c8(0x8)
	class WwiseObjectPoolWrapper*                                SfxPool;                                           // 0x3d0(0x8)
	class SceneComponent*                                        RootSceneComponent;                                // 0x3d8(0x8)
	class StaticMeshComponent*                                   EmissaryFlagStaticMeshComponent;                   // 0x3e0(0x8)
	char                                                         pad0x28_PGO18[0x28];                               // 0x3e8(0x28)
	struct StringAssetReference                                  CurrentEmissaryFlagMesh;                           // 0x410(0x10)
	char                                                         pad0x38_2OSV4[0x38];                               // 0x420(0x38)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ItemPreviewInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ReapersChestInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIInteractableInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0xc8] - InheritedSize[0x98]
class ChooseIslandStep: public TaleQuestStep
{
public:
	char                                                         pad0x30_PGBBC[0x30];                               // 0x98(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SPC_Activity_CursedSkellyFortEventSignal: public SandboxPerformanceConstraintActivityType
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddTemporarySessionEntitlementStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class MapRadialInventoryDeactivatedGamepadNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TunnelsOfTheDamnedServiceInterface: public Interface
{
public:
};


// Size 0x50 (Full Size[0xc8] - InheritedSize[0x78]
class AthenaGameUserSettings: public GameUserSettings
{
public:
	int                                                          MaxVerticalResolution;                             // 0x78(0x4)
	int                                                          MaxFPS;                                            // 0x7c(0x4)
	int                                                          VSync;                                             // 0x80(0x4)
	int                                                          LightingDetail;                                    // 0x84(0x4)
	int                                                          ModelDetail;                                       // 0x88(0x4)
	int                                                          ShadowDetail;                                      // 0x8c(0x4)
	int                                                          TextureDetail;                                     // 0x90(0x4)
	int                                                          WaterDetail;                                       // 0x94(0x4)
	int                                                          AnimationQuality;                                  // 0x98(0x4)
	int                                                          MMCThresholdScale;                                 // 0x9c(0x4)
	float                                                        ResolutionScaling;                                 // 0xa0(0x4)
	int                                                          ParticleEmitterQuality;                            // 0xa4(0x4)
	int                                                          ParticleResolutionQuality;                         // 0xa8(0x4)
	int                                                          BackBufferCount;                                   // 0xac(0x4)
	int                                                          ShowPerformanceCounters;                           // 0xb0(0x4)
	int                                                          ShowPerformanceCounters_Console;                   // 0xb4(0x4)
	bool                                                         SmoothFPS;                                         // 0xb8(0x1)
	bool                                                         HDR;                                               // 0xb9(0x1)
	bool                                                         AudioOutputSpatialAudio;                           // 0xba(0x1)
	char                                                         pad0x1_WXA9J[0x1];                                 // 0xbb(0x1)
	int                                                          D3DVersion;                                        // 0xbc(0x4)
	bool                                                         ParallelRendering;                                 // 0xc0(0x1)
	bool                                                         GpuCrashDetection;                                 // 0xc1(0x1)
	bool                                                         Fullscreen;                                        // 0xc2(0x1)
	char                                                         pad0x5_9ZD7I[0x5];                                 // 0xc3(0x5)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MountableInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class TunnelPresenterObjectParamsBase: public Object
{
public:
	class UClass*                                                PresenterObjectClass;                              // 0x28(0x8)
	char                                                         StartMode;                                         // 0x30(0x1)
	char                                                         pad0x7_8NX5T[0x7];                                 // 0x31(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TelemetrySubjectInterface: public Interface
{
public:
};


// Size 0x110 (Full Size[0x4b0] - InheritedSize[0x3a0]
class SkeletonActionStateCreatorDefinition: public ActionStateCreatorDefinition
{
public:
	struct AISpawnActionStateParams                              AISpawnParams;                                     // 0x3a0(0x10)
	struct AIDeadActionStateParams                               AIDeadParams;                                      // 0x3b0(0x4)
	struct UseItemActionStateParams                              UseItemParams;                                     // 0x3b4(0x1)
	char                                                         pad0x3_AOOLE[0x3];                                 // 0x3b5(0x3)
	struct UseCannonActionStateParams                            UseCannonParams;                                   // 0x3b8(0x80)
	struct RepairObjectActionStateParams                         RepairObjectParams;                                // 0x438(0x8)
	struct ControlObjectActionStateParams                        ControlObjectParams;                               // 0x440(0x38)
	struct HiddenActionStateParams                               HiddenStateParams;                                 // 0x478(0x5)
	char                                                         pad0x3_UVYJU[0x3];                                 // 0x47d(0x3)
	struct RevivedActionStateParams                              PostReviveParameters;                              // 0x480(0x10)
	struct RemoveSpearActionStateParams                          RemoveSpearParams;                                 // 0x490(0x1)
	char                                                         pad0x1f_2E0JD[0x1f];                               // 0x491(0x1f)
};


// Size 0x150 (Full Size[0x178] - InheritedSize[0x28]
class PlayerModerationService: public Object
{
public:
	char                                                         pad0x148_NJ62Y[0x148];                             // 0x28(0x148)
	class AthenaPlayerCharacter*                                 ReportingCharacter;                                // 0x170(0x8)
};


// Size 0x60 (Full Size[0x118] - InheritedSize[0xb8]
class ViewModelComponentBase: public ActorComponent
{
public:
	char                                                         pad0x60_1J43D[0x60];                               // 0xb8(0x60)
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class PlayerWorldLocationComponent: public ActorComponent
{
public:
	struct FName                                                 CurrentWorldLocation;                              // 0xb8(0x8)
};


// Size 0xb8 (Full Size[0x170] - InheritedSize[0xb8]
class LookAtOffsetComponent: public ActorComponent
{
public:
	char                                                         pad0xb8_IRYXF[0xb8];                               // 0xb8(0xb8)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class DisableShipContainersStatus: public StatusBase
{
public:
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class WaitForUnlockStep: public TaleQuestStep
{
public:
	char                                                         pad0x8_7HQSV[0x8];                                 // 0x98(0x8)
};


// Size 0x68 (Full Size[0x120] - InheritedSize[0xb8]
class FogTrackerComponent: public ActorComponent
{
public:
	char                                                         pad0x8_J1QPH[0x8];                                 // 0xb8(0x8)
	float                                                        FogDensityThreshold;                               // 0xc0(0x4)
	char                                                         pad0x5c_NJT0F[0x5c];                               // 0xc4(0x5c)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class AIBuffStatus: public StatusBase
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class CharacterHitReactionDamagerTypeToAnimTypeLayer: public Object
{
public:
	TArray<struct CharacterHitReactionDamagerTypeToAnimTypePair> DamagerTypeToAnimTypePairs;                        // 0x28(0x10)
};


// Size 0x108 (Full Size[0x130] - InheritedSize[0x28]
class IslandDataAssetEntry: public DataAsset
{
public:
	struct FName                                                 IslandName;                                        // 0x28(0x8)
	TArray<struct TreasureMapData>                               TreasureMaps;                                      // 0x30(0x10)
	class WorldMapIslandDataAsset*                               WorldMapData;                                      // 0x40(0x8)
	class GeneratedLocationsDataAsset*                           UndergroundTreasureLocationsSource;                // 0x48(0x8)
	TArray<struct Vector>                                        UndergroundTreasureLocations;                      // 0x50(0x10)
	class LandmarkTreasureLocationsDataAsset*                    LandmarkTreasureLocationsSource;                   // 0x60(0x8)
	class GeneratedLocationsDataAsset*                           AISpawnLocationsSource;                            // 0x68(0x8)
	TArray<struct Vector>                                        AISpawnLocations;                                  // 0x70(0x10)
	class GeneratedLocationsDataAsset*                           FishingSpotLocationsSource;                        // 0x80(0x8)
	TArray<struct Vector>                                        FishingSpotLocations;                              // 0x88(0x10)
	TArray<class IslandItemDataAsset*>                           IslandItemLocationDataSources;                     // 0x98(0x10)
	TArray<class IslandSalvageSpawnerCollection*>                IslandSalvageSpawnerCollections;                   // 0xa8(0x10)
	TArray<struct TypedIslandItemSpawnLocationData>              SalvageItemsLocationData;                          // 0xb8(0x10)
	struct FText                                                 LocalisedName;                                     // 0xc8(0x38)
	class AISpawner*                                             AISpawner;                                         // 0x100(0x8)
	class AISpawner*                                             CannonsAISpawner;                                  // 0x108(0x8)
	class AISpawner*                                             EmergentCaptainSpawner;                            // 0x110(0x8)
	class IslandMaterialStatusZone*                              IslandMaterialStatusZone;                          // 0x118(0x8)
	struct PlayerStat                                            StatToFireWhenPlayerSetsFootOnIsland;              // 0x120(0x4)
	struct PlayerStat                                            StatToFireWhenShipVisitsAnIsland;                  // 0x124(0x4)
	bool                                                         ShouldBeHiddenOnWorldMap;                          // 0x128(0x1)
	bool                                                         UseAdvancedSearchForMermaidSpawn;                  // 0x129(0x1)
	char                                                         IslandActiveEventType;                             // 0x12a(0x1)
	char                                                         pad0x5_UQ2PZ[0x5];                                 // 0x12b(0x5)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class MutateCollectorsChestStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class StatusResponseSpawnAIOnShip: public StatusResponse
{
public:
	class AIFixedWavesSpawner*                                   AISpawner;                                         // 0x38(0x8)
};


// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class CutsceneResponseCoordinator: public Object
{
public:
	char                                                         pad0x10_331XV[0x10];                               // 0x28(0x10)
	bool                                                         SuppressResponses;                                 // 0x38(0x1)
	char                                                         pad0x7_2BLVD[0x7];                                 // 0x39(0x7)
	class Object*                                                WorldContextObject;                                // 0x40(0x8)
	char                                                         pad0x80_11QKD[0x80];                               // 0x48(0x80)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class MountpointParamsDataAsset: public DataAsset
{
public:
	TArray<struct MountpointParams>                              MountpointParams;                                  // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GatedHealthInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SampledMovementInterface: public Interface
{
public:
};


// Size 0xc8 (Full Size[0x148] - InheritedSize[0x80]
class TaleQuestSetVoyageBoarIslandStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableName                                     IslandName;                                        // 0x80(0x30)
	struct QuestVariableBool                                     IslandNameMigrated;                                // 0xb0(0x30)
	struct QuestVariableName                                     MigratedIslandName;                                // 0xe0(0x30)
	struct QuestVariableActor                                    WallowToMigrate;                                   // 0x110(0x30)
	bool                                                         IsReadingMigration;                                // 0x140(0x1)
	char                                                         pad0x7_SSGWP[0x7];                                 // 0x141(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LightingZoneInterface: public Interface
{
public:
};


// Size 0x2d8 (Full Size[0x678] - InheritedSize[0x3a0]
class ShipService: public Actor
{
public:
	char                                                         pad0x40_H1MZN[0x40];                               // 0x3a0(0x40)
	struct CrewShipPersistentDataManager                         PersistentCrewShipData;                            // 0x3e0(0x10)
	TArray<struct WeakActorHandle>                               ShipList;                                          // 0x3f0(0x10)
	TArray<struct CrewShipEntry>                                 CrewedShips;                                       // 0x400(0x10)
	char                                                         pad0x268_0XZQC[0x268];                             // 0x410(0x268)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class CaptainsLogbookAccoladeDefinitionsAsset: public DataAsset
{
public:
	struct CaptainsLogbookAccoladeDefinition                     DefaultDefinition;                                 // 0x28(0x18)
	TArray<struct CaptainsLogbookAccoladeDefinition>             Definitions;                                       // 0x40(0x10)
};


// Size 0xb8 (Full Size[0x138] - InheritedSize[0x80]
class CreateAshenLordEncounterTaleStepDesc: public TaleQuestStepDesc
{
public:
	struct AshenLordCustomEncounterSettings                      CustomisationOptions;                              // 0x80(0x58)
	struct QuestVariableAISpawner                                AshenLordSpawner;                                  // 0xd8(0x30)
	struct QuestVariableGameEvent                                AshenLordEncounterEvent;                           // 0x108(0x30)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestNotificationUsingVariableStep: public TaleQuestStep
{
public:
	class TaleQuestNotificationUsingVariableStepDesc*            Desc;                                              // 0x98(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CarouselPirateDescConversion: public BlueprintFunctionLibrary
{
public:
};


// Size 0x140 (Full Size[0x168] - InheritedSize[0x28]
class MeshMemoryConstraintService: public Object
{
public:
	char                                                         pad0x30_DIR6N[0x30];                               // 0x28(0x30)
	class World*                                                 World;                                             // 0x58(0x8)
	char                                                         pad0x20_CVH91[0x20];                               // 0x60(0x20)
	class MeshMemoryConstraintSettings*                          MMCSettings;                                       // 0x120(0x8)
	class MeshMemoryConstraintFallbackCollection*                MMCFallbackCollection;                             // 0x128(0x8)
	char                                                         pad0x38_A1BMW[0x38];                               // 0x130(0x38)
};


// Size 0x88 (Full Size[0x310] - InheritedSize[0x288]
class MenuInputComponent: public AthenaCharacterBaseInputComponent
{
public:
	char                                                         pad0x88_U49KN[0x88];                               // 0x288(0x88)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StarChartConstellationInterface: public Interface
{
public:
};


// Size 0x2c0 (Full Size[0x660] - InheritedSize[0x3a0]
class HullDamage: public Actor
{
public:
	char                                                         pad0x20_JI2SX[0x20];                               // 0x3a0(0x20)
	class SceneComponent*                                        Root;                                              // 0x3c0(0x8)
	class MobileInstancedStaticMeshComponent*                    RepairPlanksMesh;                                  // 0x3c8(0x8)
	class ShipDamageableComponent*                               ShipDamageComponent;                               // 0x3d0(0x8)
	class BakedDecalComponent*                                   ImpactDecalComponent;                              // 0x3d8(0x8)
	struct RandomStream                                          RandomDecalStream;                                 // 0x3e0(0x8)
	TArray<class Texture2D*>                                     PersistentDamageDecals;                            // 0x3e8(0x10)
	float                                                        PersistentDamageDecalMinSize;                      // 0x3f8(0x4)
	float                                                        PersistentDamageDecalMaxSize;                      // 0x3fc(0x4)
	float                                                        PersistentDamageDecalNearDistance;                 // 0x400(0x4)
	float                                                        PersistentDamageDecalFarDistance;                  // 0x404(0x4)
	float                                                        PersistentDamageDecalCullDistance;                 // 0x408(0x4)
	char                                                         PersistentDamageDecalBlendMode;                    // 0x40c(0x1)
	char                                                         pad0x3_XQO97[0x3];                                 // 0x40d(0x3)
	int                                                          PersistentDamageDecalLODIndex;                     // 0x410(0x4)
	char                                                         pad0x4_QAF7T[0x4];                                 // 0x414(0x4)
	TArray<class MaterialInstance*>                              DeferredDamageDecals;                              // 0x418(0x10)
	float                                                        DeferredDamageDecalMinSize;                        // 0x428(0x4)
	float                                                        DeferredDamageDecalMaxSize;                        // 0x42c(0x4)
	int                                                          DamageZoneTickInterval;                            // 0x430(0x4)
	char                                                         pad0x4_OVOAQ[0x4];                                 // 0x434(0x4)
	class ShipInternalWater*                                     InternalWater;                                     // 0x438(0x8)
	TArray<class DamageZone*>                                    DamageZones;                                       // 0x440(0x10)
	TArray<class DamageZone*>                                    ActiveHullDamageZones;                             // 0x450(0x10)
	TArray<class DamageZone*>                                    BottomDeckDamageZones;                             // 0x460(0x10)
	TArray<class DamageZone*>                                    MiddleDeckDamageZones;                             // 0x470(0x10)
	struct WeightedProbabilityRange                              DamageZoneDeckDistribution;                        // 0x480(0x20)
	class PersistenceIdentifierSettingsAsset*                    PersistenceIdentifierSettingsAsset;                // 0x4a0(0x8)
	char                                                         pad0x178_MKWJL[0x178];                             // 0x4a8(0x178)
	TArray<class RepairableComponent*>                           RepairablePoints;                                  // 0x620(0x10)
	char                                                         pad0x30_TO19V[0x30];                               // 0x630(0x30)
};


// Size 0x0 (Full Size[0xb8] - InheritedSize[0xb8]
class TallTaleSpawnedActorComponent: public ActorComponent
{
public:
};


// Size 0x80 (Full Size[0x138] - InheritedSize[0xb8]
class FaceTargetComponent: public ActorComponent
{
public:
	float                                                        BlendRotationInterpSpeed;                          // 0xb8(0x4)
	bool                                                         BlendRotationUseConstantInterp;                    // 0xbc(0x1)
	char                                                         pad0x1b_2AHPS[0x1b];                               // 0xbd(0x1b)
	class Actor*                                                 TargetActorToFace;                                 // 0xd8(0x8)
	char                                                         pad0x48_R3FPU[0x48];                               // 0xe0(0x48)
	float                                                        ClampYawRange;                                     // 0x128(0x4)
	float                                                        ClampYawCentre;                                    // 0x12c(0x4)
	float                                                        ClampYawRate;                                      // 0x130(0x4)
	char                                                         pad0x4_1P17S[0x4];                                 // 0x134(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShipDynamicsProviderInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SkellyFortLockoutInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class FishingMouseXAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x110 (Full Size[0x4b0] - InheritedSize[0x3a0]
class ChaliceStatue: public Actor
{
public:
	class StaticMeshComponent*                                   Mesh;                                              // 0x3a0(0x8)
	TArray<class ParticleSystemComponent*>                       PhaseParticleSystems;                              // 0x3a8(0x10)
	char                                                         pad0x58_T97FW[0x58];                               // 0x3b8(0x58)
	struct ObjectMessagingDispatcher                             EventDispatcher;                                   // 0x410(0xa0)
};


// Size 0xb0 (Full Size[0xd8] - InheritedSize[0x28]
class AimAssistDataAsset: public DataAsset
{
public:
	float                                                        MinPlayerStrafeSpeed;                              // 0x28(0x4)
	float                                                        MaxPlayerStrafeSpeed;                              // 0x2c(0x4)
	TArray<class Class*>                                         ItemCategoriesForAimAssist;                        // 0x30(0x10)
	struct AimAssistStyleData                                    DefaultWeaponConfig;                               // 0x40(0x58)
	TArray<struct AimAssistStyleData>                            WeaponConfigs;                                     // 0x98(0x10)
	class CurveFloat*                                            DampingValueOfSlowdownBasedOnTargetOffsetX;        // 0xa8(0x8)
	class CurveFloat*                                            DampingValueOfSlowdownBasedOnTargetOffsetY;        // 0xb0(0x8)
	float                                                        MaxADSSlowdownFactor;                              // 0xb8(0x4)
	float                                                        MaxHipFireSlowdownFactor;                          // 0xbc(0x4)
	float                                                        MaxADSRotationFactor;                              // 0xc0(0x4)
	float                                                        MaxHipFireRotationFactor;                          // 0xc4(0x4)
	float                                                        RotationUnderwaterModifier;                        // 0xc8(0x4)
	float                                                        SlowdownUnderwaterModifier;                        // 0xcc(0x4)
	float                                                        RotationPitchAdjustment;                           // 0xd0(0x4)
	float                                                        NearPlayerAudioStartDistanceScreenPercentage;      // 0xd4(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AllianceBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x28 (Full Size[0xe0] - InheritedSize[0xb8]
class IslandAirPocketComponent: public ActorComponent
{
public:
	char                                                         pad0x8_PAW35[0x8];                                 // 0xb8(0x8)
	TArray<struct AirGivingVolumeData>                           AirGivingVolumes;                                  // 0xc0(0x10)
	char                                                         pad0x10_OFDNZ[0x10];                               // 0xd0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class UndoRepairActionStateId: public ActionStateId
{
public:
};


// Size 0x228 (Full Size[0x2e0] - InheritedSize[0xb8]
class ShipModifierComponent: public ActorComponent
{
public:
	TArray<struct ShipModifierStatus>                            ModifiersToApply;                                  // 0xb8(0x10)
	char                                                         pad0x218_ENEBI[0x218];                             // 0xc8(0x218)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class SwitchPresetDataAsset: public DataAsset
{
public:
	TArray<struct NonShippingSwitch>                             SwitchValues;                                      // 0x28(0x10)
	class CustomScoreValuesMasterListDataAsset*                  ScoreValuesMasterList;                             // 0x38(0x8)
	TArray<struct NonShippingScoreSwitch>                        ItemSwitchValues;                                  // 0x40(0x10)
	TArray<struct NonShippingScoreSwitch>                        EventSwitchValues;                                 // 0x50(0x10)
	struct FString                                               JSonObjectString;                                  // 0x60(0x10)
};


// Size 0xf0 (Full Size[0x118] - InheritedSize[0x28]
class BuoyantObjectSpawnProfileDataAsset: public DataAsset
{
public:
	struct BuoyantObjectSpawnProfile                             Profile;                                           // 0x28(0xf0)
};


// Size 0x190 (Full Size[0x248] - InheritedSize[0xb8]
class SicknessComponent: public ActorComponent
{
public:
	char                                                         pad0x8_47N9X[0x8];                                 // 0xb8(0x8)
	struct WeightedProbabilityRangeOfRanges                      IncubationPeriodDuration;                          // 0xc0(0x30)
	struct WeightedProbabilityRangeOfRanges                      LatentPeriodDuration;                              // 0xf0(0x30)
	struct WeightedProbabilityRangeOfRanges                      VomitingPeriodDuration;                            // 0x120(0x30)
	struct WeightedProbabilityRangeOfRanges                      VomitBoutDuration;                                 // 0x150(0x30)
	struct WeightedProbabilityRangeOfRanges                      DelayBetweenVomitBouts;                            // 0x180(0x30)
	float                                                        ScreenEffectStrengthWhenSicknessActive;            // 0x1b0(0x4)
	float                                                        ScreenEffectStrengthWhileVomiting;                 // 0x1b4(0x4)
	float                                                        MaterialEffectStrengthWhenSicknessActive;          // 0x1b8(0x4)
	float                                                        ScreenEffectSpringAcceleration;                    // 0x1bc(0x4)
	float                                                        MaterialEffectSpringAcceleration;                  // 0x1c0(0x4)
	bool                                                         CanGetSick;                                        // 0x1c4(0x1)
	char                                                         pad0x4b_3LIFG[0x4b];                               // 0x1c5(0x4b)
	float                                                        TargetScreenEffectStrength;                        // 0x210(0x4)
	float                                                        TargetMaterialEffectStrength;                      // 0x214(0x4)
	char                                                         pad0x30_PYS4G[0x30];                               // 0x218(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DamageModifierInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class CreateAshenLordEncounterTaleStep: public TaleQuestStep
{
public:
};


// Size 0x120 (Full Size[0x148] - InheritedSize[0x28]
class MerchantMapLayout: public DataAsset
{
public:
	struct TreasureMapWidgetText                                 PickupLocation;                                    // 0x28(0x3c)
	struct TreasureMapWidgetText                                 DeliveryLocation;                                  // 0x64(0x3c)
	struct TreasureMapWidgetText                                 DeliverByTime;                                     // 0xa0(0x3c)
	struct TreasureMapWidgetText                                 PickupLocationHint;                                // 0xdc(0x3c)
	TArray<struct MerchantMapLayoutItem>                         Items;                                             // 0x118(0x10)
	TArray<struct TreasureMapWidgetTexture>                      Images;                                            // 0x128(0x10)
	TArray<struct TreasureMapWidgetLocalisedText>                GeneralText;                                       // 0x138(0x10)
};


// Size 0x30 (Full Size[0x128] - InheritedSize[0xf8]
class TaleQuestSequenceStep: public TaleQuestFramedStep
{
public:
	class TaleQuestSequenceStepDesc*                             Desc;                                              // 0xf8(0x8)
	TArray<struct ForkedStep>                                    ForkedSteps;                                       // 0x118(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class HighFlyAIStrategyId: public AIStrategyId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CutscenesBlueprintFunctionLibrary: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayerTelemetryInfoProviderInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0x3b8] - InheritedSize[0x3a0]
class TripwireMechanismTrigger: public Actor
{
public:
	class MechanismTriggerComponent*                             MechanismTriggerComponent;                         // 0x3a0(0x8)
	class BoxComponent*                                          BoxCollisionThatTriggersWireSnap;                  // 0x3a8(0x8)
	class StaticMeshComponent*                                   WireStaticMesh;                                    // 0x3b0(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class QuickCycleToFishingRodNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class CannonballStatus: public StatusBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BaseTooltipDescriptorId: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DebugShipInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayerModerationServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SwimToSurfaceAIStrategyId: public AIStrategyId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TelemetryDispatcherRetrievalInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RotationControlInterface: public Interface
{
public:
};


// Size 0x138 (Full Size[0x160] - InheritedSize[0x28]
class BalanceableWalkwayDataAsset: public DataAsset
{
public:
	struct FText                                                 UseBalanceableWalkwayTooltip;                      // 0x28(0x38)
	struct FText                                                 SlideDownWalkwayTooltip;                           // 0x60(0x38)
	struct FText                                                 InWaterTooltip;                                    // 0x98(0x38)
	struct FText                                                 AngleTooBigTooltip;                                // 0xd0(0x38)
	struct FText                                                 TooShortTooltip;                                   // 0x108(0x38)
	struct Vector                                                TooltipOffset;                                     // 0x140(0xc)
	float                                                        InteractionAreaSize;                               // 0x14c(0x4)
	float                                                        MaxTooltipDistance;                                // 0x150(0x4)
	float                                                        MaxAngleOfRopeToInteract;                          // 0x154(0x4)
	float                                                        MaxAngleOfRopeToWalk;                              // 0x158(0x4)
	char                                                         pad0x4_4YGWG[0x4];                                 // 0x15c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SPC_SharedResource_RitualSkellyFortEventSignal: public SandboxPerformanceConstraintSharedResourceType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShopOfferBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ItemLifetimeMetaDataInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WaterModifierZoneInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TrackedActorInterface: public Interface
{
public:
};


// Size 0xd8 (Full Size[0x190] - InheritedSize[0xb8]
class OfferingNPCComponent: public ActorComponent
{
public:
	char                                                         pad0x8_X1PP6[0x8];                                 // 0xb8(0x8)
	struct FName                                                 RightHandWieldSocket;                              // 0xc0(0x8)
	struct FName                                                 LeftHandWieldSocket;                               // 0xc8(0x8)
	bool                                                         ShouldOfferItemWithoutAnimation;                   // 0xd0(0x1)
	char                                                         pad0x7_00R25[0x7];                                 // 0xd1(0x7)
	class UClass*                                                ItemToShow;                                        // 0xd8(0x8)
	class Actor*                                                 ItemShown;                                         // 0xe0(0x8)
	struct FText                                                 PickupItemText;                                    // 0xe8(0x38)
	struct FText                                                 CannotPickupItemText;                              // 0x120(0x38)
	char                                                         pad0x38_U8XBU[0x38];                               // 0x158(0x38)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class BoobyTrapSpawnerDataAsset: public DataAsset
{
public:
	TArray<struct BoobyTrapSpawnerRankEntry>                     RankEntries;                                       // 0x28(0x10)
};


// Size 0x138 (Full Size[0x4d8] - InheritedSize[0x3a0]
class ScrambledNamesService: public Actor
{
public:
	char                                                         pad0x138_EI6FG[0x138];                             // 0x3a0(0x138)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ConstellationsServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ObjectMeshRetrievalInterface: public Interface
{
public:
};


// Size 0x260 (Full Size[0x600] - InheritedSize[0x3a0]
class PortableHarpoonProjectile: public Actor
{
public:
	char                                                         pad0x10_XTHI4[0x10];                               // 0x3a0(0x10)
	class WwiseEvent*                                            TrailSfxPlay;                                      // 0x3b0(0x8)
	class WwiseEvent*                                            TrailSfxStop;                                      // 0x3b8(0x8)
	class WwiseObjectPoolWrapper*                                TrailSfxPool;                                      // 0x3c0(0x8)
	class WaterSplashComponent*                                  WaterSplashComponent;                              // 0x3c8(0x8)
	class PortableHarpoon*                                       OwningPortableHarpoon;                             // 0x3d0(0x8)
	struct ReplicatedTransformState                              ReplicatedTransformState;                          // 0x3d8(0x30)
	struct NetTimeStampCalculator                                NetMovementTimeStamp;                              // 0x408(0x70)
	char                                                         pad0x20_SUDPG[0x20];                               // 0x478(0x20)
	class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x498(0x8)
	class HarpoonRenderComponent*                                TetherRenderComponent;                             // 0x4a0(0x8)
	class SceneComponent*                                        RootSceneComponent;                                // 0x4a8(0x8)
	class SceneComponent*                                        MovementBase;                                      // 0x4b0(0x8)
	char                                                         pad0x18_AM0K8[0x18];                               // 0x4b8(0x18)
	struct FName                                                 TetherAttachSocketName;                            // 0x4d0(0x8)
	struct FName                                                 ArrowTipSocketName;                                // 0x4d8(0x8)
	char                                                         pad0x8_QM9KG[0x8];                                 // 0x4e0(0x8)
	struct PortableHarpoonProjectileReplicateState               ReplicatedProjectileState;                         // 0x4e8(0x8)
	char                                                         pad0x110_ZIVQC[0x110];                             // 0x4f0(0x110)
};


// Size 0x10 (Full Size[0x310] - InheritedSize[0x300]
class ShipAudioEmitterComponent: public WwiseEmitterComponent
{
public:
	class WwiseEvent*                                            WwiseEvent;                                        // 0x300(0x8)
	bool                                                         SetRTPC_Pitch;                                     // 0x308(0x1)
	bool                                                         SetRTPC_Roll;                                      // 0x309(0x1)
	bool                                                         SetRTPC_Velocity;                                  // 0x30a(0x1)
	char                                                         pad0x5_WV788[0x5];                                 // 0x30b(0x5)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class FireSettingsDataAsset: public DataAsset
{
public:
	float                                                        CharacterOnFireEffectRadius;                       // 0x28(0x4)
	char                                                         TraceChannel;                                      // 0x2c(0x1)
	char                                                         pad0x3_Q59RP[0x3];                                 // 0x2d(0x3)
	float                                                        CharacterToCharacterPropagationInterval;           // 0x30(0x4)
	float                                                        MaxInitialPropagationOffset;                       // 0x34(0x4)
	struct Status                                                BurnStatus;                                        // 0x38(0x20)
	struct Status                                                FirePropagationStatus;                             // 0x58(0x20)
	char                                                         pad0x8_H5S8H[0x8];                                 // 0x78(0x8)
};


// Size 0x70 (Full Size[0xe8] - InheritedSize[0x78]
class VulnerabilityAIAbility: public AthenaAIAbility
{
public:
	class Pawn*                                                  Owner;                                             // 0x78(0x8)
	class VulnerabilityAIAbilityParams*                          SetupAbilityParams;                                // 0x80(0x8)
	char                                                         pad0x60_X295E[0x60];                               // 0x88(0x60)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class StatConditionTargetSelector: public Object
{
public:
	char                                                         Target;                                            // 0x28(0x1)
	char                                                         pad0x7_7POM6[0x7];                                 // 0x29(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ControllableMessagesInterface: public ObjectMessagingInterface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class ZoomInOnWieldableItemPressedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DebugSuperSailorActionStateId: public ActionStateId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PursuitAIStrategyId: public AIStrategyId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EncounterListenerInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0xd0] - InheritedSize[0xb8]
class LightningManagerComponent: public ActorComponent
{
public:
	bool                                                         QueueLightningStrikeOnStart;                       // 0xb8(0x1)
	char                                                         pad0x7_LSV4I[0x7];                                 // 0xb9(0x7)
	class LightningManagerDataAsset*                             LightningManagerDataAsset;                         // 0xc0(0x8)
	float                                                        Radius;                                            // 0xc8(0x4)
	char                                                         pad0x4_K2OPB[0x4];                                 // 0xcc(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class VoyageDescList: public DataAsset
{
public:
	TArray<Class>                                                Tales;                                             // 0x28(0x10)
};


// Size 0x108 (Full Size[0x178] - InheritedSize[0x70]
class BTService_RunLoopingCustomAnimation: public BTService
{
public:
	bool                                                         UseFixedLoopingCustomAnimationName;                // 0x70(0x1)
	char                                                         pad0x3_W6AON[0x3];                                 // 0x71(0x3)
	struct FName                                                 FixedLoopingCustomAnimationName;                   // 0x74(0x8)
	char                                                         pad0x4_MFN8S[0x4];                                 // 0x7c(0x4)
	struct BlackboardKeySelector                                 LoopingCustomAnimationNameKey;                     // 0x80(0x28)
	bool                                                         GetAnimationDurations;                             // 0xa8(0x1)
	char                                                         pad0x7_NIPKU[0x7];                                 // 0xa9(0x7)
	struct BlackboardKeySelector                                 IntoAnimationEffectTime;                           // 0xb0(0x28)
	struct BlackboardKeySelector                                 IntoAnimationDuration;                             // 0xd8(0x28)
	struct BlackboardKeySelector                                 OutOfUndockTime;                                   // 0x100(0x28)
	struct BlackboardKeySelector                                 OutOfAnimationDuration;                            // 0x128(0x28)
	struct BlackboardKeySelector                                 AlternateOutOfAnimationIndex;                      // 0x150(0x28)
};


// Size 0x8 (Full Size[0x178] - InheritedSize[0x170]
class EnvQueryTest_InReservedInvasionLocation: public EnvQueryTest
{
public:
	float                                                        BufferRadius;                                      // 0x170(0x4)
	char                                                         pad0x4_E3CEV[0x4];                                 // 0x174(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CrewServiceCostumeInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ItemSnapshotMetaGenerator: public Object
{
public:
	class ScriptStruct*                                          MetaWrapper;                                       // 0x28(0x8)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class EmergentFaunaSwitchesDataAsset: public DataAsset
{
public:
	struct EmergentFaunaSwitches                                 EmergentFaunaSwitches;                             // 0x28(0x20)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class DeactivateSpawnerVaultStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableName                                     SpawnerName;                                       // 0x80(0x30)
};


// Size 0x58 (Full Size[0x3f8] - InheritedSize[0x3a0]
class ExplosionMechanismAction: public Actor
{
public:
	class SceneComponent*                                        Base;                                              // 0x3a0(0x8)
	class MechanismActionComponent*                              MechanismActionComponent;                          // 0x3a8(0x8)
	class ExplosiveComponent*                                    ExplosiveComponent;                                // 0x3b0(0x8)
	class ExplosionComponent*                                    ExplosionComponent;                                // 0x3b8(0x8)
	float                                                        Delay;                                             // 0x3c0(0x4)
	float                                                        Cooldown;                                          // 0x3c4(0x4)
	bool                                                         ApplyCooldownPostDelay;                            // 0x3c8(0x1)
	char                                                         pad0x2f_GU6JA[0x2f];                               // 0x3c9(0x2f)
};


// Size 0x40 (Full Size[0xf8] - InheritedSize[0xb8]
class OpenableItemComponent: public ActorComponent
{
public:
	char                                                         pad0x28_P0SN8[0x28];                               // 0xb8(0x28)
	char                                                         OpenState;                                         // 0xe0(0x1)
	bool                                                         HasEverClosed;                                     // 0xe1(0x1)
	char                                                         pad0x16_LEP5Q[0x16];                               // 0xe2(0x16)
};


// Size 0x10 (Full Size[0x2e0] - InheritedSize[0x2d0]
class SpawnActorComponent: public SceneComponent
{
public:
	class UClass*                                                ChildActorClass;                                   // 0x2d0(0x8)
	class Actor*                                                 ChildActor;                                        // 0x2d8(0x8)
};


// Size 0x18 (Full Size[0x3b8] - InheritedSize[0x3a0]
class ProjectileHitRegService: public Actor
{
public:
	char                                                         pad0x8_74HR2[0x8];                                 // 0x3a0(0x8)
	struct HitRegToggleStruct                                    HitRegToggles;                                     // 0x3a8(0x10)
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class KnockbackAIAbilityTriggerComponent: public ActorComponent
{
public:
	char                                                         pad0x8_0WFN9[0x8];                                 // 0xb8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GuildInviteeInterface: public Interface
{
public:
};


// Size 0xa0 (Full Size[0x158] - InheritedSize[0xb8]
class ItemProxyShipTrackerComponent: public ActorComponent
{
public:
	char                                                         pad0x10_TJCWO[0x10];                               // 0xb8(0x10)
	class ItemProxyShipTrackerComponentDataAsset*                ShipTrackingData;                                  // 0xc8(0x8)
	class Actor*                                                 CurrentShip;                                       // 0xd0(0x8)
	char                                                         pad0x80_RJD0V[0x80];                               // 0xd8(0x80)
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class EquipClothingComponent: public ActorComponent
{
public:
	char                                                         pad0x8_F5X39[0x8];                                 // 0xb8(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PlayerActivityIconDictionaryDataAsset: public DataAsset
{
public:
	TArray<struct PlayerActivityIconInfo>                        PlayerActivityIcons;                               // 0x28(0x10)
};


// Size 0x150 (Full Size[0x4f0] - InheritedSize[0x3a0]
class FortPlinthActor: public Actor
{
public:
	char                                                         pad0x8_TV2ID[0x8];                                 // 0x3a0(0x8)
	class LockComponent*                                         LockComponent;                                     // 0x3a8(0x8)
	class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x3b0(0x8)
	class PlinthInteractableComponent*                           InteractableComponent;                             // 0x3b8(0x8)
	class SceneComponent*                                        SceneComponent;                                    // 0x3c0(0x8)
	struct StringAssetReference                                  OptionalVoyageAsset;                               // 0x3c8(0x10)
	float                                                        CooldownTime;                                      // 0x3d8(0x4)
	char                                                         pad0x34_0SLHX[0x34];                               // 0x3dc(0x34)
	class VoyageDescDataAsset*                                   OptionalVoyageDesc;                                // 0x410(0x8)
	char                                                         pad0xd8_99K0P[0xd8];                               // 0x418(0xd8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MoveToLocationActionStateId: public ActionStateId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShipTelemetryDescriptorInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ItemDropRedirectorInterface: public Interface
{
public:
};


// Size 0xc8 (Full Size[0x180] - InheritedSize[0xb8]
class WieldableItemCanvasRenderingComponent: public ActorComponent
{
public:
	char                                                         pad0x10_K078J[0x10];                               // 0xb8(0x10)
	int                                                          CanvasWidth;                                       // 0xc8(0x4)
	int                                                          CanvasHeight;                                      // 0xcc(0x4)
	struct FName                                                 PrimaryMaterialTextureParameterName;               // 0xd0(0x8)
	class MaybeCompressedCanvasRenderTarget2D*                   PrimaryRenderTarget;                               // 0xe8(0x8)
	TArray<class MaybeCompressedCanvasRenderTarget2D*>           AdditionalRenderTargets;                           // 0xf0(0x10)
	char                                                         pad0x80_5G0Y8[0x80];                               // 0x100(0x80)
};


// Size 0x28 (Full Size[0x3c8] - InheritedSize[0x3a0]
class LauncherParentMock: public Actor
{
public:
	char                                                         pad0x18_C4HA7[0x18];                               // 0x3a0(0x18)
	TArray<class Actor*>                                         IgnoreActors;                                      // 0x3b8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShipsLogServiceInterface: public Interface
{
public:
};


// Size 0x90 (Full Size[0x148] - InheritedSize[0xb8]
class ChainLightningReceiverComponent: public ActorComponent
{
public:
	char                                                         pad0x8_QFN61[0x8];                                 // 0xb8(0x8)
	float                                                        ShockDuration;                                     // 0xc0(0x4)
	char                                                         pad0x84_D1E8K[0x84];                               // 0xc4(0x84)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class RemoveFogBankAvoidanceAreaStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableVector                                   Location;                                          // 0x80(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class HandOverableInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class StatusResponseMermaidSuppression: public StatusResponse
{
public:
	float                                                        SuppressionDuration;                               // 0x38(0x4)
	char                                                         pad0x4_1R160[0x4];                                 // 0x3c(0x4)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class TornMapSettings: public DeveloperSettings
{
public:
	class UClass*                                                TornMapItemDescClass;                              // 0x38(0x8)
	struct StringAssetReference                                  DefaultParams;                                     // 0x40(0x10)
	char                                                         DefaultMapBlendMode;                               // 0x50(0x1)
	char                                                         pad0x3_XKDKU[0x3];                                 // 0x51(0x3)
	float                                                        DefaultMarkScale;                                  // 0x54(0x4)
	char                                                         DefaultMarkBlendMode;                              // 0x58(0x1)
	char                                                         pad0x7_4NDE6[0x7];                                 // 0x59(0x7)
};


// Size 0x10 (Full Size[0x3d0] - InheritedSize[0x3c0]
class ReapersTributeShipMusicZoneComponent: public MusicZoneComponent
{
public:
	char                                                         pad0x10_FW67K[0x10];                               // 0x3c0(0x10)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class BloatingStatus: public StatusBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SPC_SharedResource_AggressiveGhostShip_SeaDamsel: public SandboxPerformanceConstraintSharedResourceType
{
public:
};


// Size 0x8 (Full Size[0x48] - InheritedSize[0x40]
class FireBreathAbilityStageParams: public AthenaAIAbilityStageParams
{
public:
	float                                                        FireBreathDurationMultiplier;                      // 0x40(0x4)
	char                                                         pad0x4_ZL5HG[0x4];                                 // 0x44(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SeaFortAddOnDataAsset: public DataAsset
{
public:
	TArray<struct SpawnTransformToPositionMapping>               PrisonerSpawnTransformToPositionMappings;          // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RemoteConfigurationProviderBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x38 (Full Size[0xf0] - InheritedSize[0xb8]
class RewindDataVisualisationComponent: public ActorComponent
{
public:
	char                                                         pad0x8_RO9AC[0x8];                                 // 0xb8(0x8)
	struct RewindPhysicsServiceEntry                             RewindEntry;                                       // 0xc0(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ControllablePulleyInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RadialMiniIconInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SenseSearchingAIStrategyId: public AIStrategyId
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PhrasesRadialDataAsset: public DataAsset
{
public:
	TArray<struct PhraseData>                                    Phrases;                                           // 0x28(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AthenaAICrewStrengthDynamicParamsDataAsset: public DataAsset
{
public:
	TArray<struct AIControllerDynamicBalancingPlayerShipValueDesc> PlayerShipSizeValues;                              // 0x28(0x10)
	int                                                          PlayerValue;                                       // 0x38(0x4)
	float                                                        Radius;                                            // 0x3c(0x4)
	TArray<struct AIControllerDynamicBalancingNamedParamMapping> PlayerCrewStrengthNamedParamMapping;               // 0x40(0x10)
};


// Size 0x30 (Full Size[0x78] - InheritedSize[0x48]
class AIShipRegionPlayerTracker: public AISpawnerPlayerTracker
{
public:
	char                                                         pad0x30_0DDGY[0x30];                               // 0x48(0x30)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class HotFootStatus: public StatusBase
{
public:
};


// Size 0x10 (Full Size[0x70] - InheritedSize[0x60]
class ContestTaleQuestService: public TaleQuestService
{
public:
	TArray<struct NPCPurchaseList>                               NPCPurchaseLists;                                  // 0x60(0x10)
};


// Size 0x60 (Full Size[0x330] - InheritedSize[0x2d0]
class MountpointComponent: public SceneComponent
{
public:
	char                                                         pad0x8_5S4RJ[0x8];                                 // 0x2d0(0x8)
	TArray<class Class*>                                         AcceptedMountableTypes;                            // 0x2d8(0x10)
	struct Rotator                                               DetachForwardDirectionRotator;                     // 0x2e8(0xc)
	float                                                        DetachOffset;                                      // 0x2f4(0x4)
	bool                                                         UseOverrideMountedCollisionProfile;                // 0x2f8(0x1)
	char                                                         pad0x17_28F26[0x17];                               // 0x2f9(0x17)
	class Object*                                                ReplicatedMountedItem;                             // 0x310(0x8)
	char                                                         pad0x10_CV589[0x10];                               // 0x318(0x10)
	bool                                                         IsMountingDisabled;                                // 0x328(0x1)
	char                                                         pad0x7_9YS79[0x7];                                 // 0x329(0x7)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class GetIsShipInOpenWaterStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        BufferRadiusInMetres;                              // 0x80(0x4)
	char                                                         pad0x4_4SRSD[0x4];                                 // 0x84(0x4)
	struct QuestVariableBool                                     Result;                                            // 0x88(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetAnimationInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class PlayerBuriedItemServiceMapStorePopulator: public Object
{
public:
	class PlayerBuriedItemServiceMapStorePopulatorDataAsset*     DataAsset;                                         // 0x28(0x8)
};


// Size 0x0 (Full Size[0x3a0] - InheritedSize[0x3a0]
class ReapersTributeShipSequenceCutsceneSpawnLocation: public Actor
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PlayerBuriedItemServiceHaulSizeDataAsset: public DataAsset
{
public:
	TArray<struct PlayerBuriedItemServiceHaulSizeEntry>          HaulSizes;                                         // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LayerInContainerInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0x300] - InheritedSize[0x2d0]
class LightingZoneComponent: public SceneComponent
{
public:
	char                                                         pad0x8_YL076[0x8];                                 // 0x2d0(0x8)
	struct LightingZoneParameters                                LightingZoneParameters;                            // 0x2d8(0x20)
	char                                                         pad0x8_8ANLU[0x8];                                 // 0x2f8(0x8)
};


// Size 0x100 (Full Size[0x180] - InheritedSize[0x80]
class TelemetryProgressStepDesc: public TaleQuestStepDesc
{
public:
	struct FString                                               Progression;                                       // 0x80(0x10)
	struct TelemetryStepContext                                  TelemetryContext;                                  // 0x90(0xf0)
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class NPCOnSurfaceTaleQuestFunctionStepLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ForceFeedbackCondition_IsOwnerLocalPlayer: public ForceFeedbackCondition
{
public:
};


// Size 0xd8 (Full Size[0x100] - InheritedSize[0x28]
class EmoteInfo: public DataAsset
{
public:
	struct EmoteData                                             EmoteData;                                         // 0x28(0xc8)
	struct StringAssetReference                                  RadialIconPath;                                    // 0xf0(0x10)
};


// Size 0x158 (Full Size[0x180] - InheritedSize[0x28]
class DeliverableRedirectionActionDataAsset: public DataAsset
{
public:
	TArray<class DeliverableRedirectionContextHandlerBase*>      Handlers;                                          // 0x28(0x10)
	TArray<class Class*>                                         OutpostBasedCompanies;                             // 0x38(0x10)
	struct FText                                                 RedirectionTooltip;                                // 0x48(0x38)
	struct FText                                                 VisitSingleFemaleNPCTooltip;                       // 0x80(0x38)
	struct FText                                                 VisitSingleMaleNPCTooltip;                         // 0xb8(0x38)
	struct FText                                                 VisitSingleCompanyNPCTooltip;                      // 0xf0(0x38)
	TArray<struct SingleNPCCompanyRedirectionData>               VisitSingleCompanyNPCTooltipOverride;              // 0x128(0x10)
	TArray<struct MultipleNPCCompaniesRedirectionData>           VisitMultipleNPCCompaniesTooltip;                  // 0x138(0x10)
	struct FText                                                 GoToOutpostTooltip;                                // 0x148(0x38)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class NPCDialogConditionalText: public Object
{
public:
	struct FText                                                 Text;                                              // 0x28(0x38)
	class NPCDialogExpression*                                   Expression;                                        // 0x60(0x8)
};


// Size 0x70 (Full Size[0x410] - InheritedSize[0x3a0]
class PressurePlateMechanismTriggerBase: public Actor
{
public:
	char                                                         pad0x8_A0IMJ[0x8];                                 // 0x3a0(0x8)
	class MechanismTriggerComponent*                             MechanismTriggerComponent;                         // 0x3a8(0x8)
	class ParticleSystem*                                        SteppedOnVFX;                                      // 0x3b0(0x8)
	float                                                        SteppedOnVFXStartTime;                             // 0x3b8(0x4)
	struct Vector                                                SteppedOnVFXLocation;                              // 0x3bc(0xc)
	struct Rotator                                               SteppedOnVFXRotation;                              // 0x3c8(0xc)
	char                                                         pad0x4_K9Q8T[0x4];                                 // 0x3d4(0x4)
	class SceneComponent*                                        Root;                                              // 0x3d8(0x8)
	class MechanismInteractionComponent*                         MechanismInteractionComponent;                     // 0x3e0(0x8)
	class BoxComponent*                                          TriggerBox;                                        // 0x3e8(0x8)
	char                                                         pad0x8_BA7EJ[0x8];                                 // 0x3f0(0x8)
	TArray<struct PressurePlateAnimationComponent>               AnimationComponents;                               // 0x3f8(0x10)
	char                                                         pad0x8_JVKEE[0x8];                                 // 0x408(0x8)
};


// Size 0x568 (Full Size[0x620] - InheritedSize[0xb8]
class ShopViewModelComponent: public ActorComponent
{
public:
	char                                                         pad0x10_X8JXY[0x10];                               // 0xb8(0x10)
	TArray<struct MaxNumVoyagesOverride>                         MaxVoyagesOwnedOverride;                           // 0xc8(0x10)
	TArray<class Class*>                                         IgnoredCompaniesForMaxVoyagesOwned;                // 0xd8(0x10)
	int                                                          StockRefreshTime;                                  // 0xe8(0x4)
	char                                                         pad0x4_KKJ4C[0x4];                                 // 0xec(0x4)
	TArray<class Class*>                                         PrioritisedVoyages;                                // 0xf0(0x10)
	struct FText                                                 EmissaryLockedCommodityOfferDescription;           // 0x100(0x38)
	struct FText                                                 OutOfStockLockedCommodityOfferDescription;         // 0x138(0x38)
	struct FText                                                 ShipCapacityLockedCommodityOfferDescription;       // 0x170(0x38)
	struct FText                                                 UnavailableDuringSaferSeasDescription;             // 0x1a8(0x38)
	struct FText                                                 AvailableAtLevelX;                                 // 0x1e0(0x38)
	struct FText                                                 AvailableToClaimInHighSeas;                        // 0x218(0x38)
	struct FText                                                 AvailableInHighSeas;                               // 0x250(0x38)
	TArray<struct CompanyCatalog>                                AllNPCCompanies;                                   // 0x288(0x10)
	char                                                         pad0x388_98JWZ[0x388];                             // 0x298(0x388)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SpawnCommandsAISkillsetList: public DataAsset
{
public:
	TArray<struct SpawnCommandsAISkillset>                       SkillsetList;                                      // 0x28(0x10)
};


// Size 0x118 (Full Size[0x4b8] - InheritedSize[0x3a0]
class DeepSeaRegionService: public Actor
{
public:
	char                                                         pad0x118_CUFXK[0x118];                             // 0x3a0(0x118)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class BattleElevatorEventRoomPhasesDataAsset: public DataAsset
{
public:
	TArray<struct BattleElevatorEventRoomPhase>                  Phases;                                            // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class IslandLocationVerifierInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x48] - InheritedSize[0x40]
class VulnerabilityAbilityStageParams: public AthenaAIAbilityStageParams
{
public:
	float                                                        VulnerabilityDurationMultiplier;                   // 0x40(0x4)
	float                                                        MaxVulnerabilityPeriodHealthMultiplier;            // 0x44(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SpawnCommandsAIEncounterTypeList: public DataAsset
{
public:
	TArray<class AIEncounterSettings*>                           SpawnableEncounterSettings;                        // 0x28(0x10)
};


// Size 0x50 (Full Size[0x108] - InheritedSize[0xb8]
class ContestMerchantSpawnerComponent: public ActorComponent
{
public:
	char                                                         pad0x30_ORM5H[0x30];                               // 0xb8(0x30)
	TArray<class CompanyShopkeeper*>                             SpawnedMerchantsArray;                             // 0xe8(0x10)
	TArray<struct MerchantSpawnData>                             MerchantSpawnDataArray;                            // 0xf8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ProjectileWeaponFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x78 (Full Size[0x130] - InheritedSize[0xb8]
class MaterialManipulationSettingsComponent: public ActorComponent
{
public:
	char                                                         pad0x8_MFDTD[0x8];                                 // 0xb8(0x8)
	struct MaterialManipulationSettings                          Settings;                                          // 0xc0(0x30)
	class MaterialInstance*                                      OverrideMaterial;                                  // 0xf0(0x8)
	char                                                         pad0x8_OTRLB[0x8];                                 // 0xf8(0x8)
	struct Transform                                             PosedTransform;                                    // 0x100(0x30)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class TrinketSettings: public DeveloperSettings
{
public:
	struct StringAssetReference                                  TrinketMapDataAsset;                               // 0x38(0x10)
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class BTTask_SetDartAmmoType: public BTTaskNode
{
public:
	char                                                         DartAmmoType;                                      // 0x60(0x1)
	char                                                         pad0x7_STI4J[0x7];                                 // 0x61(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OptInDamageableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0xb8] - InheritedSize[0xb8]
class RelinquishIslandSalvageSpawnLocationOnDestructionComponent: public ActorComponent
{
public:
};


// Size 0x8 (Full Size[0x108] - InheritedSize[0x100]
class RetractableCharacterComponent: public RetractableComponent
{
public:
	bool                                                         RetainOriginalOrientationOnRetraction;             // 0x100(0x1)
	bool                                                         RedirectRetractionToHeldItem;                      // 0x101(0x1)
	char                                                         pad0x6_X99OD[0x6];                                 // 0x102(0x6)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class VfxSelectorDataAsset: public DataAsset
{
public:
	struct VfxSelectorEntry                                      MinDefaultEffectParams;                            // 0x28(0x28)
	TArray<struct VfxSelectorRange>                              Ranges;                                            // 0x50(0x10)
	struct VfxSelectorEntry                                      MaxDefaultEffectParams;                            // 0x60(0x28)
};


// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class WorldSequenceService: public Object
{
public:
	char                                                         pad0x78_6UK75[0x78];                               // 0x28(0x78)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class IslandEventHUDData: public DataAsset
{
public:
	TArray<class Class*>                                         EventTypes;                                        // 0x28(0x10)
	struct Vector2D                                              IslandIconSize;                                    // 0x38(0x8)
	struct Vector2D                                              HeaderIconSize;                                    // 0x40(0x8)
	float                                                        HeaderYOffset;                                     // 0x48(0x4)
	float                                                        TriggerLerpAtZoomLevel;                            // 0x4c(0x4)
	struct CanvasLerpData                                        LerpData;                                          // 0x50(0x10)
	struct CanvasLerpData                                        HighlightLerpData;                                 // 0x60(0x10)
	struct CanvasLerpData                                        FadeInOutData;                                     // 0x70(0x10)
	float                                                        MarkerHighlightRadiusAdjuster;                     // 0x80(0x4)
	struct Vector2D                                              MarkerHighlightCentreOffset;                       // 0x84(0x8)
	float                                                        MarkerHighlightScale;                              // 0x8c(0x4)
};


// Size 0x80 (Full Size[0x138] - InheritedSize[0xb8]
class ShipCreatureManagerComponent: public ActorComponent
{
public:
	TArray<struct ActorComponentSelector>                        CreatureMeshComponents;                            // 0xb8(0x10)
	TArray<struct ShipCreatureManagerCreatureInstance>           CreatureInstances;                                 // 0xc8(0x10)
	class SceneComponent*                                        CreatureMeshAttachParent;                          // 0xd8(0x8)
	char                                                         pad0x58_XLA4W[0x58];                               // 0xe0(0x58)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CrewMemberInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class RevealableServiceSettingsDataAsset: public DataAsset
{
public:
	class RevealableSceneMappingsDataAsset*                      SceneTypeMappingsDataAsset;                        // 0x28(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RammableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OnboardingFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LaunchableProjectileInterface: public Interface
{
public:
};


// Size 0xd8 (Full Size[0x478] - InheritedSize[0x3a0]
class IgnitableMechanismTrigger: public Actor
{
public:
	char                                                         pad0x8_1H9TU[0x8];                                 // 0x3a0(0x8)
	class SceneComponent*                                        Root;                                              // 0x3a8(0x8)
	class TimedFlammableComponent*                               FlammableComponent;                                // 0x3b0(0x8)
	class LightWeightStatusEffectManagerComponent*               StatusEffectManagerComponent;                      // 0x3b8(0x8)
	class MechanismTriggerComponent*                             MechanismTriggerComponent;                         // 0x3c0(0x8)
	char                                                         pad0xb0_VVDIG[0xb0];                               // 0x3c8(0xb0)
};


// Size 0xd8 (Full Size[0x190] - InheritedSize[0xb8]
class InvasionBattleBoundsComponent: public ActorComponent
{
public:
	char                                                         pad0x48_1AWH9[0x48];                               // 0xb8(0x48)
	class PostProcessComponent*                                  BattleBoundsPostProcessComponent;                  // 0x100(0x8)
	class Actor*                                                 HourglassOfFate;                                   // 0x108(0x8)
	class MaterialManipulationComponent*                         HourglassOfFateMaterialManipulationComponent;      // 0x110(0x8)
	class ParticleSystemComponent*                               HourglassOfFateParticleSystemComponent;            // 0x118(0x8)
	float                                                        MaxEffectsT;                                       // 0x120(0x4)
	char                                                         pad0x4_783RZ[0x4];                                 // 0x124(0x4)
	class Object*                                                ExplosionParticleSystem;                           // 0x128(0x8)
	class Object*                                                HourglassOfFateParticleSystemReaper;               // 0x130(0x8)
	class Object*                                                HourglassOfFateParticleSystemAthena;               // 0x138(0x8)
	float                                                        HourglassOfFateParticleSystemStartT;               // 0x140(0x4)
	struct Vector                                                HourglassOfFateParticleSystemOffset;               // 0x144(0xc)
	class UClass*                                                AthenaFaction;                                     // 0x150(0x8)
	class WwiseObjectPoolWrapper*                                HourglassEmitterPool;                              // 0x158(0x8)
	class WwiseEvent*                                            InitialBoundaryTellSfx;                            // 0x160(0x8)
	class WwiseEvent*                                            FinalBoundaryExplosionSfx;                         // 0x168(0x8)
	class WwiseEvent*                                            BoundaryBuildUpLoopStart;                          // 0x170(0x8)
	class WwiseEvent*                                            BoundaryBuildUpLoopEnd;                            // 0x178(0x8)
	char                                                         pad0x10_1D1LS[0x10];                               // 0x180(0x10)
};


// Size 0x80 (Full Size[0x680] - InheritedSize[0x600]
class InstrumentKeyComponent: public StaticMeshComponent
{
public:
	char                                                         pad0x8_PC3WT[0x8];                                 // 0x600(0x8)
	int                                                          KeyID;                                             // 0x608(0x4)
	int                                                          OctaveID;                                          // 0x60c(0x4)
	bool                                                         SelectedByDefault;                                 // 0x610(0x1)
	char                                                         pad0x3_5K8TK[0x3];                                 // 0x611(0x3)
	struct NavigationOptions                                     NavigationOptions;                                 // 0x614(0x10)
	char                                                         pad0x4_SBY4D[0x4];                                 // 0x624(0x4)
	class WwiseEvent*                                            KeyPressSFX;                                       // 0x628(0x8)
	class WwiseEvent*                                            KeyReleaseSFX;                                     // 0x630(0x8)
	float                                                        HighlightValue;                                    // 0x638(0x4)
	float                                                        PressedValue;                                      // 0x63c(0x4)
	struct FName                                                 DepressionParamName;                               // 0x640(0x8)
	class MaterialInstanceDynamic*                               DynamicMaterialInstance;                           // 0x648(0x8)
	char                                                         pad0x30_28ES8[0x30];                               // 0x650(0x30)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class DeliverableCollectorsChestRequirement: public DeliverableRequirementBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RadialContextBase: public Object
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class UnlockLockConditionalStatTrigger: public Object
{
public:
	struct PlayerStat                                            Stat;                                              // 0x28(0x4)
	char                                                         pad0x4_6YCLV[0x4];                                 // 0x2c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BuriedItemInterface: public Interface
{
public:
};


// Size 0x68 (Full Size[0x1a0] - InheritedSize[0x138]
class AshenLordAIFormComponent: public AthenaAIFormComponent
{
public:
	class WwiseEvent*                                            AshenLordVulnerabilityDamageAudioEvent;            // 0x138(0x8)
	struct FName                                                 AshenLordHeartBeatShaderParamName;                 // 0x140(0x8)
	class UClass*                                                CameraShake;                                       // 0x168(0x8)
	float                                                        ShakeInnerRadius;                                  // 0x170(0x4)
	float                                                        ShakeOuterRadius;                                  // 0x174(0x4)
	class MaterialInstanceDynamic*                               AshenLordDynamicMaterialInstance;                  // 0x178(0x8)
	float                                                        CachedNormalisedHealthScalar;                      // 0x180(0x4)
	bool                                                         IsInVulnerability;                                 // 0x184(0x1)
	char                                                         pad0x1b_D8ZP4[0x1b];                               // 0x185(0x1b)
};


// Size 0x5e8 (Full Size[0x988] - InheritedSize[0x3a0]
class CrewShipManifest: public Actor
{
public:
	char                                                         pad0x28_AAL9R[0x28];                               // 0x3a0(0x28)
	class NPCIdAsset*                                            NPCIdList;                                         // 0x3c8(0x8)
	char                                                         pad0x2d0_YKPT9[0x2d0];                             // 0x3d0(0x2d0)
	class UClass*                                                AssociatedShipSize;                                // 0x6a0(0x8)
	char                                                         pad0x10_6KLKM[0x10];                               // 0x6a8(0x10)
	TArray<class Interface*>                                     VoyageVoteUpdaters;                                // 0x6b8(0x10)
	TArray<class Interface*>                                     VoyageCancellers;                                  // 0x6c8(0x10)
	char                                                         pad0x10_JQMGI[0x10];                               // 0x6d8(0x10)
	TArray<class Interface*>                                     TaleVoteUpdaters;                                  // 0x6e8(0x10)
	TArray<class Interface*>                                     TaleCancellers;                                    // 0x6f8(0x10)
	class ShipCustomizationLoadoutComponent*                     ShipCustomizationLoadoutComponent;                 // 0x708(0x8)
	class TrinketLoadoutComponent*                               TrinketLoadoutComponent;                           // 0x710(0x8)
	class ShipEntitlementComponent*                              ShipEntitlementComponent;                          // 0x718(0x8)
	char                                                         pad0xa8_WOUCL[0xa8];                               // 0x720(0xa8)
	bool                                                         EmissaryMaxRankQuestBeenRedeemed;                  // 0x7c8(0x1)
	bool                                                         IsShipAssociated;                                  // 0x7c9(0x1)
	bool                                                         IsPendingExCaptainedShipDissociation;              // 0x7ca(0x1)
	bool                                                         ShouldForceSpawnOnShip;                            // 0x7cb(0x1)
	char                                                         pad0x2c_12HCE[0x2c];                               // 0x7cc(0x2c)
	TArray<struct CommodityTrackingModel>                        CommodityPurchases;                                // 0x7f8(0x10)
	TArray<struct CommodityRedemptionTrackingModel>              CommodityRedemptions;                              // 0x808(0x10)
	struct VoteSessionData                                       VoyageSelectionVoteData;                           // 0x818(0x28)
	struct VoteSessionData                                       VoyageCancelVoteData;                              // 0x840(0x28)
	struct VoteSessionData                                       TaleSelectionVoteData;                             // 0x868(0x28)
	struct VoteSessionData                                       TaleCancelVoteData;                                // 0x890(0x28)
	struct Guid                                                  AssociatedCrew;                                    // 0x8b8(0x10)
	TArray<struct ProposedVoyageEntry>                           ProposedVoyages;                                   // 0x8c8(0x10)
	struct ProposedVoyageEntry                                   CurrentActiveVoyage;                               // 0x8d8(0x50)
	TArray<struct BeckonTag>                                     CrewBeckonTags;                                    // 0x928(0x10)
	TArray<struct ProposedTaleEntry>                             ProposedTales;                                     // 0x938(0x10)
	class VoyageDescDataAsset*                                   CurrentActiveTale;                                 // 0x948(0x8)
	int                                                          ReapersVoyageCount;                                // 0x950(0x4)
	char                                                         pad0x4_SVRHS[0x4];                                 // 0x954(0x4)
	class ShipPersistenceComponent*                              ShipPersistenceComponent;                          // 0x958(0x8)
	class Company*                                               CurrentActiveEmissaryCompany;                      // 0x960(0x8)
	struct Guid                                                  CurrentActiveEmissarySessionId;                    // 0x968(0x10)
	int                                                          CurrentEmissaryTotal;                              // 0x980(0x4)
	bool                                                         IsCaptained;                                       // 0x984(0x1)
	char                                                         pad0x3_GYHHR[0x3];                                 // 0x985(0x3)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class DelayStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        Delay;                                             // 0x80(0x4)
	char                                                         pad0x4_1D0D6[0x4];                                 // 0x84(0x4)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class GetIsShipInOpenWaterStep: public TaleQuestStep
{
public:
	char                                                         pad0x8_LM7RJ[0x8];                                 // 0x98(0x8)
};


// Size 0x220 (Full Size[0x5c0] - InheritedSize[0x3a0]
class SummonMegalodonRitualTable: public Actor
{
public:
	char                                                         pad0x8_DEK1H[0x8];                                 // 0x3a0(0x8)
	struct FName                                                 MeshName;                                          // 0x3a8(0x8)
	struct FName                                                 MusicGlowParameterName;                            // 0x3b0(0x8)
	float                                                        RitualFailRate;                                    // 0x3b8(0x4)
	float                                                        RitualTime;                                        // 0x3bc(0x4)
	float                                                        PlateVFXTime;                                      // 0x3c0(0x4)
	char                                                         pad0x4_RGQ99[0x4];                                 // 0x3c4(0x4)
	TArray<struct PlateData>                                     PlateData;                                         // 0x3c8(0x10)
	float                                                        RitualDisabledScalar;                              // 0x3d8(0x4)
	float                                                        RitualCompleteScalar;                              // 0x3dc(0x4)
	class WwiseEvent*                                            PlayRitualAudioEvent;                              // 0x3e0(0x8)
	class WwiseEvent*                                            StopRitualAudioEvent;                              // 0x3e8(0x8)
	class WwiseEvent*                                            PlayPrimedAudioLoopEvent;                          // 0x3f0(0x8)
	class WwiseEvent*                                            StopPrimedAudioLoopEvent;                          // 0x3f8(0x8)
	class WwiseEvent*                                            PlayRitualCompleteAudioEvent;                      // 0x400(0x8)
	class WwiseObjectPoolWrapper*                                RitualTableAudioPool;                              // 0x408(0x8)
	struct PlayerStat                                            StatToFireOnShantyPuzzleComplete;                  // 0x410(0x4)
	char                                                         pad0x24_DMM7W[0x24];                               // 0x414(0x24)
	TArray<class ParticleSystemComponent*>                       RitualParticleSystems;                             // 0x438(0x10)
	TArray<class ParticleSystemComponent*>                       CompleteParticleSystems;                           // 0x448(0x10)
	class MaterialInstanceDynamic*                               WispsMaterialInstanceDynamic;                      // 0x458(0x8)
	class MaterialInstanceDynamic*                               TableMaterialInstanceDynamic;                      // 0x460(0x8)
	TArray<char>                                                 ActiveTypes;                                       // 0x468(0x10)
	TArray<struct Guid>                                          ParticipatingCrews;                                // 0x478(0x10)
	char                                                         RitualState;                                       // 0x488(0x1)
	char                                                         pad0x137_HBSEZ[0x137];                             // 0x489(0x137)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OnboardCharacterTrackerInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class GhostCharacterAudioComponentParams: public DataAsset
{
public:
	struct FName                                                 PlayerStateName;                                   // 0x28(0x8)
	struct FName                                                 PlayerStateGhostShip;                              // 0x30(0x8)
	struct FName                                                 PlayerStateDefault;                                // 0x38(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class DockableKeyedInstrumentMoveXInputId: public AnalogInputId
{
public:
};


// Size 0x8 (Full Size[0xc8] - InheritedSize[0xc0]
class WaterBarrelAdaptiveTriggerComponent: public AdaptiveTriggerComponent
{
public:
	struct AdaptiveTriggerEffectMode_Feedback                    RightTrigger_PullHandle;                           // 0xc0(0x3)
	char                                                         pad0x5_RM806[0x5];                                 // 0xc3(0x5)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class BlowpipeDartCollectionDataAsset: public DataAsset
{
public:
	TArray<class BlowpipeDartDataAsset*>                         Darts;                                             // 0x28(0x10)
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class ScreenSpaceVFXComponentParams: public DataAsset
{
public:
	float                                                        EffectStrengthSpringAcceleration;                  // 0x28(0x4)
	char                                                         pad0x4_ZNGB4[0x4];                                 // 0x2c(0x4)
	class CurveFloat*                                            EffectStrengthOverTimeCurve;                       // 0x30(0x8)
	float                                                        ContinuousDamageStrengthSpringAcceleration;        // 0x38(0x4)
	char                                                         pad0x4_4B739[0x4];                                 // 0x3c(0x4)
	class CurveFloat*                                            ContinuousDamageTimeCurve;                         // 0x40(0x8)
	float                                                        ContinuousDamageMaxDamageValue;                    // 0x48(0x4)
	float                                                        ContinuousDamageMaxDamageStrength;                 // 0x4c(0x4)
	float                                                        ContinuousDamageCycleTime;                         // 0x50(0x4)
	struct FName                                                 VFXNameDamage;                                     // 0x54(0x8)
	char                                                         pad0x4_QAPOI[0x4];                                 // 0x5c(0x4)
	struct FString                                               DirectionalDamageIndicatorParameterName;           // 0x60(0x10)
	float                                                        DirectionalDamageIndicatorLifetime;                // 0x70(0x4)
	char                                                         pad0x4_08SU7[0x4];                                 // 0x74(0x4)
	class CurveFloat*                                            DrowningEffectStrengthOverTimeCurve;               // 0x78(0x8)
	struct FName                                                 VFXNameDrowning;                                   // 0x80(0x8)
	struct FName                                                 VFXNameStunned;                                    // 0x88(0x8)
	struct FName                                                 VFXNameBoundsDarkness;                             // 0x90(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NetworkedEventsWhitelistInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OwnedByShipBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x138 (Full Size[0x1f0] - InheritedSize[0xb8]
class CutsceneComponent: public ActorComponent
{
public:
	char                                                         pad0x10_0VVT7[0x10];                               // 0xb8(0x10)
	TArray<struct Text>                                          LocalisedNames;                                    // 0xc8(0x10)
	class CutsceneDataAsset*                                     CutsceneAsset;                                     // 0xd8(0x8)
	class Actor*                                                 CutSceneActor;                                     // 0xe0(0x8)
	class UClass*                                                CutsceneActorType;                                 // 0xe8(0x8)
	float                                                        MaxPlayRange;                                      // 0x100(0x4)
	float                                                        DelayBeforeDequeueAttempt;                         // 0x104(0x4)
	char                                                         pad0xe8_XMXLE[0xe8];                               // 0x108(0xe8)
};


// Size 0xb8 (Full Size[0x458] - InheritedSize[0x3a0]
class PledgeToReapersVoteInteractionActor: public Actor
{
public:
	char                                                         pad0x8_A0735[0x8];                                 // 0x3a0(0x8)
	class BoxedRpcDispatcherComponent*                           BoxedRpcDispatcherComponent;                       // 0x3a8(0x8)
	class PledgeToReapersVoteAudioComponent*                     PledgeToReapersVoteAudioComponent;                 // 0x3b0(0x8)
	char                                                         pad0xa0_4HHWN[0xa0];                               // 0x3b8(0xa0)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StarPointInterface: public Interface
{
public:
};


// Size 0x48 (Full Size[0x100] - InheritedSize[0xb8]
class CutsceneTimestampComponent: public ActorComponent
{
public:
	char                                                         pad0x48_GT3I4[0x48];                               // 0xb8(0x48)
};


// Size 0x80 (Full Size[0xa8] - InheritedSize[0x28]
class ContentEngagementMessageParams: public DataAsset
{
public:
	struct FText                                                 Title;                                             // 0x28(0x38)
	struct FText                                                 Body;                                              // 0x60(0x38)
	struct StringAssetReference                                  KeyArt;                                            // 0x98(0x10)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class ReplacePagesStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DivingAIStrategyId: public AIStrategyId
{
public:
};


// Size 0x80 (Full Size[0x820] - InheritedSize[0x7a0]
class PoseableMeshMemoryConstraintComponent: public PoseableMeshComponent
{
public:
	char                                                         pad0x18_19M2V[0x18];                               // 0x7a0(0x18)
	class MeshMemoryConstraintHandler*                           Handler;                                           // 0x7b8(0x8)
	TArray<struct StringAssetReference>                          FallbackOverrideMaterials;                         // 0x7c0(0x10)
	class UClass*                                                MeshFallbackCategory;                              // 0x7d0(0x8)
	struct StringAssetReference                                  MeshReference;                                     // 0x7d8(0x10)
	bool                                                         MemoryAccountedFor;                                // 0x7f0(0x1)
	bool                                                         NeedMeshLoadOnServer;                              // 0x7f1(0x1)
	char                                                         pad0x6_T8JHD[0x6];                                 // 0x7f2(0x6)
	class UClass*                                                BudgetToCountMemoryAgainstIfNoFallback;            // 0x7f8(0x8)
	struct FeatureFlag                                           OptionalFeatureToggleForMMC;                       // 0x800(0xc)
	char                                                         pad0x4_LSQGE[0x4];                                 // 0x80c(0x4)
	char                                                         pad0x10_TRMZJ[0x10];                               // 0x810(0x10)
};


// Size 0x90 (Full Size[0x110] - InheritedSize[0x80]
class GetDigsiteProgressTaleStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableInt                                      InDigsiteID;                                       // 0x80(0x30)
	struct QuestVariableInt                                      OutNumberOfDigsRemainingInDigsite;                 // 0xb0(0x30)
	struct QuestVariableInt                                      OutNumberOfBuriedActorsInDigsite;                  // 0xe0(0x30)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class InteractableLightParameters: public DataAsset
{
public:
	bool                                                         LiveUpdate;                                        // 0x28(0x1)
	bool                                                         StartLit;                                          // 0x29(0x1)
	char                                                         pad0x6_LZ8OU[0x6];                                 // 0x2a(0x6)
	TArray<struct InteractableLightParams>                       LightParams;                                       // 0x30(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WieldableTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x18 (Full Size[0xd0] - InheritedSize[0xb8]
class DoubleIntentComponent: public ActorComponent
{
public:
	char                                                         pad0x8_IJEJU[0x8];                                 // 0xb8(0x8)
	float                                                        ServerFirstIntent;                                 // 0xc0(0x4)
	char                                                         pad0x4_H4K2Z[0x4];                                 // 0xc4(0x4)
	float                                                        ServerSecondIntent;                                // 0xc8(0x4)
	char                                                         pad0x4_M9NSG[0x4];                                 // 0xcc(0x4)
};


// Size 0x10 (Full Size[0xc8] - InheritedSize[0xb8]
class PortableHarpoonInteractionIgnoreObstructionComponent: public ActorComponent
{
public:
	TArray<struct ActorComponentSelector>                        ComponentsToIgnoreForObstructions;                 // 0xb8(0x10)
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class StatFireOnItemNPCHandinComponent: public ActorComponent
{
public:
	char                                                         pad0x8_VFXGI[0x8];                                 // 0xb8(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class UnlockableEntitlementsDataAsset: public DataAsset
{
public:
	TArray<struct UnlockableEntitlementCategory>                 Categories;                                        // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EncounterServiceInterface: public Interface
{
public:
};


// Size 0x28 (Full Size[0xa8] - InheritedSize[0x80]
class SharkPartsDesc: public MeshMemoryConstraintsAIPartsDesc
{
public:
	struct FString                                               SharkPartsTag;                                     // 0x80(0x10)
	struct SharkPlayerStats                                      SharkPlayerStats;                                  // 0x90(0x8)
	TArray<struct SharkMaterialEntry>                            Materials;                                         // 0x98(0x10)
};


// Size 0x398 (Full Size[0x738] - InheritedSize[0x3a0]
class BootyStorageService: public Actor
{
public:
	char                                                         pad0x88_MKVM0[0x88];                               // 0x3a0(0x88)
	class BootyStorageSettings*                                  BootyStorageSettings;                              // 0x428(0x8)
	class BootyStorageSettingsAsset*                             BootyStorageSettingsAsset;                         // 0x430(0x8)
	TArray<struct CrewBootyStorage>                              Storage;                                           // 0x438(0x10)
	struct EnvQueryRequest                                       SpawnBootyEQSRequest;                              // 0x448(0x170)
	struct EnvQueryRequest                                       SpawnRetrievalActorEQSRequest;                     // 0x5b8(0x170)
	char                                                         pad0x10_YEHDB[0x10];                               // 0x728(0x10)
};


// Size 0x1a8 (Full Size[0x260] - InheritedSize[0xb8]
class PlayerMigratableStatusComponent: public ActorComponent
{
public:
	char                                                         pad0x188_LV4WI[0x188];                             // 0xb8(0x188)
	class Actor*                                                 CurrentShip;                                       // 0x240(0x8)
	char                                                         pad0x18_XM2Y6[0x18];                               // 0x248(0x18)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class DartCharacterBoneOffsets: public DataAsset
{
public:
	TArray<String>                                               ChestBoneNames;                                    // 0x28(0x10)
	float                                                        FemaleDefaultBodyLimbsOffset;                      // 0x38(0x4)
	float                                                        FemaleDefaultBodyChestOffset;                      // 0x3c(0x4)
	float                                                        MaleDefaultBodyLimbsOffset;                        // 0x40(0x4)
	float                                                        MaleDefaultBodyChestOffset;                        // 0x44(0x4)
	float                                                        FemaleAthleticBodyLimbsOffset;                     // 0x48(0x4)
	float                                                        FemaleAthleticBodyChestOffset;                     // 0x4c(0x4)
	float                                                        MaleAthleticBodyLimbsOffset;                       // 0x50(0x4)
	float                                                        MaleAthleticBodyChestOffset;                       // 0x54(0x4)
	float                                                        FemaleThinBodyLimbsOffset;                         // 0x58(0x4)
	float                                                        FemaleThinBodyChestOffset;                         // 0x5c(0x4)
	float                                                        MaleThinBodyLimbsOffset;                           // 0x60(0x4)
	float                                                        MaleThinBodyChestOffset;                           // 0x64(0x4)
	float                                                        FemaleLargeBodyLimbsOffset;                        // 0x68(0x4)
	float                                                        FemaleLargeBodyChestOffset;                        // 0x6c(0x4)
	float                                                        MaleLargeBodyLimbsOffset;                          // 0x70(0x4)
	float                                                        MaleLargeBodyChestOffset;                          // 0x74(0x4)
	float                                                        FemaleUnfitBodyLimbsOffset;                        // 0x78(0x4)
	float                                                        FemaleUnfitBodyChestOffset;                        // 0x7c(0x4)
	float                                                        MaleUnfitBodyLimbsOffset;                          // 0x80(0x4)
	float                                                        MaleUnfitBodyChestOffset;                          // 0x84(0x4)
	float                                                        FaunaOffset;                                       // 0x88(0x4)
	char                                                         pad0x4_2UF1H[0x4];                                 // 0x8c(0x4)
};


// Size 0x50 (Full Size[0x190] - InheritedSize[0x140]
class InteractableStorageContainer: public InteractableComponent
{
public:
	char                                                         pad0x40_DBLLM[0x40];                               // 0x140(0x40)
	class Object*                                                Aggregator;                                        // 0x180(0x8)
	class UClass*                                                InteractInput;                                     // 0x188(0x8)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class PlayNpcAnimationResourceStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    TargetNpc;                                         // 0x80(0x30)
	struct QuestVariableActor                                    PlaceableReaction;                                 // 0xb0(0x30)
	class PlayNpcAnimationResource*                              PlayNpcAnimationResource;                          // 0xe0(0x8)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class CustomScoreItemValuesDataAsset: public DataAsset
{
public:
	struct FString                                               Category;                                          // 0x28(0x10)
	TArray<struct CustomScoreItemValue>                          ItemValues;                                        // 0x38(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DeferredSpawnInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class MapTablePanXMouseInputId: public AnalogInputId
{
public:
};


// Size 0x58 (Full Size[0x110] - InheritedSize[0xb8]
class SequenceComponent: public ActorComponent
{
public:
	char                                                         pad0x30_SKFOF[0x30];                               // 0xb8(0x30)
	TArray<int>                                                  Sequence;                                          // 0xe8(0x10)
	bool                                                         ResetOnError;                                      // 0xf8(0x1)
	bool                                                         SequenceComplete;                                  // 0xf9(0x1)
	char                                                         pad0x6_S66ZG[0x6];                                 // 0xfa(0x6)
	TArray<struct SequenceResponseContainer>                     Responses;                                         // 0x100(0x10)
};


// Size 0x10 (Full Size[0x3b0] - InheritedSize[0x3a0]
class OverlapTriggerActor: public Actor
{
public:
	class CapsuleComponent*                                      SceneComponent;                                    // 0x3a0(0x8)
	class OverlapTriggerComponent*                               OverlapComponent;                                  // 0x3a8(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SecondaryInteractNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FeedableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class ToggleCrouchNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DrowningComponentInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class GameAudioService: public Object
{
public:
	char                                                         pad0x8_2OIU9[0x8];                                 // 0x28(0x8)
	TArray<class Ship*>                                          ClientRegisteredShips;                             // 0x30(0x10)
	char                                                         pad0x18_06T4O[0x18];                               // 0x40(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ScrambledNamesComponentInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class WaitForArrivalTunnelOfTheDamnedCompletionTaleStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableGuid                                     CrewId;                                            // 0x80(0x30)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class DiscardTransientActorStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    Actor;                                             // 0x80(0x30)
	char                                                         DiscardType;                                       // 0xb0(0x1)
	char                                                         pad0x7_TF4T7[0x7];                                 // 0xb1(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LoadoutServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAnimationLadderBlueprintFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x48 (Full Size[0x100] - InheritedSize[0xb8]
class PortableHarpoonNonOverlapInteractionOverrideComponent: public ActorComponent
{
public:
	struct Vector                                                Origin;                                            // 0xb8(0xc)
	bool                                                         IsSphereVolume;                                    // 0xc4(0x1)
	char                                                         pad0x3_RUO9K[0x3];                                 // 0xc5(0x3)
	float                                                        SphereRadius;                                      // 0xc8(0x4)
	struct Vector                                                BoxExtents;                                        // 0xcc(0xc)
	bool                                                         BlockGrappling;                                    // 0xd8(0x1)
	bool                                                         BlockItemRetraction;                               // 0xd9(0x1)
	bool                                                         BlockCharacterRetraction;                          // 0xda(0x1)
	char                                                         pad0x25_SMI5C[0x25];                               // 0xdb(0x25)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class VulnerabilityLayerStateManagerInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0x1a0] - InheritedSize[0x170]
class EnvQueryTest_InStorm: public EnvQueryTest
{
public:
	struct AIDataProviderFloatValue                              Radius;                                            // 0x170(0x30)
};


// Size 0x48 (Full Size[0x100] - InheritedSize[0xb8]
class LookAtEmoteCameraComponent: public ActorComponent
{
public:
	class AthenaCameraComponent*                                 TargetCamera;                                      // 0xb8(0x8)
	float                                                        BlendInTime;                                       // 0xc0(0x4)
	float                                                        AttachedTargetLerpFactor;                          // 0xc4(0x4)
	char                                                         pad0x38_A7PMR[0x38];                               // 0xc8(0x38)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class HarpoonFireNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x98 (Full Size[0xd0] - InheritedSize[0x38]
class SwitchesSettings: public DeveloperSettings
{
public:
	struct StringAssetReference                                  EmergentAISwitchesDataAsset;                       // 0x38(0x10)
	struct StringAssetReference                                  EmergentFaunaSwitchesDataAsset;                    // 0x48(0x10)
	struct StringAssetReference                                  EmergentWatercraftSwitchesDataAsset;               // 0x58(0x10)
	struct StringAssetReference                                  EventsSchedulerSwitchesDataAsset;                  // 0x68(0x10)
	struct StringAssetReference                                  EntitlementSwitchesDataAsset;                      // 0x78(0x10)
	struct StringAssetReference                                  ModifiedStorageSwitchesDataAsset;                  // 0x88(0x10)
	struct StringAssetReference                                  ModifiedLoadoutSwitchesDataAsset;                  // 0x98(0x10)
	struct StringAssetReference                                  SwitchDefinitionsDataAsset;                        // 0xa8(0x10)
	struct StringAssetReference                                  SwitchPresetDataAsset;                             // 0xb8(0x10)
	float                                                        ServicesLagSimulationInSeconds;                    // 0xc8(0x4)
	char                                                         pad0x4_GDGQB[0x4];                                 // 0xcc(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CargoRunParticipantInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class SwitchesDataTypeManagerBase: public Object
{
public:
	char                                                         pad0x38_YB46C[0x38];                               // 0x28(0x38)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class SplutterStatus: public StatusBase
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class TaleQuestStatQueryFunctionComparator: public Object
{
public:
	char                                                         pad0x8_9W0RX[0x8];                                 // 0x28(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIKnockbackActionStateId: public ActionStateId
{
public:
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class IslandMaterialStatusZone: public Object
{
public:
	char                                                         pad0x10_FFKXT[0x10];                               // 0x28(0x10)
	TArray<struct IslandMaterialZoneStatusMapping>               StatusMappings;                                    // 0x38(0x10)
	char                                                         pad0x50_H008M[0x50];                               // 0x48(0x50)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RammerInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x298] - InheritedSize[0x288]
class ShantyRadialActivationInputComponent: public AthenaCharacterBaseInputComponent
{
public:
	char                                                         pad0x10_5P5ME[0x10];                               // 0x288(0x10)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class StatusResponseScreenSpaceVFX: public StatusResponse
{
public:
	struct FName                                                 MaterialParamName;                                 // 0x38(0x8)
	struct FName                                                 TintParamName;                                     // 0x40(0x8)
	struct LinearColor                                           TintColor;                                         // 0x48(0x10)
	float                                                        EffectStrength;                                    // 0x58(0x4)
	float                                                        FadeInAcceleration;                                // 0x5c(0x4)
	float                                                        FadeOutAcceleration;                               // 0x60(0x4)
	char                                                         pad0x4_HE2X8[0x4];                                 // 0x64(0x4)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TelemetryProgressStep: public TaleQuestStep
{
public:
	class TelemetryProgressStepDesc*                             StepDesc;                                          // 0x98(0x8)
};


// Size 0xb0 (Full Size[0x130] - InheritedSize[0x80]
class TaleQuestBlueprintStepDesc: public TaleQuestStepDesc
{
public:
	char                                                         pad0xa0_PV03Q[0xa0];                               // 0x80(0xa0)
	class UClass*                                                StepType;                                          // 0x120(0x8)
	class BlueprintStepBase*                                     StepInstance;                                      // 0x128(0x8)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class ResolveActorStringReferenceStep: public TaleQuestStep
{
public:
	class ResolveActorStringReferenceStepDesc*                   Desc;                                              // 0x98(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterFootImpactMeshInterface: public Interface
{
public:
};


// Size 0x48 (Full Size[0x100] - InheritedSize[0xb8]
class BakedDecalComponent: public ActorComponent
{
public:
	int                                                          TargetTextureSize;                                 // 0xb8(0x4)
	struct LinearColor                                           ClearColour;                                       // 0xbc(0x10)
	int                                                          MaxDeferredDecals;                                 // 0xcc(0x4)
	class TextureRenderTarget2D*                                 TargetTexture;                                     // 0xd0(0x8)
	TArray<class StaticMeshComponent*>                           StaticMeshes;                                      // 0xd8(0x10)
	TArray<struct DeferredBakedDecal>                            DeferredDecals;                                    // 0xe8(0x10)
	char                                                         pad0x8_DLMNI[0x8];                                 // 0xf8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RewindTransformProviderInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PhrasesRadialInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RevealerInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0xe0] - InheritedSize[0xe0]
class ItemRepresentationCountMaterialDisplayComponent: public CountMaterialDisplayComponent
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class ClearTaleProgressStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LiquidLauncherChargeVisualsProviderInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class SpawnPhasedActorStep: public TaleQuestStep
{
public:
	class SpawnPhasedActorStepDesc*                              Desc;                                              // 0x98(0x8)
	char                                                         pad0x30_5IRAK[0x30];                               // 0xa0(0x30)
};


// Size 0x18 (Full Size[0x90] - InheritedSize[0x78]
class AshCloudAIAbility: public AthenaAIAbility
{
public:
	class Pawn*                                                  Owner;                                             // 0x78(0x8)
	class AshCloudAIAbilityParams*                               SetupAbilityParams;                                // 0x80(0x8)
	class AshenLordAshCloud*                                     AshCloudInstance;                                  // 0x88(0x8)
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class LandmarkReactionActor: public Actor
{
public:
	char                                                         pad0x8_T035J[0x8];                                 // 0x3a0(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestSetNPCDialogKeyStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlockImpactProxyInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GuildChroniclesInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0x300] - InheritedSize[0x2d0]
class NameplateComponent: public SceneComponent
{
public:
	float                                                        FadeTime;                                          // 0x2d0(0x4)
	char                                                         pad0x4_24V39[0x4];                                 // 0x2d4(0x4)
	class SkeletalMeshSocket*                                    NameplateSocket;                                   // 0x2d8(0x8)
	char                                                         pad0x20_JFYMG[0x20];                               // 0x2e0(0x20)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BalancingInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AnimNotifyQuestBookForcePageRedraw: public AnimNotify
{
public:
};


// Size 0x10 (Full Size[0x3b0] - InheritedSize[0x3a0]
class ClientMemoryReservationActor: public Actor
{
public:
	char                                                         pad0x10_IYIB1[0x10];                               // 0x3a0(0x10)
};


// Size 0x48 (Full Size[0x3e8] - InheritedSize[0x3a0]
class HideoutEntrance: public Actor
{
public:
	class BoxComponent*                                          TriggerZoneComponent;                              // 0x3a0(0x8)
	TArray<class SpawnLocation*>                                 HideoutExitSpawnPoints;                            // 0x3a8(0x10)
	char                                                         pad0x30_PIHSQ[0x30];                               // 0x3b8(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShipwreckNameGeneratorAbstract: public Object
{
public:
};


// Size 0x3d0 (Full Size[0x488] - InheritedSize[0xb8]
class PopUpNotificationComponent: public ActorComponent
{
public:
	class RewardPopUpNotificationCollectionDataAsset*            RewardPopUpNotificationCollection;                 // 0xb8(0x8)
	TArray<class DeferralReasonPopUpNotificationDataAsset*>      DeferralReasonPopUpNotifications;                  // 0xc0(0x10)
	TArray<class CampaignPopUpNotificationDataAsset*>            CampaignPopUpNotifications;                        // 0xd0(0x10)
	class PopUpMessageDesc*                                      PeriodicObjectiveCompletePopUp;                    // 0xe0(0x8)
	class PopUpMessageDesc*                                      PeriodicObjectiveIncompletePopUp;                  // 0xe8(0x8)
	class PopUpMessageDesc*                                      NPCOnBeachFlowPopUpNoTaleCheckpointVoyage;         // 0xf0(0x8)
	class PopUpMessageDesc*                                      NPCOnBeachFlowPopUpHasTaleCheckpointVoyage;        // 0xf8(0x8)
	class PopUpMessageDesc*                                      GuildCosmeticEntitlementRemovedPopup;              // 0x100(0x8)
	class PopUpMessageDesc*                                      AncientKnowledgeGainedPopup;                       // 0x108(0x8)
	TArray<struct AlignmentOfTypePopUpInformation>               AlignmentOfTypePopUpInformation;                   // 0x110(0x10)
	struct MermaidServicePopUpData                               MermaidToggledPopUpData;                           // 0x120(0x10)
	TArray<struct NewVoyagesAvailablePerCompanyPopupMessage>     NewVoyagesAvailableToPlayerPrompts;                // 0x130(0x10)
	class CrewNotificationSettings*                              CrewNotificationDataAsset;                         // 0x140(0x8)
	class CaptainsLogbookAccoladeLocalisedTextDefinitionAsset*   AccoladeLocalisedTextDefinitionAsset;              // 0x148(0x8)
	TArray<class Class*>                                         Factions;                                          // 0x150(0x10)
	TArray<struct DistinctionBanners>                            DistinctionBanners;                                // 0x160(0x10)
	char                                                         pad0x18_S108K[0x18];                               // 0x170(0x18)
	struct EmissaryNotificationState                             EmissaryState;                                     // 0x188(0xc)
	char                                                         pad0x4_Y9OE1[0x4];                                 // 0x194(0x4)
	class PopUpMessageDesc*                                      NewTitlesAvailableToBuyPopUp;                      // 0x198(0x8)
	int                                                          NewTitlePopupCompanyBackgroundGrade;               // 0x1a0(0x4)
	char                                                         pad0x4_6NN0U[0x4];                                 // 0x1a4(0x4)
	class PrioritisedPromptsManager*                             PrioritisedPrompts;                                // 0x1a8(0x8)
	class EmissaryLevelSettingsAsset*                            EmissaryLevelSettings;                             // 0x1b0(0x8)
	class TradingCompanyPopUpBackgroundCollectionDataAsset*      CompanyPopUpBackgroundCollection;                  // 0x1b8(0x8)
	class SessionManagementServiceSettingsDataAsset*             SessionManagementSettings;                         // 0x1c0(0x8)
	char                                                         pad0x2c0_ZDWEL[0x2c0];                             // 0x1c8(0x2c0)
};


// Size 0x50 (Full Size[0x88] - InheritedSize[0x38]
class PlayerActivitySettings: public DeveloperSettings
{
public:
	struct StringAssetReference                                  PlayerActivityLifetimeRulesCatalogue;              // 0x38(0x10)
	struct StringAssetReference                                  PlayerActivityIconCatalogue;                       // 0x48(0x10)
	class UClass*                                                PlayerActivityIconSetIdToBeusedByPlayers;          // 0x58(0x8)
	float                                                        NameplateMaxVisibilityDistance;                    // 0x60(0x4)
	char                                                         pad0x4_UQDW8[0x4];                                 // 0x64(0x4)
	TArray<char>                                                 HealthChangeReasonsToTriggerLoseHealthActivity;    // 0x68(0x10)
	TArray<Class>                                                InstigatorsToTriggerLoseHealthActivity;            // 0x78(0x10)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class MimicStatus: public StatusBase
{
public:
};


// Size 0xd0 (Full Size[0x150] - InheritedSize[0x80]
class TaleQuestAddZoomMapQuestbookPageStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableName                                     IslandName;                                        // 0x80(0x30)
	class TreasureMapDataAsset*                                  TreasureMapDataAsset;                              // 0xb0(0x8)
	class ZoomMapParamsDataAsset*                                Params;                                            // 0xb8(0x8)
	struct QuestVariablePageLayout                               BottomPageLayout;                                  // 0xc0(0x30)
	struct QuestVariablePageLayout                               TopPageLayout;                                     // 0xf0(0x30)
	struct QuestVariableVector                                   DigSpot;                                           // 0x120(0x30)
};


// Size 0xd0 (Full Size[0x188] - InheritedSize[0xb8]
class DrunkenChestComponent: public ActorComponent
{
public:
	class WwiseEvent*                                            OnPickedUpLocalPlayerOnlyEvent;                    // 0xb8(0x8)
	class DrunkennessComponent*                                  DrunkennessComponent;                              // 0xc0(0x8)
	class Actor*                                                 Wielder;                                           // 0xc8(0x8)
	float                                                        TargetDrunkenness;                                 // 0xd0(0x4)
	char                                                         pad0xb4_0N5LN[0xb4];                               // 0xd4(0xb4)
};


// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class CoastService: public Object
{
public:
	char                                                         pad0x78_DZ6VY[0x78];                               // 0x28(0x78)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LockableDoorInterface: public Interface
{
public:
};


// Size 0x168 (Full Size[0x220] - InheritedSize[0xb8]
class StaggerComponent: public ActorComponent
{
public:
	class CurveFloat*                                            XStickInputOverloaderAmplitude;                    // 0xb8(0x8)
	class CurveFloat*                                            YStickInputOverloaderAmplitude;                    // 0xc0(0x8)
	float                                                        MinInputOverloaderSpd;                             // 0xc8(0x4)
	float                                                        MaxInputOverloaderSpd;                             // 0xcc(0x4)
	float                                                        ChanceToChangeDirectionOnSpeedChange;              // 0xd0(0x4)
	float                                                        InputOverloaderSpdChangePerSec;                    // 0xd4(0x4)
	float                                                        MinOverloaderSpdChangeTime;                        // 0xd8(0x4)
	float                                                        MaxOverloaderSpdChangeTime;                        // 0xdc(0x4)
	float                                                        StickInputForMaxInterferenceScalar;                // 0xe0(0x4)
	float                                                        InterferenceScalarAtMinStickInput;                 // 0xe4(0x4)
	float                                                        InterferenceScalarOnLadderStationary;              // 0xe8(0x4)
	float                                                        InterferenceScalarOnLadderMoving;                  // 0xec(0x4)
	float                                                        MaxStickDeflectionOnLadderToConsiderStationary;    // 0xf0(0x4)
	float                                                        StickDeflectionForMaxScalingOnLadder;              // 0xf4(0x4)
	TArray<struct StaggerModifiersEntry>                         StaggerModifierEntries;                            // 0xf8(0x10)
	char                                                         pad0x118_VYPPW[0x118];                             // 0x108(0x118)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TrackedActorOriginInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AtmosphericPressureService: public Object
{
public:
	char                                                         pad0x8_HXJMW[0x8];                                 // 0x28(0x8)
	TArray<class Interface*>                                     RegisteredAtmosphericPressureZones;                // 0x30(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnsembleInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class RadialSlotIndex2SelectedKeyboardNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class LimpingTestActor: public Actor
{
public:
	class LimpingComponent*                                      Limping;                                           // 0x3a0(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ZoomMapParamsDataAsset: public DataAsset
{
public:
	float                                                        Offset;                                            // 0x28(0x4)
	float                                                        ZoomLevel;                                         // 0x2c(0x4)
	float                                                        XMarkSizeModifier;                                 // 0x30(0x4)
	float                                                        MaxDistanceFromCentreToDigspot;                    // 0x34(0x4)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ReapersTributeShipDefeatedStateDataAsset: public DataAsset
{
public:
	int                                                          NumberOfCannonHitsToSinkWaterloggedShip;           // 0x28(0x4)
	float                                                        TimeBeforeCannonHitsCountForDefeatedWaterloggedShip; // 0x2c(0x4)
	TArray<class Class*>                                         DamageTypesAllowed;                                // 0x30(0x10)
};


// Size 0x160 (Full Size[0x430] - InheritedSize[0x2d0]
class WieldedItemComponent: public SceneComponent
{
public:
	class WieldableItemSetComponent*                             WieldableItemSetComponent;                         // 0x2d0(0x8)
	class Actor*                                                 ReplicatedCurrentlyWieldedItem;                    // 0x2d8(0x8)
	class Actor*                                                 CurrentlyWieldedItem;                              // 0x2e0(0x8)
	char                                                         pad0x118_RAOIQ[0x118];                             // 0x2e8(0x118)
	int                                                          EpochId;                                           // 0x400(0x4)
	char                                                         pad0xc_PUZEH[0xc];                                 // 0x404(0xc)
	struct ServerWieldSet                                        PendingServerWieldSet;                             // 0x410(0x1c)
	char                                                         pad0x4_78M6G[0x4];                                 // 0x42c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SPC_Activity_AggressiveGhostShip_SeaDamsel: public SandboxPerformanceConstraintActivityType
{
public:
};


// Size 0x190 (Full Size[0x248] - InheritedSize[0xb8]
class ShipPersistenceComponent: public ActorComponent
{
public:
	char                                                         pad0x8_54TTV[0x8];                                 // 0xb8(0x8)
	class PersistenceIdentifierSettingsAsset*                    PersistenceIdentifierSettingsAsset;                // 0xc0(0x8)
	struct ShipCaptainedSessionData                              CaptaincyData;                                     // 0xc8(0x58)
	struct Guid                                                  ReplicatedCrewId;                                  // 0x120(0x10)
	struct ShipPersistenceModel                                  ShipModel;                                         // 0x130(0x50)
	struct ShipLoadoutPersistenceModel                           ShipLoadoutModel;                                  // 0x180(0x40)
	char                                                         LoadoutPersistence;                                // 0x1c0(0x1)
	char                                                         pad0x87_KD9E0[0x87];                               // 0x1c1(0x87)
};


// Size 0x40 (Full Size[0x78] - InheritedSize[0x38]
class CaptainsLogSettings: public DeveloperSettings
{
public:
	struct Guid                                                  ShipScheduleId;                                    // 0x38(0x10)
	struct Guid                                                  CrewScheduleId;                                    // 0x48(0x10)
	TArray<struct AccoladeProgressId>                            DefaultShipAccolades;                              // 0x58(0x10)
	TArray<struct AccoladeProgressId>                            DefaultCrewAccolades;                              // 0x68(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class RewardDistributionModelDataAsset: public DataAsset
{
public:
	struct RewardDistributionModelData                           RewardDistributionModelData;                       // 0x28(0x20)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class InGameCommandTeleportManager: public Object
{
public:
	char                                                         pad0x30_XTDPB[0x30];                               // 0x28(0x30)
	class TeleportCommandSettings*                               TeleportCommandSettings;                           // 0x58(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SignalMechanismTargetInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class ScrambledNamesSettings: public DeveloperSettings
{
public:
	struct StringAssetReference                                  ScrambledPlayerNamesDataAssetReference;            // 0x38(0x10)
	struct StringAssetReference                                  ScrambledShipNamesDataAssetReference;              // 0x48(0x10)
	struct StringAssetReference                                  ScrambledGuildNamesDataAssetReference;             // 0x58(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShipSessionInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class TimeOfDayDataAsset: public DataAsset
{
public:
	float                                                        SunriseStartHour;                                  // 0x28(0x4)
	float                                                        MorningStartHour;                                  // 0x2c(0x4)
	float                                                        MidDayStartHour;                                   // 0x30(0x4)
	float                                                        AfternoonStartHour;                                // 0x34(0x4)
	float                                                        SunsetStartHour;                                   // 0x38(0x4)
	float                                                        NightStartHour;                                    // 0x3c(0x4)
};


// Size 0x0 (Full Size[0xb8] - InheritedSize[0xb8]
class ShroudBreakerComponent: public ActorComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ServerUpdateReportingServiceInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestIsFeatureEnabledStep: public TaleQuestStep
{
public:
	class TaleQuestIsFeatureEnabledStepDesc*                     Desc;                                              // 0x98(0x8)
};


// Size 0x98 (Full Size[0xc0] - InheritedSize[0x28]
class ServerNotificationsService: public Object
{
public:
	char                                                         pad0x98_UZSLW[0x98];                               // 0x28(0x98)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShipSinkingHandlerInterface: public Interface
{
public:
};


// Size 0x158 (Full Size[0x210] - InheritedSize[0xb8]
class PlayerGeneratedMapsContainerComponent: public ActorComponent
{
public:
	char                                                         pad0x8_JK1QC[0x8];                                 // 0xb8(0x8)
	struct FText                                                 ContainerDisplayName;                              // 0xc0(0x38)
	char                                                         pad0x8_EPF2J[0x8];                                 // 0xf8(0x8)
	struct Transform                                             InstanceTransform;                                 // 0x100(0x30)
	class UClass*                                                MapDesc;                                           // 0x130(0x8)
	class PlayerGeneratedMapsContainerComponentDataAsset*        ContainerDataAsset;                                // 0x138(0x8)
	TArray<struct PlayerGeneratedMapDisplayData>                 PlayerMapInventory;                                // 0x140(0x10)
	TArray<struct PlayerGeneratedMapDisplayData>                 StoreMapInventory;                                 // 0x150(0x10)
	class WwiseEvent*                                            AddMapSFX;                                         // 0x160(0x8)
	class WwiseEvent*                                            TakeMapSFX;                                        // 0x168(0x8)
	class WwiseEvent*                                            OpenContainerSFX;                                  // 0x170(0x8)
	int                                                          MaxNumStoreMapsToReplicate;                        // 0x178(0x4)
	int                                                          MaxNumPlayerMapsToReplicate;                       // 0x17c(0x4)
	int                                                          DailyMapLimit;                                     // 0x180(0x4)
	char                                                         pad0x4_WJ0B6[0x4];                                 // 0x184(0x4)
	struct StringAssetReference                                  MapTakenBackgroundImage;                           // 0x188(0x10)
	TArray<struct StringAssetReference>                          MapTakenImages;                                    // 0x198(0x10)
	TArray<class Actor*>                                         ServerAttachedPlayers;                             // 0x1a8(0x10)
	class WwiseObjectPoolWrapper*                                SfxPool;                                           // 0x1b8(0x8)
	char                                                         pad0x50_NVSSQ[0x50];                               // 0x1c0(0x50)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ShantyItemDescToSlotRemappingDataAsset: public DataAsset
{
public:
	TArray<class Class*>                                         Slots;                                             // 0x28(0x10)
};


// Size 0xa8 (Full Size[0xd0] - InheritedSize[0x28]
class HarpoonLauncherAudioParamsDataAsset: public DataAsset
{
public:
	struct Vector                                                AudioEmitterOffset;                                // 0x28(0xc)
	struct FName                                                 MoveYawRateRTPCName;                               // 0x34(0x8)
	struct FName                                                 MovePitchRateRTPCName;                             // 0x3c(0x8)
	struct FName                                                 SpoolingSpeedRTPCName;                             // 0x44(0x8)
	char                                                         pad0x4_K0XG9[0x4];                                 // 0x4c(0x4)
	class WwiseEvent*                                            StartMovePitchAudioLoopEvent;                      // 0x50(0x8)
	class WwiseEvent*                                            StopMovePitchAudioLoopEvent;                       // 0x58(0x8)
	class WwiseEvent*                                            StartMoveYawAudioLoopEvent;                        // 0x60(0x8)
	class WwiseEvent*                                            StopMoveYawAudioLoopEvent;                         // 0x68(0x8)
	class WwiseEvent*                                            StoppedAimAtEdgeOfRangeAudioEvent;                 // 0x70(0x8)
	class WwiseEvent*                                            FireAudioEvent;                                    // 0x78(0x8)
	class WwiseEvent*                                            RetractTriggeredAudioEvent;                        // 0x80(0x8)
	class WwiseEvent*                                            RetractFinishedAudioEvent;                         // 0x88(0x8)
	class WwiseEvent*                                            ReleaseRetractableAudioEvent;                      // 0x90(0x8)
	class WwiseEvent*                                            StartSpoolingAudioEvent;                           // 0x98(0x8)
	class WwiseEvent*                                            StopSpoolingAudioEvent;                            // 0xa0(0x8)
	class WwiseEvent*                                            TetherExtentReachedAudioEvent;                     // 0xa8(0x8)
	class WwiseEvent*                                            ReelLockInputPressedAudioEvent;                    // 0xb0(0x8)
	class WwiseEvent*                                            ReelLockInputReleasedAudioEvent;                   // 0xb8(0x8)
	class WwiseObjectPoolWrapper*                                AudioEmitterPool;                                  // 0xc0(0x8)
	float                                                        SpoolingSpeedClampValue;                           // 0xc8(0x4)
	float                                                        AttachedSpoolingSpeedClampValue;                   // 0xcc(0x4)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class GetDistantLocationsFromListTaleStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x288] - InheritedSize[0x288]
class MigrationInputComponent: public AthenaCharacterBaseInputComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayerTelemetrySubjectGetterInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class RemoveFogBankAvoidanceAreaStep: public TaleQuestStep
{
public:
	class RemoveFogBankAvoidanceAreaStepDesc*                    StepDesc;                                          // 0x98(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CoastQueryInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RewindPhysicsServiceInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0xc8] - InheritedSize[0xb8]
class ApplyStatusToConsumerComponent: public ActorComponent
{
public:
	TArray<struct ItemConsumptionStatusChanceEntry>              ConsumptionStatuses;                               // 0xb8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ReplenishableItemsInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FlamesOfFateSettingsServiceInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class FireChargedAttackAIAbilityParams: public AthenaAIAbilityParams
{
public:
	TArray<struct ChargedAttackProjectileWeights>                ProjectileParams;                                  // 0xc8(0x10)
};


// Size 0x1d8 (Full Size[0x290] - InheritedSize[0xb8]
class RewardComponent: public ActorComponent
{
public:
	char                                                         pad0x1d8_H5XQX[0x1d8];                             // 0xb8(0x1d8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class WeightedRewardTableAsset: public DataAsset
{
public:
	struct WeightedRewardTable                                   RewardTable;                                       // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CameraViewRestrictableInteractorInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0xc8] - InheritedSize[0xb8]
class WorldMarkerOnSpawnPositionComponent: public ActorComponent
{
public:
	float                                                        ZOffset;                                           // 0xb8(0x4)
	char                                                         pad0x4_27FCA[0x4];                                 // 0xbc(0x4)
	class UClass*                                                MarkerVariant;                                     // 0xc0(0x8)
};


// Size 0x160 (Full Size[0x1e0] - InheritedSize[0x80]
class TaleQuestAssignVaultStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableVector                                   SelectionOriginPointVar;                           // 0x80(0x30)
	struct QuestVariableInt                                      GoldHoarderVoyageTier;                             // 0xb0(0x30)
	struct QuestVariableClassArray                               ValidSeas;                                         // 0xe0(0x30)
	struct QuestVariableTextArray                                VaultNamesToIgnore;                                // 0x110(0x30)
	struct QuestVariableTaleResourceHandle                       AlloctedVaultHandleVar;                            // 0x140(0x30)
	struct QuestVariableActor                                    AlloctedVaultVar;                                  // 0x170(0x30)
	struct QuestVariableClass                                    VaultKeyTypeVar;                                   // 0x1a0(0x30)
	bool                                                         AlwaysClosestVault;                                // 0x1d0(0x1)
	bool                                                         UsePriorityRange;                                  // 0x1d1(0x1)
	char                                                         pad0x2_WP3D2[0x2];                                 // 0x1d2(0x2)
	float                                                        PriorityRange;                                     // 0x1d4(0x4)
	int                                                          NumberOfSearches;                                  // 0x1d8(0x4)
	char                                                         pad0x4_QL3A9[0x4];                                 // 0x1dc(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class HarpoonLauncherVFXDataAsset: public DataAsset
{
public:
	class Object*                                                MuzzleFlashVfxFirstPerson;                         // 0x28(0x8)
	class Object*                                                MuzzleFlashVfxThirdPerson;                         // 0x30(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class ToggleNarratedShipDirectionComponentInputId: public NotificationInputId
{
public:
};


// Size 0x48 (Full Size[0x100] - InheritedSize[0xb8]
class PlayerNameplateLocationOverrideComponent: public ActorComponent
{
public:
	char                                                         pad0x8_8GEK4[0x8];                                 // 0xb8(0x8)
	struct Transform                                             NameplateLocation;                                 // 0xc0(0x30)
	float                                                        AdditionalHeight;                                  // 0xf0(0x4)
	char                                                         pad0xc_EQU3A[0xc];                                 // 0xf4(0xc)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WieldableItemSetInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LandmarkReactionTriggerInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PuzzleObjectInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SpawnCommandsAITypeList: public DataAsset
{
public:
	TArray<struct SpawnCommandsAIType>                           AITypes;                                           // 0x28(0x10)
};


// Size 0x80 (Full Size[0x138] - InheritedSize[0xb8]
class QuickInventoryComponent: public ActorComponent
{
public:
	char                                                         pad0x18_MSBTO[0x18];                               // 0xb8(0x18)
	class UClass*                                                CannonballItemCategory;                            // 0xd0(0x8)
	class UClass*                                                CursedCannonballItemCategory;                      // 0xd8(0x8)
	class UClass*                                                FoodItemCategory;                                  // 0xe0(0x8)
	class UClass*                                                EnchantedFoodItemCategory;                         // 0xe8(0x8)
	class UClass*                                                RepairablesItemCategory;                           // 0xf0(0x8)
	class UClass*                                                BaitItemCategory;                                  // 0xf8(0x8)
	class UClass*                                                FireBombCategory;                                  // 0x100(0x8)
	class UClass*                                                ChainShotCategory;                                 // 0x108(0x8)
	class UClass*                                                GrapeShotCategory;                                 // 0x110(0x8)
	class UClass*                                                FireworkCategory;                                  // 0x118(0x8)
	class UClass*                                                DeployableCategory;                                // 0x120(0x8)
	char                                                         pad0x10_JF13U[0x10];                               // 0x128(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WieldableItemPersistentCooldownInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class KeepStillAIStrategyId: public AIStrategyId
{
public:
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class StatusResponseEmote: public StatusResponse
{
public:
	struct FName                                                 EmoteIdentifier;                                   // 0x38(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnvQueryContext_BoarWallowLocationOnIsland: public EnvQueryContext
{
public:
};


// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class AggressiveGhostShipEncounterDataAsset: public DataAsset
{
public:
	struct WeightedProbabilityRangeOfRanges                      TimeBetweenSpawns;                                 // 0x28(0x30)
	struct WeightedProbabilityRangeOfRanges                      TimeBetweenFormationMemberSpawns;                  // 0x58(0x30)
	TArray<struct AggressiveGhostShipEncounterWaveDesc>          WaveDescs;                                         // 0x88(0x10)
	class BuoyantObjectSpawnProfileDataAsset*                    BarrelsOfPlentySpawnProfileOverride;               // 0x98(0x8)
	class UClass*                                                Ship;                                              // 0xa0(0x8)
	class UClass*                                                Ship_SPCActivity;                                  // 0xa8(0x8)
	class UClass*                                                MineActorClass;                                    // 0xb0(0x8)
	class UClass*                                                AnchorDropActorClass;                              // 0xb8(0x8)
	char                                                         Allegiance;                                        // 0xc0(0x1)
	bool                                                         CanAttackEnemyGhostShips;                          // 0xc1(0x1)
	char                                                         pad0x6_P8Z89[0x6];                                 // 0xc2(0x6)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ContestManagerServiceInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ItemDiggingEffectsConfig: public Object
{
public:
	TArray<struct ItemProxyImpactVfxParams>                      FullyDugUpVfxParams;                               // 0x28(0x10)
};


// Size 0x70 (Full Size[0x340] - InheritedSize[0x2d0]
class MountableSceneComponent: public SceneComponent
{
public:
	char                                                         pad0x8_Y1OFZ[0x8];                                 // 0x2d0(0x8)
	class UClass*                                                MountableType;                                     // 0x2d8(0x8)
	TArray<struct PlayerStat>                                    MountableTypeCrewStats;                            // 0x2e0(0x10)
	struct FText                                                 Description;                                       // 0x2f0(0x38)
	char                                                         pad0x18_RRZL3[0x18];                               // 0x328(0x18)
};


// Size 0xc8 (Full Size[0x2c0] - InheritedSize[0x1f8]
class CharacterFlammableComponent: public ActorFlammableComponent
{
public:
	char                                                         pad0x30_4E4QH[0x30];                               // 0x1f8(0x30)
	float                                                        FireFalloffDuration;                               // 0x228(0x4)
	float                                                        FireRateOfFalloffInRain;                           // 0x22c(0x4)
	float                                                        FireFalloffMultiplier;                             // 0x230(0x4)
	struct FName                                                 VfxSocketName;                                     // 0x234(0x8)
	char                                                         pad0x4_SI3G3[0x4];                                 // 0x23c(0x4)
	struct Transform                                             SocketRelativeOffset;                              // 0x240(0x30)
	char                                                         pad0x8_WOIS6[0x8];                                 // 0x270(0x8)
	class FireSettingsDataAsset*                                 FireSettingsAsset;                                 // 0x278(0x8)
	char                                                         pad0x40_DU6VQ[0x40];                               // 0x280(0x40)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class LookUpRateAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RainZoneServiceInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0xf0] - InheritedSize[0xb8]
class HitReactionComponent: public ActorComponent
{
public:
	char                                                         pad0x30_2JQ47[0x30];                               // 0xb8(0x30)
	bool                                                         ServerAuthoritiveReactions;                        // 0xe8(0x1)
	char                                                         pad0x7_PAUAE[0x7];                                 // 0xe9(0x7)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class ActivateAllSpawnersVaultStep: public TaleQuestStep
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class DiggingAudioDataAsset: public DataAsset
{
public:
	TArray<struct ItemDiggingAudioOverride>                      AudioOverrides;                                    // 0x28(0x10)
	class ItemDiggingAudioConfig*                                Default;                                           // 0x38(0x8)
	class WwiseObjectPoolWrapper*                                SfxPool;                                           // 0x40(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ContestZoneRespawnLocationsDataAsset: public DataAsset
{
public:
	TArray<struct Transform>                                     ContestRespawnLocations;                           // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RegistrablePartTestObject: public Object
{
public:
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class AthenaCharacterMovementSettings: public Object
{
public:
	struct NetPositionErrorTolerance                             StandardError;                                     // 0x28(0x8)
	struct NetPositionErrorTolerance                             SwimmingError;                                     // 0x30(0x8)
	float                                                        SwimmingClientTrustThreshold;                      // 0x38(0x4)
	float                                                        MaxSwimmingTimeStep;                               // 0x3c(0x4)
	int                                                          MaxSwimmingIterations;                             // 0x40(0x4)
	float                                                        RebaseToServerErrorSqrDist;                        // 0x44(0x4)
	float                                                        OnlyInterpolationAfterSqrDist;                     // 0x48(0x4)
	float                                                        InterpolationSqrDistWhenWithinConeAngle;           // 0x4c(0x4)
	float                                                        IncreasedInterpolationDistConeAngleDegrees;        // 0x50(0x4)
	bool                                                         OnlyUseInterpolationConeAngleForPlayerCharacters;  // 0x54(0x1)
	char                                                         pad0x3_WBJG9[0x3];                                 // 0x55(0x3)
	float                                                        NoVisualUpdateAfterSqrDist;                        // 0x58(0x4)
	float                                                        TimeBetweenPlayerDistanceChecks;                   // 0x5c(0x4)
	float                                                        TimeBetweenPlayerDistanceChecksWhenConsideringConeAngle; // 0x60(0x4)
	float                                                        TimeToSimulateNewCharacters;                       // 0x64(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIShipWorldSettingsGetterInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class HarpoonReelLockPressedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0xc8 (Full Size[0xf0] - InheritedSize[0x28]
class ChecklistMapLayout: public DataAsset
{
public:
	struct TreasureMapWidgetText                                 Title;                                             // 0x28(0x3c)
	struct TreasureMapWidgetText                                 Description;                                       // 0x64(0x3c)
	TArray<struct TreasureMapWidgetText>                         Items;                                             // 0xa0(0x10)
	struct TreasureMapWidgetText                                 Afternote;                                         // 0xb0(0x3c)
	char                                                         pad0x4_PCD9X[0x4];                                 // 0xec(0x4)
};


// Size 0x90 (Full Size[0x640] - InheritedSize[0x5b0]
class PickupActorMock: public Character
{
public:
	char                                                         pad0x90_58TT3[0x90];                               // 0x5b0(0x90)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class RadialAction: public Object
{
public:
	class UClass*                                                InputID;                                           // 0x28(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class OtherCrewNameplatesToggleInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShipPartRegistrationInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class CannonYawRateRightStickAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class ItemDiggingAnimationConfig: public Object
{
public:
	float                                                        PosSpringAccel;                                    // 0x28(0x4)
	float                                                        RotSpringAccel;                                    // 0x2c(0x4)
	float                                                        ZOffsetToStartFirstPosBlendFrom;                   // 0x30(0x4)
	float                                                        InitialZOffset;                                    // 0x34(0x4)
	float                                                        FinalZOffset;                                      // 0x38(0x4)
	float                                                        PercentageOfExhumingTravelLastDigDoes;             // 0x3c(0x4)
	class CurveFloat*                                            PitchRollAngleRandomCurve;                         // 0x40(0x8)
	class CurveFloat*                                            PitchRollRattleCurveWhileMoving;                   // 0x48(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WieldedItemSpeedModifierInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class MeshMemoryConstraintFallbackCategoryDataAsset: public DataAsset
{
public:
	class UClass*                                                ConstraintCategory;                                // 0x28(0x8)
	struct StringAssetReference                                  MeshFallbackReference;                             // 0x30(0x10)
	char                                                         pad0x8_GSTU3[0x8];                                 // 0x40(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WorldEndAIAbilityType: public AthenaAIAbilityType
{
public:
};


// Size 0x240 (Full Size[0x2f8] - InheritedSize[0xb8]
class PremiumShopViewModelComponentBase: public ActorComponent
{
public:
	char                                                         pad0x1b0_H19X3[0x1b0];                             // 0xb8(0x1b0)
	class PetShopDataAsset*                                      PetShopDataAsset;                                  // 0x268(0x8)
	char                                                         pad0x88_JIMIL[0x88];                               // 0x270(0x88)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class SkeletonAICharacterAudioComponentParams: public DataAsset
{
public:
	TArray<struct SkeletonAICharacterStrategyAudioEvents>        StrategyAudioEvents;                               // 0x28(0x10)
	class WwiseEvent*                                            SuccessfullyRevivedSfx;                            // 0x38(0x8)
};


// Size 0xe0 (Full Size[0x3b0] - InheritedSize[0x2d0]
class HangingGroupComponent: public SceneComponent
{
public:
	class HangingParamsDataAsset*                                HangingParamsDataAsset;                            // 0x2d0(0x8)
	struct FText                                                 InteractionVerb;                                   // 0x2d8(0x38)
	struct FText                                                 InteractionDisplayName;                            // 0x310(0x38)
	struct FText                                                 InteractionTextTakingDamage;                       // 0x348(0x38)
	TArray<struct HangingComponentPositions>                     HangingPositions;                                  // 0x380(0x10)
	TArray<class HangingComponent*>                              HangingComponents;                                 // 0x390(0x10)
	char                                                         pad0x10_CG2M1[0x10];                               // 0x3a0(0x10)
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class PhasedActorSourceComponent: public ActorComponent
{
public:
	class Actor*                                                 PhasingSourceActor;                                // 0xb8(0x8)
};


// Size 0x170 (Full Size[0x2b0] - InheritedSize[0x140]
class MegalodonSoulInteractableComponent: public InteractableComponent
{
public:
	char                                                         pad0x10_3II86[0x10];                               // 0x140(0x10)
	struct FText                                                 DisplayName;                                       // 0x150(0x38)
	struct FText                                                 TakeSoulTooltipText;                               // 0x188(0x38)
	struct FText                                                 EffigyNotRaisedToolTipText;                        // 0x1c0(0x38)
	struct FText                                                 NotWieldingEffigyTooltipText;                      // 0x1f8(0x38)
	struct FText                                                 CannotEnchantEffigyTooltipText;                    // 0x230(0x38)
	char                                                         MegalodonSoulType;                                 // 0x268(0x1)
	char                                                         pad0x7_XJ6WE[0x7];                                 // 0x269(0x7)
	class UClass*                                                ActivationInput;                                   // 0x270(0x8)
	class UClass*                                                ReleaseInput;                                      // 0x278(0x8)
	bool                                                         RequiresRaisedEffigy;                              // 0x280(0x1)
	char                                                         pad0x3_60ZWC[0x3];                                 // 0x281(0x3)
	float                                                        HoldDuration;                                      // 0x284(0x4)
	float                                                        SoulVFXReturnModifier;                             // 0x288(0x4)
	float                                                        SoulVFXClientPredictionModifier;                   // 0x28c(0x4)
	char                                                         pad0x18_HI353[0x18];                               // 0x290(0x18)
	class ParticleSystemComponent*                               ParticleSystem;                                    // 0x2a8(0x8)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class AssignItemStep: public TaleQuestStep
{
public:
	class AssignItemStepDesc*                                    StepDesc;                                          // 0x98(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StunnableInterface: public Interface
{
public:
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class MerchantQuestItemData: public DataAsset
{
public:
	class MerchantQuestItemPluralisationData*                    DisplayNameLookup;                                 // 0x28(0x8)
	struct RewardId                                              HandInOnTimeRewardId;                              // 0x30(0x8)
	class UClass*                                                CrateDesc;                                         // 0x38(0x8)
	TArray<struct MerchantQuestItemDescAndReward>                AcceptableAlternativeCrateItemData;                // 0x40(0x10)
	class Texture*                                               IconImage;                                         // 0x50(0x8)
	class UClass*                                                FaunaSpecies;                                      // 0x58(0x8)
	class UClass*                                                FaunaBreed;                                        // 0x60(0x8)
	class PopUpMessageDesc*                                      CrateFilledPopupDesc;                              // 0x68(0x8)
	bool                                                         IsOnlyFoundInWorld;                                // 0x70(0x1)
	char                                                         pad0x7_TJN5H[0x7];                                 // 0x71(0x7)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class RadialInventorySelectionXAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class StatusResponseSicknessInterrupt: public StatusResponse
{
public:
};


// Size 0xb98 (Full Size[0xbc0] - InheritedSize[0x28]
class WaterGunLiquidLauncherController: public Object
{
public:
	char                                                         pad0x8_C057P[0x8];                                 // 0x28(0x8)
	struct LiquidLauncherCollisionsParams                        LiquidLauncherCollisionParams;                     // 0x30(0x68)
	struct Status                                                LiquidLauncherCollisionStatusEffect;               // 0x98(0x20)
	float                                                        TimeUntilApplyStatusEffect;                        // 0xb8(0x4)
	float                                                        TimeToConsiderActorOutsideLiquid;                  // 0xbc(0x4)
	float                                                        LiquidLauncherCollisionDamageAmount;               // 0xc0(0x4)
	float                                                        DamagePerSecondInsideLiquid;                       // 0xc4(0x4)
	float                                                        GravityStrength;                                   // 0xc8(0x4)
	float                                                        GravityCurveStrength;                              // 0xcc(0x4)
	float                                                        LiquidLauncherGoopBurningTime;                     // 0xd0(0x4)
	float                                                        LiquidLauncherGoopBurningDrainPerSecond;           // 0xd4(0x4)
	class WaterGunWieldableItem*                                 WaterGun;                                          // 0xd8(0x8)
	char                                                         pad0xae0_75N2F[0xae0];                             // 0xe0(0xae0)
};


// Size 0x348 (Full Size[0x400] - InheritedSize[0xb8]
class GuildUIComponent: public ActorComponent
{
public:
	char                                                         pad0x2b8_G0SP0[0x2b8];                             // 0xb8(0x2b8)
	struct PlayerCompanyProgressCache                            GuildProgressCache;                                // 0x370(0x68)
	class GuildSettings*                                         GuildSettings;                                     // 0x3d8(0x8)
	char                                                         pad0x18_VWEEY[0x18];                               // 0x3e0(0x18)
	bool                                                         HasInitialCompanyProgressRequestBeenMade;          // 0x3f8(0x1)
	bool                                                         IsCompanyProgressRequestPending;                   // 0x3f8(0x1)
	bool                                                         ShouldCacheGuildReputation;                        // 0x3f8(0x1)
	bool                                                         IsPendingSentInvitesResponse;                      // 0x3f8(0x1)
	char                                                         pad0x7_631W1[0x7];                                 // 0x3f9(0x7)
};


// Size 0x160 (Full Size[0x500] - InheritedSize[0x3a0]
class ReapersChestAISpawnerService: public Actor
{
public:
	char                                                         pad0x50_7A0AB[0x50];                               // 0x3a0(0x50)
	class ReapersChestAISpawnerServiceParams*                    ServiceParams;                                     // 0x3f0(0x8)
	TArray<struct ReapersChestActiveChestData>                   ActiveChests;                                      // 0x3f8(0x10)
	TArray<struct Guid>                                          CrewsBlockedFromOpeningChests;                     // 0x408(0x10)
	class ReapersChestAISpawnerSettings*                         ReapersChestAISpawnerSettings;                     // 0x418(0x8)
	char                                                         pad0x18_R2ZKI[0x18];                               // 0x420(0x18)
	int                                                          MaxActiveChestsPerCrewCount;                       // 0x438(0x4)
	char                                                         pad0xbc_W6864[0xbc];                               // 0x43c(0xbc)
	float                                                        ReapersChestAIRegionCleanupDelayTimerValue;        // 0x4f8(0x4)
	char                                                         pad0x4_SJQH6[0x4];                                 // 0x4fc(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class KillableCharacterInterface: public Interface
{
public:
};


// Size 0x70 (Full Size[0xe0] - InheritedSize[0x70]
class BTService_DetermineRecoveryMethod: public BTService
{
public:
	float                                                        TimeToForgetAfterSuccessfulFlee;                   // 0x70(0x4)
	char                                                         pad0x4_FNH79[0x4];                                 // 0x74(0x4)
	class AthenaAICharacterController*                           CachedAICharacterController;                       // 0x78(0x8)
	char                                                         pad0x60_LYVJ8[0x60];                               // 0x80(0x60)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class SetHiddenOnKeyTakenStep: public TaleQuestStep
{
public:
	class SetHiddenOnKeyTakenStepDesc*                           StepDesc;                                          // 0x98(0x8)
};


// Size 0x20 (Full Size[0x2f0] - InheritedSize[0x2d0]
class AtmosphericPressureZoneComponent: public SceneComponent
{
public:
	char                                                         pad0x8_L0YCJ[0x8];                                 // 0x2d0(0x8)
	struct AtmosphericPressureZoneParameters                     PressureZoneParameters;                            // 0x2d8(0x14)
	char                                                         pad0x4_O5929[0x4];                                 // 0x2ec(0x4)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class AshenGarrisonAISpawnDataAsset: public DataAsset
{
public:
	class AIBountySpawner*                                       OnePlayerCrewBountySpawner;                        // 0x28(0x8)
	class AIBountySpawner*                                       TwoPlayerCrewBountySpawner;                        // 0x30(0x8)
	class AIBountySpawner*                                       ThreePlayerCrewBountySpawner;                      // 0x38(0x8)
	class AIBountySpawner*                                       FourPlayerCrewBountySpawner;                       // 0x40(0x8)
	struct FText                                                 SpawnedAITargetName;                               // 0x48(0x38)
	bool                                                         DespawnOnPhaseCompletion;                          // 0x80(0x1)
	char                                                         pad0x7_5TXLP[0x7];                                 // 0x81(0x7)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class BlueprintTelemetrySettings: public DeveloperSettings
{
public:
	bool                                                         ShouldExcludeNativeUFunctions;                     // 0x38(0x1)
	char                                                         pad0x7_WDS3E[0x7];                                 // 0x39(0x7)
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class PlayerPermissionsTestActor: public Actor
{
public:
	class PlayerPermissionsComponent*                            PlayerPermissionsComponent;                        // 0x3a0(0x8)
};


// Size 0x10 (Full Size[0xc0] - InheritedSize[0xb0]
class WaitForAshenLordPawnBaseStep: public WaitForSpawnedPawnBaseStep
{
public:
	class AshenLordEncounter*                                    AshenLordEncounter;                                // 0xb0(0x8)
	class Pawn*                                                  AshenLordPawn;                                     // 0xb8(0x8)
};


// Size 0x30 (Full Size[0x3d0] - InheritedSize[0x3a0]
class DamageableProjectileLauncherMechanism: public Actor
{
public:
	char                                                         pad0x8_PVYGB[0x8];                                 // 0x3a0(0x8)
	class SceneComponent*                                        Root;                                              // 0x3a8(0x8)
	class ProjectileLauncherMechanismSourceComponent*            ProjectileLauncher;                                // 0x3b0(0x8)
	class DamageableComponent*                                   DamageableComponent;                               // 0x3b8(0x8)
	char                                                         pad0x10_DRF3Q[0x10];                               // 0x3c0(0x10)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class NPCCustomAnimationDataAsset: public DataAsset
{
public:
	char                                                         pad0x8_0EGFR[0x8];                                 // 0x28(0x8)
	struct NPCCustomAnimationDataStructure                       NPCCustomAnimationData;                            // 0x30(0x38)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class TaleAggressiveGhostShipEncounterServiceDesc: public TaleQuestServiceDesc
{
public:
	class AggressiveGhostShipsEncounterParams*                   AggressiveGhostShipEncounterParams;                // 0x28(0x8)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TriggerCrewEnteredPortalTaleStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    Portal;                                            // 0x80(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RainZoneInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class LungeBeginAshenLordUnarmedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x30 (Full Size[0x3d0] - InheritedSize[0x3a0]
class ObstacleCourseBlackboard: public Actor
{
public:
	TArray<struct PlayerStateAndTopTime>                         PlayerStatesAndTopTimes;                           // 0x3a0(0x10)
	class ObstacleCourse*                                        ObstacleCourseActor;                               // 0x3b0(0x8)
	char                                                         pad0x18_514AT[0x18];                               // 0x3b8(0x18)
};


// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class RatManagerComponentDataAsset: public DataAsset
{
public:
	float                                                        TurnBlendInOutPercentage;                          // 0x28(0x4)
	int                                                          NumPseudoRandomValues;                             // 0x2c(0x4)
	int                                                          FixedSeed;                                         // 0x30(0x4)
	struct Vector                                                RatEmitterOffset;                                  // 0x34(0xc)
	class WwiseEvent*                                            StartRatSounds;                                    // 0x40(0x8)
	class WwiseEvent*                                            StopRatSounds;                                     // 0x48(0x8)
	class WwiseObjectPoolWrapper*                                AudioPool;                                         // 0x50(0x8)
	int                                                          MaxNumShipsToDisplayRatsOn;                        // 0x58(0x4)
	char                                                         pad0x4_IJ0NF[0x4];                                 // 0x5c(0x4)
	struct WeightedProbabilityRangeOfRanges                      RatScale;                                          // 0x60(0x30)
	TArray<struct RatManagerRatInfestationLevel>                 RatInfestationLevels;                              // 0x90(0x10)
};


// Size 0x38 (Full Size[0xf0] - InheritedSize[0xb8]
class PhasedActorComponent: public ActorComponent
{
public:
	char                                                         pad0x28_IHBJD[0x28];                               // 0xb8(0x28)
	class Actor*                                                 SpawnedMapActor;                                   // 0xe0(0x8)
	class PhasedClusterRoot*                                     ClusterRoot;                                       // 0xe8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class HitReactionDisableInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class PlayerGeneratedMapsContainerComponentDataAsset: public DataAsset
{
public:
	TArray<struct WorldRegionMapping>                            WorldRegionMappings;                               // 0x28(0x10)
	TArray<struct Name>                                          IslandsToExcludeFromTavernBoardDisplay;            // 0x38(0x10)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestReleaseContendedResourceStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableTaleResourceHandle                       ResourceHandle;                                    // 0x80(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LookAtInterface: public Interface
{
public:
};


// Size 0x120 (Full Size[0x148] - InheritedSize[0x28]
class DelayLoadService: public Object
{
public:
	char                                                         pad0x120_XBIG4[0x120];                             // 0x28(0x120)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class BodyTypeSpecificSequenceMap: public DataAsset
{
public:
	struct StringAssetReference                                  DefaultSequence;                                   // 0x28(0x10)
	struct StringAssetReference                                  LargeSequence;                                     // 0x38(0x10)
	struct StringAssetReference                                  ThinSequence;                                      // 0x48(0x10)
	struct StringAssetReference                                  UnfitSequence;                                     // 0x58(0x10)
	struct StringAssetReference                                  AthleticSequence;                                  // 0x68(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class IsUsingMountableSpotlightMechanismInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class NameplateSettings: public DeveloperSettings
{
public:
	char                                                         NameplateCollisionChannel;                         // 0x38(0x1)
	char                                                         pad0x7_VTXSJ[0x7];                                 // 0x39(0x7)
};


// Size 0x0 (Full Size[0x3a0] - InheritedSize[0x3a0]
class ShipEmbedToken: public Actor
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EquipClothingInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SprintActivationNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AshenLordEncounterServiceInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class PortalDesc: public DataAsset
{
public:
	class TunnelDesc*                                            TunnelDesc;                                        // 0x28(0x8)
	struct StringAssetReference                                  RequestedPortalInstance;                           // 0x30(0x10)
	char                                                         pad0x20_4QSS6[0x20];                               // 0x40(0x20)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OnBottomTransitionLadderActionStateId: public ActionStateId
{
public:
};


// Size 0x48 (Full Size[0x100] - InheritedSize[0xb8]
class WetnessComponent: public ActorComponent
{
public:
	struct Vector                                                MaxWaterLevel;                                     // 0xb8(0xc)
	struct Vector                                                MinWaterLevel;                                     // 0xc4(0xc)
	float                                                        DryingTime;                                        // 0xd0(0x4)
	float                                                        LastWaterLevel;                                    // 0xd4(0x4)
	float                                                        LastWetTime;                                       // 0xd8(0x4)
	float                                                        WaterLevel;                                        // 0xdc(0x4)
	struct Vector                                                Rep_WetData;                                       // 0xe0(0xc)
	char                                                         pad0x4_F5KGK[0x4];                                 // 0xec(0x4)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0xf0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GenericWorldMapMarkerInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LoginOptionsProviderInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MeshMemoryConstraintScoringInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AnimationMontageInterface: public Interface
{
public:
};


// Size 0x648 (Full Size[0x9e8] - InheritedSize[0x3a0]
class Mast: public Actor
{
public:
	char                                                         pad0x48_EXM1L[0x48];                               // 0x3a0(0x48)
	char                                                         MastType;                                          // 0x3e8(0x1)
	char                                                         pad0x7_CB0FU[0x7];                                 // 0x3e9(0x7)
	class MastAudioParams*                                       MastAudioParams;                                   // 0x3f0(0x8)
	class SceneComponent*                                        SceneRootComponent;                                // 0x3f8(0x8)
	class IntentCombinerComponent*                               AngleCombinerComponent;                            // 0x400(0x8)
	class IntentCombinerComponent*                               SailHoistIntentCombinerComponent;                  // 0x408(0x8)
	class IntentCombinerComponent*                               MastHoistIntentCombinerComponent;                  // 0x410(0x8)
	class SceneComponent*                                        MastMovingAttachComponent;                         // 0x418(0x8)
	class SceneComponent*                                        SailAnglePivotComponent;                           // 0x420(0x8)
	class ReplicatedShipPartCustomizationComponent*              CustomizationComponent;                            // 0x428(0x8)
	class RepairableComponent*                                   RepairableComponentFirst;                          // 0x430(0x8)
	class RepairableComponent*                                   RepairableComponentSecond;                         // 0x438(0x8)
	class RepairableComponent*                                   RepairableComponentThird;                          // 0x440(0x8)
	class ShipDamageableComponent*                               DamageableComponent;                               // 0x448(0x8)
	class MastFlammableComponent*                                MastFlammableComponent;                            // 0x450(0x8)
	float                                                        AngleBlend;                                        // 0x458(0x4)
	float                                                        LoweredBlend;                                      // 0x45c(0x4)
	float                                                        LoweringSpeed;                                     // 0x460(0x4)
	float                                                        RaisingSpeed;                                      // 0x464(0x4)
	float                                                        TurnSpeed;                                         // 0x468(0x4)
	float                                                        MaxTurnAngle;                                      // 0x46c(0x4)
	float                                                        SailOffsetFromMast;                                // 0x470(0x4)
	float                                                        SailWidth;                                         // 0x474(0x4)
	float                                                        SailHeight;                                        // 0x478(0x4)
	float                                                        SailStartOffset;                                   // 0x47c(0x4)
	struct Vector                                                LookAtPosLow;                                      // 0x480(0xc)
	struct Vector                                                LookAtPosHigh;                                     // 0x48c(0xc)
	class WwiseObjectPoolWrapper*                                SailAudioPool;                                     // 0x498(0x8)
	class WwiseEvent*                                            AmbientSailFlapsSfx;                               // 0x4a0(0x8)
	class WwiseEvent*                                            AmbientSailFlapsStopSfx;                           // 0x4a8(0x8)
	class WwiseEvent*                                            PerfectSailInflationOneShot;                       // 0x4b0(0x8)
	class WwiseEvent*                                            SailLostPerfectWindOneShot;                        // 0x4b8(0x8)
	struct FName                                                 InflationRTPC;                                     // 0x4c0(0x8)
	struct FName                                                 SailLengthRTPC;                                    // 0x4c8(0x8)
	float                                                        ClientSailBlendSpeed;                              // 0x4d0(0x4)
	char                                                         pad0x4_ZN8QZ[0x4];                                 // 0x4d4(0x4)
	TArray<class StaticMeshComponent*>                           YardArms;                                          // 0x4d8(0x10)
	struct FName                                                 TelemetryIdentifier;                               // 0x4e8(0x8)
	bool                                                         MastShouldBeFractured;                             // 0x4f0(0x1)
	char                                                         pad0x3_FC1LT[0x3];                                 // 0x4f1(0x3)
	struct MastCollisionProfiles                                 MastCollisionProfiles;                             // 0x4f4(0x28)
	char                                                         pad0x4_7J6D4[0x4];                                 // 0x51c(0x4)
	struct MastPhysicsComponents                                 MastPhysicsComponents;                             // 0x520(0x38)
	class StaticMesh*                                            MastIntactMesh;                                    // 0x558(0x8)
	class StaticMesh*                                            MastFractureMeshBottom;                            // 0x560(0x8)
	float                                                        MastFractureMeshBottomScale;                       // 0x568(0x4)
	float                                                        MastFractureMeshOriginalScale;                     // 0x56c(0x4)
	class StaticMesh*                                            MastFractureMeshTop;                               // 0x570(0x8)
	class ParticleSystem*                                        DamageParticleSystem;                              // 0x578(0x8)
	float                                                        HingeHeight;                                       // 0x580(0x4)
	float                                                        HingeDistanceFromCentre;                           // 0x584(0x4)
	float                                                        HingeDirectionAngle;                               // 0x588(0x4)
	float                                                        MaxFallAngle;                                      // 0x58c(0x4)
	float                                                        MastLiftingSpeed;                                  // 0x590(0x4)
	bool                                                         OverrideSailLengthWhenFalling;                     // 0x594(0x1)
	char                                                         pad0x3_QH58N[0x3];                                 // 0x595(0x3)
	float                                                        MaxFallenSailLength;                               // 0x598(0x4)
	float                                                        SailFoldingSpeed;                                  // 0x59c(0x4)
	bool                                                         OverrideSailAngleWhenFalling;                      // 0x5a0(0x1)
	char                                                         pad0x3_4BC8B[0x3];                                 // 0x5a1(0x3)
	float                                                        DesiredFallingSailAngle;                           // 0x5a4(0x4)
	float                                                        SailTwistingSpeed;                                 // 0x5a8(0x4)
	char                                                         pad0x4_E66H6[0x4];                                 // 0x5ac(0x4)
	class MastHinge*                                             Hinge;                                             // 0x5b0(0x8)
	struct WeightedProbabilityRangeOfRanges                      MastImpactForceToApplyToShip;                      // 0x5b8(0x30)
	float                                                        MastImpactForceModifierToApplyToKrakenWrappedShip; // 0x5e8(0x4)
	float                                                        MastImpactHeightLocation;                          // 0x5ec(0x4)
	class UClass*                                                CameraShake;                                       // 0x5f0(0x8)
	float                                                        CameraShakeInnerRadius;                            // 0x5f8(0x4)
	float                                                        CameraShakeOuterRadius;                            // 0x5fc(0x4)
	bool                                                         PreviewMastFallenPosition;                         // 0x600(0x1)
	char                                                         pad0x7_FY25M[0x7];                                 // 0x601(0x7)
	TArray<class RepairableComponent*>                           RepairableComponents;                              // 0x608(0x10)
	struct MastDamageAudioParams                                 DamageAudioParameters;                             // 0x618(0xb0)
	char                                                         pad0x8_PBK8M[0x8];                                 // 0x6c8(0x8)
	class TetherCustomisationComponent*                          TetherCustomisationComponent;                      // 0x6d0(0x8)
	char                                                         pad0xa0_X6GE5[0xa0];                               // 0x6d8(0xa0)
	TArray<class ChildActorComponent*>                           LinkedSails;                                       // 0x778(0x10)
	struct IntentPredictor                                       LengthIntentPredictor;                             // 0x788(0x1c)
	struct IntentPredictor                                       AngleIntentPredictor;                              // 0x7a4(0x1c)
	struct IntentPredictor                                       MastHoistIntentPredictor;                          // 0x7c0(0x1c)
	bool                                                         MastHoistingControlSchemeActive;                   // 0x7dc(0x1)
	char                                                         pad0x3_U6UQS[0x3];                                 // 0x7dd(0x3)
	struct ObjectMessagingHandle                                 SailGotPerfectWindEventHandle;                     // 0x7e0(0x58)
	struct ObjectMessagingHandle                                 SailLostPerfectWindEventHandle;                    // 0x838(0x58)
	struct ObjectMessagingHandle                                 MastRepairStoppedHandle;                           // 0x890(0x58)
	char                                                         pad0x10_RQQZY[0x10];                               // 0x8e8(0x10)
	struct WwiseEmitter                                          SailsAudioEmitter;                                 // 0x8f8(0x20)
	float                                                        ServerAngleRatio;                                  // 0x918(0x4)
	float                                                        ServerLoweredProportion;                           // 0x91c(0x4)
	char                                                         ForceBillowingState;                               // 0x920(0x1)
	char                                                         pad0x3_NBT7M[0x3];                                 // 0x921(0x3)
	float                                                        ServerMastFallingProportion;                       // 0x924(0x4)
	char                                                         pad0x1c_FMVDC[0x1c];                               // 0x928(0x1c)
	bool                                                         AllowedToFall;                                     // 0x944(0x1)
	bool                                                         PlayAudio;                                         // 0x945(0x1)
	char                                                         pad0x3a_84LUM[0x3a];                               // 0x946(0x3a)
	bool                                                         IsCursed;                                          // 0x980(0x1)
	char                                                         pad0x67_JLALD[0x67];                               // 0x981(0x67)
};


// Size 0x460 (Full Size[0x518] - InheritedSize[0xb8]
class NPCDialogComponent: public ActorComponent
{
public:
	char                                                         pad0x18_N9V41[0x18];                               // 0xb8(0x18)
	struct FText                                                 WelcomeMessage;                                    // 0xd0(0x38)
	class NPCDialogTreeData*                                     Data;                                              // 0x108(0x8)
	class NPCDialogTreeDataOptions*                              OverrideDialogData;                                // 0x110(0x8)
	class ScriptStruct*                                          DialogBlackboardSchema;                            // 0x118(0x8)
	class UClass*                                                InputID;                                           // 0x120(0x8)
	char                                                         ActionDisplayPriority;                             // 0x128(0x1)
	char                                                         pad0x7_MZTS3[0x7];                                 // 0x129(0x7)
	class WwiseObjectPoolWrapper*                                NpcDialoguePool;                                   // 0x130(0x8)
	class WwiseEvent*                                            NpcDialogueWelcome;                                // 0x138(0x8)
	class WwiseEvent*                                            NpcDialogueBridge;                                 // 0x140(0x8)
	class WwiseEvent*                                            NpcDialogueGoodbye;                                // 0x148(0x8)
	bool                                                         CreateInteractionRules;                            // 0x150(0x1)
	char                                                         pad0x3_092HV[0x3];                                 // 0x151(0x3)
	float                                                        DialogueInputFocusTimeout;                         // 0x154(0x4)
	struct FString                                               TelemetryKey;                                      // 0x158(0x10)
	TArray<struct MysteriousNotesCompletionEventsModelEntry>     NoteCompletionIdents;                              // 0x168(0x10)
	TArray<struct PlayerStat>                                    StatsToFireOnDialogStart;                          // 0x178(0x10)
	TArray<class Class*>                                         ConditionalStatsToFireOnDialogStart;               // 0x188(0x10)
	char                                                         pad0x240_P4KZR[0x240];                             // 0x198(0x240)
	float                                                        MaximumDistanceForContinuedInteraction;            // 0x3d8(0x4)
	char                                                         pad0x4_E8J0Q[0x4];                                 // 0x3dc(0x4)
	class Controller*                                            InteractingController;                             // 0x3e0(0x8)
	TArray<struct OverrideDialogOptionUsageCounter>              DialogOptionUsageCounters;                         // 0x3e8(0x10)
	TArray<char>                                                 DialogBlackboard;                                  // 0x3f8(0x10)
	char                                                         pad0x34_WSS9U[0x34];                               // 0x408(0x34)
	bool                                                         Disabled;                                          // 0x43c(0x1)
	char                                                         pad0x3_4GBFM[0x3];                                 // 0x43d(0x3)
	struct Guid                                                  CurrentInteractionSessionId;                       // 0x440(0x10)
	int                                                          ActiveOverrideDataIndex;                           // 0x450(0x4)
	char                                                         pad0x4_XAPI0[0x4];                                 // 0x454(0x4)
	class NPCDialogTreeData*                                     ActiveData;                                        // 0x458(0x8)
	TArray<class Actor*>                                         ActiveDialogueInteractorsOnServer;                 // 0x460(0x10)
	class UClass*                                                PreviousConversationInteractionType;               // 0x4c0(0x8)
	char                                                         pad0x50_U2RW6[0x50];                               // 0x4c8(0x50)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class AlliancePennantAsset: public DataAsset
{
public:
	TArray<struct AlliancePennantData>                           AlliancePennants;                                  // 0x28(0x10)
	TArray<struct ShipSizePartCustomizationNameData>             ShipAlliancePennantPartNames;                      // 0x38(0x10)
	struct StringAssetReference                                  EmptyPennantDesc;                                  // 0x48(0x10)
};


// Size 0x28 (Full Size[0xb8] - InheritedSize[0x90]
class BTDecorator_ActorWieldedItemClass: public BTDecorator_BlackboardBase
{
public:
	float                                                        Interval;                                          // 0x90(0x4)
	char                                                         pad0x4_KLDSP[0x4];                                 // 0x94(0x4)
	char                                                         pad0x20_M6WQW[0x20];                               // 0x98(0x20)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class KrakenShipWrappingTentacleAIAudioComponentParams: public DataAsset
{
public:
	class WwiseEvent*                                            PlayWrapping;                                      // 0x28(0x8)
	class WwiseEvent*                                            StopWrapping;                                      // 0x30(0x8)
	class WwiseEvent*                                            PlayWrappedLoop;                                   // 0x38(0x8)
	class WwiseEvent*                                            StopWrappedLoop;                                   // 0x40(0x8)
	class WwiseEvent*                                            PlayUnwrapping;                                    // 0x48(0x8)
	class WwiseEvent*                                            StopUnwrapping;                                    // 0x50(0x8)
};


// Size 0x108 (Full Size[0x188] - InheritedSize[0x80]
class SpawnRewardStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableItemSpawnDataType                        ItemSpawnData;                                     // 0x80(0x30)
	struct QuestVariableVector                                   SpawnLocationVector;                               // 0xb0(0x30)
	struct QuestVariableTransform                                SpawnLocationTransform;                            // 0xe0(0x38)
	struct QuestVariableActor                                    SpawnedActor;                                      // 0x118(0x30)
	bool                                                         Tracked;                                           // 0x148(0x1)
	bool                                                         TrackedProxy;                                      // 0x149(0x1)
	bool                                                         Critical;                                          // 0x14a(0x1)
	bool                                                         DropOnSpawn;                                       // 0x14b(0x1)
	char                                                         pad0x4_Q2PXY[0x4];                                 // 0x14c(0x4)
	struct FText                                                 FailureMessage;                                    // 0x150(0x38)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SeaFortsWorldDataInterface: public Interface
{
public:
};


// Size 0x2f0 (Full Size[0x730] - InheritedSize[0x440]
class NPCOnShipSimpleAnimInstance: public AnimInstance
{
public:
	class AnimSequenceBase*                                      Into;                                              // 0x440(0x8)
	class AnimSequenceBase*                                      Loop;                                              // 0x448(0x8)
	class AnimSequenceBase*                                      ActiveLoop;                                        // 0x450(0x8)
	class AnimSequenceBase*                                      Outof;                                             // 0x458(0x8)
	class AnimSequenceBase*                                      OutOfAlternate;                                    // 0x460(0x8)
	class CustomAnimationMontageDefinitionListingDataAsset*      CustomAnimationMontageDefinitionListingDataAsset;  // 0x468(0x8)
	class CustomAnimationMontageDefinitionListingDataAsset*      FacialCustomAnimationMontageDefinitionListingDataAsset; // 0x470(0x8)
	struct AnimationLookAt                                       LookAt;                                            // 0x478(0xa8)
	struct CustomAnimationMontageStateMachine                    MontageStateMachine;                               // 0x520(0xd8)
	struct CustomAnimationMontageStateMachine                    FacialMontageStateMachine;                         // 0x5f8(0xd8)
	class WeightedAnimSequenceLoadOnDemand*                      LoadOnDemandInactive;                              // 0x6d0(0x8)
	class WeightedAnimSequenceLoadOnDemand*                      LoadOnDemandActive;                                // 0x6d8(0x8)
	class WeightedAnimationLoadOnDemandDataAsset*                LoadOnDemandActiveData;                            // 0x6e0(0x8)
	class WeightedAnimationLoadOnDemandDataAsset*                LoadOnDemandInactiveData;                          // 0x6e8(0x8)
	bool                                                         ActiveUsesWeightedIdles;                           // 0x6f0(0x1)
	bool                                                         InactiveUsesWeightedIdles;                         // 0x6f1(0x1)
	bool                                                         UseActiveAnimSet;                                  // 0x6f2(0x1)
	bool                                                         LoopCompleted;                                     // 0x6f3(0x1)
	bool                                                         UseAlternateOutOf;                                 // 0x6f4(0x1)
	char                                                         pad0x3b_2EOKU[0x3b];                               // 0x6f5(0x3b)
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class BaseItemScoreProviderComponent: public ActorComponent
{
public:
	char                                                         pad0x8_3VQ1D[0x8];                                 // 0xb8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MeleeAttackClientResponseInterface: public Interface
{
public:
};


// Size 0x58 (Full Size[0xf0] - InheritedSize[0x98]
class WaitForTunnelOfTheDamnedMigrationTaleQuestStep: public TaleQuestStep
{
public:
	class WaitForTunnelOfTheDamnedMigrationTaleQuestStepDesc*    Desc;                                              // 0x98(0x8)
	char                                                         pad0x50_SZSTE[0x50];                               // 0xa0(0x50)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CustomInactivityDetectionInterface: public Interface
{
public:
};


// Size 0xe0 (Full Size[0x108] - InheritedSize[0x28]
class CargoRunCrateData: public DataAsset
{
public:
	TArray<struct Text>                                          DeliveryNoteDescriptions;                          // 0x28(0x10)
	TArray<struct Text>                                          DeliveryNoteDescriptionsNoDeadline;                // 0x38(0x10)
	TArray<struct Text>                                          DeliveryNoteDescriptionsLate;                      // 0x48(0x10)
	TArray<struct Text>                                          DeliveryNoteClose;                                 // 0x58(0x10)
	TArray<struct Text>                                          DeliveryNoteWelcome;                               // 0x68(0x10)
	TArray<struct Text>                                          DeliveryNoteWelcomeLate;                           // 0x78(0x10)
	bool                                                         ShowCareInstructions;                              // 0x88(0x1)
	char                                                         pad0x7_XNWEQ[0x7];                                 // 0x89(0x7)
	struct FText                                                 CareInstructionsText;                              // 0x90(0x38)
	struct FText                                                 CareInstructionsBackText;                          // 0xc8(0x38)
	float                                                        WashedUpMinDistanceToNPC;                          // 0x100(0x4)
	float                                                        WashedUpMaxDistanceToNPC;                          // 0x104(0x4)
};


// Size 0x98 (Full Size[0x150] - InheritedSize[0xb8]
class ShipInteractionHandlerComponent: public ActorComponent
{
public:
	TArray<class Class*>                                         CapstanTypes;                                      // 0xb8(0x10)
	TArray<class Class*>                                         WheelTypes;                                        // 0xc8(0x10)
	TArray<class Class*>                                         CannonPlayerLoadingInteractionPointTypes;          // 0xd8(0x10)
	TArray<class Class*>                                         CannonTypes;                                       // 0xe8(0x10)
	TArray<class Class*>                                         HarpoonTypes;                                      // 0xf8(0x10)
	TArray<class Class*>                                         LadderTypes;                                       // 0x108(0x10)
	TArray<class Class*>                                         SailAngleTypes;                                    // 0x118(0x10)
	TArray<class Class*>                                         SailLengthTypes;                                   // 0x128(0x10)
	TArray<class Class*>                                         BarrelTypes;                                       // 0x138(0x10)
	bool                                                         IsInteractionOnShipPartsEnabled;                   // 0x148(0x1)
	char                                                         pad0x7_FEFOQ[0x7];                                 // 0x149(0x7)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class SetVaultStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    Vault;                                             // 0x80(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AmmoBaseEffect: public Object
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class FishingRightStickYAnalogInputId: public AnalogInputId
{
public:
};


// Size 0xa0 (Full Size[0x440] - InheritedSize[0x3a0]
class ServiceStatusNotificationsService: public Actor
{
public:
	char                                                         pad0x8_Q1HFI[0x8];                                 // 0x3a0(0x8)
	TArray<struct ServiceStatusNotification>                     ActiveNotifications;                               // 0x3a8(0x10)
	char                                                         pad0x80_CU563[0x80];                               // 0x3b8(0x80)
	char                                                         pad0x8_VGYKX[0x8];                                 // 0x438(0x8)
};


// Size 0xa8 (Full Size[0x160] - InheritedSize[0xb8]
class LayerInContainerComponent: public ActorComponent
{
public:
	char                                                         pad0x8_ARGNK[0x8];                                 // 0xb8(0x8)
	struct Transform                                             MeshComponentRelativeTransform;                    // 0xc0(0x30)
	struct ComponentReference                                    MeshComponentAttachParent;                         // 0xf0(0x18)
	float                                                        FadeRate;                                          // 0x108(0x4)
	bool                                                         CanTake;                                           // 0x10c(0x1)
	char                                                         pad0x3_1NTZH[0x3];                                 // 0x10d(0x3)
	class LayerInContainerComponent*                             LayerBlockingTakingThisLayer;                      // 0x110(0x8)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0x118(0x10)
	char                                                         pad0x18_WHYA0[0x18];                               // 0x128(0x18)
	class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x140(0x8)
	bool                                                         Visible;                                           // 0x148(0x1)
	char                                                         pad0x7_7A4TW[0x7];                                 // 0x149(0x7)
	class StaticMesh*                                            LayerMesh;                                         // 0x150(0x8)
	char                                                         pad0x8_63EP4[0x8];                                 // 0x158(0x8)
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class CompassDirectionTaleQuestFunctionLibary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0xc0 (Full Size[0x140] - InheritedSize[0x80]
class ContestSelectIslandForItemStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableContestIslandArchetype                   IslandArchetype;                                   // 0x80(0x30)
	struct QuestVariableInt                                      NumberOfChests;                                    // 0xb0(0x30)
	struct QuestVariableNameArray                                PreviousIslands;                                   // 0xe0(0x30)
	struct QuestVariableNameArray                                SelectedIslands;                                   // 0x110(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OrbOfSecretsInterface: public Interface
{
public:
};


// Size 0x168 (Full Size[0x220] - InheritedSize[0xb8]
class DiggingComponent: public ActorComponent
{
public:
	char                                                         pad0x30_DLUOY[0x30];                               // 0xb8(0x30)
	class Actor*                                                 Discoverer;                                        // 0xe8(0x8)
	struct BuriedFactor                                          BuriedFactor;                                      // 0xf0(0x14)
	char                                                         State;                                             // 0x104(0x1)
	char                                                         pad0x3_9N1L5[0x3];                                 // 0x105(0x3)
	struct Vector                                                StartingLocation;                                  // 0x108(0xc)
	struct Rotator                                               StartingRotation;                                  // 0x114(0xc)
	class MaterialInstanceDynamic*                               ItemDynamicMaterial;                               // 0x120(0x8)
	struct ItemDiggingMergedConfig                               DiggingConfig;                                     // 0x128(0x28)
	class DiggingSettings*                                       DiggingSettings;                                   // 0x150(0x8)
	class WwiseObjectPoolWrapper*                                CachedSfxPool;                                     // 0x158(0x8)
	char                                                         pad0xc0_XG3MQ[0xc0];                               // 0x160(0xc0)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class MeshMemoryConstraintFallbackCollection: public DataAsset
{
public:
	int                                                          MaxScoringPerFrame;                                // 0x28(0x4)
	char                                                         pad0x4_M2WHA[0x4];                                 // 0x2c(0x4)
	TArray<float>                                                GlobalThresholdsMB;                                // 0x30(0x10)
	TArray<class MeshMemoryConstraintFallbackDataAsset*>         FallbackDataAssets;                                // 0x40(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BeingRetractedActionStateId: public ActionStateId
{
public:
};


// Size 0x1b8 (Full Size[0x270] - InheritedSize[0xb8]
class PirateSelector: public ActorComponent
{
public:
	TArray<class PosablePirate*>                                 QueuedPiratesToSpawn;                              // 0xb8(0x10)
	char                                                         pad0x1a8_J2EXF[0x1a8];                             // 0xc8(0x1a8)
};


// Size 0x270 (Full Size[0x328] - InheritedSize[0xb8]
class IslandEventTooltipComponent: public ActorComponent
{
public:
	char                                                         pad0x10_9Z6MU[0x10];                               // 0xb8(0x10)
	TArray<struct IslandEventTooltipData>                        CachedTooltipData;                                 // 0xc8(0x10)
	struct Vector2D                                              TooltipOffsetRatio;                                // 0xd8(0x8)
	float                                                        FadeDuration;                                      // 0xe0(0x4)
	char                                                         pad0x4_E7S7V[0x4];                                 // 0xe4(0x4)
	struct FText                                                 ShowTooltipText;                                   // 0xe8(0x38)
	struct FText                                                 HideTooltipText;                                   // 0x120(0x38)
	char                                                         pad0x1d0_XN2YF[0x1d0];                             // 0x158(0x1d0)
};


// Size 0xe8 (Full Size[0x110] - InheritedSize[0x28]
class ContendedResourceService: public Object
{
public:
	char                                                         pad0x10_T7G9V[0x10];                               // 0x28(0x10)
	class World*                                                 World;                                             // 0x38(0x8)
	char                                                         pad0xd0_QRNFE[0xd0];                               // 0x40(0xd0)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class NPCDialogConditional: public Object
{
public:
	bool                                                         ConditionalExpected;                               // 0x28(0x1)
	char                                                         pad0x7_9KSY6[0x7];                                 // 0x29(0x7)
};


// Size 0x30 (Full Size[0x3d0] - InheritedSize[0x3a0]
class ProjectileCooldownService: public Actor
{
public:
	char                                                         pad0x28_AWPQ7[0x28];                               // 0x3a0(0x28)
	class ProjectileCooldownServiceSettings*                     ProjectileCooldownSettings;                        // 0x3c8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MechanismAnimationDurationProviderInterface: public Interface
{
public:
};


// Size 0x158 (Full Size[0x210] - InheritedSize[0xb8]
class BootyItemBuryHistoryComponent: public ActorComponent
{
public:
	char                                                         pad0x158_V4E7V[0x158];                             // 0xb8(0x158)
};


// Size 0x60 (Full Size[0x118] - InheritedSize[0xb8]
class HealthRegenerationPoolComponent: public ActorComponent
{
public:
	char                                                         pad0x8_MG2QD[0x8];                                 // 0xb8(0x8)
	float                                                        MaxCapacity;                                       // 0xc0(0x4)
	float                                                        HealingRate;                                       // 0xc4(0x4)
	float                                                        HealingDelayWhenDamaged;                           // 0xc8(0x4)
	char                                                         pad0x4_06MYQ[0x4];                                 // 0xcc(0x4)
	double                                                       UIUpdateThrottleMs;                                // 0xd0(0x8)
	char                                                         pad0x38_Z6RNP[0x38];                               // 0xd8(0x38)
	struct HealthRegenState                                      RegenerationState;                                 // 0x110(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AshenLordsAIDioramaCategory: public AIDioramaCategory
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NPCDialogInteractionInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CanPlayEnsembleWithAnotherCrewInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
