#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x8
struct NumCrewsPercentageModel
{
public:
	uint32                                                       NumCrews;                                          // 0x0(0x4)
	float                                                        Percentage;                                        // 0x4(0x4)
};


// Size 0x10
struct SpecificEntitlementsRequestModel
{
public:
	TArray<String>                                               EntitlementIds;                                    // 0x0(0x10)
};


// Size 0x28
struct HoleItemToSpawn
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	class UClass*                                                ItemDesc;                                          // 0x8(0x8)
	TArray<char>                                                 RestrictToSurface;                                 // 0x10(0x10)
	struct FName                                                 FeatureFlag;                                       // 0x20(0x8)
};


// Size 0x8
struct ShipTrackerSnapshot
{
public:
	int                                                          ShipId;                                            // 0x0(0x4)
	char                                                         Region;                                            // 0x4(0x1)
};


// Size 0x30
struct EventShipCurseFXEnd
{
public:
	struct                                                       CurseFXData;                                       // 0x0(0x30)
};


// Size 0x10
struct PlayerReleasedFromBrig
{
public:
	struct FString                                               PlayerName;                                        // 0x0(0x10)
};


// Size 0x4
struct EventGhostShipLevelLoaded
{
public:
	int                                                          LevelId;                                           // 0x0(0x4)
};


// Size 0x10
struct LoadoutRepairSuccessTelemetryEvent
{
public:
	int                                                          CarouselSeed;                                      // 0x4(0x4)
	int                                                          NumAppliedDescs;                                   // 0x8(0x4)
	int                                                          NumMissingCategories;                              // 0xc(0x4)
};


// Size 0xc
struct EventUserGameSettingsBooleanChanged
{
public:
	struct FName                                                 KeyName;                                           // 0x0(0x8)
	bool                                                         Value;                                             // 0x8(0x1)
};


// Size 0x110
struct ShipMilestoneCompletionEvent
{
public:
	struct                                                       Pirate;                                            // 0x0(0x78)
	struct                                                       AlignmentId;                                       // 0x78(0x10)
	struct                                                       GoalId;                                            // 0x88(0x10)
	struct                                                       ScheduleId;                                        // 0x98(0x10)
	struct                                                       ProgressId;                                        // 0xa8(0x24)
	uint64                                                       Progress;                                          // 0xd0(0x8)
	uint64                                                       Alignment;                                         // 0xd8(0x8)
	uint64                                                       Level;                                             // 0xe0(0x8)
	struct                                                       CompletedAt;                                       // 0xe8(0x8)
	struct FString                                               ShipId;                                            // 0xf0(0x10)
	struct FString                                               AlignmentKey;                                      // 0x100(0x10)
};


// Size 0x18
struct CrewMutePlayerPhrasesEvent
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
	bool                                                         IsMuted;                                           // 0x10(0x1)
};


// Size 0x88
struct GuildData
{
public:
	struct FString                                               GuildId;                                           // 0x0(0x10)
	struct                                                       GuildBranding;                                     // 0x10(0x50)
	int                                                          NumberOfMembers;                                   // 0x60(0x4)
	int                                                          NumberOfShips;                                     // 0x64(0x4)
	int                                                          LedgerPosition;                                    // 0x68(0x4)
	int                                                          DistinctionLevel;                                  // 0x6c(0x4)
	float                                                        Level;                                             // 0x70(0x4)
	struct FString                                               GuildOwnerUserId;                                  // 0x78(0x10)
};


// Size 0x3c
struct TreasureMapWidgetText
{
public:
	float                                                        Scale;                                             // 0x1c(0x4)
	bool                                                         CutoutTextStyle;                                   // 0x20(0x1)
	bool                                                         ShouldStrikethroughOnStart;                        // 0x21(0x1)
	float                                                        StrikethroughThickness;                            // 0x24(0x4)
	float                                                        StrikethroughOffset;                               // 0x28(0x4)
	struct                                                       StrikethroughColor;                                // 0x2c(0x10)
};


// Size 0x80
struct PremiumCatalogLandingPageTab
{
public:
	struct                                                       Id;                                                // 0x0(0x10)
	struct FText                                                 DisplayName;                                       // 0x10(0x38)
	TArray<class PremiumCatalogLandingPageItemDataAsset*>        Children;                                          // 0x48(0x10)
	struct FName                                                 FeatureToggle;                                     // 0x58(0x8)
	struct FName                                                 InverseFeatureToggle;                              // 0x60(0x8)
	struct FName                                                 IncludeForPromotion;                               // 0x68(0x8)
	struct FName                                                 ExcludeFromPromotion;                              // 0x70(0x8)
	bool                                                         RealMoneyOnly;                                     // 0x78(0x1)
};


// Size 0x20
struct MessageInABottlePremadeVoyageEntry
{
public:
	struct                                                       FeatureFlag;                                       // 0x0(0xc)
	TArray<class VoyageDescDataAsset*>                           PremadeVoyages;                                    // 0x10(0x10)
};


// Size 0xc
struct MountpointWaterLevelParams
{
public:
	float                                                        WaterLevelDifferenceBetweenUpdates;                // 0x0(0x4)
	float                                                        ZOffsetFromWaterToDisableMountpoint;               // 0x4(0x4)
};


// Size 0x10
struct LoadableComponentState
{
public:
	char                                                         LoadableState;                                     // 0x0(0x1)
	class Object*                                                LoadedItem;                                        // 0x8(0x8)
};


// Size 0x10
struct ReapersMarkTrackedBootyItemInfo
{
public:
	struct                                                       ItemLocation;                                      // 0x0(0xc)
	char                                                         ItemType;                                          // 0xc(0x1)
};


// Size 0x20
struct PlayerXpGrantedTelemetryEvent
{
public:
	uint64                                                       XpAmount;                                          // 0x0(0x8)
	struct FName                                                 CompanyId;                                         // 0x8(0x8)
	struct                                                       BootyId;                                           // 0x10(0x10)
};


// Size 0xc
struct TrinketIconMaterialParamOverride
{
public:
	struct FName                                                 ParameterName;                                     // 0x0(0x8)
	float                                                        ParameterValue;                                    // 0x8(0x4)
};


// Size 0x3
struct CutsceneTriggerEditorOnlyData
{
public:
	bool                                                         AlwaysShowCutsceneName;                            // 0x0(0x1)
	bool                                                         AlwaysShowShapeComponentOutlines;                  // 0x1(0x1)
	bool                                                         PrintStateChangesToScreen;                         // 0x2(0x1)
};


// Size 0x10
struct AudioStingRelevantShips
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	bool                                                         IsAIShip;                                          // 0x8(0x1)
	bool                                                         IsEmissary;                                        // 0x9(0x1)
	bool                                                         IsCaptainedShip;                                   // 0xa(0x1)
};


// Size 0x28
struct AllowedInteractableTypes
{
public:
	assetclass                                                   ActorType;                                         // 0x0(0x20)
	struct                                                       CollisionProfileName;                              // 0x20(0x8)
};


// Size 0x18
struct DeepSeaRegionAmbienceAudio
{
public:
	class WwiseEvent*                                            PlayerInDeepSeaStart;                              // 0x0(0x8)
	class WwiseEvent*                                            PlayerInDeepSeaStop;                               // 0x8(0x8)
	bool                                                         OnlyPostMoodMusicEventsWhenSubmerged;              // 0x10(0x1)
};


// Size 0x178
struct ProjectileHitEvent
{
public:
	struct                                                       DamageEvent;                                       // 0x0(0x58)
	struct                                                       HitResult;                                         // 0x58(0x80)
	class UClass*                                                ProjectileId;                                      // 0xd8(0x8)
	struct                                                       Effects;                                           // 0xe0(0x68)
	struct                                                       InitialPosition;                                   // 0x148(0xc)
	struct                                                       TelemetryAttackId;                                 // 0x154(0x10)
	TArray<struct Vector>                                        TrailData;                                         // 0x168(0x10)
};


// Size 0x28
struct ItemDiggingMergedConfig
{
public:
	class ItemDiggingBaseConfig*                                 BaseConfig;                                        // 0x0(0x8)
	class ItemDiggingAnimationConfig*                            AnimationConfig;                                   // 0x8(0x8)
	class ItemDiggingEffectsConfig*                              EffectsConfig;                                     // 0x10(0x8)
	class ItemDiggingAudioConfig*                                AudioConfig;                                       // 0x18(0x8)
	class ItemDiggingBuryConfig*                                 BuryingConfig;                                     // 0x20(0x8)
};


// Size 0x30
struct MermaidStatueSpawnTelemetryEvent
{
public:
	struct FString                                               LocationName;                                      // 0x0(0x10)
	struct FString                                               MermaidStatueId;                                   // 0x10(0x10)
	struct FString                                               MermaidStatueClass;                                // 0x20(0x10)
};


// Size 0x8
struct VisualFeedbackEntry
{
public:
	class EffectBlendObjectBase*                                 Effect;                                            // 0x0(0x8)
};


// Size 0x8
struct AddWaterToVaultGameServerRequestModel
{
public:
	int                                                          ActorId;                                           // 0x0(0x4)
	float                                                        WaterAmount;                                       // 0x4(0x4)
};


// Size 0x20
struct GetItemsInRadiusGameServerRequestModel
{
public:
	struct FString                                               ItemName;                                          // 0x10(0x10)
};


// Size 0x20
struct ItemSnapshotOwnerDestroyed
{
public:
	struct                                                       SnapshotID;                                        // 0x0(0x10)
	interface                                                    CurrentInstigator;                                 // 0x10(0x10)
};


// Size 0x18
struct ContestMatchmakingLocationsResponseModel
{
public:
	TArray<String>                                               Locations;                                         // 0x0(0x10)
	int                                                          MaxHops;                                           // 0x10(0x4)
};


// Size 0x8
struct PurchaseConfigurationSettings
{
public:
	float                                                        BackOffTimeInSeconds;                              // 0x0(0x4)
	float                                                        BackOffTimeGain;                                   // 0x4(0x4)
};


// Size 0xb0
struct RewardGrantedNetworkEvent
{
public:
	struct FString                                               RewardId;                                          // 0x18(0x10)
	char                                                         CurrencyId;                                        // 0x28(0x1)
	uint32                                                       CurrencyAmount;                                    // 0x2c(0x4)
	struct FString                                               CompanyId;                                         // 0x30(0x10)
	uint32                                                       Xp;                                                // 0x40(0x4)
	uint32                                                       NumLevels;                                         // 0x44(0x4)
	TArray<String>                                               Entitlements;                                      // 0x48(0x10)
	struct FString                                               DeferralReason;                                    // 0x58(0x10)
	struct FString                                               ShipName;                                          // 0x68(0x10)
	struct FText                                                 ScrambledShipName;                                 // 0x78(0x38)
};


// Size 0x40
struct AmmoChangeEffectParams
{
public:
	float                                                        InputRangeMin;                                     // 0x0(0x4)
	float                                                        InputRangeMax;                                     // 0x4(0x4)
	float                                                        OutputRangeMin;                                    // 0x8(0x4)
	float                                                        OutputRangeMax;                                    // 0xc(0x4)
	float                                                        OutputRangeThreshold;                              // 0x10(0x4)
	bool                                                         UseThresholdValueAsNewOutputRangeMax;              // 0x14(0x1)
	class CurveFloat*                                            LerpSpeedCurve;                                    // 0x18(0x8)
	struct                                                       ScalarParameterValue;                              // 0x20(0x1c)
};


// Size 0x10
struct EventShipEnteredSafeZone
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
};


// Size 0x28
struct MatineeActorSetPositionNetworkEvent
{
public:
	class MatineeActor*                                          MatineeActor;                                      // 0x18(0x8)
	float                                                        InterpolationPosition;                             // 0x20(0x4)
	bool                                                         Jump;                                              // 0x24(0x1)
};


// Size 0x10
struct NarrationRequestEvent
{
public:
	struct FString                                               Text;                                              // 0x0(0x10)
};


// Size 0x4
struct EventCurseChangeSailHeight
{
public:
	float                                                        Duration;                                          // 0x0(0x4)
};


// Size 0x20
struct EventRecieveWaterGunState
{
public:
	float                                                        TransferedAmmo;                                    // 0x0(0x4)
	float                                                        TransferedPressure;                                // 0x4(0x4)
	float                                                        TransferedLiquidLevel;                             // 0x8(0x4)
	float                                                        TransferedFoamLevel;                               // 0xc(0x4)
	float                                                        TransferedFizzSpeed;                               // 0x10(0x4)
	float                                                        TransferedWobbleSpeed;                             // 0x14(0x4)
	float                                                        TransferedLiquidLevelMin;                          // 0x18(0x4)
	float                                                        TransferedLiquidLevelMax;                          // 0x1c(0x4)
};


// Size 0x18
struct AchievementSailCloseToShipWithoutFiring
{
public:
	float                                                        RangeToRemainWithinInMetres;                       // 0x0(0x4)
	float                                                        DistanceToTravelInMetres;                          // 0x4(0x4)
};


// Size 0x28
struct AthenaAnimationSkeletonCurseAnimations
{
public:
	class AnimSequence*                                          SkeletonDrunk;                                     // 0x0(0x8)
	class AnimSequence*                                          SkeletonDance;                                     // 0x8(0x8)
	class AnimSequence*                                          SkeletonSleepInto;                                 // 0x10(0x8)
	class AnimSequence*                                          SkeletonSleepLoop;                                 // 0x18(0x8)
	class AnimSequence*                                          SkeletonSleepOut;                                  // 0x20(0x8)
};


// Size 0x18
struct GetSkeletonThronesGameServerResponseModel
{
public:
	TArray<struct SkeletonThroneStateData>                       Data;                                              // 0x8(0x10)
};


// Size 0x14
struct CapstanParams
{
public:
	float                                                        MaxVelocityPerPlayer;                              // 0x0(0x4)
	float                                                        MaxFreeLoweringVelocity;                           // 0x4(0x4)
	float                                                        MaxError;                                          // 0x8(0x4)
	float                                                        CorrectiveForceMultiplier;                         // 0xc(0x4)
	float                                                        PlayerAnimationOnCapstanMultiplier;                // 0x10(0x4)
};


// Size 0x20
struct StorableLockState
{
public:
	bool                                                         Locked;                                            // 0x0(0x1)
	TArray<struct StringAssetReference>                          AcceptableKeys;                                    // 0x8(0x10)
	bool                                                         IsInUnlockingSequence;                             // 0x18(0x1)
};


// Size 0x10
struct EventCompanyReputationCampaignDetailRequest
{
public:
	struct FString                                               CampaignId;                                        // 0x0(0x10)
};


// Size 0x8
struct RequestCreatePiratePreviewEvent
{
public:
	int                                                          ResolutionX;                                       // 0x0(0x4)
	int                                                          ResolutionY;                                       // 0x4(0x4)
};


// Size 0x90
struct PenaltyRequestEvent
{
public:
	struct                                                       RequestID;                                         // 0x0(0x10)
	struct                                                       PirateIdentity;                                    // 0x10(0x78)
	struct FName                                                 PenaltyId;                                         // 0x88(0x8)
};


// Size 0x1c
struct CustomWreckEntry
{
public:
	struct                                                       OwningCrewID;                                      // 0x0(0x10)
	class CustomShipwreck*                                       WreckObject;                                       // 0x10(0x8)
	bool                                                         WreckExpired;                                      // 0x18(0x1)
};


// Size 0x1
struct ConsumeEntitlementRequestFailedTelemetryEvent
{
public:
	char                                                         Reason;                                            // 0x0(0x1)
};


// Size 0x8
struct DigRequestInformation
{
public:
	class WwiseEvent*                                            RevealSFX;                                         // 0x0(0x8)
};


// Size 0x28
struct AppearMaterialParams
{
public:
	struct FName                                                 ParameterName;                                     // 0x0(0x8)
	class CurveFloat*                                            AppearCurveAsset;                                  // 0x8(0x8)
	class CurveFloat*                                            DisppearCurveAsset;                                // 0x10(0x8)
};


// Size 0x3
struct ServerUserGameSettings
{
public:
	bool                                                         ScrambleGamertagOnShipAnnouncementBanner;          // 0x0(0x1)
	bool                                                         ScrambleShipNameOnOtherClients;                    // 0x1(0x1)
	bool                                                         ScrambleGuildNameOnOtherClients;                   // 0x2(0x1)
};


// Size 0x40
struct EventNPCChatUINotification
{
public:
	struct                                                       NpcMessage;                                        // 0x0(0x40)
};


// Size 0x4
struct SetTimeGameServerRequestModel
{
public:
	int                                                          Hours;                                             // 0x0(0x4)
};


// Size 0xa8
struct AthenaAnimationObjectActionContinuousStruct
{
public:
	class AnimSequence*                                          MainInto;                                          // 0x0(0x8)
	class BlendSpace*                                            MainIntoLocomotion;                                // 0x8(0x8)
	class AnimSequence*                                          OneShotInto;                                       // 0x10(0x8)
	class AnimSequence*                                          MainCycleIdle;                                     // 0x18(0x8)
	class BlendSpace*                                            MainCycleLocomotion;                               // 0x20(0x8)
	bool                                                         UseMainCycleJump;                                  // 0x28(0x1)
	struct                                                       MainCycleJump;                                     // 0x30(0x20)
	class AnimSequence*                                          MainOutOf;                                         // 0x50(0x8)
	class BlendSpace*                                            MainOutOfLocomotion;                               // 0x58(0x8)
	struct                                                       MainSwimming;                                      // 0x60(0x20)
	struct                                                       TurningLeftAlt;                                    // 0x80(0x8)
	struct                                                       TurningRightAlt;                                   // 0x88(0x8)
	class AnimSequence*                                          TurnOutAlt;                                        // 0x90(0x8)
	bool                                                         IgnoreOverlayHandAdditiveForAction;                // 0x98(0x1)
	class AnimSequence*                                          CustomAdditiveForAction;                           // 0xa0(0x8)
};


// Size 0x20
struct WheelArmIKDownWithinRange
{
public:
	float                                                        LeftArmDownRangeAMin;                              // 0x0(0x4)
	float                                                        LeftArmDownRangeAMax;                              // 0x4(0x4)
	float                                                        LeftArmDownRangeBMin;                              // 0x8(0x4)
	float                                                        LeftArmDownRangeBMax;                              // 0xc(0x4)
	float                                                        RightArmDownRangeAMin;                             // 0x10(0x4)
	float                                                        RightArmDownRangeAMax;                             // 0x14(0x4)
	float                                                        RightArmDownRangeBMin;                             // 0x18(0x4)
	float                                                        RightArmDownRangeBMax;                             // 0x1c(0x4)
};


// Size 0x20
struct SeaOfThievesOnDemandTreasurePopupConversionPair
{
public:
	struct                                                       From;                                              // 0x0(0x10)
	struct                                                       To;                                                // 0x10(0x10)
};


// Size 0x30
struct AthenaAnimationControllableFacialAnimData
{
public:
	class BlendSpace1D*                                          Capstan;                                           // 0x0(0x8)
	class AnimSequence*                                          SailAction;                                        // 0x8(0x8)
	class AnimSequence*                                          SailIdle;                                          // 0x10(0x8)
	class AnimSequence*                                          CannonFire;                                        // 0x18(0x8)
	class AnimSequence*                                          CannonAim;                                         // 0x20(0x8)
	class AnimSequence*                                          HarpoonFire;                                       // 0x28(0x8)
};


// Size 0x8
struct UpdateSnapshotVersionData
{
public:
	struct FName                                                 Version;                                           // 0x0(0x8)
};


// Size 0xaf0
struct RenderingTelemetryFragment
{
public:
	struct                                                       StreamedTexturePoolGroupsMemorySummary;            // 0x0(0x28)
	struct                                                       UnstreamedTexturePoolGroupsMemorySummary;          // 0x578(0x28)
};


// Size 0x10
struct NextOfferRequestModel
{
public:
	struct FString                                               OfferId;                                           // 0x0(0x10)
};


// Size 0x18
struct RequiredShipCustomizationData
{
public:
	int                                                          RequiredNumberToMatch;                             // 0x0(0x4)
	TArray<class Class*>                                         RequiredShipCustomizations;                        // 0x8(0x10)
};


// Size 0x4
struct InventoryInteractionTakeRequestEvent
{
public:
	int                                                          Index;                                             // 0x0(0x4)
};


// Size 0x28
struct PlayerItemRetrievalFromContainerTelemetryEvent
{
public:
	struct FString                                               ContainerId;                                       // 0x0(0x10)
	struct FString                                               ItemType;                                          // 0x10(0x10)
	int                                                          NumberOfItemsRemainingInContainer;                 // 0x20(0x4)
};


// Size 0x1
struct EventExposedToRainChanged
{
public:
	bool                                                         IsExposedToRain;                                   // 0x0(0x1)
};


// Size 0x68
struct AthenaAnimationSinkingTunnel
{
public:
	struct                                                       SinkingAnimData;                                   // 0x0(0x8)
	bool                                                         Activated;                                         // 0x8(0x1)
	class AthenaAnimationSinkingTunnelDataAsset*                 DrowningAnimationsDataAsset;                       // 0x10(0x8)
};


// Size 0x10
struct PlayerNewLevelEvent
{
public:
	uint32                                                       NewLevel;                                          // 0x0(0x4)
	uint32                                                       PreviousLevel;                                     // 0x4(0x4)
	struct FName                                                 CompanyId;                                         // 0x8(0x8)
};


// Size 0x1
struct CutsceneStateChangedEvent
{
public:
	char                                                         NewState;                                          // 0x0(0x1)
};


// Size 0x98
struct SleepingActionStateConstructionInfo
{
public:
	struct                                                       SleepingActionStateParams;                         // 0x48(0x50)
};


// Size 0x10
struct InventoryInteractionStowRequestEvent
{
public:
	struct FString                                               ItemDesc;                                          // 0x0(0x10)
};


// Size 0x70
struct HullDamageNamedParamSet
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	struct                                                       Params;                                            // 0x10(0x60)
};


// Size 0x10
struct PetRoamingAnimationStateDefinitionWeightedDataAsset
{
public:
	class PetRoamingAnimationStateDefinitionDataAsset*           AnimationDefinitionData;                           // 0x0(0x8)
	float                                                        Weighting;                                         // 0x8(0x4)
};


// Size 0x4
struct AdvanceGameEventSchedulerGameServerRequestModel
{
public:
	int                                                          Seconds;                                           // 0x0(0x4)
};


// Size 0x20
struct UISetAudioSwitchEvent
{
public:
	struct FString                                               SwitchGroup;                                       // 0x0(0x10)
	struct FString                                               SwitchValue;                                       // 0x10(0x10)
};


// Size 0x4
struct ActorDeactivationStarted
{
public:
	float                                                        DeactivationDuration;                              // 0x0(0x4)
};


// Size 0x118
struct OrbOfSecretsActionRuleVerbiage
{
public:
	struct FText                                                 PickUpOrbOfSecretsVerbiage;                        // 0x0(0x38)
	struct FText                                                 OrbOfSecretsIsProtectedVerbiage;                   // 0x38(0x38)
	struct FText                                                 PrepareTempleRitualVerbiage;                       // 0x70(0x38)
	struct FText                                                 CompleteTempleRitualVerbiage;                      // 0xa8(0x38)
	struct FText                                                 ProtectOrbOfSecretsVerbiage;                       // 0xe0(0x38)
};


// Size 0x18
struct RatManagerPseudoRandomEntry
{
public:
	double                                                       TimeBoundary;                                      // 0x0(0x8)
	float                                                        RatSpeed;                                          // 0x8(0x4)
	float                                                        RatScale;                                          // 0xc(0x4)
	struct FName                                                 LocationName;                                      // 0x10(0x8)
};


// Size 0x20
struct ChargeRequest
{
public:
	class Actor*                                                 Instigator;                                        // 0x0(0x8)
	struct                                                       TelemetryChargeId;                                 // 0x8(0x10)
	struct                                                       TimeStamp;                                         // 0x18(0x8)
};


// Size 0x18
struct InputSequencePair
{
public:
	class UClass*                                                InputID;                                           // 0x0(0x8)
	char                                                         Variant;                                           // 0x8(0x1)
	class AnimMontage*                                           Sequence;                                          // 0x10(0x8)
};


// Size 0x8
struct MeleeWeaponMovementSpeedPair
{
public:
	char                                                         Label;                                             // 0x0(0x1)
	float                                                        SpeedScalar;                                       // 0x4(0x4)
};


// Size 0x1
struct EventGuildNameTextboxFocusRequest
{
public:
	bool                                                         ShouldFocusGuildNameTextbox;                       // 0x0(0x1)
};


// Size 0x20
struct AthenaAnimationObjectJumpingAnimations
{
public:
	class BlendSpace*                                            Start;                                             // 0x0(0x8)
	class BlendSpace*                                            Cycle;                                             // 0x8(0x8)
	class BlendSpace*                                            PreImpact;                                         // 0x10(0x8)
	class BlendSpace*                                            LandLight;                                         // 0x18(0x8)
};


// Size 0xc
struct GetActorsInRadiusGameServerRequestModel
{
public:
	struct                                                       Position;                                          // 0x0(0x8)
	float                                                        Radius;                                            // 0x8(0x4)
};


// Size 0x10
struct BountyQuestLayoutOption
{
public:
	int                                                          NumCaptains;                                       // 0x0(0x4)
	int                                                          NumCrew;                                           // 0x4(0x4)
	class BountyMapLayout*                                       Layout;                                            // 0x8(0x8)
};


// Size 0x1
struct EventInGameBlurRequest
{
public:
	bool                                                         ShouldBlurGame;                                    // 0x0(0x1)
};


// Size 0x20
struct OnlinePermissionsRequestData
{
public:
	struct                                                       PlayerUserId;                                      // 0x0(0x18)
	uint32                                                       PermissionMask;                                    // 0x18(0x4)
};


// Size 0x30
struct WaterModifierDrowningParams
{
public:
	struct                                                       BlendableDrowningParams;                           // 0x0(0x28)
};


// Size 0x18
struct SplineTransitionLadderActionFinishedMessage
{
public:
	float                                                        TimeCompleted;                                     // 0x10(0x4)
};


// Size 0x4
struct ActorActivationStarted
{
public:
	float                                                        ActivationDuration;                                // 0x0(0x4)
};


// Size 0x40
struct ThrowGrenadeRpc
{
public:
	struct                                                       RelativeLocalThrowLocation;                        // 0x18(0xc)
	struct                                                       LocalLaunchAngle;                                  // 0x24(0xc)
	float                                                        LocalLaunchSpeed;                                  // 0x30(0x4)
	struct                                                       LocalWielderVelocity;                              // 0x34(0xc)
};


// Size 0xf8
struct ShipMilestoneProgressionMessage
{
public:
	struct                                                       Pirate;                                            // 0x0(0x78)
	struct                                                       AlignmentId;                                       // 0x78(0x10)
	struct                                                       GoalId;                                            // 0x88(0x10)
	struct                                                       ScheduleId;                                        // 0x98(0x10)
	struct                                                       ProgressId;                                        // 0xa8(0x24)
	uint64                                                       ProgressChange;                                    // 0xd0(0x8)
	uint64                                                       CurrentLevel;                                      // 0xd8(0x8)
	struct                                                       UpdatedAt;                                         // 0xe0(0x8)
	struct FString                                               ShipId;                                            // 0xe8(0x10)
};


// Size 0x58
struct BountyQuestTargetDefeatedNetworkEvent
{
public:
	struct FText                                                 TargetName;                                        // 0x18(0x38)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x50(0x8)
};


// Size 0x38
struct UpdateCameraPositionRpc
{
public:
	class AthenaPlayerController*                                AthenaPlayerController;                            // 0x18(0x8)
	struct                                                       Location;                                          // 0x20(0xc)
	struct                                                       Rotation;                                          // 0x2c(0xc)
};


// Size 0x10
struct PlayerBanishedToBrig
{
public:
	struct FString                                               PlayerName;                                        // 0x0(0x10)
};


// Size 0x2
struct BucketRegStatePredictionTelemetryEvent
{
public:
	char                                                         InitialPrediction;                                 // 0x0(0x1)
	char                                                         FinalPrediction;                                   // 0x1(0x1)
};


// Size 0x80
struct TreasureChestSoldInContestNetworkEvent
{
public:
	struct FName                                                 RewardId;                                          // 0x18(0x8)
	struct FText                                                 CrewName;                                          // 0x20(0x38)
	struct                                                       ToastBackgroundImage;                              // 0x58(0x10)
	struct                                                       BackgroundImage;                                   // 0x68(0x10)
	struct FName                                                 AudioEventName;                                    // 0x78(0x8)
};


// Size 0x14
struct CrewAllianceJoinStatus
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
	char                                                         AllianceJoinStatus;                                // 0x10(0x1)
	char                                                         LastAllianceJoinStatus;                            // 0x11(0x1)
};


// Size 0x4
struct GetGuildLedgerResponseModel
{
public:
	uint32                                                       UserPosition;                                      // 0x0(0x4)
};


// Size 0x10
struct EventShipLightStateChange
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	class Actor*                                                 Light;                                             // 0x8(0x8)
};


// Size 0x8
struct EventSetFishingRodWieldedItem
{
public:
	class Actor*                                                 FishingRod;                                        // 0x0(0x8)
};


// Size 0x28
struct SignedGuildId
{
public:
	struct                                                       GuildId;                                           // 0x0(0x10)
	char                                                         GuildAffiliation;                                  // 0x10(0x1)
	struct FString                                               Signature;                                         // 0x18(0x10)
};


// Size 0x50
struct KnockBackInfo
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	float                                                        HorizontalVelocity;                                // 0x8(0x4)
	float                                                        VerticalVelocity;                                  // 0xc(0x4)
	float                                                        MinHorizontalVelocity;                             // 0x10(0x4)
	float                                                        MinVerticalVelocity;                               // 0x14(0x4)
	float                                                        SwimmingVelocity;                                  // 0x18(0x4)
	float                                                        DockedHorizontalVelocity;                          // 0x1c(0x4)
	float                                                        DockedVerticalVelocity;                            // 0x20(0x4)
	bool                                                         UseDockedVelocitiesWhenDocked;                     // 0x24(0x1)
	struct FName                                                 RumbleTag;                                         // 0x28(0x8)
	float                                                        StunDuration;                                      // 0x30(0x4)
	float                                                        AIKnockbackDistance;                               // 0x34(0x4)
	float                                                        AIKnockbackSpeed;                                  // 0x38(0x4)
	float                                                        AIKnockbackAcceleration;                           // 0x3c(0x4)
	char                                                         AIKnockbackStrengthType;                           // 0x40(0x1)
	bool                                                         UseOverrideLaunchDirection;                        // 0x41(0x1)
	struct                                                       OverrideLaunchDirectionInWorldSpace;               // 0x44(0xc)
};


// Size 0x30
struct Encounter
{
public:
	class Actor*                                                 EncounterActor;                                    // 0x0(0x8)
};


// Size 0x10
struct ShipStorageJettisonEvent
{
public:
	TArray<uintptr_t>                                            JettisonedContainers;                              // 0x0(0x10)
};


// Size 0xc
struct CrewInTunnel
{
public:
	bool                                                         FullCrewInTunnel;                                  // 0x0(0x1)
	struct FName                                                 Faction;                                           // 0x4(0x8)
};


// Size 0x10
struct ClearOverrideCrewSpawnTeleportLocation
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
};


// Size 0x20
struct AthenaAnimationObjectActionOneShotPitchOverride
{
public:
	TArray<class BlendSpace1D*>                                  MainAction;                                        // 0x0(0x10)
	TArray<class BlendSpace1D*>                                  AlternateAction;                                   // 0x10(0x10)
};


// Size 0x70
struct ClientProjectileImpactHitRegInfoTelemetryEvent
{
public:
	struct                                                       AttackId;                                          // 0x0(0x10)
	struct FString                                               ProjectileId;                                      // 0x10(0x10)
	struct FString                                               DamagerTypeId;                                     // 0x20(0x10)
	struct                                                       HitLocation;                                       // 0x30(0xc)
	struct FString                                               InstigatorObjectId;                                // 0x40(0x10)
	struct FString                                               InstigatorObjectType;                              // 0x50(0x10)
	struct FString                                               InstigatorActorName;                               // 0x60(0x10)
};


// Size 0x30
struct CharacterActionStateConstructionInfo
{
public:
	class AthenaCharacter*                                       CharacterOwner;                                    // 0x28(0x8)
};


// Size 0x10
struct PlayerAggregatePositionTelemetryFragment
{
public:
	TArray<struct Vector>                                        PositionData;                                      // 0x0(0x10)
};


// Size 0x8
struct EventPlayerTeleportComplete
{
public:
	class Actor*                                                 TeleportedActor;                                   // 0x0(0x8)
};


// Size 0x10
struct MermaidActivatedLocally
{
public:
	class Mermaid*                                               Mermaid;                                           // 0x0(0x8)
	bool                                                         IsForLocalPlayer;                                  // 0x8(0x1)
};


// Size 0xa0
struct CaptainedCrew
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
	struct                                                       ShipId;                                            // 0x10(0x10)
	struct FString                                               ShipName;                                          // 0x20(0x10)
	struct FText                                                 ScrambledShipName;                                 // 0x30(0x38)
	struct FName                                                 SessionToken;                                      // 0x68(0x8)
	struct                                                       CaptainUserId;                                     // 0x70(0x18)
	struct FString                                               CaptainPirateId;                                   // 0x88(0x10)
	int                                                          ScrambleNameIndex;                                 // 0x98(0x4)
	bool                                                         IsFirstTimeSailingShip;                            // 0x9c(0x1)
	bool                                                         LocalPlayerHasUGCBlocked;                          // 0x9d(0x1)
	bool                                                         UGCHasBeenChecked;                                 // 0x9e(0x1)
};


// Size 0x18
struct EventConversationParticipantReactionRequest
{
public:
	class Actor*                                                 ConversationStarter;                               // 0x0(0x8)
	class UClass*                                                OptionalInteractResponseType;                      // 0x8(0x8)
	class WwiseEvent*                                            OptionalDialogAudioEvent;                          // 0x10(0x8)
};


// Size 0x18
struct StoreOnlinePurchaseResult
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
	struct FString                                               ProductId;                                         // 0x8(0x10)
};


// Size 0x60
struct ClientProjectileHitRegInfoTelemetryEvent
{
public:
	struct                                                       AttackId;                                          // 0x0(0x10)
	struct FString                                               ProjectileId;                                      // 0x10(0x10)
	struct FString                                               HitObjectId;                                       // 0x20(0x10)
	struct FString                                               HitObjectType;                                     // 0x30(0x10)
	struct FString                                               HitActorName;                                      // 0x40(0x10)
	struct                                                       HitLocation;                                       // 0x50(0xc)
	bool                                                         IsHitScanShot;                                     // 0x5c(0x1)
};


// Size 0xd0
struct UseBalanceableWalkwayActionStateParams
{
public:
	float                                                        BaseMovementSpeed;                                 // 0x10(0x4)
	float                                                        TiltSpeed;                                         // 0x14(0x4)
	float                                                        IncreasedTiltSpeed;                                // 0x18(0x4)
	float                                                        IncreasedMovementSpeed;                            // 0x1c(0x4)
	float                                                        JumpSpeedMultiplierWhenSliding;                    // 0x20(0x4)
	float                                                        MaxJumpSpeed;                                      // 0x24(0x4)
	float                                                        BalanceMaxTiltAngle;                               // 0x28(0x4)
	float                                                        AdditiveFOV;                                       // 0x2c(0x4)
	float                                                        SmoothingFactor;                                   // 0x30(0x4)
	float                                                        ControllerTiltDeadzone;                            // 0x34(0x4)
	float                                                        ControllerMoveDeadzone;                            // 0x38(0x4)
	class CurveFloat*                                            MovementSpeedScalarOverTiltAngle;                  // 0x40(0x8)
	class CurveFloat*                                            MovementSpeedScalarOverSlopeAngle;                 // 0x48(0x8)
	class CurveFloat*                                            MovementSpeedScalarOverSlopeTime;                  // 0x50(0x8)
	class CurveFloat*                                            TiltSpeedModifierOverTime;                         // 0x58(0x8)
	class CurveFloat*                                            BalanceForceEfficiencyCurve;                       // 0x60(0x8)
	class CurveFloat*                                            CounterBalanceForceCurve;                          // 0x68(0x8)
	class CurveFloat*                                            PlayerBalanceForceCurve;                           // 0x70(0x8)
	struct                                                       BalanceForceEfficiencyCurve_DurationTimeRange;     // 0x78(0x8)
	struct                                                       CounterbalanceRedecisionTimeRange;                 // 0x80(0x8)
	float                                                        CounterbalanceForce;                               // 0x88(0x4)
	bool                                                         ShouldUseTiltPredictor;                            // 0x8c(0x1)
	struct                                                       TiltPredictorParams;                               // 0x90(0x18)
	struct                                                       WalkPredictorParams;                               // 0xa8(0x18)
	struct                                                       TransferBootyStat;                                 // 0xc0(0x4)
	struct                                                       TransferToEnemyShipStat;                           // 0xc4(0x4)
	struct                                                       SlideToPlayerShipStat;                             // 0xc8(0x4)
};


// Size 0x38
struct ShipRepairTelemetryEvent
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct                                                       DamageLocation;                                    // 0x10(0xc)
	struct FString                                               RepairedShipPart;                                  // 0x20(0x10)
	int                                                          DamageLevel;                                       // 0x30(0x4)
	float                                                        RepairPercentage;                                  // 0x34(0x4)
};


// Size 0x28
struct BlendableDrowningParams
{
public:
	float                                                        TimeToEmptyLungs;                                  // 0x0(0x4)
	float                                                        TimeToFillLungs;                                   // 0x4(0x4)
	float                                                        DamagePerMinute;                                   // 0x8(0x4)
	float                                                        DrownWaterLevel;                                   // 0xc(0x4)
	float                                                        GulpingStartTime;                                  // 0x10(0x4)
	float                                                        GulpingPeakTime;                                   // 0x14(0x4)
	float                                                        ClientErrorOxygenDifference;                       // 0x18(0x4)
	class Object*                                                ExtraBubblesFirstPerson;                           // 0x20(0x8)
};


// Size 0x38
struct QuestTableTileInteractionTelemetryEvent
{
public:
	struct FString                                               TileTitle;                                         // 0x0(0x10)
	struct FString                                               TileId;                                            // 0x10(0x10)
	int                                                          CurrentTilePage;                                   // 0x20(0x4)
	struct FString                                               SessionId;                                         // 0x28(0x10)
};


// Size 0x8
struct CharacterSocketCollisionServiceParams
{
public:
	float                                                        MaxCharacterDistanceSqr;                           // 0x0(0x4)
	int                                                          MaxSockets;                                        // 0x4(0x4)
};


// Size 0xa0
struct Crew
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
	struct                                                       SessionId;                                         // 0x10(0x10)
	TArray<class PlayerState*>                                   Players;                                           // 0x20(0x10)
	struct                                                       CrewSessionTemplate;                               // 0x30(0x38)
	struct                                                       LiveryID;                                          // 0x68(0x10)
	TArray<class Actor*>                                         AssociatedActors;                                  // 0x80(0x10)
	bool                                                         HasEverSetSail;                                    // 0x90(0x1)
	bool                                                         RequiresDiveOnceShipHasSpawned;                    // 0x91(0x1)
	bool                                                         CrewDivingToWorldEvent;                            // 0x92(0x1)
	int                                                          ScrambleNameIndex;                                 // 0x94(0x4)
	struct                                                       TeamID;                                            // 0x98(0x1)
};


// Size 0x38
struct TaleProposalVoteSlotUpdatedEvent
{
public:
	struct                                                       TaleProposal;                                      // 0x0(0x20)
	class VoyageDescDataAsset*                                   CurrentActiveTale;                                 // 0x20(0x8)
	struct                                                       CrewId;                                            // 0x28(0x10)
};


// Size 0x8
struct EventSceneDialogueFinished
{
public:
	class SceneDialogueCoordinator*                              Sender;                                            // 0x0(0x8)
};


// Size 0x14
struct LinearTransitionLadderActionStateParams
{
public:
	float                                                        Duration;                                          // 0x10(0x4)
};


// Size 0x10
struct CheckCanPlayerJoinGuildResponseModel
{
public:
	TArray<String>                                               ReasonsWhyPirateCannotJoinGuild;                   // 0x0(0x10)
};


// Size 0x8
struct TutorialStepExitedEvent
{
public:
	struct FName                                                 StepName;                                          // 0x0(0x8)
};


// Size 0x20
struct MoveSpeedValidationFailedTelemetryEvent
{
public:
	struct FString                                               Item;                                              // 0x0(0x10)
	int                                                          SpeedId;                                           // 0x10(0x4)
	int                                                          DurationMS;                                        // 0x14(0x4)
	int                                                          IgnoredRequestCount;                               // 0x18(0x4)
};


// Size 0x60
struct LobbyServiceModel
{
public:
	struct                                                       InviteCode;                                        // 0x0(0x20)
	struct FString                                               HostXuid;                                          // 0x20(0x10)
	struct FString                                               HostToken;                                         // 0x30(0x10)
	struct                                                       LobbyCreationRequest;                              // 0x40(0x10)
	struct FString                                               CreationTimeUtc;                                   // 0x50(0x10)
};


// Size 0x28
struct QuestDesc
{
public:
	struct FString                                               Title;                                             // 0x8(0x10)
	bool                                                         IsEmergent;                                        // 0x18(0x1)
	struct FName                                                 IslandName;                                        // 0x1c(0x8)
};


// Size 0x10
struct EventCrewShipManifestChanged
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	class Actor*                                                 Manifest;                                          // 0x8(0x8)
};


// Size 0x4
struct MermaidUsedTelemetryEvent
{
public:
	int                                                          MermaidId;                                         // 0x0(0x4)
};


// Size 0x60
struct AthenaAnimationAsyncLoadedObjectIdleAnimations
{
public:
	assetobject                                                  Idle1;                                             // 0x0(0x20)
	assetobject                                                  Idle2;                                             // 0x20(0x20)
	assetobject                                                  Idle3;                                             // 0x40(0x20)
};


// Size 0x18
struct SetMapTypeOnRadialInventorySlot
{
public:
	int                                                          SlotIndex;                                         // 0x0(0x4)
	char                                                         QuestMapIcon;                                      // 0x4(0x1)
	struct FString                                               BackgroundImageUrl;                                // 0x8(0x10)
};


// Size 0xc
struct CrewManagementArenaRivalVotingData
{
public:
	bool                                                         Voted;                                             // 0x0(0x1)
	int                                                          VotesCast;                                         // 0x4(0x4)
	int                                                          VotesRequired;                                     // 0x8(0x4)
};


// Size 0x18
struct NPCBeckonGestureEntry
{
public:
	class UClass*                                                GestureID;                                         // 0x0(0x8)
	struct                                                       BeckonGestureDataAsset;                            // 0x8(0x10)
};


// Size 0x38
struct PetRoamingAnimationState
{
public:
	char                                                         AnimationType;                                     // 0x0(0x1)
	class AnimMontage*                                           MontageData;                                       // 0x8(0x8)
	struct                                                       CycleData;                                         // 0x10(0x18)
	char                                                         CurrentWieldableLocation;                          // 0x28(0x1)
	char                                                         ResetWieldableLocation;                            // 0x29(0x1)
	float                                                        BlendInTime;                                       // 0x2c(0x4)
	float                                                        BlendOutTime;                                      // 0x30(0x4)
	bool                                                         Uninterruptable;                                   // 0x34(0x1)
	bool                                                         ResetWieldableIfInterrupted;                       // 0x35(0x1)
	bool                                                         AllowHappyReact;                                   // 0x36(0x1)
};


// Size 0x20
struct EmblemUnlockedEvent
{
public:
	struct                                                       EmblemId;                                          // 0x0(0x10)
	struct FString                                               Sig;                                               // 0x10(0x10)
};


// Size 0x28
struct GeyserStateData
{
public:
	char                                                         State;                                             // 0x20(0x1)
};


// Size 0x458
struct MeshAnimatorAnimationMeshEntry
{
public:
	struct                                                       Position;                                          // 0x0(0x170)
	struct                                                       Rotation;                                          // 0x170(0x170)
	bool                                                         ModifyScale;                                       // 0x2e0(0x1)
	struct                                                       Scale;                                             // 0x2e8(0x170)
};


// Size 0x1
struct ClientBannedHandlerRetrieveDataResponse
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
};


// Size 0x1
struct PlayerBlockingUnblockPlayersResponse
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
};


// Size 0x4
struct EventAthenaLocalPlayerControllerDisconnected
{
public:
	int                                                          ControllerId;                                      // 0x0(0x4)
};


// Size 0x10
struct EventSwimmingCreatureCollided
{
public:
	class Actor*                                                 SwimmingCreatureActor;                             // 0x0(0x8)
};


// Size 0x188
struct MatchmakingVoyageRecipe
{
public:
	char                                                         ServerType;                                        // 0x180(0x1)
	char                                                         ContestType;                                       // 0x181(0x1)
};


// Size 0x18
struct EmblemCriteria
{
public:
	struct                                                       PlayerStat;                                        // 0x0(0x4)
	uint64                                                       Threshold;                                         // 0x8(0x8)
	char                                                         Operator;                                          // 0x10(0x1)
};


// Size 0x130
struct BowSplashProbe
{
public:
	char                                                         ShipAlignmentType;                                 // 0x128(0x1)
};


// Size 0x60
struct ShipPersistenceModelReceivedFromPartServicesTelemetryEvent
{
public:
	struct FString                                               Name;                                              // 0x0(0x10)
	struct                                                       ShipPersistenceModel;                              // 0x10(0x50)
};


// Size 0x10
struct ItemProxyImpactVfxParams
{
public:
	char                                                         SurfaceType;                                       // 0x0(0x1)
	class Object*                                                Particles;                                         // 0x8(0x8)
};


// Size 0x38
struct EventOneShotUseTriggered
{
public:
	class Actor*                                                 Item;                                              // 0x0(0x8)
	class UClass*                                                InputID;                                           // 0x8(0x8)
	bool                                                         PlayOneShotAnimation;                              // 0x10(0x1)
	struct                                                       Visuals;                                           // 0x18(0x18)
	bool                                                         WieldableUseVisualVariant;                         // 0x30(0x1)
	bool                                                         KeepOnIdle;                                        // 0x31(0x1)
	bool                                                         TriggerIndependently;                              // 0x32(0x1)
};


// Size 0x20
struct ShipMetadata
{
public:
	struct FString                                               Name;                                              // 0x0(0x10)
	class UClass*                                                ShipTypeObject;                                    // 0x10(0x8)
	class UClass*                                                ShipCategoryObject;                                // 0x18(0x8)
};


// Size 0x8
struct ClothingChestEquipClothingEvent
{
public:
	class UClass*                                                Desc;                                              // 0x0(0x8)
};


// Size 0x10
struct ShroudBreakerDeactivateEffectsEvent
{
public:
	struct                                                       ShroudBreakerId;                                   // 0x0(0x10)
};


// Size 0xb8
struct AthenaAnimationWeapon
{
public:
	struct                                                       AnimData;                                          // 0x18(0x38)
	bool                                                         Attacking;                                         // 0x50(0x1)
	bool                                                         NewAttack;                                         // 0x51(0x1)
	struct                                                       WeaponData;                                        // 0x58(0x48)
};


// Size 0xa0
struct SeasonRewardEarnedMessage
{
public:
	struct                                                       Pirate;                                            // 0x0(0x78)
	struct                                                       SeasonId;                                          // 0x78(0x10)
	bool                                                         MultipleRewards;                                   // 0x88(0x1)
	TArray<struct SeasonReward>                                  Rewards;                                           // 0x90(0x10)
};


// Size 0xa0
struct GuildMemberLeaderboardScoreUpdateMessage
{
public:
	struct                                                       PirateIdentity;                                    // 0x0(0x78)
	struct                                                       GuildId;                                           // 0x78(0x10)
	struct FName                                                 EmissaryAffiliation;                               // 0x88(0x8)
	int64                                                        Before;                                            // 0x90(0x8)
	int64                                                        After;                                             // 0x98(0x8)
};


// Size 0x28
struct MastCollisionProfiles
{
public:
	struct FName                                                 CollisionDisabledProfile;                          // 0x0(0x8)
	struct FName                                                 PlayerAndItemsCollisionProfile;                    // 0x8(0x8)
	struct FName                                                 PlayerOnlyCollisionProfile;                        // 0x10(0x8)
	struct FName                                                 ItemsOnlyCollisionProfile;                         // 0x18(0x8)
	struct FName                                                 ProjectilesOnlyCollisionProfile;                   // 0x20(0x8)
};


// Size 0x10
struct InventoryManipulatorAutoEquipPolicyEntry
{
public:
	class UClass*                                                Category;                                          // 0x0(0x8)
	char                                                         Policy;                                            // 0x8(0x1)
};


// Size 0x80
struct RadialRuleInstanceMapping
{
public:
	class RadialCreationRuleAsset*                               Rule;                                              // 0x0(0x8)
	struct                                                       Instance;                                          // 0x8(0x78)
};


// Size 0x10
struct RequestShipCustomizationChestClearShipCustomizationEvent
{
public:
	struct FString                                               ItemDesc;                                          // 0x0(0x10)
};


// Size 0x18
struct BountyQuestWaveCompletedTelemetryEvent
{
public:
	struct FString                                               LandmarkName;                                      // 0x0(0x10)
	int                                                          BountyWaveIndex;                                   // 0x10(0x4)
	int                                                          TotalBountyWaves;                                  // 0x14(0x4)
};


// Size 0x1c
struct LocationGeneratorSample
{
public:
	char                                                         Type;                                              // 0x0(0x1)
	struct                                                       Location;                                          // 0x4(0xc)
	struct                                                       Normal;                                            // 0x10(0xc)
};


// Size 0x20
struct PlayModePhrases
{
public:
	char                                                         PlayModeKey;                                       // 0x0(0x1)
	class PhrasesRadialDataAsset*                                PhraseDataAsset;                                   // 0x8(0x8)
	class NonVerbalRadialDataAsset*                              QuickAccessDataAsset;                              // 0x10(0x8)
	class NonVerbalRadialDataAsset*                              StrategyDataAsset;                                 // 0x18(0x8)
};


// Size 0x30
struct XPGrantedNetworkEvent
{
public:
	uint32                                                       XPGranted;                                         // 0x18(0x4)
	uint32                                                       CurrentLevel;                                      // 0x1c(0x4)
	uint32                                                       CurrentXP;                                         // 0x20(0x4)
	struct FName                                                 CompanyId;                                         // 0x24(0x8)
};


// Size 0x4
struct VoyageQuestsBegun
{
public:
	int                                                          QuestCount;                                        // 0x0(0x4)
};


// Size 0x20
struct RemoveMemberFromGuildRequestModel
{
public:
	struct                                                       IdOfUserPirateToKick;                              // 0x0(0x20)
};


// Size 0x20
struct CondensedPlayerStat
{
public:
	uint32                                                       StatId;                                            // 0x0(0x4)
	uint64                                                       Min;                                               // 0x8(0x8)
	uint64                                                       Max;                                               // 0x10(0x8)
	uint64                                                       Sum;                                               // 0x18(0x8)
};


// Size 0x10
struct AthenaAnimationWheelArmOverlayAnimData
{
public:
	class BlendSpace1D*                                          ArmLower;                                          // 0x0(0x8)
	class BlendSpace1D*                                          ArmRaise;                                          // 0x8(0x8)
};


// Size 0x40
struct PlayerCrewAssignmentMessage
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
	struct                                                       UserId;                                            // 0x10(0x18)
	struct FString                                               PirateId;                                          // 0x28(0x10)
	char                                                         SessionType;                                       // 0x38(0x1)
	int                                                          ServerCrewCapacity;                                // 0x3c(0x4)
};


// Size 0x10
struct RequestEquipClothingPiratePreviewEvent
{
public:
	struct FString                                               ClothingDesc;                                      // 0x0(0x10)
};


// Size 0x8
struct ServerPopulationTelemetryFragment
{
public:
	int                                                          NumberOfPlayers;                                   // 0x0(0x4)
	int                                                          NumberOfCrews;                                     // 0x4(0x4)
};


// Size 0x1
struct SetNarrateToasts
{
public:
	bool                                                         IsEnabled;                                         // 0x0(0x1)
};


// Size 0x10
struct AchievementBlockThenHitAndGetBlockedThenTakeHit
{
public:
	class AthenaPlayerCharacter*                                 Character;                                         // 0x0(0x8)
	float                                                        TimeWindowInSeconds;                               // 0x8(0x4)
};


// Size 0x60
struct UseCannonActionStateParams
{
public:
	struct                                                       MountedWeaponParams;                               // 0x0(0x58)
	float                                                        ReloadAttemptRepeatRate;                           // 0x58(0x4)
};


// Size 0x78
struct WalletUpdatedMessage
{
public:
	struct                                                       PirateIdentity;                                    // 0x0(0x78)
};


// Size 0x40
struct HoldToUseInput
{
public:
	struct FName                                                 FeatureFlag;                                       // 0x0(0x8)
	class UClass*                                                StartUse;                                          // 0x8(0x8)
	class UClass*                                                StopUse;                                           // 0x10(0x8)
	struct                                                       ActionVisuals;                                     // 0x18(0x18)
	class HoldToUseInputVisualModifier*                          WieldableVisualModifier;                           // 0x30(0x8)
	bool                                                         SplitActionRules;                                  // 0x38(0x1)
};


// Size 0x8
struct FishSizeAndWeight
{
public:
	char                                                         Size;                                              // 0x0(0x1)
	float                                                        Weight;                                            // 0x4(0x4)
};


// Size 0x1
struct OnRestoreShopStateChangedEvent
{
public:
	bool                                                         CanRestore;                                        // 0x0(0x1)
};


// Size 0x20
struct EventAIBountySpawnerAllTargetsKilled
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	struct                                                       CrewId;                                            // 0x8(0x10)
	class Actor*                                                 InstigatorOfFinalAIPawnDeath;                      // 0x18(0x8)
};


// Size 0x8
struct WaterPuzzleRepData
{
public:
	int                                                          CurrentWaterLevelIndex;                            // 0x0(0x4)
	bool                                                         TransitionDueToReset;                              // 0x4(0x1)
};


// Size 0x24
struct LeaveGhostShipActionStateParams
{
public:
	float                                                        FadeDelay;                                         // 0x0(0x4)
	float                                                        FadeDuration;                                      // 0x4(0x4)
	float                                                        FadeEventTimeout;                                  // 0x8(0x4)
	float                                                        FadeServerTimeout;                                 // 0xc(0x4)
	struct                                                       FadeColour;                                        // 0x10(0x10)
	bool                                                         FadeAudio;                                         // 0x20(0x1)
};


// Size 0x4
struct CompanyLevelDataTable
{
public:
	int                                                          XpRequiredForLevel;                                // 0x0(0x4)
};


// Size 0x28
struct ItemSpawnWeightedType
{
public:
	class UClass*                                                Type;                                              // 0x0(0x8)
	struct FName                                                 Feature;                                           // 0x8(0x8)
	bool                                                         InvertFeatureCheck;                                // 0x10(0x1)
	int                                                          Weight;                                            // 0x14(0x4)
	TArray<class SpawnRequirement*>                              Requirements;                                      // 0x18(0x10)
};


// Size 0x20
struct CategoryTypeMapEntry
{
public:
	struct FString                                               Type;                                              // 0x0(0x10)
	TArray<class Class*>                                         Categories;                                        // 0x10(0x10)
};


// Size 0x20
struct VoyageOnDemandArrivalTunnelOfTheDamnedInitializedTelemetryEvent
{
public:
	struct                                                       VoyageID;                                          // 0x0(0x10)
	struct                                                       MigrationId;                                       // 0x10(0x10)
};


// Size 0x78
struct AthenaAnimationObjectActionContinuousStructPitchOverride
{
public:
	class BlendSpace1D*                                          MainInto;                                          // 0x0(0x8)
	class BlendSpace1D*                                          MainCycleIdle;                                     // 0x8(0x8)
	class BlendSpace1D*                                          MainCycleLocomotion;                               // 0x10(0x8)
	TArray<class BlendSpace1D*>                                  VariantCycleIdle;                                  // 0x18(0x10)
	bool                                                         UseMainCycleJump;                                  // 0x28(0x1)
	bool                                                         IgnoreFullBody;                                    // 0x29(0x1)
	struct                                                       MainCycleJump;                                     // 0x30(0x20)
	class BlendSpace1D*                                          MainOutOf;                                         // 0x50(0x8)
	struct                                                       MainSwimming;                                      // 0x58(0x20)
};


// Size 0x30
struct ProjectileWeaponEquipTelemetryData
{
public:
	struct                                                       TelemetryEquipId;                                  // 0x0(0x10)
	struct FString                                               WeaponName;                                        // 0x10(0x10)
	bool                                                         HasCancelledEquipAnim;                             // 0x20(0x1)
	float                                                        RequesterLatencyMs;                                // 0x24(0x4)
	float                                                        RequesterTimeOffset;                               // 0x28(0x4)
};


// Size 0xc
struct AthenaCharacterSwimSpeed
{
public:
	float                                                        SprintSpdAmp;                                      // 0x0(0x4)
	float                                                        SprintAccelAmp;                                    // 0x4(0x4)
	float                                                        TurnSpeedScalar;                                   // 0x8(0x4)
};


// Size 0x1
struct EventCannonAimingStoppedPitch
{
public:
	bool                                                         IsAtEnd;                                           // 0x0(0x1)
};


// Size 0x10
struct CompanyValidationAssetUnit
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	bool                                                         ShouldHaveLevels;                                  // 0x8(0x1)
	bool                                                         ShouldHaveEmblems;                                 // 0x9(0x1)
};


// Size 0x40
struct PremiumShopOfferItem
{
public:
	bool                                                         IsSuperPremium;                                    // 0x0(0x1)
	struct FText                                                 LockedReason;                                      // 0x8(0x38)
};


// Size 0x38
struct WeightedItemDescSpawnData
{
public:
	class ItemSpawnData*                                         ItemSpawnData;                                     // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	bool                                                         LimitMaxSpawnedItems;                              // 0xc(0x1)
	uint32                                                       MaxTimesCanBeSelected;                             // 0x10(0x4)
	struct FName                                                 Feature;                                           // 0x14(0x8)
	bool                                                         InvertFeatureCheck;                                // 0x1c(0x1)
	TArray<class SpawnRequirement*>                              Requirements;                                      // 0x20(0x10)
	bool                                                         CustomLifetimeManagement;                          // 0x30(0x1)
};


// Size 0x1
struct EventInGameUISetMigrationMode
{
public:
	bool                                                         MigrationModeEnabled;                              // 0x0(0x1)
};


// Size 0x1
struct CrewMuteOthersChatEvent
{
public:
	bool                                                         IsMuted;                                           // 0x0(0x1)
};


// Size 0x1c
struct MerchantQuestCategoryGroupBounds
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	int                                                          MinNum;                                            // 0xc(0x4)
	int                                                          MaxNum;                                            // 0x10(0x4)
	int                                                          MinDifferent;                                      // 0x14(0x4)
	int                                                          MaxDifferent;                                      // 0x18(0x4)
};


// Size 0x1
struct EventAthenaLocalPlayerRequestRequiredControllersConnectedResponse
{
public:
	bool                                                         ControllerConnected;                               // 0x0(0x1)
};


// Size 0xd0
struct EventCharacterFootImpact
{
public:
	struct                                                       Result;                                            // 0x0(0xd0)
};


// Size 0x28
struct UseLadderBeginEvent
{
public:
	struct                                                       LadderDefinition;                                  // 0x0(0x1c)
	class Object*                                                LadderObject;                                      // 0x20(0x8)
};


// Size 0x8
struct EventAthenaPlayerControllerEndingPlay
{
public:
	class AthenaPlayerController*                                Controller;                                        // 0x0(0x8)
};


// Size 0x90
struct QuestTableRefreshResponseEvent
{
public:
	struct                                                       QuestTableData;                                    // 0x0(0x90)
};


// Size 0x30
struct EventCargoRunCrateDelivered
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
	struct                                                       PickUpId;                                          // 0x10(0x10)
	class BootyItemInfo*                                         ItemInfo;                                          // 0x20(0x8)
	struct FName                                                 CompanyAffiliation;                                // 0x28(0x8)
};


// Size 0xc
struct MastReceivedDamageEvent
{
public:
	int                                                          OldLevelsOfDamage;                                 // 0x0(0x4)
	int                                                          DamageReceived;                                    // 0x4(0x4)
	int                                                          CurrentLevelsOfDamage;                             // 0x8(0x4)
};


// Size 0x30
struct PetChestSuccessfulNameChangeTelemetryEvent
{
public:
	struct FString                                               PetName;                                           // 0x0(0x10)
	struct FString                                               PetCategory;                                       // 0x10(0x10)
	struct FString                                               PetVariantName;                                    // 0x20(0x10)
};


// Size 0x38
struct CurrencyGrantedNetworkEvent
{
public:
	char                                                         CurrencyId;                                        // 0x18(0x1)
	uint32                                                       Amount;                                            // 0x1c(0x4)
	struct FName                                                 EmissaryAffiliation;                               // 0x20(0x8)
	float                                                        EmissaryMultiplier;                                // 0x28(0x4)
	struct FName                                                 RewardId;                                          // 0x2c(0x8)
};


// Size 0x20
struct AchievementHaveADrinkWithAnotherCrewAtAnOutpost
{
public:
	class AthenaPlayerCharacter*                                 Character;                                         // 0x0(0x8)
	float                                                        RangeOfCheckInMetres;                              // 0x18(0x4)
	float                                                        DrinkConsumedVolumeThreshold;                      // 0x1c(0x4)
};


// Size 0x38
struct ProjectileWeaponFireAimClampTelemetryEvent
{
public:
	struct                                                       TelemetryAttackId;                                 // 0x0(0x10)
	struct FString                                               DamagerType;                                       // 0x10(0x10)
	float                                                        RequesterLatencyMs;                                // 0x20(0x4)
	struct                                                       ClampedByAmmount;                                  // 0x24(0xc)
	float                                                        WantedDistance;                                    // 0x30(0x4)
};


// Size 0x1
struct EventFaunaAnimationTransition
{
public:
	char                                                         AnimationState;                                    // 0x0(0x1)
};


// Size 0x1
struct StoreRedemptionStateFailedTelemetryEvent
{
public:
	char                                                         Status;                                            // 0x0(0x1)
};


// Size 0x18
struct CutSceneLoadData
{
public:
	struct                                                       SequenceToPlayAssetReference;                      // 0x0(0x10)
	class Actor*                                                 SpawnablesParent;                                  // 0x10(0x8)
};


// Size 0x20
struct IslandMaterialZoneStatusMapping
{
public:
	class PhysicalMaterial*                                      SurfaceMaterial;                                   // 0x0(0x8)
	bool                                                         ActivateOnStart;                                   // 0x8(0x1)
	TArray<struct Status>                                        Status;                                            // 0x10(0x10)
};


// Size 0x20
struct ClientNameUpdateEvent
{
public:
	struct                                                       EntityId;                                          // 0x0(0x10)
	struct FString                                               ClientName;                                        // 0x10(0x10)
};


// Size 0x48
struct MechanismAnimationEvent_VFXParams
{
public:
	class ParticleSystem*                                        ParticleSystem;                                    // 0x0(0x8)
	char                                                         Mode;                                              // 0x8(0x1)
	struct FName                                                 MechanismVFXComponentTag;                          // 0xc(0x8)
	struct FName                                                 AttachParentComponentTag;                          // 0x14(0x8)
	char                                                         AttachType;                                        // 0x1c(0x1)
	struct                                                       LocationOffset;                                    // 0x20(0xc)
	struct                                                       RotationOffset;                                    // 0x2c(0xc)
	struct                                                       Scale;                                             // 0x38(0xc)
	bool                                                         IsUnderwater;                                      // 0x44(0x1)
	char                                                         VFXRegion;                                         // 0x45(0x1)
};


// Size 0x30
struct GuildRolePermissionsRequestModel
{
public:
	struct                                                       RolePermissions;                                   // 0x0(0x30)
};


// Size 0x1
struct NavigateToMenuEvent
{
public:
	char                                                         Action;                                            // 0x0(0x1)
};


// Size 0x48
struct MermaidServiceMermaidSpawnParams
{
public:
	float                                                        MinDistFromSpawnOrigin;                            // 0x0(0x4)
	float                                                        MinDistFromSpawnOriginForDestroyedShip;            // 0x4(0x4)
	float                                                        MaxDistFromSpawnOriginBeforeGivingUp;              // 0x8(0x4)
	float                                                        DistIncrementPerFailedSpawnCircle;                 // 0xc(0x4)
	int                                                          NumSamplesInSpawnCircle;                           // 0x10(0x4)
	float                                                        SpawnCastStartZ;                                   // 0x14(0x4)
	float                                                        MinSpawnDepth;                                     // 0x18(0x4)
	float                                                        SpawnHalfConeAngleRestrictIfSpawningForPlayer;     // 0x1c(0x4)
	char                                                         HitTestTraceChannel;                               // 0x20(0x1)
	float                                                        AssumedMermaidRadius;                              // 0x24(0x4)
	float                                                        MinDistanceOfFinalSpawnPosToAnyActiveMermaid;      // 0x28(0x4)
	float                                                        MinDistanceOfFinalSpawnPosToAnyActiveMermaidWhenNearEnemyShip; // 0x2c(0x4)
	float                                                        MinDistFromEdgeOfWorld;                            // 0x30(0x4)
	float                                                        MinAngularStepSize;                                // 0x34(0x4)
	float                                                        MaxAngularStepSize;                                // 0x38(0x4)
	float                                                        MinDistanceIncrementPerFail;                       // 0x3c(0x4)
	float                                                        MaxDistanceIncrementPerFail;                       // 0x40(0x4)
	float                                                        AdditionalDistanceFromOriginMultiplierPerMeter;    // 0x44(0x4)
};


// Size 0x58
struct UseMountedWeaponActionStateParams
{
public:
	float                                                        CameraDockTime;                                    // 0x18(0x4)
	class ForceFeedbackEffect*                                   FireForceFeedbackEffect;                           // 0x20(0x8)
	class UClass*                                                FireCameraShake;                                   // 0x28(0x8)
	class UClass*                                                FireInputId;                                       // 0x30(0x8)
	TArray<class Class*>                                         AimYawInputId;                                     // 0x38(0x10)
	TArray<class Class*>                                         AimPitchInputId;                                   // 0x48(0x10)
};


// Size 0x10
struct EDTelemetryEvent
{
public:
	struct FString                                               Description;                                       // 0x0(0x10)
};


// Size 0x20
struct PetLoadoutItem
{
public:
	class UClass*                                                PetEntitlementDesc;                                // 0x0(0x8)
	class UClass*                                                PetCustomizationDesc;                              // 0x8(0x8)
	struct FString                                               PetName;                                           // 0x10(0x10)
};


// Size 0x18
struct SeagullManagerLocationBank
{
public:
	TArray<struct Name>                                          Locations;                                         // 0x0(0x10)
	class ShipCreatureManagerCreatureInstanceMotionModifierDataAsset* MotionModifierDataAsset;                           // 0x10(0x8)
};


// Size 0x28
struct FeaturedEntitlements
{
public:
	struct FName                                                 Feature;                                           // 0x0(0x8)
	struct                                                       EntitlementsAsset;                                 // 0x8(0x10)
	struct                                                       SupplementalEntitlementMap;                        // 0x18(0x10)
};


// Size 0x18
struct LaunchableProjectileDamageEvent
{
public:
	class Actor*                                                 Instigator;                                        // 0x0(0x8)
	class Actor*                                                 ProjectileActor;                                   // 0x8(0x8)
	class Actor*                                                 ActorHit;                                          // 0x10(0x8)
};


// Size 0x8
struct EventReceiveAmmoTransferComponentState
{
public:
	class AmmoTransferComponent*                                 Source;                                            // 0x0(0x8)
};


// Size 0x8
struct EventReceiveAmmoStoreComponentState
{
public:
	class AmmoStoreComponent*                                    Source;                                            // 0x0(0x8)
};


// Size 0x10
struct WreckSpawnedTelemetryEvent
{
public:
	struct                                                       Location;                                          // 0x0(0xc)
	bool                                                         IsCustomWreck;                                     // 0xc(0x1)
};


// Size 0x10
struct FeaturedPetCategory
{
public:
	class UClass*                                                Category;                                          // 0x0(0x8)
	struct FName                                                 Feature;                                           // 0x8(0x8)
};


// Size 0x8
struct EventExplosionDidDestroyWieldedItem
{
public:
	class WieldableItem*                                         DestroyedItem;                                     // 0x0(0x8)
};


// Size 0x10
struct ToggledSpawnerOverride
{
public:
	class AISpawner*                                             Spawner;                                           // 0x0(0x8)
	struct FName                                                 Toggle;                                            // 0x8(0x8)
};


// Size 0x10
struct OnEndSprintingOnWalkwayEvent
{
public:
	class WwiseEvent*                                            WalkwaySprintLoopEnd;                              // 0x0(0x8)
	class WwiseEvent*                                            WalkwayLoopStart;                                  // 0x8(0x8)
};


// Size 0x20
struct ManagedVulnerabilityLayer
{
public:
	struct FName                                                 LayerName;                                         // 0x0(0x8)
	class DamageableVulnerabilityLayer*                          VulnerabilityLayerToApply;                         // 0x10(0x8)
};


// Size 0x40
struct GuildInviteSentModel
{
public:
	struct                                                       UserPirateId;                                      // 0x0(0x20)
	struct                                                       GuildId;                                           // 0x20(0x10)
	struct                                                       InviteId;                                          // 0x30(0x10)
};


// Size 0x58
struct CrewManagementEvent
{
public:
	struct                                                       CrewDefinition;                                    // 0x0(0x58)
};


// Size 0x1
struct BootFlowCrossInputMatchmakingStateEvent
{
public:
	bool                                                         CrossInput;                                        // 0x0(0x1)
};


// Size 0x4
struct QuestTableLikedVoyages
{
public:
	int                                                          Capacity;                                          // 0x0(0x4)
};


// Size 0x38
struct TaleQuestNotificationStepEvent
{
public:
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x18(0x8)
	struct                                                       DiscoveringPlayerStateNetPtr;                      // 0x20(0x14)
};


// Size 0x8
struct SetInvincibilityGameServerRequestModel
{
public:
	int                                                          ActorId;                                           // 0x0(0x4)
	bool                                                         Enable;                                            // 0x4(0x1)
};


// Size 0x10
struct AIRowboatEncounterParamsSpawnerData
{
public:
	class AISpawner*                                             Spawner;                                           // 0x0(0x8)
	struct FName                                                 SpawnType;                                         // 0x8(0x8)
};


// Size 0x80
struct EnterTunnelOfTheDamnedActionStateConstructionInfo
{
public:
	int                                                          TunnelId;                                          // 0x30(0x4)
	int                                                          TunnelStreamingLevelId;                            // 0x34(0x4)
	struct                                                       TeleportLocation;                                  // 0x38(0x40)
	char                                                         TeleportAudioMode;                                 // 0x78(0x1)
	bool                                                         WasRevivable;                                      // 0x79(0x1)
};


// Size 0x18
struct UIFloatOptionSelectedTelemetryEvent
{
public:
	struct FString                                               Option;                                            // 0x0(0x10)
	float                                                        Value;                                             // 0x10(0x4)
};


// Size 0x8
struct ChestOnWatercraftEvent
{
public:
	class Actor*                                                 CurrentWatercraft;                                 // 0x0(0x8)
};


// Size 0x10
struct DestroyingUnsafeWreckTelemetryEvent
{
public:
	struct                                                       Location;                                          // 0x0(0xc)
	bool                                                         IsCustomWreck;                                     // 0xc(0x1)
};


// Size 0x8
struct EventStartDialogueOnServer
{
public:
	class Actor*                                                 Interactor;                                        // 0x0(0x8)
};


// Size 0x40
struct SpawnerData
{
public:
	class ItemSpawnData*                                         ItemSpawnData;                                     // 0x0(0x8)
};


// Size 0x3
struct CrewMatchmakingVisibilityData
{
public:
	bool                                                         Vote;                                              // 0x0(0x1)
	char                                                         NumVotes;                                          // 0x1(0x1)
	char                                                         MatchmakingVisibilityState;                        // 0x2(0x1)
};


// Size 0x20
struct ChainLightningParameters
{
public:
	float                                                        ChainLightningOverlapRadius;                       // 0x0(0x4)
	float                                                        InitialSelectionRadiusSquared;                     // 0x4(0x4)
	int                                                          InitialNumberOfNodesSelected;                      // 0x8(0x4)
	float                                                        MaxDistanceBetweenChainsSquared;                   // 0xc(0x4)
	int                                                          MaxNumberOfLinks;                                  // 0x10(0x4)
	bool                                                         OverrideMaxFramesBeforeReplication;                // 0x14(0x1)
	int                                                          MaxFramesBeforeReplicationOverride;                // 0x18(0x4)
	float                                                        ChainVisualActorLifetime;                          // 0x1c(0x4)
};


// Size 0x28
struct AIShipEncounterRevealNetEvent
{
public:
	int                                                          BattleIdx;                                         // 0x18(0x4)
	int                                                          SkellyCrewIdx;                                     // 0x1c(0x4)
	char                                                         CannonballIconType;                                // 0x20(0x1)
	char                                                         SkellyFormIconType;                                // 0x21(0x1)
};


// Size 0xc
struct EventPlayerEnteredSleepingState
{
public:
	float                                                        AudioEventDelay;                                   // 0x0(0x4)
	float                                                        AudioStateDelay;                                   // 0x4(0x4)
	bool                                                         NoFarting;                                         // 0x8(0x1)
};


// Size 0x18
struct AlignmentModel
{
public:
	struct                                                       Id;                                                // 0x0(0x10)
	int64                                                        MilestoneSum;                                      // 0x10(0x8)
};


// Size 0x8
struct EventMovedByPortableHarpoonGrappleStart
{
public:
	class Actor*                                                 MovementInstigator;                                // 0x0(0x8)
};


// Size 0x30
struct SkeletonAICharacterItemSpecificAudioEvents
{
public:
	TArray<class Class*>                                         ItemCategories;                                    // 0x0(0x10)
	struct                                                       Events;                                            // 0x10(0x20)
};


// Size 0x8
struct PreTeleportShipToTunnelEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
};


// Size 0x8
struct EventPlayerCharacterModelsReplaced
{
public:
	class Actor*                                                 PlayerCharacter;                                   // 0x0(0x8)
};


// Size 0x30
struct TaleQuestSelectWreckLocationTelemetryEvent
{
public:
	struct FString                                               EventIdent;                                        // 0x0(0x10)
	int                                                          NumLocations;                                      // 0x10(0x4)
	int                                                          LocationIndex;                                     // 0x14(0x4)
	int                                                          KeyIndex;                                          // 0x18(0x4)
	TArray<int>                                                  FlagResponses;                                     // 0x20(0x10)
};


// Size 0x18
struct VoyageProposalDiscardEvent
{
public:
	struct FString                                               ProposalDesc;                                      // 0x0(0x10)
	bool                                                         IsTin;                                             // 0x10(0x1)
};


// Size 0x30
struct FaunaAnimationPigStarvingStructure
{
public:
	class AnimSequence*                                          StarveIn;                                          // 0x0(0x8)
	class AnimSequence*                                          StarveLoop;                                        // 0x8(0x8)
	class AnimSequence*                                          StarveOut;                                         // 0x10(0x8)
	class AnimSequence*                                          StarveDeath;                                       // 0x18(0x8)
	class AnimSequence*                                          StarveStartledLow;                                 // 0x20(0x8)
	class AnimSequence*                                          StarveStartledHigh;                                // 0x28(0x8)
};


// Size 0x14
struct AggressiveGhostShipEncounterEndTelemetryEvent
{
public:
	struct                                                       EncounterId;                                       // 0x0(0x10)
	bool                                                         WasSuccessfullyCompleted;                          // 0x10(0x1)
};


// Size 0x358
struct AthenaAnimationAI
{
public:
	bool                                                         SpawnAnimationActive;                              // 0x0(0x1)
	bool                                                         SpawnAnimationReadyToBegin;                        // 0x1(0x1)
	class AnimSequence*                                          AISpawn;                                           // 0x8(0x8)
	class AnimSequence*                                          AIDespawn;                                         // 0x10(0x8)
	float                                                        AIAnimationSpawnTime;                              // 0x18(0x4)
	bool                                                         AISpawnOnLand;                                     // 0x1c(0x1)
	bool                                                         AIFleeActive;                                      // 0x1d(0x1)
	struct                                                       AISensing;                                         // 0x20(0x38)
	struct                                                       AIEmoteActions;                                    // 0x58(0x38)
	struct                                                       SkeletonShipCaptainParams;                         // 0x90(0x60)
};


// Size 0x8
struct EventWaterAmountChanged
{
public:
	float                                                        NewWaterAmount;                                    // 0x0(0x4)
	float                                                        NewRelativeWaterHeight;                            // 0x4(0x4)
};


// Size 0x10
struct EventWieldableItemSetIsWielded
{
public:
	class Actor*                                                 Wielder;                                           // 0x0(0x8)
	bool                                                         bIsWielded;                                        // 0x8(0x1)
	bool                                                         bGettingDropped;                                   // 0x9(0x1)
	bool                                                         bIsUnstashing;                                     // 0xa(0x1)
};


// Size 0x10
struct PlayerDepartLocationTelemetryEvent
{
public:
	struct FString                                               LocationName;                                      // 0x0(0x10)
};


// Size 0x10
struct ItemStoredInChestEvent
{
public:
	class ItemInfo*                                              StoredItem;                                        // 0x0(0x8)
	class ItemInfo*                                              CollectorsChestStoredIn;                           // 0x8(0x8)
};


// Size 0x18
struct CanvasWorldMapReaperTrackedBootItemIcon
{
public:
	char                                                         BootyItemType;                                     // 0x0(0x1)
	class Texture*                                               Texture;                                           // 0x8(0x8)
};


// Size 0x8
struct ThrowingKnifeProxyRemovedEvent
{
public:
	class ItemProxy*                                             Proxy;                                             // 0x0(0x8)
};


// Size 0x40
struct ProjectileHitTelemetryEvent
{
public:
	struct                                                       AttackId;                                          // 0x0(0x10)
	struct FString                                               ProjectileId;                                      // 0x10(0x10)
	struct FString                                               HitObjectId;                                       // 0x20(0x10)
	struct FString                                               HitObjectType;                                     // 0x30(0x10)
};


// Size 0x18
struct SpawnableItemCategory
{
public:
	struct FName                                                 Category;                                          // 0x0(0x8)
	TArray<class Class*>                                         SpawnableItems;                                    // 0x8(0x10)
};


// Size 0x28
struct VoyageProposalWonVotingSessionTelemetryEvent
{
public:
	struct                                                       VoyageProposalSessionId;                           // 0x0(0x10)
	struct FString                                               VoyageProposalEntitlementId;                       // 0x10(0x10)
	int                                                          NumberOfVotes;                                     // 0x20(0x4)
	int                                                          SessionLength;                                     // 0x24(0x4)
};


// Size 0x18
struct RammableDamageEntry
{
public:
	class UClass*                                                RammerType;                                        // 0x0(0x8)
	class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x8(0x8)
	int                                                          DamageAmount;                                      // 0x10(0x4)
};


// Size 0x28
struct ProjectileWeaponFireWeaponServerStateNotValid
{
public:
	struct                                                       TelemetryAttackId;                                 // 0x0(0x10)
	char                                                         ClientWeaponState;                                 // 0x10(0x1)
	char                                                         ServerWeaponState;                                 // 0x11(0x1)
	float                                                        ServerStateTimer;                                  // 0x14(0x4)
	struct FString                                               DamagerType;                                       // 0x18(0x10)
};


// Size 0x14
struct BuoyantObjectSpawnDistributionParams
{
public:
	struct                                                       ObjectDistanceFromSpawnCentre;                     // 0x0(0x10)
	float                                                        MinDistanceBetweenObjects;                         // 0x10(0x4)
};


// Size 0x1c
struct CreateFogBankGameServerRequestModel
{
public:
	struct                                                       Position;                                          // 0x0(0x8)
	float                                                        Density;                                           // 0x8(0x4)
	struct                                                       SizeInKm;                                          // 0xc(0xc)
	float                                                        FadeDuration;                                      // 0x18(0x4)
};


// Size 0x8
struct AttackTimingWindow
{
public:
	float                                                        StartTime;                                         // 0x0(0x4)
	float                                                        EndTime;                                           // 0x4(0x4)
};


// Size 0x88
struct NoteDeletedMessage
{
public:
	struct                                                       PirateIdentity;                                    // 0x0(0x78)
	struct                                                       NoteId;                                            // 0x78(0x10)
};


// Size 0x8
struct EventGhostShipReleaseIndefiniteDoorLock
{
public:
	class Object*                                                Owner;                                             // 0x0(0x8)
};


// Size 0x8
struct ShipLeftTunnelOfTheDamnedEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
};


// Size 0x20
struct PlayerGeneratedMapsContainerUnregisterServerEventsRpc
{
public:
	class Object*                                                InPlayerGeneratedMapsContainerOwnerObject;         // 0x18(0x8)
};


// Size 0x10
struct StreamingLocation
{
public:
	int                                                          Id;                                                // 0x0(0x4)
	struct                                                       Location;                                          // 0x4(0xc)
};


// Size 0x18
struct ItemDiggingAnimationOverride
{
public:
	TArray<Class>                                                Classes;                                           // 0x0(0x10)
	class ItemDiggingAnimationConfig*                            DiggingAnimationConfig;                            // 0x10(0x8)
};


// Size 0x30
struct AthenaAnimationRowboatAnimationsFirstPerson
{
public:
	class AnimSequence*                                          SitDown;                                           // 0x0(0x8)
	class AnimSequence*                                          Stand;                                             // 0x8(0x8)
	class AnimSequence*                                          Idle;                                              // 0x10(0x8)
	class AnimSequence*                                          Row;                                               // 0x18(0x8)
	class AnimSequence*                                          Recover;                                           // 0x20(0x8)
	class AnimSequence*                                          Brake;                                             // 0x28(0x8)
};


// Size 0x4
struct MastSailAngleBecameStationaryEvent
{
public:
	float                                                        Angle;                                             // 0x0(0x4)
};


// Size 0x1b0
struct HealthUI
{
public:
	float                                                        MinVisibleHealth;                                  // 0x0(0x4)
	float                                                        ContinuousTimePerUpdate;                           // 0x4(0x4)
	class Pawn*                                                  TargetPawn;                                        // 0x20(0x8)
};


// Size 0x10
struct ReplyToGuildInviteResponseModel
{
public:
	struct FString                                               Error;                                             // 0x0(0x10)
};


// Size 0x10
struct FeedStruct
{
public:
	class Actor*                                                 ActorToFeed;                                       // 0x0(0x8)
	bool                                                         WantRules;                                         // 0x8(0x1)
};


// Size 0x10
struct PirateDeletionSucceededEvent
{
public:
	struct FString                                               PirateId;                                          // 0x0(0x10)
};


// Size 0x28
struct FirstInteractableTelemetryEvent
{
public:
	float                                                        StartTime;                                         // 0x0(0x4)
	float                                                        FirstSpinnerShownTime;                             // 0x4(0x4)
	float                                                        StartEntryLevelLoadTime;                           // 0x8(0x4)
	float                                                        StartLegalSplashTime;                              // 0xc(0x4)
	float                                                        EndLegalSplashTime;                                // 0x10(0x4)
	float                                                        FirstInteractableTime;                             // 0x14(0x4)
	struct FString                                               ActiveExperiments;                                 // 0x18(0x10)
};


// Size 0x10
struct ActorId
{
public:
	struct FString                                               ActorLocalName;                                    // 0x0(0x10)
};


// Size 0x80
struct FriendViewModel
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
	struct FString                                               GamerTag;                                          // 0x10(0x10)
	struct FString                                               GamerpicUrl;                                       // 0x20(0x10)
	struct FString                                               RealName;                                          // 0x30(0x10)
	struct FString                                               RichPresence;                                      // 0x40(0x10)
	char                                                         Status;                                            // 0x50(0x1)
	int                                                          AwayDurationHours;                                 // 0x54(0x4)
	char                                                         Platform;                                          // 0x58(0x1)
	struct FString                                               PlatformUsername;                                  // 0x60(0x10)
	struct FString                                               PlatformUserId;                                    // 0x70(0x10)
};


// Size 0x28
struct LightningImpact
{
public:
	int64                                                        TimeInTicks;                                       // 0x0(0x8)
	struct                                                       Location;                                          // 0x8(0x8)
	class Actor*                                                 AttachActor;                                       // 0x10(0x8)
	class AthenaCharacter*                                       TargetCharacter;                                   // 0x18(0x8)
	bool                                                         TargetedHighPriorityTarget;                        // 0x20(0x1)
};


// Size 0xc
struct MastSailAngleChangedEvent
{
public:
	float                                                        Angle;                                             // 0x0(0x4)
	float                                                        DeltaTime;                                         // 0x4(0x4)
	float                                                        SailTurnRate;                                      // 0x8(0x4)
};


// Size 0x30
struct EntitlementInfo
{
public:
	struct FString                                               InstanceId;                                        // 0x0(0x10)
	struct FString                                               CatalogItemId;                                     // 0x10(0x10)
	struct FString                                               Signature;                                         // 0x20(0x10)
};


// Size 0xd8
struct RequestOpenShopEvent
{
public:
	struct                                                       ShopDefinition;                                    // 0x0(0xd8)
};


// Size 0x18
struct ItemDiggingEffectsOverride
{
public:
	TArray<Class>                                                Classes;                                           // 0x0(0x10)
	class ItemDiggingEffectsConfig*                              DiggingEffectsConfig;                              // 0x10(0x8)
};


// Size 0x58
struct CompanySkillsetProgressions
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	struct                                                       TargetSkillsets;                                   // 0x8(0x20)
	struct                                                       TargetSkillsetsOverrideFeatureToggle;              // 0x28(0xc)
	struct                                                       FeatureToggledTargetSkillsetsOverride;             // 0x38(0x20)
};


// Size 0x38
struct OneShotToggleCollisionAudioParams
{
public:
	class WwiseEvent*                                            OverlapBeginAudioEvent;                            // 0x0(0x8)
	class WwiseEvent*                                            OverlapEndAudioEvent;                              // 0x8(0x8)
	class WwiseObjectPoolWrapper*                                OverlapEventAudioPool;                             // 0x10(0x8)
	struct                                                       OverlapEmitter;                                    // 0x18(0x20)
};


// Size 0x70
struct OpenTrinketBoxActionRuleVerbiage
{
public:
	struct FText                                                 OpenTrinketBoxVerbiage;                            // 0x0(0x38)
	struct FText                                                 ReplaceTrinketVerbiage;                            // 0x38(0x38)
};


// Size 0x24
struct RegionMapIslandData
{
public:
	struct                                                       Island;                                            // 0x0(0x8)
	bool                                                         RenderToMap;                                       // 0x8(0x1)
	float                                                        Scale;                                             // 0xc(0x4)
	float                                                        RotationOffset;                                    // 0x10(0x4)
	struct                                                       LocationOffset;                                    // 0x14(0x8)
	bool                                                         Selectable;                                        // 0x1c(0x1)
	int                                                          MaxNumSelections;                                  // 0x20(0x4)
};


// Size 0x70
struct AthenaStreamedLevelData
{
public:
	int                                                          LevelIdCrc;                                        // 0x0(0x4)
	struct FName                                                 PackagePath;                                       // 0x4(0x8)
	TArray<class LevelStreaming*>                                Levels;                                            // 0x10(0x10)
	map                                                          LevelPaths;                                        // 0x20(0x50)
};


// Size 0x4
struct RemoveTriggerGameServerRequestModel
{
public:
	int                                                          TriggerId;                                         // 0x0(0x4)
};


// Size 0x18
struct PetRoamingAnimationStateLoadableWeightedDefinition
{
public:
	struct                                                       LoadableDefinition;                                // 0x0(0x10)
	float                                                        Weight;                                            // 0x10(0x4)
};


// Size 0x1
struct PossessionsChestClosedEvent
{
public:
	char                                                         PossessionsChestType;                              // 0x0(0x1)
};


// Size 0xd0
struct GenericLightTemplate
{
public:
	char                                                         LightType;                                         // 0x0(0x1)
	struct                                                       BaseLightData;                                     // 0x8(0x80)
	struct                                                       PointLightData;                                    // 0x88(0x3c)
	struct                                                       SpotLightData;                                     // 0xc4(0xc)
};


// Size 0x80
struct MountpointParams
{
public:
	struct                                                       Feature;                                           // 0x0(0xc)
	class UClass*                                                PreviewTrinketDesc;                                // 0x10(0x8)
	struct                                                       MountpointRelativePosition;                        // 0x20(0x30)
	struct                                                       InteractionBoxExtent;                              // 0x50(0xc)
	TArray<class Class*>                                         AcceptedMountableTypes;                            // 0x60(0x10)
	float                                                        MaxNudgeAngle;                                     // 0x70(0x4)
};


// Size 0x4
struct WheelArmIKBoolSets
{
public:
	bool                                                         LeftIKOn;                                          // 0x0(0x1)
	bool                                                         RightIKOn;                                         // 0x1(0x1)
	bool                                                         LeftArmDown;                                       // 0x2(0x1)
	bool                                                         RightArmDown;                                      // 0x3(0x1)
};


// Size 0x50
struct GuildBranding
{
public:
	struct FString                                               GuildName;                                         // 0x0(0x10)
	struct FString                                               Icon;                                              // 0x10(0x10)
	struct FString                                               ColourSwatch;                                      // 0x20(0x10)
	struct FString                                               Theme;                                             // 0x30(0x10)
	struct FString                                               Motto;                                             // 0x40(0x10)
};


// Size 0x68
struct MeshMemoryConstraintCannonDelayedHealthReport
{
public:
	bool                                                         DidMakeAttemptToSetBoxMesh;                        // 0x18(0x1)
	bool                                                         DidMakeAttemptToSetBarrelMesh;                     // 0x19(0x1)
	struct FString                                               BoxDescAssetPathName;                              // 0x20(0x10)
	struct FString                                               BarrelDescAssetPathName;                           // 0x30(0x10)
	bool                                                         BoxMeshIsValid;                                    // 0x40(0x1)
	bool                                                         BarrelMeshIsValid;                                 // 0x41(0x1)
	struct FString                                               BoxMeshAssetPathName;                              // 0x48(0x10)
	struct FString                                               BarrelMeshAssetPathName;                           // 0x58(0x10)
};


// Size 0x10
struct AISpawnActionStateParams
{
public:
	float                                                        SpawnTimeMax;                                      // 0x0(0x4)
	bool                                                         BeginInvis;                                        // 0x4(0x1)
	float                                                        InvisTime;                                         // 0x8(0x4)
	bool                                                         SkipAnimTimeCheck;                                 // 0xc(0x1)
};


// Size 0x68
struct GuildInvitesRecievedModel
{
public:
	struct                                                       InviterUserPirateId;                               // 0x0(0x20)
	struct                                                       SignedGuildId;                                     // 0x20(0x28)
	struct                                                       InviteId;                                          // 0x48(0x10)
	struct FString                                               InviterSignature;                                  // 0x58(0x10)
};


// Size 0x20
struct InstrumentHandlePairedWithActor
{
public:
	class Actor*                                                 InstrumentActor;                                   // 0x0(0x8)
};


// Size 0x20
struct MerchantQuestContractExpiredNetworkEvent
{
public:
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x18(0x8)
};


// Size 0x60
struct ContestShipLiverySet
{
public:
	struct                                                       OwningCrewID;                                      // 0x0(0x10)
	map                                                          ShipLiveryTeamSet;                                 // 0x10(0x50)
};


// Size 0x20
struct QueryMigrationStatusRpc
{
public:
	class AthenaPlayerController*                                AthenaPlayerController;                            // 0x18(0x8)
};


// Size 0x78
struct PirateIdentity
{
public:
	struct                                                       UserId;                                            // 0x0(0x18)
	struct FString                                               PirateId;                                          // 0x18(0x10)
	map                                                          Claims;                                            // 0x28(0x50)
};


// Size 0x10
struct EventObjectWielded
{
public:
	interface                                                    Object;                                            // 0x0(0x10)
};


// Size 0x4
struct SetCurrentInteractionIndexEvent
{
public:
	int                                                          DesiredIndex;                                      // 0x0(0x4)
};


// Size 0x20
struct CatalogTab
{
public:
	struct FString                                               CatalogName;                                       // 0x0(0x10)
	struct FString                                               CatalogTabImageUrl;                                // 0x10(0x10)
};


// Size 0x10
struct OpenForListEntry
{
public:
	class Pawn*                                                  Pawn;                                              // 0x0(0x8)
	float                                                        TimeUntilDoorFullyOpen;                            // 0x8(0x4)
};


// Size 0x10
struct ResolutionTelemetryFragment
{
public:
	uint32                                                       ResolutionWidth;                                   // 0x0(0x4)
	uint32                                                       ResolutionHeight;                                  // 0x4(0x4)
	float                                                        ScreenPercentage;                                  // 0x8(0x4)
	bool                                                         DynamicResolution;                                 // 0xc(0x1)
};


// Size 0x10
struct TutorialAnimationResult
{
public:
	class FirstPersonAnimationInstance*                          AnimInstance;                                      // 0x8(0x8)
};


// Size 0x1
struct EventSpawnedAsSalvageItem
{
public:
	bool                                                         SpawnedAsSunkenItem;                               // 0x0(0x1)
};


// Size 0x98
struct StoreCatalogItem
{
public:
	struct FString                                               ProductId;                                         // 0x0(0x10)
	struct FString                                               Title;                                             // 0x10(0x10)
	struct FString                                               Description;                                       // 0x20(0x10)
	struct FString                                               FormattedPrice;                                    // 0x30(0x10)
	struct FString                                               FormattedBasePrice;                                // 0x40(0x10)
	struct FString                                               CurrencyCode;                                      // 0x50(0x10)
	bool                                                         IsOnSale;                                          // 0x60(0x1)
	struct                                                       SaleEndDate;                                       // 0x68(0x8)
	struct FString                                               ImageUri;                                          // 0x70(0x10)
	TArray<String>                                               MetaTags;                                          // 0x80(0x10)
	int                                                          DisplayPriority;                                   // 0x90(0x4)
};


// Size 0x10
struct EventExitedShipLadder
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	class Actor*                                                 Actor;                                             // 0x8(0x8)
};


// Size 0x8
struct EventResetSettingsGroup
{
public:
	struct FName                                                 SettingsGroupNameToReset;                          // 0x0(0x8)
};


// Size 0x18
struct BuoyantObjectSpawnDesc
{
public:
	float                                                        LifeTime;                                          // 0x0(0x4)
	float                                                        SpawnDepth;                                        // 0x4(0x4)
	struct                                                       Location;                                          // 0x8(0x8)
	class UClass*                                                Type;                                              // 0x10(0x8)
};


// Size 0x1f8
struct NpcTraderPromotionOffer
{
public:
	char                                                         ItemType;                                          // 0x1e0(0x1)
	struct FString                                               VoyageID;                                          // 0x1e8(0x10)
};


// Size 0x68
struct LiquidLauncherCollisionsParams
{
public:
	float                                                        CollisionCapsuleRadius;                            // 0x0(0x4)
	float                                                        LiquidPointTravelDistance;                         // 0x4(0x4)
	float                                                        InheritOwnerForwardVelocityScalar;                 // 0x8(0x4)
	float                                                        LiquidPointTravelTime;                             // 0xc(0x4)
	float                                                        LiquidPointFireRate;                               // 0x10(0x4)
	float                                                        MaxDistanceSquaredBetweenPointsBeforeDiscontinuity; // 0x14(0x4)
	int                                                          MaxNumOfHitsProccessedPerLiquidCollision;          // 0x18(0x4)
	struct                                                       LiquidOriginOffset;                                // 0x1c(0xc)
	struct                                                       LiquidOrientationOffset;                           // 0x28(0xc)
	class CurveFloat*                                            LiquidPointsTravelCurve;                           // 0x38(0x8)
	char                                                         CollisionChannel;                                  // 0x40(0x1)
	struct                                                       CollisionResponse;                                 // 0x41(0x20)
};


// Size 0x8
struct ItemLoadoutItemCategoryRemovedEvent
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
};


// Size 0x1
struct QuestTableShipState
{
public:
	bool                                                         HasLoot;                                           // 0x0(0x1)
};


// Size 0x28
struct CrewMigrationStatusInfo
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
	TArray<String>                                               CrewMigrationStatusLog;                            // 0x10(0x10)
	bool                                                         CrewMigrationStatusState;                          // 0x20(0x1)
};


// Size 0x3
struct AthenaAnimationLODSettings
{
public:
	char                                                         IKState;                                           // 0x0(0x1)
	char                                                         IKSolverType;                                      // 0x1(0x1)
	char                                                         IKFootPlantingState;                               // 0x2(0x1)
};


// Size 0xa8
struct PirateGeneratorBakeTelemetryEvent
{
public:
	struct                                                       Desc;                                              // 0x0(0x80)
	char                                                         Flags;                                             // 0x80(0x1)
	struct FString                                               Operation;                                         // 0x88(0x10)
	struct                                                       OperationId;                                       // 0x98(0x10)
};


// Size 0x10
struct DebugSuperSailorActionStateParams
{
public:
	float                                                        BaseForwardSpeed;                                  // 0x0(0x4)
	float                                                        YawSpeed;                                          // 0x4(0x4)
	float                                                        RightTriggerHeldSpdAmp;                            // 0x8(0x4)
	float                                                        RightTriggerHeldYawAmp;                            // 0xc(0x4)
};


// Size 0x4
struct EventStarvingAmountChanged
{
public:
	float                                                        PercentageStarved;                                 // 0x0(0x4)
};


// Size 0x40
struct NotesRemoteServiceNoteDetailModel
{
public:
	struct                                                       Id;                                                // 0x0(0x10)
	struct FString                                               NoteType;                                          // 0x10(0x10)
	struct FString                                               Title;                                             // 0x20(0x10)
	struct FString                                               Note;                                              // 0x30(0x10)
};


// Size 0x8
struct EventBrokeLeg
{
public:
	struct FName                                                 RumbleTag;                                         // 0x0(0x8)
};


// Size 0xa0
struct SittingActionStateParams
{
public:
	char                                                         ControllableObjectType;                            // 0x18(0x1)
	class UClass*                                                SeatAnimationId;                                   // 0x20(0x8)
	struct                                                       LookAtOffsetParams;                                // 0x28(0x1c)
	bool                                                         ShouldHideFirstPersonMesh;                         // 0x44(0x1)
	class WwiseEvent*                                            OnSitSfx;                                          // 0x48(0x8)
	class WwiseEvent*                                            OnStandSfx;                                        // 0x50(0x8)
	class WwiseObjectPoolWrapper*                                SeatPool;                                          // 0x58(0x8)
	bool                                                         AllowInteractWithOtherObjectsWhileSitting;         // 0x60(0x1)
	TArray<class Class*>                                         AllowedInteractableTypes;                          // 0x68(0x10)
	TArray<class Class*>                                         AllowedInteractionNotificationInputIds;            // 0x78(0x10)
	char                                                         DockingMode;                                       // 0x88(0x1)
	bool                                                         DisableDisengageInput;                             // 0x89(0x1)
	bool                                                         ThirdPersonCameraEnabled;                          // 0x8a(0x1)
	class AthenaSpringArmComponentParams*                        ThirdPersonCameraParams;                           // 0x90(0x8)
	bool                                                         CameraRollEnabled;                                 // 0x98(0x1)
	bool                                                         OffsetCameraUsingSeatRotation;                     // 0x99(0x1)
};


// Size 0x18
struct TeleportStageCompletedEvent
{
public:
	struct                                                       Id;                                                // 0x0(0x10)
	float                                                        Duration;                                          // 0x10(0x4)
	char                                                         Reason;                                            // 0x14(0x1)
	char                                                         CompletedStage;                                    // 0x15(0x1)
};


// Size 0x38
struct CinematicEmissaryNetworkEvent
{
public:
	int                                                          Level;                                             // 0x18(0x4)
	struct FName                                                 Tag;                                               // 0x1c(0x8)
	struct                                                       GuildId;                                           // 0x24(0x10)
};


// Size 0x1e8
struct OfferPurchasedEvent
{
public:
	struct                                                       Purchase;                                          // 0x0(0x1e0)
	struct FName                                                 NPCName;                                           // 0x1e0(0x8)
};


// Size 0x4
struct SinkShipGameServerRequestModel
{
public:
	int                                                          ShipNetGUID;                                       // 0x0(0x4)
};


// Size 0x30
struct AthenaAnimationAIKnockback
{
public:
	struct                                                       KnockbackAnimations;                               // 0x0(0x20)
	char                                                         AIKnockbackDirection;                              // 0x20(0x1)
	bool                                                         KnockbackActive;                                   // 0x24(0x1)
	class AnimSequence*                                          KnockbackAnimToUse;                                // 0x28(0x8)
};


// Size 0x8
struct PlayerStatOption
{
public:
	struct                                                       StatToFire;                                        // 0x0(0x4)
	bool                                                         FireForWholeCrew;                                  // 0x4(0x1)
};


// Size 0x28
struct AthenaAnimationWaterPumpAnimData
{
public:
	class AnimSequence*                                          IntoWaterPump;                                     // 0x0(0x8)
	class AnimSequence*                                          WaterPumpIdle;                                     // 0x8(0x8)
	class AnimSequence*                                          WaterPumpAction;                                   // 0x10(0x8)
	class AnimSequence*                                          WaterPumpActionOverlay;                            // 0x18(0x8)
	class AnimSequence*                                          OutOfWaterPump;                                    // 0x20(0x8)
};


// Size 0x10
struct ReplyToGuildInviteSuccessEvent
{
public:
	struct FString                                               GuildId;                                           // 0x0(0x10)
};


// Size 0x108
struct ContestMapLayoutCrew
{
public:
	struct                                                       CrewIcon;                                          // 0x0(0x30)
	struct                                                       ScoreIcon;                                         // 0x30(0x30)
	struct                                                       UnderlineIcon;                                     // 0x60(0x30)
	struct                                                       CrewName;                                          // 0x90(0x3c)
	struct                                                       Score;                                             // 0xcc(0x3c)
};


// Size 0xa0
struct AimSensitivityRuntimeData
{
public:
	map                                                          MouseData;                                         // 0x0(0x50)
	map                                                          ControllerData;                                    // 0x50(0x50)
};


// Size 0x8
struct EventSetFishingRodBend
{
public:
	struct                                                       RodBend;                                           // 0x0(0x8)
};


// Size 0x38
struct PlayerBucketScoopTelemetryEvent
{
public:
	struct FString                                               BucketContents;                                    // 0x0(0x10)
	struct                                                       ScoopID;                                           // 0x10(0x10)
	struct FString                                               ScoopSource;                                       // 0x20(0x10)
	float                                                        ScoopVolume;                                       // 0x30(0x4)
};


// Size 0x10
struct NPCDialogCustomLookAtInfo
{
public:
	struct FName                                                 OptionalSocketName;                                // 0x0(0x8)
	class SceneComponent*                                        TargetLookAtComponent;                             // 0x8(0x8)
};


// Size 0x1
struct TestProjectileWeaponParameters
{
public:
	bool                                                         PassCanTrigger;                                    // 0x0(0x1)
};


// Size 0x1
struct EventHUDMouseFocusRequest
{
public:
	bool                                                         RequestFocus;                                      // 0x0(0x1)
};


// Size 0x18
struct OverrideCrewSpawnTeleportLocation
{
public:
	class Actor*                                                 TeleportLocationActor;                             // 0x0(0x8)
	struct                                                       CrewId;                                            // 0x8(0x10)
};


// Size 0x48
struct UIPremiumStorePageTransitionTelemetryEvent
{
public:
	struct FString                                               CurrentPage;                                       // 0x0(0x10)
	struct FString                                               PreviousHighlight;                                 // 0x10(0x10)
	struct FString                                               PreviousPage;                                      // 0x20(0x10)
	struct FString                                               SessionId;                                         // 0x30(0x10)
	float                                                        TimeOnPreviousPage;                                // 0x40(0x4)
};


// Size 0x10
struct FaunaAnimationTurningStructure
{
public:
	class AnimSequence*                                          TurnLeft;                                          // 0x0(0x8)
	class AnimSequence*                                          TurnRight;                                         // 0x8(0x8)
};


// Size 0x10
struct RowboatPersistenceModel
{
public:
	struct FName                                                 Class;                                             // 0x0(0x8)
	struct FName                                                 Livery;                                            // 0x8(0x8)
};


// Size 0x14
struct PlayerBuriedItemServiceNumMapsTakenFromStoreThisDayPerCrew
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
	int                                                          NumMaps;                                           // 0x10(0x4)
};


// Size 0x18
struct IndividualMeshScoring
{
public:
	struct                                                       RegistrationToken;                                 // 0x0(0x10)
	class Actor*                                                 MeshOwner;                                         // 0x10(0x8)
};


// Size 0x50
struct SwitchMechanismTriggerPosition
{
public:
	char                                                         MechanismState;                                    // 0x0(0x1)
	struct                                                       PivotTransform;                                    // 0x10(0x30)
	class WwiseEvent*                                            SwitchStartTransitionAudioEvent;                   // 0x40(0x8)
	class WwiseEvent*                                            SwitchStopTransitionAudioEvent;                    // 0x48(0x8)
};


// Size 0x28
struct CaptainsLogInteractableActionStateParams
{
public:
	class UClass*                                                ItemToSpawn;                                       // 0x18(0x8)
	float                                                        TimeBeforeUndock;                                  // 0x20(0x4)
};


// Size 0x10
struct CreateSessionFailedEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x20
struct RewardDistributionModelData
{
public:
	struct                                                       ConsistentPercentage;                              // 0x0(0x8)
	struct                                                       RelativePercentage;                                // 0x8(0x18)
};


// Size 0x50
struct MeshMemoryConstraintTelemetryBudgetFragment
{
public:
	struct FString                                               Budget;                                            // 0x0(0x10)
	int                                                          MemoryUsedInBytes;                                 // 0x10(0x4)
	int                                                          MaximumMemoryUsedInBytes;                          // 0x14(0x4)
	int                                                          NumUniqueMeshes;                                   // 0x18(0x4)
	int                                                          NumUniqueMeshesUsingFallback;                      // 0x1c(0x4)
	int                                                          NumTotalMeshesUsingFallback;                       // 0x20(0x4)
	int                                                          MemoryUsedOfNoFallbackMeshesInBytes;               // 0x24(0x4)
	int                                                          NumUniqueNoFallbackMeshes;                         // 0x28(0x4)
	int                                                          NumTotalNoFallbackMeshes;                          // 0x2c(0x4)
	int                                                          ThresholdScale;                                    // 0x30(0x4)
	struct                                                       RegisteredMeshes;                                  // 0x38(0x18)
};


// Size 0x18
struct BrazierExtinguishCrewSizeTimes
{
public:
	int                                                          CrewSize;                                          // 0x0(0x4)
	TArray<float>                                                ExtinguishTimes;                                   // 0x8(0x10)
};


// Size 0x10
struct FragmentMarker
{
public:
	struct FString                                               Marker;                                            // 0x0(0x10)
};


// Size 0x198
struct EventCompanyScreenDisplayInformationResponse
{
public:
	struct                                                       CompanyData;                                       // 0x0(0x198)
};


// Size 0x8
struct HealthRegenState
{
public:
	float                                                        CurrentPoolAmount;                                 // 0x0(0x4)
	char                                                         State;                                             // 0x4(0x1)
};


// Size 0x10
struct EventCustomizableActorChanged
{
public:
	class Actor*                                                 CustomizableActor;                                 // 0x0(0x8)
	bool                                                         StripOverrideMaterials;                            // 0x8(0x1)
};


// Size 0x38
struct EventSpawnedAsGhostNotification
{
public:
	struct FText                                                 NotificationText;                                  // 0x0(0x38)
};


// Size 0xa8
struct TutorialStepPlayIntroAnimatic
{
public:
	class FirstPersonAnimationInstance*                          AnimInstance;                                      // 0x80(0x8)
};


// Size 0x10
struct TunnelOfTheDamnedFactionThemedPopUpDesc
{
public:
	class UClass*                                                Faction;                                           // 0x0(0x8)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x8(0x8)
};


// Size 0x10
struct EventCompanyReputationCampaignInformationRequest
{
public:
	struct FString                                               CompanyId;                                         // 0x0(0x10)
};


// Size 0x10
struct KrakenSpawnLocationExclusionZone
{
public:
	struct                                                       Centre;                                            // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
};


// Size 0x58
struct CanvasWorldMapShipLocation
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
	class UClass*                                                ShipSize;                                          // 0x10(0x8)
	struct                                                       Location;                                          // 0x18(0x8)
	float                                                        Rotation;                                          // 0x20(0x4)
	struct                                                       LerpData;                                          // 0x24(0x10)
	bool                                                         IsInAlliance;                                      // 0x34(0x1)
	bool                                                         IsInFaction;                                       // 0x35(0x1)
	bool                                                         IsFactionMaxRank;                                  // 0x36(0x1)
	bool                                                         IsInvadingShip;                                    // 0x37(0x1)
	struct FName                                                 CrewFactionName;                                   // 0x38(0x8)
	char                                                         ReapersMarkLevel;                                  // 0x40(0x1)
	char                                                         EmissaryLevel;                                     // 0x41(0x1)
	bool                                                         IsMaxGradedGuildShip;                              // 0x42(0x1)
	class Texture*                                               CrewLiveryOverlayIcon;                             // 0x48(0x8)
	bool                                                         IsReapersTrackedShip;                              // 0x50(0x1)
	bool                                                         IsInTunnel;                                        // 0x51(0x1)
};


// Size 0x28
struct StreamedLevelData
{
public:
	char                                                         StreamedLevelIdentity;                             // 0x0(0x1)
	int                                                          StreamedLevelId;                                   // 0x4(0x4)
	TArray<class SpawnLocation*>                                 ExitPointsFromSpawnedLevel;                        // 0x8(0x10)
	TArray<class SpawnLocation*>                                 ExitPointsFromEntrance;                            // 0x18(0x10)
};


// Size 0x60
struct RemoveWorldEventGameServerRequestModel
{
public:
	struct FString                                               EventType;                                         // 0x0(0x10)
	map                                                          Parameters;                                        // 0x10(0x50)
};


// Size 0x30
struct PlayerJoinedGuildEvent
{
public:
	struct                                                       GuildId;                                           // 0x0(0x10)
	struct                                                       JoiningPlayer;                                     // 0x10(0x20)
};


// Size 0x358
struct AthenaAnimationPersistentItemAnimations
{
public:
	struct                                                       EquipAnimations;                                   // 0x0(0x40)
	struct                                                       NominatedItemFallbackItemUseAnimations;            // 0x40(0x2a0)
	struct                                                       NominatedItemFallbackLocomotionAnimations;         // 0x2e0(0x40)
	struct                                                       NominatedItemFallbackJumpingAnimations;            // 0x320(0x20)
	struct                                                       NominatedItemFallbackIdleAnimations;               // 0x340(0x18)
};


// Size 0x48
struct PremiumCatalogOfferGroup
{
public:
	struct FText                                                 Title;                                             // 0x0(0x38)
	TArray<struct Guid>                                          Children;                                          // 0x38(0x10)
};


// Size 0x48
struct ModalInteractionActionStateSerialisableData
{
public:
	struct                                                       Interaction;                                       // 0x30(0x14)
};


// Size 0x18
struct FeatureLockedAIShipBattles
{
public:
	struct                                                       Feature;                                           // 0x0(0xc)
	class AIShipBattlesDataAsset*                                BattlesData;                                       // 0x10(0x8)
};


// Size 0x40
struct HealthChange
{
public:
	float                                                        From;                                              // 0x0(0x4)
	float                                                        To;                                                // 0x4(0x4)
	char                                                         Reason;                                            // 0x8(0x1)
	class Actor*                                                 DirectInstigator;                                  // 0x10(0x8)
	class Actor*                                                 RootInstigator;                                    // 0x18(0x8)
	struct                                                       IncidentId;                                        // 0x20(0x10)
	struct                                                       DirectInstigatorLocation;                          // 0x30(0xc)
};


// Size 0x8
struct OtherPartyTelemetryFragmentInput
{
public:
	class Actor*                                                 OtherParty;                                        // 0x0(0x8)
};


// Size 0x1
struct EventPlayerControllerHitNotification
{
public:
	bool                                                         PlaySfx;                                           // 0x0(0x1)
};


// Size 0x4
struct RequestSeasonPassRealMoneyPriceEvent
{
public:
	int                                                          Price;                                             // 0x0(0x4)
};


// Size 0x4
struct CapstanSnapshot
{
public:
	float                                                        Raised;                                            // 0x0(0x4)
};


// Size 0x48
struct DisplayServiceStatusNotificationClient
{
public:
	uint32                                                       NotificationId;                                    // 0x0(0x4)
	struct FText                                                 NotificationText;                                  // 0x8(0x38)
	struct                                                       Duration;                                          // 0x40(0x8)
};


// Size 0x1a0
struct LightingControllerPostProcessParams
{
public:
	struct                                                       RainPostProcessParams;                             // 0x0(0xc0)
	struct                                                       UnderwaterPostProcessParams;                       // 0xc0(0xc0)
	class MaterialInterface*                                     PostProcessUnderWaterPrelightingMaterial;          // 0x180(0x8)
	class MaterialInterface*                                     PostProcessUnderwaterCausticsMaterial;             // 0x188(0x8)
	class MaterialInterface*                                     PostProcessDistortionMaterial;                     // 0x190(0x8)
	class MaterialInterface*                                     PostProcessColourOverlayMaterial;                  // 0x198(0x8)
};


// Size 0x98
struct EmblemUnlockedMessage
{
public:
	struct                                                       PirateIdentity;                                    // 0x0(0x78)
	struct                                                       EmblemId;                                          // 0x78(0x10)
	struct FString                                               Sig;                                               // 0x88(0x10)
};


// Size 0x30
struct StaggerModifiersEntry
{
public:
	char                                                         StaggerToModify;                                   // 0x0(0x1)
	TArray<char>                                                 StaggersThatCancelThisModifier;                    // 0x8(0x10)
	bool                                                         OnlyWhenSprinting;                                 // 0x18(0x1)
	struct                                                       Modifiers;                                         // 0x1c(0x10)
};


// Size 0x10
struct EventCompanyScreenDisplayInformationRequest
{
public:
	struct FString                                               CompanyId;                                         // 0x0(0x10)
};


// Size 0x28
struct UIMessageOfTheDayCloseTelemetryEvent
{
public:
	struct FString                                               SessionId;                                         // 0x0(0x10)
	struct FString                                               MessageId;                                         // 0x10(0x10)
	float                                                        TimeSpentInMessage;                                // 0x20(0x4)
};


// Size 0x40
struct StartInteractionEvent
{
public:
	struct                                                       Definition;                                        // 0x0(0x40)
};


// Size 0xb0
struct CampaignGoalProgressMessage
{
public:
	int64                                                        PreviousProgress;                                  // 0x0(0x8)
	int64                                                        CurrentProgress;                                   // 0x8(0x8)
	int64                                                        CompletionThreshold;                               // 0x10(0x8)
	struct                                                       GoalId;                                            // 0x18(0x10)
	struct                                                       ActiveFrom;                                        // 0x28(0x8)
	struct                                                       ActiveUtil;                                        // 0x30(0x8)
	struct                                                       Pirate;                                            // 0x38(0x78)
};


// Size 0x500
struct WeightedQuestParams
{
public:
	TArray<char>                                                 LocationFilters;                                   // 0x0(0x10)
	float                                                        Weight;                                            // 0x10(0x4)
	struct                                                       Params;                                            // 0x18(0x4e8)
};


// Size 0x20
struct EventPlayerEnteredIslandVicinity
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	struct FName                                                 IslandName;                                        // 0x10(0x8)
};


// Size 0x20
struct VirtualActionBindingDefinition
{
public:
	TArray<struct Name>                                          ActionNames;                                       // 0x0(0x10)
	struct FString                                               BindingName;                                       // 0x10(0x10)
};


// Size 0x8
struct EventPlayerChangedTableMapPan
{
public:
	struct                                                       PanDelta;                                          // 0x0(0x8)
};


// Size 0x118
struct ScoreRewardRequestEvent
{
public:
	struct FName                                                 ScoreId;                                           // 0x0(0x8)
	int                                                          ScoreValue;                                        // 0x8(0x4)
	struct                                                       Recipient;                                         // 0x10(0xc8)
	struct                                                       RequestID;                                         // 0xd8(0x10)
	struct FName                                                 CompanyAffiliation;                                // 0xe8(0x8)
	struct                                                       BootyId;                                           // 0xf0(0x10)
	struct                                                       GuildId;                                           // 0x100(0x10)
	char                                                         PlayMode;                                          // 0x110(0x1)
	char                                                         PlayModeVariant;                                   // 0x111(0x1)
	char                                                         NotifyPlayer;                                      // 0x112(0x1)
	char                                                         IsSovereignHandIn;                                 // 0x113(0x1)
};


// Size 0x58
struct DeadActionStateParams
{
public:
	float                                                        FadeDelay;                                         // 0x0(0x4)
	float                                                        FadeDuration;                                      // 0x4(0x4)
	float                                                        FadeEventTimeout;                                  // 0x8(0x4)
	float                                                        FadeServerTimeout;                                 // 0xc(0x4)
	struct                                                       FadeColour;                                        // 0x10(0x10)
	bool                                                         FadeAudio;                                         // 0x20(0x1)
	float                                                        DeathCameraBlackFadeDelay;                         // 0x24(0x4)
	float                                                        DeathCameraBlackFadeDuration;                      // 0x28(0x4)
	float                                                        DeathCameraBlackFadeEventTimeout;                  // 0x2c(0x4)
	float                                                        DeathCameraBlackFadeServerTimeout;                 // 0x30(0x4)
	struct                                                       DeathCameraBlackFadeColour;                        // 0x34(0x10)
	float                                                        DeathCameraDelayBeforeEvaporate;                   // 0x44(0x4)
	bool                                                         DeathCameraFadeAudio;                              // 0x48(0x1)
	float                                                        DeathCameraDelay;                                  // 0x4c(0x4)
	class GhostDataAsset*                                        PlayerGhostDataAsset;                              // 0x50(0x8)
};


// Size 0x10
struct AthenaAnimationUndoRepairAnimData
{
public:
	class AnimSequence*                                          UndoRepairInto;                                    // 0x0(0x8)
	class AnimSequence*                                          UndoRepairLoop;                                    // 0x8(0x8)
};


// Size 0x118
struct AchievementSailWithFlameOfFateColoursAboard
{
public:
	uint32                                                       RequiredTravelDistanceInMetres;                    // 0x0(0x4)
	class Ship*                                                  Ship;                                              // 0x8(0x8)
	TArray<class ShipInteractableLight*>                         ShipLights;                                        // 0x10(0x10)
};


// Size 0x30
struct CreativeCrewMember
{
public:
	int                                                          CrewId;                                            // 0x0(0x4)
	struct FString                                               GamerTag;                                          // 0x8(0x10)
	struct FString                                               Xuid;                                              // 0x18(0x10)
	char                                                         Platform;                                          // 0x28(0x1)
};


// Size 0x34
struct DockableBaseActionStateParams
{
public:
	struct                                                       LookAtOffsetParams;                                // 0x18(0x1c)
};


// Size 0x28
struct BakedInvasionTunnelSceneryTileInstances
{
public:
	class StaticMesh*                                            MeshType;                                          // 0x0(0x8)
	TArray<class MaterialInterface*>                             MeshMaterials;                                     // 0x8(0x10)
	TArray<struct Transform>                                     Instances;                                         // 0x18(0x10)
};


// Size 0xb0
struct CampaignGoalProgressEvent
{
public:
	struct                                                       PirateIdentity;                                    // 0x0(0x78)
	int64                                                        PreviousProgress;                                  // 0x78(0x8)
	int64                                                        CurrentProgress;                                   // 0x80(0x8)
	int64                                                        CompletionThreshold;                               // 0x88(0x8)
	struct                                                       GoalId;                                            // 0x90(0x10)
	struct                                                       ActiveFrom;                                        // 0xa0(0x8)
	struct                                                       ActiveUntil;                                       // 0xa8(0x8)
};


// Size 0x10
struct ShipCustomizationChestMutualExclusion
{
public:
	class UClass*                                                A;                                                 // 0x0(0x8)
	class UClass*                                                B;                                                 // 0x8(0x8)
};


// Size 0xa0
struct QuestTableTileOverview
{
public:
	struct FString                                               TileId;                                            // 0x0(0x10)
	struct FString                                               CondensedTitle;                                    // 0x10(0x10)
	struct FString                                               Title;                                             // 0x20(0x10)
	struct FString                                               Subtitle;                                          // 0x30(0x10)
	struct FString                                               Description;                                       // 0x40(0x10)
	struct FString                                               BackgroundImageUrl;                                // 0x50(0x10)
	struct FName                                                 TileType;                                          // 0x60(0x8)
	bool                                                         HighSeasOnly;                                      // 0x68(0x1)
	struct FString                                               PreviewTileIconImageUrl;                           // 0x70(0x10)
	struct FString                                               BladeFrameImageURL;                                // 0x80(0x10)
	struct FString                                               WatermarkImageUrl;                                 // 0x90(0x10)
};


// Size 0x10
struct ServerMigrateFromTelemetryEvent
{
public:
	struct                                                       MigrationId;                                       // 0x0(0x10)
};


// Size 0x28
struct SaveToLoadoutItemCost
{
public:
	struct FString                                               Name;                                              // 0x0(0x10)
	struct FString                                               Currency;                                          // 0x10(0x10)
	int                                                          Amount;                                            // 0x20(0x4)
};


// Size 0x8
struct KeyTakenEvent
{
public:
	class ItemInfo*                                              KeyTaken;                                          // 0x0(0x8)
};


// Size 0x3f0
struct AthenaAnimationFishing
{
public:
	bool                                                         AnimationOverride;                                 // 0x0(0x1)
	class Actor*                                                 FishingRodActor;                                   // 0x3d0(0x8)
	class Actor*                                                 FishingFloat;                                      // 0x3d8(0x8)
	class AthenaAnimationInstance*                               OwningAnimationInstance;                           // 0x3e0(0x8)
};


// Size 0x28
struct AddAITypeSpawnRuleGameServerRequestModel
{
public:
	struct FString                                               TypeName;                                          // 0x0(0x10)
	struct FString                                               Region;                                            // 0x10(0x10)
	bool                                                         Enabled;                                           // 0x20(0x1)
};


// Size 0x4c
struct UseLadderActionStateParams
{
public:
	float                                                        ClimbUpSpeed;                                      // 0x10(0x4)
	float                                                        ClimbDownSpeed;                                    // 0x14(0x4)
	float                                                        LadderRungHeight;                                  // 0x18(0x4)
	float                                                        SpeedToEnterSlidingAnimationMs;                    // 0x1c(0x4)
	float                                                        MaxLadderSlidingSpeedMs;                           // 0x20(0x4)
	float                                                        InitialDockBottomPitch;                            // 0x24(0x4)
	float                                                        InitialDockTopPitch;                               // 0x28(0x4)
	float                                                        TopBottomTolerance;                                // 0x2c(0x4)
	struct                                                       LookAtOffsetParams;                                // 0x30(0x1c)
};


// Size 0x1c
struct QueuedCutsceneData
{
public:
	struct FName                                                 CutsceneName;                                      // 0x0(0x8)
};


// Size 0x100
struct AthenaAnimationDeath
{
public:
	struct                                                       DeathData;                                         // 0x8(0x38)
	struct                                                       DeathAnimData;                                     // 0x40(0x40)
	class AthenaAnimationDeathDataAsset*                         DeathDataAsset;                                    // 0x80(0x8)
};


// Size 0x40
struct AthenaAnimationObjectEquipAnimations
{
public:
	class AnimSequence*                                          Equip;                                             // 0x0(0x8)
	class BlendSpace*                                            EquipAsBlendSpace;                                 // 0x8(0x8)
	class BlendSpace*                                            EquipSwimming;                                     // 0x10(0x8)
	class AnimSequence*                                          UnEquip;                                           // 0x18(0x8)
	class BlendSpace*                                            UnEquipAsBlendSpace;                               // 0x20(0x8)
	class AnimSequence*                                          Pickup;                                            // 0x28(0x8)
	class AnimSequence*                                          Drop;                                              // 0x30(0x8)
	bool                                                         UseEquipBlendSpace;                                // 0x38(0x1)
	bool                                                         UseUnequipBlendSpace;                              // 0x39(0x1)
};


// Size 0x1
struct UseMaidenVoyageFlowEvent
{
public:
	bool                                                         IsNewPlayer;                                       // 0x0(0x1)
};


// Size 0x1
struct EventIsDrunk
{
public:
	bool                                                         bIsDrunk;                                          // 0x0(0x1)
};


// Size 0x34
struct DockableCutsceneActionStateParams
{
public:
	struct                                                       LookAtOffsetParams;                                // 0x18(0x1c)
};


// Size 0x10
struct TransientActorEntry
{
public:
	class Actor*                                                 Actor;                                             // 0x0(0x8)
};


// Size 0x8
struct EventPlayerCapstanUsageStart
{
public:
	class Actor*                                                 ObjectBeingUsed;                                   // 0x0(0x8)
};


// Size 0x38
struct QuestVariableTransform
{
public:
	struct FName                                                 SocketName;                                        // 0x30(0x8)
};


// Size 0x70
struct CloudVisualParameters
{
public:
	bool                                                         RenderInMainPass;                                  // 0x0(0x1)
	struct                                                       ScalingVector;                                     // 0x4(0xc)
	struct                                                       BillboardScale;                                    // 0x10(0x8)
	struct                                                       BillboardRandomScale;                              // 0x18(0x8)
	struct                                                       BillboardRearCutOff;                               // 0x20(0x8)
	struct                                                       BillboardForeCutOff;                               // 0x28(0x8)
	struct                                                       BillboardSink;                                     // 0x30(0x8)
	float                                                        BillboardScaleAlphaDependence;                     // 0x38(0x4)
	float                                                        BillboardRotationRate;                             // 0x3c(0x4)
	float                                                        DistanceFadeExponent;                              // 0x40(0x4)
	float                                                        TurbulenceScale;                                   // 0x44(0x4)
	float                                                        TurbulenceStrength;                                // 0x48(0x4)
	float                                                        FluffCullDistance;                                 // 0x4c(0x4)
	class MaterialInterface*                                     MaterialTemplatePointCloudSolid;                   // 0x50(0x8)
	class MaterialInterface*                                     MaterialTemplatePointCloudFluffy;                  // 0x58(0x8)
	class MaterialInterface*                                     MaterialTemplateStreetCloudSolid;                  // 0x60(0x8)
	class MaterialInterface*                                     MaterialTemplateStreetCloudFluffy;                 // 0x68(0x8)
};


// Size 0x4
struct EventCharacterStartedDrowning
{
public:
	float                                                        TimeTillDrown;                                     // 0x0(0x4)
};


// Size 0x60
struct QuestTableExperiencesModel
{
public:
	struct                                                       TileOverviews;                                     // 0x0(0x20)
	struct                                                       TileDetails;                                       // 0x20(0x40)
};


// Size 0x10
struct GameplayEventExclusionInfo
{
public:
	class UClass*                                                Type;                                              // 0x0(0x8)
	float                                                        ExclusionRadius;                                   // 0x8(0x4)
};


// Size 0x10
struct OnStartSprintingOnWalkwayEvent
{
public:
	class WwiseEvent*                                            WalkwaySprintLoopStart;                            // 0x0(0x8)
	class WwiseEvent*                                            WalkwayLoopEnd;                                    // 0x8(0x8)
};


// Size 0x58
struct AthenaAnimationCustomSkeletonAnimationBlueprintData
{
public:
	bool                                                         SequenceActive;                                    // 0x0(0x1)
	bool                                                         LoopActive;                                        // 0x1(0x1)
	int                                                          ActiveSequenceIndex;                               // 0x4(0x4)
	bool                                                         IsOneShot;                                         // 0x8(0x1)
	struct                                                       BlueprintPlayingAnimations;                        // 0x10(0x38)
	class NPCHeldObjectData*                                     WieldableCosmeticItemList;                         // 0x48(0x8)
	char                                                         CustomAnimationState;                              // 0x50(0x1)
	float                                                        BlendTime;                                         // 0x54(0x4)
};


// Size 0x10
struct BootFlowSetEngagementMessage
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x38
struct RepairLoadoutFromSeedRpc
{
public:
	TArray<int>                                                  Seeds;                                             // 0x18(0x10)
	TArray<struct StringClassReference>                          CategoriesToApply;                                 // 0x28(0x10)
};


// Size 0x8
struct EventPlayerLeftProximity
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x38
struct FortTargetKilledTelemetryEvent
{
public:
	struct                                                       FortKeyId;                                         // 0x0(0x10)
	struct FString                                               FortTargetName;                                    // 0x10(0x10)
	struct                                                       FortKeyDroppedLocation;                            // 0x20(0xc)
	struct FName                                                 FortType;                                          // 0x2c(0x8)
};


// Size 0x1
struct EnableDefaultStormsGameServerRequestModel
{
public:
	bool                                                         Enable;                                            // 0x0(0x1)
};


// Size 0x100
struct AthenaAnimationAsyncLoadedLocomotionAnimations
{
public:
	assetobject                                                  Locomotion1;                                       // 0x0(0x20)
	assetobject                                                  Locomotion2;                                       // 0x20(0x20)
	assetobject                                                  Locomotion3;                                       // 0x40(0x20)
	assetobject                                                  Locomotion4;                                       // 0x60(0x20)
	assetobject                                                  LocomotionTurningLeft;                             // 0x80(0x20)
	assetobject                                                  LocomotionTurningRight;                            // 0xa0(0x20)
	assetobject                                                  LocomotionOutOf;                                   // 0xc0(0x20)
	assetobject                                                  LocomotionSwimming;                                // 0xe0(0x20)
};


// Size 0x4
struct AchievementKillOpponentFromBehindWithBlunderbuss
{
public:
	float                                                        FacingDirAngleTolerance;                           // 0x0(0x4)
};


// Size 0x30
struct ProjectileWeaponFireStatsTelemetryEvent
{
public:
	float                                                        AimPositionDifference;                             // 0x0(0x4)
	float                                                        AimPositionCorrection;                             // 0x4(0x4)
	float                                                        LatencyMs;                                         // 0x8(0x4)
	struct                                                       AttackId;                                          // 0xc(0x10)
	struct FString                                               WeaponType;                                        // 0x20(0x10)
};


// Size 0x10
struct CrewCancelVoteToBrigEvent
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
};


// Size 0x1c
struct ShipLeakParams
{
public:
	float                                                        InternalWaterSamplePositionTopOffset;              // 0x0(0x4)
	float                                                        InternalWaterSamplePositionBottomOffset;           // 0x4(0x4)
	float                                                        WaterSplashDelayMin;                               // 0x8(0x4)
	float                                                        WaterSplashDelayMax;                               // 0xc(0x4)
	float                                                        HullFloodedPercentageToShiftWaterSamplingPos;      // 0x10(0x4)
	float                                                        WaterSampleOffsetBelowHullFloodThreshold;          // 0x14(0x4)
	float                                                        WaterSampleOffsetAboveHullFloodThreshold;          // 0x18(0x4)
};


// Size 0x4
struct HaulItemDescSpawnDataKey
{
public:
	char                                                         SeaRegionIndex;                                    // 0x0(0x1)
	char                                                         HaulIndex;                                         // 0x1(0x1)
	uint16                                                       ItemSpawnDataIndex;                                // 0x2(0x2)
};


// Size 0x58
struct LoadoutCacheEntry
{
public:
	struct FString                                               PirateId;                                          // 0x0(0x10)
	struct                                                       Loadout;                                           // 0x10(0x48)
};


// Size 0x18
struct HUDBlur
{
public:
	class MaterialParameterCollectionInstance*                   ScreenEffectsMaterialParameterCollectionInstance;  // 0x0(0x8)
};


// Size 0x20
struct DebugSuperSailorSetSpeedAmpRPCEvent
{
public:
	float                                                        FwdSpdAmp;                                         // 0x18(0x4)
	float                                                        YawSpdAmp;                                         // 0x1c(0x4)
};


// Size 0x18
struct CompanyProgressDistinctionIcon
{
public:
	int                                                          RequiredLevel;                                     // 0x0(0x4)
	struct                                                       Icon;                                              // 0x8(0x10)
};


// Size 0x4
struct RemoveFogBankGameServerRequestModel
{
public:
	int                                                          ActorId;                                           // 0x0(0x4)
};


// Size 0x40
struct AthenaAnimationPulleyControl
{
public:
	TArray<char>                                                 PulleyObjectTypes;                                 // 0x0(0x10)
	float                                                        MaxRate;                                           // 0x10(0x4)
	float                                                        ForceMultiplier;                                   // 0x14(0x4)
	float                                                        PulleyMovementForce;                               // 0x18(0x4)
	bool                                                         UsingPulley;                                       // 0x1c(0x1)
	bool                                                         MovingPulley;                                      // 0x1d(0x1)
	bool                                                         LookAtOffsetSet;                                   // 0x1e(0x1)
	bool                                                         LookingRight;                                      // 0x1f(0x1)
};


// Size 0x10
struct AssociatedCompanies
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	struct FName                                                 FeatureToggle;                                     // 0x8(0x8)
};


// Size 0x58
struct NPCReactionVOEntry
{
public:
	assetclass                                                   ActorToReactTo;                                    // 0x0(0x20)
	struct FName                                                 VOGroupName;                                       // 0x20(0x8)
	struct                                                       VOCooldown;                                        // 0x28(0x30)
};


// Size 0x18
struct GuildIconTextureKeyValue
{
public:
	struct FString                                               ImageKey;                                          // 0x0(0x10)
	class Texture*                                               Image;                                             // 0x10(0x8)
};


// Size 0x8
struct ThrowingKnifeProxySpawnEvent
{
public:
	class ItemProxy*                                             Proxy;                                             // 0x0(0x8)
};


// Size 0x60
struct NPCDialogHeaderByConditionText
{
public:
	struct FText                                                 Text;                                              // 0x0(0x38)
	class UClass*                                                InteractResponse;                                  // 0x38(0x8)
	class WwiseEvent*                                            InteractionAudioEvent;                             // 0x40(0x8)
	class UClass*                                                InteractParticipantType;                           // 0x48(0x8)
	TArray<class NPCDialogConditional*>                          Conditions;                                        // 0x50(0x10)
};


// Size 0x1
struct EnableMovementDuringRadialEvent
{
public:
	bool                                                         EnableMovementDuringRadial;                        // 0x0(0x1)
};


// Size 0x18
struct PlayerEmoteTelemetryEvent
{
public:
	struct FString                                               EmoteName;                                         // 0x0(0x10)
	uint32                                                       EmoteDuration;                                     // 0x10(0x4)
};


// Size 0x60
struct EquipWeaponOnServerRpc
{
public:
	class ProjectileWeapon*                                      Weapon;                                            // 0x18(0x8)
	struct                                                       EquipRequest;                                      // 0x20(0x40)
};


// Size 0xc0
struct RPCTelemetryFragment
{
public:
	struct                                                       RPCStats;                                          // 0x0(0xc0)
};


// Size 0x10
struct CrewBeganTaleEvent
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
};


// Size 0x28
struct SyncLoad
{
public:
	struct FString                                               PackageOrObject;                                   // 0x0(0x10)
	struct FString                                               Outer;                                             // 0x10(0x10)
	double                                                       DurationInSeconds;                                 // 0x20(0x8)
};


// Size 0x10
struct AggressiveGhostShipAnchorDropTelemetryEvent
{
public:
	struct                                                       ShipId;                                            // 0x0(0x10)
};


// Size 0x40
struct IsWieldingItemCategoryCondition
{
public:
	TArray<Class>                                                TargetItemCategories;                              // 0x28(0x10)
	bool                                                         InvalidIfStashed;                                  // 0x38(0x1)
};


// Size 0x10
struct EventDiggingStarted
{
public:
	char                                                         DigDirection;                                      // 0x0(0x1)
	class Actor*                                                 ActorBeingDugUp;                                   // 0x8(0x8)
};


// Size 0x1
struct EventSwimmingCreatureUnderwaterStateChange
{
public:
	bool                                                         IsAboveWater;                                      // 0x0(0x1)
};


// Size 0x48
struct AthenaAnimationHitReactsSelectedAnimations
{
public:
	class BlendSpace1D*                                          SelectedHitReact0;                                 // 0x0(0x8)
	class BlendSpace1D*                                          SelectedHitReactItem0;                             // 0x8(0x8)
	class BlendSpace1D*                                          SelectedHitReactItemAction0;                       // 0x10(0x8)
	class BlendSpace1D*                                          SelectedHitReactSubtle0;                           // 0x18(0x8)
	class BlendSpace1D*                                          SelectedHitReact1;                                 // 0x20(0x8)
	class BlendSpace1D*                                          SelectedHitReactItem1;                             // 0x28(0x8)
	class BlendSpace1D*                                          SelectedHitReactItemAction1;                       // 0x30(0x8)
	class BlendSpace1D*                                          SelectedHitReactSubtle1;                           // 0x38(0x8)
	class BlendSpace1D*                                          SelectedOverrideHitReact;                          // 0x40(0x8)
};


// Size 0xc
struct FactionStatsInformation
{
public:
	int                                                          TotalRivalShipsSunk;                               // 0x0(0x4)
	int                                                          HighestFactionStreak;                              // 0x4(0x4)
	int                                                          HighestHourglassValue;                             // 0x8(0x4)
};


// Size 0x8
struct CapstanNetState
{
public:
	float                                                        TargetRatio;                                       // 0x0(0x4)
	bool                                                         IsLocked;                                          // 0x4(0x1)
};


// Size 0x10
struct HealthChangeAudio
{
public:
	char                                                         Reason;                                            // 0x0(0x1)
	class WwiseEvent*                                            Sfx;                                               // 0x8(0x8)
};


// Size 0x40
struct CaptainsLogPartDesc
{
public:
	struct                                                       BookSkeletalMesh;                                  // 0x0(0x10)
	int64                                                        BookSkeletalMeshResourceSize;                      // 0x10(0x8)
	struct                                                       BookStaticMesh;                                    // 0x18(0x10)
	int64                                                        BookStaticMeshResourceSize;                        // 0x28(0x8)
	class MaterialInterface*                                     WaterloggedTexture;                                // 0x30(0x8)
	class MaterialInterface*                                     RuinedTexture;                                     // 0x38(0x8)
};


// Size 0x10
struct FailCollisions
{
public:
	class TriggerBase*                                           Collider;                                          // 0x0(0x8)
	char                                                         OverlapFailCondition;                              // 0x8(0x1)
};


// Size 0x88
struct GuildOverviewForInvite
{
public:
	struct FString                                               GuildId;                                           // 0x0(0x10)
	int                                                          NumberOfMembers;                                   // 0x10(0x4)
	int                                                          NumberOfShips;                                     // 0x14(0x4)
	struct                                                       GuildBranding;                                     // 0x18(0x50)
	struct                                                       Owner;                                             // 0x68(0x20)
};


// Size 0x30
struct AccoladeBreakDownTotalModel
{
public:
	struct                                                       ProgressId;                                        // 0x0(0x24)
	int64                                                        ProgressValue;                                     // 0x28(0x8)
};


// Size 0x1648
struct AthenaAnimationLoadOnDemandItemsAnimationData
{
public:
	struct                                                       FishingAnimationsToLoad;                           // 0x0(0x1e0)
	struct                                                       ItemUsageAnimationsToLoad;                         // 0x1e0(0x9e8)
	struct                                                       LocomotionAnimationsToLoad;                        // 0xbc8(0x100)
	struct                                                       JumpingAnimationsToLoad;                           // 0xcc8(0x80)
	struct                                                       IdleAnimationsToLoad;                              // 0xd48(0x60)
	assetobject                                                  HandAdditiveToLoad;                                // 0xda8(0x20)
	struct                                                       CachedItemAnimations;                              // 0xdc8(0x3f0)
	struct                                                       ItemFallbackAnimations;                            // 0x11b8(0x3f0)
	struct                                                       ItemFeatureToggle;                                 // 0x15a8(0xc)
};


// Size 0x18
struct PlayerStatusEffectDeactivatedTelemetryEvent
{
public:
	struct                                                       Id;                                                // 0x0(0x10)
	struct FName                                                 StatusName;                                        // 0x10(0x8)
};


// Size 0x20
struct EventRemoveCrewBeckonTag
{
public:
	struct                                                       BeckonTag;                                         // 0x0(0x10)
};


// Size 0x10
struct EventStartWield
{
public:
	interface                                                    Object;                                            // 0x0(0x10)
};


// Size 0x10
struct EventEnteredShip
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	class Actor*                                                 Actor;                                             // 0x8(0x8)
};


// Size 0x1c
struct CrewScoredEvent
{
public:
	char                                                         ScoreId;                                           // 0x0(0x1)
	struct                                                       CrewId;                                            // 0x4(0x10)
	int                                                          CrewScore;                                         // 0x14(0x4)
	char                                                         ReasonForScoring;                                  // 0x18(0x1)
};


// Size 0x30
struct ContestScoreTelemetryGameEvent
{
public:
	char                                                         ScoreReason;                                       // 0x0(0x1)
	int                                                          CurrentScore;                                      // 0x4(0x4)
	int                                                          ScoreChangeAmount;                                 // 0x8(0x4)
	struct FString                                               ScoreContext;                                      // 0x10(0x10)
	struct                                                       InstigatorId;                                      // 0x20(0x10)
};


// Size 0x4
struct EventCapstanArmIntentChanged
{
public:
	float                                                        NewIntent;                                         // 0x0(0x4)
};


// Size 0x40
struct AccoladeShipBreakDownModel
{
public:
	struct                                                       ShipId;                                            // 0x0(0x10)
	struct                                                       ProgressId;                                        // 0x10(0x24)
	int64                                                        ProgressValue;                                     // 0x38(0x8)
};


// Size 0x10
struct CrewCancelledTaleEvent
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
};


// Size 0x90
struct EmissaryDisplayInformation
{
public:
	struct FText                                                 Title;                                             // 0x0(0x38)
	struct FText                                                 Description;                                       // 0x38(0x38)
	struct                                                       KeyArt;                                            // 0x70(0x10)
	struct                                                       Icon;                                              // 0x80(0x10)
};


// Size 0x48
struct StorageContainerReplicatedContainerNodes
{
public:
	uint32                                                       ResponseCounter;                                   // 0x0(0x4)
	struct                                                       ContainerNodes;                                    // 0x8(0x40)
};


// Size 0x4
struct EventAthenaLocalPlayerSetControllerId
{
public:
	int                                                          ControllerId;                                      // 0x0(0x4)
};


// Size 0x1c
struct DestroyingUnsafeExpiredWreckEvent
{
public:
	struct                                                       Location;                                          // 0x0(0xc)
	struct                                                       CrewId;                                            // 0xc(0x10)
};


// Size 0xd0
struct EmoteFlourishCategoryMapping
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	class UClass*                                                AlternateItemCategory;                             // 0x8(0x8)
	struct                                                       IconPath;                                          // 0x10(0x10)
	struct                                                       EmoteData;                                         // 0x20(0xa0)
	struct FString                                               PairName;                                          // 0xc0(0x10)
};


// Size 0x128
struct AmmoUI
{
public:
	class Pawn*                                                  TargetPawn;                                        // 0x18(0x8)
};


// Size 0x60
struct EventCargoRunCrateSetDropOff
{
public:
	struct                                                       PickUpId;                                          // 0x0(0x10)
	struct                                                       DropOffLocationId;                                 // 0x10(0x10)
	int64                                                        DeliveryDeadlineAbsolute;                          // 0x20(0x8)
	struct FText                                                 DeliveryLocationHintText;                          // 0x28(0x38)
};


// Size 0x10
struct MapTableTutorialHandler
{
public:
	class Actor*                                                 CachedMapController;                               // 0x0(0x8)
	class Tutorial2019Component*                                 CachedMapControllerTutorialComponent;              // 0x8(0x8)
};


// Size 0x20
struct ServiceStatusNotificationModel
{
public:
	uint32                                                       NotificationId;                                    // 0x0(0x4)
	struct                                                       ActivatedDateTimeUtc;                              // 0x8(0x8)
	struct                                                       CorrelationId;                                     // 0x10(0x10)
};


// Size 0x1e0
struct ShopOffer
{
public:
	struct                                                       OfferId;                                           // 0x0(0x10)
	struct FString                                               DisplayName;                                       // 0x10(0x10)
	struct FString                                               Description;                                       // 0x20(0x10)
	struct                                                       Price;                                             // 0x30(0x48)
	struct FString                                               ThumbnailImageUrl;                                 // 0x78(0x10)
	TArray<String>                                               ClientIds;                                         // 0x88(0x10)
	struct FString                                               CatalogName;                                       // 0x98(0x10)
	TArray<String>                                               PurchaseStats;                                     // 0xa8(0x10)
	struct                                                       Prerequisites;                                     // 0xb8(0x68)
	struct                                                       ExclusionConditions;                               // 0x120(0x68)
	char                                                         Availability;                                      // 0x188(0x1)
	map                                                          MetaData;                                          // 0x190(0x50)
};


// Size 0x10
struct SequenceResponseContainer
{
public:
	int                                                          SequenceIndexToTrigger;                            // 0x0(0x4)
	class Actor*                                                 ResponseActor;                                     // 0x8(0x8)
};


// Size 0x50
struct ShipPersistenceModel
{
public:
	TArray<struct ShipPartDamagePersistenceModel>                PartDamagePersistenceModels;                       // 0x0(0x10)
	struct                                                       HullDamageModel;                                   // 0x10(0x10)
	struct                                                       HullCharringModel;                                 // 0x20(0x18)
	struct                                                       MapTablePersistenceModel;                          // 0x38(0x10)
	struct                                                       InternalWaterModel;                                // 0x48(0x4)
};


// Size 0x1c
struct SeaFortStateChangeTelemetryEvent
{
public:
	struct                                                       FortId;                                            // 0x0(0x10)
	struct FName                                                 FortIslandName;                                    // 0x10(0x8)
	char                                                         OldState;                                          // 0x18(0x1)
	char                                                         NewState;                                          // 0x19(0x1)
};


// Size 0x50
struct EventCompanyReputationCampaignDetailResponse
{
public:
	struct                                                       CampaignDetail;                                    // 0x0(0x50)
};


// Size 0xc
struct ReapersTributeBandReward
{
public:
	struct                                                       RewardId;                                          // 0x0(0x8)
	int                                                          MinimumTribute;                                    // 0x8(0x4)
};


// Size 0x30
struct BootFlowSetContentEngagementMessage
{
public:
	struct FString                                               Title;                                             // 0x0(0x10)
	struct FString                                               Body;                                              // 0x10(0x10)
	struct FString                                               KeyArt;                                            // 0x20(0x10)
};


// Size 0x68
struct WeaponProjectileEffectParams
{
public:
	bool                                                         ApplyStun;                                         // 0x0(0x1)
	float                                                        StunDuration;                                      // 0x4(0x4)
	bool                                                         ApplyKnockback;                                    // 0x8(0x1)
	struct                                                       KnockbackParams;                                   // 0xc(0x50)
	int                                                          MinimumHitProjectilesForKnockback;                 // 0x5c(0x4)
	float                                                        MaximumKnockbackDistance;                          // 0x60(0x4)
	bool                                                         EnableKnockbackFalloffOverDistance;                // 0x64(0x1)
};


// Size 0x28
struct StopNpcAnimationNetworkEvent
{
public:
	class Actor*                                                 TargetActor;                                       // 0x18(0x8)
	class PlaceableReaction*                                     PlaceableReaction;                                 // 0x20(0x8)
};


// Size 0xb0
struct VoyageLocationParams
{
public:
	char                                                         Type;                                              // 0x0(0x1)
	struct                                                       Fixed;                                             // 0x4(0x8)
	struct                                                       Random;                                            // 0x10(0x48)
	struct                                                       CompetitiveVoyage;                                 // 0x58(0x58)
};


// Size 0xc
struct PlayerCurseToAudioSwitchValue
{
public:
	char                                                         CurseTag;                                          // 0x0(0x1)
	struct FName                                                 SwitchValue;                                       // 0x4(0x8)
};


// Size 0x10
struct EventMastDamageLevelChanged
{
public:
	class Actor*                                                 Mast;                                              // 0x0(0x8)
	int                                                          DamageLevel;                                       // 0x8(0x4)
};


// Size 0x20
struct FortStartedTelemetryEvent
{
public:
	struct                                                       FortId;                                            // 0x0(0x10)
	struct FName                                                 FortIsland;                                        // 0x10(0x8)
	struct FName                                                 FortType;                                          // 0x18(0x8)
};


// Size 0x10
struct ClientMarkerRepresentation
{
public:
	class BaseWorldMarker*                                       MarkerPtr;                                         // 0x0(0x8)
	class Object*                                                MarkerVisualObjectPtr;                             // 0x8(0x8)
};


// Size 0x18
struct EventDockToObjectFullyDocked
{
public:
	interface                                                    ObjectBeingUsed;                                   // 0x0(0x10)
	bool                                                         CanLookAtBeDisabledWhenDockedToObject;             // 0x10(0x1)
};


// Size 0x110
struct LaunchableActiveProjectileData
{
public:
	struct                                                       Projectile;                                        // 0x0(0xe0)
};


// Size 0x8
struct ItemUseSpeedParams
{
public:
	float                                                        LookSpeedScalar;                                   // 0x0(0x4)
	float                                                        MaxMoveSpeedScalar;                                // 0x4(0x4)
};


// Size 0x78
struct RadialInstance
{
public:
	struct FText                                                 Name;                                              // 0x8(0x38)
	class RadialContentRule*                                     Content;                                           // 0x40(0x8)
	class RadialAction*                                          PrimaryAction;                                     // 0x48(0x8)
	class RadialAction*                                          SecondaryAction;                                   // 0x50(0x8)
	class RadialAction*                                          TertiaryAction;                                    // 0x58(0x8)
	class RadialAction*                                          QuaternaryAction;                                  // 0x60(0x8)
	class RadialManagerInputComponent*                           InputComponent;                                    // 0x68(0x8)
	bool                                                         ShouldActionsUpdateWhenContextChanges;             // 0x70(0x1)
	bool                                                         ShouldContentUpdateWhenContextChanges;             // 0x71(0x1)
	bool                                                         ShouldRadialCloseWhenWieldingNewItem;              // 0x72(0x1)
	bool                                                         ShouldRadialCloseWhenStowingWieldedItem;           // 0x73(0x1)
};


// Size 0x10
struct MermaidDeactivatedLocally
{
public:
	class Mermaid*                                               Mermaid;                                           // 0x0(0x8)
	bool                                                         IsForLocalPlayer;                                  // 0x8(0x1)
};


// Size 0x8
struct EventJustBeenFed
{
public:
	class Actor*                                                 FedBy;                                             // 0x0(0x8)
};


// Size 0x40
struct AccoladePirateBreakDownModel
{
public:
	struct                                                       PirateId;                                          // 0x0(0x10)
	struct                                                       ProgressId;                                        // 0x10(0x24)
	int64                                                        ProgressValue;                                     // 0x38(0x8)
};


// Size 0x40
struct ClientReachedInGameTelemetryEvent
{
public:
	struct                                                       PlayerGameId;                                      // 0x0(0x10)
	struct FString                                               SessionType;                                       // 0x10(0x10)
	struct                                                       MatchmakingAttemptId;                              // 0x20(0x10)
	struct FString                                               ActiveExperiments;                                 // 0x30(0x10)
};


// Size 0x40
struct UpdateInteractionEvent
{
public:
	struct                                                       Definition;                                        // 0x0(0x40)
};


// Size 0x18
struct MerchantQuestStartTelemetryEventRequiredItemEntry
{
public:
	int                                                          NumItems;                                          // 0x0(0x4)
	struct FString                                               Rarity;                                            // 0x8(0x10)
};


// Size 0x8
struct ClothingChestUnequipClothingEvent
{
public:
	class UClass*                                                Desc;                                              // 0x0(0x8)
};


// Size 0x28
struct WheelDesc
{
public:
	struct                                                       WheelMesh;                                         // 0x0(0x10)
	int64                                                        WheelCachedMeshResourceSize;                       // 0x10(0x8)
	TArray<class MaterialInterface*>                             WheelMeshOverrideMaterials;                        // 0x18(0x10)
};


// Size 0x10
struct ChapterDataEntry
{
public:
	int                                                          NumQuests;                                         // 0x0(0x4)
	class VoyageRewardDataAsset*                                 PerChapterRewardAsset;                             // 0x8(0x8)
};


// Size 0x10
struct EventSpawnComponentRequest
{
public:
	class SalvageItemSpawnComponent*                             SalvageItemSpawnComponent;                         // 0x0(0x8)
	int                                                          NumberOfLocationsRequested;                        // 0x8(0x4)
};


// Size 0x98
struct QuestTableCompanySkin
{
public:
	struct FString                                               BackgroundImageUrl;                                // 0x0(0x10)
	TArray<String>                                               VoyageIconUrls;                                    // 0x10(0x10)
	struct FString                                               TabBackgroundImageUrl;                             // 0x20(0x10)
	struct                                                       RankSkin;                                          // 0x30(0x68)
};


// Size 0x18
struct ResettableSettingsGroup
{
public:
	struct FName                                                 SettingsGroupName;                                 // 0x0(0x8)
	TArray<struct Name>                                          SettingsNames;                                     // 0x8(0x10)
};


// Size 0xb0
struct PirateReRollRequestModel
{
public:
	struct                                                       EntitlementItem;                                   // 0x0(0x30)
	struct                                                       PirateDescription;                                 // 0x30(0x80)
};


// Size 0x18
struct RequestArmoryEquipSlotEvent
{
public:
	struct FString                                               ItemDesc;                                          // 0x0(0x10)
	int                                                          SlotId;                                            // 0x10(0x4)
};


// Size 0x38
struct MeshMemoryConstraintRegistrationBaseTelemetryEvent
{
public:
	bool                                                         HasWorldContext;                                   // 0x0(0x1)
	bool                                                         HasGameState;                                      // 0x1(0x1)
	struct FString                                               Category;                                          // 0x8(0x10)
	struct FString                                               BudgetNoFallback;                                  // 0x18(0x10)
	struct FString                                               MeshReference;                                     // 0x28(0x10)
};


// Size 0xa8
struct ShipAnnouncementCinematicEvent
{
public:
	struct FString                                               ShipName;                                          // 0x0(0x10)
	struct FText                                                 ShipTitle;                                         // 0x10(0x38)
	struct FString                                               CaptainName;                                       // 0x48(0x10)
	struct FString                                               Alignment;                                         // 0x58(0x10)
	struct FString                                               AlignmentId;                                       // 0x68(0x10)
	struct FString                                               Icon;                                              // 0x78(0x10)
	struct FString                                               AudioCue;                                          // 0x88(0x10)
	struct FString                                               GuildName;                                         // 0x98(0x10)
};


// Size 0x10
struct ShipHeartbeatTelemetryEvent
{
public:
	float                                                        Speed;                                             // 0x0(0x4)
	float                                                        Yaw;                                               // 0x4(0x4)
	float                                                        InternalWaterLevel;                                // 0x8(0x4)
	int                                                          FireCellsActive;                                   // 0xc(0x4)
};


// Size 0x8
struct RepairObjectActionStateParams
{
public:
	float                                                        MountTime;                                         // 0x0(0x4)
	struct                                                       RightTrigger_Repair;                               // 0x4(0x4)
};


// Size 0x70
struct ServerProjectileHitRegInfoTelemetryEvent
{
public:
	struct                                                       AttackId;                                          // 0x0(0x10)
	struct FString                                               ProjectileId;                                      // 0x10(0x10)
	struct FString                                               HitObjectId;                                       // 0x20(0x10)
	struct FString                                               HitObjectType;                                     // 0x30(0x10)
	struct FString                                               HitActorName;                                      // 0x40(0x10)
	struct FString                                               InstigatorName;                                    // 0x50(0x10)
	struct                                                       HitLocation;                                       // 0x60(0xc)
	bool                                                         IsHitScanShot;                                     // 0x6c(0x1)
};


// Size 0x20
struct EjectFromTunnelOfTheDamnedActionStateParams
{
public:
	float                                                        FadeDuration;                                      // 0x0(0x4)
	float                                                        FadeEventTimeout;                                  // 0x4(0x4)
	float                                                        FadeServerTimeout;                                 // 0x8(0x4)
	struct                                                       FadeColour;                                        // 0xc(0x10)
	bool                                                         FadeAudio;                                         // 0x1c(0x1)
};


// Size 0x20
struct RequestPurchaseShopOfferEvent
{
public:
	struct                                                       OfferId;                                           // 0x0(0x10)
	struct FString                                               CatalogName;                                       // 0x10(0x10)
};


// Size 0x8
struct EventCustomAnimationPlayAnimation
{
public:
	struct FName                                                 AnimSequenceName;                                  // 0x0(0x8)
};


// Size 0x58
struct BucketContentsInfo
{
public:
	char                                                         ThrowableLiquidType;                               // 0x0(0x1)
	class UClass*                                                ProjectileClassToSpawn;                            // 0x8(0x8)
	class UClass*                                                ProjectileClassToSpawnAtWielder;                   // 0x10(0x8)
	class WwiseEvent*                                            ThrowSfx;                                          // 0x18(0x8)
	class Object*                                                ThrowVfxFirstPerson;                               // 0x20(0x8)
	class Object*                                                ThrowVfxThirdPerson;                               // 0x28(0x8)
	class Object*                                                DrenchWielderVfxThirdPerson;                       // 0x30(0x8)
	class Object*                                                BucketContentsParticleSystemFirstPerson;           // 0x38(0x8)
	class Object*                                                BucketContentsParticleSystemThirdPerson;           // 0x40(0x8)
	struct FName                                                 SwitchState;                                       // 0x48(0x8)
	float                                                        LiquidLevel;                                       // 0x50(0x4)
};


// Size 0x20
struct TunnelOfTheDamnedCancellationReminderNetworkEvent
{
public:
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x18(0x8)
};


// Size 0x18
struct CampaignRanks
{
public:
	struct FName                                                 CampaignId;                                        // 0x0(0x8)
	TArray<class Class*>                                         Ranks;                                             // 0x8(0x10)
};


// Size 0x28
struct ContestShipSinkNetworkEvent
{
public:
	struct                                                       CrewLiveryId;                                      // 0x18(0x10)
};


// Size 0x10
struct SetPresenceConnectionStringRequestModel
{
public:
	struct FString                                               ConnectionString;                                  // 0x0(0x10)
};


// Size 0xa8
struct EntitlementItem
{
public:
	struct FText                                                 Description;                                       // 0x0(0x38)
	bool                                                         Owned;                                             // 0x38(0x1)
	struct                                                       PreviewImageUrl;                                   // 0x40(0x10)
	struct                                                       ThumbnailImageUrl;                                 // 0x50(0x10)
	struct FText                                                 DisplayName;                                       // 0x60(0x38)
	struct FString                                               Id;                                                // 0x98(0x10)
};


// Size 0x6c0
struct FaunaAnimationStructure
{
public:
	struct                                                       FreeRange;                                         // 0x0(0x360)
	struct                                                       Caged;                                             // 0x360(0x360)
};


// Size 0x168
struct AthenaAnimationPitchControlStates
{
public:
	struct                                                       StandardPassive;                                   // 0x0(0x3c)
	struct                                                       StandardWater;                                     // 0x3c(0x3c)
	struct                                                       Action1;                                           // 0x78(0x3c)
	struct                                                       Action1Water;                                      // 0xb4(0x3c)
	struct                                                       Action2;                                           // 0xf0(0x3c)
	struct                                                       Action2Water;                                      // 0x12c(0x3c)
};


// Size 0x118
struct RewardRequestForScoreMessage
{
public:
	struct FName                                                 ScoreId;                                           // 0x0(0x8)
	int                                                          ScoreValue;                                        // 0x8(0x4)
	struct                                                       Recipient;                                         // 0x10(0xc8)
	struct                                                       RequestID;                                         // 0xd8(0x10)
	struct FName                                                 CompanyAffiliation;                                // 0xe8(0x8)
	struct                                                       BootyId;                                           // 0xf0(0x10)
	struct                                                       GuildId;                                           // 0x100(0x10)
	bool                                                         NotifyPlayer;                                      // 0x110(0x1)
	char                                                         PlayMode;                                          // 0x111(0x1)
	char                                                         PlayModeVariant;                                   // 0x112(0x1)
	bool                                                         IsSovereignHandIn;                                 // 0x113(0x1)
};


// Size 0x10
struct CompanyMeshVoteIndicator
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	class StaticMeshComponent*                                   Mesh;                                              // 0x8(0x8)
};


// Size 0x10
struct CrewAttackedByGameEventEvent
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
};


// Size 0x10
struct ShovelDigActionStateParams
{
public:
	class CurveFloat*                                            SuccessfulPitchBlendCurve;                         // 0x0(0x8)
	class CurveFloat*                                            DeflectedPitchBlendCurve;                          // 0x8(0x8)
};


// Size 0x1
struct FlashbangEffectEvent
{
public:
	bool                                                         IsFlashbanged;                                     // 0x0(0x1)
};


// Size 0x70
struct MerchantMapLayoutItem
{
public:
	struct                                                       Name;                                              // 0x0(0x3c)
	struct                                                       IconImage;                                         // 0x40(0x30)
};


// Size 0x10
struct MultiShopResponsePerNPCEntry
{
public:
	struct FName                                                 NPCName;                                           // 0x0(0x8)
	class ShopDesc*                                              ShopDesc;                                          // 0x8(0x8)
};


// Size 0x8
struct SetVaultDoorStateGameServerRequestModel
{
public:
	int                                                          ActorId;                                           // 0x0(0x4)
	char                                                         DoorType;                                          // 0x4(0x1)
	char                                                         DoorState;                                         // 0x5(0x1)
};


// Size 0x8
struct EventPlayerControllerPossessed
{
public:
	class PlayerController*                                      PlayerController;                                  // 0x0(0x8)
};


// Size 0x18
struct DigAnimParams
{
public:
	char                                                         DigType;                                           // 0x0(0x1)
	float                                                        Duration;                                          // 0x4(0x4)
	float                                                        TimeStampOfUnlockingWielderMovement;               // 0x8(0x4)
	float                                                        TimeStampOfEnterGround;                            // 0xc(0x4)
	float                                                        TimeStampOfLeaveGround;                            // 0x10(0x4)
	char                                                         AnimVariant;                                       // 0x14(0x1)
};


// Size 0x10
struct PLSectionBundleEntry
{
public:
	class PirateLegendSection*                                   Section;                                           // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
};


// Size 0x4
struct UISlatePerformanceTelemetryFragment
{
public:
	uint32                                                       NumAtlasPages;                                     // 0x0(0x4)
};


// Size 0x10
struct FactionStreakIcon
{
public:
	class Texture*                                               FactionStreakIcon;                                 // 0x0(0x8)
	class UClass*                                                Faction;                                           // 0x8(0x8)
};


// Size 0x38
struct ShipUndoRepairTelemetryEvent
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct                                                       UndoRepairLocation;                                // 0x10(0xc)
	struct FString                                               ShipPart;                                          // 0x20(0x10)
	int                                                          DamageLevel;                                       // 0x30(0x4)
	float                                                        UndoRepairPercentage;                              // 0x34(0x4)
};


// Size 0x4
struct RequestScrambledShipNamesEvent
{
public:
	int                                                          NumShipNamesRequested;                             // 0x0(0x4)
};


// Size 0x8
struct NetPositionErrorTolerance
{
public:
	float                                                        ZDistance;                                         // 0x0(0x4)
	float                                                        XYDistance;                                        // 0x4(0x4)
};


// Size 0x50
struct LightingControllerAssetParams
{
public:
	class MaterialParameterCollection*                           AtmosphericMaterialParams;                         // 0x0(0x8)
	class MaterialParameterCollection*                           CloudMaterialParams;                               // 0x8(0x8)
	class MaterialParameterCollection*                           ScreenEffectsMaterialParams;                       // 0x10(0x8)
	class MaterialParameterCollection*                           IslandDangerMaterialParams;                        // 0x18(0x8)
	class LightingControllerSettings*                            UnderworldLightingSet;                             // 0x20(0x8)
	class LightingControllerSettings*                            HideoutLightingSet;                                // 0x28(0x8)
	class LightingControllerSettings*                            ArenaTavernLightingSet;                            // 0x30(0x8)
	class StaticMesh*                                            SkyDomeMesh;                                       // 0x38(0x8)
	class StaticMesh*                                            NorthStarMesh;                                     // 0x40(0x8)
	class StaticMesh*                                            MoonMesh;                                          // 0x48(0x8)
};


// Size 0x58
struct TutorialStepDependencies
{
public:
	class AthenaPlayerController*                                Controller;                                        // 0x0(0x8)
};


// Size 0x8
struct ClothingChestUnequipEmoteEvent
{
public:
	class UClass*                                                Desc;                                              // 0x0(0x8)
};


// Size 0x8
struct CreateStormGameServerResponseModel
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
	int                                                          StormId;                                           // 0x4(0x4)
};


// Size 0x44
struct PlayerBuriedItemsMapAddedToStoreTelemetryEvent
{
public:
	struct                                                       MapBundleId;                                       // 0x0(0x10)
	struct                                                       OwningCrewID;                                      // 0x10(0x10)
	struct                                                       OwningCrewSessionId;                               // 0x20(0x10)
	struct                                                       MapID;                                             // 0x30(0x10)
	uint32                                                       AverageGoldCost;                                   // 0x40(0x4)
};


// Size 0x1e0
struct AthenaAnimationAsyncLoadedFishingAnimations
{
public:
	assetobject                                                  CastIntoHoldBack;                                  // 0x0(0x20)
	assetobject                                                  CastHoldBackLoop;                                  // 0x20(0x20)
	assetobject                                                  CastForwards;                                      // 0x40(0x20)
	assetobject                                                  CastHoldLoop;                                      // 0x60(0x20)
	assetobject                                                  CastToFishing;                                     // 0x80(0x20)
	assetobject                                                  CastFail;                                          // 0xa0(0x20)
	class BlendSpace*                                            Fishing;                                           // 0xc0(0x8)
	class BlendSpace1D*                                          FishingAdditive;                                   // 0xc8(0x8)
	assetobject                                                  IntoFighting;                                      // 0xd0(0x20)
	assetobject                                                  FightingCentral;                                   // 0xf0(0x20)
	assetobject                                                  FightingAdditive;                                  // 0x110(0x20)
	assetobject                                                  Linesnap;                                          // 0x130(0x20)
	class AnimSequence*                                          SuccessReelIn;                                     // 0x150(0x8)
	assetobject                                                  ComedyItemSuccessReelIn;                           // 0x158(0x20)
	assetobject                                                  ShakingAdditive;                                   // 0x178(0x20)
	assetobject                                                  LineSnapShakingAdditive;                           // 0x198(0x20)
	class AnimSequence*                                          FishingToIdle;                                     // 0x1b8(0x8)
	assetobject                                                  FishingToUnequip;                                  // 0x1c0(0x20)
};


// Size 0x30
struct UIRankSkin
{
public:
	struct FString                                               DisplayName;                                       // 0x0(0x10)
	struct FString                                               Description;                                       // 0x10(0x10)
	struct FString                                               RibbonImageUrl;                                    // 0x20(0x10)
};


// Size 0x10
struct CurrentKeyDescInfo
{
public:
	class UClass*                                                VaultKeyDesc;                                      // 0x0(0x8)
	int                                                          CrewSize;                                          // 0x8(0x4)
};


// Size 0x40
struct CanShowSecondaryActionButton
{
public:
	bool                                                         CanShow;                                           // 0x4(0x1)
	struct FText                                                 Text;                                              // 0x8(0x38)
};


// Size 0x38
struct LoadRequestAssetInfo
{
public:
	float                                                        LoadDuration;                                      // 0x0(0x4)
	struct FString                                               AnimationsStructName;                              // 0x8(0x10)
	struct FString                                               LoadingForCharacterName;                           // 0x18(0x10)
	struct FString                                               ItemName;                                          // 0x28(0x10)
};


// Size 0x68
struct AthenaAnimationLadderAnimData
{
public:
	class AnimSequence*                                          Climb;                                             // 0x0(0x8)
	class AnimSequence*                                          Slide;                                             // 0x8(0x8)
	class BlendSpace1D*                                          SlideStop;                                         // 0x10(0x8)
	struct                                                       Mast;                                              // 0x18(0x28)
	struct                                                       ShipSide;                                          // 0x40(0x28)
};


// Size 0x1
struct GameNarrationActivityChangedEvent
{
public:
	bool                                                         IsActive;                                          // 0x0(0x1)
};


// Size 0x48
struct TreasureChestSoldInAllianceNetworkEvent
{
public:
	struct FName                                                 RewardId;                                          // 0x18(0x8)
	struct                                                       AllianceIcon;                                      // 0x20(0x10)
	struct                                                       StampIcon;                                         // 0x30(0x10)
	class UClass*                                                OverrideCompany;                                   // 0x40(0x8)
};


// Size 0x38
struct SessionCreationCrewResponseModel
{
public:
	struct FString                                               SessionName;                                       // 0x0(0x10)
	struct                                                       Crew;                                              // 0x10(0x28)
};


// Size 0x14
struct UICompanyProgress
{
public:
	struct FName                                                 CompanyId;                                         // 0x0(0x8)
	float                                                        Level;                                             // 0x8(0x4)
	uint32                                                       Distinction;                                       // 0xc(0x4)
	uint32                                                       Rank;                                              // 0x10(0x4)
};


// Size 0xb0
struct VoyageBegunAnimationEvent
{
public:
	struct FText                                                 ShipName;                                          // 0x0(0x38)
	TArray<String>                                               CrewMembers;                                       // 0x38(0x10)
	int                                                          ChapterIndex;                                      // 0x48(0x4)
	int                                                          ChapterCount;                                      // 0x4c(0x4)
	struct FText                                                 VoyageTitle;                                       // 0x50(0x38)
	struct FString                                               AudioSwitchName;                                   // 0x88(0x10)
	struct FString                                               AudioSwitchValue;                                  // 0x98(0x10)
	struct FName                                                 CompanyId;                                         // 0xa8(0x8)
};


// Size 0x14
struct NotesManagementAddNoteResponseModel
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
	struct                                                       NoteId;                                            // 0x4(0x10)
};


// Size 0x2
struct QuestBookPageRenderingTriggerRedraw
{
public:
	char                                                         PreviousMode;                                      // 0x0(0x1)
	char                                                         NewMode;                                           // 0x1(0x1)
};


// Size 0x20
struct PlayerChangedLoadoutTelemetryEvent
{
public:
	struct FString                                               EquippedItemType;                                  // 0x0(0x10)
	struct FString                                               EquippedItemName;                                  // 0x10(0x10)
};


// Size 0x48
struct PlayerBaseTelemetryFragment
{
public:
	struct                                                       PlayerGameId;                                      // 0x0(0x10)
	struct FString                                               UserId;                                            // 0x10(0x10)
	struct FString                                               PirateId;                                          // 0x20(0x10)
	char                                                         PlatformId;                                        // 0x30(0x1)
	struct FString                                               DeviceID;                                          // 0x38(0x10)
};


// Size 0x18
struct InlineVotingParameterSet
{
public:
	float                                                        HoldTime;                                          // 0x0(0x4)
	class VoteConsumerInlineBase*                                Consumer;                                          // 0x8(0x8)
	class VoteValidatorInlineBase*                               Validator;                                         // 0x10(0x8)
};


// Size 0x80
struct EventSingleCompanyPromotionUpdate
{
public:
	struct                                                       Promotion;                                         // 0x0(0x80)
};


// Size 0x10
struct ArrivalTunnelOfTheDamnedPlayerState
{
public:
	class Character*                                             Character;                                         // 0x0(0x8)
	bool                                                         MigrationComplete;                                 // 0x8(0x1)
};


// Size 0x30
struct GamerTagUpdated
{
public:
	struct FString                                               GamerTag;                                          // 0x0(0x10)
	struct                                                       UserPirateId;                                      // 0x10(0x20)
};


// Size 0x1
struct EventCustomAnimationStateChanged
{
public:
	char                                                         CustomAnimationState;                              // 0x0(0x1)
};


// Size 0x10
struct ReapersMarkStatusStatInfo
{
public:
	class UClass*                                                Status;                                            // 0x0(0x8)
	struct                                                       StatToFire;                                        // 0x8(0x4)
};


// Size 0x10
struct PurchasePremiumCurrencyRequestEvent
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
};


// Size 0x8
struct EventConcealingObjectUsed
{
public:
	class Actor*                                                 UsingActor;                                        // 0x0(0x8)
};


// Size 0x40
struct EventLogParams
{
public:
	struct FText                                                 NameParam;                                         // 0x0(0x38)
	int                                                          NumberParam;                                       // 0x38(0x4)
};


// Size 0x20
struct WheelAdditiveProperties
{
public:
	float                                                        RightHandOnHandleAMin;                             // 0x0(0x4)
	float                                                        RightHandOnHandleAMax;                             // 0x4(0x4)
	float                                                        RightHandOnHandleBMin;                             // 0x8(0x4)
	float                                                        RightHandOnHandleBMax;                             // 0xc(0x4)
	float                                                        LeftHandOnHandleAMin;                              // 0x10(0x4)
	float                                                        LeftHandOnHandleAMax;                              // 0x14(0x4)
	float                                                        LeftHandOnHandleBMin;                              // 0x18(0x4)
	float                                                        LeftHandOnHandleBMax;                              // 0x1c(0x4)
};


// Size 0x38
struct ContestBaseTelemetryFragment
{
public:
	struct                                                       ContestUniqueId;                                   // 0x0(0x10)
	struct FString                                               ContestVoyageName;                                 // 0x10(0x10)
	char                                                         ContestScoreIdentifier;                            // 0x20(0x1)
	float                                                        TimeRemainingInCurrentContestState;                // 0x24(0x4)
	struct FString                                               ShipSize;                                          // 0x28(0x10)
};


// Size 0x18
struct AddStatusesGameServerRequestModel
{
public:
	int                                                          ActorId;                                           // 0x0(0x4)
	TArray<String>                                               Statuses;                                          // 0x8(0x10)
};


// Size 0x28
struct BootyItemInfoMetaWrapper
{
public:
	struct                                                       BootyId;                                           // 0x18(0x10)
};


// Size 0x10
struct AthenaAnimationSkeletonKnockbackLocomotion
{
public:
	class AnimSequence*                                          Forwards;                                          // 0x0(0x8)
	class AnimSequence*                                          Backwards;                                         // 0x8(0x8)
};


// Size 0x10
struct PlayerNameOverrideTelemetryEvent
{
public:
	struct FString                                               PlayerNameOverride;                                // 0x0(0x10)
};


// Size 0x8
struct EventHUDSetMousePosition
{
public:
	struct                                                       Position;                                          // 0x0(0x8)
};


// Size 0x38
struct EventWieldableItemUseStopped
{
public:
	class Actor*                                                 Item;                                              // 0x0(0x8)
	class UClass*                                                InputID;                                           // 0x8(0x8)
	char                                                         ItemUseStoppedReason;                              // 0x10(0x1)
	struct                                                       Visuals;                                           // 0x18(0x18)
	char                                                         TrackId;                                           // 0x30(0x1)
	bool                                                         IgnoreItemAnimationStop;                           // 0x31(0x1)
};


// Size 0xe8
struct SittingActionStateConstructionInfo
{
public:
	struct                                                       SittingActionStateParams;                          // 0x48(0xa0)
};


// Size 0x1c
struct LadderDefinition
{
public:
	char                                                         LadderType;                                        // 0x0(0x1)
	struct                                                       OnTopLadderBlendParams;                            // 0x4(0xc)
	struct                                                       OffTopLadderBlendParams;                           // 0x10(0xc)
};


// Size 0x10
struct EventPlayerEnteredSittingState
{
public:
	class UClass*                                                SeatAnimationId;                                   // 0x0(0x8)
	class Object*                                                SeatObject;                                        // 0x8(0x8)
};


// Size 0x8
struct PlayerMapsRegisteredEvent
{
public:
	class Actor*                                                 Map;                                               // 0x0(0x8)
};


// Size 0x30
struct SendShipStatsServerRpc
{
public:
	class Controller*                                            Controller;                                        // 0x18(0x8)
	struct                                                       SpottedShipId;                                     // 0x20(0x10)
};


// Size 0x38
struct HideoutRevealedEvent
{
public:
	struct FText                                                 HideoutName;                                       // 0x0(0x38)
};


// Size 0x10
struct MastDamageStateChangedEvent
{
public:
	char                                                         NewMastDamageState;                                // 0x0(0x1)
	class Actor*                                                 Mast;                                              // 0x8(0x8)
};


// Size 0x18
struct CanvasWorldMapShipIcons
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	class Texture*                                               ShipTexture;                                       // 0x8(0x8)
	class Texture*                                               OffscreenTexture;                                  // 0x10(0x8)
};


// Size 0x18
struct ArrivalTunnelOfTheDamnedCompletedTelemetryEvent
{
public:
	struct                                                       DestinationLocation;                               // 0x0(0xc)
	struct                                                       DestinationRotation;                               // 0xc(0xc)
};


// Size 0x10
struct ShroudBreakerSoftTearDownEvent
{
public:
	struct                                                       ShroudBreakerId;                                   // 0x0(0x10)
};


// Size 0x38
struct QuestTablePageTransitionTelemetryEvent
{
public:
	struct FString                                               CurrentPage;                                       // 0x0(0x10)
	struct FString                                               PreviousPage;                                      // 0x10(0x10)
	float                                                        TimeOnPreviousPage;                                // 0x20(0x4)
	struct FString                                               SessionId;                                         // 0x28(0x10)
};


// Size 0x38
struct PlayerServerAssignmentMessage
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
	struct FString                                               ServerAddress;                                     // 0x10(0x10)
	struct FString                                               ConnectionKey;                                     // 0x20(0x10)
	uint64                                                       ConnectionToken;                                   // 0x30(0x8)
};


// Size 0x20
struct UIMessageOfTheDayOpenTelemetryEvent
{
public:
	struct FString                                               SessionId;                                         // 0x0(0x10)
	struct FString                                               MessageId;                                         // 0x10(0x10)
};


// Size 0x28
struct AeolusAchievementsUpdatedFromServicesTelemetry
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct FString                                               PirateId;                                          // 0x10(0x10)
	bool                                                         Success;                                           // 0x20(0x1)
	int                                                          AchievementsUpdatedCount;                          // 0x24(0x4)
};


// Size 0x18
struct WalletTransactionRequest
{
public:
	char                                                         Currency;                                          // 0x0(0x1)
	uint32                                                       Amount;                                            // 0x4(0x4)
	struct                                                       TransactionId;                                     // 0x8(0x10)
};


// Size 0x50
struct ClientMeleeHitRegInfoTelemetryEvent
{
public:
	struct                                                       AttackId;                                          // 0x0(0x10)
	int                                                          NumHits;                                           // 0x10(0x4)
	struct FString                                               HitObjectId;                                       // 0x18(0x10)
	struct FString                                               HitObjectType;                                     // 0x28(0x10)
	struct FString                                               HitActorName;                                      // 0x38(0x10)
	bool                                                         IsDamageBlocked;                                   // 0x48(0x1)
};


// Size 0x10
struct WalletLastKnownBalanceUpdatedEvent
{
public:
	struct                                                       Balance;                                           // 0x0(0x10)
};


// Size 0x1
struct OnLiquidProjectileImpactEvent
{
public:
	bool                                                         ImpactFilledShip;                                  // 0x0(0x1)
};


// Size 0x18
struct LoadableProjectileData
{
public:
	struct                                                       DataAsset;                                         // 0x0(0x10)
	int                                                          GeneratedDataRNGSeed;                              // 0x10(0x4)
	bool                                                         ShouldProjectileTrailDoReflections;                // 0x14(0x1)
};


// Size 0x18
struct EmblemClaim
{
public:
	bool                                                         IsCompleted;                                       // 0x0(0x1)
	struct FString                                               Sig;                                               // 0x8(0x10)
};


// Size 0x40
struct OpenableItemMaterialAnimationReactionComponentAnimationNameAndSfxCueSet
{
public:
	struct FName                                                 Open;                                              // 0x0(0x8)
	struct FName                                                 OpeningFirstTime;                                  // 0x8(0x8)
	class WwiseEvent*                                            OpeningFirstTimeSfx;                               // 0x10(0x8)
	struct FName                                                 Opening;                                           // 0x18(0x8)
	class WwiseEvent*                                            OpeningSfx;                                        // 0x20(0x8)
	struct FName                                                 Closing;                                           // 0x28(0x8)
	class WwiseEvent*                                            ClosingSfx;                                        // 0x30(0x8)
	struct FName                                                 Closed;                                            // 0x38(0x8)
};


// Size 0x8
struct InvasionDepartureTunnelOfTheDamnedInitializedTelemetryEvent
{
public:
	char                                                         RequestedSessionType;                              // 0x0(0x1)
	int                                                          CrewSkillScore;                                    // 0x4(0x4)
};


// Size 0x128
struct ProgressUpdatedNotificationUIEvent
{
public:
	struct                                                       Old;                                               // 0x0(0x20)
	struct                                                       New;                                               // 0x20(0x20)
	struct FString                                               RibbonImage;                                       // 0x40(0x10)
	struct FString                                               BackgroundImage;                                   // 0x50(0x10)
	struct FText                                                 Title;                                             // 0x60(0x38)
	struct FText                                                 Body;                                              // 0x98(0x38)
	char                                                         Style;                                             // 0xd0(0x1)
	struct FString                                               RankIncreaseAudioCue;                              // 0xd8(0x10)
	struct FString                                               RankIncreaseStopAudioCue;                          // 0xe8(0x10)
	struct FString                                               RankLevelUpAudioCue;                               // 0xf8(0x10)
	struct FString                                               RankTriggerAudioCue;                               // 0x108(0x10)
	struct FString                                               DistinctionRankLevelUpAudioCue;                    // 0x118(0x10)
};


// Size 0x20
struct PlayerItemUsageBaseTelemetryFragment
{
public:
	struct FString                                               InputID;                                           // 0x0(0x10)
	struct FString                                               ItemId;                                            // 0x10(0x10)
};


// Size 0x10
struct EventUserGameSettingsSetInteger
{
public:
	struct FName                                                 KeyName;                                           // 0x0(0x8)
	int                                                          Value;                                             // 0x8(0x4)
	char                                                         Instigator;                                        // 0xc(0x1)
};


// Size 0x10
struct WeightedRewardTableUnit
{
public:
	class UClass*                                                Entitlement;                                       // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	uint32                                                       Value;                                             // 0xc(0x4)
};


// Size 0x28
struct CursedCrewStatEvent
{
public:
	class Object*                                                ObjectOfInterest;                                  // 0x18(0x8)
};


// Size 0x20
struct EntitlementsRequestEvent
{
public:
	TArray<String>                                               EntitlementIds;                                    // 0x0(0x10)
	struct FString                                               Id;                                                // 0x10(0x10)
};


// Size 0x38
struct MarkerVariantDesc
{
public:
	class UClass*                                                Variant;                                           // 0x0(0x8)
	class UClass*                                                MarkerType;                                        // 0x8(0x8)
	bool                                                         UseActorMarker;                                    // 0x10(0x1)
	struct                                                       MarkerVfx;                                         // 0x18(0x10)
	struct                                                       MarkerClass;                                       // 0x28(0x10)
};


// Size 0x20
struct LightingZoneParameters
{
public:
	int                                                          PriorityLayer;                                     // 0x0(0x4)
	int                                                          TargetLightingIndex;                               // 0x4(0x4)
	float                                                        OuterRadius;                                       // 0x8(0x4)
	float                                                        InnerRadius;                                       // 0xc(0x4)
	float                                                        Weight;                                            // 0x10(0x4)
	bool                                                         IsUnderwaterZone;                                  // 0x14(0x1)
	bool                                                         Is3DLightingZone;                                  // 0x15(0x1)
	float                                                        OuterCylinderHalfHeight;                           // 0x18(0x4)
	float                                                        InnerCylinderHalfHeight;                           // 0x1c(0x4)
};


// Size 0x1c
struct ClientTelemetryConfigurationSettings
{
public:
	float                                                        HighMemoryPerformanceHeartbeatIntervalSeconds;     // 0x0(0x4)
	float                                                        HighMemoryThresholdDurango;                        // 0x4(0x4)
	float                                                        HighMemoryThresholdEdmonton;                       // 0x8(0x4)
	float                                                        HighMemoryThresholdScorpio;                        // 0xc(0x4)
	float                                                        HighMemoryThresholdLockhart;                       // 0x10(0x4)
	float                                                        HighMemoryThresholdAnaconda;                       // 0x14(0x4)
	float                                                        PlayerAggregatePositionInterval;                   // 0x18(0x4)
};


// Size 0x48
struct InteractObjectActionStateConstructionInfo
{
public:
	struct                                                       InteractObject;                                    // 0x30(0x14)
};


// Size 0x38
struct TeleportActionStateSerialisableData
{
public:
	bool                                                         IsTeleporting;                                     // 0x30(0x1)
};


// Size 0x38
struct UIPremiumStorePanelHighlightTelemetryEvent
{
public:
	struct FString                                               CurrentPage;                                       // 0x0(0x10)
	struct FString                                               CurrentPanel;                                      // 0x10(0x10)
	struct FString                                               SessionId;                                         // 0x20(0x10)
	float                                                        TimeOnPanel;                                       // 0x30(0x4)
};


// Size 0x8
struct ChargedAttackProjectileWeights
{
public:
	float                                                        ChargeTime;                                        // 0x0(0x4)
	float                                                        Weight;                                            // 0x4(0x4)
};


// Size 0x10
struct PinnedAccoladeResultArray
{
public:
	TArray<String>                                               Results;                                           // 0x0(0x10)
};


// Size 0x28
struct PlayerEncounterStartTelemetryEvent
{
public:
	struct                                                       EncounterId;                                       // 0x0(0x10)
	struct FString                                               EncounteredObjectId;                               // 0x10(0x10)
	char                                                         EncounterType;                                     // 0x20(0x1)
	char                                                         ShipRegion;                                        // 0x21(0x1)
	float                                                        EncounterDistance;                                 // 0x24(0x4)
};


// Size 0x28
struct ShantyInstrumentData
{
public:
	char                                                         InstrumentType;                                    // 0x0(0x1)
	class WwiseEvent*                                            PlayLead;                                          // 0x8(0x8)
	class WwiseEvent*                                            PlayAccompaniment;                                 // 0x10(0x8)
	class WwiseEvent*                                            StopLead;                                          // 0x18(0x8)
	class WwiseEvent*                                            StopAccompaniment;                                 // 0x20(0x8)
};


// Size 0x30
struct LocText
{
public:
	struct FString                                               Namespace;                                         // 0x0(0x10)
	struct FString                                               Key;                                               // 0x10(0x10)
	struct FString                                               LocalizedText;                                     // 0x20(0x10)
};


// Size 0x40
struct AccoladeModel
{
public:
	struct                                                       ProgressId;                                        // 0x0(0x24)
	int64                                                        MilestoneLevel;                                    // 0x28(0x8)
	int64                                                        CurrentProgress;                                   // 0x30(0x8)
	int64                                                        Threshold;                                         // 0x38(0x8)
};


// Size 0x8
struct EmissaryLevelMultiplierModel
{
public:
	int                                                          Level;                                             // 0x0(0x4)
	float                                                        Multiplier;                                        // 0x4(0x4)
};


// Size 0x48
struct FogBankManagerFogBankTemplate
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	TArray<class Class*>                                         FogBanks;                                          // 0x8(0x10)
	struct                                                       DistanceFromIslandInKm;                            // 0x18(0x30)
};


// Size 0x10
struct EventPlayerStatePawnUnPossessed
{
public:
	class PlayerState*                                           PlayerState;                                       // 0x0(0x8)
	class Pawn*                                                  UnPossessedPawn;                                   // 0x8(0x8)
};


// Size 0x8
struct PlayerBuriedItemServiceItemDigUpRadiusSurfaceOverride
{
public:
	char                                                         SurfaceType;                                       // 0x0(0x1)
	float                                                        ItemDigUpRadius;                                   // 0x4(0x4)
};


// Size 0x70
struct Leak
{
public:
	struct                                                       SFXEmitter;                                        // 0x30(0x20)
	class ParticleSystemComponent*                               WaterLeakParticleSystem;                           // 0x50(0x8)
};


// Size 0x8
struct CoordinatedCutsceneTriggerStat
{
public:
	struct                                                       StatToFire;                                        // 0x0(0x4)
	bool                                                         FireToWholeCrew;                                   // 0x4(0x1)
	bool                                                         FireEachTime;                                      // 0x5(0x1)
};


// Size 0x8
struct DrapesPartDesc
{
public:
	class MaterialInterface*                                     DrapesMaterial;                                    // 0x0(0x8)
};


// Size 0x18
struct ShippingStatsTelemetryFragment
{
public:
	struct                                                       Json;                                              // 0x0(0x18)
};


// Size 0x8
struct PotentialChainNode
{
public:
	class Actor*                                                 NodeActor;                                         // 0x0(0x8)
};


// Size 0x78
struct CinematicShipNetworkEvent
{
public:
	struct                                                       CrewId;                                            // 0x18(0x10)
	struct                                                       GuildId;                                           // 0x28(0x10)
	struct FText                                                 Header;                                            // 0x38(0x38)
	struct FName                                                 Tag;                                               // 0x70(0x8)
};


// Size 0x40
struct DistributedGuildActivityMessage
{
public:
	struct FString                                               GuildId;                                           // 0x0(0x10)
	struct FString                                               CreatedAtUtc;                                      // 0x10(0x10)
	struct FString                                               Type;                                              // 0x20(0x10)
	struct FString                                               payload;                                           // 0x30(0x10)
};


// Size 0xa90
struct VaultButtonData
{
public:
	struct                                                       ButtonPressAnimation;                              // 0x0(0x500)
	struct                                                       ButtonActivationAnimation;                         // 0x500(0x500)
	float                                                        IncorrectSolutionPenaltyInSeconds;                 // 0xa00(0x4)
	float                                                        ButtonHoldTime;                                    // 0xa04(0x4)
	class StaticMeshComponent*                                   ButtonMesh;                                        // 0xa80(0x8)
};


// Size 0x10
struct ShipSunkTelemetryEvent
{
public:
	TArray<struct Guid>                                          SinkContributors;                                  // 0x0(0x10)
};


// Size 0x10
struct RequestPremiumShopOffersEvent
{
public:
	struct FString                                               CatalogName;                                       // 0x0(0x10)
};


// Size 0x40
struct SignedSessionRequestModel
{
public:
	struct FString                                               SessionId;                                         // 0x0(0x10)
	struct FString                                               OwningUserId;                                      // 0x10(0x10)
	struct FString                                               SessionTemplateName;                               // 0x20(0x10)
	struct FString                                               Signature;                                         // 0x30(0x10)
};


// Size 0x18
struct CurrentHealthInfo
{
public:
	float                                                        Health;                                            // 0x0(0x4)
	char                                                         LastChangedReason;                                 // 0x4(0x1)
	struct                                                       LastInstigatorLocation;                            // 0x8(0xc)
	uint32                                                       HealthChangeCount;                                 // 0x14(0x4)
};


// Size 0xf0
struct TelemetryStepContext
{
public:
	struct                                                       Name;                                              // 0x0(0x30)
	struct                                                       Asset;                                             // 0x30(0x30)
	struct                                                       AssetRef;                                          // 0x60(0x30)
	struct                                                       Type;                                              // 0x90(0x30)
	struct                                                       Actor;                                             // 0xc0(0x30)
};


// Size 0x100
struct PirateMilestoneCompletionEvent
{
public:
	struct                                                       Pirate;                                            // 0x0(0x78)
	struct                                                       AlignmentId;                                       // 0x78(0x10)
	struct                                                       GoalId;                                            // 0x88(0x10)
	struct                                                       ScheduleId;                                        // 0x98(0x10)
	struct                                                       ProgressId;                                        // 0xa8(0x24)
	uint64                                                       Progress;                                          // 0xd0(0x8)
	uint64                                                       Alignment;                                         // 0xd8(0x8)
	uint64                                                       Level;                                             // 0xe0(0x8)
	struct                                                       CompletedAt;                                       // 0xe8(0x8)
	struct FString                                               AlignmentKey;                                      // 0xf0(0x10)
};


// Size 0x4
struct EventAthenaLocalPlayerControllerPairingChanged
{
public:
	int                                                          ControllerId;                                      // 0x0(0x4)
};


// Size 0x18
struct ItemSpawnTransformOverrideEntry
{
public:
	struct                                                       FeatureFlag;                                       // 0x0(0xc)
	class WeightedItemDescSpawnDataAsset*                        ReferencedSpawnDistributionAsset;                  // 0x10(0x8)
};


// Size 0x10
struct PopupQueueFinished
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
};


// Size 0x78
struct WaterModifierZoneParameters
{
public:
	float                                                        OuterRadius;                                       // 0x0(0x4)
	float                                                        InnerRadius;                                       // 0x4(0x4)
	float                                                        Strength;                                          // 0x8(0x4)
	bool                                                         UseDragScalar;                                     // 0xc(0x1)
	float                                                        DragScalar;                                        // 0x10(0x4)
	struct                                                       DrowningParameters;                                // 0x18(0x28)
	struct                                                       ShipInternalWaterDrowningParameters;               // 0x40(0x28)
	bool                                                         IsSuperHeatedWater;                                // 0x68(0x1)
	bool                                                         ResetOxygenLevel;                                  // 0x69(0x1)
	bool                                                         Is3DWaterModifierZone;                             // 0x6a(0x1)
	float                                                        OuterCylinderHalfHeight;                           // 0x6c(0x4)
	float                                                        InnerCylinderHalfHeight;                           // 0x70(0x4)
};


// Size 0x18
struct CategoryPreviewEntry
{
public:
	class UClass*                                                PreviewCategory;                                   // 0x0(0x8)
	class UClass*                                                ItemCategoryClass;                                 // 0x8(0x8)
	class UClass*                                                PreviewClassType;                                  // 0x10(0x8)
};


// Size 0x20
struct PurchaseRequestSuccessResponse
{
public:
	struct                                                       TransactionId;                                     // 0x0(0x10)
	TArray<String>                                               PurchasedItems;                                    // 0x10(0x10)
};


// Size 0x30
struct PlayerRadialChatTelemetryEvent
{
public:
	struct                                                       RadialChatID;                                      // 0x0(0x10)
	struct FString                                               RadialChatString;                                  // 0x10(0x10)
	struct FString                                               RadialContextType;                                 // 0x20(0x10)
};


// Size 0x20
struct GuildEnrolledShipModel
{
public:
	struct                                                       GuildId;                                           // 0x0(0x10)
	struct                                                       ShipId;                                            // 0x10(0x10)
};


// Size 0x40
struct ClientStartCrewMatchmakingTelemetryEvent
{
public:
	struct                                                       CrewId;                                            // 0x0(0x10)
	struct FString                                               SessionType;                                       // 0x10(0x10)
	struct                                                       MatchmakingAttemptId;                              // 0x20(0x10)
	struct FString                                               ActiveExperiments;                                 // 0x30(0x10)
};


// Size 0x28
struct UIMessageOfTheDayCloseEvent
{
public:
	struct FString                                               SessionId;                                         // 0x0(0x10)
	struct FString                                               MessageId;                                         // 0x10(0x10)
	float                                                        TimeSpentInMessage;                                // 0x20(0x4)
};


// Size 0x18
struct EncounterServiceEntry
{
public:
	char                                                         EncounterListenerType;                             // 0x0(0x1)
	TArray<char>                                                 ValidEncounterTypes;                               // 0x8(0x10)
};


// Size 0x38
struct ReactionVOEntry
{
public:
	struct FName                                                 VOGroupName;                                       // 0x0(0x8)
	struct                                                       VOCooldown;                                        // 0x8(0x30)
};


// Size 0x4
struct AthenaAnimationDebugTrackingParams
{
public:
	bool                                                         TrackObjectActive;                                 // 0x0(0x1)
