// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x18
struct RopeCatenaryShapeParams
{
public:
	Struct RopeCatenaryLengthParams                              Length;                                            // 0x0(0x10)
	Struct RopeCatenarySlopeBlendParams                          Slope;                                             // 0x10(0x8)
};


// Size 0x8
struct RopeCatenarySlopeBlendParams
{
public:
	float                                                        MinSlopeForTautBlend;                              // 0x0(0x4)
	float                                                        MaxSlopeForTautBlend;                              // 0x4(0x4)
};


// Size 0x10
struct RopeCatenaryLengthParams
{
public:
	float                                                        MinTautLength;                                     // 0x0(0x4)
	float                                                        MaxTautLength;                                     // 0x4(0x4)
	float                                                        CatenaryScaleAtMinLength;                          // 0x8(0x4)
	float                                                        CatenaryScaleAtMaxLength;                          // 0xc(0x4)
};


// Size 0x8
struct RopeCatenarySwingParams
{
public:
	float                                                        LengthForNeutralSwing;                             // 0x0(0x4)
	float                                                        LengthBias;                                        // 0x4(0x4)
};


// Size 0x8
struct RopeCatenaryDynamicsParams
{
public:
	float                                                        CatenaryToTautLengthRatioToConsiderCatenary;       // 0x0(0x4)
	bool                                                         ReactsToWind;                                      // 0x4(0x1)
};


// Size 0x54
struct InstancedRopeParams
{
public:
	Struct Vector                                                Start;                                             // 0x0(0xc)
	Struct Vector                                                End;                                               // 0xc(0xc)
	float                                                        Thickness;                                         // 0x18(0x4)
	float                                                        UVScale;                                           // 0x1c(0x4)
	float                                                        UVBase;                                            // 0x20(0x4)
	float                                                        UVOffset;                                          // 0x24(0x4)
	float                                                        Roughness;                                         // 0x28(0x4)
	Struct RopeCatenaryShapeParams                               Shape;                                             // 0x2c(0x18)
	Struct RopeCatenarySwingParams                               Swing;                                             // 0x44(0x8)
	Struct RopeCatenaryDynamicsParams                            Dynamics;                                          // 0x4c(0x8)
};


// Size 0x10
struct RiggingSystemLine
{
public:
};


// Size 0x60
struct RiggingSystemPulleyData
{
public:
	TArray<Float AttachmentSag>                                  AttachmentSag;                                     // 0x0(0x10)
	TArray<Float AttachmentLength>                               AttachmentLength;                                  // 0x10(0x10)
	TArray<Float Scale>                                          Scale;                                             // 0x20(0x10)
	TArray<Float ScaledOffset>                                   ScaledOffset;                                      // 0x30(0x10)
	TArray<Float ScaledRadius>                                   ScaledRadius;                                      // 0x40(0x10)
	TArray<Int MeshIDs>                                          MeshIDs;                                           // 0x50(0x10)
};


// Size 0xc
struct RopeVisualParams
{
public:
	float                                                        Thickness;                                         // 0x0(0x4)
	float                                                        UVScale;                                           // 0x4(0x4)
	float                                                        Roughness;                                         // 0x8(0x4)
};


// Size 0x20
struct RopeStyleParams
{
public:
	Class StaticMesh*                                            Mesh;                                              // 0x0(0x8)
	Class Texture2D*                                             DiffuseTexture;                                    // 0x8(0x8)
	Class Texture2D*                                             NormalTexture;                                     // 0x10(0x8)
	int                                                          ShadowLOD;                                         // 0x18(0x4)
};


// Size 0x10
struct PulleyVisualParams
{
public:
	Class StaticMesh*                                            Mesh;                                              // 0x0(0x8)
	float                                                        Scale;                                             // 0x8(0x4)
	float                                                        Radius;                                            // 0xc(0x4)
};


// Size 0x50
struct RiggingSystemPulleyParams
{
public:
	Struct SocketId                                              Anchor;                                            // 0x0(0x20)
	float                                                        OffsetFromAnchor;                                  // 0x20(0x4)
	Struct PulleyVisualParams                                    Visuals;                                           // 0x28(0x10)
	Struct RiggingSystemPulleyAttachmentParams                   AttachmentRope;                                    // 0x38(0x14)
};


// Size 0x14
struct RiggingSystemPulleyAttachmentParams
{
public:
	Struct RopeVisualParams                                      Visuals;                                           // 0x0(0xc)
	float                                                        Length;                                            // 0xc(0x4)
	float                                                        Sag;                                               // 0x10(0x4)
};


// Size 0x78
struct RiggingSystemLineParams
{
public:
	Struct SocketId                                              Start;                                             // 0x0(0x20)
	TArray<Struct RiggingSystemPulleyParams>                     Pulleys;                                           // 0x20(0x10)
	Struct SocketId                                              End;                                               // 0x30(0x20)
	Struct RopeVisualParams                                      Visuals;                                           // 0x50(0xc)
	Struct RopeCatenaryShapeParams                               Shape;                                             // 0x5c(0x18)
};


// Size 0x18
struct RiggingSystemLineGroup
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	TArray<Struct RiggingSystemLineParams>                       Lines;                                             // 0x8(0x10)
};


// Size 0x8
struct RopeCatenaryLengthPair
{
public:
	float                                                        Taut;                                              // 0x0(0x4)
	float                                                        Catenary;                                          // 0x4(0x4)
};


}