// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc
struct AIAbilityDebugReplicatedIntervals
{
public:
	float                                                        ActivationTimerCooldown;                           // 0x0(0x4)
	float                                                        TimeBeforeNextExecution;                           // 0x4(0x4)
	float                                                        DamageBeforeNextExecution;                         // 0x8(0x4)
};


// Size 0x28
struct AttackableTypeToAnimMapping
{
public:
	byte                                                         AttackType;                                        // 0x0(0x1)
	char                                                         pad0x7_T6QM8[0x7];                                 // 0x1(0x7)
	class Object*                                                AnimMontage;                                       // 0x8(0x8)
	bool                                                         PlayAsDynamicMontage;                              // 0x10(0x1)
	char                                                         pad0x3_EUW36[0x3];                                 // 0x11(0x3)
	float                                                        AnimLength;                                        // 0x14(0x4)
	float                                                        TimeIntoAnimOfAttack;                              // 0x18(0x4)
	float                                                        TargetKnockBackStrength;                           // 0x1c(0x4)
	struct FName                                                 RumbleTag;                                         // 0x20(0x8)
};


// Size 0x38
struct SwimAttackTargetShipImpulseData
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	float                                                        PushImpulseForce;                                  // 0x8(0x4)
	struct Vector                                                PushImpulseLocation;                               // 0xc(0xc)
	float                                                        PushForceScalingFactorForeAndAftOfShipLowerBound;  // 0x18(0x4)
	float                                                        PushForceScalingFactorForeAndAftOfShipUpperBound;  // 0x1c(0x4)
	float                                                        RollImpulseForce;                                  // 0x20(0x4)
	struct Vector                                                RollImpulseLocation;                               // 0x24(0xc)
	float                                                        RollForceScalingFactorForeAndAftOfShipLowerBound;  // 0x30(0x4)
	float                                                        RollForceScalingFactorForeAndAftOfShipUpperBound;  // 0x34(0x4)
};


// Size 0xf0
struct WeightedAISpawnTypeParams
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	int                                                          MaxTimesCanBeSelected;                             // 0x4(0x4)
	struct AISpawnTypeParams                                     Params;                                            // 0x8(0xe8)
};


// Size 0xe8
struct AISpawnTypeParams
{
public:
	char                                                         pad0x20_1FS0A[0x20];                               // 0x0(0x20)
	struct StringAssetReference                                  SkillsetOverride;                                  // 0x20(0x10)
	struct StringAssetReference                                  LoadoutOverride;                                   // 0x30(0x10)
	struct StringAssetReference                                  FormOverride;                                      // 0x40(0x10)
	struct StringAssetReference                                  AmmoOverride;                                      // 0x50(0x10)
	class UClass*                                                AIClassIdOverride;                                 // 0x80(0x8)
	struct StringAssetReference                                  TeamColorOverride;                                 // 0x88(0x10)
	struct EncounterParams                                       EncounterTrackingParams;                           // 0x98(0xc)
	struct FName                                                 DioramaRole;                                       // 0xa4(0x8)
	char                                                         pad0x4_PBYW5[0x4];                                 // 0xac(0x4)
	struct FText                                                 LocalisableName;                                   // 0xb0(0x38)
};


// Size 0x8
struct AIPartId
{
public:
	struct FName                                                 PartId;                                            // 0x0(0x8)
};


// Size 0xd0
struct AIBountySpawnerParams
{
public:
	TArray<struct AIEncounterWave>                               AISpawnerCreationDesc;                             // 0x0(0x10)
	struct StringAssetReference                                  TeamColor;                                         // 0x10(0x10)
	TArray<Int NumTargetsInWave>                                 NumTargetsInWave;                                  // 0x20(0x10)
	TArray<Int NumCaptainsInWave>                                NumCaptainsInWave;                                 // 0x30(0x10)
	float                                                        MinTimeBetweenSpawns;                              // 0x40(0x4)
	float                                                        MaxTimeBetweenSpawns;                              // 0x44(0x4)
	float                                                        MinTimeBetweenWaves;                               // 0x48(0x4)
	float                                                        MaxTimeBetweenWaves;                               // 0x4c(0x4)
	struct WeightedProbabilityRange                              WavesPerRelocate;                                  // 0x50(0x20)
	struct WeightedProbabilityRange                              WaveSplitChance;                                   // 0x70(0x20)
	TArray<Float WaveSuicideTime>                                WaveSuicideTime;                                   // 0x90(0x10)
	float                                                        WaveSuicideMinDist;                                // 0xa0(0x4)
	int                                                          NumWavesPerGroup;                                  // 0xa4(0x4)
	int                                                          NumWaveGroups;                                     // 0xa8(0x4)
	int                                                          NumTotalWaves;                                     // 0xac(0x4)
	int                                                          NumTargetsPerWaveGroup;                            // 0xb0(0x4)
	int                                                          NumCaptainsPerWaveGroup;                           // 0xb4(0x4)
	TArray<class Class*>                                         AICombatDialogue;                                  // 0xb8(0x10)
	bool                                                         ConvertFinalCaptainToSkeletonLord;                 // 0xc8(0x1)
	char                                                         pad0x7_S6ARR[0x7];                                 // 0xc9(0x7)
};


// Size 0x20
struct AIEncounterWave
{
public:
	TArray<struct AIEncounterSpecification>                      Specifications;                                    // 0x0(0x10)
	TArray<Int SpecificationSpawnOrder>                          SpecificationSpawnOrder;                           // 0x10(0x10)
};


// Size 0xd0
struct AIEncounterSpecification
{
public:
	char                                                         pad0x20_7TCGV[0x20];                               // 0x0(0x20)
	class AthenaAIControllerParamsDataAsset*                     Skillset;                                          // 0x20(0x8)
	class LoadoutAsset*                                          Loadout;                                           // 0x28(0x8)
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x30(0x8)
	class AthenaAIAmmoDataAsset*                                 Ammo;                                              // 0x38(0x8)
	class UClass*                                                AIClass;                                           // 0x40(0x8)
	class AIPartsCategory*                                       PartsCategory;                                     // 0x48(0x8)
	int                                                          TeamColorIndex;                                    // 0x70(0x4)
	struct FName                                                 DioramaRole;                                       // 0x74(0x8)
	char                                                         pad0x4_FDON5[0x4];                                 // 0x7c(0x4)
	struct FText                                                 LocalisableName;                                   // 0x80(0x38)
	struct EncounterParams                                       EncounterTrackingParams;                           // 0xb8(0xc)
	int                                                          MinPlayersToEnable;                                // 0xc4(0x4)
	bool                                                         ShowNameplate;                                     // 0xc8(0x1)
	bool                                                         IsUsingDialogue;                                   // 0xc9(0x1)
	char                                                         pad0x6_77O94[0x6];                                 // 0xca(0x6)
};


// Size 0x10
struct EventAIStartedDeadActionState
{
public:
	byte                                                         DeathReason;                                       // 0x0(0x1)
	char                                                         pad0x7_FQ2QI[0x7];                                 // 0x1(0x7)
	class Actor*                                                 Killer;                                            // 0x8(0x8)
};


// Size 0x10
struct EventPawnFinishedDying
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
	byte                                                         DeathType;                                         // 0x8(0x1)
	char                                                         pad0x7_O8LQ8[0x7];                                 // 0x9(0x7)
};


// Size 0x18
struct EventPawnStartedDying
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
	byte                                                         DeathType;                                         // 0x8(0x1)
	char                                                         pad0x7_BC87P[0x7];                                 // 0x9(0x7)
	class Actor*                                                 Instigator;                                        // 0x10(0x8)
};


// Size 0x1
struct EventOwnedPawnFinishedDying
{
public:
	byte                                                         DeathType;                                         // 0x0(0x1)
};


// Size 0x18
struct EventOwnedPawnStartedDying
{
public:
	byte                                                         DeathType;                                         // 0x0(0x1)
	char                                                         pad0x7_ELVJ6[0x7];                                 // 0x1(0x7)
	class Actor*                                                 Instigator;                                        // 0x8(0x8)
	byte                                                         KillReason;                                        // 0x10(0x1)
	char                                                         pad0x7_LPQHY[0x7];                                 // 0x11(0x7)
};


// Size 0x50
struct LimitedInteractbaleAICreatureSplineInteractionParams
{
public:
	class UClass*                                                PressedNotificationInputId;                        // 0x0(0x8)
	class UClass*                                                ReleasedNotificationInputId;                       // 0x8(0x8)
	struct FText                                                 DescriptorVerb;                                    // 0x10(0x38)
	float                                                        HoldTime;                                          // 0x48(0x4)
	char                                                         pad0x4_WVZBG[0x4];                                 // 0x4c(0x4)
};


// Size 0x1
struct StartCreatureSplineMovementEvent
{
public:
	char                                                         pad0x1_JNS9I[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct BountySpawnerTargetDesc
{
public:
	byte                                                         Gender;                                            // 0x0(0x1)
	byte                                                         Rank;                                              // 0x1(0x1)
	char                                                         pad0x6_6VXGA[0x6];                                 // 0x2(0x6)
	class UClass*                                                AIClassIdOverride;                                 // 0x8(0x8)
	char                                                         pad0x10_5ZW13[0x10];                               // 0x10(0x10)
};


// Size 0x70
struct AIBountySpawnerWaveGroup
{
public:
	TArray<struct AIBountySpawnerWave>                           Waves;                                             // 0x0(0x10)
	TArray<struct AIBountySpawnerWave>                           AdditionalCaptainWaves;                            // 0x10(0x10)
	int                                                          NumNonTargetAIToKillToMoveToNextWaveGroup;         // 0x20(0x4)
	char                                                         pad0x4_ZZH0X[0x4];                                 // 0x24(0x4)
	class UClass*                                                CombatDialogueForWaveGroup;                        // 0x28(0x8)
	float                                                        DynamicDelayBeforeStart;                           // 0x30(0x4)
	bool                                                         WantsAdditionalWaveAI;                             // 0x34(0x1)
	char                                                         pad0x3_1Q5RF[0x3];                                 // 0x35(0x3)
	TArray<Int AdditionalWaveAIPerPlayer>                        AdditionalWaveAIPerPlayer;                         // 0x38(0x10)
	TArray<Int AdditionalWaveCaptainAIPerPlayer>                 AdditionalWaveCaptainAIPerPlayer;                  // 0x48(0x10)
	float                                                        WaveMusicIntensity;                                // 0x58(0x4)
	char                                                         pad0x14_3B232[0x14];                               // 0x5c(0x14)
};


// Size 0x188
struct AIBountySpawnerWave
{
public:
	char                                                         pad0x128_UFXH6[0x128];                             // 0x0(0x128)
	bool                                                         IsTarget;                                          // 0x128(0x1)
	bool                                                         IsUsingDialogue;                                   // 0x129(0x1)
	char                                                         pad0x2_LWSEQ[0x2];                                 // 0x12a(0x2)
	int                                                          MinPlayersToEnable;                                // 0x12c(0x4)
	byte                                                         Gender;                                            // 0x130(0x1)
	byte                                                         Rank;                                              // 0x131(0x1)
	char                                                         pad0x6_0FZIV[0x6];                                 // 0x132(0x6)
	class PostBountyAIPawnSpawnedAction*                         PostSpawnAction;                                   // 0x138(0x8)
	char                                                         pad0x38_46CM5[0x38];                               // 0x140(0x38)
	class UClass*                                                BountyReward;                                      // 0x178(0x8)
	char                                                         pad0x8_JND0V[0x8];                                 // 0x180(0x8)
};


// Size 0x128
struct AIPersistentSpawnerWave
{
public:
	char                                                         pad0x100_0TI69[0x100];                             // 0x0(0x100)
	bool                                                         CacheHealthOnDespawn;                              // 0x100(0x1)
	char                                                         pad0x7_R02AQ[0x7];                                 // 0x101(0x7)
	class UClass*                                                AITypeToCache;                                     // 0x108(0x8)
	char                                                         pad0x18_DTK9O[0x18];                               // 0x110(0x18)
};


// Size 0x100
struct AISpawnerWave
{
public:
	float                                                        SpawnChance;                                       // 0x0(0x4)
	char                                                         pad0x4_9F9G3[0x4];                                 // 0x4(0x4)
	struct WeightedProbabilityRange                              NumOfSpawnsInWave;                                 // 0x8(0x20)
	struct AISpawnTypeParamsCollection                           SpawnTypeParamsOverride;                           // 0x28(0x48)
	struct WeightedProbabilityRangeOfRanges                      DelayBeforeWave;                                   // 0x70(0x30)
	struct WeightedProbabilityRangeOfRanges                      DelayBetweenSpawns;                                // 0xa0(0x30)
	struct WeightedProbabilityRangeOfRanges                      DelayBeforeNextWaveIfSuccessful;                   // 0xd0(0x30)
};


// Size 0x48
struct AISpawnTypeParamsCollection
{
public:
	char                                                         pad0x8_FKXAO[0x8];                                 // 0x0(0x8)
	TArray<struct WeightedAISpawnTypeParams>                     SpawnParams;                                       // 0x8(0x10)
	char                                                         pad0x30_QBPYZ[0x30];                               // 0x18(0x30)
};


// Size 0x14
struct AIBountySpawnerWaveLocation
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        SelectionWeight;                                   // 0xc(0x4)
	bool                                                         AllowForTarget;                                    // 0x10(0x1)
	char                                                         pad0x3_YL6X8[0x3];                                 // 0x11(0x3)
};


// Size 0x28
struct AIBountySpawnerArchive
{
public:
	char                                                         pad0x8_JR5WA[0x8];                                 // 0x0(0x8)
	int                                                          CurrentWaveIndex;                                  // 0x8(0x4)
	char                                                         pad0x4_IYG49[0x4];                                 // 0xc(0x4)
	TArray<struct AIBountySpawnerArchiveWaveGroupEntry>          WaveGroupEntries;                                  // 0x10(0x10)
	float                                                        BountyAudioIntensity;                              // 0x20(0x4)
	char                                                         pad0x4_R30GI[0x4];                                 // 0x24(0x4)
};


// Size 0x8
struct AISpawnerArchive
{
public:
	char                                                         pad0x8_2FHQS[0x8];                                 // 0x0(0x8)
};


// Size 0x18
struct AIBountySpawnerArchiveWaveGroupEntry
{
public:
	int                                                          NumNonTargetAIKills;                               // 0x0(0x4)
	int                                                          NumTargetAIKills;                                  // 0x4(0x4)
	TArray<struct AIBountySpawnerArchiveWaveEntry>               WaveEntries;                                       // 0x8(0x10)
};


// Size 0x4
struct AIBountySpawnerArchiveWaveEntry
{
public:
	int                                                          NumPawnsToSpawn;                                   // 0x0(0x4)
};


// Size 0x18
struct BountySpawnerIntensityUpdateNetworkEvent
{
public:
	char                                                         pad0x10_RBZNO[0x10];                               // 0x0(0x10)
	bool                                                         IsFinalWave;                                       // 0x10(0x1)
	char                                                         pad0x3_VIO7X[0x3];                                 // 0x11(0x3)
	float                                                        Intensity;                                         // 0x14(0x4)
};


// Size 0x30
struct BountySpawnerNewWaveGroupSpawnedEvent
{
public:
	bool                                                         IsFinalWave;                                       // 0x0(0x1)
	char                                                         pad0x3_9KNMN[0x3];                                 // 0x1(0x3)
	struct FName                                                 IslandName;                                        // 0x4(0x8)
	char                                                         pad0x4_PEQU9[0x4];                                 // 0xc(0x4)
	TArray<struct Guid>                                          ParticipatingCrewIds;                              // 0x10(0x10)
	int                                                          WaveIndex;                                         // 0x20(0x4)
	int                                                          TotalWaves;                                        // 0x24(0x4)
	class Actor*                                                 Instigator;                                        // 0x28(0x8)
};


// Size 0x28
struct BountySpawnerAudioChangedNetworkEvent
{
public:
	char                                                         pad0x10_0H9BJ[0x10];                               // 0x0(0x10)
	byte                                                         AudioState;                                        // 0x10(0x1)
	char                                                         pad0x3_TS4Q2[0x3];                                 // 0x11(0x3)
	float                                                        Intensity;                                         // 0x14(0x4)
	byte                                                         BountyType;                                        // 0x18(0x1)
	char                                                         pad0x3_SRITP[0x3];                                 // 0x19(0x3)
	struct Vector                                                BountyPosition;                                    // 0x1c(0xc)
};


// Size 0x68
struct EventAIBountySpawnerTargetKilled
{
public:
	struct FText                                                 TargetName;                                        // 0x0(0x38)
	class Actor*                                                 TargetActor;                                       // 0x38(0x8)
	struct FName                                                 RewardId;                                          // 0x40(0x8)
	class ItemInfo*                                              ItemDropped;                                       // 0x48(0x8)
	byte                                                         Rank;                                              // 0x50(0x1)
	char                                                         pad0x3_68JS4[0x3];                                 // 0x51(0x3)
	struct Vector                                                DeathLocation;                                     // 0x54(0xc)
	class Actor*                                                 Instigator;                                        // 0x60(0x8)
};


// Size 0x28
struct EventAIBountySpawnerWaveCompleted
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	TArray<struct Guid>                                          ParticipatingCrewIds;                              // 0x8(0x10)
	int                                                          WaveIndex;                                         // 0x18(0x4)
	int                                                          TotalWaves;                                        // 0x1c(0x4)
	class Actor*                                                 InstigatorOfFinalAIPawnDeath;                      // 0x20(0x8)
};


// Size 0x1
struct AthenaAIDebugCostDisplay
{
public:
	char                                                         pad0x1_KF3AK[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct AthenaAIDebugCostData
{
public:
	char                                                         pad0x1_QXLBT[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct AIDebugSpawnConfiguration
{
public:
	int                                                          NumIslandsToSpawnOn;                               // 0x0(0x4)
	char                                                         pad0x4_XZOT1[0x4];                                 // 0x4(0x4)
	TArray<struct FName>                                         SpecificRegionsToSpawnOn;                          // 0x8(0x10)
	TArray<struct AIDebugSpawnAmount>                            WhatToSpawn;                                       // 0x18(0x10)
};


// Size 0x10
struct AIDebugSpawnAmount
{
public:
	class AIEncounterSettings*                                   EncounterSettings;                                 // 0x0(0x8)
	int                                                          NumToSpawn;                                        // 0x8(0x4)
	char                                                         pad0x4_W3783[0x4];                                 // 0xc(0x4)
};


// Size 0x48
struct AIDioramaPawn
{
public:
	class Pawn*                                                  Pawn;                                              // 0x0(0x8)
	char                                                         pad0x40_ITD3S[0x40];                               // 0x8(0x40)
};


// Size 0x28
struct AIDioramaRoleDesc
{
public:
	struct FName                                                 RoleName;                                          // 0x0(0x8)
	struct StringAssetReference                                  CustomAnimationAsset;                              // 0x8(0x10)
	struct FName                                                 CustomAnimationToRunOnSpawn;                       // 0x18(0x8)
	class UClass*                                                StartingItemCategory;                              // 0x20(0x8)
};


// Size 0x40
struct AIDioramaLocationSourceComponentData
{
public:
	struct Transform                                             RelativeTransform;                                 // 0x0(0x30)
	class Actor*                                                 Interactable;                                      // 0x30(0x8)
	char                                                         pad0x8_IIQ75[0x8];                                 // 0x38(0x8)
};


// Size 0xa0
struct DioramaCategoryEntries
{
public:
	char                                                         pad0xa0_MYNR7[0xa0];                               // 0x0(0xa0)
};


// Size 0x10
struct IslandDioramas
{
public:
	TArray<Interface Entries>                                    Entries;                                           // 0x0(0x10)
};


// Size 0x110
struct AIFaunaSpawnerWave
{
public:
	char                                                         pad0x110_38LUM[0x110];                             // 0x0(0x110)
};


// Size 0x48
struct MerchantCrateMetaWrapper
{
public:
	char                                                         pad0x18_MPSL3[0x18];                               // 0x0(0x18)
	float                                                        Health;                                            // 0x18(0x4)
	char                                                         pad0x4_0L56R[0x4];                                 // 0x1c(0x4)
	struct StringAssetReference                                  FaunaType;                                         // 0x20(0x10)
	float                                                        TimeSpentStarving;                                 // 0x30(0x4)
	float                                                        TimeToStarveInSeconds;                             // 0x34(0x4)
	struct Vector                                                TempSpawnLocationForActor;                         // 0x38(0xc)
	char                                                         pad0x4_LET1R[0x4];                                 // 0x44(0x4)
};


// Size 0x1
struct EventFaunaThreatLevelChanged
{
public:
	byte                                                         ThreatLevel;                                       // 0x0(0x1)
};


// Size 0x1
struct EventFaunaAgitationEnded
{
public:
	char                                                         pad0x1_K8MRO[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventFaunaAgitationBegun
{
public:
	class Actor*                                                 SourceActor;                                       // 0x0(0x8)
};


// Size 0x10
struct EventFaunaPickedup
{
public:
	class Actor*                                                 Interactor;                                        // 0x0(0x8)
	class Actor*                                                 PickedUpFauna;                                     // 0x8(0x8)
};


// Size 0x18
struct FaunaSpeciesRequirement
{
public:
	class UClass*                                                Species;                                           // 0x0(0x8)
	TArray<struct FaunaBreedRequirement>                         Breeds;                                            // 0x8(0x10)
};


// Size 0x10
struct FaunaBreedRequirement
{
public:
	class UClass*                                                Breed;                                             // 0x0(0x8)
	int                                                          Count;                                             // 0x8(0x4)
	char                                                         pad0x4_G6ARM[0x4];                                 // 0xc(0x4)
};


// Size 0x8
struct EventSwimRotationModeChanged
{
public:
	byte                                                         NewSwimRotationMode;                               // 0x0(0x1)
	char                                                         pad0x3_SQQDM[0x3];                                 // 0x1(0x3)
	float                                                        NewRotationRate;                                   // 0x4(0x4)
};


// Size 0x30
struct QuestVariableSharkPawn
{
public:
	char                                                         pad0x30_IZABN[0x30];                               // 0x0(0x30)
};


// Size 0xc8
struct TinySharkParams
{
public:
	class UClass*                                                TinySharkType;                                     // 0x0(0x8)
	float                                                        TargetRadius;                                      // 0x8(0x4)
	struct Vector                                                SpawnOffset;                                       // 0xc(0xc)
	class UClass*                                                TinySharkClassID;                                  // 0x78(0x8)
	struct WeightedProbabilityRangeOfRanges                      LifetimeTimeout;                                   // 0x80(0x30)
	TArray<struct TinySharkTrackedShipDistanceThresholdByFeature> TrackedShipDistanceThresholdByFeatureInPriorityOrder; // 0xb0(0x10)
	float                                                        RepositionTime;                                    // 0xc0(0x4)
	char                                                         pad0x4_18TZ4[0x4];                                 // 0xc4(0x4)
};


// Size 0x10
struct TinySharkTrackedShipDistanceThresholdByFeature
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x0(0xc)
	float                                                        TrackedShipDistanceThreshold;                      // 0xc(0x4)
};


// Size 0x10
struct ExperienceTracker
{
public:
	class TaleQuestTinySharkExperienceTracker*                   Tracker;                                           // 0x0(0x8)
	char                                                         pad0x8_97SL2[0x8];                                 // 0x8(0x8)
};


// Size 0x30
struct QuestVariableTinySharkExperience
{
public:
	char                                                         pad0x30_C8M10[0x30];                               // 0x0(0x30)
};


// Size 0x1
struct TinySharkWorldSettingsParams
{
public:
	bool                                                         TinySharkEnabled;                                  // 0x0(0x1)
};


// Size 0x48
struct TinySharkEQSRequest
{
public:
	char                                                         pad0x48_I4MXR[0x48];                               // 0x0(0x48)
};


// Size 0x28
struct TinySharkServiceParams
{
public:
	class TinySharkParamsDataAsset*                              TinySharkParams;                                   // 0x0(0x8)
	TArray<struct TinySharkShipSpawnData>                        SpawnForShipData;                                  // 0x8(0x10)
	class EnvQuery*                                              SpawnForShipQuery;                                 // 0x18(0x8)
	float                                                        SpawnFailureTimer;                                 // 0x20(0x4)
	char                                                         pad0x4_O1U33[0x4];                                 // 0x24(0x4)
};


// Size 0x68
struct TinySharkShipSpawnData
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	struct WeightedProbabilityRangeOfRanges                      Timer;                                             // 0x8(0x30)
	TArray<Assetclass ControllerParams>                          ControllerParams;                                  // 0x38(0x10)
	struct WeightedProbabilityRange                              ControllerParamsToUse;                             // 0x48(0x20)
};


// Size 0x10
struct TinySharkSpawnedNetworkEvent
{
public:
	char                                                         pad0x10_ILMQG[0x10];                               // 0x0(0x10)
};


// Size 0x10
struct TinySharkKilledNetworkEvent
{
public:
	char                                                         pad0x10_1BQHQ[0x10];                               // 0x0(0x10)
};


// Size 0x1
struct EventTinySharkKilled
{
public:
	char                                                         pad0x1_OSM92[0x1];                                 // 0x0(0x1)
};


// Size 0x58
struct EventTinySharkDamaged
{
public:
	struct ImpactDamageEvent                                     ImpactDamageEvent;                                 // 0x0(0x58)
};


// Size 0x1
struct EventTinySharkDespawned
{
public:
	byte                                                         DespawnReason;                                     // 0x0(0x1)
};


// Size 0x30
struct EventTinySharkSpawned
{
public:
	struct FString                                               TinySharkPartTag;                                  // 0x0(0x10)
	struct Guid                                                  SpawnConfigId;                                     // 0x10(0x10)
	struct Vector                                                SpawnLocation;                                     // 0x20(0xc)
	char                                                         pad0x4_DEABS[0x4];                                 // 0x2c(0x4)
};


// Size 0x68
struct TinySharkCollidedTelemetryEvent
{
public:
	struct FString                                               TinySharkId;                                       // 0x0(0x10)
	struct FString                                               TinySharkName;                                     // 0x10(0x10)
	struct FString                                               ObstacleName;                                      // 0x20(0x10)
	struct Vector                                                CollisionLocation;                                 // 0x30(0xc)
	struct Vector                                                HomeLocation;                                      // 0x3c(0xc)
	struct FString                                               BehaviourTreeInfo;                                 // 0x48(0x10)
	struct FString                                               BlackboardInfo;                                    // 0x58(0x10)
};


// Size 0x18
struct TinySharkDespawnTelemetryEvent
{
public:
	struct FString                                               TinySharkId;                                       // 0x0(0x10)
	byte                                                         TinySharkDespawnReason;                            // 0x10(0x1)
	char                                                         pad0x7_VYC8B[0x7];                                 // 0x11(0x7)
};


// Size 0x40
struct TinySharkSpawnTelemetryEvent
{
public:
	struct FString                                               TinySharkId;                                       // 0x0(0x10)
	struct FString                                               TinySharkType;                                     // 0x10(0x10)
	struct Guid                                                  ConfigSpawnId;                                     // 0x20(0x10)
	struct Vector                                                SpawnLocation;                                     // 0x30(0xc)
	char                                                         pad0x4_KXMDC[0x4];                                 // 0x3c(0x4)
};


// Size 0x20
struct TargetSkillsetProgressionPair
{
public:
	struct StringAssetReference                                  CrewSkillset;                                      // 0x0(0x10)
	struct StringAssetReference                                  CaptainSkillset;                                   // 0x10(0x10)
};


// Size 0x10
struct PetTurnRateModifier
{
public:
	class UClass*                                                Strategy;                                          // 0x0(0x8)
	float                                                        TurnRateModifier;                                  // 0x8(0x4)
	char                                                         pad0x4_TKX7X[0x4];                                 // 0xc(0x4)
};


// Size 0x18
struct PetFlyingStrategyProperties
{
public:
	class UClass*                                                Strategy;                                          // 0x0(0x8)
	float                                                        ChanceOfFlying;                                    // 0x8(0x4)
	float                                                        MinFlyingMeshZOffset;                              // 0xc(0x4)
	float                                                        MaxFlyingMeshZOffset;                              // 0x10(0x4)
	char                                                         pad0x4_J6URI[0x4];                                 // 0x14(0x4)
};


// Size 0xc
struct PetMovementRequest
{
public:
	byte                                                         State;                                             // 0x0(0x1)
	char                                                         pad0x3_2ZH9A[0x3];                                 // 0x1(0x3)
	float                                                        TargetMeshZOffset;                                 // 0x4(0x4)
	bool                                                         AdjustingFlight;                                   // 0x8(0x1)
	char                                                         pad0x3_47SOB[0x3];                                 // 0x9(0x3)
};


// Size 0x10
struct PetLoadedMaterial
{
public:
	class MaterialInstance*                                      MaterialInstance;                                  // 0x0(0x8)
	bool                                                         CastShadows;                                       // 0x8(0x1)
	char                                                         pad0x7_33D3G[0x7];                                 // 0x9(0x7)
};


// Size 0x8
struct PetPartSizeMapping
{
public:
	byte                                                         PetSize;                                           // 0x0(0x1)
	char                                                         pad0x3_CUSOR[0x3];                                 // 0x1(0x3)
	float                                                        PetScale;                                          // 0x4(0x4)
};


// Size 0x18
struct PetMaterialEntry
{
public:
	struct StringAssetReference                                  MaterialReference;                                 // 0x0(0x10)
	bool                                                         CastShadows;                                       // 0x10(0x1)
	char                                                         pad0x7_E9026[0x7];                                 // 0x11(0x7)
};


// Size 0x10
struct PetWieldableReactMapping
{
public:
	class UClass*                                                WieldableType;                                     // 0x0(0x8)
	struct FName                                                 ReactId;                                           // 0x8(0x8)
};


// Size 0x30
struct AthenaAIItemParamValue
{
public:
	char                                                         pad0x20_9WR63[0x20];                               // 0x0(0x20)
	struct FName                                                 ParamName;                                         // 0x20(0x8)
	float                                                        Value;                                             // 0x28(0x4)
	char                                                         pad0x4_2XBY4[0x4];                                 // 0x2c(0x4)
};


// Size 0x10
struct AthenaAIAbilityPlayerBasedRanges
{
public:
	TArray<struct AthenaAIAbilityPlayerBasedRange>               AbilityRanges;                                     // 0x0(0x10)
};


// Size 0x38
struct AthenaAIAbilityPlayerBasedRange
{
public:
	int                                                          MaxPlayers;                                        // 0x0(0x4)
	char                                                         pad0x4_SXUER[0x4];                                 // 0x4(0x4)
	struct WeightedProbabilityRangeOfRanges                      WeightedArray;                                     // 0x8(0x30)
};


// Size 0x20
struct AIAbilityContinuousCooldownParameterData
{
public:
	struct AthenaAIAbilityPlayerBasedRanges                      InitialCooldown;                                   // 0x0(0x10)
	struct AthenaAIAbilityPlayerBasedRanges                      CooldownBetweenActivations;                        // 0x10(0x10)
};


// Size 0x14
struct AthenaAIControllerSenseSettings
{
public:
	bool                                                         EnableSight;                                       // 0x0(0x1)
	bool                                                         EnableHearing;                                     // 0x1(0x1)
	bool                                                         EnableDamage;                                      // 0x2(0x1)
	char                                                         pad0x1_C0UP8[0x1];                                 // 0x3(0x1)
	float                                                        SightRadius;                                       // 0x4(0x4)
	float                                                        LoseSightRadius;                                   // 0x8(0x4)
	float                                                        PeripheralVisionAngleDegrees;                      // 0xc(0x4)
	float                                                        MaxHearingRange;                                   // 0x10(0x4)
};


// Size 0x14
struct AthenaAIControllerDamageTargetScoreFromPerceivedTarget
{
public:
	float                                                        MinDamageTargetScore;                              // 0x0(0x4)
	float                                                        MaxDamageTargetScore;                              // 0x4(0x4)
	float                                                        DamageForMinDamageTargetScore;                     // 0x8(0x4)
	float                                                        DamageForMaxDamageTargetScore;                     // 0xc(0x4)
	float                                                        RateToDecayDamagedFromTarget;                      // 0x10(0x4)
};


// Size 0xc
struct AthenaAIControllerHealthCustomisation
{
public:
	bool                                                         OverrideMaxHealth;                                 // 0x0(0x1)
	bool                                                         OverrideMaxHealthWithMinMax;                       // 0x1(0x1)
	char                                                         pad0x2_6UB5P[0x2];                                 // 0x2(0x2)
	float                                                        MinHealth;                                         // 0x4(0x4)
	float                                                        MaxHealth;                                         // 0x8(0x4)
};


// Size 0x20
struct AthenaAIControllerSenseSettingOverride
{
public:
	class UClass*                                                AIStrategy;                                        // 0x0(0x8)
	struct AthenaAIControllerSenseSettings                       SenseSettings;                                     // 0x8(0x14)
	bool                                                         ClearPerceivedData;                                // 0x1c(0x1)
	char                                                         pad0x3_62JQ9[0x3];                                 // 0x1d(0x3)
};


// Size 0x38
struct AthenaAIControllerWeightedRangesParamValue
{
public:
	struct FName                                                 ParamName;                                         // 0x0(0x8)
	struct WeightedProbabilityRangeOfRanges                      Value;                                             // 0x8(0x30)
};


// Size 0x20
struct AthenaAIControllerFeatureToggledParams
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x0(0xc)
	char                                                         pad0x4_4FZX9[0x4];                                 // 0xc(0x4)
	TArray<struct AthenaAIControllerParamValue>                  Params;                                            // 0x10(0x10)
};


// Size 0xc
struct AthenaAIControllerParamValue
{
public:
	struct FName                                                 ParamName;                                         // 0x0(0x8)
	float                                                        Value;                                             // 0x8(0x4)
};


// Size 0x20
struct AthenaAISharedControllerParamToggledValues
{
public:
	TArray<class AthenaAIControllerSharedParamValuesDataAsset*>  Assets;                                            // 0x0(0x10)
	struct FeatureFlag                                           FeatureName;                                       // 0x10(0xc)
	char                                                         pad0x4_NPBJ3[0x4];                                 // 0x1c(0x4)
};


// Size 0x10
struct AIAbilityFollowUp
{
public:
	class UClass*                                                AbilityType;                                       // 0x0(0x8)
	float                                                        Chance;                                            // 0x8(0x4)
	char                                                         pad0x4_955JP[0x4];                                 // 0xc(0x4)
};


// Size 0x8
struct MinMaxAbilityRange
{
public:
	float                                                        MinDistanceToTarget;                               // 0x0(0x4)
	float                                                        MaxDistanceToTarget;                               // 0x4(0x4)
};


// Size 0x18
struct AIStrategyMovementProperties
{
public:
	class UClass*                                                AIStrategy;                                        // 0x0(0x8)
	float                                                        MaxSpeedAmp;                                       // 0x8(0x4)
	float                                                        MaxAccelAmp;                                       // 0xc(0x4)
	float                                                        OverrideRVOAvoidanceRadius;                        // 0x10(0x4)
	float                                                        OverrideBlendSpeed;                                // 0x14(0x4)
};


// Size 0x10
struct AthenaAIAbilityDamageStage
{
public:
	TArray<class AthenaAIAbilityStageParams*>                    AbilitiesInStage;                                  // 0x0(0x10)
};


// Size 0x10
struct AthenaAICharacterControllerSpawnItemDescForItemCategory
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	class UClass*                                                ItemDesc;                                          // 0x8(0x8)
};


// Size 0x10
struct AthenaAICharacterControllerWeightedAmmoType
{
public:
	class UClass*                                                AmmoType;                                          // 0x0(0x8)
	float                                                        Weighting;                                         // 0x8(0x4)
	char                                                         pad0x4_N0Z2H[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct AthenaAICharacterCannonTargetingParams
{
public:
	TArray<struct AthenaAICharacterCannonTarget>                 Params;                                            // 0x0(0x10)
};


// Size 0xc
struct AthenaAICharacterCannonTarget
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	struct FName                                                 TargetLocation;                                    // 0x4(0x8)
};


// Size 0x10
struct AthenaAICharacterControllerItemCategoryProjectileEffectivenessProperties
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	class CurveFloat*                                            DistanceInMToProjectileHitChanceCurve;             // 0x8(0x8)
};


// Size 0x18
struct AthenaAICharacterControllerItemCategoryNamedParams
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	TArray<struct AthenaAIControllerParamValue>                  NamedControllerParams;                             // 0x8(0x10)
};


// Size 0x18
struct AIAmmoRankMapping
{
public:
	class AthenaAIAmmoDataAsset*                                 Ammo;                                              // 0x0(0x8)
	TArray<Float Weights>                                        Weights;                                           // 0x8(0x10)
};


// Size 0x2c
struct AIDebugVisualisationCone
{
public:
	struct Vector                                                Origin;                                            // 0x0(0xc)
	struct Vector                                                Direction;                                         // 0xc(0xc)
	float                                                        Length;                                            // 0x18(0x4)
	float                                                        AngleWidthRadians;                                 // 0x1c(0x4)
	float                                                        AngleHeightRadians;                                // 0x20(0x4)
	float                                                        LifeTime;                                          // 0x24(0x4)
	byte                                                         Colour;                                            // 0x28(0x1)
	char                                                         pad0x3_CHAYV[0x3];                                 // 0x29(0x3)
};


// Size 0x18
struct AIDebugVisualisationSphere
{
public:
	struct Vector                                                Centre;                                            // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
	float                                                        LifeTime;                                          // 0x10(0x4)
	byte                                                         Colour;                                            // 0x14(0x1)
	char                                                         pad0x3_BM7WK[0x3];                                 // 0x15(0x3)
};


// Size 0x24
struct AIDebugVisualisationCylinder
{
public:
	struct Vector                                                To;                                                // 0x0(0xc)
	struct Vector                                                From;                                              // 0xc(0xc)
	float                                                        Radius;                                            // 0x18(0x4)
	float                                                        LifeTime;                                          // 0x1c(0x4)
	byte                                                         Colour;                                            // 0x20(0x1)
	char                                                         pad0x3_NKZ4C[0x3];                                 // 0x21(0x3)
};


// Size 0x40
struct AIDebugVisualisationBox
{
public:
	struct Vector                                                Centre;                                            // 0x0(0xc)
	struct Vector                                                Extents;                                           // 0xc(0xc)
	char                                                         pad0x8_I260I[0x8];                                 // 0x18(0x8)
	struct Quat                                                  Rotation;                                          // 0x20(0x10)
	float                                                        LifeTime;                                          // 0x30(0x4)
	byte                                                         Colour;                                            // 0x34(0x1)
	char                                                         pad0xb_KUUA2[0xb];                                 // 0x35(0xb)
};


// Size 0x20
struct AIDebugVisualisationLine
{
public:
	struct Vector                                                From;                                              // 0x0(0xc)
	struct Vector                                                To;                                                // 0xc(0xc)
	float                                                        LifeTime;                                          // 0x18(0x4)
	byte                                                         Colour;                                            // 0x1c(0x1)
	char                                                         pad0x3_SDANJ[0x3];                                 // 0x1d(0x3)
};


// Size 0x20
struct TargetItemDropProgressionPair
{
public:
	struct StringAssetReference                                  CrewItemSpawn;                                     // 0x0(0x10)
	struct StringAssetReference                                  CaptainItemSpawn;                                  // 0x10(0x10)
};


// Size 0x38
struct AIFormVarietyEntry
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	char                                                         pad0x4_GI9JX[0x4];                                 // 0xc(0x4)
	struct StringAssetReference                                  Form;                                              // 0x10(0x10)
	float                                                        Weight;                                            // 0x20(0x4)
	int                                                          MaxPerEncounter;                                   // 0x24(0x4)
	TArray<struct AIIndividualVarietyEntry>                      Individuals;                                       // 0x28(0x10)
};


// Size 0x30
struct AIIndividualVarietyEntry
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	char                                                         pad0x4_G2YU2[0x4];                                 // 0xc(0x4)
	TArray<struct StringAssetReference>                          Loadouts;                                          // 0x10(0x10)
	int                                                          RankOffset;                                        // 0x20(0x4)
	float                                                        Weight;                                            // 0x24(0x4)
	int                                                          MaxPerEncounter;                                   // 0x28(0x4)
	char                                                         pad0x4_3VC0T[0x4];                                 // 0x2c(0x4)
};


// Size 0x18
struct AIEncounterGenerationRecipeFeatureBasedRankOrderList
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	TArray<class AIEncounterGenerationRecipe*>                   Recipes;                                           // 0x8(0x10)
};


// Size 0x18
struct AthenaAIFormComponentVfxCustomisation
{
public:
	class UClass*                                                VfxCustomisationType;                              // 0x0(0x8)
	bool                                                         VfxEnabled;                                        // 0x8(0x1)
	char                                                         pad0x7_XTED7[0x7];                                 // 0x9(0x7)
	class Object*                                                VfxTemplate;                                       // 0x10(0x8)
};


// Size 0x10
struct AIFormDamageResponse
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	float                                                        DamageMultiplier;                                  // 0x8(0x4)
	byte                                                         HitReaction;                                       // 0xc(0x1)
	bool                                                         IsKnockbackDisabled;                               // 0xd(0x1)
	bool                                                         IsStunDisabled;                                    // 0xe(0x1)
	char                                                         pad0x1_A0OSI[0x1];                                 // 0xf(0x1)
};


// Size 0x18
struct AIFormRankMapping
{
public:
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x0(0x8)
	TArray<Float Weights>                                        Weights;                                           // 0x8(0x10)
};


// Size 0x18
struct AIPartsCategoryFormMapping
{
public:
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x0(0x8)
	TArray<struct AIPartsCategoryMapping>                        CategoryMappings;                                  // 0x8(0x10)
};


// Size 0x10
struct AIPartsCategoryMapping
{
public:
	class UClass*                                                ClassId;                                           // 0x0(0x8)
	class AIPartsCategory*                                       PartsCategory;                                     // 0x8(0x8)
};


// Size 0x18
struct AISkillsetRankMapping
{
public:
	class AthenaAIControllerParamsDataAsset*                     Skillset;                                          // 0x0(0x8)
	TArray<Float Weights>                                        Weights;                                           // 0x8(0x10)
};


// Size 0x10
struct FeatureToggledAIEncounterSpecificSkillSetCollection
{
public:
	TArray<struct FeatureToggledAIEncounterSpecificSkillSet>     ToggledSkillsets;                                  // 0x0(0x10)
};


// Size 0x20
struct FeatureToggledAIEncounterSpecificSkillSet
{
public:
	struct StringAssetReference                                  ToggledSpecificSkillset;                           // 0x0(0x10)
	struct FeatureFlag                                           Feature;                                           // 0x10(0xc)
	char                                                         pad0x4_3HI3O[0x4];                                 // 0x1c(0x4)
};


// Size 0x30
struct AIDropSpawnerRankMapping
{
public:
	char                                                         pad0x20_4ADG2[0x20];                               // 0x0(0x20)
	TArray<Float Weights>                                        Weights;                                           // 0x20(0x10)
};


// Size 0x18
struct AILoadoutRankMapping
{
public:
	class LoadoutAsset*                                          Loadout;                                           // 0x0(0x8)
	TArray<Float Weights>                                        Weights;                                           // 0x8(0x10)
};


// Size 0x20
struct CustomPlayersAITrackerData
{
public:
	class AIPlayerTracker*                                       Tracker;                                           // 0x0(0x8)
	char                                                         pad0x18_SZLZP[0x18];                               // 0x8(0x18)
};


// Size 0x58
struct AITypeData
{
public:
	struct FName                                                 AITypeName;                                        // 0x0(0x8)
	struct StringClassReference                                  AIPawnClass;                                       // 0x8(0x10)
	struct StringAssetReference                                  DefaultDebugSkillset;                              // 0x18(0x10)
	struct StringAssetReference                                  DefaultDebugLoadout;                               // 0x28(0x10)
	class UClass*                                                DefaultDebugAIClassId;                             // 0x38(0x8)
	bool                                                         RequireNavMesh;                                    // 0x40(0x1)
	char                                                         pad0x3_6OQKQ[0x3];                                 // 0x41(0x3)
	int                                                          AIRegionCostUnits;                                 // 0x44(0x4)
	int                                                          AIWorldCostUnits;                                  // 0x48(0x4)
	struct FName                                                 FeatureToggle;                                     // 0x4c(0x8)
	char                                                         pad0x4_I4WS7[0x4];                                 // 0x54(0x4)
};


// Size 0x18
struct AISpawnWaveSequenceRankMapping
{
public:
	class AISpawnWaveSequence*                                   SpawnWaveSequence;                                 // 0x0(0x8)
	TArray<Float Weights>                                        Weights;                                           // 0x8(0x10)
};


// Size 0x18
struct AIWeightedProbabilityRangeOfRangesRankMapping
{
public:
	class AIWeightedProbabilityRangeOfRangesAsset*               RangeOfRanges;                                     // 0x0(0x8)
	TArray<Float Weights>                                        Weights;                                           // 0x8(0x10)
};


// Size 0x28
struct AIEncounterAndWaveSettingsOverride
{
public:
	class AIEncounterSettings*                                   EncounterSettings;                                 // 0x0(0x8)
	class AISpawnWaveSequenceRankProgression*                    SpawnWaveProgression;                              // 0x8(0x8)
	float                                                        Chance;                                            // 0x10(0x4)
	char                                                         pad0x4_4BIFE[0x4];                                 // 0x14(0x4)
	TArray<class AISpawnerPrerequisiteBase*>                     Prerequisites;                                     // 0x18(0x10)
};


// Size 0x10
struct AdditionalSpawnerBehaviour
{
public:
	class SpawnerBehaviourStrategy*                              BehaviourStrategy;                                 // 0x0(0x8)
	char                                                         pad0x8_0Y5N4[0x8];                                 // 0x8(0x8)
};


// Size 0x10
struct AISpawnOverride
{
public:
	struct StringAssetReference                                  FormOverride;                                      // 0x0(0x10)
};


// Size 0x18
struct ConditionalAISpawnOverride
{
public:
	class AISpawnOverrideCondition*                              Condition;                                         // 0x0(0x8)
	struct AISpawnOverride                                       Override;                                          // 0x8(0x10)
};


// Size 0x38
struct AISpawnContextIdEncounterSettingsPair
{
public:
	TArray<class Class*>                                         SpawnContexts;                                     // 0x0(0x10)
	bool                                                         DisableSpawning;                                   // 0x10(0x1)
	char                                                         pad0x7_PB9TF[0x7];                                 // 0x11(0x7)
	class AIEncounterSettings*                                   EncounterSettings;                                 // 0x18(0x8)
	class AISpawnWaveSequenceRankProgression*                    SpawnWaveProgression;                              // 0x20(0x8)
	TArray<struct AIEncounterAndWaveSettingsOverride>            EncounterAndWaveSettingsOverride;                  // 0x28(0x10)
};


// Size 0x2c
struct AIExclusionZone
{
public:
	struct Guid                                                  Id;                                                // 0x0(0x10)
	struct Vector                                                Location;                                          // 0x10(0xc)
	float                                                        RadiusSquared;                                     // 0x1c(0x4)
	float                                                        Radius;                                            // 0x20(0x4)
	float                                                        Height;                                            // 0x24(0x4)
	struct TimerHandle                                           RemoveTimer;                                       // 0x28(0x4)
};


// Size 0x10
struct AICountTelemetryEvent
{
public:
	int                                                          NumTotalSpawns;                                    // 0x0(0x4)
	int                                                          CurrentTotalWorldAICostUnits;                      // 0x4(0x4)
	int                                                          NumActiveRegions;                                  // 0x8(0x4)
	int                                                          NumPlayers;                                        // 0xc(0x4)
};


// Size 0xc
struct AIPartIdNumVariantInfo
{
public:
	struct FName                                                 AIPartId;                                          // 0x0(0x8)
	int                                                          NumVariants;                                       // 0x8(0x4)
};


// Size 0x1
struct EventAIPartsRetrievalComponentBeforeBeginLoad
{
public:
	char                                                         pad0x1_HT1E8[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct ReplicatedAIPartsData
{
public:
	class AIPartsCategory*                                       PartsCategory;                                     // 0x0(0x8)
	struct AIPartId                                              AIPartId;                                          // 0x8(0x8)
	int                                                          MeshIndex;                                         // 0x10(0x4)
	int                                                          TeamColorIndex;                                    // 0x14(0x4)
};


// Size 0x14
struct AIPerCrewSpawnerStoryBasedRespawnSettings
{
public:
	struct AIPerCrewSpawnerRespawnSettings                       RespawnSettings;                                   // 0x0(0xc)
	struct StoryFlag                                             Story;                                             // 0xc(0x8)
};


// Size 0xc
struct AIPerCrewSpawnerRespawnSettings
{
public:
	float                                                        MinRespawnTimeInterval;                            // 0x0(0x4)
	float                                                        MaxRespawnTimeInterval;                            // 0x4(0x4)
	float                                                        RespawnChance;                                     // 0x8(0x4)
};


// Size 0x20
struct SpawnLocationGroup
{
public:
	TArray<struct FName>                                         AllowedSpawnTypes;                                 // 0x0(0x10)
	TArray<struct Vector>                                        SpawnLocations;                                    // 0x10(0x10)
};


// Size 0x10
struct AISpawnContextData
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	class UClass*                                                Id;                                                // 0x8(0x8)
};


// Size 0x20
struct AIFixedWavesSpawnerArchive
{
public:
	char                                                         pad0x8_N6TUX[0x8];                                 // 0x0(0x8)
	TArray<Int NumSpawnedPawnsInWaves>                           NumSpawnedPawnsInWaves;                            // 0x8(0x10)
	bool                                                         WavesSpawnedOnSpottedNewTarget;                    // 0x18(0x1)
	char                                                         pad0x7_O8N7W[0x7];                                 // 0x19(0x7)
};


// Size 0x18
struct AIIncrementalWaveSpawnerArchive
{
public:
	char                                                         pad0x8_DX68Z[0x8];                                 // 0x0(0x8)
	struct Vector                                                LastTargetPosition;                                // 0x8(0xc)
	int                                                          CurrentNumSpawnedPawns;                            // 0x14(0x4)
};


// Size 0x18
struct AIPerCrewSpawnerRespawnUnit
{
public:
	char                                                         pad0x18_BRP27[0x18];                               // 0x0(0x18)
};


// Size 0x40
struct AIPerCrewSpawnerCrewUnit
{
public:
	char                                                         pad0x20_SYWR0[0x20];                               // 0x0(0x20)
	TArray<struct AISpawnerWave>                                 SelectedWaves;                                     // 0x20(0x10)
	TArray<class AISpawnerPrerequisiteBase*>                     Prerequisites;                                     // 0x30(0x10)
};


// Size 0x38
struct TemporaryPlayerDetailsUnitEntry
{
public:
	char                                                         pad0x38_CFABT[0x38];                               // 0x0(0x38)
};


// Size 0x30
struct AIPerPlayerSpawnerPlayerDetailsUnit
{
public:
	char                                                         pad0x30_JEXZF[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct AICustomClassIdNameOverrides
{
public:
	TArray<class Class*>                                         ClassIds;                                          // 0x0(0x10)
	TArray<struct FText>                                         Names;                                             // 0x10(0x10)
};


// Size 0x40
struct AICustomNameTitleMapping
{
public:
	class UClass*                                                AIClassId;                                         // 0x0(0x8)
	struct FText                                                 Title;                                             // 0x8(0x38)
};


// Size 0x10
struct AIProgressiveWavesSpawnerArchive
{
public:
	char                                                         pad0x8_QP76T[0x8];                                 // 0x0(0x8)
	int                                                          CurrentWaveIndex;                                  // 0x8(0x4)
	char                                                         pad0x4_VKN91[0x4];                                 // 0xc(0x4)
};


// Size 0x108
struct EscalatingWave
{
public:
	int                                                          WaveNumber;                                        // 0x0(0x4)
	char                                                         pad0x4_QK5YW[0x4];                                 // 0x4(0x4)
	struct AISpawnerWave                                         SpawnedWave;                                       // 0x8(0x100)
};


// Size 0x34
struct AITargetInfo
{
public:
	struct AITargetBounds                                        Bounds;                                            // 0x0(0x18)
	struct Vector                                                TargetPos;                                         // 0x18(0xc)
	struct Vector                                                TargetVelocity;                                    // 0x24(0xc)
	float                                                        TargetYaw;                                         // 0x30(0x4)
};


// Size 0x18
struct AITargetBounds
{
public:
	struct Vector                                                Offset;                                            // 0x0(0xc)
	struct Vector                                                Extents;                                           // 0xc(0xc)
};


// Size 0xc
struct PerDepthSpawnChance
{
public:
	float                                                        DepthUpperBound;                                   // 0x0(0x4)
	float                                                        DepthLowerBound;                                   // 0x4(0x4)
	float                                                        ChanceToSpawn;                                     // 0x8(0x4)
};


// Size 0x20
struct PlayerInWaterData
{
public:
	char                                                         pad0x20_XZ7D5[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct SirenEncounterData
{
public:
	class World*                                                 GameWorld;                                         // 0x0(0x8)
	class AIPerPlayerSpawner*                                    SirenSpawner;                                      // 0x8(0x8)
	class SimpleAIRegion*                                        AIRegion;                                          // 0x10(0x8)
	class AIProximityPlayerTracker*                              ProximityPlayerTracker;                            // 0x18(0x8)
	float                                                        ShutdownTime;                                      // 0x20(0x4)
	byte                                                         SirenEncounterState;                               // 0x24(0x1)
	char                                                         pad0x3_QD1DT[0x3];                                 // 0x25(0x3)
};


// Size 0xc
struct ChanceForSharksToBlockSirenEncounterData
{
public:
	int                                                          NumberOfSharks;                                    // 0x0(0x4)
	float                                                        ChanceToSpawn;                                     // 0x4(0x4)
	float                                                        RadiusToCheck;                                     // 0x8(0x4)
};


// Size 0x8
struct MinMaxBurrowAbility
{
public:
	float                                                        MinValue;                                          // 0x0(0x4)
	float                                                        MaxValue;                                          // 0x4(0x4)
};


// Size 0x18
struct WeightedAmmoTypeRange
{
public:
	float                                                        MinRange;                                          // 0x0(0x4)
	char                                                         pad0x4_VFFGH[0x4];                                 // 0x4(0x4)
	TArray<struct WeightedAmmoType>                              AmmoTypeProbabilities;                             // 0x8(0x10)
};


// Size 0x10
struct WeightedAmmoType
{
public:
	float                                                        ProbabilityAtRange;                                // 0x0(0x4)
	char                                                         pad0x4_5D39G[0x4];                                 // 0x4(0x4)
	class UClass*                                                AmmoType;                                          // 0x8(0x8)
};


// Size 0x38
struct AthenaAIControllerTargetPickingData
{
public:
	struct FString                                               TargetName;                                        // 0x0(0x10)
	bool                                                         BestTargetByScore;                                 // 0x10(0x1)
	bool                                                         IsCurrentTargetActor;                              // 0x11(0x1)
	char                                                         pad0x2_21MJ5[0x2];                                 // 0x12(0x2)
	float                                                        TargetScore;                                       // 0x14(0x4)
	float                                                        DistScore;                                         // 0x18(0x4)
	float                                                        FacingScore;                                       // 0x1c(0x4)
	float                                                        TargetWeightScore;                                 // 0x20(0x4)
	float                                                        DamageScore;                                       // 0x24(0x4)
	float                                                        TargetDistance;                                    // 0x28(0x4)
	float                                                        TargetAngle;                                       // 0x2c(0x4)
	int                                                          NumTargeting;                                      // 0x30(0x4)
	float                                                        RecentDamage;                                      // 0x34(0x4)
};


// Size 0x10
struct AIStategyControllerMovementMod
{
public:
	class UClass*                                                AIStrategy;                                        // 0x0(0x8)
	float                                                        OverrideControlRotationInterpSpeed;                // 0x8(0x4)
	char                                                         pad0x4_MEHLY[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct CarriedItemThreatOverride
{
public:
	class UClass*                                                ItemDesc;                                          // 0x0(0x8)
	float                                                        Threat;                                            // 0x8(0x4)
	char                                                         pad0x4_EKO1M[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct HearingThreat
{
public:
	struct FName                                                 SoundTag;                                          // 0x0(0x8)
	float                                                        Threat;                                            // 0x8(0x4)
	float                                                        CarrierSpeedThreshold;                             // 0xc(0x4)
};


// Size 0x18
struct AIControllerDynamicBalancingNamedParamMapping
{
public:
	int                                                          MaxCrewStrength;                                   // 0x0(0x4)
	char                                                         pad0x4_FP94J[0x4];                                 // 0x4(0x4)
	TArray<struct AthenaAIControllerParamValue>                  CrewStrengthDynamicNamedParamOverrides;            // 0x8(0x10)
};


// Size 0x10
struct AIControllerDynamicBalancingPlayerShipValueDesc
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	int                                                          ShipValue;                                         // 0x8(0x4)
	char                                                         pad0x4_MI0F2[0x4];                                 // 0xc(0x4)
};


// Size 0x18
struct DamageModifierCrewProximityVulnerabilityPairs
{
public:
	int                                                          NumPlayersInRange;                                 // 0x0(0x4)
	float                                                        GlobalDamageMultiplier;                            // 0x4(0x4)
	TArray<struct DamageableVulnerabilityPair>                   DamageMultipliers;                                 // 0x8(0x10)
};


// Size 0x38
struct BlackboardValueCondition
{
public:
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x0(0x28)
	byte                                                         Comparison;                                        // 0x28(0x1)
	char                                                         pad0x3_T8FVI[0x3];                                 // 0x29(0x3)
	float                                                        Value;                                             // 0x2c(0x4)
	bool                                                         OnEntry;                                           // 0x30(0x1)
	bool                                                         OnExit;                                            // 0x31(0x1)
	char                                                         pad0x6_8CK2R[0x6];                                 // 0x32(0x6)
};


// Size 0x58
struct ChanceAndBlackboardKeyPair
{
public:
	struct AIDataProviderFloatValue                              Chance;                                            // 0x0(0x30)
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x30(0x28)
};


// Size 0x38
struct ConditionalBasedOnBlackboardKey
{
public:
	bool                                                         UseCondition;                                      // 0x0(0x1)
	char                                                         pad0x7_QNSU0[0x7];                                 // 0x1(0x7)
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x8(0x28)
	bool                                                         NegateCondition;                                   // 0x30(0x1)
	char                                                         pad0x7_VM7FL[0x7];                                 // 0x31(0x7)
};


// Size 0x38
struct WeightedAIStrategyChance
{
public:
	class UClass*                                                Strategy;                                          // 0x0(0x8)
	struct AIDataProviderFloatValue                              WeightedChance;                                    // 0x8(0x30)
};


// Size 0x18
struct AIStrategyVulnerabilityData
{
public:
	class UClass*                                                Strategy;                                          // 0x0(0x8)
	TArray<Byte PreventedHealthChanges>                          PreventedHealthChanges;                            // 0x8(0x10)
};


// Size 0x1
struct EventSporeBreathAIAbilityFinished
{
public:
	char                                                         pad0x1_9I1BH[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventSporeBreathAIAbilityStarted
{
public:
	char                                                         pad0x1_3VVLK[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct EventAIFormEncounteredByLocalPlayer
{
public:
	char                                                         pad0x10_9UBI9[0x10];                               // 0x0(0x10)
	class UClass*                                                FormType;                                          // 0x10(0x8)
};


// Size 0x8
struct EventAIAbilityStarted
{
public:
	class UClass*                                                AbilityTypeCategory;                               // 0x0(0x8)
};


// Size 0x1
struct EventAIVulnerabilityAbilityEnded
{
public:
	char                                                         pad0x1_MUPQ2[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventAIVulnerabilityAbilityStarted
{
public:
	char                                                         pad0x1_B4PNS[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventAIPawnCarrierChange
{
public:
	class Actor*                                                 Carrier;                                           // 0x0(0x8)
};


// Size 0x1
struct EventAIDebugTextUpdated
{
public:
	char                                                         pad0x1_S1ERJ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventAIControllerUnPossess
{
public:
	char                                                         pad0x1_4P8PH[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventAIKnockbackEnded
{
public:
	char                                                         pad0x1_HLB5K[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct EventAIKnockbackStarted
{
public:
	char                                                         pad0x18_L6NQE[0x18];                               // 0x0(0x18)
};


// Size 0x8
struct EventNewAIStrategyBPReadable
{
public:
	class UClass*                                                NewAIStrategy;                                     // 0x0(0x8)
};


// Size 0x8
struct EventNewAIStrategy
{
public:
	class UClass*                                                NewAIStrategy;                                     // 0x0(0x8)
};


// Size 0x1
struct EventPawnRequestDespawn
{
public:
	char                                                         pad0x1_UF0W2[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventPawnRemoveOwnership
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
};


// Size 0x1
struct EventOwnedPawnRemoveOwnership
{
public:
	char                                                         pad0x1_AFB35[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventAIPartRetrievalRequestFailed
{
public:
	char                                                         pad0x1_4BXK7[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct EventVisualAppearanceSelected
{
public:
	class AIPartsCategory*                                       PartsCategory;                                     // 0x0(0x8)
	struct AIPartId                                              AIPartId;                                          // 0x8(0x8)
	int                                                          PartsIndexToUse;                                   // 0x10(0x4)
	int                                                          ColorTextureIndex;                                 // 0x14(0x4)
};


// Size 0x30
struct EventAILoadoutSelected
{
public:
	struct ItemLoadout                                           Loadout;                                           // 0x0(0x20)
	class UClass*                                                NonStorableItem;                                   // 0x20(0x8)
	char                                                         pad0x8_QH35Z[0x8];                                 // 0x28(0x8)
};


// Size 0x8
struct EventAIAmmoSelected
{
public:
	class AthenaAIAmmoDataAsset*                                 Ammo;                                              // 0x0(0x8)
};


// Size 0x8
struct EventAIFormSelected
{
public:
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x0(0x8)
};


// Size 0x1
struct EventAIPawnReadyToConstructDebugText
{
public:
	char                                                         pad0x1_2O2NY[0x1];                                 // 0x0(0x1)
};


// Size 0x50
struct EventOwnedPawnFinishedSpawning
{
public:
	class Object*                                                AICoordinator;                                     // 0x0(0x8)
	struct FName                                                 Region;                                            // 0x8(0x8)
	struct Vector                                                SpawnPos;                                          // 0x10(0xc)
	char                                                         pad0x4_HEIE9[0x4];                                 // 0x1c(0x4)
	class Actor*                                                 ActorToPerceiveOnSpawn;                            // 0x20(0x8)
	float                                                        MaximumDistanceToPerceiveOnSpawn;                  // 0x28(0x4)
	char                                                         pad0x4_IYBL8[0x4];                                 // 0x2c(0x4)
	class AthenaAIControllerParamsDataAsset*                     Skillset;                                          // 0x30(0x8)
	struct FName                                                 HomeRegionZone;                                    // 0x38(0x8)
	class Object*                                                TargetInteractableOnSpawn;                         // 0x40(0x8)
	class AISpawner*                                             OwnerAISpawner;                                    // 0x48(0x8)
};


// Size 0x8
struct EventPlayerLeftAISpawnableWater
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x18
struct EventPlayerEnterAISpawnableWater
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	char                                                         pad0x10_1GXZK[0x10];                               // 0x8(0x10)
};


// Size 0x20
struct EventPlayerSetFootUponAISpawnRegion
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	char                                                         pad0x18_P4VZO[0x18];                               // 0x8(0x18)
};


// Size 0x20
struct EventCrewedShipLeftAISpawnRegion
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	char                                                         pad0x18_ZSLH9[0x18];                               // 0x8(0x18)
};


// Size 0x20
struct EventCrewedShipEnteredAISpawnRegion
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	char                                                         pad0x18_4QOGV[0x18];                               // 0x8(0x18)
};


// Size 0x18
struct EventPlayerLeftAISpawnRegion
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	char                                                         pad0x10_YCC2K[0x10];                               // 0x8(0x10)
};


// Size 0x20
struct EventPlayerEnteredAISpawnRegion
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	char                                                         pad0x18_274Y5[0x18];                               // 0x8(0x18)
};


// Size 0x1
struct EventAllAIProgressiveWavesCompleted
{
public:
	char                                                         pad0x1_RO6CV[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventAIPawnRemovedFromAIRegion
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
	char                                                         pad0x8_5HLOE[0x8];                                 // 0x8(0x8)
};


// Size 0x10
struct EventAIPawnAddedToAIRegion
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
	char                                                         pad0x8_39BBJ[0x8];                                 // 0x8(0x8)
};


// Size 0x1
struct EventOceanCrawlerAIBuffAudioRequest
{
public:
	bool                                                         IsBuffGiver;                                       // 0x0(0x1)
};


// Size 0x8
struct EventOceanCrawlerAIAbilityAudioRequest
{
public:
	byte                                                         RequestAudioKey;                                   // 0x0(0x1)
	char                                                         pad0x3_FXGBO[0x3];                                 // 0x1(0x3)
	float                                                        AudioDelay;                                        // 0x4(0x4)
};


// Size 0x14
struct AthenaAICharacterParams
{
public:
	float                                                        MissFiringHeightOffset;                            // 0x0(0x4)
	float                                                        MissFiringTargetInFrontOffset;                     // 0x4(0x4)
	float                                                        MinMissFiringTargetInFrontOffset;                  // 0x8(0x4)
	float                                                        MaxMissFiringTargetInFrontOffset;                  // 0xc(0x4)
	float                                                        BufferTimeWhenChangingItems;                       // 0x10(0x4)
};


// Size 0x1
struct EventAthenaAISpawnBeginAnim
{
public:
	byte                                                         SpawnType;                                         // 0x0(0x1)
};


// Size 0x2
struct EventAthenaAISpawnActive
{
public:
	byte                                                         SpawnType;                                         // 0x0(0x1)
	bool                                                         SpawnActive;                                       // 0x1(0x1)
};


// Size 0x50
struct AISpawnerTelemetryEvent
{
public:
	struct FString                                               AISpawnerSourceAsset;                              // 0x0(0x10)
	struct FString                                               AISpawnerType;                                     // 0x10(0x10)
	struct FString                                               AISpawnerRegion;                                   // 0x20(0x10)
	TArray<Str AISpawnerContexts>                                AISpawnerContexts;                                 // 0x30(0x10)
	int                                                          AISpawnerWaveSpawnNumber;                          // 0x40(0x4)
	float                                                        AISpawnerWaveDelayBefore;                          // 0x44(0x4)
	float                                                        AISpawnerWaveDelayAfter;                           // 0x48(0x4)
	char                                                         pad0x4_FE4QQ[0x4];                                 // 0x4c(0x4)
};


// Size 0xd8
struct AITelemetryFragmentInput
{
public:
	char                                                         pad0x8_QUPIH[0x8];                                 // 0x0(0x8)
	struct AIEncounterSpecification                              AIEncounterSpecification;                          // 0x8(0xd0)
};


// Size 0x70
struct AITelemetryFragment
{
public:
	struct FString                                               AIType;                                            // 0x0(0x10)
	struct FString                                               AIId;                                              // 0x10(0x10)
	TArray<Str AILoadOut>                                        AILoadOut;                                         // 0x20(0x10)
	struct FString                                               AIPawnType;                                        // 0x30(0x10)
	struct FString                                               AISkillset;                                        // 0x40(0x10)
	struct FString                                               AIForm;                                            // 0x50(0x10)
	struct FString                                               AIClass;                                           // 0x60(0x10)
};


// Size 0x2c
struct AIHealthChangeTelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	float                                                        CurrentHealth;                                     // 0x10(0x4)
	float                                                        PreviousHealth;                                    // 0x14(0x4)
	float                                                        HealthDelta;                                       // 0x18(0x4)
	struct Vector                                                Position;                                          // 0x1c(0xc)
	byte                                                         Reason;                                            // 0x28(0x1)
	char                                                         pad0x3_W3ZDW[0x3];                                 // 0x29(0x3)
};


// Size 0x10
struct PlayerKillAITelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
};


// Size 0x10
struct AISpawnTelemetryEvent
{
public:
	struct FString                                               LocationName;                                      // 0x0(0x10)
};


// Size 0x10
struct AIActorTimeout
{
public:
	class Actor*                                                 AIActor;                                           // 0x0(0x8)
	float                                                        Timer;                                             // 0x8(0x4)
	char                                                         pad0x4_WKHLI[0x4];                                 // 0xc(0x4)
};


}