#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x1
struct SpatialAudioGetHeadsetListToGame
{
public:
	char                                                         pad0x1_F0F1B[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct SpatialAudioState
{
public:
	struct FString                                               UserState;                                         // 0x0(0x10)
	struct FString                                               StatusCode;                                        // 0x10(0x10)
	struct FString                                               QRCodeUrl;                                         // 0x20(0x10)
	int                                                          HeadsetSelectedId;                                 // 0x30(0x4)
	int                                                          TrialDaysRemaining;                                // 0x34(0x4)
	bool                                                         QRCodeShouldHide;                                  // 0x38(0x1)
	char                                                         pad0x7_6SEOP[0x7];                                 // 0x39(0x7)
};


// Size 0x80
struct AthenaAudioBootflowEvents
{
public:
	TArray<class WwiseEvent*>                                    EventsToPlayOnLobbyStart;                          // 0x0(0x10)
	TArray<class WwiseEvent*>                                    EventsToPlayOnLobbyEnd;                            // 0x10(0x10)
	TArray<class WwiseEvent*>                                    EventsToPlayOnEngageStart;                         // 0x20(0x10)
	TArray<class WwiseEvent*>                                    EventsToPlayOnEngageEnd;                           // 0x30(0x10)
	TArray<class WwiseEvent*>                                    EventsToPlayOnLoadingStart;                        // 0x40(0x10)
	TArray<class WwiseEvent*>                                    EventsToPlayOnLoadingEnd;                          // 0x50(0x10)
	TArray<class WwiseEvent*>                                    EventsToPlayOnFrontEndOrLoadingStart;              // 0x60(0x10)
	TArray<class WwiseEvent*>                                    EventsToPlayOnFrontEndOrLoadingEnd;                // 0x70(0x10)
};


// Size 0x18
struct ImmerseHeadsetUI
{
public:
	int                                                          Id;                                                // 0x0(0x4)
	char                                                         pad0x4_WUFW7[0x4];                                 // 0x4(0x4)
	struct FString                                               Name;                                              // 0x8(0x10)
};


// Size 0x1
struct SpatialAudioPersonalizedHRTFBeginToGame
{
public:
	char                                                         pad0x1_OR05X[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct AnimNotify_SoundSwitch
{
public:
	struct StringAssetReference                                  SkeletalMeshReference;                             // 0x0(0x10)
	struct FName                                                 SkeletalMeshCategoryName;                          // 0x10(0x8)
};


// Size 0x1
struct SpatialAudioPurchaseBeginToGame
{
public:
	char                                                         pad0x1_EC7LX[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct StoryDrivenAudioPortalSetting
{
public:
	struct StoryFlag                                             Story;                                             // 0x0(0x8)
	class AudioSpaceDataAsset*                                   AudioInsideSpace;                                  // 0x8(0x8)
	class AudioSpaceDataAsset*                                   AudioOutsideSpace;                                 // 0x10(0x8)
};


// Size 0x1
struct SpatialAudioPersonalizedHRTFCancelledToGame
{
public:
	char                                                         pad0x1_HGXG2[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct AthenaAudioGameStateSettings
{
public:
	struct FName                                                 AudioGameStateGroupName;                           // 0x0(0x8)
	struct FName                                                 AudioGameStateFrontend;                            // 0x8(0x8)
	struct FName                                                 AudioGameStateLoading;                             // 0x10(0x8)
	struct FName                                                 AudioGameStateIngame;                              // 0x18(0x8)
	struct FName                                                 EngageAnimationStateGroupName;                     // 0x20(0x8)
	struct FName                                                 EngageAnimationStateEngageName;                    // 0x28(0x8)
};


// Size 0x4
struct SpatialAudioHeadsetSelectionToGame
{
public:
	int                                                          HeadsetSelectedId;                                 // 0x0(0x4)
};


// Size 0x1
struct SpatialAudioStateUpdateRequestToGame
{
public:
	char                                                         pad0x1_BY9DJ[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct SpatialAudioPurchaseSuccessToUI
{
public:
	struct SpatialAudioState                                     State;                                             // 0x0(0x40)
};


// Size 0x40
struct SpatialAudioPersonalizedHRTFSuccessToUI
{
public:
	struct SpatialAudioState                                     State;                                             // 0x0(0x40)
};


// Size 0x40
struct SpatialAudioStateUpdateToUI
{
public:
	struct SpatialAudioState                                     State;                                             // 0x0(0x40)
};


// Size 0x40
struct SpatialAudioHeadsetSelectionErrorToUI
{
public:
	struct SpatialAudioState                                     State;                                             // 0x0(0x40)
};


// Size 0x40
struct SpatialAudioPurchaseCancelledToUI
{
public:
	struct SpatialAudioState                                     State;                                             // 0x0(0x40)
};


// Size 0x40
struct SpatialAudioHeadsetSelectionSuccessToUI
{
public:
	struct SpatialAudioState                                     State;                                             // 0x0(0x40)
};


// Size 0x40
struct SpatialAudioPersonalizedHRTFErrorToUI
{
public:
	struct SpatialAudioState                                     State;                                             // 0x0(0x40)
};


// Size 0x40
struct SpatialAudioPurchaseErrorToUI
{
public:
	struct SpatialAudioState                                     State;                                             // 0x0(0x40)
};


// Size 0x10
struct SpatialAudioGetHeadsetListToUI
{
public:
	TArray<struct ImmerseHeadsetUI>                              HeadsetList;                                       // 0x0(0x10)
};


