// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x30
struct DrawDebugItemString
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x7_075FJ[0x7];                                 // 0x9(0x7)
	struct FString                                               String;                                            // 0x10(0x10)
	struct Color                                                 Colour;                                            // 0x20(0x4)
	struct Vector                                                StringPos;                                         // 0x24(0xc)
};


// Size 0x28
struct DrawDebugItemMessage
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x7_WU1MM[0x7];                                 // 0x9(0x7)
	struct FString                                               Message;                                           // 0x10(0x10)
	struct Color                                                 Colour;                                            // 0x20(0x4)
	char                                                         pad0x4_U1CFL[0x4];                                 // 0x24(0x4)
};


// Size 0x48
struct DrawDebugItemSector
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x3_14V8B[0x3];                                 // 0x9(0x3)
	float                                                        RotationAngle;                                     // 0xc(0x4)
	struct Vector                                                Centre;                                            // 0x10(0xc)
	float                                                        SectorAngle;                                       // 0x1c(0x4)
	float                                                        Radius;                                            // 0x20(0x4)
	struct Color                                                 Colour;                                            // 0x24(0x4)
	struct Vector                                                ZeroAngleVector;                                   // 0x28(0xc)
	struct Vector                                                RotationAxis;                                      // 0x34(0xc)
	float                                                        SubAngles;                                         // 0x40(0x4)
	float                                                        Thickness;                                         // 0x44(0x4)
};


// Size 0x2c
struct DrawDebugItemLine
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x3_P7J3J[0x3];                                 // 0x9(0x3)
	struct Vector                                                LineStart;                                         // 0xc(0xc)
	struct Vector                                                LineEnd;                                           // 0x18(0xc)
	struct Color                                                 Colour;                                            // 0x24(0x4)
	float                                                        Thickness;                                         // 0x28(0x4)
};


// Size 0x40
struct DrawDebugItemCapsule
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x3_D1YS9[0x3];                                 // 0x9(0x3)
	struct Vector                                                CentrePos;                                         // 0xc(0xc)
	float                                                        HalfHeight;                                        // 0x18(0x4)
	float                                                        Radius;                                            // 0x1c(0x4)
	struct Quat                                                  Rotation;                                          // 0x20(0x10)
	struct Color                                                 Colour;                                            // 0x30(0x4)
	char                                                         pad0xc_EOJEE[0xc];                                 // 0x34(0xc)
};


// Size 0x50
struct DrawDebugItemBox
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x3_XVWGX[0x3];                                 // 0x9(0x3)
	struct Vector                                                CentrePos;                                         // 0xc(0xc)
	struct Vector                                                Box;                                               // 0x18(0xc)
	char                                                         pad0xc_ILEB8[0xc];                                 // 0x24(0xc)
	struct Quat                                                  Rotation;                                          // 0x30(0x10)
	struct Color                                                 Colour;                                            // 0x40(0x4)
	char                                                         pad0xc_4T49B[0xc];                                 // 0x44(0xc)
};


// Size 0x20
struct DrawDebugItemSphere
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	bool                                                         ReplaceInGroup;                                    // 0x8(0x1)
	char                                                         pad0x3_LLB5U[0x3];                                 // 0x9(0x3)
	struct Vector                                                CentrePos;                                         // 0xc(0xc)
	float                                                        Radius;                                            // 0x18(0x4)
	struct Color                                                 Colour;                                            // 0x1c(0x4)
};


// Size 0x18
struct SphereData
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
	int                                                          Segments;                                          // 0x10(0x4)
	struct Color                                                 Colour;                                            // 0x14(0x4)
};


}