#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x8
struct HealthRegenState
{
public:
	float                                                        CurrentPoolAmount;                                 // 0x0(0x4)
	char                                                         State;                                             // 0x4(0x1)
	char                                                         pad0x3_7VDYB[0x3];                                 // 0x5(0x3)
};


// Size 0x1
struct EventGoldInContainerTaken
{
public:
	char                                                         pad0x1_O99GR[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct ShipAnnouncementPartDesc
{
public:
	struct StringAssetReference                                  Icon;                                              // 0x0(0x10)
	struct StringAssetReference                                  Alignment;                                         // 0x10(0x10)
	char                                                         AlignmentId;                                       // 0x20(0x1)
	char                                                         pad0x7_CL711[0x7];                                 // 0x21(0x7)
	struct FString                                               AudioCueKey;                                       // 0x28(0x10)
};


// Size 0x28
struct SocketCollisionEnterWaterEvent
{
public:
	char                                                         pad0x28_LEGFV[0x28];                               // 0x0(0x28)
};


// Size 0x10
struct EventShipTopDeckBlocked
{
public:
	struct Guid                                                  BlockerId;                                         // 0x0(0x10)
};


// Size 0x1
struct BootFlowSkadiAgeRatingStateEvent
{
public:
	char                                                         pad0x1_3ADP3[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct CustomScoreOnPlayerActionEvent
{
public:
	class Controller*                                            PlayerController;                                  // 0x0(0x8)
	char                                                         pad0x8_AEB0I[0x8];                                 // 0x8(0x8)
};


// Size 0x30
struct VaultStateData
{
public:
	char                                                         pad0x20_FVUTA[0x20];                               // 0x0(0x20)
	bool                                                         IsActive;                                          // 0x20(0x1)
	char                                                         pad0x3_ZZUIJ[0x3];                                 // 0x21(0x3)
	struct Vector                                                RewardPlinthPosition;                              // 0x24(0xc)
};


// Size 0x8
struct CanShowPrimaryActionButton
{
public:
	char                                                         pad0x4_DC9J9[0x4];                                 // 0x0(0x4)
	bool                                                         CanShow;                                           // 0x4(0x1)
	char                                                         pad0x3_3A87V[0x3];                                 // 0x5(0x3)
};


// Size 0x30
struct XPGrantedNetworkEvent
{
public:
	char                                                         pad0x24_G4Y7N[0x24];                               // 0x0(0x24)
	struct FName                                                 CompanyId;                                         // 0x24(0x8)
	char                                                         pad0x4_GS8TR[0x4];                                 // 0x2c(0x4)
};


// Size 0x40
struct CutscenePool
{
public:
	struct FName                                                 CutsceneName;                                      // 0x0(0x8)
	int                                                          Priority;                                          // 0x8(0x4)
	int                                                          ActivationChance;                                  // 0xc(0x4)
	bool                                                         ShouldQueue;                                       // 0x10(0x1)
	char                                                         pad0x3_MJSM5[0x3];                                 // 0x11(0x3)
	float                                                        AdditionalPoolCooldown;                            // 0x14(0x4)
	class CutscenePoolType*                                      PoolType;                                          // 0x18(0x8)
	TArray<class SceneDialogueData*>                             DialogueData;                                      // 0x20(0x10)
	TArray<float>                                                CutsceneLengths;                                   // 0x30(0x10)
};


// Size 0x120
struct EmoteActionStateConstructionInfo
{
public:
	char                                                         pad0x48_64STH[0x48];                               // 0x0(0x48)
	struct EmoteData                                             EmoteData;                                         // 0x48(0xc8)
	struct FName                                                 EmoteIdentifier;                                   // 0x110(0x8)
	bool                                                         ForcedEmote;                                       // 0x118(0x1)
	char                                                         pad0x7_E7FJB[0x7];                                 // 0x119(0x7)
};


// Size 0x28
struct ClientDeveloperTelemetryEvent
{
public:
	char                                                         pad0x28_N2TWZ[0x28];                               // 0x0(0x28)
};


// Size 0x1
struct EventMountedItemFullyInterpolatedToMountpoint
{
public:
	char                                                         pad0x1_R81DI[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct OnStartSlidingOnWalkwayEvent
{
public:
	class WwiseEvent*                                            WalkwaySlideLoopStart;                             // 0x0(0x8)
	class WwiseEvent*                                            WalkwayLoopEnd;                                    // 0x8(0x8)
};


// Size 0x20
struct ShipwreckDiscoveredRpc
{
public:
	char                                                         pad0x18_IBJQB[0x18];                               // 0x0(0x18)
	class Shipwreck*                                             Wreck;                                             // 0x18(0x8)
};


// Size 0x8
struct UseLadderUpdateHeightEvent
{
public:
	char                                                         pad0x8_6G40E[0x8];                                 // 0x0(0x8)
};


// Size 0x1
struct ErrorHappeningEvent
{
public:
	char                                                         pad0x1_94B0W[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct NarrationRequestEvent
{
public:
	struct FString                                               Text;                                              // 0x0(0x10)
};


// Size 0x38
struct UIQuestTableTileInteractionTelemetryEvent
{
public:
	struct FString                                               TileTitle;                                         // 0x0(0x10)
	struct FString                                               TileId;                                            // 0x10(0x10)
	int                                                          CurrentTilePage;                                   // 0x20(0x4)
	char                                                         pad0x4_55XLJ[0x4];                                 // 0x24(0x4)
	struct FString                                               SessionId;                                         // 0x28(0x10)
};


// Size 0x4
struct EventPlayerDrinkingConsumed
{
public:
	char                                                         pad0x4_XSGJL[0x4];                                 // 0x0(0x4)
};


// Size 0x10
struct NetPerformanceMonitorConnectionErrorTelemetryEvent
{
public:
	struct FString                                               ErrorMessage;                                      // 0x0(0x10)
};


// Size 0x1
struct StoreRedemptionStateFailedTelemetryEvent
{
public:
	char                                                         Status;                                            // 0x0(0x1)
};


// Size 0x1
struct EventMastGotPerfectWind
{
public:
	char                                                         pad0x1_1M326[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct FishIslehopperParams
{
public:
	char                                                         pad0x10_0MWRY[0x10];                               // 0x0(0x10)
};


// Size 0x18
struct DeepSeaRegionAmbienceAudio
{
public:
	class WwiseEvent*                                            PlayerInDeepSeaStart;                              // 0x0(0x8)
	class WwiseEvent*                                            PlayerInDeepSeaStop;                               // 0x8(0x8)
	bool                                                         OnlyPostMoodMusicEventsWhenSubmerged;              // 0x10(0x1)
	char                                                         pad0x7_TA68D[0x7];                                 // 0x11(0x7)
};


// Size 0x20
struct CanvasWorldMapForegroundItems
{
public:
	class Texture*                                               Texture;                                           // 0x0(0x8)
	struct FName                                                 FeatureToggle;                                     // 0x8(0x8)
	TArray<struct Vector2D>                                      Locations;                                         // 0x10(0x10)
};


// Size 0x10
struct CustomScoreObjectIdentifierList
{
public:
	char                                                         pad0x10_JOLNP[0x10];                               // 0x0(0x10)
};


// Size 0x20
struct PartCustomisation
{
public:
	struct FString                                               Category;                                          // 0x0(0x10)
	struct StringAssetReference                                  Customisation;                                     // 0x10(0x10)
};


// Size 0x1
struct PurchaseShopOfferSucceededEvent
{
public:
	char                                                         pad0x1_DA9V6[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventPlayerUndoRepairEnd
{
public:
	char                                                         pad0x8_HIRV0[0x8];                                 // 0x0(0x8)
};


// Size 0x10
struct EntitlementLoadFailedTelemetryEvent
{
public:
	struct FString                                               AssetName;                                         // 0x0(0x10)
};


// Size 0x1
struct FriendsListInvoked
{
public:
	char                                                         pad0x1_5WZZU[0x1];                                 // 0x0(0x1)
};


// Size 0x98
struct UseMountableSpotlightActionStateParams
{
public:
	char                                                         pad0x78_QII98[0x78];                               // 0x0(0x78)
	class ForceFeedbackEffect*                                   LightbeamFocusFeedbackEffect;                      // 0x78(0x8)
	class UClass*                                                FocusBeamCameraShake;                              // 0x80(0x8)
	class UClass*                                                FocusBeamInputId;                                  // 0x88(0x8)
	class CurveFloat*                                            SpotlightStateChangeCurve;                         // 0x90(0x8)
};


// Size 0x1
struct EventImpactVfxSpawned
{
public:
	char                                                         pad0x1_CGTKE[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct CarouselPirateDesc
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
	char                                                         Gender;                                            // 0x4(0x1)
	char                                                         Ethnicity;                                         // 0x5(0x1)
	char                                                         pad0x2_EQCPC[0x2];                                 // 0x6(0x2)
	float                                                        Age;                                               // 0x8(0x4)
	struct RadialCoordinate                                      BodyShape;                                         // 0xc(0x8)
	float                                                        Dirtiness;                                         // 0x14(0x4)
	float                                                        Wonkiness;                                         // 0x18(0x4)
	char                                                         pad0x4_909FZ[0x4];                                 // 0x1c(0x4)
	TArray<class Class*>                                         Outfit;                                            // 0x20(0x10)
};


// Size 0x1
struct EventLocalPlayerEnteredSittingState
{
public:
	bool                                                         SeatSupportsThirdPersonCamera;                     // 0x0(0x1)
};


// Size 0x10
struct CrewChangeFailedEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x10
struct PetChestRemovePetEvent
{
public:
	TArray<class Class*>                                         Removes;                                           // 0x0(0x10)
};


// Size 0x10
struct EventItemWielded
{
public:
	class WieldableItem*                                         WieldedItem;                                       // 0x0(0x8)
	class Actor*                                                 Wielder;                                           // 0x8(0x8)
};


// Size 0x18
struct InputSequencePair
{
public:
	class UClass*                                                InputID;                                           // 0x0(0x8)
	char                                                         Variant;                                           // 0x8(0x1)
	char                                                         pad0x7_F58ML[0x7];                                 // 0x9(0x7)
	class AnimMontage*                                           Sequence;                                          // 0x10(0x8)
};


// Size 0x20
struct GameEventExclusionZone
{
public:
	struct Vector2D                                              Location;                                          // 0x0(0x8)
	float                                                        Radius;                                            // 0x8(0x4)
	char                                                         pad0x4_CF4JT[0x4];                                 // 0xc(0x4)
	TArray<class Class*>                                         GameEventExceptions;                               // 0x10(0x10)
};


// Size 0x1
struct EventChangeMatchmakingVisibility
{
public:
	bool                                                         MatchmakingEnabled;                                // 0x0(0x1)
};


// Size 0x1c
struct ReapersChestItemInfoReplicatedData
{
public:
	struct Guid                                                  CurrentCrewId;                                     // 0x0(0x10)
	int                                                          InitialSpawnCharges;                               // 0x10(0x4)
	int                                                          RemainingSpawnCharges;                             // 0x14(0x4)
	char                                                         ChestState;                                        // 0x18(0x1)
	char                                                         pad0x3_BHH82[0x3];                                 // 0x19(0x3)
};


// Size 0x30
struct ReapersChestAIRegionData
{
public:
	struct FName                                                 RegionName;                                        // 0x0(0x8)
	class AIIncrementalWaveSpawner*                              ActiveCaptainSpawner;                              // 0x8(0x8)
	class AIIncrementalWaveSpawner*                              ActiveGruntSpawner;                                // 0x10(0x8)
	class Actor*                                                 Ship;                                              // 0x18(0x8)
	char                                                         pad0x10_V0JDM[0x10];                               // 0x20(0x10)
};


// Size 0x20
struct OwnedCrewCostumes
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	TArray<Class>                                                Costumes;                                          // 0x10(0x10)
};


// Size 0x28
struct EmergantVoyageQuestDesc
{
public:
	char                                                         pad0x28_5EKIP[0x28];                               // 0x0(0x28)
};


// Size 0x1
struct ScrambleShipNameSettingChanged
{
public:
	bool                                                         ShouldScrambleShipName;                            // 0x0(0x1)
};


// Size 0x1
struct LastPlayerArrivedInTunnelOfTheDamnedTelemetryEvent
{
public:
	char                                                         pad0x1_HY5FW[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct SpawnCommandsAISkillset
{
public:
	struct FName                                                 AIClassName;                                       // 0x0(0x8)
	TArray<class AthenaAIControllerParamsDataAsset*>             Skillsets;                                         // 0x8(0x10)
	class AthenaAIControllerParamsDataAsset*                     DefaultSkillset;                                   // 0x18(0x8)
};


// Size 0x8
struct EventCharacterDespawned
{
public:
	class Character*                                             Character;                                         // 0x0(0x8)
};


// Size 0x8
struct TaleVoteAdded
{
public:
	class Actor*                                                 Voter;                                             // 0x0(0x8)
};


// Size 0x80
struct PlayerBuriedItemsMapBundlePickedUpTelemetryEvent
{
public:
	struct Guid                                                  MapBundleId;                                       // 0x0(0x10)
	struct Guid                                                  OwningCrewID;                                      // 0x10(0x10)
	struct Guid                                                  PickedUpByPlayerId;                                // 0x20(0x10)
	struct Guid                                                  PickedUpByCrewId;                                  // 0x30(0x10)
	struct Guid                                                  OwningCrewSessionId;                               // 0x40(0x10)
	struct Guid                                                  PickedUpByCrewSessionId;                           // 0x50(0x10)
	TArray<struct Guid>                                          PlayerBuriedItemMapIds;                            // 0x60(0x10)
	TArray<struct Guid>                                          MapIdsOriginalOwners;                              // 0x70(0x10)
};


// Size 0x50
struct InteractionInputComponentTickFunction
{
public:
	char                                                         pad0x48_KT3Z4[0x48];                               // 0x0(0x48)
	class InteractionInputComponent*                             Target;                                            // 0x48(0x8)
};


// Size 0x18
struct EventPlayerEnteredShipwreckVicinity
{
public:
	class Controller*                                            PirateController;                                  // 0x0(0x8)
	char                                                         pad0x10_16KLN[0x10];                               // 0x8(0x10)
};


// Size 0x28
struct IslandTeleportLocation
{
public:
	struct FString                                               Description;                                       // 0x0(0x10)
	struct Vector                                                TeleportLocation;                                  // 0x10(0xc)
	float                                                        TeleportYaw;                                       // 0x1c(0x4)
	class UClass*                                                SeaId;                                             // 0x20(0x8)
};


// Size 0x1
struct UseSingleStickCameraToggleModeChangedEvent
{
public:
	char                                                         UseSingleStickCameraToggleMode;                    // 0x0(0x1)
};


// Size 0x68
struct CinematicCrewNetworkEvent
{
public:
	char                                                         pad0x18_CMFT0[0x18];                               // 0x0(0x18)
	TArray<class PlayerState*>                                   CrewMembersPlayerStates;                           // 0x18(0x10)
	struct FText                                                 Header;                                            // 0x28(0x38)
	struct FName                                                 Tag;                                               // 0x60(0x8)
};


// Size 0x1
struct EventRevealableHidden
{
public:
	char                                                         pad0x1_PALR7[0x1];                                 // 0x0(0x1)
};


// Size 0xc
struct AggressiveGhostShipsEncounterHeightPerIslandOffsets
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	float                                                        EventSignalHeightOffset;                           // 0x8(0x4)
};


// Size 0x8
struct EventShipDestroyed
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
};


// Size 0x20
struct ItemSpawnDataLocationInfo
{
public:
	TArray<String>                                               Items;                                             // 0x0(0x10)
	struct Vector                                                Location;                                          // 0x10(0xc)
	int                                                          NumItemsSpawned;                                   // 0x1c(0x4)
};


// Size 0x4
struct SetArenaIslandBanners
{
public:
	int                                                          Value;                                             // 0x0(0x4)
};


// Size 0x20
struct OnProjectileAttackGroupProjectileHitEvent
{
public:
	char                                                         pad0x20_7ZUZN[0x20];                               // 0x0(0x20)
};


// Size 0x10
struct RequestedLoopAnims
{
public:
	struct FName                                                 RequestedLoopingAnimName;                          // 0x0(0x8)
	int                                                          RequestedOutOfAnimIndex;                           // 0x8(0x4)
	int                                                          AnimationAssetRequired;                            // 0xc(0x4)
};


// Size 0x1
struct EventCharacterJumped
{
public:
	char                                                         pad0x1_022TP[0x1];                                 // 0x0(0x1)
};


// Size 0x1c
struct MovedByPortableHarpoonRetractionActionStateParams
{
public:
	char                                                         pad0x1c_WGWRK[0x1c];                               // 0x0(0x1c)
};


// Size 0x38
struct TeleportActionStateSerialisableData
{
public:
	char                                                         pad0x30_04M0V[0x30];                               // 0x0(0x30)
	bool                                                         IsTeleporting;                                     // 0x30(0x1)
	char                                                         pad0x7_6VOLW[0x7];                                 // 0x31(0x7)
};


// Size 0x30
struct QuestVariableItemSpawnDataTypeArray
{
public:
	char                                                         pad0x30_KQJ1W[0x30];                               // 0x0(0x30)
};


// Size 0x18
struct NPCOverlapException
{
public:
	struct StringAssetReference                                  MapName;                                           // 0x0(0x10)
	int                                                          MaxOverlapsAllowed;                                // 0x10(0x4)
	char                                                         pad0x4_11EFC[0x4];                                 // 0x14(0x4)
};


// Size 0x88
struct ItemReactionItemProxyActionRuleParams
{
public:
	float                                                        ItemReactionHoldTime;                              // 0x0(0x4)
	char                                                         pad0x4_ILV6B[0x4];                                 // 0x4(0x4)
	class UClass*                                                PressedNotificationInputId;                        // 0x8(0x8)
	class UClass*                                                ReleasedNotificationInputId;                       // 0x10(0x8)
	struct FText                                                 ItemReactionItemProxyText;                         // 0x18(0x38)
	struct FText                                                 ItemReactionIncorrectWieldableProxyText;           // 0x50(0x38)
};


// Size 0x8
struct FogBankManagerIslandTypesToKeepAwayFrom
{
public:
	char                                                         IslandType;                                        // 0x0(0x1)
	char                                                         pad0x3_GHRIF[0x3];                                 // 0x1(0x3)
	float                                                        MinimumDistanceFromIslandInKm;                     // 0x4(0x4)
};


// Size 0x10
struct StartPickupObjectActionRuleParams
{
public:
	TArray<char>                                                 WieldableItemSizesDisablePickup;                   // 0x0(0x10)
};


// Size 0x8
struct ChestLeaveWatercraftEvent
{
public:
	class Actor*                                                 CurrentWatercraft;                                 // 0x0(0x8)
};


// Size 0x1
struct MastReachedUprightPositionEvent
{
public:
	char                                                         pad0x1_3LAUN[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct TrapItemSocketedTelemetryEvent
{
public:
	struct Guid                                                  TrapId;                                            // 0x0(0x10)
	struct FString                                               SocketedItemClass;                                 // 0x10(0x10)
};


// Size 0x90
struct PirateProfiles_UpdatePirateProfilePreview
{
public:
	struct PirateDescription                                     PirateDescription;                                 // 0x0(0x80)
	TArray<class Class*>                                         ClothingLoadout;                                   // 0x80(0x10)
};


// Size 0x8
struct EventReceiveOpenableItemComponentState
{
public:
	class OpenableItemComponent*                                 Source;                                            // 0x0(0x8)
};


// Size 0x28
struct AthenaAnimationSkeletonSensingAnimations
{
public:
	class UClass*                                                UseWithObject;                                     // 0x0(0x8)
	class AnimSequence*                                          InitialReaction;                                   // 0x8(0x8)
	class BlendSpace1D*                                          Searching;                                         // 0x10(0x8)
	class AnimSequence*                                          AlertingOthers;                                    // 0x18(0x8)
	class BlendSpace1D*                                          Pursuit;                                           // 0x20(0x8)
};


// Size 0x1
struct ClientOutOfMemoryTelemetryEvent
{
public:
	char                                                         pad0x1_LIRWW[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct ChatModerationRequestPlayerIds
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct FString                                               PirateId;                                          // 0x10(0x10)
};


// Size 0x10
struct SendScrambledShipNamesToUIEvent
{
public:
	TArray<struct Text>                                          ScrambledShipNames;                                // 0x0(0x10)
};


// Size 0x10
struct GuildInvitesSentErrorEvent
{
public:
	struct FString                                               GuildId;                                           // 0x0(0x10)
};


// Size 0x30
struct PeriodicResponse
{
public:
	struct FloatRange                                            PeriodRange;                                       // 0x0(0x10)
	class Object*                                                Owner;                                             // 0x10(0x8)
	char                                                         pad0x18_XK2KH[0x18];                               // 0x18(0x18)
};


// Size 0x60
struct TreasureSpawnedTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	char                                                         BootyType;                                         // 0x10(0x1)
	char                                                         pad0x7_VTAXA[0x7];                                 // 0x11(0x7)
	struct FString                                               Rarity;                                            // 0x18(0x10)
	char                                                         Source;                                            // 0x28(0x1)
	char                                                         pad0x7_8TTCF[0x7];                                 // 0x29(0x7)
	struct FString                                               SourceId;                                          // 0x30(0x10)
	struct Vector                                                TreasureLocation;                                  // 0x40(0xc)
	char                                                         pad0x4_XB1W6[0x4];                                 // 0x4c(0x4)
	struct FString                                               ParentSpawnerClass;                                // 0x50(0x10)
};


// Size 0x1
struct RequestPremiumStoreFrontOpenEvent
{
public:
	char                                                         pad0x1_1E0WZ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct PirateProfiles_ShowShipSelectionPirateEvent
{
public:
	char                                                         pad0x1_8T072[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventAreaNowHasPlayers
{
public:
	struct FName                                                 AreaName;                                          // 0x0(0x8)
};


// Size 0x10
struct LobbyCreationRequestModel
{
public:
	struct FString                                               SessionName;                                       // 0x0(0x10)
};


// Size 0x10
struct ServerContestManagerServiceInitialisationCompleteEvent
{
public:
	char                                                         pad0x10_66629[0x10];                               // 0x0(0x10)
};


// Size 0x38
struct BlowpipeMimicBeginTelemetryEvent
{
public:
	struct FString                                               TargetClass;                                       // 0x0(0x10)
	struct FString                                               AiForm;                                            // 0x10(0x10)
	char                                                         MimicType;                                         // 0x20(0x1)
	bool                                                         IsChainMimic;                                      // 0x21(0x1)
	char                                                         pad0x2_M50N9[0x2];                                 // 0x22(0x2)
	struct Guid                                                  TargetGUID;                                        // 0x24(0x10)
	char                                                         AttitudeTowardTarget;                              // 0x34(0x1)
	char                                                         pad0x3_YDCNL[0x3];                                 // 0x35(0x3)
};


// Size 0x118
struct VoyageProposalDescViewModel
{
public:
	char                                                         pad0x100_HVNCQ[0x100];                             // 0x0(0x100)
	struct FString                                               ProposalDesc;                                      // 0x100(0x10)
	char                                                         State;                                             // 0x110(0x1)
	char                                                         pad0x3_QC165[0x3];                                 // 0x111(0x3)
	int                                                          VoyageIndex;                                       // 0x114(0x4)
};


// Size 0x8
struct RugsPartDesc
{
public:
	class MaterialInterface*                                     RugsMaterial;                                      // 0x0(0x8)
};


// Size 0x28
struct ServerMigrationCrewMigrationStatus
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	bool                                                         Migratable;                                        // 0x10(0x1)
	char                                                         pad0x7_HQMVY[0x7];                                 // 0x11(0x7)
	TArray<struct Vector2D>                                      Locations;                                         // 0x18(0x10)
};


// Size 0x48
struct MultipleNPCCompaniesRedirectionData
{
public:
	TArray<class Class*>                                         Companies;                                         // 0x0(0x10)
	struct FText                                                 VisitNPCTooltip;                                   // 0x10(0x38)
};


// Size 0x38
struct RepairObjectActionStateSerialisableData
{
public:
	char                                                         pad0x30_4GZXL[0x30];                               // 0x0(0x30)
	bool                                                         SuccessfulRepair;                                  // 0x30(0x1)
	char                                                         pad0x7_MKJ61[0x7];                                 // 0x31(0x7)
};


// Size 0x10
struct TunnelOfTheDamnedMigrationAboutToStart
{
public:
	char                                                         pad0x10_84H1N[0x10];                               // 0x0(0x10)
};


// Size 0x10
struct GetDisplayNamesRequestModel
{
public:
	TArray<String>                                               UserIds;                                           // 0x0(0x10)
};


// Size 0x28
struct SocketCollisionExitWaterEvent
{
public:
	char                                                         pad0x28_VBSUU[0x28];                               // 0x0(0x28)
};


// Size 0x1
struct EventApplicationSignOutRequest
{
public:
	char                                                         pad0x1_Z4185[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct SkySphereMaterialParams
{
public:
	class MaterialInstanceDynamic*                               DynamicMaterialInstance;                           // 0x0(0x8)
	int                                                          MaterialIndex;                                     // 0x8(0x4)
	struct FName                                                 StarSpinScalarParamName;                           // 0xc(0x8)
	char                                                         pad0x4_7OOP9[0x4];                                 // 0x14(0x4)
};


// Size 0x1
struct LoadingInteractionClientTelemetryEvent
{
public:
	char                                                         pad0x1_GRJF3[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct PlayerBuriedItemServiceMapBundlePlacedOnTableEvent
{
public:
	struct FString                                               PlayerName;                                        // 0x0(0x10)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x10(0x8)
};


// Size 0x18
struct ShipCameraAnimation
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	class CameraAnim*                                            Animation;                                         // 0x8(0x8)
	class CurveFloat*                                            BlendCurve;                                        // 0x10(0x8)
};


// Size 0x30
struct PlayerTalkingSettings
{
public:
	struct LinearColor                                           IconTint;                                          // 0x0(0x10)
	class Texture2D*                                             Icon;                                              // 0x10(0x8)
	float                                                        ScreenEdgePadding;                                 // 0x18(0x4)
	float                                                        Scale;                                             // 0x1c(0x4)
	float                                                        FadeInTimeInSeconds;                               // 0x20(0x4)
	char                                                         pad0xc_9MWUH[0xc];                                 // 0x24(0xc)
};


// Size 0x18
struct EventPlayerDockToObjectStart
{
public:
	char                                                         pad0x10_WJOSD[0x10];                               // 0x0(0x10)
	bool                                                         CanLookAtBeDisabledWhenDockedToObject;             // 0x10(0x1)
	char                                                         pad0x7_L1K2B[0x7];                                 // 0x11(0x7)
};


// Size 0x4
struct EventBackfillWeightingChange
{
public:
	char                                                         pad0x4_XBLT3[0x4];                                 // 0x0(0x4)
};


// Size 0x10
struct CargoRunQuestDescCollectCargoText
{
public:
	TArray<struct Text>                                          ItemText;                                          // 0x0(0x10)
};


// Size 0x80
struct OutOfAmmoDestructionEffects
{
public:
	float                                                        DestroyDelayDuration;                              // 0x0(0x4)
	float                                                        DestroyDuration;                                   // 0x4(0x4)
	float                                                        InterpTarget;                                      // 0x8(0x4)
	char                                                         pad0x4_B3AZQ[0x4];                                 // 0xc(0x4)
	class CurveFloat*                                            DestroyLerpCurve;                                  // 0x10(0x8)
	struct ScalarParameterValue                                  ScalarParameterValue;                              // 0x18(0x1c)
	char                                                         pad0x4_WT1P2[0x4];                                 // 0x34(0x4)
	class Object*                                                DestroyVfx;                                        // 0x38(0x8)
	struct FName                                                 VfxSocketName;                                     // 0x40(0x8)
	class WwiseEvent*                                            DestroyAudioEvent;                                 // 0x48(0x8)
	class WwiseObjectPoolWrapper*                                DestroyAudioPool;                                  // 0x50(0x8)
	struct WwiseEmitterCreationParams                            DestroySfxParams;                                  // 0x58(0x28)
};


// Size 0x10
struct EventObjectWielded
{
public:
	char                                                         pad0x10_PGHAF[0x10];                               // 0x0(0x10)
};


// Size 0x8
struct AllInteractionsCompletedEvent
{
public:
	class Actor*                                                 InteractingPlayer;                                 // 0x0(0x8)
};


// Size 0x78
struct Alliance
{
public:
	struct Guid                                                  AllianceId;                                        // 0x0(0x10)
	TArray<struct Guid>                                          Crews;                                             // 0x10(0x10)
	char                                                         AllianceIndex;                                     // 0x20(0x1)
	char                                                         pad0x57_94CSG[0x57];                               // 0x21(0x57)
};


// Size 0x8
struct SetVaultDoorStateGameServerRequestModel
{
public:
	int                                                          ActorId;                                           // 0x0(0x4)
	char                                                         DoorType;                                          // 0x4(0x1)
	char                                                         DoorState;                                         // 0x5(0x1)
	char                                                         pad0x2_8S7TG[0x2];                                 // 0x6(0x2)
};


// Size 0x18
struct ActiveCampaignInfo
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	char                                                         pad0x10_3CMCF[0x10];                               // 0x8(0x10)
};


// Size 0x38
struct TreasureFoundTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	struct Guid                                                  QuestId;                                           // 0x10(0x10)
	struct FString                                               Rarity;                                            // 0x20(0x10)
	bool                                                         IsBoobyTrapped;                                    // 0x30(0x1)
	char                                                         pad0x7_AKJE8[0x7];                                 // 0x31(0x7)
};


// Size 0x68
struct AthenaAnimationLocomotion
{
public:
	struct Vector                                                CharacterVelocity;                                 // 0x0(0xc)
	float                                                        WantedMovementSpeed;                               // 0xc(0x4)
	float                                                        HalfWantedMovementSpeed;                           // 0x10(0x4)
	bool                                                         CharacterMoving;                                   // 0x14(0x1)
	bool                                                         RunStopWanted;                                     // 0x15(0x1)
	char                                                         pad0x2_X5OH5[0x2];                                 // 0x16(0x2)
	float                                                        TurnRate;                                          // 0x18(0x4)
	float                                                        CurrentYaw;                                        // 0x1c(0x4)
	float                                                        CurrentDirection;                                  // 0x20(0x4)
	bool                                                         TurningActive;                                     // 0x24(0x1)
	bool                                                         TurningLeft;                                       // 0x25(0x1)
	bool                                                         IsSwimming;                                        // 0x26(0x1)
	bool                                                         IsUnderwaterSwimming;                              // 0x27(0x1)
	float                                                        BlendedTurnRate;                                   // 0x28(0x4)
	float                                                        MinimumMoveSpeedToTriggerRunStop;                  // 0x2c(0x4)
	float                                                        InterpSpeed;                                       // 0x30(0x4)
	float                                                        TurnRateToDisableTurns;                            // 0x34(0x4)
	float                                                        TurningAnimationExplicitTime;                      // 0x38(0x4)
	float                                                        FixedBlendedTurnRateForAI;                         // 0x3c(0x4)
	bool                                                         IsInAITurn;                                        // 0x40(0x1)
	char                                                         pad0x17_87L30[0x17];                               // 0x41(0x17)
	class AthenaAnimationInstance*                               CachedOwner;                                       // 0x58(0x8)
	char                                                         pad0x8_CIU8K[0x8];                                 // 0x60(0x8)
};


// Size 0x1
struct ArenaTutorialStartEvent
{
public:
	char                                                         pad0x1_SS2DT[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct MoveSpeedValidationFailedTelemetryEvent
{
public:
	struct FString                                               Item;                                              // 0x0(0x10)
	int                                                          SpeedId;                                           // 0x10(0x4)
	int                                                          DurationMS;                                        // 0x14(0x4)
	int                                                          IgnoredRequestCount;                               // 0x18(0x4)
	char                                                         pad0x4_PHZWA[0x4];                                 // 0x1c(0x4)
};


// Size 0x30
struct ClothingLoadout
{
public:
	TArray<class Class*>                                         Items;                                             // 0x0(0x10)
	TArray<class Class*>                                         CachedEmoteItems;                                  // 0x10(0x10)
	TArray<class Class*>                                         CachedWalkableEmoteItems;                          // 0x20(0x10)
};


// Size 0x10
struct EventPickupableObjectPickedUp
{
public:
	class PickupableObject*                                      PickupableObject;                                  // 0x0(0x8)
	class Actor*                                                 InteractingPlayer;                                 // 0x8(0x8)
};


// Size 0x1
struct OnRepIsCrossplayEnabledOnServerEvent
{
public:
	bool                                                         IsCrossplayEnabledOnServer;                        // 0x0(0x1)
};


// Size 0x8
struct WaterloggedShipStartedGoingUnderEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
};


// Size 0x20
struct PlayerNonVerbalComponentTelemetry
{
public:
	class AthenaPlayerController*                                PlayerController;                                  // 0x0(0x8)
	char                                                         pad0x18_3E033[0x18];                               // 0x8(0x18)
};


// Size 0x1
struct ReapersTributeShipEventStarted
{
public:
	char                                                         pad0x1_4UR2V[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct HideTutorialNotificationUIEvent
{
public:
	char                                                         pad0x1_QGTLF[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct PlayerItemUsageStartTelemetryEvent
{
public:
	char                                                         pad0x1_RDUVU[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct PirateProfiles_RenameSuccessEvent
{
public:
	struct FString                                               Name;                                              // 0x0(0x10)
};


// Size 0x10
struct PlayerReleasedFromBrig
{
public:
	struct FString                                               PlayerName;                                        // 0x0(0x10)
};


// Size 0x178
struct AthenaAnimationCapstan
{
public:
	float                                                        IntentInterpSpeed;                                 // 0x0(0x4)
	struct Vector2D                                              CapstanAngularVelocityRange;                       // 0x4(0x8)
	struct Vector2D                                              AnimationRemapSpeedRange;                          // 0xc(0x8)
	float                                                        AngularVelocityInterpSpeed;                        // 0x14(0x4)
	struct SocketId                                              LeftHandMaleSocket;                                // 0x18(0x20)
	struct SocketId                                              RightHandMaleSocket;                               // 0x38(0x20)
	struct SocketId                                              LeftHandFemaleSocket;                              // 0x58(0x20)
	struct SocketId                                              RightHandFemaleSocket;                             // 0x78(0x20)
	float                                                        TranslationStrength;                               // 0x98(0x4)
	float                                                        RotationStrength;                                  // 0x9c(0x4)
	float                                                        BlendInSpeed;                                      // 0xa0(0x4)
	float                                                        BlendOutSpeed;                                     // 0xa4(0x4)
	bool                                                         AnimationOverride;                                 // 0xa8(0x1)
	char                                                         CapstanState;                                      // 0xa9(0x1)
	char                                                         pad0x2_P0SAE[0x2];                                 // 0xaa(0x2)
	float                                                        AngularVelocityWanted;                             // 0xac(0x4)
	class Actor*                                                 ControlledObject;                                  // 0xb0(0x8)
	char                                                         pad0xc0_FF6L2[0xc0];                               // 0xb8(0xc0)
};


// Size 0x18
struct QuestStartXMarksTheSpotTelemetryEvent
{
public:
	struct FString                                               IslandName;                                        // 0x0(0x10)
	int                                                          NumTreasures;                                      // 0x10(0x4)
	char                                                         pad0x4_KEL50[0x4];                                 // 0x14(0x4)
};


// Size 0xc
struct WorldMapSetShipLocation
{
public:
	float                                                        ShipX;                                             // 0x0(0x4)
	float                                                        ShipY;                                             // 0x4(0x4)
	float                                                        Rotation;                                          // 0x8(0x4)
};


// Size 0x1
struct PirateProfilesCancelRerollCreateRequestToUI
{
public:
	char                                                         pad0x1_IEN10[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct VoyageToRegister
{
public:
	char                                                         pad0x28_C93K0[0x28];                               // 0x0(0x28)
};


// Size 0x80
struct AIShipEncounterNotification
{
public:
	struct FText                                                 BattleName;                                        // 0x0(0x38)
	struct FName                                                 SeaName;                                           // 0x38(0x8)
	struct FText                                                 SkellyCrewName;                                    // 0x40(0x38)
	char                                                         CannonBallType;                                    // 0x78(0x1)
	char                                                         SkellyType;                                        // 0x79(0x1)
	char                                                         pad0x6_CNKOK[0x6];                                 // 0x7a(0x6)
};


// Size 0x10
struct AIRowboatEncounterParamsSpawnerData
{
public:
	class AISpawner*                                             Spawner;                                           // 0x0(0x8)
	struct FName                                                 SpawnType;                                         // 0x8(0x8)
};


// Size 0x10
struct EventPlayerNameOverrideAssigned
{
public:
	struct FString                                               PlayerNameOverride;                                // 0x0(0x10)
};


// Size 0x10
struct ScoreboardCommandResetTeamScoreEvent
{
public:
	char                                                         pad0x10_0KUBT[0x10];                               // 0x0(0x10)
};


// Size 0x18
struct CreateBoxTriggerGameServerRequestModel
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	struct Vector                                                Extent;                                            // 0xc(0xc)
};


// Size 0x18
struct BuzzSignature
{
public:
	struct FString                                               Token;                                             // 0x0(0x10)
	struct DateTime                                              ExpiresAt;                                         // 0x10(0x8)
};


// Size 0x18
struct ShipSizeToMaxNumPawnsPerShipRegionPerChest
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	struct FString                                               MaxNumPawnsPerChestDedicatedServerConfigKey;       // 0x8(0x10)
};


// Size 0x1
struct EventHUDScriptingReady
{
public:
	char                                                         pad0x1_RR8IH[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventItemConsumed
{
public:
	class Actor*                                                 Consumer;                                          // 0x0(0x8)
};


// Size 0x1
struct PirateProfiles_RenameErrorEvent
{
public:
	char                                                         pad0x1_NZUUU[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventAnimationWieldedItemContinuousUseStateEntered
{
public:
	char                                                         pad0x1_EHIEO[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct CrewSpawnedAtNamedLocationTelemetryEvent
{
public:
	struct FString                                               LocationName;                                      // 0x0(0x10)
	struct Vector                                                Location;                                          // 0x10(0xc)
	char                                                         pad0x4_ZUN2T[0x4];                                 // 0x1c(0x4)
};


// Size 0x1
struct EmergantVoyageQuestParams
{
public:
	char                                                         pad0x1_12X61[0x1];                                 // 0x0(0x1)
};


// Size 0x70
struct MeshAnimatorInstance
{
public:
	char                                                         pad0x60_BE5HR[0x60];                               // 0x0(0x60)
	TArray<class MeshComponent*>                                 Meshes;                                            // 0x60(0x10)
};


// Size 0x30
struct QuestVariableAsset
{
public:
	char                                                         pad0x30_0Z60I[0x30];                               // 0x0(0x30)
};


// Size 0x10
struct ClientMarkerRepresentation
{
public:
	class BaseWorldMarker*                                       MarkerPtr;                                         // 0x0(0x8)
	class Object*                                                MarkerVisualObjectPtr;                             // 0x8(0x8)
};


// Size 0x30
struct TransitionLadderActionStateParams
{
public:
	char                                                         pad0x30_XFO10[0x30];                               // 0x0(0x30)
};


// Size 0x10
struct InvalidFireRequestDetected
{
public:
	class Object*                                                RequestingObject;                                  // 0x0(0x8)
	char                                                         pad0x8_MIMFF[0x8];                                 // 0x8(0x8)
};


// Size 0x30
struct CloudTypeDefinition
{
public:
	class StaticMesh*                                            CloudMesh;                                         // 0x0(0x8)
	class StaticMesh*                                            CloudFluffyMesh;                                   // 0x8(0x8)
	struct Vector2D                                              ScaleRange;                                        // 0x10(0x8)
	struct Vector2D                                              StorminessRange;                                   // 0x18(0x8)
	float                                                        ProbabilityWeight;                                 // 0x20(0x4)
	float                                                        OverlapTolerance;                                  // 0x24(0x4)
	bool                                                         IsStreetCloud;                                     // 0x28(0x1)
	bool                                                         CastsShadow;                                       // 0x29(0x1)
	char                                                         pad0x6_EGYAD[0x6];                                 // 0x2a(0x6)
};


// Size 0x40
struct BuoyancyHelperParams
{
public:
	char                                                         pad0x8_028RL[0x8];                                 // 0x0(0x8)
	class Actor*                                                 BuoyancyComponentOwner;                            // 0x8(0x8)
	class ShapeComponent*                                        BuoyancyBaseComponent;                             // 0x10(0x8)
	char                                                         pad0x28_BK3UK[0x28];                               // 0x18(0x28)
};


// Size 0x28
struct PlayerItemAddToContainerTelemetryEvent
{
public:
	struct FString                                               ContainerId;                                       // 0x0(0x10)
	struct FString                                               ItemType;                                          // 0x10(0x10)
	int                                                          NumberOfItemsInContainer;                          // 0x20(0x4)
	char                                                         pad0x4_XLTB2[0x4];                                 // 0x24(0x4)
};


// Size 0x20
struct LightingZoneParameters
{
public:
	int                                                          PriorityLayer;                                     // 0x0(0x4)
	int                                                          TargetLightingIndex;                               // 0x4(0x4)
	float                                                        OuterRadius;                                       // 0x8(0x4)
	float                                                        InnerRadius;                                       // 0xc(0x4)
	float                                                        Weight;                                            // 0x10(0x4)
	bool                                                         IsUnderwaterZone;                                  // 0x14(0x1)
	bool                                                         Is3DLightingZone;                                  // 0x15(0x1)
	char                                                         pad0x2_T1NSF[0x2];                                 // 0x16(0x2)
	float                                                        OuterCylinderHalfHeight;                           // 0x18(0x4)
	float                                                        InnerCylinderHalfHeight;                           // 0x1c(0x4)
};


// Size 0x1
struct RequestWalletBalanceUpdateHUDEvent
{
public:
	char                                                         pad0x1_OYUZF[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventInGameUISetMigrationMode
{
public:
	bool                                                         MigrationModeEnabled;                              // 0x0(0x1)
};


// Size 0x1
struct EventLoadableObjectUnloaded
{
public:
	char                                                         pad0x1_2QXOS[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct PressurePlateAnimationComponent
{
public:
	class SceneComponent*                                        Component;                                         // 0x0(0x8)
	class TransformBlendCurveComponent*                          Curve;                                             // 0x8(0x8)
};


// Size 0x20
struct DestroyingUnsafeWreckEvent
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	struct Guid                                                  CrewId;                                            // 0xc(0x10)
	bool                                                         IsCustomWreck;                                     // 0x1c(0x1)
	char                                                         pad0x3_7KJM5[0x3];                                 // 0x1d(0x3)
};


// Size 0x1
struct PrepareTavernForContestMigration
{
public:
	char                                                         pad0x1_SXEIS[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct InvalidDependencyRootPackageEncounteredTelemetryEvent
{
public:
	struct FString                                               DependencyRootPackageName;                         // 0x0(0x10)
	struct FString                                               ImportPackageName;                                 // 0x10(0x10)
};


// Size 0x30
struct QuestVariableActor
{
public:
	char                                                         pad0x30_WRGVN[0x30];                               // 0x0(0x30)
};


// Size 0x2
struct QuestTableExperiencesRequestModel
{
public:
	char                                                         PlayModeVariant;                                   // 0x0(0x1)
	char                                                         ImageResolution;                                   // 0x1(0x1)
};


// Size 0x10
struct FakedBuoyancyParams
{
public:
	float                                                        PitchSpeed;                                        // 0x0(0x4)
	float                                                        MaxPitch;                                          // 0x4(0x4)
	float                                                        RollSpeed;                                         // 0x8(0x4)
	float                                                        MaxRoll;                                           // 0xc(0x4)
};


// Size 0x30
struct IsTankardEquippedCondition
{
public:
	char                                                         pad0x28_N84RU[0x28];                               // 0x0(0x28)
	bool                                                         RequireSpecificLiquidType;                         // 0x28(0x1)
	bool                                                         RequireSpecificMinimumVolume;                      // 0x29(0x1)
	char                                                         RequiredLiquidType;                                // 0x2a(0x1)
	char                                                         pad0x1_PWZYS[0x1];                                 // 0x2b(0x1)
	float                                                        RequiredMinimumVolume;                             // 0x2c(0x4)
};


// Size 0x50
struct ContestZoneVendorShipData
{
public:
	char                                                         pad0x20_0WMUP[0x20];                               // 0x0(0x20)
	struct Transform                                             ContestZoneWorldLocation;                          // 0x20(0x30)
};


// Size 0x1
struct PiratePreviewShutdownEvent
{
public:
	char                                                         pad0x1_9NGV5[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct AddMapToContainerRPC
{
public:
	char                                                         pad0x18_9K911[0x18];                               // 0x0(0x18)
	struct NetSubObjectPtr                                       Container;                                         // 0x18(0x14)
	struct Guid                                                  MapToAddToContainer;                               // 0x2c(0x10)
	char                                                         pad0x4_LGLW3[0x4];                                 // 0x3c(0x4)
};


// Size 0x1
struct PlayerClientHttpRequestTelemetryEvent
{
public:
	char                                                         pad0x1_JG4PR[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct NewVoyagesAvailablePerCompanyPopupMessage
{
public:
	struct FName                                                 ComapnyName;                                       // 0x0(0x8)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x8(0x8)
};


// Size 0x8
struct EventReceiveTankardRefillerComponentState
{
public:
	class TankardRefillerComponent*                              Source;                                            // 0x0(0x8)
};


// Size 0x28
struct AthenaAnimationHarpoonLauncherAnimData
{
public:
	TArray<class BlendSpace1D*>                                  Idle;                                              // 0x0(0x10)
	class BlendSpace1D*                                          FireInto;                                          // 0x10(0x8)
	class BlendSpace1D*                                          FireOutOf;                                         // 0x18(0x8)
	class BlendSpace1D*                                          FireAction;                                        // 0x20(0x8)
};


// Size 0x10
struct TrapSocketedItemExplodedEvent
{
public:
	class Actor*                                                 Instigator;                                        // 0x0(0x8)
	class Actor*                                                 IgnoreActor;                                       // 0x8(0x8)
};


// Size 0x1
struct PirateRerollEvent_HideRequestRerollModal
{
public:
	char                                                         pad0x1_J7AEB[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventAnimationWieldedItemIntoContinuousUseFinished
{
public:
	char                                                         pad0x1_WSGQH[0x1];                                 // 0x0(0x1)
};


// Size 0x60
struct DiscoveryNotificationEvent
{
public:
	int                                                          Count;                                             // 0x0(0x4)
	char                                                         pad0x4_DMC4Y[0x4];                                 // 0x4(0x4)
	TArray<String>                                               Images;                                            // 0x8(0x10)
	struct FString                                               Background;                                        // 0x18(0x10)
	struct FText                                                 Text;                                              // 0x28(0x38)
};


// Size 0x10
struct ShipSurfacingStateUpdateTelemetryEvent
{
public:
	struct FString                                               ShipSurfacingState;                                // 0x0(0x10)
};


// Size 0x1
struct EventReputationDisplayInformationRequest
{
public:
	char                                                         pad0x1_KPWUV[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct BaseTelemetryFragment
{
public:
	struct FString                                               DateLogged;                                        // 0x0(0x10)
	struct FString                                               Sandbox;                                           // 0x10(0x10)
	struct FString                                               FeatureConfigHash;                                 // 0x20(0x10)
	struct FString                                               StampId;                                           // 0x30(0x10)
	float                                                        LifeTime;                                          // 0x40(0x4)
	char                                                         pad0x4_ZWUY4[0x4];                                 // 0x44(0x4)
};


// Size 0x38
struct MeshMemoryConstraintRegistrationFailedTelemetryEvent
{
public:
	char                                                         pad0x38_180SU[0x38];                               // 0x0(0x38)
};


// Size 0x48
struct CaptainsLogbookAccoladeLocalisedTextDefinition
{
public:
	struct FString                                               ServiceGuid;                                       // 0x0(0x10)
	struct FText                                                 LocalisedText;                                     // 0x10(0x38)
};


// Size 0x1
struct EventAISkeletalShipCaptainAnimState
{
public:
	char                                                         ActiveAnimationState;                              // 0x0(0x1)
};


// Size 0x38
struct ShipPartChangedEvent
{
public:
	char                                                         pad0x18_D5S8R[0x18];                               // 0x0(0x18)
	struct FString                                               PartId;                                            // 0x18(0x10)
	struct FString                                               EntitlementId;                                     // 0x28(0x10)
};


// Size 0x18
struct EntitlementMapEntry
{
public:
	struct FName                                                 Identifier;                                        // 0x0(0x8)
	struct StringClassReference                                  EntitlementDesc;                                   // 0x8(0x10)
};


// Size 0x18
struct AggressiveGhostShipSplineDataOffsets
{
public:
	float                                                        FormationForwardOffsetInMetres;                    // 0x0(0x4)
	float                                                        FormationForwardOffsetVarianceInMetres;            // 0x4(0x4)
	float                                                        FormationForwardOffsetVarianceSpeed;               // 0x8(0x4)
	float                                                        FormationSidewaysOffsetInMetres;                   // 0xc(0x4)
	float                                                        FormationSidewaysOffsetVarianceInMetres;           // 0x10(0x4)
	float                                                        FormationSidewaysOffsetVarianceSpeed;              // 0x14(0x4)
};


// Size 0x38
struct PS5IncorrectAchievementsRemovedTelemetry
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct FString                                               PirateId;                                          // 0x10(0x10)
	struct FString                                               PsnId;                                             // 0x20(0x10)
	bool                                                         Success;                                           // 0x30(0x1)
	char                                                         pad0x3_36IA0[0x3];                                 // 0x31(0x3)
	int                                                          AchievementsRemovedCount;                          // 0x34(0x4)
};


// Size 0x20
struct CatalogTab
{
public:
	struct FString                                               CatalogName;                                       // 0x0(0x10)
	struct FString                                               CatalogTabImageUrl;                                // 0x10(0x10)
};


// Size 0x8
struct ActionStateHistoryTelemetryFragmentInput
{
public:
	char                                                         pad0x8_9R2TG[0x8];                                 // 0x0(0x8)
};


// Size 0x4
struct GameNarrationOverrideStateChangeEvent
{
public:
	int                                                          Status;                                            // 0x0(0x4)
};


// Size 0x18
struct SceneDialogueBaseNetworkEvent
{
public:
	char                                                         pad0x18_7QY63[0x18];                               // 0x0(0x18)
};


// Size 0x10
struct CatagoriesDataRequestUIEvent
{
public:
	struct FString                                               CatalogName;                                       // 0x0(0x10)
};


// Size 0x10
struct ClientNPCDialogOptionUsedTelemetryEvent
{
public:
	struct FString                                               DialogOptionName;                                  // 0x0(0x10)
};


// Size 0x20
struct CanvasWorldMapBackgroundItems
{
public:
	class Texture*                                               Texture;                                           // 0x0(0x8)
	struct Vector2D                                              WorldSize;                                         // 0x8(0x8)
	TArray<struct Vector2D>                                      Locations;                                         // 0x10(0x10)
};


// Size 0x10
struct FogBankManagerFogAvoidanceArea
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
};


// Size 0x38
struct AudioSetupTelemetryFragment
{
public:
	bool                                                         HeadphoneModeEnabled;                              // 0x0(0x1)
	bool                                                         SpatialAudioEnabled;                               // 0x1(0x1)
	char                                                         pad0x2_I02RD[0x2];                                 // 0x2(0x2)
	int                                                          AudioOutputFormat;                                 // 0x4(0x4)
	int                                                          SpatialAudioMode;                                  // 0x8(0x4)
	char                                                         pad0x4_2FW1C[0x4];                                 // 0xc(0x4)
	struct FString                                               ImmerseUserState;                                  // 0x10(0x10)
	int                                                          ImmerseHeadsetId;                                  // 0x20(0x4)
	char                                                         pad0x4_SU8SU[0x4];                                 // 0x24(0x4)
	struct FString                                               ImmerseUserId;                                     // 0x28(0x10)
};


// Size 0x20
struct MerchantCrateAllocatedTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	struct FString                                               Rarity;                                            // 0x10(0x10)
};


// Size 0x1
struct NetPerformanceMonitorHeartbeat
{
public:
	char                                                         pad0x1_61604[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct WreckMatch
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	char                                                         pad0x4_AH6TG[0x4];                                 // 0xc(0x4)
	float                                                        DistanceData;                                      // 0x30(0x4)
	struct Guid                                                  OwningCrewID;                                      // 0x34(0x10)
	char                                                         pad0x4_BZKV3[0x4];                                 // 0x44(0x4)
};


// Size 0x8
struct SwallowedByKrakenActionStateParams
{
public:
	float                                                        FadeToBlackDuration;                               // 0x0(0x4)
	float                                                        DeathDelayTime;                                    // 0x4(0x4)
};


// Size 0x60
struct RemoveWorldEventGameServerRequestModel
{
public:
	struct FString                                               EventType;                                         // 0x0(0x10)
	char                                                         pad0x50_7C2UQ[0x50];                               // 0x10(0x50)
};


// Size 0x8
struct EventCurseSpawnAIOnShip
{
public:
	class AIFixedWavesSpawner*                                   AISpawner;                                         // 0x0(0x8)
};


// Size 0x1
struct EventNPCServiceRegistered
{
public:
	char                                                         pad0x1_G53QA[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct ScoreGrantedNotificationUIEvent
{
public:
	char                                                         ScoreId;                                           // 0x0(0x1)
	char                                                         pad0x7_QOL3E[0x7];                                 // 0x1(0x7)
	struct FString                                               DisplayAmount;                                     // 0x8(0x10)
	int                                                          Amount;                                            // 0x18(0x4)
	char                                                         pad0x4_JXZOP[0x4];                                 // 0x1c(0x4)
	struct FString                                               ScoringIconPath;                                   // 0x20(0x10)
};


// Size 0x1
struct EventToggleOtherCrewNameplates
{
public:
	char                                                         pad0x1_YH1GM[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventWheelDamageLevelChanged
{
public:
	class Actor*                                                 Wheel;                                             // 0x0(0x8)
	int                                                          DamageLevel;                                       // 0x8(0x4)
	char                                                         pad0x4_EVPVR[0x4];                                 // 0xc(0x4)
};


// Size 0x18
struct EmblemDefinitionActiveDuration
{
public:
	bool                                                         HasActiveDuration;                                 // 0x0(0x1)
	char                                                         pad0x7_DN1CC[0x7];                                 // 0x1(0x7)
	struct DateTime                                              ActiveFrom;                                        // 0x8(0x8)
	struct DateTime                                              ActiveUntil;                                       // 0x10(0x8)
};


// Size 0x10
struct CrewFinishedBeingAttackedByGameEventEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0xc0
struct RPCTelemetryFragment
{
public:
	struct RPCStats                                              RPCStats;                                          // 0x0(0xc0)
};


// Size 0x8
struct DartProxyRemovedEvent
{
public:
	class ItemProxy*                                             Proxy;                                             // 0x0(0x8)
};


// Size 0x8
struct PurchaseConfigurationSettings
{
public:
	float                                                        BackOffTimeInSeconds;                              // 0x0(0x4)
	float                                                        BackOffTimeGain;                                   // 0x4(0x4)
};


// Size 0x18
struct MerchantQuestStartTelemetryEventRequiredItemEntry
{
public:
	int                                                          NumItems;                                          // 0x0(0x4)
	char                                                         pad0x4_45EWL[0x4];                                 // 0x4(0x4)
	struct FString                                               Rarity;                                            // 0x8(0x10)
};


// Size 0x40
struct ScrambledNamesUpdateEvent
{
public:
	struct Guid                                                  EntityId;                                          // 0x0(0x10)
	struct FString                                               UnscrambledName;                                   // 0x10(0x10)
	struct UniqueNetIdRepl                                       EntityOwnerNetId;                                  // 0x20(0x18)
	char                                                         ScrambleType;                                      // 0x38(0x1)
	char                                                         pad0x7_2K19B[0x7];                                 // 0x39(0x7)
};


// Size 0x18
struct AmbientWrecksInsRangeRemovedTelemetryEvent
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        Range;                                             // 0xc(0x4)
	int                                                          NumWrecksWithinRange;                              // 0x10(0x4)
	int                                                          NumWrecksEvicted;                                  // 0x14(0x4)
};


// Size 0x1
struct EventPlayerCureAllAilments
{
public:
	char                                                         pad0x1_Y97XC[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct ChainLightningParameters
{
public:
	float                                                        ChainLightningOverlapRadius;                       // 0x0(0x4)
	float                                                        InitialSelectionRadiusSquared;                     // 0x4(0x4)
	int                                                          InitialNumberOfNodesSelected;                      // 0x8(0x4)
	float                                                        MaxDistanceBetweenChainsSquared;                   // 0xc(0x4)
	int                                                          MaxNumberOfLinks;                                  // 0x10(0x4)
	bool                                                         OverrideMaxFramesBeforeReplication;                // 0x14(0x1)
	char                                                         pad0x3_BRZK5[0x3];                                 // 0x15(0x3)
	int                                                          MaxFramesBeforeReplicationOverride;                // 0x18(0x4)
	float                                                        ChainVisualActorLifetime;                          // 0x1c(0x4)
};


// Size 0x18
struct ShipwreckSiteRotation
{
public:
	struct Rotator                                               Base;                                              // 0x0(0xc)
	struct Rotator                                               MaxVariance;                                       // 0xc(0xc)
};


// Size 0x1
struct EventAnimationWieldedItemStateChanged
{
public:
	char                                                         pad0x1_PWH9E[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct SwimmingCreatureImpactAnimData
{
public:
	class AnimSequenceBase*                                      ImpactAnim;                                        // 0x0(0x8)
	float                                                        MinDamageRange;                                    // 0x8(0x4)
	float                                                        MaxDamageRange;                                    // 0xc(0x4)
};


// Size 0x10
struct GetLinkedPSNIdFromXuidRequestModel
{
public:
	TArray<String>                                               XUIDs;                                             // 0x0(0x10)
};


// Size 0x18
struct AggressiveGhostShipFixedSpline
{
public:
	float                                                        StartAngleOffset;                                  // 0x0(0x4)
	char                                                         pad0x4_EI4LO[0x4];                                 // 0x4(0x4)
	TArray<float>                                                Offsets;                                           // 0x8(0x10)
};


// Size 0x8
struct EventPlayerWaitingToSpawnComplete
{
public:
	class AthenaPlayerState*                                     PlayerState;                                       // 0x0(0x8)
};


// Size 0x8
struct EventPlayerRemoveSpearCompleted
{
public:
	char                                                         pad0x8_ODC6H[0x8];                                 // 0x0(0x8)
};


// Size 0x20
struct AchievementHaveADrinkWithAnotherCrewAtAnOutpost
{
public:
	class AthenaPlayerCharacter*                                 Character;                                         // 0x0(0x8)
	char                                                         pad0x10_P34AX[0x10];                               // 0x8(0x10)
	float                                                        RangeOfCheckInMetres;                              // 0x18(0x4)
	float                                                        DrinkConsumedVolumeThreshold;                      // 0x1c(0x4)
};


// Size 0x8
struct EventPlayerCharacterExitedShip
{
public:
	class Actor*                                                 PlayerCharacter;                                   // 0x0(0x8)
};


// Size 0x60
struct SessionSwitches
{
public:
	struct FString                                               SwitchPresetName;                                  // 0x0(0x10)
	char                                                         pad0x50_S7PE1[0x50];                               // 0x10(0x50)
};


// Size 0x1
struct EventToggleNonCrewVoiceMuteState
{
public:
	char                                                         pad0x1_GWWN8[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct SpawnTransformToPositionMapping
{
public:
	struct Transform                                             SpawnTransform;                                    // 0x0(0x30)
	char                                                         Position;                                          // 0x30(0x1)
	char                                                         pad0xf_2B8AE[0xf];                                 // 0x31(0xf)
};


// Size 0x1
struct PlayerGamepadTypeTelemetryEvent
{
public:
	char                                                         GamepadType;                                       // 0x0(0x1)
};


// Size 0x1
struct SwitchDartEvent
{
public:
	bool                                                         HasAutoSwitchDisabled;                             // 0x0(0x1)
};


// Size 0x40
struct TreasureMapDataCaptureParams
{
public:
	struct Vector                                                CameraPosition;                                    // 0x0(0xc)
	struct Rotator                                               CameraOrientation;                                 // 0xc(0xc)
	struct Vector                                                WorldSpaceCameraPosition;                          // 0x18(0xc)
	float                                                        CameraFOV;                                         // 0x24(0x4)
	float                                                        CameraAspect;                                      // 0x28(0x4)
	float                                                        CameraOrthoWidth;                                  // 0x2c(0x4)
	float                                                        CameraNearClip;                                    // 0x30(0x4)
	float                                                        CameraFarClip;                                     // 0x34(0x4)
	int                                                          TextureWidth;                                      // 0x38(0x4)
	int                                                          TextureHeight;                                     // 0x3c(0x4)
};


// Size 0x10
struct BootyItemSellPrerequisites
{
public:
	TArray<class Class*>                                         Entitlements;                                      // 0x0(0x10)
};


// Size 0x1
struct QuestTableOpenEvent
{
public:
	char                                                         pad0x1_B271A[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct MoltenSandsActivatedEvent
{
public:
	char                                                         pad0x1_WKKNE[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct InteractionCompletedWithFailedConditionEvent
{
public:
	class Actor*                                                 InteractingPlayer;                                 // 0x0(0x8)
};


// Size 0x10
struct EventMovedByPortableHarpoonRetractionEnd
{
public:
	class Actor*                                                 MovedActor;                                        // 0x0(0x8)
	class Actor*                                                 MovementInstigator;                                // 0x8(0x8)
};


// Size 0x88
struct ServerSpatialNetClusteringTelemetryFragment
{
public:
	struct NetworkSpatialNetClusteringTelemetry                  Data;                                              // 0x0(0x88)
};


// Size 0x40
struct TeleportLocation
{
public:
	bool                                                         Valid;                                             // 0x0(0x1)
	char                                                         pad0x3_M3ZAW[0x3];                                 // 0x1(0x3)
	struct FName                                                 Description;                                       // 0x4(0x8)
	char                                                         pad0x4_X11KX[0x4];                                 // 0xc(0x4)
	TArray<struct Name>                                          TeleportLocationTags;                              // 0x10(0x10)
	class SceneComponent*                                        TeleportBase;                                      // 0x20(0x8)
	struct Vector                                                TeleportLocation;                                  // 0x28(0xc)
	struct Rotator                                               TeleportRotation;                                  // 0x34(0xc)
};


// Size 0x30
struct CrewScoreAppendedEvent
{
public:
	char                                                         ScoreId;                                           // 0x0(0x1)
	char                                                         pad0x3_8VZNH[0x3];                                 // 0x1(0x3)
	struct Guid                                                  CrewId;                                            // 0x4(0x10)
	int                                                          CrewScore;                                         // 0x14(0x4)
	char                                                         ScoreReason;                                       // 0x18(0x1)
	char                                                         pad0x7_PHK7L[0x7];                                 // 0x19(0x7)
	struct StringAssetReference                                  ScoringIconAssetReference;                         // 0x20(0x10)
};


// Size 0x8
struct RenderToTextureTestChangeEvent
{
public:
	class Actor*                                                 Object;                                            // 0x0(0x8)
};


// Size 0x10
struct ItemReplenisherItem
{
public:
	char                                                         pad0x10_U7075[0x10];                               // 0x0(0x10)
};


// Size 0x48
struct VoyageCancelled
{
public:
	struct FText                                                 Title;                                             // 0x0(0x38)
	struct FString                                               VoyageProposalName;                                // 0x38(0x10)
};


// Size 0x1
struct ForceCloseMultiShopEvent
{
public:
	char                                                         pad0x1_YCJUB[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct FeatureConfigTelemetryEvent
{
public:
	struct FString                                               FeatureConfigHash;                                 // 0x0(0x10)
	struct JsonObjectWrapper                                     Json;                                              // 0x10(0x18)
};


// Size 0x50
struct HitRegTrailData
{
public:
	TArray<struct Vector>                                        Trail;                                             // 0x0(0x10)
	float                                                        DistanceBeforeGravity;                             // 0x10(0x4)
	bool                                                         GravityActivated;                                  // 0x14(0x1)
	bool                                                         HitSomething;                                      // 0x15(0x1)
	char                                                         pad0x2_3R1ZS[0x2];                                 // 0x16(0x2)
	struct Vector                                                GravityStartPoint;                                 // 0x18(0xc)
	struct Vector                                                ImpactPoint;                                       // 0x24(0xc)
	class PrimitiveComponent*                                    ImpactedComponent;                                 // 0x30(0x8)
	struct FString                                               ImpactedActorName;                                 // 0x38(0x10)
	int                                                          ImpactedActorNetId;                                // 0x48(0x4)
	char                                                         pad0x4_NB1GJ[0x4];                                 // 0x4c(0x4)
};


// Size 0x78
struct EventPlayerPirateIdentityDeemedInactive
{
public:
	char                                                         pad0x78_JWJX5[0x78];                               // 0x0(0x78)
};


// Size 0x28
struct AppearMaterialParams
{
public:
	struct FName                                                 ParameterName;                                     // 0x0(0x8)
	class CurveFloat*                                            AppearCurveAsset;                                  // 0x8(0x8)
	class CurveFloat*                                            DisppearCurveAsset;                                // 0x10(0x8)
	char                                                         pad0x10_4CWFC[0x10];                               // 0x18(0x10)
};


// Size 0x1
struct EventAnimationWieldedItemEquipStarted
{
public:
	char                                                         pad0x1_9JMO3[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct BootFlowErrorMessageQueryResponseEvent
{
public:
	struct FString                                               ErrorMessage;                                      // 0x0(0x10)
};


// Size 0x28
struct SignedGuildId
{
public:
	struct Guid                                                  GuildId;                                           // 0x0(0x10)
	char                                                         GuildAffiliation;                                  // 0x10(0x1)
	char                                                         pad0x7_8NEJV[0x7];                                 // 0x11(0x7)
	struct FString                                               Signature;                                         // 0x18(0x10)
};


// Size 0x40
struct IsWieldingItemCategoryCondition
{
public:
	char                                                         pad0x28_BN98Z[0x28];                               // 0x0(0x28)
	TArray<Class>                                                TargetItemCategories;                              // 0x28(0x10)
	bool                                                         InvalidIfStashed;                                  // 0x38(0x1)
	char                                                         pad0x7_YLSKF[0x7];                                 // 0x39(0x7)
};


// Size 0x20
struct EventAIBountySpawnerAllTargetsKilled
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	struct Guid                                                  CrewId;                                            // 0x8(0x10)
	class Actor*                                                 InstigatorOfFinalAIPawnDeath;                      // 0x18(0x8)
};


// Size 0x30
struct StreamingTelemetryBaseEvent
{
public:
	struct FString                                               LevelName;                                         // 0x0(0x10)
	int                                                          LodLevel;                                          // 0x10(0x4)
	struct Vector                                                PlayerPosition;                                    // 0x14(0xc)
	float                                                        DistanceFromPlayer;                                // 0x20(0x4)
	float                                                        DistanceFromBoundsToPlayer;                        // 0x24(0x4)
	bool                                                         PlayerIsWaitingToSpawn;                            // 0x28(0x1)
	bool                                                         PlayerIsTeleporting;                               // 0x29(0x1)
	bool                                                         IsLevelAssetCachingEnabled;                        // 0x2a(0x1)
	char                                                         pad0x5_YE4A2[0x5];                                 // 0x2b(0x5)
};


// Size 0x30
struct LevelMadeHiddenTelemetryEvent
{
public:
	char                                                         pad0x30_NGYZG[0x30];                               // 0x0(0x30)
};


// Size 0x1
struct HuntersCryDisableTimedFail
{
public:
	char                                                         pad0x1_0ISTS[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct ProjectileWeaponClientDebugLogRPC
{
public:
	char                                                         pad0x18_AUUCY[0x18];                               // 0x0(0x18)
	class ProjectileWeapon*                                      Weapon;                                            // 0x18(0x8)
	TArray<String>                                               ClientDebugStrings;                                // 0x20(0x10)
};


// Size 0x1
struct EventUseAlternateIdle
{
public:
	bool                                                         UseAlternateIdle;                                  // 0x0(0x1)
};


// Size 0x24
struct LeaveGhostShipActionStateParams
{
public:
	float                                                        FadeDelay;                                         // 0x0(0x4)
	float                                                        FadeDuration;                                      // 0x4(0x4)
	float                                                        FadeEventTimeout;                                  // 0x8(0x4)
	float                                                        FadeServerTimeout;                                 // 0xc(0x4)
	struct LinearColor                                           FadeColour;                                        // 0x10(0x10)
	bool                                                         FadeAudio;                                         // 0x20(0x1)
	char                                                         pad0x3_69LPC[0x3];                                 // 0x21(0x3)
};


// Size 0xf8
struct ClientReliabilityTelemetryEvent
{
public:
	char                                                         pad0xf8_21SZJ[0xf8];                               // 0x0(0xf8)
};


// Size 0x1
struct TimedDoorStartOpeningEvent
{
public:
	char                                                         pad0x1_HW7OM[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct ChapterQuests
{
public:
	TArray<Class>                                                QuestDescAssets;                                   // 0x0(0x10)
};


// Size 0x58
struct CharacterAnimaticSettings
{
public:
	char                                                         pad0x58_C97KX[0x58];                               // 0x0(0x58)
};


// Size 0x1
struct EventLoadableObjectLoaded
{
public:
	char                                                         pad0x1_E4TAP[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct EventEncounterStart
{
public:
	char                                                         pad0x20_OWY3F[0x20];                               // 0x0(0x20)
};


// Size 0x10
struct CustomGameLobbyLeaveRequestModel
{
public:
	struct FString                                               LobbyId;                                           // 0x0(0x10)
};


// Size 0x1
struct NotifyFrontendOfCurrentPirateStatus
{
public:
	bool                                                         Locked;                                            // 0x0(0x1)
};


// Size 0x1
struct GetActorsInRadiusGameServerResponseModel
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
};


// Size 0x8
struct ItemInfoTelemetryFragmentInput
{
public:
	class ItemInfo*                                              ItemInfo;                                          // 0x0(0x8)
};


// Size 0x8
struct DartProxySpawnEvent
{
public:
	class ItemProxy*                                             Proxy;                                             // 0x0(0x8)
};


// Size 0x40
struct StormAvoidanceArea
{
public:
	struct Vector2D                                              Location;                                          // 0x0(0x8)
	float                                                        Radius;                                            // 0x8(0x4)
	char                                                         pad0x34_0QQEW[0x34];                               // 0xc(0x34)
};


// Size 0x8
struct WorldSettingsCommandSpawnFogEvent
{
public:
	struct FName                                                 TargetIsland;                                      // 0x0(0x8)
};


// Size 0x28
struct CustomChangeRoleRequestModel
{
public:
	struct FString                                               LobbyId;                                           // 0x0(0x10)
	struct FString                                               AffectedPlayerId;                                  // 0x10(0x10)
	char                                                         Role;                                              // 0x20(0x1)
	char                                                         pad0x7_BPTOG[0x7];                                 // 0x21(0x7)
};


// Size 0x14
struct TreasureDestroyedTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	char                                                         BootyType;                                         // 0x10(0x1)
	char                                                         Source;                                            // 0x11(0x1)
	char                                                         DespawnReason;                                     // 0x12(0x1)
	char                                                         pad0x1_C4Y9A[0x1];                                 // 0x13(0x1)
};


// Size 0x68
struct RewardGrantedEvent
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
	struct FString                                               RewardId;                                          // 0x10(0x10)
	char                                                         CurrencyId;                                        // 0x20(0x1)
	char                                                         pad0x3_EM0DW[0x3];                                 // 0x21(0x3)
	struct FString                                               CompanyId;                                         // 0x28(0x10)
	TArray<String>                                               Entitlements;                                      // 0x40(0x10)
	struct FString                                               DeferralReason;                                    // 0x50(0x10)
	char                                                         Propogation;                                       // 0x60(0x1)
	char                                                         pad0x7_OD244[0x7];                                 // 0x61(0x7)
};


// Size 0x48
struct PlayerBaseTelemetryFragment
{
public:
	struct Guid                                                  PlayerGameId;                                      // 0x0(0x10)
	struct FString                                               UserId;                                            // 0x10(0x10)
	struct FString                                               PirateId;                                          // 0x20(0x10)
	char                                                         PlatformId;                                        // 0x30(0x1)
	char                                                         pad0x7_DRBRT[0x7];                                 // 0x31(0x7)
	struct FString                                               DeviceID;                                          // 0x38(0x10)
};


// Size 0x30
struct SwimmingCreatureAIStrategyMovementProperties
{
public:
	class UClass*                                                AIStrategy;                                        // 0x0(0x8)
	char                                                         SwimRotationMode;                                  // 0x8(0x1)
	char                                                         pad0x3_JUXI5[0x3];                                 // 0x9(0x3)
	float                                                        RotationRate;                                      // 0xc(0x4)
	float                                                        CorrectingMaxSpeed;                                // 0x10(0x4)
	float                                                        CorrectingYawTurnRate;                             // 0x14(0x4)
	float                                                        MaxAbsPitch;                                       // 0x18(0x4)
	float                                                        MaxSpeed;                                          // 0x1c(0x4)
	float                                                        VelocitySmoothingFactor;                           // 0x20(0x4)
	float                                                        TrackedActorVelocityScaling;                       // 0x24(0x4)
	float                                                        TrackedActorVelocityScalingSmoothingFactor;        // 0x28(0x4)
	char                                                         pad0x4_NNAX3[0x4];                                 // 0x2c(0x4)
};


// Size 0x10
struct MastDamageStateChangedEvent
{
public:
	char                                                         NewMastDamageState;                                // 0x0(0x1)
	char                                                         pad0x7_TTR7L[0x7];                                 // 0x1(0x7)
	class Actor*                                                 Mast;                                              // 0x8(0x8)
};


// Size 0x10
struct ChatModerationRemoteServiceConfigUpdateRequestFailedEvent
{
public:
	struct FString                                               FailureReason;                                     // 0x0(0x10)
};


// Size 0x10
struct PlayerRestrictionMessage
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
};


// Size 0x8
struct EventCustomAnimationPlayAnimation
{
public:
	struct FName                                                 AnimSequenceName;                                  // 0x0(0x8)
};


// Size 0x8
struct GuildNumberOfShipsChangedEvent
{
public:
	int                                                          OldNumberOfShips;                                  // 0x0(0x4)
	int                                                          CurrentNumberOfShips;                              // 0x4(0x4)
};


// Size 0xa0
struct StartedCaptainedSessionEvent
{
public:
	char                                                         pad0xa0_28TGS[0xa0];                               // 0x0(0xa0)
};


// Size 0x10
struct HealthChangeAudio
{
public:
	char                                                         Reason;                                            // 0x0(0x1)
	char                                                         pad0x7_1488C[0x7];                                 // 0x1(0x7)
	class WwiseEvent*                                            Sfx;                                               // 0x8(0x8)
};


// Size 0x38
struct EventPlayerEnteredIslandVicinityBoxedRpc
{
public:
	char                                                         pad0x18_BOUXJ[0x18];                               // 0x0(0x18)
	class Actor*                                                 Player;                                            // 0x18(0x8)
	char                                                         pad0x8_VT2BX[0x8];                                 // 0x20(0x8)
	struct FName                                                 IslandName;                                        // 0x28(0x8)
	char                                                         pad0x8_GN3YK[0x8];                                 // 0x30(0x8)
};


// Size 0x30
struct QuestStartBountyTelemetryEvent
{
public:
	struct FString                                               IslandName;                                        // 0x0(0x10)
	struct FString                                               LandmarkName;                                      // 0x10(0x10)
	int                                                          NumWaves;                                          // 0x20(0x4)
	int                                                          NumCrew;                                           // 0x24(0x4)
	int                                                          NumCaptains;                                       // 0x28(0x4)
	int                                                          NumLords;                                          // 0x2c(0x4)
};


// Size 0x8
struct EventRelinquishedControlOfObject
{
public:
	class Object*                                                RelinquishedObject;                                // 0x0(0x8)
};


// Size 0x30
struct SplineTransitionLadderActionStateParams
{
public:
	char                                                         pad0x30_HTTUB[0x30];                               // 0x0(0x30)
};


// Size 0xc
struct StandardSailDynamicsParameters
{
public:
	float                                                        ForceGeneratedByWindSpeedPerMPS;                   // 0x0(0x4)
	float                                                        AirDragPerSailPerMPS;                              // 0x4(0x4)
	float                                                        PowerRatioOfSailForwardForceToFullForce;           // 0x8(0x4)
};


// Size 0x2
struct ReapersTributeShipEventStateChanged
{
public:
	char                                                         OldEventState;                                     // 0x0(0x1)
	char                                                         NewEventState;                                     // 0x1(0x1)
};


// Size 0x10
struct FishingRodForceFeedbackLevel
{
public:
	float                                                        MinimumTensionFactor;                              // 0x0(0x4)
	char                                                         pad0x4_D5UFS[0x4];                                 // 0x4(0x4)
	class ForceFeedbackEffect*                                   ForceFeedback;                                     // 0x8(0x8)
};


// Size 0x30
struct QuestVariableClass
{
public:
	char                                                         pad0x30_AISKR[0x30];                               // 0x0(0x30)
};


// Size 0x18
struct RequestContestStateEvent
{
public:
	char                                                         pad0x18_VNC3R[0x18];                               // 0x0(0x18)
};


// Size 0x18
struct RequestCreatePiratePreviewWithOverridingPreviewActorEvent
{
public:
	int                                                          ResolutionX;                                       // 0x0(0x4)
	int                                                          ResolutionY;                                       // 0x4(0x4)
	struct FString                                               OverridingType;                                    // 0x8(0x10)
};


// Size 0x1
struct RequestShopOffersFailedEvent
{
public:
	char                                                         pad0x1_YAZLH[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct EventAthenaLocalPlayerNativeNetIdUpdated
{
public:
	struct UniqueNetIdRepl                                       NativeNetId;                                       // 0x0(0x18)
};


// Size 0x10
struct GuaranteedStorageContainerContentSpawnerEntry
{
public:
	class UClass*                                                ItemDesc;                                          // 0x0(0x8)
	int                                                          AmountToStock;                                     // 0x8(0x4)
	char                                                         pad0x4_GQZXG[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct PlayerPirateSlotRerollFailedTelemetryEvent
{
public:
	struct FString                                               FailureReason;                                     // 0x0(0x10)
};


// Size 0x1
struct PirateRerollEvent_RestartClient
{
public:
	char                                                         pad0x1_0UZ3M[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventCannonAimingStartedPitch
{
public:
	char                                                         pad0x1_GY7JJ[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct EventUserGameSettingsSetKeyBinding
{
public:
	char                                                         BindingSet;                                        // 0x0(0x1)
	char                                                         pad0x7_JPLFY[0x7];                                 // 0x1(0x7)
	struct FString                                               BindingName;                                       // 0x8(0x10)
	struct FString                                               KeyName;                                           // 0x18(0x10)
	char                                                         Instigator;                                        // 0x28(0x1)
	char                                                         pad0x7_OFB9U[0x7];                                 // 0x29(0x7)
};


// Size 0x1
struct GenericRejectEvent
{
public:
	char                                                         pad0x1_AAKEE[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct AthenaAnimationSkeletonShipCaptainAnimations
{
public:
	class AnimSequence*                                          EnterDockedPose;                                   // 0x0(0x8)
	TArray<class AnimSequence*>                                  DockedIdles;                                       // 0x8(0x10)
	class AnimSequence*                                          ExitDockedPose;                                    // 0x18(0x8)
	class AnimSequence*                                          Taunt;                                             // 0x20(0x8)
	class AnimSequence*                                          RamInto;                                           // 0x28(0x8)
	class AnimSequence*                                          RamCycle;                                          // 0x30(0x8)
	class AnimSequence*                                          RamImpact;                                         // 0x38(0x8)
	class AnimSequence*                                          RamOutOf;                                          // 0x40(0x8)
};


// Size 0x10
struct ShipCustomizationLockCategoryEvent
{
public:
	char                                                         pad0x10_UQQR9[0x10];                               // 0x0(0x10)
};


// Size 0x8
struct EventSetRemappedPlayerDirection
{
public:
	struct Vector2D                                              PlayerDirection;                                   // 0x0(0x8)
};


// Size 0x1
struct ClientGlintVisibilityLock
{
public:
	char                                                         pad0x1_9KWK2[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct BootFlowStartSetupConfigurationServiceStateEvent
{
public:
	char                                                         pad0x1_Z6NF9[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct AthenaAnimationObjectEquipAnimations
{
public:
	class AnimSequence*                                          Equip;                                             // 0x0(0x8)
	class BlendSpace*                                            EquipAsBlendSpace;                                 // 0x8(0x8)
	class BlendSpace*                                            EquipSwimming;                                     // 0x10(0x8)
	class AnimSequence*                                          UnEquip;                                           // 0x18(0x8)
	class BlendSpace*                                            UnEquipAsBlendSpace;                               // 0x20(0x8)
	class AnimSequence*                                          Pickup;                                            // 0x28(0x8)
	class AnimSequence*                                          Drop;                                              // 0x30(0x8)
	float                                                        JumpEquipAnimPlayRate;                             // 0x38(0x4)
	bool                                                         UseEquipBlendSpace;                                // 0x3c(0x1)
	bool                                                         UseUnequipBlendSpace;                              // 0x3d(0x1)
	char                                                         pad0x2_TR97F[0x2];                                 // 0x3e(0x2)
};


// Size 0x10
struct StreamingLocation
{
public:
	int                                                          Id;                                                // 0x0(0x4)
	struct Vector                                                Location;                                          // 0x4(0xc)
};


// Size 0x60
struct CinematicCrewEvent
{
public:
	TArray<String>                                               CrewMembers;                                       // 0x0(0x10)
	struct FText                                                 Header;                                            // 0x10(0x38)
	struct FName                                                 Tag;                                               // 0x48(0x8)
	struct FString                                               GuildId;                                           // 0x50(0x10)
};


// Size 0x18
struct AlignmentFlagActionRuleParams
{
public:
	class UClass*                                                PressedNotificationInputId;                        // 0x0(0x8)
	class UClass*                                                ReleasedNotificationInputId;                       // 0x8(0x8)
	float                                                        AddFlagHoldTime;                                   // 0x10(0x4)
	float                                                        RemoveFlagHoldTime;                                // 0x14(0x4)
};


// Size 0x1
struct BootFlowStartHandleErrorStateEvent
{
public:
	char                                                         pad0x1_XRVRT[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct TreasureMapTextEntry
{
public:
	struct FString                                               Name;                                              // 0x0(0x10)
	struct FText                                                 Substitution;                                      // 0x10(0x38)
};


// Size 0x20
struct QueryConfirmInviteResponse
{
public:
	bool                                                         IsInviteConfirmationPending;                       // 0x0(0x1)
	char                                                         pad0x7_T0Z7O[0x7];                                 // 0x1(0x7)
	struct FString                                               ErrorMessage;                                      // 0x8(0x10)
	bool                                                         IsErrorMessage;                                    // 0x18(0x1)
	char                                                         pad0x7_M6LRW[0x7];                                 // 0x19(0x7)
};


// Size 0x1
struct ResetSeaFortAlignmentEvent
{
public:
	char                                                         pad0x1_GTMMI[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct BoxedRpcDiscardTinVoyage
{
public:
	char                                                         pad0x18_ZO5UZ[0x18];                               // 0x0(0x18)
	int                                                          IndexOfVoyageToDiscard;                            // 0x18(0x4)
	char                                                         pad0x4_7SY88[0x4];                                 // 0x1c(0x4)
};


// Size 0x1
struct EventShipIsSafeForMeshMemoryConstrainedSystemsToStart
{
public:
	char                                                         pad0x1_VC6SS[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct PlayerHideoutInfo
{
public:
	class PlayerState*                                           PlayerState;                                       // 0x0(0x8)
	TArray<class SpawnLocation*>                                 ExitPoints;                                        // 0x8(0x10)
};


// Size 0x1
struct EventProjectileWeaponReload
{
public:
	char                                                         pad0x1_QB295[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct PremiumCatalogOfferGroup
{
public:
	struct FText                                                 Title;                                             // 0x0(0x38)
	TArray<struct Guid>                                          Children;                                          // 0x38(0x10)
};


// Size 0x30
struct PlayerHealthChangeTelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	float                                                        CurrentHealth;                                     // 0x10(0x4)
	float                                                        PreviousHealth;                                    // 0x14(0x4)
	float                                                        HealthDelta;                                       // 0x18(0x4)
	char                                                         Reason;                                            // 0x1c(0x1)
	char                                                         pad0x3_QN3CA[0x3];                                 // 0x1d(0x3)
	double                                                       SecondsSinceSpawned;                               // 0x28(0x8)
};


// Size 0x1
struct PirateProfiles_ShipSelectionPirateResetEvent
{
public:
	char                                                         pad0x1_GU30X[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct ContestCrewMemberModel
{
public:
	struct UniqueNetIdRepl                                       UserId;                                            // 0x0(0x18)
	struct FString                                               Gamertag;                                          // 0x18(0x10)
};


// Size 0x1c
struct DestroyingUnsafeExpiredWreckEvent
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	struct Guid                                                  CrewId;                                            // 0xc(0x10)
};


// Size 0x10
struct EventPlayerCharacterTeleported
{
public:
	class Actor*                                                 AthenaCharacter;                                   // 0x0(0x8)
	bool                                                         IsOnFerry;                                         // 0x8(0x1)
	char                                                         pad0x7_EUJ0O[0x7];                                 // 0x9(0x7)
};


// Size 0x10
struct PurchaseOfferResponse
{
public:
	TArray<String>                                               PurchasedItems;                                    // 0x0(0x10)
};


// Size 0x4
struct SetWindMagnitudeGameServerRequestModel
{
public:
	float                                                        Magnitude;                                         // 0x0(0x4)
};


// Size 0x1
struct EventLoadableItemLoadingBegin
{
public:
	char                                                         pad0x1_RKVL6[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct RadialContext
{
public:
	char                                                         pad0x18_8FPG6[0x18];                               // 0x0(0x18)
};


// Size 0x10
struct IndefiniteDoorLockEntry
{
public:
	class Controller*                                            Controller;                                        // 0x0(0x8)
	class Object*                                                Owner;                                             // 0x8(0x8)
};


// Size 0x8
struct EventHealthChangeContinuousApplied
{
public:
	float                                                        ChangeDelta;                                       // 0x0(0x4)
	char                                                         Reason;                                            // 0x4(0x1)
	char                                                         pad0x3_FSHU8[0x3];                                 // 0x5(0x3)
};


// Size 0x38
struct ShipCustomizationLoadout
{
public:
	TArray<class Class*>                                         Customizations;                                    // 0x0(0x10)
	TArray<class Class*>                                         InitialCustomizations;                             // 0x10(0x10)
	TArray<class Class*>                                         SavedCustomizations;                               // 0x20(0x10)
	bool                                                         HasInitialCustomizationsSet;                       // 0x30(0x1)
	char                                                         pad0x7_1470W[0x7];                                 // 0x31(0x7)
};


// Size 0x18
struct AddStatusesGameServerRequestModel
{
public:
	int                                                          ActorId;                                           // 0x0(0x4)
	char                                                         pad0x4_3YRO2[0x4];                                 // 0x4(0x4)
	TArray<String>                                               Statuses;                                          // 0x8(0x10)
};


// Size 0x1
struct EventStarved
{
public:
	char                                                         pad0x1_B6CXY[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct ServerChatSpamTelemetryEvent
{
public:
	int                                                          MessageCount;                                      // 0x0(0x4)
};


// Size 0x28
struct EmissaryCompanyQuestIcons
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	struct StringAssetReference                                  Background;                                        // 0x8(0x10)
	TArray<struct StringAssetReference>                          Icons;                                             // 0x18(0x10)
};


// Size 0x1
struct EventSwitchesUpdated
{
public:
	char                                                         pad0x1_V0CCY[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventCharacterDestroyed
{
public:
	char                                                         pad0x1_89S0A[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct IncomingFriendRequestReceivedEvent
{
public:
	struct FString                                               Gamertag;                                          // 0x0(0x10)
};


// Size 0x110
struct ProjectileServiceTelemetryHitTrackingDatum
{
public:
	char                                                         pad0x110_WZ517[0x110];                             // 0x0(0x110)
};


// Size 0x4
struct CaptainsShopVoyageLimitResponseEvent
{
public:
	int                                                          VoyageLimit;                                       // 0x0(0x4)
};


// Size 0x4
struct EventDeathCameraActivated
{
public:
	float                                                        CameraDuration;                                    // 0x0(0x4)
};


// Size 0x14
struct LastCrewMemberEnteredTunnel
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	bool                                                         ShouldCancelEmergentVoyages;                       // 0x10(0x1)
	bool                                                         ShouldCancelPrimaryVoyages;                        // 0x11(0x1)
	bool                                                         ShouldCancelEmergentVoyagesExcludingEmissary;      // 0x12(0x1)
	char                                                         pad0x1_MB7GW[0x1];                                 // 0x13(0x1)
};


// Size 0x14
struct ReapersMarkLevelChanged
{
public:
	int                                                          NewLevel;                                          // 0x0(0x4)
	struct Guid                                                  AssociatedCrew;                                    // 0x4(0x10)
};


// Size 0x10
struct EventPlayerStatePawnUnPossessed
{
public:
	class PlayerState*                                           PlayerState;                                       // 0x0(0x8)
	class Pawn*                                                  UnPossessedPawn;                                   // 0x8(0x8)
};


// Size 0x1
struct PremiumStoreClosedEvent
{
public:
	char                                                         pad0x1_JCLFQ[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct ItemStateData
{
public:
	char                                                         pad0x20_U50YG[0x20];                               // 0x0(0x20)
	struct FString                                               ItemName;                                          // 0x20(0x10)
};


// Size 0x20
struct BoxedRpcDiscardVoyage
{
public:
	char                                                         pad0x18_7P3Q5[0x18];                               // 0x0(0x18)
	class UClass*                                                VoyageToDiscard;                                   // 0x18(0x8)
};


// Size 0x2
struct RequestLobbyUIEvent
{
public:
	char                                                         SessionType;                                       // 0x0(0x1)
	char                                                         SessionVisibility;                                 // 0x1(0x1)
};


// Size 0x30
struct SpawnerCreatedAutomationEvent
{
public:
	class Actor*                                                 SpawnerLocation;                                   // 0x0(0x8)
	char                                                         pad0x20_YB7F4[0x20];                               // 0x8(0x20)
	class AISpawner*                                             Spawner;                                           // 0x28(0x8)
};


// Size 0xb8
struct MilestoneCompletionNetworkEvent
{
public:
	char                                                         pad0x18_73MPO[0x18];                               // 0x0(0x18)
	struct Guid                                                  AlignmentId;                                       // 0x18(0x10)
	struct Guid                                                  GoalId;                                            // 0x28(0x10)
	struct Guid                                                  ScheduleId;                                        // 0x38(0x10)
	struct FString                                               ShipName;                                          // 0x60(0x10)
	struct FString                                               AlignmentKey;                                      // 0x70(0x10)
	struct FText                                                 ScrambledShipName;                                 // 0x80(0x38)
};


// Size 0x10
struct CrewManagementMatchmakingVisibilityData
{
public:
	bool                                                         Voted;                                             // 0x0(0x1)
	char                                                         pad0x3_8OUM8[0x3];                                 // 0x1(0x3)
	int                                                          VotesCast;                                         // 0x4(0x4)
	int                                                          VotesRequired;                                     // 0x8(0x4)
	char                                                         State;                                             // 0xc(0x1)
	char                                                         pad0x3_8ZV68[0x3];                                 // 0xd(0x3)
};


// Size 0x8
struct EventItemDroppedOnWater
{
public:
	class Actor*                                                 DroppedActor;                                      // 0x0(0x8)
};


// Size 0x40
struct CargoRunQuestDescDataCompanyLocationHintEntry
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	struct FText                                                 LocationHint;                                      // 0x8(0x38)
};


// Size 0x48
struct PlayerAttackTelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	struct FString                                               DamageType;                                        // 0x10(0x10)
	struct FString                                               WeaponType;                                        // 0x20(0x10)
	struct Vector                                                TargetPos;                                         // 0x30(0xc)
	float                                                        DamageDealt;                                       // 0x3c(0x4)
	bool                                                         Success;                                           // 0x40(0x1)
	char                                                         pad0x7_EJGGC[0x7];                                 // 0x41(0x7)
};


// Size 0x1
struct ForceGameEventSchedulerServiceRefreshMessage
{
public:
	char                                                         pad0x1_JD28R[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct StandingSpyglassActionStateParams
{
public:
	char                                                         pad0x38_B80SU[0x38];                               // 0x0(0x38)
};


// Size 0x48
struct SpawningCommandSpawnTinyShark
{
public:
	char                                                         pad0x28_HZ4ZR[0x28];                               // 0x0(0x28)
	int                                                          ControllerParamIndex;                              // 0x28(0x4)
	int                                                          SharkType;                                         // 0x2c(0x4)
	int                                                          AncientType;                                       // 0x30(0x4)
	char                                                         pad0x4_04T6Q[0x4];                                 // 0x34(0x4)
	TArray<class PlayerState*>                                   TargetActors;                                      // 0x38(0x10)
};


// Size 0x28
struct BootyItemInfoMetaWrapper
{
public:
	char                                                         pad0x18_U1EF5[0x18];                               // 0x0(0x18)
	struct Guid                                                  BootyId;                                           // 0x18(0x10)
};


// Size 0x3c
struct PointLightData
{
public:
	float                                                        AttenuationRadius;                                 // 0x0(0x4)
	bool                                                         bUseInverseSquaredFalloff;                         // 0x4(0x1)
	char                                                         pad0x3_H7VVS[0x3];                                 // 0x5(0x3)
	float                                                        LightFalloffExponent;                              // 0x8(0x4)
	float                                                        IntensityScaleForWater;                            // 0xc(0x4)
	float                                                        MinDistanceToLightAssumed;                         // 0x10(0x4)
	float                                                        SourceRadius;                                      // 0x14(0x4)
	float                                                        SourceLength;                                      // 0x18(0x4)
	char                                                         SimpleFunctionType;                                // 0x1c(0x1)
	char                                                         pad0x3_8FCNA[0x3];                                 // 0x1d(0x3)
	float                                                        ScaleOffset;                                       // 0x20(0x4)
	float                                                        PulsePhase;                                        // 0x24(0x4)
	float                                                        FlickerFrequency;                                  // 0x28(0x4)
	int                                                          FlickerPerlinRow;                                  // 0x2c(0x4)
	struct LightmassPointLightSettings                           LightmassSettings;                                 // 0x30(0xc)
};


// Size 0x38
struct BattleElevatorEventRoomPhase
{
public:
	struct FName                                                 PhaseName;                                         // 0x0(0x8)
	bool                                                         IsFinalPhase;                                      // 0x8(0x1)
	char                                                         pad0x3_V04ZI[0x3];                                 // 0x9(0x3)
	struct FName                                                 NextPhaseName;                                     // 0xc(0x8)
	char                                                         pad0x4_638S1[0x4];                                 // 0x14(0x4)
	TArray<class BattleElevatorEventRoomBasePolicy*>             Policies;                                          // 0x18(0x10)
	TArray<class ElevatorActionBase*>                            Actions;                                           // 0x28(0x10)
};


// Size 0x10
struct AthenaAnimationCannonConcealedAnimData
{
public:
	class AnimSequence*                                          InCannonIdle;                                      // 0x0(0x8)
	class AnimSequence*                                          FiredFromCannon;                                   // 0x8(0x8)
};


// Size 0x2
struct EventOpenableItemStateChanged
{
public:
	char                                                         pad0x2_VC0OX[0x2];                                 // 0x0(0x2)
};


// Size 0x38
struct PlayerModerationReportablePlayerDetails
{
public:
	struct FString                                               ReportableGamerTag;                                // 0x0(0x10)
	struct FString                                               ScrambledGamerTag;                                 // 0x10(0x10)
	struct FString                                               Xuid;                                              // 0x20(0x10)
	char                                                         Platform;                                          // 0x30(0x1)
	char                                                         pad0x7_QZMX2[0x7];                                 // 0x31(0x7)
};


// Size 0x10
struct RequestShipCustomizationChestUnequipShipCustomizationEvent
{
public:
	struct FString                                               ItemDesc;                                          // 0x0(0x10)
};


// Size 0x8
struct EventPlayerCharacterLeft
{
public:
	class Actor*                                                 AthenaCharacter;                                   // 0x0(0x8)
};


// Size 0x1
struct ShipDestroyedTelemetryEvent
{
public:
	char                                                         pad0x1_N1A0U[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct FragileComponentShipDamageTypeEntry
{
public:
	class UClass*                                                ShipDamagerType;                                   // 0x0(0x8)
	float                                                        HealthChangePropagated;                            // 0x8(0x4)
	char                                                         pad0x4_OGH6Y[0x4];                                 // 0xc(0x4)
};


// Size 0x1
struct EventSpawnedAsSalvageItem
{
public:
	bool                                                         SpawnedAsSunkenItem;                               // 0x0(0x1)
};


// Size 0x4
struct IntentChangedEvent
{
public:
	float                                                        NewIntent;                                         // 0x0(0x4)
};


// Size 0x28
struct CustomGameChangeShipTypeRequestModel
{
public:
	struct FString                                               LobbyId;                                           // 0x0(0x10)
	struct Guid                                                  CrewId;                                            // 0x10(0x10)
	char                                                         ShipType;                                          // 0x20(0x1)
	char                                                         pad0x7_PROEI[0x7];                                 // 0x21(0x7)
};


// Size 0x10
struct JoinSessionFailedEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x4
struct TunnelOfTheDamnedMigrationSucceededEvent
{
public:
	char                                                         pad0x4_69W9K[0x4];                                 // 0x0(0x4)
};


// Size 0x1
struct ItemPreviewBusyEvent
{
public:
	char                                                         pad0x1_P5Z26[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct CrewChangedSeaFortAlignmentEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0xc
struct NPCOnDespawnVOEntry
{
public:
	char                                                         DespawnReason;                                     // 0x0(0x1)
	char                                                         pad0x3_Z86OG[0x3];                                 // 0x1(0x3)
	struct FName                                                 VOGroupName;                                       // 0x4(0x8)
};


// Size 0x8
struct EventStartConversationAsParticipant
{
public:
	class Actor*                                                 ConversationStarter;                               // 0x0(0x8)
};


// Size 0x10
struct ConstellationSpawnedEvent
{
public:
	char                                                         pad0x10_QVLVF[0x10];                               // 0x0(0x10)
};


// Size 0x8
struct ShipTrackerSnapshot
{
public:
	int                                                          ShipId;                                            // 0x0(0x4)
	char                                                         Region;                                            // 0x4(0x1)
	char                                                         pad0x3_066YM[0x3];                                 // 0x5(0x3)
};


// Size 0xc
struct SprintConditionsParams
{
public:
	float                                                        ForwardInputVectorTolerance;                       // 0x0(0x4)
	float                                                        MinVelocityForwardDot;                             // 0x4(0x4)
	float                                                        MinVelocityMagnitude;                              // 0x8(0x4)
};


// Size 0x18
struct DeferralReasonPopUpNotificationInfo
{
public:
	struct FString                                               DeferralReason;                                    // 0x0(0x10)
	class PopUpMessageDesc*                                      PopUp;                                             // 0x10(0x8)
};


// Size 0x10
struct CreateSessionFailedEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x8
struct FireTelemetryFragment
{
public:
	int                                                          NumOfShipWithActiveCells;                          // 0x0(0x4)
	int                                                          NumOfActiveCells;                                  // 0x4(0x4)
};


// Size 0x1
struct VomitFacialAnim
{
public:
	char                                                         pad0x1_ISF7V[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct QuestTableCloseEvent
{
public:
	char                                                         pad0x1_9SRCG[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct RepairLoadoutFromSeedRpc
{
public:
	char                                                         pad0x18_TSS14[0x18];                               // 0x0(0x18)
	TArray<int>                                                  Seeds;                                             // 0x18(0x10)
	TArray<struct StringClassReference>                          CategoriesToApply;                                 // 0x28(0x10)
};


// Size 0x18
struct UIPremiumStoreOpenTelemetryEvent
{
public:
	bool                                                         IsFrontend;                                        // 0x0(0x1)
	char                                                         pad0x7_H6UU2[0x7];                                 // 0x1(0x7)
	struct FString                                               SessionId;                                         // 0x8(0x10)
};


// Size 0x40
struct ProjectileServiceRecordProjectileHitVolumeImpactRpc
{
public:
	char                                                         pad0x18_I7LOD[0x18];                               // 0x0(0x18)
	int                                                          ProjectileIndex;                                   // 0x18(0x4)
	struct Guid                                                  TelemetryAttackId;                                 // 0x1c(0x10)
	char                                                         pad0x4_8GS0U[0x4];                                 // 0x2c(0x4)
	class AthenaPlayerCharacter*                                 InstigatingPlayerCharacter;                        // 0x30(0x8)
	class Actor*                                                 HitActor;                                          // 0x38(0x8)
};


// Size 0x10
struct ContestParticipantJoinedServerEvent
{
public:
	struct Guid                                                  NewCrewJoining;                                    // 0x0(0x10)
};


// Size 0x1
struct ShipOnFireBeginTelemetryEvent
{
public:
	char                                                         pad0x1_0XUA4[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct EventIslandDiscoveredNotification
{
public:
	struct FText                                                 IslandName;                                        // 0x0(0x38)
	char                                                         IslandType;                                        // 0x38(0x1)
	char                                                         pad0x3_XQU12[0x3];                                 // 0x39(0x3)
	struct FName                                                 SeaName;                                           // 0x3c(0x8)
	char                                                         IslandActiveEventType;                             // 0x44(0x1)
	char                                                         pad0x3_9HJPV[0x3];                                 // 0x45(0x3)
};


// Size 0x28
struct ExplosionForceFeedbackInfo
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	class ForceFeedbackEffect*                                   Effect;                                            // 0x8(0x8)
	class ForceFeedbackEffect*                                   EffectLower;                                       // 0x10(0x8)
	float                                                        LowerTriggerPercentage;                            // 0x18(0x4)
	struct FName                                                 Tag;                                               // 0x1c(0x8)
	float                                                        ShakeOuterRadius;                                  // 0x24(0x4)
};


// Size 0x18
struct CloudTypeNormalizedWeight
{
public:
	struct LinearColor                                           LodScreenPercentages;                              // 0x0(0x10)
	float                                                        ProbabilityWeight;                                 // 0x10(0x4)
	float                                                        MeshRadius;                                        // 0x14(0x4)
};


// Size 0x1
struct WalkableEmoteActionStateParams
{
public:
	char                                                         pad0x1_IM5PJ[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct CrewJoinedAllianceTelemetryEvent
{
public:
	struct Guid                                                  AllianceId;                                        // 0x0(0x10)
	struct Guid                                                  OfferingCrewSessionId;                             // 0x10(0x10)
	struct Guid                                                  AcceptingCrewSessionId;                            // 0x20(0x10)
};


// Size 0x40
struct ClientBootFlowExistingSessionTelemetry
{
public:
	struct FString                                               SessionId;                                         // 0x0(0x10)
	struct FString                                               PlayMode;                                          // 0x10(0x10)
	struct FString                                               SessionType;                                       // 0x20(0x10)
	struct FString                                               OwningUserId;                                      // 0x30(0x10)
};


// Size 0x18
struct RatManagerPseudoRandomEntry
{
public:
	double                                                       TimeBoundary;                                      // 0x0(0x8)
	float                                                        RatSpeed;                                          // 0x8(0x4)
	float                                                        RatScale;                                          // 0xc(0x4)
	struct FName                                                 LocationName;                                      // 0x10(0x8)
};


// Size 0x10
struct GetBulkGuildsRequestModel
{
public:
	TArray<String>                                               GuildIds;                                          // 0x0(0x10)
};


// Size 0x8
struct EventResetSettingsGroup
{
public:
	struct FName                                                 SettingsGroupNameToReset;                          // 0x0(0x8)
};


// Size 0x8
struct QuestSelectionParams
{
public:
	char                                                         PoolSelectionMethod;                               // 0x0(0x1)
	char                                                         LocationSelectionMethod;                           // 0x1(0x1)
	bool                                                         ForceAlwaysNoLocationRepetition;                   // 0x2(0x1)
	bool                                                         UseChapterBasedVoyageHistory;                      // 0x3(0x1)
	int                                                          MaxNumberOfPoolRetries;                            // 0x4(0x4)
};


// Size 0x1
struct CaptainsShopVoyageLimitRequestEvent
{
public:
	char                                                         pad0x1_9EQWC[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct SpawnCommandsAIClassIDs
{
public:
	struct FName                                                 AIClassName;                                       // 0x0(0x8)
	TArray<class Class*>                                         AIClassIDs;                                        // 0x8(0x10)
	class UClass*                                                DefaultAIClassID;                                  // 0x18(0x8)
};


// Size 0x48
struct BuriedBuriable
{
public:
	char                                                         pad0x18_ZNE2O[0x18];                               // 0x0(0x18)
	struct Vector                                                Location;                                          // 0x18(0xc)
	float                                                        Radius;                                            // 0x24(0x4)
	char                                                         pad0x20_HTQ4E[0x20];                               // 0x28(0x20)
};


// Size 0x18
struct RequiredClothingData
{
public:
	int                                                          RequiredNumberToMatch;                             // 0x0(0x4)
	char                                                         pad0x4_QRGR8[0x4];                                 // 0x4(0x4)
	TArray<class Class*>                                         RequiredClothing;                                  // 0x8(0x10)
};


// Size 0x1
struct EventCurseSleep
{
public:
	char                                                         pad0x1_NCURP[0x1];                                 // 0x0(0x1)
};


// Size 0x98
struct EventCrewsDisbandedAlliance
{
public:
	char                                                         pad0x98_IVAHQ[0x98];                               // 0x0(0x98)
};


// Size 0x10
struct AssociatedCompanies
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	struct FName                                                 FeatureToggle;                                     // 0x8(0x8)
};


// Size 0x8
struct EventReceiveChestOfRageComponentState
{
public:
	class ChestOfRageComponent*                                  Source;                                            // 0x0(0x8)
};


// Size 0x20
struct GamerTagUserDataModel
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct FString                                               PirateId;                                          // 0x10(0x10)
};


// Size 0x20
struct ShipCurseVFXTemplate
{
public:
	class UClass*                                                ActorClass;                                        // 0x0(0x8)
	class ParticleSystem*                                        Template;                                          // 0x8(0x8)
	struct FString                                               SocketNameSubstring;                               // 0x10(0x10)
};


// Size 0x190
struct TutorialStepReturnToStranger
{
public:
	char                                                         pad0x190_ZCZ6X[0x190];                             // 0x0(0x190)
};


// Size 0x98
struct StoreCatalogItem
{
public:
	struct FString                                               ProductId;                                         // 0x0(0x10)
	struct FString                                               Title;                                             // 0x10(0x10)
	struct FString                                               Description;                                       // 0x20(0x10)
	struct FString                                               FormattedPrice;                                    // 0x30(0x10)
	struct FString                                               FormattedBasePrice;                                // 0x40(0x10)
	struct FString                                               CurrencyCode;                                      // 0x50(0x10)
	bool                                                         IsOnSale;                                          // 0x60(0x1)
	char                                                         pad0x7_SPI7M[0x7];                                 // 0x61(0x7)
	struct DateTime                                              SaleEndDate;                                       // 0x68(0x8)
	struct FString                                               ImageUri;                                          // 0x70(0x10)
	TArray<String>                                               MetaTags;                                          // 0x80(0x10)
	int                                                          DisplayPriority;                                   // 0x90(0x4)
	char                                                         pad0x4_AP8MB[0x4];                                 // 0x94(0x4)
};


// Size 0x20
struct PurchaseCatalogOfferRequestUIEvent
{
public:
	struct FString                                               CatalogName;                                       // 0x0(0x10)
	struct Guid                                                  CatalogOfferId;                                    // 0x10(0x10)
};


// Size 0x8
struct FocusRadialInventorySlot
{
public:
	char                                                         pad0x4_47763[0x4];                                 // 0x0(0x4)
	int                                                          SlotIndex;                                         // 0x4(0x4)
};


// Size 0x40
struct FishingFishFishingRodDebugDrawInfo
{
public:
	char                                                         pad0x40_Y0BA0[0x40];                               // 0x0(0x40)
};


// Size 0x1
struct EventCompanyStateRequest
{
public:
	char                                                         pad0x1_0JSGS[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventGuildNameTextboxFocusRequest
{
public:
	bool                                                         ShouldFocusGuildNameTextbox;                       // 0x0(0x1)
};


// Size 0x1e0
struct AthenaAnimationAsyncLoadedFishingAnimations
{
public:
	char                                                         pad0xc0_E6Q30[0xc0];                               // 0x0(0xc0)
	class BlendSpace*                                            Fishing;                                           // 0xc0(0x8)
	class BlendSpace1D*                                          FishingAdditive;                                   // 0xc8(0x8)
	class AnimSequence*                                          SuccessReelIn;                                     // 0x150(0x8)
	class AnimSequence*                                          FishingToIdle;                                     // 0x1b8(0x8)
	char                                                         pad0x20_LWV4S[0x20];                               // 0x1c0(0x20)
};


// Size 0x38
struct IslandEventData
{
public:
	class UClass*                                                EventType;                                         // 0x0(0x8)
	struct StringAssetReference                                  VoyageDescAssetString;                             // 0x8(0x10)
	struct Vector2D                                              WorldPos;                                          // 0x18(0x8)
	bool                                                         IsActive;                                          // 0x20(0x1)
	char                                                         pad0x3_SY9U3[0x3];                                 // 0x21(0x3)
	struct Guid                                                  EventId;                                           // 0x24(0x10)
	char                                                         pad0x4_PHVFI[0x4];                                 // 0x34(0x4)
};


// Size 0x14
struct CompanyShopActionStateParams
{
public:
	float                                                        CinematicCameraBlendInTimeSeconds;                 // 0x0(0x4)
	char                                                         CinematicCameraBlendInMode;                        // 0x4(0x1)
	char                                                         pad0x3_UR1E1[0x3];                                 // 0x5(0x3)
	float                                                        CinematicCameraBlendOutTimeSeconds;                // 0x8(0x4)
	char                                                         CinematicCameraBlendOutMode;                       // 0xc(0x1)
	char                                                         pad0x3_S00SV[0x3];                                 // 0xd(0x3)
	float                                                        InputFocusTimeout;                                 // 0x10(0x4)
};


// Size 0x4
struct QuestTableLikedVoyages
{
public:
	int                                                          Capacity;                                          // 0x0(0x4)
};


// Size 0x28
struct BootFlowNetworkErrorTelemetryEvent
{
public:
	double                                                       TimeConnected;                                     // 0x0(0x8)
	struct FString                                               ServerAddress;                                     // 0x8(0x10)
	struct FString                                               Message;                                           // 0x18(0x10)
};


// Size 0x70
struct BreakReapersChestSealActionRuleVerbiage
{
public:
	struct FText                                                 CanActivateTooltipDescriptor;                      // 0x0(0x38)
	struct FText                                                 CannotActivateTooltipDescriptor;                   // 0x38(0x38)
};


// Size 0x1
struct DeactivateContestZoneEvent
{
public:
	char                                                         pad0x1_0VQGM[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct ItemBuryingBaseOverride
{
public:
	TArray<Class>                                                Classes;                                           // 0x0(0x10)
	class ItemDiggingBuryConfig*                                 BuryingConfig;                                     // 0x10(0x8)
};


// Size 0x68
struct FiredFromActorActionStateConstructionInfo
{
public:
	char                                                         pad0x48_H9HSV[0x48];                               // 0x0(0x48)
	struct NetActorPtr                                           FiringActor;                                       // 0x48(0x14)
	struct Vector                                                LaunchVelocity;                                    // 0x5c(0xc)
};


// Size 0x38
struct ServerHeartbeatTelemetryEvent
{
public:
	struct Timespan                                              ServerUptime;                                      // 0x0(0x8)
	struct Timespan                                              ServerTimeToLive;                                  // 0x8(0x8)
	struct FString                                               ServerAddress;                                     // 0x10(0x10)
	struct FString                                               ServerMigrationAddress;                            // 0x20(0x10)
	bool                                                         ForcingShutdown;                                   // 0x30(0x1)
	char                                                         pad0x7_ZOZ2B[0x7];                                 // 0x31(0x7)
};


// Size 0x70
struct CompanyShopActionStateConstructionInfo
{
public:
	char                                                         pad0x48_KDCH6[0x48];                               // 0x0(0x48)
	struct NetObjectPtr                                          NPC;                                               // 0x48(0x14)
	char                                                         pad0x14_XFVL9[0x14];                               // 0x5c(0x14)
};


// Size 0x10
struct GenericModalContinueEvent
{
public:
	struct FString                                               DisplayMessage;                                    // 0x0(0x10)
};


// Size 0x10
struct CustomGameGetLobbyRequestModel
{
public:
	struct FString                                               LobbyId;                                           // 0x0(0x10)
};


// Size 0x28
struct CatalogDescTabCatalogOverrides
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	char                                                         pad0x4_V85BU[0x4];                                 // 0xc(0x4)
	TArray<struct Name>                                          RequiredCampaigns;                                 // 0x10(0x10)
	class CatalogDataAsset*                                      Catalog;                                           // 0x20(0x8)
};


// Size 0x18
struct ItemSnapshotExpandedEvent
{
public:
	struct Guid                                                  SnapshotID;                                        // 0x0(0x10)
	class Object*                                                CreatedObject;                                     // 0x10(0x8)
};


// Size 0x30
struct AthenaAnimationRowboatAnimationsFirstPerson
{
public:
	class AnimSequence*                                          SitDown;                                           // 0x0(0x8)
	class AnimSequence*                                          Stand;                                             // 0x8(0x8)
	class AnimSequence*                                          Idle;                                              // 0x10(0x8)
	class AnimSequence*                                          Row;                                               // 0x18(0x8)
	class AnimSequence*                                          Recover;                                           // 0x20(0x8)
	class AnimSequence*                                          Brake;                                             // 0x28(0x8)
};


// Size 0x1
struct BootFlowInviteAcceptedEvent
{
public:
	char                                                         pad0x1_EVTIT[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventGhostShipDoorCreated
{
public:
	class GhostShipDoor*                                         GhostShipDoor;                                     // 0x0(0x8)
};


// Size 0x18
struct EventRemoveCrewFromBeingBeckonedByNPCGroup
{
public:
	class UClass*                                                NPCGroupID;                                        // 0x0(0x8)
	char                                                         pad0x10_B2Z3O[0x10];                               // 0x8(0x10)
};


// Size 0x2c
struct AthenaAnimationHitReactParams
{
public:
	int                                                          StandardIndex0;                                    // 0x0(0x4)
	int                                                          StandardIndex1;                                    // 0x4(0x4)
	bool                                                         HitReactTransition;                                // 0x8(0x1)
	char                                                         pad0x3_DAWKK[0x3];                                 // 0x9(0x3)
	float                                                        DirectionYaw;                                      // 0xc(0x4)
	int                                                          ItemIndex0;                                        // 0x10(0x4)
	int                                                          ItemIndex1;                                        // 0x14(0x4)
	int                                                          ActionIndex0;                                      // 0x18(0x4)
	int                                                          ActionIndex1;                                      // 0x1c(0x4)
	int                                                          SubtleIndex0;                                      // 0x20(0x4)
	int                                                          SubtleIndex1;                                      // 0x24(0x4)
	char                                                         AnimationType;                                     // 0x28(0x1)
	char                                                         pad0x3_691NZ[0x3];                                 // 0x29(0x3)
};


// Size 0x1
struct EventPrimaryPlayerProfileDisconnected
{
public:
	char                                                         pad0x1_C97DD[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct SpawningCommandSpawnKraken
{
public:
	char                                                         pad0x28_US5X7[0x28];                               // 0x0(0x28)
	TArray<class PlayerState*>                                   TargetActors;                                      // 0x28(0x10)
};


// Size 0x1
struct PirateCreationEvent_UserConfirmationResponse
{
public:
	bool                                                         ShouldSavePirate;                                  // 0x0(0x1)
};


// Size 0x10
struct NetworkTelemetryFragment
{
public:
	char                                                         pad0x10_7ID3L[0x10];                               // 0x0(0x10)
};


// Size 0x40
struct InteractionOption
{
public:
	struct FString                                               Text;                                              // 0x0(0x10)
	int                                                          Index;                                             // 0x10(0x4)
	char                                                         pad0x4_R8P7J[0x4];                                 // 0x14(0x4)
	struct FString                                               Icon;                                              // 0x18(0x10)
	struct FString                                               IconNarrationText;                                 // 0x28(0x10)
	bool                                                         IsEnabled;                                         // 0x38(0x1)
	char                                                         pad0x7_ULFMJ[0x7];                                 // 0x39(0x7)
};


// Size 0x10
struct EventTriggerOverlayAction
{
public:
	class Object*                                                InteractObject;                                    // 0x0(0x8)
	char                                                         InteractableActionType;                            // 0x8(0x1)
	char                                                         pad0x7_KYVR1[0x7];                                 // 0x9(0x7)
};


// Size 0x58
struct ShipCaptainedSessionData
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct Guid                                                  ShipId;                                            // 0x10(0x10)
	struct FName                                                 SessionToken;                                      // 0x20(0x8)
	struct UniqueNetIdRepl                                       CaptainUserId;                                     // 0x28(0x18)
	struct FString                                               CaptainPirateId;                                   // 0x40(0x10)
	bool                                                         IsFirstTimeSailingShip;                            // 0x50(0x1)
	char                                                         pad0x7_M0FYM[0x7];                                 // 0x51(0x7)
};


// Size 0x4
struct UseLadderUpdateIntentEvent
{
public:
	char                                                         pad0x4_PWY0Z[0x4];                                 // 0x0(0x4)
};


// Size 0x1
struct RequestSessionTypeSelectionEvent
{
public:
	char                                                         pad0x1_HTYZB[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct MerchantQuestRequiredItemsGroup
{
public:
	TArray<class MerchantQuestItemData*>                         RequiredItems;                                     // 0x0(0x10)
};


// Size 0x30
struct GameEventSettingsInfo
{
public:
	struct FString                                               GameEventTypeRef;                                  // 0x0(0x10)
	TArray<String>                                               ExcludedGlobalEvents;                              // 0x10(0x10)
	int                                                          RegenIntervalOverride;                             // 0x20(0x4)
	int                                                          RepeatQueryTimeOverride;                           // 0x24(0x4)
	int                                                          PvpQueryTimeOverride;                              // 0x28(0x4)
	int                                                          ReinsertionTimeOverride;                           // 0x2c(0x4)
};


// Size 0x18
struct CrewScore
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	int                                                          Score;                                             // 0x10(0x4)
	char                                                         ScoreId;                                           // 0x14(0x1)
	char                                                         pad0x3_78JWG[0x3];                                 // 0x15(0x3)
};


// Size 0x48
struct BlockedInputActionStateConstructionInfo
{
public:
	char                                                         pad0x48_MPVYY[0x48];                               // 0x0(0x48)
};


// Size 0x1
struct EventFishingFishCollisionDetected
{
public:
	char                                                         pad0x1_J6V8Q[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct VfxSelectorEntry
{
public:
	class Object*                                                ParticleSystem;                                    // 0x0(0x8)
	class WwiseEvent*                                            WiseEvent;                                         // 0x8(0x8)
	class WwiseObjectPoolWrapper*                                WwisePoolToUse;                                    // 0x10(0x8)
	struct FName                                                 RTPCName;                                          // 0x18(0x8)
	float                                                        RTPCValue;                                         // 0x20(0x4)
	char                                                         pad0x4_97UDV[0x4];                                 // 0x24(0x4)
};


// Size 0x38
struct MerchantQuestCrateFilledNetworkEvent
{
public:
	char                                                         pad0x18_NPS83[0x18];                               // 0x0(0x18)
	struct FString                                               PlayerName;                                        // 0x18(0x10)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x28(0x8)
	bool                                                         OnlyPlayAudio;                                     // 0x30(0x1)
	char                                                         pad0x7_LMGK9[0x7];                                 // 0x31(0x7)
};


// Size 0x1
struct ResetAutoCentreLookEvent
{
public:
	char                                                         pad0x1_TIFFQ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct FirstPlayerArrivedInTunnelOfTheDamnedTelemetryEvent
{
public:
	char                                                         pad0x1_VUXD3[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventFaunaAnimationLocationChanged
{
public:
	char                                                         Location;                                          // 0x0(0x1)
};


// Size 0x10
struct DamageableVulnerabilityPair
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	float                                                        DamageMultiplier;                                  // 0x8(0x4)
	char                                                         pad0x4_VC94A[0x4];                                 // 0xc(0x4)
};


// Size 0xc
struct PlayerCapstanUsageEndTelemetryEvent
{
public:
	int                                                          NumCurrentUsers;                                   // 0x0(0x4)
	float                                                        CapstanVelocity;                                   // 0x4(0x4)
	float                                                        CapstanState;                                      // 0x8(0x4)
};


// Size 0x58
struct DeadActionStateParams
{
public:
	float                                                        FadeDelay;                                         // 0x0(0x4)
	float                                                        FadeDuration;                                      // 0x4(0x4)
	float                                                        FadeEventTimeout;                                  // 0x8(0x4)
	float                                                        FadeServerTimeout;                                 // 0xc(0x4)
	struct LinearColor                                           FadeColour;                                        // 0x10(0x10)
	bool                                                         FadeAudio;                                         // 0x20(0x1)
	char                                                         pad0x3_7YGL3[0x3];                                 // 0x21(0x3)
	float                                                        DeathCameraBlackFadeDelay;                         // 0x24(0x4)
	float                                                        DeathCameraBlackFadeDuration;                      // 0x28(0x4)
	float                                                        DeathCameraBlackFadeEventTimeout;                  // 0x2c(0x4)
	float                                                        DeathCameraBlackFadeServerTimeout;                 // 0x30(0x4)
	struct LinearColor                                           DeathCameraBlackFadeColour;                        // 0x34(0x10)
	float                                                        DeathCameraDelayBeforeEvaporate;                   // 0x44(0x4)
	bool                                                         DeathCameraFadeAudio;                              // 0x48(0x1)
	char                                                         pad0x3_RT44A[0x3];                                 // 0x49(0x3)
	float                                                        DeathCameraDelay;                                  // 0x4c(0x4)
	class GhostDataAsset*                                        PlayerGhostDataAsset;                              // 0x50(0x8)
};


// Size 0x34
struct FortSpawnTelemetryEvent
{
public:
	struct Guid                                                  FortId;                                            // 0x0(0x10)
	struct Guid                                                  ConfigSpawnId;                                     // 0x10(0x10)
	struct FName                                                 FortName;                                          // 0x20(0x8)
	struct FName                                                 FortType;                                          // 0x28(0x8)
	bool                                                         IsMegaStashFort;                                   // 0x30(0x1)
	bool                                                         IsOnDemand;                                        // 0x31(0x1)
	char                                                         pad0x2_O9323[0x2];                                 // 0x32(0x2)
};


// Size 0x28
struct InGameCommandRPC
{
public:
	char                                                         pad0x20_Z6E0D[0x20];                               // 0x0(0x20)
	class ScriptStruct*                                          CommandScriptStruct;                               // 0x20(0x8)
};


// Size 0x1
struct EventFireWeapon
{
public:
	bool                                                         bForFirstPerson;                                   // 0x0(0x1)
};


// Size 0x40
struct DistributedGuildActivityMessage
{
public:
	struct FString                                               GuildId;                                           // 0x0(0x10)
	struct FString                                               CreatedAtUtc;                                      // 0x10(0x10)
	struct FString                                               Type;                                              // 0x20(0x10)
	struct FString                                               payload;                                           // 0x30(0x10)
};


// Size 0x80
struct TradeRouteMapData
{
public:
	char                                                         pad0x48_TCJN9[0x48];                               // 0x0(0x48)
	struct InterpCurveVector2D                                   TradeRoutePath;                                    // 0x48(0x18)
	struct Vector2D                                              TradeRoutePathOffset;                              // 0x60(0x8)
	float                                                        TradeRoutePathSpacing;                             // 0x68(0x4)
	float                                                        TradeRoutePathSegmentTextureWidth;                 // 0x6c(0x4)
	float                                                        TradeRoutePathSegmentTextureLength;                // 0x70(0x4)
	bool                                                         NormalizeSplinePointSpacing;                       // 0x74(0x1)
	char                                                         pad0x3_HEMLS[0x3];                                 // 0x75(0x3)
	float                                                        NormalizeAdjustment;                               // 0x78(0x4)
	bool                                                         IgnoreFirstPoint;                                  // 0x7c(0x1)
	char                                                         pad0x3_918LY[0x3];                                 // 0x7d(0x3)
};


// Size 0x1
struct EventFaunaAnimationTransition
{
public:
	char                                                         AnimationState;                                    // 0x0(0x1)
};


// Size 0x1
struct EventIslandEventDataChanged
{
public:
	char                                                         pad0x1_BM9K5[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct HarpoonItemSlot
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	int                                                          ItemsInSlot;                                       // 0xc(0x4)
};


// Size 0x40
struct CapturedByKrakenActionStateParams
{
public:
	class CurveFloat*                                            MovementAlphaXY;                                   // 0x0(0x8)
	class CurveFloat*                                            MovementAlphaZ;                                    // 0x8(0x8)
	class CurveFloat*                                            MovementRotation;                                  // 0x10(0x8)
	float                                                        MovementTime;                                      // 0x18(0x4)
	float                                                        DistanceFromTentacleToStartFade;                   // 0x1c(0x4)
	float                                                        FadeInDuration;                                    // 0x20(0x4)
	float                                                        ClientConditionsCompleteTimeout;                   // 0x24(0x4)
	float                                                        MinCameraPitch;                                    // 0x28(0x4)
	float                                                        MaxCameraPitch;                                    // 0x2c(0x4)
	float                                                        MinCameraYaw;                                      // 0x30(0x4)
	float                                                        MaxCameraYaw;                                      // 0x34(0x4)
	float                                                        AnimationProgressionToStopCameraFade;              // 0x38(0x4)
	float                                                        BlockInteractInputTime;                            // 0x3c(0x4)
};


// Size 0xd0
struct StormScalingParameters
{
public:
	struct FName                                                 MaterialMaskPropertyName;                          // 0x0(0x8)
	struct FName                                                 RainOpacityPropertyName;                           // 0x8(0x8)
	class CurveFloat*                                            RadiusCurve;                                       // 0x10(0x8)
	class CurveFloat*                                            OuterRadiusCurve;                                  // 0x18(0x8)
	class CurveFloat*                                            RainSheetOuterOpacityCurve;                        // 0x20(0x8)
	class CurveFloat*                                            RainSheetInnerOpacityCurve;                        // 0x28(0x8)
	class CurveFloat*                                            BaseCloudHeightCurve;                              // 0x30(0x8)
	class CurveFloat*                                            BaseCloudMaskCurve;                                // 0x38(0x8)
	class CurveFloat*                                            RingCloudHeightCurve;                              // 0x40(0x8)
	class CurveFloat*                                            RingCloudMaskCurve;                                // 0x48(0x8)
	class CurveFloat*                                            TopCloudHeightCurve;                               // 0x50(0x8)
	class CurveFloat*                                            TopCloudMaskCurve;                                 // 0x58(0x8)
	class CurveFloat*                                            PressureZoneRadiusCurve;                           // 0x60(0x8)
	class CurveFloat*                                            PressureZoneTargetCurve;                           // 0x68(0x8)
	class CurveFloat*                                            PressureZonePushCurve;                             // 0x70(0x8)
	class CurveFloat*                                            PressureZoneWeightCurve;                           // 0x78(0x8)
	class CurveFloat*                                            RainStrengthCurve;                                 // 0x80(0x8)
	class CurveFloat*                                            WindStrengthCurve;                                 // 0x88(0x8)
	class CurveFloat*                                            WindInnerRadiusCurve;                              // 0x90(0x8)
	class CurveFloat*                                            WaterStrengthCurve;                                // 0x98(0x8)
	class CurveLinearColor*                                      RainSheetOuterScaleCurve;                          // 0xa0(0x8)
	class CurveLinearColor*                                      RainSheetInnerScaleCurve;                          // 0xa8(0x8)
	class CurveLinearColor*                                      BaseCloudScaleCurve;                               // 0xb0(0x8)
	class CurveLinearColor*                                      RingCloudScaleCurve;                               // 0xb8(0x8)
	class CurveLinearColor*                                      TopCloudScaleCurve;                                // 0xc0(0x8)
	float                                                        AngryWaterLerpRatio;                               // 0xc8(0x4)
	char                                                         pad0x4_LKJ6K[0x4];                                 // 0xcc(0x4)
};


// Size 0x10
struct NextOfferRequestModel
{
public:
	struct Guid                                                  OfferId;                                           // 0x0(0x10)
};


// Size 0x10
struct BootyItemShipOwnershipChangeEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	class ItemInfo*                                              ItemOnShip;                                        // 0x8(0x8)
};


// Size 0x1
struct VengeanceHealthEnabledEvent
{
public:
	char                                                         pad0x1_B9KVJ[0x1];                                 // 0x0(0x1)
};


// Size 0xc
struct EventProjectileWeaponFire
{
public:
	char                                                         pad0xc_UA4GX[0xc];                                 // 0x0(0xc)
};


// Size 0x10
struct RegisterCeremonyInterface
{
public:
	char                                                         pad0x10_184SC[0x10];                               // 0x0(0x10)
};


// Size 0x18
struct ReapersTributeShipCrewOwnershipChanged
{
public:
	class Actor*                                                 ReapersTributeShipActor;                           // 0x0(0x8)
	struct Guid                                                  ControllingCrewId;                                 // 0x8(0x10)
};


// Size 0x8
struct BlowpipeAmmoStruct
{
public:
	int                                                          DartType;                                          // 0x0(0x4)
	int                                                          AmmoCount;                                         // 0x4(0x4)
};


// Size 0xc
struct StartUpdatingConstellationVisibility
{
public:
	char                                                         pad0xc_V4NP0[0xc];                                 // 0x0(0xc)
};


// Size 0x10
struct EventSpawnComponentRequest
{
public:
	class SalvageItemSpawnComponent*                             SalvageItemSpawnComponent;                         // 0x0(0x8)
	int                                                          NumberOfLocationsRequested;                        // 0x8(0x4)
	char                                                         pad0x4_MPKLB[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct ItemStoredInChestEvent
{
public:
	class ItemInfo*                                              StoredItem;                                        // 0x0(0x8)
	class ItemInfo*                                              CollectorsChestStoredIn;                           // 0x8(0x8)
};


// Size 0x10
struct AllianceNotificationData
{
public:
	char                                                         NotificationType;                                  // 0x0(0x1)
	char                                                         pad0x7_40HN8[0x7];                                 // 0x1(0x7)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x8(0x8)
};


// Size 0x10
struct ArrivalTunnelOfTheDamnedPlayerState
{
public:
	class Character*                                             Character;                                         // 0x0(0x8)
	bool                                                         MigrationComplete;                                 // 0x8(0x1)
	char                                                         pad0x7_Z6XDC[0x7];                                 // 0x9(0x7)
};


// Size 0x1
struct EventHUDMouseCursorCentre
{
public:
	char                                                         pad0x1_I4RWO[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventVisibleWield
{
public:
	char                                                         pad0x1_CN58N[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventRequestMimicEnd
{
public:
	char                                                         pad0x1_ZDTFM[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct EventMovedByPortableHarpoonGrappleStart
{
public:
	char                                                         pad0x18_G18I3[0x18];                               // 0x0(0x18)
};


// Size 0x1
struct EventToggleCrewNameplates
{
public:
	char                                                         pad0x1_R7RZJ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct PirateProfilesQuickLinkTelemetryEvent
{
public:
	char                                                         pad0x1_B80PJ[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct PlayerGeneratedMapDisplayData
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	int                                                          IslandIndex;                                       // 0x10(0x4)
	int                                                          NumXs;                                             // 0x14(0x4)
	int                                                          MapCreatedByPlayerNameOverrideIndex;               // 0x18(0x4)
	struct Guid                                                  MapID;                                             // 0x1c(0x10)
	char                                                         pad0x4_HXPU8[0x4];                                 // 0x2c(0x4)
	struct FString                                               MapCreatedByPlayerName;                            // 0x30(0x10)
};


// Size 0x28
struct VoyageDiscardedTelemetryEvent
{
public:
	struct FString                                               VoyageRecipeAsset;                                 // 0x0(0x10)
	struct FString                                               CompanyId;                                         // 0x10(0x10)
	int                                                          VoyageRank;                                        // 0x20(0x4)
	char                                                         pad0x4_GV1PV[0x4];                                 // 0x24(0x4)
};


// Size 0x40
struct AthenaAnimationSkeletonFlee
{
public:
	class UClass*                                                UseWithObject;                                     // 0x0(0x8)
	TArray<class AnimSequence*>                                  FleeTurnLeft;                                      // 0x8(0x10)
	TArray<class AnimSequence*>                                  FleeTurnRight;                                     // 0x18(0x10)
	class BlendSpace*                                            FleeLocomotionBase;                                // 0x28(0x8)
	TArray<class BlendSpace*>                                    FleeLocomotionVariants;                            // 0x30(0x10)
};


// Size 0x1
struct EventPlayerViewUnderWaterStateChanged
{
public:
	bool                                                         NewUnderWaterState;                                // 0x0(0x1)
};


// Size 0x10
struct HitRegToggleReplicatedEvent
{
public:
	char                                                         pad0x10_70Y48[0x10];                               // 0x0(0x10)
};


// Size 0x10
struct StreamingTelemetryConfigurationSettings
{
public:
	int                                                          PercentageOfPlayersToSendTelemetryFromForHighLOD;  // 0x0(0x4)
	int                                                          PercentageOfPlayersToSendTelemetryFromForLowLOD;   // 0x4(0x4)
	int                                                          PercentageOfPlayersToSendVerboseTelemetryFromForHighLOD; // 0x8(0x4)
	int                                                          PercentageOfPlayersToSendVerboseTelemetryFromForLowLOD; // 0xc(0x4)
};


// Size 0x28
struct CampfireStateData
{
public:
	char                                                         pad0x20_G6ET8[0x20];                               // 0x0(0x20)
	bool                                                         IsBuilt;                                           // 0x20(0x1)
	bool                                                         IsOnFire;                                          // 0x21(0x1)
	bool                                                         IsPartiallyBurned;                                 // 0x22(0x1)
	char                                                         pad0x5_NPUGU[0x5];                                 // 0x23(0x5)
};


// Size 0x8
struct StandardRudderDynamicsParameters
{
public:
	float                                                        SteeringBoostMultiplier;                           // 0x0(0x4)
	float                                                        RudderBrakeAmplitude;                              // 0x4(0x4)
};


// Size 0x4
struct MastSailAngleBecameStationaryEvent
{
public:
	float                                                        Angle;                                             // 0x0(0x4)
};


// Size 0x58
struct ImpactDamageEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	class UClass*                                                DamagerType;                                       // 0x10(0x8)
	class Actor*                                                 DirectInstigator;                                  // 0x18(0x8)
	class Actor*                                                 RootInstigator;                                    // 0x20(0x8)
	struct Vector                                                Location;                                          // 0x28(0xc)
	struct Vector                                                SurfaceNormal;                                     // 0x34(0xc)
	struct Vector                                                Velocity;                                          // 0x40(0xc)
	float                                                        DamageAmount;                                      // 0x4c(0x4)
	int                                                          DamageSpread;                                      // 0x50(0x4)
	char                                                         Reason;                                            // 0x54(0x1)
	bool                                                         DealFriendlyFireDamage;                            // 0x55(0x1)
	char                                                         pad0x2_ZFUGK[0x2];                                 // 0x56(0x2)
};


// Size 0x50
struct ServerTenancyTelemetryFragment
{
public:
	struct FString                                               VmId;                                              // 0x0(0x10)
	struct FString                                               InstanceId;                                        // 0x10(0x10)
	struct FString                                               ClusterId;                                         // 0x20(0x10)
	struct FString                                               GsiId;                                             // 0x30(0x10)
	struct FString                                               ProcessorType;                                     // 0x40(0x10)
};


// Size 0x14
struct PurchaseRequestFailedResponse
{
public:
	struct Guid                                                  TransactionId;                                     // 0x0(0x10)
	char                                                         Reason;                                            // 0x10(0x1)
	char                                                         pad0x3_H07GT[0x3];                                 // 0x11(0x3)
};


// Size 0x1
struct ClaimTraderPromotionEvent
{
public:
	char                                                         pad0x1_FQOCQ[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct FrontendChatGetMessageResponse
{
public:
	struct FString                                               MessageText;                                       // 0x0(0x10)
	struct FString                                               SenderId;                                          // 0x10(0x10)
	struct DateTime                                              TimeUtc;                                           // 0x20(0x8)
};


// Size 0x48
struct CrewServerRequestMessage
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct FString                                               PirateId;                                          // 0x10(0x10)
	struct FString                                               BuildId;                                           // 0x20(0x10)
	bool                                                         JoinInProgress;                                    // 0x30(0x1)
	char                                                         SessionType;                                       // 0x31(0x1)
	char                                                         pad0x6_MYK2A[0x6];                                 // 0x32(0x6)
	TArray<String>                                               ServerLocations;                                   // 0x38(0x10)
};


// Size 0x4
struct WheelArmIKBoolSets
{
public:
	bool                                                         LeftIKOn;                                          // 0x0(0x1)
	bool                                                         RightIKOn;                                         // 0x1(0x1)
	bool                                                         LeftArmDown;                                       // 0x2(0x1)
	bool                                                         RightArmDown;                                      // 0x3(0x1)
};


// Size 0x18
struct IntentPredictorParams
{
public:
	float                                                        MaxError;                                          // 0x0(0x4)
	float                                                        MinError;                                          // 0x4(0x4)
	float                                                        MinCorrectionVelocity;                             // 0x8(0x4)
	float                                                        MinValue;                                          // 0xc(0x4)
	float                                                        MaxValue;                                          // 0x10(0x4)
	bool                                                         WrapCorrectionToValueRange;                        // 0x14(0x1)
	char                                                         pad0x3_T6N10[0x3];                                 // 0x15(0x3)
};


// Size 0x1
struct VoyageInventoryUpdatedEvent
{
public:
	char                                                         pad0x1_V80FN[0x1];                                 // 0x0(0x1)
};


// Size 0x58
struct EndedHangingTelemetry
{
public:
	double                                                       TimeSpentHangingFromPoint;                         // 0x0(0x8)
	float                                                        DistanceTravelledWhileHanging;                     // 0x8(0x4)
	char                                                         pad0x4_G9NH0[0x4];                                 // 0xc(0x4)
	struct FString                                               HangingComponentOwner;                             // 0x10(0x10)
	struct FString                                               HangingComponentName;                              // 0x20(0x10)
	bool                                                         IsPlayerOnOwnShip;                                 // 0x30(0x1)
	char                                                         pad0x3_BUJ8Z[0x3];                                 // 0x31(0x3)
	struct Guid                                                  ShipId;                                            // 0x34(0x10)
	struct Guid                                                  HangingId;                                         // 0x44(0x10)
	char                                                         pad0x4_LIDSH[0x4];                                 // 0x54(0x4)
};


// Size 0x10
struct MermaidSpawnedTelemetryEvent
{
public:
	int                                                          MermaidId;                                         // 0x0(0x4)
	struct Vector                                                MermaidPosition;                                   // 0x4(0xc)
};


// Size 0x8
struct SetPresenceConnectionStringResponseModel
{
public:
	struct Timespan                                              ResetAfter;                                        // 0x0(0x8)
};


// Size 0x1
struct EnableDefaultStormsGameServerRequestModel
{
public:
	bool                                                         Enable;                                            // 0x0(0x1)
};


// Size 0x18
struct SeasonTierInfo
{
public:
	int                                                          Number;                                            // 0x0(0x4)
	char                                                         pad0x4_KD7KC[0x4];                                 // 0x4(0x4)
	struct FString                                               LocalizedTitle;                                    // 0x8(0x10)
};


// Size 0x1
struct PlayerLeftPremiumStoreEvent
{
public:
	char                                                         pad0x1_QD0S0[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventCapstanStoppedMoving
{
public:
	char                                                         pad0x1_U6QKJ[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct ProjectileWeaponFireInaccuracySeedMismatchTelemetryEvent
{
public:
	struct Guid                                                  TelemetryAttackId;                                 // 0x0(0x10)
	int                                                          ClientSeed;                                        // 0x10(0x4)
	int                                                          ServerSeed;                                        // 0x14(0x4)
};


// Size 0x20
struct CrewSizeToCloseDelayDurationInfo
{
public:
	TArray<class Class*>                                         VaultKeyDescs;                                     // 0x0(0x10)
	TArray<float>                                                CrewSizeToCloseDelayDuration;                      // 0x10(0x10)
};


// Size 0x10
struct EventMastSailsBillowed
{
public:
	char                                                         MastType;                                          // 0x0(0x1)
	char                                                         pad0x7_UTPZW[0x7];                                 // 0x1(0x7)
	class Actor*                                                 ParentShip;                                        // 0x8(0x8)
};


// Size 0x8
struct EventPlayerCapstanUsageEnd
{
public:
	class Actor*                                                 ObjectBeingUsed;                                   // 0x0(0x8)
};


// Size 0x28
struct HitDetectionParamsOverride
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x0(0xc)
	float                                                        HitStartRange;                                     // 0xc(0x4)
	float                                                        HitEndRange;                                       // 0x10(0x4)
	float                                                        HitStartAngle;                                     // 0x14(0x4)
	float                                                        HitAngleDelta;                                     // 0x18(0x4)
	float                                                        HitSphereRadius;                                   // 0x1c(0x4)
	float                                                        HitTimeOffset;                                     // 0x20(0x4)
	float                                                        HitDuration;                                       // 0x24(0x4)
};


// Size 0x8
struct EntitlementMapRedirectorFailedEvent
{
public:
	struct FName                                                 DeprecatedEntitlementId;                           // 0x0(0x8)
};


// Size 0x30
struct WalletTransactionRequestRemoteServiceResult
{
public:
	char                                                         pad0x30_B648C[0x30];                               // 0x0(0x30)
};


// Size 0x28
struct SeaFortKeyPickedUpNetworkEvent
{
public:
	char                                                         pad0x18_4AOG8[0x18];                               // 0x0(0x18)
	class PopUpMessageDesc*                                      KeyDiscoveredPopUpDesc;                            // 0x18(0x8)
	class PopUpMessageDesc*                                      KeyHandInHintPopUpDesc;                            // 0x20(0x8)
};


// Size 0x10
struct EventSendCapturedKeybind
{
public:
	struct FString                                               CapturedKey;                                       // 0x0(0x10)
};


// Size 0x18
struct ItemMetaBase
{
public:
	char                                                         pad0x8_RDQB8[0x8];                                 // 0x0(0x8)
	struct StringAssetReference                                  StoredStructType;                                  // 0x8(0x10)
};


// Size 0x24
struct AggressiveGhostShipEncounterEndTelemetryEvent
{
public:
	struct Guid                                                  EncounterId;                                       // 0x0(0x10)
	bool                                                         WasSuccessfullyCompleted;                          // 0x10(0x1)
	char                                                         pad0x3_G2AFE[0x3];                                 // 0x11(0x3)
	struct Guid                                                  OptionalEventId;                                   // 0x14(0x10)
};


// Size 0x18
struct ItemInfoTogglePair
{
public:
	struct FName                                                 Toggle;                                            // 0x0(0x8)
	struct StringClassReference                                  ItemInfo;                                          // 0x8(0x10)
};


// Size 0x1
struct PlayerBlockingBlockPlayersResponse
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
};


// Size 0x8
struct PetChestUnequipPetEvent
{
public:
	class UClass*                                                Desc;                                              // 0x0(0x8)
};


// Size 0x8
struct TrinketMechanismPuzzleResetTelemetryEvent
{
public:
	float                                                        TimeToResetInSeconds;                              // 0x0(0x4)
	bool                                                         WasPuzzleCompleted;                                // 0x4(0x1)
	char                                                         pad0x3_FHBCG[0x3];                                 // 0x5(0x3)
};


// Size 0x1
struct CrewMemberLeftTunnelOfTheDamnedTelemetryEvent
{
public:
	char                                                         pad0x1_F1RJO[0x1];                                 // 0x0(0x1)
};


// Size 0x14
struct CrewCompletedEmergentVoyageEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x10(0x1)
	char                                                         pad0x3_HJB8K[0x3];                                 // 0x11(0x3)
};


// Size 0x1
struct ClaimTraderPromotionSucceededEvent
{
public:
	char                                                         pad0x1_HMPBH[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct SetNarrateToasts
{
public:
	bool                                                         IsEnabled;                                         // 0x0(0x1)
};


// Size 0x38
struct GhostShipRewardData
{
public:
	class WeightedItemDescSpawnDataAsset*                        Rewards;                                           // 0x0(0x8)
	struct WeightedProbabilityRange                              NumberOfItemsToSpawn;                              // 0x8(0x20)
	TArray<struct Transform>                                     SpawnTransforms;                                   // 0x28(0x10)
};


// Size 0x4
struct CompanyLevelDataTable
{
public:
	int                                                          XpRequiredForLevel;                                // 0x0(0x4)
};


// Size 0x1
struct ItemLoadoutSlotsUpdatedEvent
{
public:
	char                                                         pad0x1_UWTZ1[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct FulfillTunnelDeferredPrimaryVoyageCancellationRequest
{
public:
	char                                                         pad0x10_M8HPN[0x10];                               // 0x0(0x10)
};


// Size 0x48
struct HiddenActionStateConstructionInfo
{
public:
	char                                                         pad0x48_XF39S[0x48];                               // 0x0(0x48)
};


// Size 0x10
struct AthenaItemsSettingsProjectileCollisionChannelOverride
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	char                                                         ProjectileCollisionChannel;                        // 0x8(0x1)
	char                                                         pad0x7_EWHJ3[0x7];                                 // 0x9(0x7)
};


// Size 0x10
struct ReapersTributeShipHandInVotesCancelledEvent
{
public:
	TArray<class PlayerState*>                                   OldVoters;                                         // 0x0(0x10)
};


// Size 0x1
struct TutorialResetMysteriousStrangersEvent
{
public:
	char                                                         pad0x1_6RKVG[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct CreativeCrewMember
{
public:
	int                                                          CrewId;                                            // 0x0(0x4)
	char                                                         pad0x4_NNERL[0x4];                                 // 0x4(0x4)
	struct FString                                               Gamertag;                                          // 0x8(0x10)
	struct FString                                               Xuid;                                              // 0x18(0x10)
	char                                                         Platform;                                          // 0x28(0x1)
	char                                                         pad0x7_H2QX8[0x7];                                 // 0x29(0x7)
};


// Size 0x10
struct PlayerModerationReportReason
{
public:
	struct FString                                               Type;                                              // 0x0(0x10)
};


// Size 0x20
struct LoadoutSubstitution
{
public:
	struct StringAssetReference                                  LoadoutToSubstituteOut;                            // 0x0(0x10)
	TArray<struct StringAssetReference>                          LoadoutsToSubstituteIn;                            // 0x10(0x10)
};


// Size 0x68
struct ShopOfferPrerequisites
{
public:
	TArray<String>                                               Entitlements;                                      // 0x0(0x10)
	char                                                         pad0x58_XG661[0x58];                               // 0x10(0x58)
};


// Size 0x18
struct ContestRequestScoreBoardData
{
public:
	char                                                         pad0x18_CZ5SY[0x18];                               // 0x0(0x18)
};


// Size 0x38
struct WorldEventCommandActivateWorldEvent
{
public:
	char                                                         pad0x28_3TIXI[0x28];                               // 0x0(0x28)
	class UClass*                                                EventType;                                         // 0x28(0x8)
	struct FName                                                 TargetIslandName;                                  // 0x30(0x8)
};


// Size 0x48
struct AthenaAnimationHitReactsSelectedAnimations
{
public:
	class BlendSpace1D*                                          SelectedHitReact0;                                 // 0x0(0x8)
	class BlendSpace1D*                                          SelectedHitReactItem0;                             // 0x8(0x8)
	class BlendSpace1D*                                          SelectedHitReactItemAction0;                       // 0x10(0x8)
	class BlendSpace1D*                                          SelectedHitReactSubtle0;                           // 0x18(0x8)
	class BlendSpace1D*                                          SelectedHitReact1;                                 // 0x20(0x8)
	class BlendSpace1D*                                          SelectedHitReactItem1;                             // 0x28(0x8)
	class BlendSpace1D*                                          SelectedHitReactItemAction1;                       // 0x30(0x8)
	class BlendSpace1D*                                          SelectedHitReactSubtle1;                           // 0x38(0x8)
	class BlendSpace1D*                                          SelectedOverrideHitReact;                          // 0x40(0x8)
};


// Size 0x20
struct ServerCameraFadeCompleteAckNetworkEvent
{
public:
	char                                                         pad0x18_TI46R[0x18];                               // 0x0(0x18)
	char                                                         Reason;                                            // 0x18(0x1)
	char                                                         pad0x7_UGOKM[0x7];                                 // 0x19(0x7)
};


// Size 0x40
struct HitRegCapsuleTargetData
{
public:
	int                                                          CapsuleOwnerId;                                    // 0x0(0x4)
	char                                                         pad0x4_WBMQC[0x4];                                 // 0x4(0x4)
	struct FString                                               OwnerName;                                         // 0x8(0x10)
	struct Vector                                                Center;                                            // 0x18(0xc)
	float                                                        HalfHeight;                                        // 0x24(0x4)
	float                                                        Radius;                                            // 0x28(0x4)
	char                                                         pad0x4_ROEOI[0x4];                                 // 0x2c(0x4)
	struct Quat                                                  Rotation;                                          // 0x30(0x10)
};


// Size 0x10
struct ActionSequenceInteractableInteractionStateData
{
public:
	int                                                          InteractCount;                                     // 0x0(0x4)
	char                                                         InteractionState;                                  // 0x4(0x1)
	char                                                         pad0x3_4Z2XL[0x3];                                 // 0x5(0x3)
	double                                                       LastInteractionTimestamp;                          // 0x8(0x8)
};


// Size 0x20
struct FortStartedTelemetryEvent
{
public:
	struct Guid                                                  FortId;                                            // 0x0(0x10)
	struct FName                                                 FortIsland;                                        // 0x10(0x8)
	struct FName                                                 FortType;                                          // 0x18(0x8)
};


// Size 0x10
struct UIWhatsNewAvailableArticlesTelemetryEvent
{
public:
	TArray<String>                                               Articles;                                          // 0x0(0x10)
};


// Size 0x10
struct ShroudBreakerDeactivateEffectsEvent
{
public:
	struct Guid                                                  ShroudBreakerId;                                   // 0x0(0x10)
};


// Size 0x8
struct EventSpawnLocationDestroyed
{
public:
	class SpawnLocation*                                         SpawnLocation;                                     // 0x0(0x8)
};


// Size 0x20
struct RequestClientFire
{
public:
	class Object*                                                RequestingObject;                                  // 0x0(0x8)
	char                                                         pad0x18_P0MJ9[0x18];                               // 0x8(0x18)
};


// Size 0x8
struct CutsceneResponseResult
{
public:
	char                                                         pad0x8_XZKXO[0x8];                                 // 0x0(0x8)
};


// Size 0x60
struct RemoveSpearActionStateConstructionInfo
{
public:
	char                                                         pad0x48_E054C[0x48];                               // 0x0(0x48)
	struct NetSubObjectPtr                                       RepairableObject;                                  // 0x48(0x14)
	char                                                         pad0x4_HTETL[0x4];                                 // 0x5c(0x4)
};


// Size 0x1
struct CrewPlayerLeftTelemetryEvent
{
public:
	char                                                         pad0x1_V9HVH[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct GameEventServiceDesc
{
public:
	struct StringAssetReference                                  ServiceParamsAssetPath;                            // 0x0(0x10)
	struct StringAssetReference                                  GameEventOnDemandAvailabilityParamsAsset;          // 0x10(0x10)
};


// Size 0x98
struct HttpClientComponentRequestEvent
{
public:
	struct FString                                               Uri;                                               // 0x0(0x10)
	struct FString                                               Body;                                              // 0x10(0x10)
	bool                                                         ShouldEncrypt;                                     // 0x20(0x1)
	bool                                                         ShouldAuthorize;                                   // 0x21(0x1)
	char                                                         pad0x6_79KCS[0x6];                                 // 0x22(0x6)
	struct FString                                               Method;                                            // 0x28(0x10)
	struct FString                                               Id;                                                // 0x88(0x10)
};


// Size 0xc
struct EventCompanyPromotionClaimed
{
public:
	char                                                         pad0xc_QJVQT[0xc];                                 // 0x0(0xc)
};


// Size 0x1
struct FriendsListRequest
{
public:
	char                                                         pad0x1_F114U[0x1];                                 // 0x0(0x1)
};


// Size 0x80
struct MovedByPortableHarpoonRetractionActionStateConstructionInfo
{
public:
	char                                                         pad0x80_5IK1G[0x80];                               // 0x0(0x80)
};


// Size 0x20
struct LockUnlockedTelemetryEvent
{
public:
	struct FString                                               LockName;                                          // 0x0(0x10)
	struct FString                                               IslandName;                                        // 0x10(0x10)
};


// Size 0x60
struct VoyageCompleteAnimationEvent
{
public:
	struct FText                                                 VoyageTitle;                                       // 0x0(0x38)
	struct FString                                               AudioSwitchName;                                   // 0x38(0x10)
	struct FString                                               AudioSwitchValue;                                  // 0x48(0x10)
	struct FName                                                 CompanyId;                                         // 0x58(0x8)
};


// Size 0x10
struct RequestJoinSessionEvent
{
public:
	struct FString                                               SessionCode;                                       // 0x0(0x10)
};


// Size 0x10
struct PlayerArriveLocationTelemetryEvent
{
public:
	struct FString                                               LocationName;                                      // 0x0(0x10)
};


// Size 0x8
struct VoyageAvailableForCancel
{
public:
	class VoyageProposalDesc*                                    ProposalDesc;                                      // 0x0(0x8)
};


// Size 0x58
struct CappedItemsByGroup
{
public:
	char                                                         pad0x58_BZ3KK[0x58];                               // 0x0(0x58)
};


// Size 0x30
struct ShipAnnouncementLoadoutUpdatedEventRpc
{
public:
	char                                                         pad0x18_31FOB[0x18];                               // 0x0(0x18)
	class Controller*                                            Controller;                                        // 0x18(0x8)
	struct Guid                                                  ShipGuid;                                          // 0x20(0x10)
};


// Size 0x1
struct EventPlayerExitedHangingState
{
public:
	char                                                         pad0x1_16SMO[0x1];                                 // 0x0(0x1)
};


// Size 0xa0
struct WieldableBookNamedWidgetText
{
public:
	char                                                         pad0x80_THW18[0x80];                               // 0x0(0x80)
	struct FName                                                 TextKey;                                           // 0x80(0x8)
	char                                                         WidgetVisibilityGroup;                             // 0x88(0x1)
	char                                                         pad0x3_QRDNK[0x3];                                 // 0x89(0x3)
	struct LinearColor                                           TextColour;                                        // 0x8c(0x10)
	char                                                         BlendType;                                         // 0x9c(0x1)
	char                                                         pad0x3_JQG1A[0x3];                                 // 0x9d(0x3)
};


// Size 0x10
struct AISpawnActionStateParams
{
public:
	float                                                        SpawnTimeMax;                                      // 0x0(0x4)
	bool                                                         BeginInvis;                                        // 0x4(0x1)
	char                                                         pad0x3_MRFKT[0x3];                                 // 0x5(0x3)
	float                                                        InvisTime;                                         // 0x8(0x4)
	bool                                                         SkipAnimTimeCheck;                                 // 0xc(0x1)
	char                                                         pad0x3_K8G89[0x3];                                 // 0xd(0x3)
};


// Size 0x30
struct QuestVariableContestIslandArchetype
{
public:
	char                                                         pad0x30_RC2PF[0x30];                               // 0x0(0x30)
};


// Size 0x8
struct UpdateSnapshotVersionData
{
public:
	struct FName                                                 Version;                                           // 0x0(0x8)
};


// Size 0x10
struct WieldableItemEntitlementNotFoundTelemetryEvent
{
public:
	struct FString                                               ItemClassName;                                     // 0x0(0x10)
};


// Size 0x38
struct ScoreboardItems
{
public:
	struct FString                                               Icon;                                              // 0x0(0x10)
	struct FString                                               CrewName;                                          // 0x10(0x10)
	struct FString                                               Score;                                             // 0x20(0x10)
	bool                                                         IsMyCrew;                                          // 0x30(0x1)
	char                                                         pad0x7_302FD[0x7];                                 // 0x31(0x7)
};


// Size 0x20
struct IslandMaterialZoneStatusMapping
{
public:
	class PhysicalMaterial*                                      SurfaceMaterial;                                   // 0x0(0x8)
	bool                                                         ActivateOnStart;                                   // 0x8(0x1)
	char                                                         pad0x7_BXRTU[0x7];                                 // 0x9(0x7)
	TArray<struct Status>                                        Status;                                            // 0x10(0x10)
};


// Size 0x18
struct WeightedItemDescSpawnDataAssetWithWeight
{
public:
	class WeightedItemDescSpawnDataAsset*                        WeightedItemSpawnDataAsset;                        // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	bool                                                         GuaranteeSpawn;                                    // 0xc(0x1)
	bool                                                         LimitMaxSpawnedItems;                              // 0xd(0x1)
	char                                                         pad0x2_GD8WQ[0x2];                                 // 0xe(0x2)
	int                                                          MaxTimesCanBeSelected;                             // 0x10(0x4)
	char                                                         pad0x4_4ZFP8[0x4];                                 // 0x14(0x4)
};


// Size 0x1
struct PurchasePremiumShopOfferFailedEvent
{
public:
	char                                                         pad0x1_0AEQZ[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct ControlObjectActionRuleParams
{
public:
	TArray<char>                                                 WieldableItemSizesToDisableControl;                // 0x0(0x10)
};


// Size 0x10
struct EventAIUseAlternateLocomotionSet
{
public:
	bool                                                         UseAlternateLocomotionSet;                         // 0x0(0x1)
	char                                                         pad0x7_NDWV7[0x7];                                 // 0x1(0x7)
	class UClass*                                                WieldedItemAnimationStoreId;                       // 0x8(0x8)
};


// Size 0x30
struct WorldSettingsCommandSpawnFog
{
public:
	char                                                         pad0x28_F7RTO[0x28];                               // 0x0(0x28)
	struct FName                                                 TargetIsland;                                      // 0x28(0x8)
};


// Size 0x8
struct NPCOnSurfaceFloodedLevel
{
public:
	float                                                        NormalisedWaterLevel;                              // 0x0(0x4)
	char                                                         FloodedLevel;                                      // 0x4(0x1)
	char                                                         pad0x3_R9E49[0x3];                                 // 0x5(0x3)
};


// Size 0x10
struct InventoryInteractionStowRequestEvent
{
public:
	struct FString                                               ItemDesc;                                          // 0x0(0x10)
};


// Size 0x1
struct RiddleQuestGateCompletedEvent
{
public:
	char                                                         pad0x1_UGS8D[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct SwingDoorOpenedEvent
{
public:
	char                                                         pad0x1_2AVIR[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct PlayerHeroStatUpdatedTelemetryEvent
{
public:
	struct FString                                               Result;                                            // 0x0(0x10)
	char                                                         pad0x8_X75Q0[0x8];                                 // 0x10(0x8)
};


// Size 0x10
struct CheckCanPlayerJoinGuildResponseModel
{
public:
	TArray<String>                                               ReasonsWhyPirateCannotJoinGuild;                   // 0x0(0x10)
};


// Size 0x10
struct TutorialAnimationResult
{
public:
	char                                                         pad0x8_XUULI[0x8];                                 // 0x0(0x8)
	class FirstPersonAnimationInstance*                          AnimInstance;                                      // 0x8(0x8)
};


// Size 0x10
struct ClueSiteTypeToMarkId
{
public:
	class UClass*                                                ClueSiteType;                                      // 0x0(0x8)
	class UClass*                                                MapMarkId;                                         // 0x8(0x8)
};


// Size 0x8
struct BuoyancyComponentExclusionParams
{
public:
	float                                                        MaxDistanceCheck;                                  // 0x0(0x4)
	char                                                         HitsChannel;                                       // 0x4(0x1)
	char                                                         pad0x3_IDSDC[0x3];                                 // 0x5(0x3)
};


// Size 0x1
struct EventLoadItemActionStateEnded
{
public:
	char                                                         pad0x1_0DRVH[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct SessionManagementCommandKickPlayer
{
public:
	char                                                         pad0x28_ANCX5[0x28];                               // 0x0(0x28)
	class PlayerState*                                           PlayerState;                                       // 0x28(0x8)
};


// Size 0x1
struct ShowRejoinModalEvent
{
public:
	char                                                         pad0x1_XO0XW[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct ActionStateHistoryTelemetryFragment
{
public:
	struct JsonObjectWrapper                                     Json;                                              // 0x0(0x18)
};


// Size 0x18
struct PlayerMilestoneUnlockTelemetryEvent
{
public:
	struct FString                                               MilestoneName;                                     // 0x0(0x10)
	char                                                         pad0x8_5HGZT[0x8];                                 // 0x10(0x8)
};


// Size 0x20
struct FortTogglerUnit
{
public:
	char                                                         pad0x8_FEJ9U[0x8];                                 // 0x0(0x8)
	class AIProximityPlayerTracker*                              AIProxPlayerTracker;                               // 0x8(0x8)
	TArray<class AISpawner*>                                     AISpawners;                                        // 0x10(0x10)
};


// Size 0x4
struct MastFallenAngleChangedEvent
{
public:
	float                                                        Angle;                                             // 0x0(0x4)
};


// Size 0x10
struct MultiShopResponsePerNPCEntry
{
public:
	struct FName                                                 NPCName;                                           // 0x0(0x8)
	class ShopDesc*                                              ShopDesc;                                          // 0x8(0x8)
};


// Size 0x8
struct ClientPlayerEmblemUnlockTelemetryEvent
{
public:
	struct FName                                                 EmblemName;                                        // 0x0(0x8)
};


// Size 0x10
struct PopupQueueFinished
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
};


// Size 0x10
struct PlayerNewDistinctionLevelEvent
{
public:
	char                                                         pad0x8_AX8TR[0x8];                                 // 0x0(0x8)
	struct FName                                                 CompanyId;                                         // 0x8(0x8)
};


// Size 0x30
struct ServerAutoDormancyTelemetryFragment
{
public:
	struct AutoDormancyTelemetry                                 Data;                                              // 0x0(0x1c)
	char                                                         pad0x4_LTYVY[0x4];                                 // 0x1c(0x4)
	struct AutoDormancyErrorTelemetry                            ErrorData;                                         // 0x20(0x10)
};


// Size 0x1
struct OnHandleForwardMovementStarted
{
public:
	char                                                         pad0x1_JTPRC[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct PirateProfiles_RequestUpdatePreviewEvent
{
public:
	struct FString                                               PirateProfileId;                                   // 0x0(0x10)
};


// Size 0x20
struct KrakenAnimatedTentacleCollisionSegment
{
public:
	int                                                          BottomBoneIndex;                                   // 0x0(0x4)
	int                                                          TopBoneIndex;                                      // 0x4(0x4)
	float                                                        BoneLocationAlpha;                                 // 0x8(0x4)
	float                                                        CapsuleRadius;                                     // 0xc(0x4)
	float                                                        CapsuleHalfHeight;                                 // 0x10(0x4)
	char                                                         pad0x4_Q54FF[0x4];                                 // 0x14(0x4)
	class CapsuleComponent*                                      Capsule;                                           // 0x18(0x8)
};


// Size 0x20
struct UseItemOnServerRpc
{
public:
	char                                                         pad0x18_JO33F[0x18];                               // 0x0(0x18)
	class WieldableItem*                                         Item;                                              // 0x18(0x8)
};


// Size 0x10
struct CustomScoreOnPlayerRevivedEvent
{
public:
	class Actor*                                                 Instigator;                                        // 0x0(0x8)
	class Actor*                                                 Receiver;                                          // 0x8(0x8)
};


// Size 0x20
struct ThemeImage
{
public:
	struct FString                                               R1080p;                                            // 0x0(0x10)
	struct FString                                               R4k;                                               // 0x10(0x10)
};


// Size 0x48
struct UIPremiumStorePageTransitionEvent
{
public:
	struct FString                                               CurrentPage;                                       // 0x0(0x10)
	struct FString                                               PreviousHighlight;                                 // 0x10(0x10)
	struct FString                                               PreviousPage;                                      // 0x20(0x10)
	struct FString                                               SessionId;                                         // 0x30(0x10)
	float                                                        TimeOnPreviousPage;                                // 0x40(0x4)
	char                                                         pad0x4_04UYY[0x4];                                 // 0x44(0x4)
};


// Size 0x10
struct PlayerGuildUpdatedEvent
{
public:
	char                                                         pad0x10_4CTU3[0x10];                               // 0x0(0x10)
};


// Size 0x1
struct PirateProfilesThemesErrorToUI
{
public:
	char                                                         pad0x1_NW7DP[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct TunnelOfTheDamnedMigrationFailed
{
public:
	char                                                         pad0x10_4SBI8[0x10];                               // 0x0(0x10)
};


// Size 0x118
struct ProjectileWeaponHitScanShotTelemetryEvent
{
public:
	struct Guid                                                  TelemetryAttackId;                                 // 0x0(0x10)
	double                                                       ClientSentTimeStamp;                               // 0x10(0x8)
	double                                                       ServerTimeStamp;                                   // 0x18(0x8)
	double                                                       DifferenceInTimeStamps;                            // 0x20(0x8)
	struct FString                                               ClientHitActorTypeName;                            // 0x28(0x10)
	struct FString                                               ClientHitActorSpecificClassName;                   // 0x38(0x10)
	struct FString                                               ServerHitActorTypeName;                            // 0x48(0x10)
	struct FString                                               ServerHitActorSpecificClassName;                   // 0x58(0x10)
	struct FString                                               ShipShooterIsStandingOn;                           // 0x68(0x10)
	struct FString                                               ShipTargetIsStandingOn;                            // 0x78(0x10)
	float                                                        SpeedOfShipShooterIsOn;                            // 0x88(0x4)
	float                                                        SpeedOfShooter;                                    // 0x8c(0x4)
	float                                                        SpeedOfHitActor;                                   // 0x90(0x4)
	float                                                        ShooterLatencyMs;                                  // 0x94(0x4)
	float                                                        HitActorLatencyMs;                                 // 0x98(0x4)
	struct Vector                                                ClientAimPosition;                                 // 0x9c(0xc)
	struct Vector                                                ClientAimDirection;                                // 0xa8(0xc)
	struct Vector                                                ServerAimPosition;                                 // 0xb4(0xc)
	struct Vector                                                ServerAimDirection;                                // 0xc0(0xc)
	bool                                                         IsShooterOnLand;                                   // 0xcc(0x1)
	bool                                                         IsServerHitActorOnLand;                            // 0xcd(0x1)
	bool                                                         IsClientHitActorOnLand;                            // 0xce(0x1)
	char                                                         pad0x1_XGLKO[0x1];                                 // 0xcf(0x1)
	float                                                        ClientHitDistance;                                 // 0xd0(0x4)
	float                                                        ServerHitDistance;                                 // 0xd4(0x4)
	float                                                        ClientHitCapsuleCoreOffsetInViewPlane;             // 0xd8(0x4)
	float                                                        DistanceBetweenClientCapsuleAndRewoundCapsule;     // 0xdc(0x4)
	float                                                        AngleBetweenClientCapsuleAndRewoundCapsule;        // 0xe0(0x4)
	float                                                        TimeStampModifier;                                 // 0xe4(0x4)
	bool                                                         IsUseTimeServiceEverywhereFeatureEnabled;          // 0xe8(0x1)
	bool                                                         IsBelieveClientMissesFeatureEnabled;               // 0xe9(0x1)
	bool                                                         IsDisableRewindTimeStampModifierFeatureEnabled;    // 0xea(0x1)
	bool                                                         IsPlayerControllerTicksAfterTimeServiceFeatureEnabled; // 0xeb(0x1)
	bool                                                         IsFixInaccuracySeedMismatchFeatureEnabled;         // 0xec(0x1)
	bool                                                         IsOverrideCharacterInterpolationDistanceWhenAimingFeatureEnabled; // 0xed(0x1)
	bool                                                         IsCharacterMovementOrientProjectileHitVolumeWhenInterpolatingEnabled; // 0xee(0x1)
	bool                                                         IsEvaluateAngleWhenDeterminingWhetherToInterpolateEnabled; // 0xef(0x1)
	bool                                                         IsProjectileFixedTimestepFeatureEnabled;           // 0xf0(0x1)
	bool                                                         IsShipNewTimeServiceEnabled;                       // 0xf1(0x1)
	bool                                                         IsResetTimeServiceBuffersEnabled;                  // 0xf2(0x1)
	bool                                                         IsTickProjectileServiceAfterCharacterMovementOnClientFeatureEnabled; // 0xf3(0x1)
	char                                                         pad0x4_ST9WN[0x4];                                 // 0xf4(0x4)
	struct FString                                               DamagerType;                                       // 0xf8(0x10)
	bool                                                         HasInaccuracySeedMismatch;                         // 0x108(0x1)
	bool                                                         SceneRewindSucceeded;                              // 0x109(0x1)
	bool                                                         ServerAndClientAgreedFirstTime_Unimportant;        // 0x10a(0x1)
	bool                                                         ServerAndClientAgreedFirstTime_Important;          // 0x10b(0x1)
	bool                                                         ServerAndClientDisagreedFirstTime_Unimportant;     // 0x10c(0x1)
	bool                                                         ServerAndClientDisagreedFirstTime_Important_NoCorrectionAttempted; // 0x10d(0x1)
	bool                                                         ServerAndClientDisagreedFirstTime_Important_ClientMissBelieved; // 0x10e(0x1)
	bool                                                         ServerAndClientDisagreedFirstTime_Important_RewindEstimation_Corrected; // 0x10f(0x1)
	bool                                                         ServerAndClientDisagreedFirstTime_Important_RewindEstimation_StillDisagrees; // 0x110(0x1)
	char                                                         pad0x7_G26L0[0x7];                                 // 0x111(0x7)
};


// Size 0x1
struct EventDropDownFromHangingState
{
public:
	char                                                         pad0x1_D95Q6[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct ItemConsumptionStatusChanceEntry
{
public:
	float                                                        Chance;                                            // 0x0(0x4)
	char                                                         pad0x4_56D72[0x4];                                 // 0x4(0x4)
	struct Status                                                Status;                                            // 0x8(0x20)
};


// Size 0x98
struct SkeletonLordInfo
{
public:
	struct FText                                                 DisplayName;                                       // 0x0(0x38)
	class UClass*                                                ClassId;                                           // 0x38(0x8)
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x40(0x8)
	class AthenaAIControllerParamsDataAsset*                     Skillset;                                          // 0x48(0x8)
	class LoadoutAsset*                                          Loadout;                                           // 0x70(0x8)
	class Texture*                                               MugShot;                                           // 0x78(0x8)
	class BountyMapLayout*                                       Layout;                                            // 0x80(0x8)
	TArray<struct Text>                                          BountyMapDescriptions;                             // 0x88(0x10)
};


// Size 0x1
struct PirateRerollEvent_CancelRerollRequest
{
public:
	char                                                         pad0x1_W4CNL[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct MeshMemoryConstraintRegistrationDelayedTelemetryEvent
{
public:
	char                                                         pad0x38_LW96H[0x38];                               // 0x0(0x38)
};


// Size 0x1
struct EventAnimationWieldedItemBlockingFeedbackFinished
{
public:
	char                                                         pad0x1_QR67P[0x1];                                 // 0x0(0x1)
};


// Size 0x50
struct EventArmourHealthChanged
{
public:
	char                                                         pad0x48_NVDEL[0x48];                               // 0x0(0x48)
	bool                                                         ArmourDestroyed;                                   // 0x48(0x1)
	char                                                         pad0x7_4HT5F[0x7];                                 // 0x49(0x7)
};


// Size 0x28
struct ClientBootFlowLocStateLocRetrievalTelemetryEvent
{
public:
	struct FString                                               Culture;                                           // 0x0(0x10)
	bool                                                         Success;                                           // 0x10(0x1)
	char                                                         pad0x7_IYIYJ[0x7];                                 // 0x11(0x7)
	struct FString                                               Reason;                                            // 0x18(0x10)
};


// Size 0x8
struct NewCaptaincyCustomisationEquipped
{
public:
	class UClass*                                                Desc;                                              // 0x0(0x8)
};


// Size 0x2
struct BucketRegStatePredictionTelemetryEvent
{
public:
	char                                                         InitialPrediction;                                 // 0x0(0x1)
	char                                                         FinalPrediction;                                   // 0x1(0x1)
};


// Size 0x20
struct SpawningCommandSpawnAIEncounterEvent
{
public:
	class AIEncounterSettingsFixed*                              AIEncounter;                                       // 0x0(0x8)
	TArray<class PlayerState*>                                   TargetActors;                                      // 0x8(0x10)
	float                                                        Delay;                                             // 0x18(0x4)
	char                                                         pad0x4_MKOOF[0x4];                                 // 0x1c(0x4)
};


// Size 0x20
struct PlayerRepopulatedPirateSlotTelemetryEvent
{
public:
	struct FString                                               OldPirateId;                                       // 0x0(0x10)
	struct FString                                               NewPirateId;                                       // 0x10(0x10)
};


// Size 0x90
struct PirateCreationEvent_SavePirate
{
public:
	struct PirateDescription                                     Description;                                       // 0x0(0x80)
	TArray<class Class*>                                         Outfit;                                            // 0x80(0x10)
};


// Size 0x20
struct EventWieldableItemDropped
{
public:
	class UClass*                                                DroppedItemCategory;                               // 0x0(0x8)
	class ItemInfo*                                              DroppedItemInfo;                                   // 0x8(0x8)
	class Actor*                                                 ContactActor;                                      // 0x10(0x8)
	float                                                        DropDistance;                                      // 0x18(0x4)
	bool                                                         InDeepWater;                                       // 0x1c(0x1)
	char                                                         pad0x3_Q2DPJ[0x3];                                 // 0x1d(0x3)
};


// Size 0xc
struct TimedDoorState
{
public:
	char                                                         State;                                             // 0x0(0x1)
	char                                                         pad0x3_LXV67[0x3];                                 // 0x1(0x3)
	int                                                          JammedLandmarkReactionIndex;                       // 0x4(0x4)
	int                                                          LoweringLandmarkReactionIndex;                     // 0x8(0x4)
};


// Size 0xb0
struct VoyageBegunAnimationEvent
{
public:
	struct FText                                                 ShipName;                                          // 0x0(0x38)
	TArray<String>                                               CrewMembers;                                       // 0x38(0x10)
	int                                                          ChapterIndex;                                      // 0x48(0x4)
	int                                                          ChapterCount;                                      // 0x4c(0x4)
	struct FText                                                 VoyageTitle;                                       // 0x50(0x38)
	struct FString                                               AudioSwitchName;                                   // 0x88(0x10)
	struct FString                                               AudioSwitchValue;                                  // 0x98(0x10)
	struct FName                                                 CompanyId;                                         // 0xa8(0x8)
};


// Size 0x14
struct XMarksTheSpotMapMark
{
public:
	struct Vector2D                                              Position;                                          // 0x0(0x8)
	float                                                        Radius;                                            // 0x8(0x4)
	float                                                        Rotation;                                          // 0xc(0x4)
	bool                                                         IsUnderground;                                     // 0x10(0x1)
	char                                                         pad0x3_HETRN[0x3];                                 // 0x11(0x3)
};


// Size 0x1
struct PurchaseCatalogOfferFailureResponseUIEvent
{
public:
	char                                                         pad0x1_77XFG[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct RequestJoinCrewEvent
{
public:
	int                                                          CrewId;                                            // 0x0(0x4)
};


// Size 0x1
struct ShowRivalVotingUIEvent
{
public:
	char                                                         pad0x1_I5IB9[0x1];                                 // 0x0(0x1)
};


// Size 0x68
struct LiquidLauncherCollisionsParams
{
public:
	float                                                        CollisionCapsuleRadius;                            // 0x0(0x4)
	float                                                        LiquidPointTravelDistance;                         // 0x4(0x4)
	float                                                        InheritOwnerForwardVelocityScalar;                 // 0x8(0x4)
	float                                                        LiquidPointTravelTime;                             // 0xc(0x4)
	float                                                        LiquidPointFireRate;                               // 0x10(0x4)
	float                                                        MaxDistanceSquaredBetweenPointsBeforeDiscontinuity; // 0x14(0x4)
	int                                                          MaxNumOfHitsProccessedPerLiquidCollision;          // 0x18(0x4)
	struct Vector                                                LiquidOriginOffset;                                // 0x1c(0xc)
	struct Rotator                                               LiquidOrientationOffset;                           // 0x28(0xc)
	char                                                         pad0x4_0R5DZ[0x4];                                 // 0x34(0x4)
	class CurveFloat*                                            LiquidPointsTravelCurve;                           // 0x38(0x8)
	char                                                         CollisionChannel;                                  // 0x40(0x1)
	struct CollisionResponseContainer                            CollisionResponse;                                 // 0x41(0x20)
	char                                                         pad0x7_KZO2S[0x7];                                 // 0x61(0x7)
};


// Size 0x18
struct CatalogOfferCommodity
{
public:
	class UClass*                                                RequiredEmissary;                                  // 0x0(0x8)
	struct CommoditySelectionType                                Type;                                              // 0x8(0x8)
	char                                                         Demand;                                            // 0x10(0x1)
	char                                                         pad0x7_JCO4B[0x7];                                 // 0x11(0x7)
};


// Size 0x1
struct TutorialDialogEvent
{
public:
	char                                                         StepStarted;                                       // 0x0(0x1)
};


// Size 0x1
struct ScuttleAndChangeSeaTelemetryEvent
{
public:
	bool                                                         bIsCancellingEvent;                                // 0x0(0x1)
};


// Size 0x10
struct RiddleTextPhrasebookEntry
{
public:
	struct FName                                                 Id;                                                // 0x0(0x8)
	class RiddleTextPhraseDataAsset*                             Phrase;                                            // 0x8(0x8)
};


// Size 0x1
struct LocalGameChatStatusEvent
{
public:
	char                                                         Status;                                            // 0x0(0x1)
};


// Size 0x1
struct EventPlayerExitedSittingState
{
public:
	char                                                         pad0x1_5XXSI[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct SetDisableGuildActionNotifications
{
public:
	bool                                                         Value;                                             // 0x0(0x1)
};


// Size 0x20
struct ShowJupiterAccountLinkingConfirmationPrompt
{
public:
	struct FString                                               JupiterUsername;                                   // 0x0(0x10)
	struct FString                                               XboxUsername;                                      // 0x10(0x10)
};


// Size 0x1
struct BootFlowPirateProfiles_ExitPirateCreator
{
public:
	char                                                         pad0x1_FDDD8[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct MeshMemoryConstraintShipPartCannotSetAsShipIsUnsafe
{
public:
	struct FString                                               ShipPartName;                                      // 0x0(0x10)
};


// Size 0x10
struct PirateGeneratorBakePrioritisedTelemetryEvent
{
public:
	struct Guid                                                  PlayerGuid;                                        // 0x0(0x10)
};


// Size 0x20
struct ContestChestDugUpEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	class Actor*                                                 DiscoveringCharacter;                              // 0x10(0x8)
	class ItemInfo*                                              TreasureChestItemInformation;                      // 0x18(0x8)
};


// Size 0x18
struct CampaignRanks
{
public:
	struct FName                                                 CampaignId;                                        // 0x0(0x8)
	TArray<class Class*>                                         Ranks;                                             // 0x8(0x10)
};


// Size 0x60
struct MoveToLocationActionStateConstructionInfo
{
public:
	char                                                         pad0x48_TI9UW[0x48];                               // 0x0(0x48)
	class SceneComponent*                                        RelativeToComponent;                               // 0x48(0x8)
	struct Vector                                                TargetLocation;                                    // 0x50(0xc)
	char                                                         pad0x4_BVLZK[0x4];                                 // 0x5c(0x4)
};


// Size 0x1
struct QuestTableForceCloseEvent
{
public:
	char                                                         pad0x1_31O49[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct PlateData
{
public:
	struct FName                                                 MaterialParameterName;                             // 0x0(0x8)
	char                                                         SoulType;                                          // 0x8(0x1)
	char                                                         pad0x7_WHNQ4[0x7];                                 // 0x9(0x7)
	class WwiseEvent*                                            PlayEffigyPlacementAudioEvent;                     // 0x10(0x8)
	char                                                         pad0x8_EAI5D[0x8];                                 // 0x18(0x8)
};


// Size 0x60
struct ContestShipLiverySet
{
public:
	struct Guid                                                  OwningCrewID;                                      // 0x0(0x10)
	char                                                         pad0x50_FEC63[0x50];                               // 0x10(0x50)
};


// Size 0x10
struct EventRequestSayPhrase
{
public:
	struct FString                                               PhraseKey;                                         // 0x0(0x10)
};


// Size 0x10
struct InventoryInteractionStowAllRequestEvent
{
public:
	struct FString                                               ItemDesc;                                          // 0x0(0x10)
};


// Size 0x10
struct BootyItemLeftShipEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	class ItemInfo*                                              ItemLeavingShip;                                   // 0x8(0x8)
};


// Size 0xc
struct EventRequestVomit
{
public:
	char                                                         pad0xc_YCVO3[0xc];                                 // 0x0(0xc)
};


// Size 0x10
struct EventAmmoChanged
{
public:
	int                                                          Ammo;                                              // 0x0(0x4)
	char                                                         AmmoType;                                          // 0x4(0x1)
	char                                                         pad0x3_FR4YS[0x3];                                 // 0x5(0x3)
	class UClass*                                                AnimationItemKey;                                  // 0x8(0x8)
};


// Size 0x1
struct EnableServerCreationEvent
{
public:
	bool                                                         Value;                                             // 0x0(0x1)
};


// Size 0x1
struct EventAudioPlayerEnteredHotFloorVicinity
{
public:
	char                                                         pad0x1_810XA[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct FrameTypeTelemetryFragment
{
public:
	char                                                         pad0x18_S76T7[0x18];                               // 0x0(0x18)
};


// Size 0x1
struct RequestCrewManagementEvent
{
public:
	char                                                         pad0x1_Q6VW5[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ActorActivationCompleted
{
public:
	char                                                         pad0x1_LL9NN[0x1];                                 // 0x0(0x1)
};


// Size 0x14
struct AtmosphericPressureZoneParameters
{
public:
	float                                                        Radius;                                            // 0x0(0x4)
	float                                                        TargetPressure;                                    // 0x4(0x4)
	float                                                        PushForce;                                         // 0x8(0x4)
	float                                                        TwistForce;                                        // 0xc(0x4)
	float                                                        Weight;                                            // 0x10(0x4)
};


// Size 0x30
struct QuestVariableOrientedPoint
{
public:
	char                                                         pad0x30_0STKN[0x30];                               // 0x0(0x30)
};


// Size 0x10
struct ContestMatchmakingLocationsRequestModel
{
public:
	TArray<String>                                               PlayModeTags;                                      // 0x0(0x10)
};


// Size 0x40
struct NotesRemoteServiceNoteDetailModel
{
public:
	struct Guid                                                  Id;                                                // 0x0(0x10)
	struct FString                                               NoteType;                                          // 0x10(0x10)
	struct FString                                               Title;                                             // 0x20(0x10)
	struct FString                                               Note;                                              // 0x30(0x10)
};


// Size 0x18
struct NPCBeckonGestureEntry
{
public:
	class UClass*                                                GestureID;                                         // 0x0(0x8)
	struct StringAssetReference                                  BeckonGestureDataAsset;                            // 0x8(0x10)
};


// Size 0x1
struct EventActorStartedUsingSeat
{
public:
	char                                                         pad0x1_RDZKA[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct QuestVariableBool
{
public:
	char                                                         pad0x30_RWJU5[0x30];                               // 0x0(0x30)
};


// Size 0x10
struct ImpactLocationData
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        Size;                                              // 0xc(0x4)
};


// Size 0x1
struct EventPlayerDrinkingStart
{
public:
	char                                                         pad0x1_RTCQR[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct ParticleSystemPicker
{
public:
	class ParticleSystem*                                        ObserverAboveEffectAboveWater;                     // 0x0(0x8)
	class ParticleSystem*                                        ObserverBelowEffectBelowWater;                     // 0x8(0x8)
	class ParticleSystem*                                        ObserverAboveEffectBelowWater;                     // 0x10(0x8)
	class ParticleSystem*                                        ObserverBelowEffectAboveWater;                     // 0x18(0x8)
};


// Size 0x1
struct ShipOnFireEndTelemetryEvent
{
public:
	char                                                         pad0x1_AQUIE[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct OpenableItemMetaWrapper
{
public:
	char                                                         pad0x18_PYZR0[0x18];                               // 0x0(0x18)
	char                                                         OpenState;                                         // 0x18(0x1)
	bool                                                         HasEverClosed;                                     // 0x19(0x1)
	char                                                         pad0x6_XU2XE[0x6];                                 // 0x1a(0x6)
};


// Size 0x20
struct PirateProfilesRenameProfileToGame
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
	struct FString                                               NewName;                                           // 0x10(0x10)
};


// Size 0x50
struct AthenaAnimationAsyncLoadedObjectActionOneShot
{
public:
	char                                                         pad0x8_KQR0C[0x8];                                 // 0x0(0x8)
	TArray<Class>                                                MainAction;                                        // 0x8(0x10)
	TArray<Class>                                                MainActionLocomotion;                              // 0x18(0x10)
	TArray<Class>                                                AlternateAction;                                   // 0x28(0x10)
	TArray<Class>                                                AlternateActionLocomotion;                         // 0x38(0x10)
	bool                                                         IgnoreOverlayHandAdditiveForAction;                // 0x48(0x1)
	char                                                         pad0x7_PS5GQ[0x7];                                 // 0x49(0x7)
};


// Size 0x1
struct SlidingDoorOpenedEvent
{
public:
	char                                                         pad0x1_GTR6J[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct CharacterHitReactionDamagerTypeToAnimTypePair
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	char                                                         pad0x8_S3I86[0x8];                                 // 0x8(0x8)
};


// Size 0x18
struct VotingTooltipFocusChangedTelemetryEvent
{
public:
	struct FString                                               ObjectId;                                          // 0x0(0x10)
	bool                                                         IsInFocus;                                         // 0x10(0x1)
	bool                                                         CanInteract;                                       // 0x11(0x1)
	bool                                                         ShouldBeDescribed;                                 // 0x12(0x1)
	char                                                         pad0x5_1XAPJ[0x5];                                 // 0x13(0x5)
};


// Size 0x28
struct TextureGroupMemorySummary
{
public:
	struct FString                                               TextureGroupName;                                  // 0x0(0x10)
	char                                                         pad0x18_ZKQOV[0x18];                               // 0x10(0x18)
};


// Size 0x28
struct PakChunkSignatureCheckFailureTelemetryEvent
{
public:
	struct FString                                               PakFilename;                                       // 0x0(0x10)
	int                                                          ChunkIndex;                                        // 0x10(0x4)
	char                                                         pad0x4_EDTDB[0x4];                                 // 0x14(0x4)
	char                                                         pad0x10_DQ8Q9[0x10];                               // 0x18(0x10)
};


// Size 0x10
struct ClientChatModerationRequestFailedEvent
{
public:
	struct FString                                               FailureReason;                                     // 0x0(0x10)
};


// Size 0x10
struct ReplyToGuildInviteSuccessEvent
{
public:
	struct FString                                               GuildId;                                           // 0x0(0x10)
};


// Size 0x128
struct AthenaAnimationMountedWeapon
{
public:
	bool                                                         IsFiring;                                          // 0x0(0x1)
	char                                                         pad0x3_CHD5N[0x3];                                 // 0x1(0x3)
	float                                                        Pitch;                                             // 0x4(0x4)
	float                                                        Yaw;                                               // 0x8(0x4)
	char                                                         pad0x4_LM0UT[0x4];                                 // 0xc(0x4)
	class Actor*                                                 ControlledObject;                                  // 0x10(0x8)
	char                                                         pad0x110_FAP25[0x110];                             // 0x18(0x110)
};


// Size 0x10
struct NPCInitialSpawnedCosmeticItems
{
public:
	class UClass*                                                CosmeticItemObject;                                // 0x0(0x8)
	struct FName                                                 AttachSocketName;                                  // 0x8(0x8)
};


// Size 0x10
struct GuildOverviewModel
{
public:
	int                                                          NumberOfMembers;                                   // 0x0(0x4)
	int                                                          NumberOfShips;                                     // 0x4(0x4)
	struct DateTime                                              LastSailedUtc;                                     // 0x8(0x8)
};


// Size 0x48
struct CargoRunQuestDescDataNPCNameLocationHintEntry
{
public:
	struct FString                                               NPCNameSubstring;                                  // 0x0(0x10)
	struct FText                                                 LocationHint;                                      // 0x10(0x38)
};


// Size 0x18
struct UIQuestTableCloseTelemetryEvent
{
public:
	float                                                        TotalTimeInQuestTable;                             // 0x0(0x4)
	char                                                         pad0x4_1AS1E[0x4];                                 // 0x4(0x4)
	struct FString                                               SessionId;                                         // 0x8(0x10)
};


// Size 0x2
struct EventPlayerControllerKillNotification
{
public:
	bool                                                         IsHighContrast;                                    // 0x0(0x1)
	bool                                                         PlaySfx;                                           // 0x1(0x1)
};


// Size 0x14
struct NotesManagementAddNoteScheduleResponseModel
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
	char                                                         pad0x3_CZJ6U[0x3];                                 // 0x1(0x3)
	struct Guid                                                  ScheduleId;                                        // 0x4(0x10)
};


// Size 0x10
struct RequestShipCustomizationChestShipCustomizationEntitlementsEvent
{
public:
	struct FString                                               ItemCategory;                                      // 0x0(0x10)
};


// Size 0x28
struct ItemSnapshotTakenEvent
{
public:
	char                                                         pad0x10_AQOYQ[0x10];                               // 0x0(0x10)
	struct Guid                                                  SnapshotID;                                        // 0x10(0x10)
	class Object*                                                SnapshotObject;                                    // 0x20(0x8)
};


// Size 0x10
struct SpawnerTypeMapping
{
public:
	class UClass*                                                Type;                                              // 0x0(0x8)
	class BaseContainerContentSpawner*                           Spawner;                                           // 0x8(0x8)
};


// Size 0x10
struct ShroudBreakerDeactivatedEvent
{
public:
	struct Guid                                                  ShroudBreakerId;                                   // 0x0(0x10)
};


// Size 0x1c
struct EnterTunnelOfTheDamnedActionStateParams
{
public:
	float                                                        FadeDuration;                                      // 0x0(0x4)
	float                                                        FadeEventTimeout;                                  // 0x4(0x4)
	float                                                        FadeServerTimeout;                                 // 0x8(0x4)
	struct LinearColor                                           FadeColour;                                        // 0xc(0x10)
};


// Size 0x1c
struct PlayerStatsDispatcherSettings
{
public:
	float                                                        DispatchFrequencySeconds;                          // 0x0(0x4)
	float                                                        PollIntervalSeconds;                               // 0x8(0x4)
	float                                                        BatchWindowMilliseconds;                           // 0xc(0x4)
	char                                                         pad0xc_5ZMOC[0xc];                                 // 0x10(0xc)
};


// Size 0x10
struct CrewMemberRivalVoteEvent
{
public:
	class PlayerState*                                           CrewMemberPlayerState;                             // 0x0(0x8)
	bool                                                         IsInFavourOfRivalChange;                           // 0x8(0x1)
	char                                                         pad0x7_A121F[0x7];                                 // 0x9(0x7)
};


// Size 0x40
struct CrewCommandChangeCrewShip
{
public:
	char                                                         pad0x28_98PTT[0x28];                               // 0x0(0x28)
	struct Guid                                                  CrewId;                                            // 0x28(0x10)
	class UClass*                                                NewPlayerShipClass;                                // 0x38(0x8)
};


// Size 0x1
struct PlayerUserSettingsUpdatedEvent
{
public:
	char                                                         pad0x1_1QDZL[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct EventUserGameSettingsSetKeyBindingToInvalid
{
public:
	char                                                         BindingSet;                                        // 0x0(0x1)
	char                                                         pad0x7_SMAIJ[0x7];                                 // 0x1(0x7)
	struct FString                                               BindingName;                                       // 0x8(0x10)
	char                                                         ControllerType;                                    // 0x18(0x1)
	char                                                         Instigator;                                        // 0x19(0x1)
	char                                                         pad0x6_GBBRR[0x6];                                 // 0x1a(0x6)
};


// Size 0x1
struct StopUpdatingConstellationVisibility
{
public:
	char                                                         pad0x1_J7GWM[0x1];                                 // 0x0(0x1)
};


// Size 0x68
struct EventEmblemUnlockedNotification
{
public:
	struct FName                                                 CompanyName;                                       // 0x0(0x8)
	struct FName                                                 FriendlyName;                                      // 0x8(0x8)
	struct FText                                                 EmblemName;                                        // 0x10(0x38)
	struct FString                                               EmblemUrl;                                         // 0x48(0x10)
	struct FString                                               BackgroundUrl;                                     // 0x58(0x10)
};


// Size 0x18
struct WieldableItemActionVisuals
{
public:
	TArray<class Class*>                                         BlockActions;                                      // 0x0(0x10)
	char                                                         AnimVariant;                                       // 0x10(0x1)
	bool                                                         IsAlternate;                                       // 0x11(0x1)
	bool                                                         HideItem;                                          // 0x12(0x1)
	char                                                         pad0x5_E4ENO[0x5];                                 // 0x13(0x5)
};


// Size 0x38
struct PlayNpcAnimationNetworkEvent
{
public:
	char                                                         pad0x18_ELCR2[0x18];                               // 0x0(0x18)
	class Actor*                                                 TargetActor;                                       // 0x18(0x8)
	struct FName                                                 AnimationNameToPlay;                               // 0x20(0x8)
	class UClass*                                                LocalMusicZone;                                    // 0x28(0x8)
	class PlaceableReaction*                                     PlaceableReaction;                                 // 0x30(0x8)
};


// Size 0x10
struct CompanyCatalog
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	class CatalogDataAsset*                                      Catalog;                                           // 0x8(0x8)
};


// Size 0x1
struct ConnectToServicesStateDiscoverySucceededPreLoginEvent
{
public:
	char                                                         pad0x1_K9CM6[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct MountedWeaponFireAcknowledgeRpc
{
public:
	char                                                         pad0x18_D5NPH[0x18];                               // 0x0(0x18)
	class Object*                                                MountedWeaponObject;                               // 0x18(0x8)
};


// Size 0x14
struct EventItemsRetrieved
{
public:
	struct Guid                                                  CrewRetrieving;                                    // 0x0(0x10)
	char                                                         pad0x4_JNZFY[0x4];                                 // 0x10(0x4)
};


// Size 0x28
struct PendingInviteViewModel
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
	struct FString                                               Gamertag;                                          // 0x10(0x10)
	char                                                         Platform;                                          // 0x20(0x1)
	char                                                         pad0x7_X8ABN[0x7];                                 // 0x21(0x7)
};


// Size 0x28
struct InputMontagePair
{
public:
	class UClass*                                                InputID;                                           // 0x0(0x8)
	char                                                         Variant;                                           // 0x8(0x1)
	char                                                         pad0x7_WC20M[0x7];                                 // 0x9(0x7)
	class AnimSequenceBase*                                      Into;                                              // 0x10(0x8)
	class AnimSequenceBase*                                      Loop;                                              // 0x18(0x8)
	class AnimSequenceBase*                                      Outof;                                             // 0x20(0x8)
};


// Size 0x28
struct ItemSpawnWeightedType
{
public:
	class UClass*                                                Type;                                              // 0x0(0x8)
	struct FName                                                 Feature;                                           // 0x8(0x8)
	bool                                                         InvertFeatureCheck;                                // 0x10(0x1)
	char                                                         pad0x3_JGSMJ[0x3];                                 // 0x11(0x3)
	int                                                          Weight;                                            // 0x14(0x4)
	TArray<class SpawnRequirement*>                              Requirements;                                      // 0x18(0x10)
};


// Size 0x30
struct EmissaryLeaderboardScoreUpdatedNetworkEvent
{
public:
	char                                                         pad0x18_ZEZ75[0x18];                               // 0x0(0x18)
	struct FName                                                 EmissaryAffiliation;                               // 0x18(0x8)
	char                                                         pad0x10_9VJHE[0x10];                               // 0x20(0x10)
};


// Size 0x1
struct ClientBannedHandlerRetrieveDataResponse
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
};


// Size 0x20
struct CategoryTypeMapEntry
{
public:
	struct FString                                               Type;                                              // 0x0(0x10)
	TArray<class Class*>                                         Categories;                                        // 0x10(0x10)
};


// Size 0x28
struct PlayersGuildRewardUnlockedEvent
{
public:
	struct Guid                                                  GuildId;                                           // 0x0(0x10)
	struct FString                                               EntitlementId;                                     // 0x10(0x10)
	char                                                         pad0x8_C9XB1[0x8];                                 // 0x20(0x8)
};


// Size 0x40
struct HangingComponentPositions
{
public:
	struct Vector                                                HangingComponentBoxOrigin;                         // 0x0(0xc)
	struct Rotator                                               HangingComponentBoxRotation;                       // 0xc(0xc)
	struct Vector                                                InteractionPointLocation;                          // 0x18(0xc)
	char                                                         pad0x4_NR9W9[0x4];                                 // 0x24(0x4)
	struct FString                                               HangingComponentName;                              // 0x28(0x10)
	bool                                                         HoldToInteract;                                    // 0x38(0x1)
	bool                                                         CustomInteractionPoint;                            // 0x39(0x1)
	bool                                                         RequiresFacingFront;                               // 0x3a(0x1)
	char                                                         pad0x5_FMM32[0x5];                                 // 0x3b(0x5)
};


// Size 0x2c
struct RageActorExplodedTelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	struct FName                                                 RageActorClass;                                    // 0x10(0x8)
	struct Vector                                                ExplosionLocation;                                 // 0x18(0xc)
	float                                                        TimeToExplode;                                     // 0x24(0x4)
	float                                                        TotalExplosionDelayedTime;                         // 0x28(0x4)
};


// Size 0x8
struct PetAnimationWeighting
{
public:
	char                                                         AnimationState;                                    // 0x0(0x1)
	char                                                         pad0x3_MRRS5[0x3];                                 // 0x1(0x3)
	float                                                        Weighting;                                         // 0x4(0x4)
};


// Size 0x20
struct PirateProfilesPirateCreationCompletedToUI
{
public:
	struct FString                                               State;                                             // 0x0(0x10)
	struct FString                                               ProfileId;                                         // 0x10(0x10)
};


// Size 0x28
struct FrontendChatGetMessageServiceResponse
{
public:
	struct FString                                               MessageText;                                       // 0x0(0x10)
	struct FString                                               SenderId;                                          // 0x10(0x10)
	struct DateTime                                              TimeUtc;                                           // 0x20(0x8)
};


// Size 0x10
struct EventCrewEntitlementUpdatedAndVerified
{
public:
	char                                                         pad0x10_72EA4[0x10];                               // 0x0(0x10)
};


// Size 0x28
struct ClientNPCDialogOptionSelectedTelemetryEvent
{
public:
	struct Guid                                                  NPCInteractionSessionId;                           // 0x0(0x10)
	struct FString                                               NPCDialogTreeDataAsset;                            // 0x10(0x10)
	int                                                          DialogIndex;                                       // 0x20(0x4)
	int                                                          OptionChosenIndex;                                 // 0x24(0x4)
};


// Size 0x50
struct VomitProjectiles
{
public:
	class UClass*                                                VomitProjectileClass;                              // 0x0(0x8)
	struct FName                                                 SocketName;                                        // 0x8(0x8)
	float                                                        Speed;                                             // 0x10(0x4)
	float                                                        AdditionalLiftAngle;                               // 0x14(0x4)
	float                                                        Radius;                                            // 0x18(0x4)
	float                                                        ImpactDelay;                                       // 0x1c(0x4)
	float                                                        ImpactCutoff;                                      // 0x20(0x4)
