#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x18
struct TinySharkDespawnedNetworkEvent
{
public:
	char                                                         pad0x18_F46MZ[0x18];                               // 0x0(0x18)
};


// Size 0x18
struct EventPlayerEnterAISpawnableWater
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	char                                                         pad0x10_TIU7G[0x10];                               // 0x8(0x10)
};


// Size 0x8
struct EventFaunaMeleeAttack
{
public:
	char                                                         pad0x8_M8PFW[0x8];                                 // 0x0(0x8)
};


// Size 0x30
struct EventOnFaunaSpawnaExploded
{
public:
	class Actor*                                                 RootInstigator;                                    // 0x0(0x8)
	class Actor*                                                 HitActor;                                          // 0x8(0x8)
	char                                                         pad0x10_KMB8U[0x10];                               // 0x10(0x10)
	class Object*                                                FaunaSpawnaSpawnId;                                // 0x20(0x8)
	bool                                                         HitWater;                                          // 0x28(0x1)
	char                                                         pad0x7_5SYIS[0x7];                                 // 0x29(0x7)
};


// Size 0x18
struct AITargetBounds
{
public:
	struct Vector                                                Offset;                                            // 0x0(0xc)
	struct Vector                                                Extents;                                           // 0xc(0xc)
};


// Size 0x20
struct CustomPlayersAITrackerData
{
public:
	class AIPlayerTracker*                                       Tracker;                                           // 0x0(0x8)
	char                                                         pad0x18_CZQY4[0x18];                               // 0x8(0x18)
};


// Size 0x30
struct QuestVariableTinySharkExperience
{
public:
	char                                                         pad0x30_1DDBR[0x30];                               // 0x0(0x30)
};


// Size 0x18
struct EventOnFaunaSpawnaExplodedWithFishSpawn
{
public:
	class UClass*                                                FishingFishSpawnerClass;                           // 0x0(0x8)
	struct Vector                                                ExplosionOrigin;                                   // 0x8(0xc)
	char                                                         pad0x4_I22C2[0x4];                                 // 0x14(0x4)
};


// Size 0x8
struct EventNewAIStrategyBPReadable
{
public:
	class UClass*                                                NewAIStrategy;                                     // 0x0(0x8)
};


// Size 0x68
struct EventAttachableArmourDamaged
{
public:
	struct ImpactDamageEvent                                     ImpactDamageEvent;                                 // 0x0(0x58)
	class Actor*                                                 ArmourOwningActor;                                 // 0x58(0x8)
	float                                                        VulnerabilityModifier;                             // 0x60(0x4)
	char                                                         pad0x4_BQXP6[0x4];                                 // 0x64(0x4)
};


// Size 0x10
struct EventPawnFinishedDying
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
	char                                                         DeathType;                                         // 0x8(0x1)
	char                                                         pad0x7_REAL9[0x7];                                 // 0x9(0x7)
};


// Size 0x40
struct AIDebugVisualisationBox
{
public:
	struct Vector                                                Centre;                                            // 0x0(0xc)
	struct Vector                                                Extents;                                           // 0xc(0xc)
	char                                                         pad0x8_GT08P[0x8];                                 // 0x18(0x8)
	struct Quat                                                  Rotation;                                          // 0x20(0x10)
	float                                                        LifeTime;                                          // 0x30(0x4)
	char                                                         Colour;                                            // 0x34(0x1)
	char                                                         pad0xb_S2I4S[0xb];                                 // 0x35(0xb)
};


// Size 0x1
struct EventAIKnockbackEnded
{
public:
	char                                                         pad0x1_6OVMX[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventFaunaPickedup
{
public:
	class Actor*                                                 Interactor;                                        // 0x0(0x8)
	class Actor*                                                 PickedUpFauna;                                     // 0x8(0x8)
};


// Size 0x38
struct EventTinySharkRepositioning
{
public:
	struct Guid                                                  TinySharkExperienceId;                             // 0x0(0x10)
	struct FString                                               TinySharkPartIndex;                                // 0x10(0x10)
	struct Vector                                                DespawnLocation;                                   // 0x20(0xc)
	bool                                                         IsTaleTinyShark;                                   // 0x2c(0x1)
	char                                                         pad0x3_4JX69[0x3];                                 // 0x2d(0x3)
	int                                                          NumTimesRepositioned;                              // 0x30(0x4)
	char                                                         pad0x4_OPI18[0x4];                                 // 0x34(0x4)
};


// Size 0x18
struct EventAIKnockbackStarted
{
public:
	char                                                         pad0x18_0K6V3[0x18];                               // 0x0(0x18)
};


// Size 0x10
struct PetTurnRateModifier
{
public:
	class UClass*                                                Strategy;                                          // 0x0(0x8)
	float                                                        TurnRateModifier;                                  // 0x8(0x4)
	char                                                         pad0x4_L8QBK[0x4];                                 // 0xc(0x4)
};


// Size 0x58
struct AITypeData
{
public:
	struct FName                                                 AITypeName;                                        // 0x0(0x8)
	struct StringClassReference                                  AIPawnClass;                                       // 0x8(0x10)
	struct StringAssetReference                                  DefaultDebugSkillset;                              // 0x18(0x10)
	struct StringAssetReference                                  DefaultDebugLoadout;                               // 0x28(0x10)
	class UClass*                                                DefaultDebugAIClassId;                             // 0x38(0x8)
	bool                                                         RequireNavMesh;                                    // 0x40(0x1)
	char                                                         pad0x3_L4CO0[0x3];                                 // 0x41(0x3)
	int                                                          AIRegionCostUnits;                                 // 0x44(0x4)
	int                                                          AIWorldCostUnits;                                  // 0x48(0x4)
	struct FName                                                 FeatureToggle;                                     // 0x4c(0x8)
	char                                                         pad0x4_68B90[0x4];                                 // 0x54(0x4)
};


// Size 0x10
struct PetWieldableReactMapping
{
public:
	class UClass*                                                WieldableType;                                     // 0x0(0x8)
	struct FName                                                 ReactId;                                           // 0x8(0x8)
};


// Size 0xe8
struct AISpawnTypeParams
{
public:
	char                                                         pad0x20_5M40R[0x20];                               // 0x0(0x20)
	struct StringAssetReference                                  SkillsetOverride;                                  // 0x20(0x10)
	struct StringAssetReference                                  LoadoutOverride;                                   // 0x30(0x10)
	struct StringAssetReference                                  FormOverride;                                      // 0x40(0x10)
	struct StringAssetReference                                  AmmoOverride;                                      // 0x50(0x10)
	class UClass*                                                AIClassIdOverride;                                 // 0x80(0x8)
	struct StringAssetReference                                  TeamColorOverride;                                 // 0x88(0x10)
	struct EncounterParams                                       EncounterTrackingParams;                           // 0x98(0xc)
	struct FName                                                 DioramaRole;                                       // 0xa4(0x8)
	char                                                         pad0x4_F1OAK[0x4];                                 // 0xac(0x4)
	struct FText                                                 LocalisableName;                                   // 0xb0(0x38)
};


// Size 0x20
struct AIDebugVisualisationLine
{
public:
	struct Vector                                                From;                                              // 0x0(0xc)
	struct Vector                                                To;                                                // 0xc(0xc)
	float                                                        LifeTime;                                          // 0x18(0x4)
	char                                                         Colour;                                            // 0x1c(0x1)
	char                                                         pad0x3_7IFP2[0x3];                                 // 0x1d(0x3)
};


// Size 0x1
struct EventFaunaAnimationStartMeleeAttack
{
public:
	bool                                                         MeleeAttacked;                                     // 0x0(0x1)
};


// Size 0x18
struct AILoadoutRankMapping
{
public:
	class LoadoutAsset*                                          Loadout;                                           // 0x0(0x8)
	TArray<float>                                                Weights;                                           // 0x8(0x10)
};


// Size 0x38
struct WeightedAIStrategyChance
{
public:
	class UClass*                                                Strategy;                                          // 0x0(0x8)
	struct AIDataProviderFloatValue                              WeightedChance;                                    // 0x8(0x30)
};


// Size 0x68
struct EventAttachableArmourDestroyed
{
public:
	struct ImpactDamageEvent                                     ImpactDamageEvent;                                 // 0x0(0x58)
	class Actor*                                                 ArmourOwningActor;                                 // 0x58(0x8)
	float                                                        VulnerabilityModifier;                             // 0x60(0x4)
	char                                                         pad0x4_ZX58S[0x4];                                 // 0x64(0x4)
};


// Size 0x38
struct TemporaryPlayerDetailsUnitEntry
{
public:
	char                                                         pad0x38_H3SNU[0x38];                               // 0x0(0x38)
};


// Size 0x14
struct AIBountySpawnerWaveLocation
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        SelectionWeight;                                   // 0xc(0x4)
	bool                                                         AllowForTarget;                                    // 0x10(0x1)
	char                                                         pad0x3_535DL[0x3];                                 // 0x11(0x3)
};


// Size 0x20
struct AICustomClassIdNameOverrides
{
public:
	TArray<class Class*>                                         ClassIds;                                          // 0x0(0x10)
	TArray<struct Text>                                          Names;                                             // 0x10(0x10)
};


// Size 0x18
struct AthenaAIFormComponentVfxCustomisation
{
public:
	class UClass*                                                VfxCustomisationType;                              // 0x0(0x8)
	bool                                                         VfxEnabled;                                        // 0x8(0x1)
	char                                                         pad0x7_456MK[0x7];                                 // 0x9(0x7)
	class Object*                                                VfxTemplate;                                       // 0x10(0x8)
};


// Size 0x20
struct EventAIFormEncounteredByLocalPlayer
{
public:
	char                                                         pad0x18_Z4TSP[0x18];                               // 0x0(0x18)
	class UClass*                                                FormType;                                          // 0x18(0x8)
};


// Size 0xc
struct AIPartIdNumVariantInfo
{
public:
	struct FName                                                 AIPartId;                                          // 0x0(0x8)
	int                                                          NumVariants;                                       // 0x8(0x4)
};


// Size 0x30
struct EventTinySharkLootSpawned
{
public:
	struct Guid                                                  TinySharkExperienceId;                             // 0x0(0x10)
	struct FString                                               TinySharkPartIndex;                                // 0x10(0x10)
	struct Vector                                                LootSpawnLocation;                                 // 0x20(0xc)
	char                                                         pad0x4_L0DWI[0x4];                                 // 0x2c(0x4)
};


// Size 0x10
struct AdditionalSpawnerBehaviour
{
public:
	class SpawnerBehaviourStrategy*                              BehaviourStrategy;                                 // 0x0(0x8)
	char                                                         pad0x8_4B8Z4[0x8];                                 // 0x8(0x8)
};


// Size 0x10
struct CoralArmourDamagedTelemetryEvent
{
public:
	float                                                        CurrentHealth;                                     // 0x0(0x4)
	float                                                        PreviousHealth;                                    // 0x4(0x4)
	float                                                        HealthDelta;                                       // 0x8(0x4)
	char                                                         Reason;                                            // 0xc(0x1)
	char                                                         pad0x3_P30NX[0x3];                                 // 0xd(0x3)
};


// Size 0x1
struct EventAIPawnReadyToConstructDebugText
{
public:
	char                                                         pad0x1_5CLBZ[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct EventTaleQuestTinySharkSpawned
{
public:
	char                                                         pad0x30_RDD29[0x30];                               // 0x0(0x30)
	struct Guid                                                  VoyageID;                                          // 0x30(0x10)
};


// Size 0xc
struct TinyCreatureDestroyedTelemetryEvent
{
public:
	struct Vector                                                SpawnedLocation;                                   // 0x0(0xc)
};


// Size 0x20
struct BountySpawnerIntensityUpdateNetworkEvent
{
public:
	char                                                         pad0x18_DYTRC[0x18];                               // 0x0(0x18)
	bool                                                         IsFinalWave;                                       // 0x18(0x1)
	char                                                         pad0x3_BGT8D[0x3];                                 // 0x19(0x3)
	float                                                        Intensity;                                         // 0x1c(0x4)
};


// Size 0x10
struct AIAbilityFollowUp
{
public:
	class UClass*                                                AbilityType;                                       // 0x0(0x8)
	float                                                        Chance;                                            // 0x8(0x4)
	char                                                         pad0x4_853D4[0x4];                                 // 0xc(0x4)
};


// Size 0x20
struct EventPlayerEnteredAISpawnRegion
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	char                                                         pad0x18_7JBOL[0x18];                               // 0x8(0x18)
};


// Size 0xc
struct ChanceForSharksToBlockSirenEncounterData
{
public:
	int                                                          NumberOfSharks;                                    // 0x0(0x4)
	float                                                        ChanceToSpawn;                                     // 0x4(0x4)
	float                                                        RadiusToCheck;                                     // 0x8(0x4)
};


// Size 0x1
struct EventOwnedPawnRemoveOwnership
{
public:
	char                                                         pad0x1_MJNST[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct CarriedItemThreatOverride
{
public:
	class UClass*                                                ItemDesc;                                          // 0x0(0x8)
	float                                                        Threat;                                            // 0x8(0x4)
	char                                                         pad0x4_L71NT[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct AIDebugSpawnAmount
{
public:
	class AIEncounterSettings*                                   EncounterSettings;                                 // 0x0(0x8)
	int                                                          NumToSpawn;                                        // 0x8(0x4)
	char                                                         pad0x4_SSAH3[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct AthenaAICharacterControllerSpawnItemDescForItemCategory
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	class UClass*                                                ItemDesc;                                          // 0x8(0x8)
};


// Size 0x10
struct AIPartsCategoryMapping
{
public:
	class UClass*                                                ClassId;                                           // 0x0(0x8)
	class AIPartsCategory*                                       PartsCategory;                                     // 0x8(0x8)
};


// Size 0xc
struct AthenaAICharacterCannonTarget
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	struct FName                                                 TargetLocation;                                    // 0x4(0x8)
};


// Size 0x20
struct PlayerInWaterData
{
public:
	char                                                         pad0x20_LU4K9[0x20];                               // 0x0(0x20)
};


// Size 0x18
struct PetMaterialEntry
{
public:
	struct StringAssetReference                                  MaterialReference;                                 // 0x0(0x10)
	bool                                                         CastShadows;                                       // 0x10(0x1)
	char                                                         pad0x7_UXJDB[0x7];                                 // 0x11(0x7)
};


// Size 0x18
struct TinySharkSpawnedNetworkEvent
{
public:
	char                                                         pad0x18_D7VUZ[0x18];                               // 0x0(0x18)
};


// Size 0x30
struct EventTinySharkSpawned
{
public:
	struct FString                                               TinySharkPartTag;                                  // 0x0(0x10)
	struct Guid                                                  SpawnConfigId;                                     // 0x10(0x10)
	struct Vector                                                SpawnLocation;                                     // 0x20(0xc)
	int                                                          NumTinySharksOnServer;                             // 0x2c(0x4)
};


// Size 0x10
struct AthenaAICharacterControllerItemCategoryProjectileEffectivenessProperties
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	class CurveFloat*                                            DistanceInMToProjectileHitChanceCurve;             // 0x8(0x8)
};


// Size 0x10
struct HearingThreat
{
public:
	struct FName                                                 SoundTag;                                          // 0x0(0x8)
	float                                                        Threat;                                            // 0x8(0x4)
	float                                                        CarrierSpeedThreshold;                             // 0xc(0x4)
};


// Size 0x1
struct AthenaAIDebugCostDisplay
{
public:
	char                                                         pad0x1_07CLN[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct TinySharkDespawnTelemetryEvent
{
public:
	struct FString                                               TinySharkId;                                       // 0x0(0x10)
	struct Guid                                                  TinySharkExperienceId;                             // 0x10(0x10)
	struct FString                                               TinySharkPartTag;                                  // 0x20(0x10)
	char                                                         TinySharkDespawnReason;                            // 0x30(0x1)
	char                                                         pad0x7_ZSONW[0x7];                                 // 0x31(0x7)
	double                                                       TimeToCompleteAfterEngagedInSeconds;               // 0x38(0x8)
	float                                                        TotalTrackingIdleTime;                             // 0x40(0x4)
	float                                                        TotalIdleTimeAfterEngaged;                         // 0x44(0x4)
};


// Size 0x4
struct StartFleeEvent
{
public:
	int                                                          TinyCreatureIndex;                                 // 0x0(0x4)
};


// Size 0x10
struct AISpawnTelemetryEvent
{
public:
	struct FString                                               LocationName;                                      // 0x0(0x10)
};


// Size 0x38
struct AthenaAIControllerWeightedRangesParamValue
{
public:
	struct FName                                                 ParamName;                                         // 0x0(0x8)
	struct WeightedProbabilityRangeOfRanges                      Value;                                             // 0x8(0x30)
};


// Size 0x18
struct AIStrategyVulnerabilityData
{
public:
	class UClass*                                                Strategy;                                          // 0x0(0x8)
	TArray<char>                                                 PreventedHealthChanges;                            // 0x8(0x10)
};


// Size 0x8
struct PetPartSizeMapping
{
public:
	char                                                         PetSize;                                           // 0x0(0x1)
	char                                                         pad0x3_VNGD5[0x3];                                 // 0x1(0x3)
	float                                                        PetScale;                                          // 0x4(0x4)
};


// Size 0x8
struct EventFaunaChargeAttack
{
public:
	char                                                         pad0x8_5MZ2A[0x8];                                 // 0x0(0x8)
};


// Size 0x58
struct TaleQuestTinySharkDespawnTelemetryEvent
{
public:
	char                                                         pad0x48_GO0YH[0x48];                               // 0x0(0x48)
	struct Guid                                                  VoyageID;                                          // 0x48(0x10)
};


// Size 0x8
struct EventSwimRotationModeChanged
{
public:
	char                                                         NewSwimRotationMode;                               // 0x0(0x1)
	char                                                         pad0x3_IW3UY[0x3];                                 // 0x1(0x3)
	float                                                        NewRotationRate;                                   // 0x4(0x4)
};


// Size 0x20
struct PlayerFaunaSpawnaData
{
public:
	char                                                         pad0x20_BZOU2[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct AttackableTypeToAnimMapping
{
public:
	char                                                         AttackType;                                        // 0x0(0x1)
	char                                                         pad0x7_68JC4[0x7];                                 // 0x1(0x7)
	class Object*                                                AnimMontage;                                       // 0x8(0x8)
	bool                                                         PlayAsDynamicMontage;                              // 0x10(0x1)
	char                                                         pad0x3_KWQ88[0x3];                                 // 0x11(0x3)
	float                                                        AnimLength;                                        // 0x14(0x4)
	float                                                        TimeIntoAnimOfAttack;                              // 0x18(0x4)
	float                                                        TargetKnockBackStrength;                           // 0x1c(0x4)
	struct FName                                                 RumbleTag;                                         // 0x20(0x8)
};


// Size 0x188
struct AIBountySpawnerWave
{
public:
	char                                                         pad0x128_LUAQW[0x128];                             // 0x0(0x128)
	bool                                                         IsTarget;                                          // 0x128(0x1)
	bool                                                         IsUsingDialogue;                                   // 0x129(0x1)
	char                                                         pad0x2_QG6UO[0x2];                                 // 0x12a(0x2)
	int                                                          MinPlayersToEnable;                                // 0x12c(0x4)
	char                                                         Gender;                                            // 0x130(0x1)
	char                                                         Rank;                                              // 0x131(0x1)
	char                                                         pad0x6_AJ2Z4[0x6];                                 // 0x132(0x6)
	class PostBountyAIPawnSpawnedAction*                         PostSpawnAction;                                   // 0x138(0x8)
	char                                                         pad0x38_E147G[0x38];                               // 0x140(0x38)
	class UClass*                                                BountyReward;                                      // 0x178(0x8)
	char                                                         pad0x8_17KLF[0x8];                                 // 0x180(0x8)
};


// Size 0x80
struct TinyCreatureInfo
{
public:
	class UClass*                                                TinyCreatureClass;                                 // 0x0(0x8)
	char                                                         pad0x8_AUPSH[0x8];                                 // 0x8(0x8)
	struct Transform                                             OriginalTransform;                                 // 0x10(0x30)
	char                                                         pad0x40_YPP5H[0x40];                               // 0x40(0x40)
};


// Size 0x48
struct AIDioramaPawn
{
public:
	class Pawn*                                                  Pawn;                                              // 0x0(0x8)
	char                                                         pad0x40_HJK1D[0x40];                               // 0x8(0x40)
};


// Size 0x2c
struct AIExclusionZone
{
public:
	struct Guid                                                  Id;                                                // 0x0(0x10)
	struct Vector                                                Location;                                          // 0x10(0xc)
	float                                                        RadiusSquared;                                     // 0x1c(0x4)
	float                                                        Radius;                                            // 0x20(0x4)
	float                                                        Height;                                            // 0x24(0x4)
	struct TimerHandle                                           RemoveTimer;                                       // 0x28(0x4)
};


// Size 0x2c
struct AIDebugVisualisationCone
{
public:
	struct Vector                                                Origin;                                            // 0x0(0xc)
	struct Vector                                                Direction;                                         // 0xc(0xc)
	float                                                        Length;                                            // 0x18(0x4)
	float                                                        AngleWidthRadians;                                 // 0x1c(0x4)
	float                                                        AngleHeightRadians;                                // 0x20(0x4)
	float                                                        LifeTime;                                          // 0x24(0x4)
	char                                                         Colour;                                            // 0x28(0x1)
	char                                                         pad0x3_VWE62[0x3];                                 // 0x29(0x3)
};


// Size 0x10
struct PlayerKillAITelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
};


// Size 0xc
struct AthenaAIControllerHealthCustomisation
{
public:
	bool                                                         OverrideMaxHealth;                                 // 0x0(0x1)
	bool                                                         OverrideMaxHealthWithMinMax;                       // 0x1(0x1)
	char                                                         pad0x2_4LZQJ[0x2];                                 // 0x2(0x2)
	float                                                        MinHealth;                                         // 0x4(0x4)
	float                                                        MaxHealth;                                         // 0x8(0x4)
};


// Size 0x1
struct TinySharkWorldSettingsParams
{
public:
	bool                                                         TinySharkEnabled;                                  // 0x0(0x1)
};


// Size 0x30
struct AIDropSpawnerRankMapping
{
public:
	char                                                         pad0x20_5V7LG[0x20];                               // 0x0(0x20)
	TArray<float>                                                Weights;                                           // 0x20(0x10)
};


// Size 0x10
struct AIProgressiveWavesSpawnerArchive
{
public:
	char                                                         pad0x8_BHCS2[0x8];                                 // 0x0(0x8)
	int                                                          CurrentWaveIndex;                                  // 0x8(0x4)
	char                                                         pad0x4_4EXLP[0x4];                                 // 0xc(0x4)
};


// Size 0x18
struct AIIncrementalWaveSpawnerArchive
{
public:
	char                                                         pad0x8_V958I[0x8];                                 // 0x0(0x8)
	struct Vector                                                LastTargetPosition;                                // 0x8(0xc)
	int                                                          CurrentNumSpawnedPawns;                            // 0x14(0x4)
};


// Size 0x30
struct AIPerPlayerSpawnerPlayerDetailsUnit
{
public:
	char                                                         pad0x30_VKXUA[0x30];                               // 0x0(0x30)
};


// Size 0x8
struct EventAIPawnCarrierChange
{
public:
	class Actor*                                                 Carrier;                                           // 0x0(0x8)
};


// Size 0x88
struct AITelemetryFragment
{
public:
	struct FString                                               AIType;                                            // 0x0(0x10)
	struct FString                                               AIID;                                              // 0x10(0x10)
	TArray<String>                                               AILoadOut;                                         // 0x20(0x10)
	struct FString                                               AIPawnType;                                        // 0x30(0x10)
	struct FString                                               AISkillset;                                        // 0x40(0x10)
	struct FString                                               AiForm;                                            // 0x50(0x10)
	struct FString                                               AIClass;                                           // 0x60(0x10)
	bool                                                         IsEmergent;                                        // 0x70(0x1)
	char                                                         pad0x3_FBTC4[0x3];                                 // 0x71(0x3)
	struct Guid                                                  AICrewId;                                          // 0x74(0x10)
	char                                                         pad0x4_4S5TF[0x4];                                 // 0x84(0x4)
};


// Size 0x18
struct EventPawnStartedDying
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
	char                                                         DeathType;                                         // 0x8(0x1)
	char                                                         pad0x7_0TPBU[0x7];                                 // 0x9(0x7)
	class Actor*                                                 Instigator;                                        // 0x10(0x8)
};


// Size 0x1
struct EventPawnRequestDespawn
{
public:
	char                                                         pad0x1_8WQ5X[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct FaunaBreedRequirement
{
public:
	class UClass*                                                Breed;                                             // 0x0(0x8)
	int                                                          Count;                                             // 0x8(0x4)
	char                                                         pad0x4_X9BES[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct PetLoadedMaterial
{
public:
	class MaterialInstance*                                      MaterialInstance;                                  // 0x0(0x8)
	bool                                                         CastShadows;                                       // 0x8(0x1)
	char                                                         pad0x7_KJOBZ[0x7];                                 // 0x9(0x7)
};


// Size 0x8
struct EventFaunaAgitationBegun
{
public:
	class Actor*                                                 SourceActor;                                       // 0x0(0x8)
};


// Size 0x1
struct EventAIControllerUnPossess
{
public:
	char                                                         pad0x1_3FG2P[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct QuestVariableSharkPawn
{
public:
	char                                                         pad0x30_849KV[0x30];                               // 0x0(0x30)
};


// Size 0x1
struct EventSporeBreathAIAbilityFinished
{
public:
	char                                                         pad0x1_G507X[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventAthenaAISpawnBeginAnim
{
public:
	char                                                         SpawnType;                                         // 0x0(0x1)
};


// Size 0x18
struct AISpawnWaveSequenceRankMapping
{
public:
	class AISpawnWaveSequence*                                   SpawnWaveSequence;                                 // 0x0(0x8)
	TArray<float>                                                Weights;                                           // 0x8(0x10)
};


// Size 0x20
struct FeatureToggledAIEncounterSpecificSkillSet
{
public:
	struct StringAssetReference                                  ToggledSpecificSkillset;                           // 0x0(0x10)
	struct FeatureFlag                                           Feature;                                           // 0x10(0xc)
	char                                                         pad0x4_SKLLQ[0x4];                                 // 0x1c(0x4)
};


// Size 0x1
struct EventFaunaThreatLevelChanged
{
public:
	char                                                         ThreatLevel;                                       // 0x0(0x1)
};


// Size 0x38
struct AthenaAIAbilityPlayerBasedRange
{
public:
	int                                                          MaxPlayers;                                        // 0x0(0x4)
	char                                                         pad0x4_Q12KE[0x4];                                 // 0x4(0x4)
	struct WeightedProbabilityRangeOfRanges                      WeightedArray;                                     // 0x8(0x30)
};


// Size 0x40
struct TinySharkSpawnTelemetryEvent
{
public:
	struct FString                                               TinySharkId;                                       // 0x0(0x10)
	struct FString                                               TinySharkType;                                     // 0x10(0x10)
	struct Guid                                                  ConfigSpawnId;                                     // 0x20(0x10)
	int                                                          NumTinySharkOnServer;                              // 0x30(0x4)
	struct Vector                                                SpawnLocation;                                     // 0x34(0xc)
};


// Size 0x18
struct AIAmmoRankMapping
{
public:
	class AthenaAIAmmoDataAsset*                                 Ammo;                                              // 0x0(0x8)
	TArray<float>                                                Weights;                                           // 0x8(0x10)
};


// Size 0x48
struct MerchantCrateMetaWrapper
{
public:
	char                                                         pad0x18_0QVS3[0x18];                               // 0x0(0x18)
	float                                                        Health;                                            // 0x18(0x4)
	char                                                         pad0x4_JAPZP[0x4];                                 // 0x1c(0x4)
	struct StringAssetReference                                  FaunaType;                                         // 0x20(0x10)
	float                                                        TimeSpentStarving;                                 // 0x30(0x4)
	float                                                        TimeToStarveInSeconds;                             // 0x34(0x4)
	struct Vector                                                TempSpawnLocationForActor;                         // 0x38(0xc)
	char                                                         pad0x4_CQ8VM[0x4];                                 // 0x44(0x4)
};


// Size 0x1
struct EventAIVulnerabilityAbilityEnded
{
public:
	char                                                         pad0x1_ZDDXK[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct BountySpawnerAudioChangedNetworkEvent
{
public:
	char                                                         pad0x18_OEZKT[0x18];                               // 0x0(0x18)
	char                                                         AudioState;                                        // 0x18(0x1)
	char                                                         pad0x3_L2EQT[0x3];                                 // 0x19(0x3)
	float                                                        Intensity;                                         // 0x1c(0x4)
	char                                                         BountyType;                                        // 0x20(0x1)
	char                                                         pad0x3_5DLU7[0x3];                                 // 0x21(0x3)
	struct Vector                                                BountyPosition;                                    // 0x24(0xc)
};


// Size 0x8
struct EventPlayerLeftAISpawnableWater
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x48
struct AITeleportActionStateConstructionInfo
{
public:
	char                                                         pad0x48_V19QB[0x48];                               // 0x0(0x48)
};


// Size 0x20
struct SpawnLocationGroup
{
public:
	TArray<struct Name>                                          AllowedSpawnTypes;                                 // 0x0(0x10)
	TArray<struct Vector>                                        SpawnLocations;                                    // 0x10(0x10)
};


// Size 0x40
struct AICustomNameTitleMapping
{
public:
	class UClass*                                                AIClassId;                                         // 0x0(0x8)
	struct FText                                                 Title;                                             // 0x8(0x38)
};


// Size 0x10
struct ExperienceTracker
{
public:
	class TaleQuestTinySharkExperienceTracker*                   Tracker;                                           // 0x0(0x8)
	char                                                         pad0x8_10OX9[0x8];                                 // 0x8(0x8)
};


// Size 0x8
struct EventAIAmmoSelected
{
public:
	class AthenaAIAmmoDataAsset*                                 Ammo;                                              // 0x0(0x8)
};


// Size 0x10
struct WeightedAmmoType
{
public:
	float                                                        ProbabilityAtRange;                                // 0x0(0x4)
	char                                                         pad0x4_J7ECW[0x4];                                 // 0x4(0x4)
	class UClass*                                                AmmoType;                                          // 0x8(0x8)
};


// Size 0x28
struct EventAIBountySpawnerWaveCompleted
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	TArray<struct Guid>                                          ParticipatingCrewIds;                              // 0x8(0x10)
	int                                                          WaveIndex;                                         // 0x18(0x4)
	int                                                          TotalWaves;                                        // 0x1c(0x4)
	class Actor*                                                 InstigatorOfFinalAIPawnDeath;                      // 0x20(0x8)
};


// Size 0x50
struct TaleQuestTinySharkSpawnTelemetryEvent
{
public:
	char                                                         pad0x40_HQ9XF[0x40];                               // 0x0(0x40)
	struct Guid                                                  VoyageID;                                          // 0x40(0x10)
};


// Size 0x68
struct TinySharkShipSpawnData
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	struct WeightedProbabilityRangeOfRanges                      Timer;                                             // 0x8(0x30)
	TArray<Class>                                                ControllerParams;                                  // 0x38(0x10)
	struct WeightedProbabilityRange                              ControllerParamsToUse;                             // 0x48(0x20)
};


// Size 0x10
struct AIControllerDynamicBalancingPlayerShipValueDesc
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	int                                                          ShipValue;                                         // 0x8(0x4)
	char                                                         pad0x4_MC5F5[0x4];                                 // 0xc(0x4)
};


// Size 0x30
struct AthenaAIItemParamValue
{
public:
	char                                                         pad0x20_XZ5UW[0x20];                               // 0x0(0x20)
	struct FName                                                 ParamName;                                         // 0x20(0x8)
	float                                                        Value;                                             // 0x28(0x4)
	char                                                         pad0x4_J664E[0x4];                                 // 0x2c(0x4)
};


// Size 0x14
struct AthenaAICharacterParams
{
public:
	float                                                        MissFiringHeightOffset;                            // 0x0(0x4)
	float                                                        MissFiringTargetInFrontOffset;                     // 0x4(0x4)
	float                                                        MinMissFiringTargetInFrontOffset;                  // 0x8(0x4)
	float                                                        MaxMissFiringTargetInFrontOffset;                  // 0xc(0x4)
	float                                                        BufferTimeWhenChangingItems;                       // 0x10(0x4)
};


// Size 0x8
struct EventPawnRemoveOwnership
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
};


// Size 0x68
struct EventAIBountySpawnerTargetKilled
{
public:
	struct FText                                                 TargetName;                                        // 0x0(0x38)
	class Actor*                                                 TargetActor;                                       // 0x38(0x8)
	struct FName                                                 RewardId;                                          // 0x40(0x8)
	class ItemInfo*                                              ItemDropped;                                       // 0x48(0x8)
	char                                                         Rank;                                              // 0x50(0x1)
	char                                                         pad0x3_WORNB[0x3];                                 // 0x51(0x3)
	struct Vector                                                DeathLocation;                                     // 0x54(0xc)
	class Actor*                                                 Instigator;                                        // 0x60(0x8)
};


// Size 0x20
struct TargetSkillsetProgressionPair
{
public:
	struct StringAssetReference                                  CrewSkillset;                                      // 0x0(0x10)
	struct StringAssetReference                                  CaptainSkillset;                                   // 0x10(0x10)
};


// Size 0x10
struct EventAIStartedDeadActionState
{
public:
	char                                                         DeathReason;                                       // 0x0(0x1)
	char                                                         pad0x7_KJJVE[0x7];                                 // 0x1(0x7)
	class Actor*                                                 Killer;                                            // 0x8(0x8)
};


// Size 0x1
struct StartCreatureSplineMovementEvent
{
public:
	char                                                         pad0x1_RUWBM[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct SirenEncounterData
{
public:
	class World*                                                 GameWorld;                                         // 0x0(0x8)
	class AIPerPlayerSpawner*                                    SirenSpawner;                                      // 0x8(0x8)
	class SimpleAIRegion*                                        AIRegion;                                          // 0x10(0x8)
	class AIProximityPlayerTracker*                              ProximityPlayerTracker;                            // 0x18(0x8)
	float                                                        ShutdownTime;                                      // 0x20(0x4)
	char                                                         SirenEncounterState;                               // 0x24(0x1)
	char                                                         pad0x3_YK318[0x3];                                 // 0x25(0x3)
};


// Size 0x2c
struct AIHealthChangeTelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	float                                                        CurrentHealth;                                     // 0x10(0x4)
	float                                                        PreviousHealth;                                    // 0x14(0x4)
	float                                                        HealthDelta;                                       // 0x18(0x4)
	struct Vector                                                Position;                                          // 0x1c(0xc)
	char                                                         Reason;                                            // 0x28(0x1)
	char                                                         pad0x3_8AGG3[0x3];                                 // 0x29(0x3)
};


// Size 0x20
struct EventCrewedShipLeftAISpawnRegion
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	char                                                         pad0x18_SIW9K[0x18];                               // 0x8(0x18)
};


// Size 0x1
struct EventSporeBreathAIAbilityStarted
{
public:
	char                                                         pad0x1_OK6DK[0x1];                                 // 0x0(0x1)
};


// Size 0x2
struct EventAthenaAISpawnActive
{
public:
	char                                                         SpawnType;                                         // 0x0(0x1)
	bool                                                         SpawnActive;                                       // 0x1(0x1)
};


// Size 0x8
struct MinMaxAbilityRange
{
public:
	float                                                        MinDistanceToTarget;                               // 0x0(0x4)
	float                                                        MaxDistanceToTarget;                               // 0x4(0x4)
};


// Size 0x30
struct BountySpawnerNewWaveGroupSpawnedEvent
{
public:
	bool                                                         IsFinalWave;                                       // 0x0(0x1)
	char                                                         pad0x3_0Z8QA[0x3];                                 // 0x1(0x3)
	struct FName                                                 IslandName;                                        // 0x4(0x8)
	char                                                         pad0x4_RFM00[0x4];                                 // 0xc(0x4)
	TArray<struct Guid>                                          ParticipatingCrewIds;                              // 0x10(0x10)
	int                                                          WaveIndex;                                         // 0x20(0x4)
	int                                                          TotalWaves;                                        // 0x24(0x4)
	class Actor*                                                 Instigator;                                        // 0x28(0x8)
};


// Size 0x10
struct AthenaAICharacterControllerWeightedAmmoType
{
public:
	class UClass*                                                AmmoType;                                          // 0x0(0x8)
	float                                                        Weighting;                                         // 0x8(0x4)
	char                                                         pad0x4_9INWN[0x4];                                 // 0xc(0x4)
};


// Size 0x1
struct EventFaunaAnimationStartChargeAttack
{
public:
	bool                                                         ChargeAttacked;                                    // 0x0(0x1)
};


// Size 0x1
struct AthenaAIDebugCostData
{
public:
	char                                                         pad0x1_G08JZ[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct AIBountySpawnerArchiveWaveEntry
{
public:
	int                                                          NumPawnsToSpawn;                                   // 0x0(0x4)
};


// Size 0x10
struct EventAIPawnAddedToAIRegion
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
	char                                                         pad0x8_SS3XS[0x8];                                 // 0x8(0x8)
};


// Size 0xc
struct TinyCreatureSpawnedTelemetryEvent
{
public:
	struct Vector                                                SpawnedLocation;                                   // 0x0(0xc)
};


// Size 0x20
struct AIFaunaSpawnerTelemetryEvents
{
public:
	struct FString                                               SpawnedFauna;                                      // 0x0(0x10)
	struct FString                                               IslandName;                                        // 0x10(0x10)
};


// Size 0x50
struct EventOwnedPawnFinishedSpawning
{
public:
	class Object*                                                AICoordinator;                                     // 0x0(0x8)
	struct FName                                                 Region;                                            // 0x8(0x8)
	struct Vector                                                SpawnPos;                                          // 0x10(0xc)
	char                                                         pad0x4_25H7Q[0x4];                                 // 0x1c(0x4)
	class Actor*                                                 ActorToPerceiveOnSpawn;                            // 0x20(0x8)
	float                                                        MaximumDistanceToPerceiveOnSpawn;                  // 0x28(0x4)
	char                                                         pad0x4_MLC4X[0x4];                                 // 0x2c(0x4)
	class AthenaAIControllerParamsDataAsset*                     Skillset;                                          // 0x30(0x8)
	struct FName                                                 HomeRegionZone;                                    // 0x38(0x8)
	class Object*                                                TargetInteractableOnSpawn;                         // 0x40(0x8)
	class AISpawner*                                             OwnerAISpawner;                                    // 0x48(0x8)
};


// Size 0x18
struct AIWeightedProbabilityRangeOfRangesRankMapping
{
public:
	class AIWeightedProbabilityRangeOfRangesAsset*               RangeOfRanges;                                     // 0x0(0x8)
	TArray<float>                                                Weights;                                           // 0x8(0x10)
};


// Size 0xc
struct AIAbilityDebugReplicatedIntervals
{
public:
	float                                                        ActivationTimerCooldown;                           // 0x0(0x4)
	float                                                        TimeBeforeNextExecution;                           // 0x4(0x4)
	float                                                        DamageBeforeNextExecution;                         // 0x8(0x4)
};


// Size 0x8
struct LureDartInWaterData
{
public:
	char                                                         pad0x8_INF4U[0x8];                                 // 0x0(0x8)
};


// Size 0x1
struct EventOwnedPawnFinishedDying
{
public:
	char                                                         DeathType;                                         // 0x0(0x1)
};


// Size 0x10
struct PerDepthSpawnChance
{
public:
	float                                                        DepthUpperBound;                                   // 0x0(0x4)
	float                                                        DepthLowerBound;                                   // 0x4(0x4)
	float                                                        ChanceToSpawn;                                     // 0x8(0x4)
	float                                                        ChanceToSpawnWithLureActive;                       // 0xc(0x4)
};


// Size 0x1
struct EventTinySharkKilled
{
public:
	char                                                         pad0x1_1JCDV[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct TinySharkKilledNetworkEvent
{
public:
	char                                                         pad0x18_A09OI[0x18];                               // 0x0(0x18)
};


// Size 0x20
struct BountySpawnerTargetDesc
{
public:
	char                                                         Gender;                                            // 0x0(0x1)
	char                                                         Rank;                                              // 0x1(0x1)
	char                                                         pad0x6_WWCSF[0x6];                                 // 0x2(0x6)
	class UClass*                                                AIClassIdOverride;                                 // 0x8(0x8)
	char                                                         pad0x10_RRF9D[0x10];                               // 0x10(0x10)
};


// Size 0x28
struct TinyCreatureFleeRpc
{
public:
	char                                                         pad0x18_Y238F[0x18];                               // 0x0(0x18)
	class Actor*                                                 TinyCreatureManager;                               // 0x18(0x8)
	int                                                          TinyCreatureIndex;                                 // 0x20(0x4)
	char                                                         pad0x4_1DKYN[0x4];                                 // 0x24(0x4)
};


// Size 0x14
struct AthenaAIControllerDamageTargetScoreFromPerceivedTarget
{
public:
	float                                                        MinDamageTargetScore;                              // 0x0(0x4)
	float                                                        MaxDamageTargetScore;                              // 0x4(0x4)
	float                                                        DamageForMinDamageTargetScore;                     // 0x8(0x4)
	float                                                        DamageForMaxDamageTargetScore;                     // 0xc(0x4)
	float                                                        RateToDecayDamagedFromTarget;                      // 0x10(0x4)
};


// Size 0x18
struct DamageModifierCrewProximityVulnerabilityPairs
{
public:
	int                                                          NumPlayersInRange;                                 // 0x0(0x4)
	float                                                        GlobalDamageMultiplier;                            // 0x4(0x4)
	TArray<struct DamageableVulnerabilityPair>                   DamageMultipliers;                                 // 0x8(0x10)
};


// Size 0x24
struct AthenaAIControllerSenseSettings
{
public:
	bool                                                         EnableSight;                                       // 0x0(0x1)
	bool                                                         EnableHearing;                                     // 0x1(0x1)
	bool                                                         EnableDamage;                                      // 0x2(0x1)
	char                                                         pad0x1_VU9MD[0x1];                                 // 0x3(0x1)
	float                                                        SightRadius;                                       // 0x4(0x4)
	float                                                        LoseSightRadius;                                   // 0x8(0x4)
	float                                                        PeripheralVisionAngleDegrees;                      // 0xc(0x4)
	float                                                        MaxHearingRange;                                   // 0x10(0x4)
	float                                                        MaxHearingRangeForCrouching;                       // 0x14(0x4)
	float                                                        SightRadiusForCrouching;                           // 0x18(0x4)
	float                                                        LoseSightRadiusForCrouching;                       // 0x1c(0x4)
	float                                                        PeripheralVisionAngleDegreesForCrouching;          // 0x20(0x4)
};


// Size 0x10
struct AIStategyControllerMovementMod
{
public:
	class UClass*                                                AIStrategy;                                        // 0x0(0x8)
	float                                                        OverrideControlRotationInterpSpeed;                // 0x8(0x4)
	char                                                         pad0x4_KKCPU[0x4];                                 // 0xc(0x4)
};


// Size 0x20
struct AIFixedWavesSpawnerArchive
{
public:
	char                                                         pad0x8_K7IX5[0x8];                                 // 0x0(0x8)
	TArray<int>                                                  NumSpawnedPawnsInWaves;                            // 0x8(0x10)
	bool                                                         WavesSpawnedOnSpottedNewTarget;                    // 0x18(0x1)
	char                                                         pad0x7_7S0Y1[0x7];                                 // 0x19(0x7)
};


// Size 0x20
struct EventPlayerSetFootUponAISpawnRegion
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	char                                                         pad0x18_5CM25[0x18];                               // 0x8(0x18)
};


// Size 0x10
struct AISpawnContextData
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	class UClass*                                                Id;                                                // 0x8(0x8)
};


// Size 0x18
struct AIEncounterGenerationRecipeFeatureBasedRankOrderList
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	TArray<class AIEncounterGenerationRecipe*>                   Recipes;                                           // 0x8(0x10)
};


// Size 0x1
struct EventAIPartRetrievalRequestFailed
{
public:
	char                                                         pad0x1_SCJ71[0x1];                                 // 0x0(0x1)
};


// Size 0x68
struct TinySharkCollidedTelemetryEvent
{
public:
	struct FString                                               TinySharkId;                                       // 0x0(0x10)
	struct FString                                               TinySharkName;                                     // 0x10(0x10)
	struct FString                                               ObstacleName;                                      // 0x20(0x10)
	struct Vector                                                CollisionLocation;                                 // 0x30(0xc)
	struct Vector                                                HomeLocation;                                      // 0x3c(0xc)
	struct FString                                               BehaviourTreeInfo;                                 // 0x48(0x10)
	struct FString                                               BlackboardInfo;                                    // 0x58(0x10)
};


// Size 0x8
struct AISpawnerArchive
{
public:
	char                                                         pad0x8_EPJE3[0x8];                                 // 0x0(0x8)
};


// Size 0x18
struct PetFlyingStrategyProperties
{
public:
	class UClass*                                                Strategy;                                          // 0x0(0x8)
	float                                                        ChanceOfFlying;                                    // 0x8(0x4)
	float                                                        MinFlyingMeshZOffset;                              // 0xc(0x4)
	float                                                        MaxFlyingMeshZOffset;                              // 0x10(0x4)
	char                                                         pad0x4_XLH1S[0x4];                                 // 0x14(0x4)
};


// Size 0x10
struct TinySharkTrackedShipDistanceThresholdByFeature
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x0(0xc)
	float                                                        TrackedShipDistanceThreshold;                      // 0xc(0x4)
};


// Size 0x30
struct AINameplateVisibilitySettings
{
public:
	float                                                        VisibleFromWorldDistance;                          // 0x0(0x4)
	float                                                        VisibleUntilWorldDistance;                         // 0x4(0x4)
	float                                                        VisibleAfterDeathDuration;                         // 0x8(0x4)
	bool                                                         OverrideFriendlyVisibility;                        // 0xc(0x1)
	char                                                         pad0x3_PS0TD[0x3];                                 // 0xd(0x3)
	float                                                        FriendlyVisibleFromWorldDistance;                  // 0x10(0x4)
	float                                                        FriendlyVisibleUntilWorldDistance;                 // 0x14(0x4)
	bool                                                         ShouldFriendlyNameplatesOcclude;                   // 0x18(0x1)
	char                                                         pad0x7_TP0EN[0x7];                                 // 0x19(0x7)
	struct StringAssetReference                                  NameplateIcon;                                     // 0x20(0x10)
};


// Size 0x24
struct AIDebugVisualisationCylinder
{
public:
	struct Vector                                                To;                                                // 0x0(0xc)
	struct Vector                                                From;                                              // 0xc(0xc)
	float                                                        Radius;                                            // 0x18(0x4)
	float                                                        LifeTime;                                          // 0x1c(0x4)
	char                                                         Colour;                                            // 0x20(0x1)
	char                                                         pad0x3_2P5ZE[0x3];                                 // 0x21(0x3)
};


// Size 0x28
struct AIDioramaRoleDesc
{
public:
	struct FName                                                 RoleName;                                          // 0x0(0x8)
	struct StringAssetReference                                  CustomAnimationAsset;                              // 0x8(0x10)
	struct FName                                                 CustomAnimationToRunOnSpawn;                       // 0x18(0x8)
	class UClass*                                                StartingItemCategory;                              // 0x20(0x8)
};


// Size 0x20
struct AthenaAISharedControllerParamToggledValues
{
public:
	TArray<class AthenaAIControllerSharedParamValuesDataAsset*>  Assets;                                            // 0x0(0x10)
	struct FeatureFlag                                           FeatureName;                                       // 0x10(0xc)
	char                                                         pad0x4_YIVYD[0x4];                                 // 0x1c(0x4)
};


// Size 0x10
struct EventAIPawnRemovedFromAIRegion
{
public:
	class Pawn*                                                  AIPawn;                                            // 0x0(0x8)
	char                                                         pad0x8_TPML0[0x8];                                 // 0x8(0x8)
};


// Size 0x20
struct EventCrewedShipEnteredAISpawnRegion
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	char                                                         pad0x18_V34KT[0x18];                               // 0x8(0x18)
};


// Size 0x38
struct SwimAttackTargetShipImpulseData
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	float                                                        PushImpulseForce;                                  // 0x8(0x4)
	struct Vector                                                PushImpulseLocation;                               // 0xc(0xc)
	float                                                        PushForceScalingFactorForeAndAftOfShipLowerBound;  // 0x18(0x4)
	float                                                        PushForceScalingFactorForeAndAftOfShipUpperBound;  // 0x1c(0x4)
	float                                                        RollImpulseForce;                                  // 0x20(0x4)
	struct Vector                                                RollImpulseLocation;                               // 0x24(0xc)
	float                                                        RollForceScalingFactorForeAndAftOfShipLowerBound;  // 0x30(0x4)
	float                                                        RollForceScalingFactorForeAndAftOfShipUpperBound;  // 0x34(0x4)
};


// Size 0x18
struct AIStrategyMovementProperties
{
public:
	class UClass*                                                AIStrategy;                                        // 0x0(0x8)
	float                                                        MaxSpeedAmp;                                       // 0x8(0x4)
	float                                                        MaxAccelAmp;                                       // 0xc(0x4)
	float                                                        OverrideRVOAvoidanceRadius;                        // 0x10(0x4)
	float                                                        OverrideBlendSpeed;                                // 0x14(0x4)
};


// Size 0x60
struct EventTinySharkDamaged
{
public:
	struct ImpactDamageEvent                                     ImpactDamageEvent;                                 // 0x0(0x58)
	char                                                         TinySharkVariant;                                  // 0x58(0x1)
	char                                                         pad0x3_RHIZ5[0x3];                                 // 0x59(0x3)
	float                                                        VulnerabilityModifier;                             // 0x5c(0x4)
};


// Size 0x8
struct MinMaxBurrowAbility
{
public:
	float                                                        MinValue;                                          // 0x0(0x4)
	float                                                        MaxValue;                                          // 0x4(0x4)
};


// Size 0x2
struct AttitudeOverrideEntry
{
public:
	char                                                         TeamToOverride;                                    // 0x0(0x1)
	char                                                         AttitudeOverride;                                  // 0x1(0x1)
};


// Size 0x50
struct AISpawnerTelemetryEvent
{
public:
	struct FString                                               AISpawnerSourceAsset;                              // 0x0(0x10)
	struct FString                                               AISpawnerType;                                     // 0x10(0x10)
	struct FString                                               AISpawnerRegion;                                   // 0x20(0x10)
	TArray<String>                                               AISpawnerContexts;                                 // 0x30(0x10)
	int                                                          AISpawnerWaveSpawnNumber;                          // 0x40(0x4)
	float                                                        AISpawnerWaveDelayBefore;                          // 0x44(0x4)
	float                                                        AISpawnerWaveDelayAfter;                           // 0x48(0x4)
	char                                                         pad0x4_DHT6L[0x4];                                 // 0x4c(0x4)
};


// Size 0x10
struct IslandDioramas
{
public:
	TArray<class Interface*>                                     Entries;                                           // 0x0(0x10)
};


// Size 0x40
struct AIDioramaLocationSourceComponentData
{
public:
	struct Transform                                             RelativeTransform;                                 // 0x0(0x30)
	class Actor*                                                 Interactable;                                      // 0x30(0x8)
	char                                                         pad0x8_Z4V8J[0x8];                                 // 0x38(0x8)
};


// Size 0x1
struct EventAIPartsRetrievalComponentBeforeBeginLoad
{
public:
	char                                                         pad0x1_8THDH[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct FaunaSpawnaReplicatedFishState
{
public:
	class FishingFish*                                           FishingFish;                                       // 0x0(0x8)
	char                                                         FishingFishState;                                  // 0x8(0x1)
	bool                                                         FishHasEscaped;                                    // 0x9(0x1)
	char                                                         pad0x6_W5Z7R[0x6];                                 // 0xa(0x6)
};


// Size 0x18
struct RequestAIAssistanceTelemetryEvent
{
public:
	struct FString                                               BootyName;                                         // 0x0(0x10)
	bool                                                         WasSuccess;                                        // 0x10(0x1)
	char                                                         pad0x7_WNIP6[0x7];                                 // 0x11(0x7)
};


// Size 0x58
struct EventTaleQuestTinySharkDespawned
{
public:
	char                                                         pad0x48_50579[0x48];                               // 0x0(0x48)
	struct Guid                                                  VoyageID;                                          // 0x48(0x10)
};


// Size 0x1
struct EventAIDebugTextUpdated
{
public:
	char                                                         pad0x1_47BXI[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct AISpawnOverride
{
public:
	struct StringAssetReference                                  FormOverride;                                      // 0x0(0x10)
};


// Size 0x10
struct AICountTelemetryEvent
{
public:
	int                                                          NumTotalSpawns;                                    // 0x0(0x4)
	int                                                          CurrentTotalWorldAICostUnits;                      // 0x4(0x4)
	int                                                          NumActiveRegions;                                  // 0x8(0x4)
	int                                                          NumPlayers;                                        // 0xc(0x4)
};


// Size 0x18
struct AIFormRankMapping
{
public:
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x0(0x8)
	TArray<float>                                                Weights;                                           // 0x8(0x10)
};


// Size 0x38
struct ConditionalBasedOnBlackboardKey
{
public:
	bool                                                         UseCondition;                                      // 0x0(0x1)
	char                                                         pad0x7_8KXE3[0x7];                                 // 0x1(0x7)
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x8(0x28)
	bool                                                         NegateCondition;                                   // 0x30(0x1)
	char                                                         pad0x7_9CQJI[0x7];                                 // 0x31(0x7)
};


// Size 0x1
struct EventAIVulnerabilityAbilityStarted
{
public:
	char                                                         pad0x1_3HKFQ[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct EventTinySharkDespawned
{
public:
	struct Guid                                                  TinySharkExperienceId;                             // 0x0(0x10)
	struct FString                                               TinySharkPartTag;                                  // 0x10(0x10)
	char                                                         DespawnReason;                                     // 0x20(0x1)
	char                                                         pad0x7_WYT16[0x7];                                 // 0x21(0x7)
	double                                                       TimeToCompleteAfterEngagedInSeconds;               // 0x28(0x8)
	float                                                        TotalTrackingIdleTime;                             // 0x30(0x4)
	float                                                        TotalIdleTimeAfterEngaged;                         // 0x34(0x4)
	TArray<struct Guid>                                          ParticipatingCrewIds;                              // 0x38(0x10)
};


// Size 0xd0
struct AIEncounterSpecification
{
public:
	char                                                         pad0x20_408YD[0x20];                               // 0x0(0x20)
	class AthenaAIControllerParamsDataAsset*                     Skillset;                                          // 0x20(0x8)
	class LoadoutAsset*                                          Loadout;                                           // 0x28(0x8)
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x30(0x8)
	class AthenaAIAmmoDataAsset*                                 Ammo;                                              // 0x38(0x8)
	class UClass*                                                AIClass;                                           // 0x40(0x8)
	class AIPartsCategory*                                       PartsCategory;                                     // 0x48(0x8)
	int                                                          TeamColorIndex;                                    // 0x70(0x4)
	struct FName                                                 DioramaRole;                                       // 0x74(0x8)
	char                                                         pad0x4_N7IA5[0x4];                                 // 0x7c(0x4)
	struct FText                                                 LocalisableName;                                   // 0x80(0x38)
	struct EncounterParams                                       EncounterTrackingParams;                           // 0xb8(0xc)
	int                                                          MinPlayersToEnable;                                // 0xc4(0x4)
	bool                                                         ShowNameplate;                                     // 0xc8(0x1)
	bool                                                         IsUsingDialogue;                                   // 0xc9(0x1)
	char                                                         pad0x6_GTGO6[0x6];                                 // 0xca(0x6)
};


// Size 0x50
struct LimitedInteractbaleAICreatureSplineInteractionParams
{
public:
	class UClass*                                                PressedNotificationInputId;                        // 0x0(0x8)
	class UClass*                                                ReleasedNotificationInputId;                       // 0x8(0x8)
	struct FText                                                 DescriptorVerb;                                    // 0x10(0x38)
	float                                                        HoldTime;                                          // 0x48(0x4)
	char                                                         pad0x4_DVLXG[0x4];                                 // 0x4c(0x4)
};


// Size 0x8
struct EventNewAIStrategy
{
public:
	class UClass*                                                NewAIStrategy;                                     // 0x0(0x8)
};


// Size 0x8
struct EventOceanCrawlerAIAbilityAudioRequest
{
public:
	char                                                         RequestAudioKey;                                   // 0x0(0x1)
	char                                                         pad0x3_4WLBA[0x3];                                 // 0x1(0x3)
	float                                                        AudioDelay;                                        // 0x4(0x4)
};


// Size 0xc
struct PetMovementRequest
{
public:
	char                                                         State;                                             // 0x0(0x1)
	char                                                         pad0x3_FCS3A[0x3];                                 // 0x1(0x3)
	float                                                        TargetMeshZOffset;                                 // 0x4(0x4)
	bool                                                         AdjustingFlight;                                   // 0x8(0x1)
	char                                                         pad0x3_JJKWB[0x3];                                 // 0x9(0x3)
};


// Size 0x30
struct AIIndividualVarietyEntry
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	char                                                         pad0x4_F3SYM[0x4];                                 // 0xc(0x4)
	TArray<struct StringAssetReference>                          Loadouts;                                          // 0x10(0x10)
	int                                                          RankOffset;                                        // 0x20(0x4)
	float                                                        Weight;                                            // 0x24(0x4)
	int                                                          MaxPerEncounter;                                   // 0x28(0x4)
	char                                                         pad0x4_DM32E[0x4];                                 // 0x2c(0x4)
};


// Size 0x50
struct AIEmoteActionStateConstructionInfo
{
public:
	char                                                         pad0x48_Y2704[0x48];                               // 0x0(0x48)
	bool                                                         ShouldStopMovementImmediatelyOnStart;              // 0x48(0x1)
	char                                                         pad0x7_KR3PB[0x7];                                 // 0x49(0x7)
};


// Size 0x128
struct AIPersistentSpawnerWave
{
public:
	char                                                         pad0x100_V3HDQ[0x100];                             // 0x0(0x100)
	bool                                                         CacheHealthOnDespawn;                              // 0x100(0x1)
	char                                                         pad0x7_FILGO[0x7];                                 // 0x101(0x7)
	class UClass*                                                AITypeToCache;                                     // 0x108(0x8)
	char                                                         pad0x18_JARQK[0x18];                               // 0x110(0x18)
};


// Size 0x20
struct TargetItemDropProgressionPair
{
public:
	struct StringAssetReference                                  CrewItemSpawn;                                     // 0x0(0x10)
	struct StringAssetReference                                  CaptainItemSpawn;                                  // 0x10(0x10)
};


// Size 0x8
struct AIPartId
{
public:
	struct FName                                                 PartId;                                            // 0x0(0x8)
};


// Size 0xa0
struct DioramaCategoryEntries
{
public:
	char                                                         pad0xa0_N2J6I[0xa0];                               // 0x0(0xa0)
};


// Size 0x10
struct AthenaAIAbilityDamageStage
{
public:
	TArray<class AthenaAIAbilityStageParams*>                    AbilitiesInStage;                                  // 0x0(0x10)
};


// Size 0xc
struct AIPerCrewSpawnerRespawnSettings
{
public:
	float                                                        MinRespawnTimeInterval;                            // 0x0(0x4)
	float                                                        MaxRespawnTimeInterval;                            // 0x4(0x4)
	float                                                        RespawnChance;                                     // 0x8(0x4)
};


// Size 0x10
struct AIActorTimeout
{
public:
	class Actor*                                                 AIActor;                                           // 0x0(0x8)
	float                                                        Timer;                                             // 0x8(0x4)
	char                                                         pad0x4_TCKO9[0x4];                                 // 0xc(0x4)
};


// Size 0x18
struct AIPerCrewSpawnerRespawnUnit
{
public:
	char                                                         pad0x18_X2MWG[0x18];                               // 0x0(0x18)
};


// Size 0xc
struct AthenaAIControllerParamValue
{
public:
	struct FName                                                 ParamName;                                         // 0x0(0x8)
	float                                                        Value;                                             // 0x8(0x4)
};


// Size 0x18
struct TinySharkBiteAttackShipTelemetryEvent
{
public:
	struct FString                                               TinySharkPartTag;                                  // 0x0(0x10)
	bool                                                         BiteCancelled;                                     // 0x10(0x1)
	char                                                         pad0x7_87M44[0x7];                                 // 0x11(0x7)
};


// Size 0x8
struct LureDartProxyActivatedInWaterEvent
{
public:
	class Actor*                                                 Proxy;                                             // 0x0(0x8)
};


// Size 0x10
struct AIFormDamageResponse
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	float                                                        DamageMultiplier;                                  // 0x8(0x4)
	char                                                         HitReaction;                                       // 0xc(0x1)
	bool                                                         IsKnockbackDisabled;                               // 0xd(0x1)
	bool                                                         IsStunDisabled;                                    // 0xe(0x1)
	char                                                         pad0x1_JVYWK[0x1];                                 // 0xf(0x1)
};


// Size 0x1
struct EventOceanCrawlerAIBuffAudioRequest
{
public:
	bool                                                         IsBuffGiver;                                       // 0x0(0x1)
};


// Size 0x38
struct BlackboardValueCondition
{
public:
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x0(0x28)
	char                                                         Comparison;                                        // 0x28(0x1)
	char                                                         pad0x3_Q7RBZ[0x3];                                 // 0x29(0x3)
	float                                                        Value;                                             // 0x2c(0x4)
	bool                                                         OnEntry;                                           // 0x30(0x1)
	bool                                                         OnExit;                                            // 0x31(0x1)
	char                                                         pad0x6_UZEEQ[0x6];                                 // 0x32(0x6)
};


// Size 0x1
struct EventAllAIProgressiveWavesCompleted
{
public:
	char                                                         pad0x1_X744M[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct FaunaAnimationBoarAttackStructure
{
public:
	class AnimSequence*                                          MeleeAttack;                                       // 0x0(0x8)
	class AnimSequence*                                          ChargeAttack;                                      // 0x8(0x8)
};


// Size 0x28
struct AIEncounterAndWaveSettingsOverride
{
public:
	class AIEncounterSettings*                                   EncounterSettings;                                 // 0x0(0x8)
	class AISpawnWaveSequenceRankProgression*                    SpawnWaveProgression;                              // 0x8(0x8)
	float                                                        Chance;                                            // 0x10(0x4)
	char                                                         pad0x4_601P8[0x4];                                 // 0x14(0x4)
	TArray<class AISpawnerPrerequisiteBase*>                     Prerequisites;                                     // 0x18(0x10)
};


// Size 0x18
struct EventOwnedPawnStartedDying
{
public:
	char                                                         DeathType;                                         // 0x0(0x1)
	char                                                         pad0x7_XIER1[0x7];                                 // 0x1(0x7)
	class Actor*                                                 Instigator;                                        // 0x8(0x8)
	char                                                         KillReason;                                        // 0x10(0x1)
	char                                                         pad0x7_RZSFX[0x7];                                 // 0x11(0x7)
};


// Size 0x18
struct AIDebugVisualisationSphere
{
public:
	struct Vector                                                Centre;                                            // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
	float                                                        LifeTime;                                          // 0x10(0x4)
	char                                                         Colour;                                            // 0x14(0x1)
	char                                                         pad0x3_COBFS[0x3];                                 // 0x15(0x3)
};


// Size 0x18
struct AISkillsetRankMapping
{
public:
	class AthenaAIControllerParamsDataAsset*                     Skillset;                                          // 0x0(0x8)
	TArray<float>                                                Weights;                                           // 0x8(0x10)
};


// Size 0x8
struct EventAIAbilityStarted
{
public:
	class UClass*                                                AbilityTypeCategory;                               // 0x0(0x8)
};


// Size 0x30
struct EventAILoadoutSelected
{
public:
	struct ItemLoadout                                           Loadout;                                           // 0x0(0x20)
	class UClass*                                                NonStorableItem;                                   // 0x20(0x8)
	char                                                         pad0x8_2O594[0x8];                                 // 0x28(0x8)
};


// Size 0x110
struct AIFaunaSpawnerWave
{
public:
	char                                                         pad0x110_KR16L[0x110];                             // 0x0(0x110)
};


// Size 0x38
struct TinySharkRepositionTelemetryEvent
{
public:
	struct Guid                                                  TinySharkExperienceId;                             // 0x0(0x10)
	struct FString                                               TinySharkPartTag;                                  // 0x10(0x10)
	struct Vector                                                DespawnLocation;                                   // 0x20(0xc)
	bool                                                         IsTaleTinyShark;                                   // 0x2c(0x1)
	char                                                         pad0x3_PR5LY[0x3];                                 // 0x2d(0x3)
	int                                                          NumTimesRepositioned;                              // 0x30(0x4)
	char                                                         pad0x4_1WKR6[0x4];                                 // 0x34(0x4)
};


// Size 0x58
struct ChanceAndBlackboardKeyPair
{
public:
	struct AIDataProviderFloatValue                              Chance;                                            // 0x0(0x30)
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x30(0x28)
};


// Size 0x48
struct TinySharkEQSRequest
{
public:
	char                                                         pad0x48_VCTZ3[0x48];                               // 0x0(0x48)
};


// Size 0x38
struct AthenaAIControllerTargetPickingData
{
public:
	struct FString                                               TargetName;                                        // 0x0(0x10)
	bool                                                         BestTargetByScore;                                 // 0x10(0x1)
	bool                                                         IsCurrentTargetActor;                              // 0x11(0x1)
	char                                                         pad0x2_46Q72[0x2];                                 // 0x12(0x2)
	float                                                        TargetScore;                                       // 0x14(0x4)
	float                                                        DistScore;                                         // 0x18(0x4)
	float                                                        FacingScore;                                       // 0x1c(0x4)
	float                                                        TargetWeightScore;                                 // 0x20(0x4)
	float                                                        DamageScore;                                       // 0x24(0x4)
	float                                                        TargetDistance;                                    // 0x28(0x4)
	float                                                        TargetAngle;                                       // 0x2c(0x4)
	int                                                          NumTargeting;                                      // 0x30(0x4)
	float                                                        RecentDamage;                                      // 0x34(0x4)
};


// Size 0x8
struct LureDartProxyRemovedFromWaterEvent
{
public:
	class Actor*                                                 Proxy;                                             // 0x0(0x8)
};


// Size 0x18
struct EventPlayerLeftAISpawnRegion
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	char                                                         pad0x10_MIW4K[0x10];                               // 0x8(0x10)
};


// Size 0x1
struct EventFaunaAgitationEnded
{
public:
	char                                                         pad0x1_I2NIU[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventAIFormSelected
{
public:
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x0(0x8)
};


// Size 0xf0
struct WeightedAISpawnTypeParams
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	int                                                          MaxTimesCanBeSelected;                             // 0x4(0x4)
	struct AISpawnTypeParams                                     Params;                                            // 0x8(0xe8)
};


// Size 0x20
struct AIEncounterWave
{
public:
	TArray<struct AIEncounterSpecification>                      Specifications;                                    // 0x0(0x10)
	TArray<int>                                                  SpecificationSpawnOrder;                           // 0x10(0x10)
};


// Size 0x18
struct AthenaAICharacterControllerItemCategoryNamedParams
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	TArray<struct AthenaAIControllerParamValue>                  NamedControllerParams;                             // 0x8(0x10)
};


// Size 0xd8
struct AITelemetryFragmentInput
{
public:
	char                                                         pad0x8_XXAVZ[0x8];                                 // 0x0(0x8)
	struct AIEncounterSpecification                              AIEncounterSpecification;                          // 0x8(0xd0)
};


// Size 0x18
struct ReplicatedAIPartsData
{
public:
	class AIPartsCategory*                                       PartsCategory;                                     // 0x0(0x8)
	struct AIPartId                                              AIPartId;                                          // 0x8(0x8)
	int                                                          MeshIndex;                                         // 0x10(0x4)
	int                                                          TeamColorIndex;                                    // 0x14(0x4)
};


// Size 0x70
struct AIBountySpawnerWaveGroup
{
public:
	TArray<struct AIBountySpawnerWave>                           Waves;                                             // 0x0(0x10)
	TArray<struct AIBountySpawnerWave>                           AdditionalCaptainWaves;                            // 0x10(0x10)
	int                                                          NumNonTargetAIToKillToMoveToNextWaveGroup;         // 0x20(0x4)
	char                                                         pad0x4_8LA8J[0x4];                                 // 0x24(0x4)
	class UClass*                                                CombatDialogueForWaveGroup;                        // 0x28(0x8)
	float                                                        DynamicDelayBeforeStart;                           // 0x30(0x4)
	bool                                                         WantsAdditionalWaveAI;                             // 0x34(0x1)
	char                                                         pad0x3_X9R85[0x3];                                 // 0x35(0x3)
	TArray<int>                                                  AdditionalWaveAIPerPlayer;                         // 0x38(0x10)
	TArray<int>                                                  AdditionalWaveCaptainAIPerPlayer;                  // 0x48(0x10)
	float                                                        WaveMusicIntensity;                                // 0x58(0x4)
	char                                                         pad0x14_QZ1C5[0x14];                               // 0x5c(0x14)
};


// Size 0x10
struct AthenaAIAbilityPlayerBasedRanges
{
public:
	TArray<struct AthenaAIAbilityPlayerBasedRange>               AbilityRanges;                                     // 0x0(0x10)
};


// Size 0x10
struct FeatureToggledAIEncounterSpecificSkillSetCollection
{
public:
	TArray<struct FeatureToggledAIEncounterSpecificSkillSet>     ToggledSkillsets;                                  // 0x0(0x10)
};


// Size 0x48
struct FaunaSpawnaImpactIdToSpawner
{
public:
	class UClass*                                                FaunaSpawnaSpawnId;                                // 0x0(0x8)
	bool                                                         UseLandRandomSpeciesAssortmentSpawner;             // 0x8(0x1)
	char                                                         pad0x7_L44CX[0x7];                                 // 0x9(0x7)
	class AIFixedWavesSpawner*                                   LandRandomSpeciesAssortmentSpawner;                // 0x10(0x8)
	class AIFixedWavesSpawner*                                   LandPigSpawner;                                    // 0x18(0x8)
	class AIFixedWavesSpawner*                                   LandChickenSpawner;                                // 0x20(0x8)
	class AIFixedWavesSpawner*                                   LandSnakeSpawner;                                  // 0x28(0x8)
	class AIFixedWavesSpawner*                                   SharkSpawner;                                      // 0x30(0x8)
	TArray<struct AttitudeOverrideEntry>                         SpawnedPawnAttitudeOverrides;                      // 0x38(0x10)
};


// Size 0x18
struct ConditionalAISpawnOverride
{
public:
	class AISpawnOverrideCondition*                              Condition;                                         // 0x0(0x8)
	struct AISpawnOverride                                       Override;                                          // 0x8(0x10)
};


// Size 0x38
struct AISpawnContextIdEncounterSettingsPair
{
public:
	TArray<class Class*>                                         SpawnContexts;                                     // 0x0(0x10)
	bool                                                         DisableSpawning;                                   // 0x10(0x1)
	char                                                         pad0x7_IBBZ4[0x7];                                 // 0x11(0x7)
	class AIEncounterSettings*                                   EncounterSettings;                                 // 0x18(0x8)
	class AISpawnWaveSequenceRankProgression*                    SpawnWaveProgression;                              // 0x20(0x8)
	TArray<struct AIEncounterAndWaveSettingsOverride>            EncounterAndWaveSettingsOverride;                  // 0x28(0x10)
};


// Size 0x18
struct AIPartsCategoryFormMapping
{
public:
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x0(0x8)
	TArray<struct AIPartsCategoryMapping>                        CategoryMappings;                                  // 0x8(0x10)
};


// Size 0x18
struct FaunaSpeciesRequirement
{
public:
	class UClass*                                                Species;                                           // 0x0(0x8)
	TArray<struct FaunaBreedRequirement>                         Breeds;                                            // 0x8(0x10)
};


// Size 0x20
struct AthenaAIControllerFeatureToggledParams
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x0(0xc)
	char                                                         pad0x4_1OG3Y[0x4];                                 // 0xc(0x4)
	TArray<struct AthenaAIControllerParamValue>                  Params;                                            // 0x10(0x10)
};


// Size 0x28
struct AIDebugSpawnConfiguration
{
public:
	int                                                          NumIslandsToSpawnOn;                               // 0x0(0x4)
	char                                                         pad0x4_QK70E[0x4];                                 // 0x4(0x4)
	TArray<struct Name>                                          SpecificRegionsToSpawnOn;                          // 0x8(0x10)
	TArray<struct AIDebugSpawnAmount>                            WhatToSpawn;                                       // 0x18(0x10)
};


// Size 0x10
struct AthenaAICharacterCannonTargetingParams
{
public:
	TArray<struct AthenaAICharacterCannonTarget>                 Params;                                            // 0x0(0x10)
};


// Size 0x30
struct AthenaAIControllerSenseSettingOverride
{
public:
	class UClass*                                                AIStrategy;                                        // 0x0(0x8)
	struct AthenaAIControllerSenseSettings                       SenseSettings;                                     // 0x8(0x24)
	bool                                                         ClearPerceivedData;                                // 0x2c(0x1)
	char                                                         pad0x3_G9C1J[0x3];                                 // 0x2d(0x3)
};


// Size 0x34
struct AITargetInfo
{
public:
	struct AITargetBounds                                        Bounds;                                            // 0x0(0x18)
	struct Vector                                                TargetPos;                                         // 0x18(0xc)
	struct Vector                                                TargetVelocity;                                    // 0x24(0xc)
	float                                                        TargetYaw;                                         // 0x30(0x4)
};


// Size 0xd0
struct TinySharkParams
{
public:
	class UClass*                                                TinySharkType;                                     // 0x0(0x8)
	float                                                        TargetRadius;                                      // 0x8(0x4)
	struct Vector                                                SpawnOffset;                                       // 0xc(0xc)
	class UClass*                                                TinySharkClassID;                                  // 0x78(0x8)
	struct WeightedProbabilityRangeOfRanges                      LifetimeTimeout;                                   // 0x80(0x30)
	float                                                        DespawnRequestTimeout;                             // 0xb0(0x4)
	char                                                         pad0x4_ZSY6X[0x4];                                 // 0xb4(0x4)
	TArray<struct TinySharkTrackedShipDistanceThresholdByFeature> TrackedShipDistanceThresholdByFeatureInPriorityOrder; // 0xb8(0x10)
	float                                                        RepositionTime;                                    // 0xc8(0x4)
	char                                                         pad0x4_L39LG[0x4];                                 // 0xcc(0x4)
};


// Size 0x18
struct WeightedAmmoTypeRange
{
public:
	float                                                        MinRange;                                          // 0x0(0x4)
	char                                                         pad0x4_NF7SE[0x4];                                 // 0x4(0x4)
	TArray<struct WeightedAmmoType>                              AmmoTypeProbabilities;                             // 0x8(0x10)
};


// Size 0x18
struct AIControllerDynamicBalancingNamedParamMapping
{
public:
	int                                                          MaxCrewStrength;                                   // 0x0(0x4)
	char                                                         pad0x4_2CVZZ[0x4];                                 // 0x4(0x4)
	TArray<struct AthenaAIControllerParamValue>                  CrewStrengthDynamicNamedParamOverrides;            // 0x8(0x10)
};


// Size 0x18
struct AIBountySpawnerArchiveWaveGroupEntry
{
public:
	int                                                          NumNonTargetAIKills;                               // 0x0(0x4)
	int                                                          NumTargetAIKills;                                  // 0x4(0x4)
	TArray<struct AIBountySpawnerArchiveWaveEntry>               WaveEntries;                                       // 0x8(0x10)
};


// Size 0x38
struct AIFormVarietyEntry
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	char                                                         pad0x4_ZAFQO[0x4];                                 // 0xc(0x4)
	struct StringAssetReference                                  Form;                                              // 0x10(0x10)
	float                                                        Weight;                                            // 0x20(0x4)
	int                                                          MaxPerEncounter;                                   // 0x24(0x4)
	TArray<struct AIIndividualVarietyEntry>                      Individuals;                                       // 0x28(0x10)
};


// Size 0x14
struct AIPerCrewSpawnerStoryBasedRespawnSettings
{
public:
	struct AIPerCrewSpawnerRespawnSettings                       RespawnSettings;                                   // 0x0(0xc)
	struct StoryFlag                                             Story;                                             // 0xc(0x8)
};


// Size 0x18
struct EventVisualAppearanceSelected
{
public:
	class AIPartsCategory*                                       PartsCategory;                                     // 0x0(0x8)
	struct AIPartId                                              AIPartId;                                          // 0x8(0x8)
	int                                                          PartsIndexToUse;                                   // 0x10(0x4)
	int                                                          ColorTextureIndex;                                 // 0x14(0x4)
};


// Size 0x28
struct TinySharkServiceParams
{
public:
	class TinySharkParamsDataAsset*                              TinySharkParams;                                   // 0x0(0x8)
	TArray<struct TinySharkShipSpawnData>                        SpawnForShipData;                                  // 0x8(0x10)
	class EnvQuery*                                              SpawnForShipQuery;                                 // 0x18(0x8)
	float                                                        SpawnFailureTimer;                                 // 0x20(0x4)
	char                                                         pad0x4_MFY35[0x4];                                 // 0x24(0x4)
};


// Size 0x48
struct AISpawnTypeParamsCollection
{
public:
	char                                                         pad0x8_79S3D[0x8];                                 // 0x0(0x8)
	TArray<struct WeightedAISpawnTypeParams>                     SpawnParams;                                       // 0x8(0x10)
	char                                                         pad0x30_7WJWO[0x30];                               // 0x18(0x30)
};


// Size 0x28
struct AIBountySpawnerArchive
{
public:
	char                                                         pad0x8_VXSAX[0x8];                                 // 0x0(0x8)
	int                                                          CurrentWaveIndex;                                  // 0x8(0x4)
	char                                                         pad0x4_HGLIE[0x4];                                 // 0xc(0x4)
	TArray<struct AIBountySpawnerArchiveWaveGroupEntry>          WaveGroupEntries;                                  // 0x10(0x10)
	float                                                        BountyAudioIntensity;                              // 0x20(0x4)
	char                                                         pad0x4_K7K1P[0x4];                                 // 0x24(0x4)
};


// Size 0x20
struct AIAbilityContinuousCooldownParameterData
{
public:
	struct AthenaAIAbilityPlayerBasedRanges                      InitialCooldown;                                   // 0x0(0x10)
	struct AthenaAIAbilityPlayerBasedRanges                      CooldownBetweenActivations;                        // 0x10(0x10)
};


// Size 0xd0
struct AIBountySpawnerParams
{
public:
	TArray<struct AIEncounterWave>                               AISpawnerCreationDesc;                             // 0x0(0x10)
	struct StringAssetReference                                  TeamColor;                                         // 0x10(0x10)
	TArray<int>                                                  NumTargetsInWave;                                  // 0x20(0x10)
	TArray<int>                                                  NumCaptainsInWave;                                 // 0x30(0x10)
	float                                                        MinTimeBetweenSpawns;                              // 0x40(0x4)
	float                                                        MaxTimeBetweenSpawns;                              // 0x44(0x4)
	float                                                        MinTimeBetweenWaves;                               // 0x48(0x4)
	float                                                        MaxTimeBetweenWaves;                               // 0x4c(0x4)
	struct WeightedProbabilityRange                              WavesPerRelocate;                                  // 0x50(0x20)
	struct WeightedProbabilityRange                              WaveSplitChance;                                   // 0x70(0x20)
	TArray<float>                                                WaveSuicideTime;                                   // 0x90(0x10)
	float                                                        WaveSuicideMinDist;                                // 0xa0(0x4)
	int                                                          NumWavesPerGroup;                                  // 0xa4(0x4)
	int                                                          NumWaveGroups;                                     // 0xa8(0x4)
	int                                                          NumTotalWaves;                                     // 0xac(0x4)
	int                                                          NumTargetsPerWaveGroup;                            // 0xb0(0x4)
	int                                                          NumCaptainsPerWaveGroup;                           // 0xb4(0x4)
	TArray<class Class*>                                         AICombatDialogue;                                  // 0xb8(0x10)
	bool                                                         ConvertFinalCaptainToSkeletonLord;                 // 0xc8(0x1)
	char                                                         pad0x7_HR21L[0x7];                                 // 0xc9(0x7)
};


// Size 0x100
struct AISpawnerWave
{
public:
	float                                                        SpawnChance;                                       // 0x0(0x4)
	char                                                         pad0x4_YOV9I[0x4];                                 // 0x4(0x4)
	struct WeightedProbabilityRange                              NumOfSpawnsInWave;                                 // 0x8(0x20)
	struct AISpawnTypeParamsCollection                           SpawnTypeParamsOverride;                           // 0x28(0x48)
	struct WeightedProbabilityRangeOfRanges                      DelayBeforeWave;                                   // 0x70(0x30)
	struct WeightedProbabilityRangeOfRanges                      DelayBetweenSpawns;                                // 0xa0(0x30)
	struct WeightedProbabilityRangeOfRanges                      DelayBeforeNextWaveIfSuccessful;                   // 0xd0(0x30)
};


// Size 0x40
struct AIPerCrewSpawnerCrewUnit
{
public:
	char                                                         pad0x20_52VMV[0x20];                               // 0x0(0x20)
	TArray<struct AISpawnerWave>                                 SelectedWaves;                                     // 0x20(0x10)
	TArray<class AISpawnerPrerequisiteBase*>                     Prerequisites;                                     // 0x30(0x10)
};


// Size 0x108
struct EscalatingWave
{
public:
	int                                                          WaveNumber;                                        // 0x0(0x4)
	char                                                         pad0x4_7GO1M[0x4];                                 // 0x4(0x4)
	struct AISpawnerWave                                         SpawnedWave;                                       // 0x8(0x100)
};


