#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x10
struct ReportedPlayerResponse
{
public:
	struct FString                                               ReferenceCode;                                     // 0x0(0x10)
};


// Size 0x8
struct EventFiredFromActorEnd
{
public:
	char                                                         pad0x8_U1XYL[0x8];                                 // 0x0(0x8)
};


// Size 0x18
struct ItemCategoryAIStrategyMovementPropertiesOverride
{
public:
	class UClass*                                                ItemCategory;                                      // 0x0(0x8)
	TArray<struct AIStrategyMovementProperties>                  AIStrategyMovementPropertiesOverrides;             // 0x8(0x10)
};


// Size 0x1
struct RequestCrewManagementEvent
{
public:
	char                                                         pad0x1_ZEQM4[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ActivateContestZoneEvent
{
public:
	char                                                         pad0x1_CTRD1[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ShipCustomizationChestSwapToSavedLoadoutEvent
{
public:
	char                                                         PossessionsChestType;                              // 0x0(0x1)
};


// Size 0x18
struct SharkMaterialEntry
{
public:
	struct StringAssetReference                                  MaterialReference;                                 // 0x0(0x10)
	bool                                                         CastShadows;                                       // 0x10(0x1)
	char                                                         pad0x7_Q7QE8[0x7];                                 // 0x11(0x7)
};


// Size 0x18
struct ObjectLeakDetectionDataReceivedEvent
{
public:
	class NetConnection*                                         Connection;                                        // 0x0(0x8)
	TArray<char>                                                 DataBlob;                                          // 0x8(0x10)
};


// Size 0x1
struct HideGenericModalContinueEvent
{
public:
	char                                                         pad0x1_YR6CC[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct TitleLoadoutUpdatedEvent
{
public:
	char                                                         pad0x1_VPZIG[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct RegisterCeremonyInterface
{
public:
	char                                                         pad0x10_RXGC0[0x10];                               // 0x0(0x10)
};


// Size 0x1
struct WieldableItemsUpdatedEvent
{
public:
	char                                                         pad0x1_4CA7I[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct TutorialShowFootstepEvent
{
public:
	char                                                         pad0x8_4EJQ0[0x8];                                 // 0x0(0x8)
};


// Size 0x8
struct EventResetSettingsGroup
{
public:
	struct FName                                                 SettingsGroupNameToReset;                          // 0x0(0x8)
};


// Size 0xc
struct EventItemUseAINoiseEvent
{
public:
	float                                                        NoiseRange;                                        // 0x0(0x4)
	struct FName                                                 NoiseTag;                                          // 0x4(0x8)
};


// Size 0x1
struct RequestDestroyPiratePreviewEvent
{
public:
	char                                                         pad0x1_38IV1[0x1];                                 // 0x0(0x1)
};


// Size 0xc
struct AthenaCharacterSwimSpeed
{
public:
	float                                                        SprintSpdAmp;                                      // 0x0(0x4)
	float                                                        SprintAccelAmp;                                    // 0x4(0x4)
	float                                                        TurnSpeedScalar;                                   // 0x8(0x4)
};


// Size 0x1
struct FrontendRequestPirateDeletionEvent
{
public:
	char                                                         pad0x1_N7EPR[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct PirateCreationEvent_UserExitGameRequest
{
public:
	char                                                         pad0x1_5PLER[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct MechanismMaterialOverride
{
public:
	class UClass*                                                Group;                                             // 0x0(0x8)
	struct StringAssetReference                                  Material;                                          // 0x8(0x10)
};


// Size 0x4
struct WheelArmIKBoolSets
{
public:
	bool                                                         LeftIKOn;                                          // 0x0(0x1)
	bool                                                         RightIKOn;                                         // 0x1(0x1)
	bool                                                         LeftArmDown;                                       // 0x2(0x1)
	bool                                                         RightArmDown;                                      // 0x3(0x1)
};


// Size 0x1
struct ReputationMenuClosedEvent
{
public:
	char                                                         pad0x1_E8L8C[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct BootFlowPirateProfilesStateEnteredEvent
{
public:
	char                                                         pad0x1_GH210[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct RequestPlayModeVariant
{
public:
	char                                                         pad0x1_PAEIG[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct AthenaAnimationPetSelectedArrayAnimations
{
public:
	class AnimSequence*                                          HeldBaseIdle_A;                                    // 0x0(0x8)
	class AnimSequence*                                          HeldBaseIdle_B;                                    // 0x8(0x8)
};


// Size 0x18
struct CrewSessionDetailsChangedEvent
{
public:
	char                                                         pad0x18_3DQO2[0x18];                               // 0x0(0x18)
};


// Size 0x100
struct AthenaAnimationAsyncLoadedLocomotionAnimations
{
public:
	char                                                         pad0x100_V8A2D[0x100];                             // 0x0(0x100)
};


// Size 0x4
struct TunnelOfTheDamnedMigrationSucceededEvent
{
public:
	char                                                         pad0x4_O1B0K[0x4];                                 // 0x0(0x4)
};


// Size 0x18
struct ProcessableActions
{
public:
	char                                                         CurrentStatus;                                     // 0x0(0x1)
	char                                                         pad0x7_X6KHS[0x7];                                 // 0x1(0x7)
	double                                                       StartTime;                                         // 0x8(0x8)
	int                                                          ActionIndex;                                       // 0x10(0x4)
	char                                                         pad0x4_NGXAB[0x4];                                 // 0x14(0x4)
};


// Size 0x10
struct CrewMember
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
};


// Size 0x38
struct AggressiveGhostShipProjectileShotTelemetryEvent
{
public:
	struct Guid                                                  ShipId;                                            // 0x0(0x10)
	struct Guid                                                  ProjectileAttackId;                                // 0x10(0x10)
	struct FString                                               ProjectileType;                                    // 0x20(0x10)
	char                                                         Target;                                            // 0x30(0x1)
	char                                                         pad0x7_3X3JP[0x7];                                 // 0x31(0x7)
};


// Size 0x18
struct StorageContainerContentModifierExtraContentSpawnerEntry
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	int                                                          MinimumUses;                                       // 0x4(0x4)
	int                                                          MaximumUses;                                       // 0x8(0x4)
	char                                                         pad0x4_Z9DTI[0x4];                                 // 0xc(0x4)
	class BaseContainerContentSpawner*                           ContentSpawner;                                    // 0x10(0x8)
};


// Size 0x1
struct EventKeybindCaptureCancelRequest
{
public:
	char                                                         pad0x1_ARCU8[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct ShipCustomizationLoadout
{
public:
	TArray<class Class*>                                         Customizations;                                    // 0x0(0x10)
	TArray<class Class*>                                         InitialCustomizations;                             // 0x10(0x10)
	TArray<class Class*>                                         SavedCustomizations;                               // 0x20(0x10)
	bool                                                         HasInitialCustomizationsSet;                       // 0x30(0x1)
	char                                                         pad0x7_7ISRA[0x7];                                 // 0x31(0x7)
};


// Size 0x20
struct SkeletonThroneStateData
{
public:
	char                                                         pad0x20_S0A89[0x20];                               // 0x0(0x20)
};


// Size 0x60
struct FaunaAnimationCurrentPlayingAnimations
{
public:
	class BlendSpace1D*                                          LandLocomotionA;                                   // 0x0(0x8)
	class BlendSpace1D*                                          LandLocomotionB;                                   // 0x8(0x8)
	class BlendSpace1D*                                          SeaLocomotionA;                                    // 0x10(0x8)
	class BlendSpace1D*                                          SeaLocomotionB;                                    // 0x18(0x8)
	class BlendSpace1D*                                          UnderwaterLocomotionA;                             // 0x20(0x8)
	class BlendSpace1D*                                          UnderwaterLocomotionB;                             // 0x28(0x8)
	class AnimSequence*                                          LandIdleA;                                         // 0x30(0x8)
	class AnimSequence*                                          LandIdleB;                                         // 0x38(0x8)
	class AnimSequence*                                          SeaIdleA;                                          // 0x40(0x8)
	class AnimSequence*                                          SeaIdleB;                                          // 0x48(0x8)
	class AnimSequence*                                          UnderwaterIdleA;                                   // 0x50(0x8)
	class AnimSequence*                                          UnderwaterIdleB;                                   // 0x58(0x8)
};


// Size 0x18
struct RequestEmoteSelectEquipEvent
{
public:
	int                                                          Index;                                             // 0x0(0x4)
	char                                                         pad0x4_XL13P[0x4];                                 // 0x4(0x4)
	struct FString                                               ItemDesc;                                          // 0x8(0x10)
};


// Size 0x1
struct IncomingFriendRequestSucceedEvent
{
public:
	char                                                         pad0x1_6GQJG[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EnableDefaultStormsGameServerRequestModel
{
public:
	bool                                                         Enable;                                            // 0x0(0x1)
};


// Size 0x10
struct EventAIEmoteActionAnimationChange
{
public:
	char                                                         ActiveEmoteActionState;                            // 0x0(0x1)
	char                                                         pad0x7_YAFTU[0x7];                                 // 0x1(0x7)
	class AthenaCharacter*                                       Owner;                                             // 0x8(0x8)
};


// Size 0x1
struct EventAthenaLocalPlayerRequestRequiredControllersConnected
{
public:
	char                                                         pad0x1_4N2DN[0x1];                                 // 0x0(0x1)
};


// Size 0x2
struct PremiumStoreTimeLimited
{
public:
	bool                                                         Item;                                              // 0x0(0x1)
	bool                                                         Price;                                             // 0x1(0x1)
};


// Size 0x18
struct ItemSnapshotExpandedEvent
{
public:
	struct Guid                                                  SnapshotID;                                        // 0x0(0x10)
	class Object*                                                CreatedObject;                                     // 0x10(0x8)
};


// Size 0x128
struct AthenaAnimationMountedWeapon
{
public:
	bool                                                         IsFiring;                                          // 0x0(0x1)
	char                                                         pad0x3_673UE[0x3];                                 // 0x1(0x3)
	float                                                        Pitch;                                             // 0x4(0x4)
	float                                                        Yaw;                                               // 0x8(0x4)
	char                                                         pad0x4_6NDER[0x4];                                 // 0xc(0x4)
	class Actor*                                                 ControlledObject;                                  // 0x10(0x8)
	char                                                         pad0x110_8NY93[0x110];                             // 0x18(0x110)
};


// Size 0x38
struct OneShotToggleCollisionAudioParams
{
public:
	class WwiseEvent*                                            OverlapBeginAudioEvent;                            // 0x0(0x8)
	class WwiseEvent*                                            OverlapEndAudioEvent;                              // 0x8(0x8)
	class WwiseObjectPoolWrapper*                                OverlapEventAudioPool;                             // 0x10(0x8)
	struct WwiseEmitter                                          OverlapEmitter;                                    // 0x18(0x20)
};


// Size 0x1
struct ForceStoryServiceRefreshEvent
{
public:
	char                                                         pad0x1_B1RC2[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventCompanyReputationCampaignDetailRequest
{
public:
	struct FString                                               CampaignId;                                        // 0x0(0x10)
};


// Size 0x8
struct GuildNumberOfMembersChangedEvent
{
public:
	int                                                          OldNumberOfMembers;                                // 0x0(0x4)
	int                                                          CurrentNumberOfMembers;                            // 0x4(0x4)
};


// Size 0x10
struct IslandEventIcons
{
public:
	class Texture*                                               ActiveEventIcon;                                   // 0x0(0x8)
	class Texture*                                               InactiveEventIcon;                                 // 0x8(0x8)
};


// Size 0x20
struct PosablePirateAnimation
{
public:
	class AnimSequence*                                          Animation;                                         // 0x0(0x8)
	class SkeletalMesh*                                          SkeletalMeshProp;                                  // 0x8(0x8)
	class StaticMesh*                                            StaticMeshProp;                                    // 0x10(0x8)
	struct FName                                                 PropSocketName;                                    // 0x18(0x8)
};


// Size 0x10
struct TunnelOfTheDamnedFactionThemedPopUpDesc
{
public:
	class UClass*                                                Faction;                                           // 0x0(0x8)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x8(0x8)
};


// Size 0x8
struct AIShipTargetVesselSetEvent
{
public:
	class Actor*                                                 AiShipTarget;                                      // 0x0(0x8)
};


// Size 0x10
struct EventPickupableObjectPickedUp
{
public:
	class PickupableObject*                                      PickupableObject;                                  // 0x0(0x8)
	class Actor*                                                 InteractingPlayer;                                 // 0x8(0x8)
};


// Size 0x10
struct ReplyToGuildInviteResponseModel
{
public:
	struct FString                                               Error;                                             // 0x0(0x10)
};


// Size 0x1
struct PossessionsChestTypeSelectedEvent
{
public:
	char                                                         PossessionsChestType;                              // 0x0(0x1)
};


// Size 0x28
struct AthenaAnimationShopInteractionAnimations
{
public:
	char                                                         ObjectType;                                        // 0x0(0x1)
	char                                                         pad0x7_F9A7I[0x7];                                 // 0x1(0x7)
	class AnimSequence*                                          Into;                                              // 0x8(0x8)
	TArray<class AnimSequence*>                                  Loop;                                              // 0x10(0x10)
	class AnimSequence*                                          Out;                                               // 0x20(0x8)
};


// Size 0xa8
struct PirateGeneratorBakeTelemetryEvent
{
public:
	struct PirateDescription                                     Desc;                                              // 0x0(0x80)
	char                                                         Flags;                                             // 0x80(0x1)
	char                                                         pad0x7_LD05V[0x7];                                 // 0x81(0x7)
	struct FString                                               Operation;                                         // 0x88(0x10)
	struct Guid                                                  OperationId;                                       // 0x98(0x10)
};


// Size 0x1
struct InvasionDepartureTunnelRivalCrewFoundEvent
{
public:
	char                                                         pad0x1_LGPO2[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct PlayerBuriedItemServiceDataAssetMapStorePopulationHaulOverride
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	char                                                         pad0x4_M3W5W[0x4];                                 // 0xc(0x4)
	struct WeightedProbabilityRange                              NumXs;                                             // 0x10(0x20)
	class WeightedItemDescSpawnDataAsset*                        WeightedItemDescSpawnDataAsset;                    // 0x30(0x8)
};


// Size 0xc
struct NoValidWreckLocationFoundTelemetryEvent
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
};


// Size 0x18
struct EventPlayerRemovedFromCrew
{
public:
	char                                                         pad0x10_NAU6I[0x10];                               // 0x0(0x10)
	class PlayerState*                                           UniqueId;                                          // 0x10(0x8)
};


// Size 0x1
struct EmblemServiceFinishedUpdatingProgressEvent
{
public:
	char                                                         pad0x1_SCKF9[0x1];                                 // 0x0(0x1)
};


// Size 0x68
struct TaleQuestParams
{
public:
	char                                                         pad0x68_3LSKG[0x68];                               // 0x0(0x68)
};


// Size 0x28
struct HideInObjectActionStateParams
{
public:
	char                                                         pad0x18_R84RI[0x18];                               // 0x0(0x18)
	TArray<char>                                                 PreventedHealthChanges;                            // 0x18(0x10)
};


// Size 0x10
struct EventAIOnDelayedAssignedMeshConsumed
{
public:
	class SkeletalMeshComponent*                                 MeshComponent;                                     // 0x0(0x8)
	class SkeletalMesh*                                          ConsumedMesh;                                      // 0x8(0x8)
};


// Size 0x44
struct LightingControllerLightingParams
{
public:
	float                                                        SunYaw;                                            // 0x0(0x4)
	float                                                        SunElevation;                                      // 0x4(0x4)
	float                                                        UnderworldSunElevation;                            // 0x8(0x4)
	float                                                        MinSunAngle;                                       // 0xc(0x4)
	float                                                        UnderworldZThreshold;                              // 0x10(0x4)
	float                                                        HideoutZThreshold;                                 // 0x14(0x4)
	float                                                        UnderwaterInsideShipBrightnessInBoatSpace;         // 0x18(0x4)
	float                                                        UnderwaterInsideShipBrightnessOutsideBoatSpace;    // 0x1c(0x4)
	float                                                        UnderwaterBrightnessInBoatSpace;                   // 0x20(0x4)
	float                                                        UnderwaterDepthDarkenStart;                        // 0x24(0x4)
	float                                                        UnderwaterDepthDarkenRange;                        // 0x28(0x4)
	float                                                        UnderwaterDepthDarkenMin;                          // 0x2c(0x4)
	float                                                        UnderwaterMurkDensity;                             // 0x30(0x4)
	float                                                        SecondaryLPVCascadeOcclusionIntensityScale;        // 0x34(0x4)
	int                                                          LPVPropagationSteps;                               // 0x38(0x4)
	int                                                          DefaultLightingSet;                                // 0x3c(0x4)
	bool                                                         EnableGodRays;                                     // 0x40(0x1)
	char                                                         pad0x3_VX152[0x3];                                 // 0x41(0x3)
};


// Size 0x1
struct MultiShopStoreSelectedEvent
{
public:
	char                                                         StoreType;                                         // 0x0(0x1)
};


// Size 0x10
struct RequestRandomiseClothingCategoryPiratePreviewEvent
{
public:
	TArray<class Class*>                                         ClothingCategories;                                // 0x0(0x10)
};


// Size 0x30
struct NPCDialogExecuteOptionOnServerRpc
{
public:
	char                                                         pad0x18_DAHZ7[0x18];                               // 0x0(0x18)
	class NPCDialogComponent*                                    DialogComponent;                                   // 0x18(0x8)
	int                                                          OverrideDataIndex;                                 // 0x20(0x4)
	int                                                          CurrentDialog;                                     // 0x24(0x4)
	int                                                          CurrentOption;                                     // 0x28(0x4)
	char                                                         pad0x4_LOP5Y[0x4];                                 // 0x2c(0x4)
};


// Size 0x20
struct PurchaseCatalogOfferRequestUIEvent
{
public:
	struct FString                                               CatalogName;                                       // 0x0(0x10)
	struct Guid                                                  CatalogOfferId;                                    // 0x10(0x10)
};


// Size 0x1
struct EventCharacterConcealedInLoadableEnd
{
public:
	char                                                         pad0x1_06EN9[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct ClientCargoRunCrewNPCDataUnit
{
public:
	struct Guid                                                  NPCId;                                             // 0x0(0x10)
	int                                                          TotalToPickUp;                                     // 0x10(0x4)
	int                                                          TotalLeftToPickUp;                                 // 0x14(0x4)
};


// Size 0x20
struct ContentModifierInfo
{
public:
	struct FString                                               ContentModifier;                                   // 0x0(0x10)
	TArray<String>                                               StoryFlagNames;                                    // 0x10(0x10)
};


// Size 0x30
struct AthenaAnimationRowboatAnimationsFirstPerson
{
public:
	class AnimSequence*                                          SitDown;                                           // 0x0(0x8)
	class AnimSequence*                                          Stand;                                             // 0x8(0x8)
	class AnimSequence*                                          Idle;                                              // 0x10(0x8)
	class AnimSequence*                                          Row;                                               // 0x18(0x8)
	class AnimSequence*                                          Recover;                                           // 0x20(0x8)
	class AnimSequence*                                          Brake;                                             // 0x28(0x8)
};


// Size 0xc
struct CentreWorldMapOnLocationEvent
{
public:
	struct Vector                                                WorldLocation;                                     // 0x0(0xc)
};


// Size 0x10
struct NarrationRequestEvent
{
public:
	struct FString                                               Text;                                              // 0x0(0x10)
};


// Size 0x20
struct WieldableItemFirstTimeEquipRpc
{
public:
	char                                                         pad0x18_TRPAT[0x18];                               // 0x0(0x18)
	class WwiseEvent*                                            FirstTimeEquipSfx;                                 // 0x18(0x8)
};


// Size 0x1
struct ArenaTutorialAnimationStartEvent
{
public:
	char                                                         pad0x1_ZJ0WR[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct TutorialDialogEvent
{
public:
	char                                                         StepStarted;                                       // 0x0(0x1)
};


// Size 0x1
struct EventWieldedItemOutOfContinuousUseStateEntered
{
public:
	char                                                         pad0x1_60PLL[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventIslandEventDataChanged
{
public:
	char                                                         pad0x1_0NXI5[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct AggressiveGhostShipEncounterStartFromTaleTelemetryEvent
{
public:
	struct Guid                                                  EncounterId;                                       // 0x0(0x10)
};


// Size 0x1
struct PuzzleVaultRewardItemSpawnedEvent
{
public:
	char                                                         pad0x1_Z2FD0[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct GameEventItemSpawnCollection
{
public:
	TArray<struct ActorComponentSelector>                        ItemSpawnerReferences;                             // 0x0(0x10)
	bool                                                         IsOnDemand;                                        // 0x10(0x1)
	char                                                         pad0x3_90I0G[0x3];                                 // 0x11(0x3)
	float                                                        ChanceForMegaStashToSpawn;                         // 0x14(0x4)
	class UClass*                                                TradingCompany;                                    // 0x18(0x8)
};


// Size 0x70
struct ServerProjectileImpactHitRegInfoTelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	struct FString                                               ProjectileId;                                      // 0x10(0x10)
	struct FString                                               DamagerTypeId;                                     // 0x20(0x10)
	struct Vector                                                HitLocation;                                       // 0x30(0xc)
	char                                                         pad0x4_XNLJV[0x4];                                 // 0x3c(0x4)
	struct FString                                               InstigatorObjectId;                                // 0x40(0x10)
	struct FString                                               InstigatorObjectType;                              // 0x50(0x10)
	struct FString                                               InstigatorActorName;                               // 0x60(0x10)
};


// Size 0x10
struct UIFrameDurationDataTelemetryFragment
{
public:
	float                                                        Min;                                               // 0x0(0x4)
	float                                                        Max;                                               // 0x4(0x4)
	float                                                        Average;                                           // 0x8(0x4)
	float                                                        StdDeviation;                                      // 0xc(0x4)
};


// Size 0x20
struct AllianceStatusChangedNetworkEvent
{
public:
	char                                                         pad0x18_LLGM6[0x18];                               // 0x0(0x18)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x18(0x8)
};


// Size 0x10
struct DestroyingUnsafeWreckTelemetryEvent
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	bool                                                         IsCustomWreck;                                     // 0xc(0x1)
	char                                                         pad0x3_VVXXB[0x3];                                 // 0xd(0x3)
};


// Size 0x8
struct ChestOnShipEvent
{
public:
	class Actor*                                                 CurrentShip;                                       // 0x0(0x8)
};


// Size 0x10
struct ContestParticipantTelemetryFragmentInput
{
public:
	char                                                         pad0x10_YBU8N[0x10];                               // 0x0(0x10)
};


// Size 0xc
struct FactionStatsInformation
{
public:
	int                                                          TotalRivalShipsSunk;                               // 0x0(0x4)
	int                                                          HighestFactionStreak;                              // 0x4(0x4)
	int                                                          HighestHourglassValue;                             // 0x8(0x4)
};


// Size 0x28
struct VoyageDiscardedTelemetryEvent
{
public:
	struct FString                                               VoyageRecipeAsset;                                 // 0x0(0x10)
	struct FString                                               CompanyId;                                         // 0x10(0x10)
	int                                                          VoyageRank;                                        // 0x20(0x4)
	char                                                         pad0x4_RWUKQ[0x4];                                 // 0x24(0x4)
};


// Size 0x48
struct PremiumCatalogOfferGroup
{
public:
	struct FText                                                 Title;                                             // 0x0(0x38)
	TArray<struct Guid>                                          Children;                                          // 0x38(0x10)
};


// Size 0x8
struct PortableHarpoonProjectileReplicateState
{
public:
	char                                                         pad0x4_WEPXB[0x4];                                 // 0x0(0x4)
	char                                                         State;                                             // 0x4(0x1)
	char                                                         pad0x3_1AKOC[0x3];                                 // 0x5(0x3)
};


// Size 0x18
struct MakeFriendsEmoteParams
{
public:
	TArray<struct Name>                                          TriggerEmoteNames;                                 // 0x0(0x10)
	float                                                        TriggerDistanceThreshold;                          // 0x10(0x4)
	char                                                         pad0x4_RFAAU[0x4];                                 // 0x14(0x4)
};


// Size 0x10
struct CatalogOfferCompanyLevelDataAsset
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	char                                                         pad0x8_DI7YC[0x8];                                 // 0x8(0x8)
};


// Size 0x1
struct BootFlowStartLoginTokenExchangeStateEvent
{
public:
	char                                                         pad0x1_MLVVD[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct BootFlowStartCrewMatchmakingStateEvent
{
public:
	char                                                         pad0x1_1FYTK[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct AmmoStoreMetaWrapper
{
public:
	char                                                         pad0x18_2NNNF[0x18];                               // 0x0(0x18)
	int                                                          AmmoCount;                                         // 0x18(0x4)
	char                                                         pad0x4_RS3KE[0x4];                                 // 0x1c(0x4)
};


// Size 0x10
struct ArrivalTunnelOfTheDamnedPlayerState
{
public:
	class Character*                                             Character;                                         // 0x0(0x8)
	bool                                                         MigrationComplete;                                 // 0x8(0x1)
	char                                                         pad0x7_GE355[0x7];                                 // 0x9(0x7)
};


// Size 0xf0
struct ShipCreatureManagerCreatureInstance
{
public:
	class MeshComponent*                                         CreatureMeshComponent;                             // 0x0(0x8)
	class WwiseEvent*                                            StopCreatureSounds;                                // 0x8(0x8)
	char                                                         pad0xe0_82YVX[0xe0];                               // 0x10(0xe0)
};


// Size 0x10
struct PlayerBuriedItemServiceCrewMapsChangedEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x8
struct EventCurseSpawnAIOnShip
{
public:
	class AIFixedWavesSpawner*                                   AISpawner;                                         // 0x0(0x8)
};


// Size 0x30
struct QuestVariableAsset
{
public:
	char                                                         pad0x30_E54VR[0x30];                               // 0x0(0x30)
};


// Size 0x18
struct SplineTransitionLadderActionFinishedMessage
{
public:
	char                                                         pad0x10_COE5S[0x10];                               // 0x0(0x10)
	float                                                        TimeCompleted;                                     // 0x10(0x4)
	char                                                         pad0x4_ZNOAR[0x4];                                 // 0x14(0x4)
};


// Size 0x20
struct CrewSpawnTelemetryEvent
{
public:
	struct Vector                                                OldShipSinkLocation;                               // 0x0(0xc)
	bool                                                         HasValidShipSpawn;                                 // 0xc(0x1)
	char                                                         pad0x3_502CH[0x3];                                 // 0xd(0x3)
	struct Vector                                                ShipSpawnLocation;                                 // 0x10(0xc)
	bool                                                         IsContestSpawnPoint;                               // 0x1c(0x1)
	bool                                                         IsOnCompetitiveVoyage;                             // 0x1d(0x1)
	char                                                         pad0x2_HBAK8[0x2];                                 // 0x1e(0x2)
};


// Size 0xc
struct GetActorsInRadiusGameServerRequestModel
{
public:
	struct Vector2D                                              Position;                                          // 0x0(0x8)
	float                                                        Radius;                                            // 0x8(0x4)
};


// Size 0x8
struct EventReceiveMountpointComponentState
{
public:
	class MountpointComponent*                                   Source;                                            // 0x0(0x8)
};


// Size 0x1
struct PlayerExitedHideoutEvent
{
public:
	char                                                         pad0x1_6WI8K[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct UILiveCampaignDataErrorEvent
{
public:
	struct FString                                               ErrorMessage;                                      // 0x0(0x10)
	struct FString                                               ErrorStack;                                        // 0x10(0x10)
};


// Size 0x14
struct SkullOfStormsKnockbackTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	char                                                         KnocbackActorTeam;                                 // 0x10(0x1)
	char                                                         pad0x3_5T62T[0x3];                                 // 0x11(0x3)
};


// Size 0x38
struct RewardRuntimeDefinition
{
public:
	char                                                         pad0x8_BX1PN[0x8];                                 // 0x0(0x8)
	class PopUpMessageDesc*                                      PopUp;                                             // 0x8(0x8)
	char                                                         pad0x10_55B5M[0x10];                               // 0x10(0x10)
	TArray<class Class*>                                         PrerequisiteEntitlements;                          // 0x20(0x10)
	char                                                         pad0x8_SQ33F[0x8];                                 // 0x30(0x8)
};


// Size 0x48
struct DebugSuperSailorActionStateConstructionInfo
{
public:
	char                                                         pad0x48_S3T7V[0x48];                               // 0x0(0x48)
};


// Size 0x1
struct ShipTrinketInteractionDisabledSettingChanged
{
public:
	bool                                                         ShipTrinketInteractionsDisabled;                   // 0x0(0x1)
};


// Size 0x10
struct ShipLoadoutRequestShipPartsModel
{
public:
	TArray<struct Guid>                                          ShipIds;                                           // 0x0(0x10)
};


// Size 0x1
struct EventFishingFishCollisionDetected
{
public:
	char                                                         pad0x1_14MYG[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct CancelLogonQueueEventToGame
{
public:
	char                                                         pad0x1_Y8DGE[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct UIRankSkin
{
public:
	struct FString                                               DisplayName;                                       // 0x0(0x10)
	struct FString                                               Description;                                       // 0x10(0x10)
	struct FString                                               RibbonImageUrl;                                    // 0x20(0x10)
};


// Size 0x18
struct EventShipRegionChanged
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	class Actor*                                                 Actor;                                             // 0x8(0x8)
	char                                                         ShipRegion;                                        // 0x10(0x1)
	char                                                         PreviousShipRegion;                                // 0x11(0x1)
	char                                                         pad0x6_SJCT4[0x6];                                 // 0x12(0x6)
};


// Size 0x1
struct RequestSessionEvent
{
public:
	char                                                         pad0x1_BJ8AT[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct MaterialInformationAudioData
{
public:
	struct FName                                                 SurfaceSwitch;                                     // 0x0(0x8)
	struct WwiseAudioAcousticSurfaceParams                       Acoustics;                                         // 0x8(0x8)
};


// Size 0x10
struct TunnelOfTheDamnedMigrationFailedTelemetryEvent
{
public:
	struct FString                                               Reason;                                            // 0x0(0x10)
};


// Size 0x1
struct BootFlowQuitLobbyEvent
{
public:
	char                                                         pad0x1_ILOS2[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct ControlObjectActionStateParams
{
public:
	char                                                         pad0x10_86ULK[0x10];                               // 0x0(0x10)
	bool                                                         UndockToLastKnownLocation;                         // 0x10(0x1)
	char                                                         pad0x3_8GYEU[0x3];                                 // 0x11(0x3)
	float                                                        UndockDuration;                                    // 0x14(0x4)
};


// Size 0x1
struct ErrorHappeningEvent
{
public:
	char                                                         pad0x1_AHM9N[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct ArrivalTunnelOfTheDamnedCompletedTelemetryEvent
{
public:
	struct Vector                                                DestinationLocation;                               // 0x0(0xc)
	struct Rotator                                               DestinationRotation;                               // 0xc(0xc)
};


// Size 0x10
struct InventoryManipulatorAutoEquipPolicyEntry
{
public:
	class UClass*                                                Category;                                          // 0x0(0x8)
	char                                                         Policy;                                            // 0x8(0x1)
	char                                                         pad0x7_RJJKK[0x7];                                 // 0x9(0x7)
};


// Size 0x30
struct LevelMadeHiddenTelemetryEvent
{
public:
	char                                                         pad0x30_16C0K[0x30];                               // 0x0(0x30)
};


// Size 0x8
struct ClothingChestUnequipDisguiseEvent
{
public:
	class UClass*                                                Desc;                                              // 0x0(0x8)
};


// Size 0x8
struct AchievementKillOpponentInContest
{
public:
	char                                                         pad0x8_5WXF9[0x8];                                 // 0x0(0x8)
};


// Size 0x40
struct OpenableItemMeshAnimationReactionComponentAnimationNameAndSfxCueSet
{
public:
	struct FName                                                 Open;                                              // 0x0(0x8)
	struct FName                                                 OpeningFirstTime;                                  // 0x8(0x8)
	class WwiseEvent*                                            OpeningFirstTimeSfx;                               // 0x10(0x8)
	struct FName                                                 Opening;                                           // 0x18(0x8)
	class WwiseEvent*                                            OpeningSfx;                                        // 0x20(0x8)
	struct FName                                                 Closing;                                           // 0x28(0x8)
	class WwiseEvent*                                            ClosingSfx;                                        // 0x30(0x8)
	struct FName                                                 Closed;                                            // 0x38(0x8)
};


// Size 0x1
struct EventWheelStartedMoving
{
public:
	char                                                         pad0x1_TUNIF[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct RequestTrinketBoxActionEvent
{
public:
	char                                                         Action;                                            // 0x0(0x1)
	char                                                         pad0x7_G51IY[0x7];                                 // 0x1(0x7)
	struct FString                                               TrinketDesc;                                       // 0x8(0x10)
};


// Size 0x8
struct InvasionDepartureTunnelOfTheDamnedInitializedTelemetryEvent
{
public:
	char                                                         RequestedSessionType;                              // 0x0(0x1)
	char                                                         pad0x3_HN589[0x3];                                 // 0x1(0x3)
	int                                                          CrewSkillScore;                                    // 0x4(0x4)
};


// Size 0x20
struct GameEventServiceDesc
{
public:
	struct StringAssetReference                                  ServiceParamsAssetPath;                            // 0x0(0x10)
	struct StringAssetReference                                  GameEventOnDemandAvailabilityParamsAsset;          // 0x10(0x10)
};


// Size 0x18
struct GuildSender
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct DateTime                                              ExpiryTime;                                        // 0x10(0x8)
};


// Size 0x18
struct PuzzleVaultCompletedTelemetryEvent
{
public:
	struct Guid                                                  VaultId;                                           // 0x0(0x10)
	struct FName                                                 VaultType;                                         // 0x10(0x8)
};


// Size 0x30
struct ShipwreckStateData
{
public:
	char                                                         pad0x20_WXFP8[0x20];                               // 0x0(0x20)
	struct FString                                               Name;                                              // 0x20(0x10)
};


// Size 0x40
struct ContestMatchmakingCrewModel
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct UniqueNetIdRepl                                       UserId;                                            // 0x10(0x18)
	int                                                          SessionType;                                       // 0x28(0x4)
	char                                                         pad0x4_UTBD4[0x4];                                 // 0x2c(0x4)
	TArray<struct UniqueNetIdRepl>                               CrewMemberUserIds;                                 // 0x30(0x10)
};


// Size 0x18
struct ItemDiggingAudioOverride
{
public:
	TArray<Class>                                                Classes;                                           // 0x0(0x10)
	class ItemDiggingAudioConfig*                                DiggingAudioConfig;                                // 0x10(0x8)
};


// Size 0x1
struct EventCustomAnimationStateChanged
{
public:
	char                                                         CustomAnimationState;                              // 0x0(0x1)
};


// Size 0x18
struct ConditionalStatsTriggerUnit
{
public:
	class UClass*                                                TriggerType;                                       // 0x0(0x8)
	TArray<class ConditionalStatsAsset*>                         ConditionalStatsAssets;                            // 0x8(0x10)
};


// Size 0x24
struct WheelAdditiveAlphaSets
{
public:
	float                                                        IsAdditiveRightFingerIdle;                         // 0x0(0x4)
	float                                                        IsAdditiveLeftFingerIdle;                          // 0x4(0x4)
	float                                                        IsAdditiveIdle;                                    // 0x8(0x4)
	float                                                        LeftFingerAdditiveValue;                           // 0xc(0x4)
	float                                                        RightFingerAdditiveValue;                          // 0x10(0x4)
	float                                                        fullBodyAdditiveValue;                             // 0x14(0x4)
	float                                                        RHandAdditiveBlendValue;                           // 0x18(0x4)
	float                                                        LHandAdditiveBlendValue;                           // 0x1c(0x4)
	float                                                        FullBodyAdditiveBlendValue;                        // 0x20(0x4)
};


// Size 0x8
struct EventMovedByActorEnd
{
public:
	class Actor*                                                 MovementInstigator;                                // 0x0(0x8)
};


// Size 0x1
struct UseSingleStickChangedEvent
{
public:
	char                                                         UseSingleStick;                                    // 0x0(0x1)
};


// Size 0x18
struct OverrideCrewSpawnTeleportLocation
{
public:
	class Actor*                                                 TeleportLocationActor;                             // 0x0(0x8)
	struct Guid                                                  CrewId;                                            // 0x8(0x10)
};


// Size 0x1
struct VoyageInventoryUpdatedEvent
{
public:
	char                                                         pad0x1_97QUC[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventFaunaAnimationSnakeInCharmStance
{
public:
	bool                                                         SnakeInCharmStance;                                // 0x0(0x1)
};


// Size 0x1
struct PirateProfiles_ProfileDetailsRequestedEvent
{
public:
	char                                                         pad0x1_8G709[0x1];                                 // 0x0(0x1)
};


// Size 0x60
struct PlayerHeartbeatTelemetryEvent
{
public:
	struct FString                                               MovementMode;                                      // 0x0(0x10)
	struct FString                                               LocationOnShip;                                    // 0x10(0x10)
	float                                                        CurrentHealth;                                     // 0x20(0x4)
	int                                                          ActiveTime;                                        // 0x24(0x4)
	int                                                          IdleTime;                                          // 0x28(0x4)
	int                                                          CurrentStateTime;                                  // 0x2c(0x4)
	int                                                          MoveTimeStampReset;                                // 0x30(0x4)
	int                                                          MoveTimeStampExpired;                              // 0x34(0x4)
	int                                                          MoveDiscrepancyCorrections;                        // 0x38(0x4)
	float                                                        MoveCorrectionAvgSizeCm;                           // 0x3c(0x4)
	float                                                        MoveCorrectionMaxSizeCm;                           // 0x40(0x4)
	float                                                        MoveCorrectionSizeStdDevCm;                        // 0x44(0x4)
	int                                                          MoveModeCorrections;                               // 0x48(0x4)
	int                                                          AverageNetActorConsiderCount;                      // 0x4c(0x4)
	int                                                          AverageNetActorEvaluatedCount;                     // 0x50(0x4)
	int                                                          AverageNetActorPushModelDormantCount;              // 0x54(0x4)
	int                                                          AverageNetActorDormantCount;                       // 0x58(0x4)
	char                                                         pad0x4_AWEYH[0x4];                                 // 0x5c(0x4)
};


// Size 0x8
struct RepairObjectActionStateParams
{
public:
	float                                                        MountTime;                                         // 0x0(0x4)
	struct AdaptiveTriggerEffectMode_Vibration                   RightTrigger_Repair;                               // 0x4(0x4)
};


// Size 0x10
struct EntitlementRedirectorEntry
{
public:
	struct FName                                                 DeprecatedIdentifier;                              // 0x0(0x8)
	struct FName                                                 Identifier;                                        // 0x8(0x8)
};


// Size 0x2
struct EventFishingRodFishingStateChanged
{
public:
	bool                                                         IsInFishingState;                                  // 0x0(0x1)
	bool                                                         IsFishHooked;                                      // 0x1(0x1)
};


// Size 0x10
struct EvictPlayerMessage
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
};


// Size 0x20
struct SubModeLevel
{
public:
	struct FString                                               SubMode;                                           // 0x0(0x10)
	struct StringAssetReference                                  Level;                                             // 0x10(0x10)
};


// Size 0x10
struct PlayerEncounterEndTelemetryEvent
{
public:
	struct Guid                                                  EncounterId;                                       // 0x0(0x10)
};


// Size 0x28
struct ItemSpawnDistributionAssets
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	char                                                         pad0x4_UYB8T[0x4];                                 // 0xc(0x4)
	class WeightedItemDescSpawnDataAsset*                        ReferencedSpawnDistributionAsset;                  // 0x10(0x8)
	TArray<class SpawnRequirement*>                              Requirements;                                      // 0x18(0x10)
};


// Size 0x20
struct LandmarkTreasureLocationEntry
{
public:
	struct FString                                               LandmarkName;                                      // 0x0(0x10)
	TArray<struct Vector>                                        Locations;                                         // 0x10(0x10)
};


// Size 0x28
struct ConsumedIngestibleTelemetryEvent
{
public:
	struct FString                                               ItemName;                                          // 0x0(0x10)
	char                                                         CookState;                                         // 0x10(0x1)
	char                                                         pad0x7_A803V[0x7];                                 // 0x11(0x7)
	TArray<String>                                               StatusesApplied;                                   // 0x18(0x10)
};


// Size 0x30
struct CaptaincyReponseStartedSessionModel
{
public:
	struct FString                                               SessionToken;                                      // 0x0(0x10)
	int                                                          HeartbeatTimeSeconds;                              // 0x10(0x4)
	int                                                          ShipSaveTimeSeconds;                               // 0x14(0x4)
	bool                                                         ContinuousSaving;                                  // 0x18(0x1)
	bool                                                         FirstTimeSailingShip;                              // 0x19(0x1)
	char                                                         pad0x6_RN91M[0x6];                                 // 0x1a(0x6)
	struct FString                                               ShipName;                                          // 0x20(0x10)
};


// Size 0x98
struct PiratePreviewReadyEvent
{
public:
	char                                                         pad0x10_VWUCX[0x10];                               // 0x0(0x10)
	struct PirateDescription                                     Desc;                                              // 0x10(0x80)
	bool                                                         Valid;                                             // 0x90(0x1)
	char                                                         pad0x7_PRLQY[0x7];                                 // 0x91(0x7)
};


// Size 0x50
struct InteractionInputComponentTickFunction
{
public:
	char                                                         pad0x48_KPCAL[0x48];                               // 0x0(0x48)
	class InteractionInputComponent*                             Target;                                            // 0x48(0x8)
};


// Size 0x1
struct PirateRerollEvent_CancelReroll
{
public:
	char                                                         pad0x1_VJIU4[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct GameSessionIdTelemetryFragmentInput
{
public:
	char                                                         pad0x10_WOY22[0x10];                               // 0x0(0x10)
};


// Size 0x1
struct EventStarved
{
public:
	char                                                         pad0x1_H9ZVK[0x1];                                 // 0x0(0x1)
};


// Size 0x80
struct AthenaPlayerCharacterModelSwap
{
public:
	class SkeletalMesh*                                          FirstPersonMesh;                                   // 0x0(0x8)
	class UClass*                                                FirstPersonAnimSetDataId;                          // 0x8(0x8)
	struct PirateGeneratorAdditionalBakeInfo                     FirstPersonAdditionalBakeInfo;                     // 0x10(0x20)
	char                                                         pad0x8_RB95D[0x8];                                 // 0x30(0x8)
	class SkeletalMesh*                                          ThirdPersonMesh;                                   // 0x38(0x8)
	TArray<class MaterialInterface*>                             ThirdPersonOverrideMaterials;                      // 0x40(0x10)
	class UClass*                                                ThirdPersonAnimSetDataId;                          // 0x50(0x8)
	struct PirateGeneratorAdditionalBakeInfo                     ThirdPersonAdditionalBakeInfo;                     // 0x58(0x20)
	char                                                         pad0x8_34LOH[0x8];                                 // 0x78(0x8)
};


// Size 0x10
struct AthenaAnimationSkeletonKnockbackLocomotion
{
public:
	class AnimSequence*                                          Forwards;                                          // 0x0(0x8)
	class AnimSequence*                                          Backwards;                                         // 0x8(0x8)
};


// Size 0x10
struct EventTriggerOverlayAction
{
public:
	class Object*                                                InteractObject;                                    // 0x0(0x8)
	char                                                         InteractableActionType;                            // 0x8(0x1)
	char                                                         pad0x7_9KFIS[0x7];                                 // 0x9(0x7)
};


// Size 0x1
struct EventSpawnedAsSalvageItem
{
public:
	bool                                                         SpawnedAsSunkenItem;                               // 0x0(0x1)
};


// Size 0x20
struct ShipwreckDiscoveredRpc
{
public:
	char                                                         pad0x18_7UXLN[0x18];                               // 0x0(0x18)
	class Shipwreck*                                             Wreck;                                             // 0x18(0x8)
};


// Size 0x20
struct UIMessageOfTheDayOpenEvent
{
public:
	struct FString                                               SessionId;                                         // 0x0(0x10)
	struct FString                                               MessageId;                                         // 0x10(0x10)
};


// Size 0x1
struct EventRevealableCloseReveal
{
public:
	char                                                         pad0x1_HMW6J[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct CrewAttackedByGameEventEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x8
struct ReapersTributeShipCrewTributeChanged
{
public:
	int                                                          NewTributeCount;                                   // 0x0(0x4)
	int                                                          OldTributeCount;                                   // 0x4(0x4)
};


// Size 0x1
struct BootFlowUserPromptRestartLocaleChangedStateEvent
{
public:
	char                                                         pad0x1_BQMS2[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct TransitionLadderEndEvent
{
public:
	char                                                         LadderTransitionMode;                              // 0x0(0x1)
};


// Size 0x8
struct EventCharacterStartedContinuousUse
{
public:
	class UClass*                                                InputID;                                           // 0x0(0x8)
};


// Size 0x1
struct BootFlowStartSessionSelectStateEvent
{
public:
	char                                                         pad0x1_NO5FY[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct HitRegToggleHitScanEvent
{
public:
	char                                                         pad0x1_WBPDQ[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct MoveSpeedValidationFailedTelemetryEvent
{
public:
	struct FString                                               Item;                                              // 0x0(0x10)
	int                                                          SpeedId;                                           // 0x10(0x4)
	int                                                          DurationMS;                                        // 0x14(0x4)
	int                                                          IgnoredRequestCount;                               // 0x18(0x4)
	char                                                         pad0x4_5ZRW1[0x4];                                 // 0x1c(0x4)
};


// Size 0x20
struct MaterialAnimatorGroupInstance
{
public:
	struct FName                                                 MaterialParamName;                                 // 0x0(0x8)
	struct FName                                                 CurrentAnimation;                                  // 0x8(0x8)
	struct FName                                                 WantedAnimation;                                   // 0x10(0x8)
	float                                                        CurrentAnimTime;                                   // 0x18(0x4)
	float                                                        AnimDuration;                                      // 0x1c(0x4)
};


// Size 0x8
struct UseLadderUpdateHeightEvent
{
public:
	char                                                         pad0x8_J7BW0[0x8];                                 // 0x0(0x8)
};


// Size 0x28
struct SocketCollisionEnterWaterEvent
{
public:
	char                                                         pad0x28_8WWI4[0x28];                               // 0x0(0x28)
};


// Size 0x80
struct InteractableLightState
{
public:
	bool                                                         Enabled;                                           // 0x0(0x1)
	char                                                         pad0xf_WMFPJ[0xf];                                 // 0x1(0xf)
	struct Transform                                             Transform;                                         // 0x10(0x30)
	float                                                        Intensity;                                         // 0x40(0x4)
	float                                                        ConeAngleInner;                                    // 0x44(0x4)
	float                                                        ConeAngleOuter;                                    // 0x48(0x4)
	float                                                        AttenuationRadius;                                 // 0x4c(0x4)
	struct Color                                                 LightColour;                                       // 0x50(0x4)
	char                                                         SimpleFunctionType;                                // 0x54(0x1)
	char                                                         pad0x3_F07WQ[0x3];                                 // 0x55(0x3)
	float                                                        ScaleOffset;                                       // 0x58(0x4)
	float                                                        PulsePhase;                                        // 0x5c(0x4)
	float                                                        FlickerFrequency;                                  // 0x60(0x4)
	float                                                        IntensityScaleForWater;                            // 0x64(0x4)
	float                                                        MinDistanceToLightClamp;                           // 0x68(0x4)
	bool                                                         ApplyScaleForTranslucency;                         // 0x6c(0x1)
	char                                                         pad0x3_Y4HIG[0x3];                                 // 0x6d(0x3)
	float                                                        ScaleForTranslucency;                              // 0x70(0x4)
	bool                                                         ApplyCapForTranslucency;                           // 0x74(0x1)
	char                                                         pad0x3_DC450[0x3];                                 // 0x75(0x3)
	float                                                        CapForTranslucency;                                // 0x78(0x4)
	char                                                         pad0x4_K8ZCU[0x4];                                 // 0x7c(0x4)
};


// Size 0x1
struct UpdateStashedMapsEvent
{
public:
	char                                                         pad0x1_2C678[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventAudioPlayerExitedHotFloorVicinity
{
public:
	char                                                         pad0x1_OGX4Q[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct AmmoChestStateData
{
public:
	char                                                         pad0x20_3EEDU[0x20];                               // 0x0(0x20)
};


// Size 0x30
struct SwimmingCreatureMovementReplicatedData
{
public:
	struct Vector                                                CurrentServerGoalLocation;                         // 0x0(0xc)
	struct RotationUpdateResult                                  CurrentServerRotationData;                         // 0xc(0x18)
	float                                                        CurrentServerMaxSpeed;                             // 0x24(0x4)
	float                                                        CurrentServerVelocitySmoothingFactor;              // 0x28(0x4)
	bool                                                         CurrentServerIsSharkArcCorrectionTurn;             // 0x2c(0x1)
	char                                                         pad0x3_904DT[0x3];                                 // 0x2d(0x3)
};


// Size 0x1
struct EventApplyStatusShipCurseEnd
{
public:
	char                                                         pad0x1_5CP3J[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct SittingActionStateSerialisableData
{
public:
	char                                                         pad0x40_MTOHW[0x40];                               // 0x0(0x40)
};


// Size 0x40
struct ThrowGrenadeRpc
{
public:
	char                                                         pad0x18_VVVCI[0x18];                               // 0x0(0x18)
	struct Vector                                                RelativeLocalThrowLocation;                        // 0x18(0xc)
	struct Rotator                                               LocalLaunchAngle;                                  // 0x24(0xc)
	float                                                        LocalLaunchSpeed;                                  // 0x30(0x4)
	struct Vector                                                LocalWielderVelocity;                              // 0x34(0xc)
};


// Size 0x28
struct ResponseMigrationStatusNetworkEvent
{
public:
	char                                                         pad0x18_C3F8W[0x18];                               // 0x0(0x18)
	struct FString                                               MigrationStatusLog;                                // 0x18(0x10)
};


// Size 0x30
struct TakeAllItemsFromContainerRPC
{
public:
	char                                                         pad0x18_QX5E4[0x18];                               // 0x0(0x18)
	struct NetSubObjectPtr                                       Container;                                         // 0x18(0x14)
	int                                                          IndexToTake;                                       // 0x2c(0x4)
};


// Size 0x10
struct RequestPremiumShopOffersEvent
{
public:
	struct FString                                               CatalogName;                                       // 0x0(0x10)
};


// Size 0x20
struct SkeletonCampTempleHallEncounter
{
public:
	bool                                                         IsAshenBladeCrewPresent;                           // 0x0(0x1)
	char                                                         pad0x7_B3RZC[0x7];                                 // 0x1(0x7)
	class Actor*                                                 PlayerActorWithLargestNonAshenCrew;                // 0x8(0x8)
	struct Guid                                                  CrewIdOfLargestNonAshenCrew;                       // 0x10(0x10)
};


// Size 0x1
struct CrewDestroyedTelemetryEvent
{
public:
	char                                                         pad0x1_2Z07O[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventLoadableItemUnloadingEnd
{
public:
	char                                                         pad0x1_23ZX1[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventSpecificCompaniesProgressRequest
{
public:
	char                                                         pad0x10_25I6P[0x10];                               // 0x0(0x10)
};


// Size 0x20
struct ReplyToGuildInviteErrorEvent
{
public:
	struct FString                                               GuildId;                                           // 0x0(0x10)
	struct FString                                               ErrorId;                                           // 0x10(0x10)
};


// Size 0x10
struct GameEventSchedulerSettingsChangeTelemetryEvent
{
public:
	struct StringAssetReference                                  SettingsAssetPath;                                 // 0x0(0x10)
};


// Size 0x38
struct GameEventSchedulerOnDemandConfigSelectionTelemetryEvent
{
public:
	TArray<struct Name>                                          CurrentMainConfigNames;                            // 0x0(0x10)
	TArray<struct Name>                                          FilteredMainConfigNamesByType;                     // 0x10(0x10)
	char                                                         GameEventTypeFilter;                               // 0x20(0x1)
	char                                                         pad0x7_SGT2Z[0x7];                                 // 0x21(0x7)
	struct FString                                               SelectedConfigName;                                // 0x28(0x10)
};


// Size 0x1
struct PlayerIsCaptainChangedEvent
{
public:
	bool                                                         IsCaptain;                                         // 0x0(0x1)
};


// Size 0x1
struct PlayerPlatformInfoRequest
{
public:
	char                                                         pad0x1_GOC2W[0x1];                                 // 0x0(0x1)
};


// Size 0x78
struct UseMountableSpotlightActionStateParams
{
public:
	char                                                         pad0x58_SAPMA[0x58];                               // 0x0(0x58)
	class ForceFeedbackEffect*                                   LightbeamFocusFeedbackEffect;                      // 0x58(0x8)
	class UClass*                                                FocusBeamCameraShake;                              // 0x60(0x8)
	class UClass*                                                FocusBeamInputId;                                  // 0x68(0x8)
	class CurveFloat*                                            SpotlightStateChangeCurve;                         // 0x70(0x8)
};


// Size 0x1
struct BootFlowAdvanceLegalSplashStateEvent
{
public:
	char                                                         pad0x1_RGRZ8[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventAthenaLocalPlayerFocalUserSet
{
public:
	bool                                                         FocalUserSet;                                      // 0x0(0x1)
};


// Size 0x8
struct CreateTriggerGameServerResponseModel
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
	char                                                         pad0x3_ICYEN[0x3];                                 // 0x1(0x3)
	int                                                          TriggerNetId;                                      // 0x4(0x4)
};


// Size 0x1
struct IntroVideoEvent_Advance
{
public:
	bool                                                         HasPlayedVideo;                                    // 0x0(0x1)
};


// Size 0x10
struct FishCustomSpawnParams
{
public:
	char                                                         FishSpawnTimeOfDay;                                // 0x0(0x1)
	bool                                                         FishCloseToShipWreck;                              // 0x1(0x1)
	bool                                                         FishInStorm;                                       // 0x2(0x1)
	bool                                                         FishCloseToActiveFortOrSkellyShip;                 // 0x3(0x1)
	bool                                                         FishInPool;                                        // 0x4(0x1)
	char                                                         FishBaitType;                                      // 0x5(0x1)
	char                                                         pad0x2_9JDT8[0x2];                                 // 0x6(0x2)
	struct FName                                                 IslandName;                                        // 0x8(0x8)
};


// Size 0x1
struct BootFlowStartPakValidationStateEvent
{
public:
	char                                                         pad0x1_NMCF3[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct EntitlementAllowance
{
public:
	char                                                         pad0x20_97MRA[0x20];                               // 0x0(0x20)
	int                                                          AllowedNumber;                                     // 0x20(0x4)
	char                                                         pad0x4_5YECL[0x4];                                 // 0x24(0x4)
};


// Size 0x1
struct SuspensionStatusRequest
{
public:
	char                                                         pad0x1_GP6A6[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventReceiveQuestBookPagesInContainerComponentState
{
public:
	class QuestBookPagesInContainerComponent*                    Source;                                            // 0x0(0x8)
};


// Size 0x40
struct AddMapToContainerRPC
{
public:
	char                                                         pad0x18_YA367[0x18];                               // 0x0(0x18)
	struct NetSubObjectPtr                                       Container;                                         // 0x18(0x14)
	struct Guid                                                  MapToAddToContainer;                               // 0x2c(0x10)
	char                                                         pad0x4_WPV8X[0x4];                                 // 0x3c(0x4)
};


// Size 0x8
struct ChargedAttackProjectileWeights
{
public:
	float                                                        ChargeTime;                                        // 0x0(0x4)
	float                                                        Weight;                                            // 0x4(0x4)
};


// Size 0x18
struct WieldableBookPageReference
{
public:
	struct StringAssetReference                                  PageReference;                                     // 0x0(0x10)
	char                                                         NumberOfPages;                                     // 0x10(0x1)
	char                                                         pad0x7_2S91W[0x7];                                 // 0x11(0x7)
};


// Size 0x30
struct PlayerSetFlameOfFateTelemetryEvent
{
public:
	struct FString                                               LitObjectId;                                       // 0x0(0x10)
	struct FString                                               FlameColour;                                       // 0x10(0x10)
	struct FString                                               LitObjectType;                                     // 0x20(0x10)
};


// Size 0x10
struct ShipHighestAlignmentChangedEvent
{
public:
	struct FString                                               AlignmentId;                                       // 0x0(0x10)
};


// Size 0x18
struct AlignmentModel
{
public:
	struct Guid                                                  Id;                                                // 0x0(0x10)
	char                                                         pad0x8_75DCJ[0x8];                                 // 0x10(0x8)
};


// Size 0x1
struct SlidingDoorOpenedEvent
{
public:
	char                                                         pad0x1_16Q8Q[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ClientContestManagerServiceDestructionEvent
{
public:
	char                                                         pad0x1_TZNZ6[0x1];                                 // 0x0(0x1)
};


// Size 0x78
struct EventPlayerPirateIdentityReady
{
public:
	char                                                         pad0x78_WF1QB[0x78];                               // 0x0(0x78)
};


// Size 0x1
struct EnterTunnelOfTheDamnedFadeComplete
{
public:
	char                                                         pad0x1_0JPLJ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ServerPlayerContestLeftTelemetryEvent
{
public:
	char                                                         pad0x1_F0DYR[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct RequestShopOffersEvent
{
public:
	struct FString                                               CatalogName;                                       // 0x0(0x10)
};


// Size 0x40
struct AmmoChangeEffectParams
{
public:
	float                                                        InputRangeMin;                                     // 0x0(0x4)
	float                                                        InputRangeMax;                                     // 0x4(0x4)
	float                                                        OutputRangeMin;                                    // 0x8(0x4)
	float                                                        OutputRangeMax;                                    // 0xc(0x4)
	float                                                        OutputRangeThreshold;                              // 0x10(0x4)
	bool                                                         UseThresholdValueAsNewOutputRangeMax;              // 0x14(0x1)
	char                                                         pad0x3_R9QUA[0x3];                                 // 0x15(0x3)
	class CurveFloat*                                            LerpSpeedCurve;                                    // 0x18(0x8)
	struct ScalarParameterValue                                  ScalarParameterValue;                              // 0x20(0x1c)
	char                                                         pad0x4_DI58N[0x4];                                 // 0x3c(0x4)
};


// Size 0x20
struct PocketWatchDateDisplay
{
public:
	class WwiseEvent*                                            DateSwitchSFX;                                     // 0x0(0x8)
	class MaterialInstanceDynamic*                               FirstPersonMeshDynamicMaterialInstance;            // 0x8(0x8)
	class MaterialInstanceDynamic*                               ThirdPersonMeshDynamicMaterialInstance;            // 0x10(0x8)
	char                                                         pad0x8_JAL44[0x8];                                 // 0x18(0x8)
};


// Size 0x20
struct CanvasWorldMapForegroundItems
{
public:
	class Texture*                                               Texture;                                           // 0x0(0x8)
	struct FName                                                 FeatureToggle;                                     // 0x8(0x8)
	TArray<struct Vector2D>                                      Locations;                                         // 0x10(0x10)
};


// Size 0x1
struct ClientInputMatchmakingResult
{
public:
	bool                                                         IsAccepted;                                        // 0x0(0x1)
};


// Size 0x20
struct ShipSizeRequirementData
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	int                                                          OpenCrewMemberCount;                               // 0x8(0x4)
	char                                                         pad0x4_2O1J8[0x4];                                 // 0xc(0x4)
	struct FString                                               OpenCrewCountRetrivalString;                       // 0x10(0x10)
};


// Size 0x10
struct AthenaAnimationCannonConcealedAnimData
{
public:
	class AnimSequence*                                          InCannonIdle;                                      // 0x0(0x8)
	class AnimSequence*                                          FiredFromCannon;                                   // 0x8(0x8)
};


// Size 0x20
struct EventWieldableItemDropped
{
public:
	class UClass*                                                DroppedItemCategory;                               // 0x0(0x8)
	class ItemInfo*                                              DroppedItemInfo;                                   // 0x8(0x8)
	class Actor*                                                 ContactActor;                                      // 0x10(0x8)
	float                                                        DropDistance;                                      // 0x18(0x4)
	bool                                                         InDeepWater;                                       // 0x1c(0x1)
	char                                                         pad0x3_6TJ64[0x3];                                 // 0x1d(0x3)
};


// Size 0x28
struct ServerMigrationCrewMigrationStatus
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	bool                                                         Migratable;                                        // 0x10(0x1)
	char                                                         pad0x7_UFKXJ[0x7];                                 // 0x11(0x7)
	TArray<struct Vector2D>                                      Locations;                                         // 0x18(0x10)
};


// Size 0x1c
struct PlayDockableKeyedInstrumentActionStateParams
{
public:
	char                                                         pad0x18_SLDYB[0x18];                               // 0x0(0x18)
	float                                                        CameraDockTime;                                    // 0x18(0x4)
};


// Size 0x1
struct EventAthenaAnimationItemAnimationsAsyncLoaded
{
public:
	char                                                         pad0x1_6TMAY[0x1];                                 // 0x0(0x1)
};


// Size 0xa0
struct PiratePurchaseClaims
{
public:
	char                                                         pad0xa0_QLLC7[0xa0];                               // 0x0(0xa0)
};


// Size 0x18
struct TaleQuestWeightedItemDescSpawnData
{
public:
	class ItemSpawnData*                                         ItemSpawnData;                                     // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	bool                                                         LimitMaxSpawnedItems;                              // 0xc(0x1)
	char                                                         pad0x3_W0F0Y[0x3];                                 // 0xd(0x3)
	int                                                          MaxTimesCanBeSelected;                             // 0x10(0x4)
	char                                                         pad0x4_DOCSX[0x4];                                 // 0x14(0x4)
};


// Size 0x18
struct CannonAILocation
{
public:
	struct Vector                                                Centre;                                            // 0x0(0xc)
	struct Vector                                                Direction;                                         // 0xc(0xc)
};


// Size 0x8
struct CrewEnteredTunnelOfTheDamnedPortalProximityEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
};


// Size 0x1
struct StopRequestCrewManagementEvent
{
public:
	char                                                         pad0x1_DHTNB[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventCapstanDamageLevelChanged
{
public:
	class Actor*                                                 Capstan;                                           // 0x0(0x8)
	int                                                          DamageLevel;                                       // 0x8(0x4)
	char                                                         pad0x4_P2B0Z[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct ContestUpdateScoreBoardTimer
{
public:
	struct FString                                               TimeRemaining;                                     // 0x0(0x10)
};


// Size 0x38
struct TreasureFoundTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	struct Guid                                                  QuestId;                                           // 0x10(0x10)
	struct FString                                               Rarity;                                            // 0x20(0x10)
	bool                                                         IsBoobyTrapped;                                    // 0x30(0x1)
	char                                                         pad0x7_JD6N7[0x7];                                 // 0x31(0x7)
};


// Size 0x1
struct ServerContestStateUpdateTelemetryEvent
{
public:
	char                                                         CurrentContestState;                               // 0x0(0x1)
};


// Size 0xc
struct ItemPreviewMoveCameraEvent
{
public:
	float                                                        Rotation;                                          // 0x0(0x4)
	float                                                        Pitch;                                             // 0x4(0x4)
	float                                                        Zoom;                                              // 0x8(0x4)
};


// Size 0x1
struct EventInGameUISetPhotoMode
{
public:
	bool                                                         PhotoModeEnabled;                                  // 0x0(0x1)
};


// Size 0x18
struct HoleContainer
{
public:
	TArray<uintptr_t>                                            Holes;                                             // 0x0(0x10)
	struct FName                                                 IslandName;                                        // 0x10(0x8)
};


// Size 0x18
struct CanvasWorldMapShipIcons
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	class Texture*                                               ShipTexture;                                       // 0x8(0x8)
	class Texture*                                               OffscreenTexture;                                  // 0x10(0x8)
};


// Size 0x10
struct RequestedLoopAnims
{
public:
	struct FName                                                 RequestedLoopingAnimName;                          // 0x0(0x8)
	int                                                          RequestedOutOfAnimIndex;                           // 0x8(0x4)
	int                                                          AnimationAssetRequired;                            // 0xc(0x4)
};


// Size 0x20
struct StorableLockState
{
public:
	bool                                                         Locked;                                            // 0x0(0x1)
	char                                                         pad0x7_22X70[0x7];                                 // 0x1(0x7)
	TArray<struct StringAssetReference>                          AcceptableKeys;                                    // 0x8(0x10)
	bool                                                         IsInUnlockingSequence;                             // 0x18(0x1)
	char                                                         pad0x7_HRCYF[0x7];                                 // 0x19(0x7)
};


// Size 0x30
struct SwimmingCreatureAIStrategyMovementProperties
{
public:
	class UClass*                                                AIStrategy;                                        // 0x0(0x8)
	char                                                         SwimRotationMode;                                  // 0x8(0x1)
	char                                                         pad0x3_5VV24[0x3];                                 // 0x9(0x3)
	float                                                        RotationRate;                                      // 0xc(0x4)
	float                                                        CorrectingMaxSpeed;                                // 0x10(0x4)
	float                                                        CorrectingYawTurnRate;                             // 0x14(0x4)
	float                                                        MaxAbsPitch;                                       // 0x18(0x4)
	float                                                        MaxSpeed;                                          // 0x1c(0x4)
	float                                                        VelocitySmoothingFactor;                           // 0x20(0x4)
	float                                                        TrackedActorVelocityScaling;                       // 0x24(0x4)
	float                                                        TrackedActorVelocityScalingSmoothingFactor;        // 0x28(0x4)
	char                                                         pad0x4_BA9LA[0x4];                                 // 0x2c(0x4)
};


// Size 0x18
struct OverrideDialogOptionUsageCounter
{
public:
	int                                                          OverrideDataIndex;                                 // 0x0(0x4)
	char                                                         pad0x4_VOGJ6[0x4];                                 // 0x4(0x4)
	TArray<int>                                                  OptionUsageCounter;                                // 0x8(0x10)
};


// Size 0x10
struct StorageContainerLimit
{
public:
	class UClass*                                                Category;                                          // 0x0(0x8)
	int                                                          Cap;                                               // 0x8(0x4)
	char                                                         pad0x4_1RDZH[0x4];                                 // 0xc(0x4)
};


// Size 0x1
struct PlayerDoesNotRequireMermaidTelemetryEvent
{
public:
	char                                                         Reason;                                            // 0x0(0x1)
};


// Size 0x28
struct WorldMapSetLocation
{
public:
	TArray<struct Vector2D>                                      MapPins;                                           // 0x0(0x10)
	int                                                          MaxMapPins;                                        // 0x10(0x4)
	int                                                          SelectedPin;                                       // 0x14(0x4)
	float                                                        WorldX;                                            // 0x18(0x4)
	float                                                        WorldY;                                            // 0x1c(0x4)
	float                                                        Zoom;                                              // 0x20(0x4)
	char                                                         pad0x4_9XGNC[0x4];                                 // 0x24(0x4)
};


// Size 0x10
struct TQStructGenWeightedContainer
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	int                                                          MaxOccurrences;                                    // 0xc(0x4)
};


// Size 0x4
struct EnableRadialInventoryMouseControl
{
public:
	char                                                         pad0x4_F4Q0H[0x4];                                 // 0x0(0x4)
};


// Size 0x1
struct EventSessionCodeTextboxFocusRequest
{
public:
	bool                                                         ShouldFocusSessionCodeTextbox;                     // 0x0(0x1)
};


// Size 0x18
struct WieldableItemActionVisuals
{
public:
	TArray<class Class*>                                         BlockActions;                                      // 0x0(0x10)
	char                                                         AnimVariant;                                       // 0x10(0x1)
	bool                                                         IsAlternate;                                       // 0x11(0x1)
	bool                                                         HideItem;                                          // 0x12(0x1)
	char                                                         pad0x5_PFQXD[0x5];                                 // 0x13(0x5)
};


// Size 0x10
struct FeedStruct
{
public:
	class Actor*                                                 ActorToFeed;                                       // 0x0(0x8)
	bool                                                         WantRules;                                         // 0x8(0x1)
	char                                                         pad0x7_GXHRC[0x7];                                 // 0x9(0x7)
};


// Size 0x48
struct ProjectileHitScanPerWeaponMeshPairings
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	class StaticMesh*                                            TrailsMeshHitScan;                                 // 0x8(0x8)
	class MaterialInterface*                                     MaterialHitScan;                                   // 0x10(0x8)
	int                                                          MaxTrails;                                         // 0x18(0x4)
	char                                                         pad0x2c_L2GG1[0x2c];                               // 0x1c(0x2c)
};


// Size 0x1c
struct ProjectileShotParams
{
public:
	int                                                          InaccuracySeed;                                    // 0x0(0x4)
	float                                                        ProjectileDistributionMaxAngle;                    // 0x4(0x4)
	int                                                          NumberOfProjectiles;                               // 0x8(0x4)
	float                                                        ProjectileMaximumRange;                            // 0xc(0x4)
	float                                                        ProjectileHitScanMaximumRange;                     // 0x10(0x4)
	float                                                        ProjectileDamage;                                  // 0x14(0x4)
	float                                                        ProjectileDamageMultiplierAtMaximumRange;          // 0x18(0x4)
};


// Size 0x28
struct QuestTableQuestTravelSettings
{
public:
	bool                                                         CanDive;                                           // 0x0(0x1)
	bool                                                         CanSail;                                           // 0x1(0x1)
	char                                                         pad0x6_8KYPW[0x6];                                 // 0x2(0x6)
	TArray<struct Text>                                          DiveDescriptions;                                  // 0x8(0x10)
	TArray<struct Text>                                          SailDescriptions;                                  // 0x18(0x10)
};


// Size 0x10
struct HitRegToggleReplicatedEvent
{
public:
	char                                                         pad0x10_WK6NR[0x10];                               // 0x0(0x10)
};


// Size 0x140
struct CrosshairUI
{
public:
	class ProjectileWeapon*                                      WieldedWeapon;                                     // 0x0(0x8)
	char                                                         pad0x138_0QF8H[0x138];                             // 0x8(0x138)
};


// Size 0x18
struct CampaignRanks
{
public:
	struct FName                                                 CampaignId;                                        // 0x0(0x8)
	TArray<class Class*>                                         Ranks;                                             // 0x8(0x10)
};


// Size 0x18
struct SeagullManagerComponentDespawnedClientTelemetryEvent
{
public:
	struct Vector                                                DespawnLocation;                                   // 0x0(0xc)
	struct Rotator                                               DespawnDirection;                                  // 0xc(0xc)
};


// Size 0x80
struct RepopulatePirateSlotRequestModel
{
public:
	struct PirateDescription                                     NewPirate;                                         // 0x0(0x80)
};


// Size 0x1
struct PurchaseShopOfferSucceededEvent
{
public:
	char                                                         pad0x1_Z3TVL[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct PlayerEncounterStartTelemetryEvent
{
public:
	struct Guid                                                  EncounterId;                                       // 0x0(0x10)
	struct FString                                               EncounteredObjectId;                               // 0x10(0x10)
	char                                                         EncounterType;                                     // 0x20(0x1)
	char                                                         ShipRegion;                                        // 0x21(0x1)
	char                                                         pad0x2_T8VAU[0x2];                                 // 0x22(0x2)
	float                                                        EncounterDistance;                                 // 0x24(0x4)
};


// Size 0x50
struct SleepingActionStateParams
{
public:
	char                                                         pad0x18_GQ65K[0x18];                               // 0x0(0x18)
	char                                                         ControllableObjectType;                            // 0x18(0x1)
	char                                                         pad0x7_V9ZMQ[0x7];                                 // 0x19(0x7)
	class UClass*                                                BedAnimationId;                                    // 0x20(0x8)
	float                                                        CameraFadeDuration;                                // 0x28(0x4)
	float                                                        TooltipDelay;                                      // 0x2c(0x4)
	float                                                        HealthRegenDelay;                                  // 0x30(0x4)
	float                                                        HealthRegenTickInterval;                           // 0x34(0x4)
	float                                                        HealthRegenTickAmount;                             // 0x38(0x4)
	bool                                                         ShouldHideFirstPersonMesh;                         // 0x3c(0x1)
	char                                                         DockingMode;                                       // 0x3d(0x1)
	char                                                         pad0x2_K9BHS[0x2];                                 // 0x3e(0x2)
	float                                                        SleepingSfxDelay;                                  // 0x40(0x4)
	float                                                        SleepingAudioStateDelay;                           // 0x44(0x4)
	bool                                                         NeverFartWhileSleeping;                            // 0x48(0x1)
	char                                                         pad0x3_D76JQ[0x3];                                 // 0x49(0x3)
	float                                                        UnderwaterDepthThreshold;                          // 0x4c(0x4)
};


// Size 0xc
struct WorldMapSetShipLocation
{
public:
	float                                                        ShipX;                                             // 0x0(0x4)
	float                                                        ShipY;                                             // 0x4(0x4)
	float                                                        Rotation;                                          // 0x8(0x4)
};


// Size 0x20
struct UISeasonsDataErrorTelemetryEvent
{
public:
	struct FString                                               ErrorMessage;                                      // 0x0(0x10)
	struct FString                                               ErrorStack;                                        // 0x10(0x10)
};


// Size 0x10
struct InitialShipSpawnLocations
{
public:
	TArray<class ShipSpawnLocation*>                             ShipSpawnLocations;                                // 0x0(0x10)
};


// Size 0x40
struct InteractionOption
{
public:
	struct FString                                               Text;                                              // 0x0(0x10)
	int                                                          Index;                                             // 0x10(0x4)
	char                                                         pad0x4_BD2SY[0x4];                                 // 0x14(0x4)
	struct FString                                               Icon;                                              // 0x18(0x10)
	struct FString                                               IconNarrationText;                                 // 0x28(0x10)
	bool                                                         IsEnabled;                                         // 0x38(0x1)
	char                                                         pad0x7_4DT2J[0x7];                                 // 0x39(0x7)
};


// Size 0x20
struct AirGivingVolumeData
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	char                                                         pad0xc_9B20E[0xc];                                 // 0xc(0xc)
	float                                                        Radius;                                            // 0x18(0x4)
	bool                                                         UseLineOfSight;                                    // 0x1c(0x1)
	bool                                                         CanBeUsedOutsideIslandBounds;                      // 0x1d(0x1)
	char                                                         pad0x2_FXO6Q[0x2];                                 // 0x1e(0x2)
};


// Size 0x1
struct EventStartBlocking
{
public:
	char                                                         pad0x1_2E92U[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ServerTavernRecruitmentEndedTelemetryEvent
{
public:
	char                                                         pad0x1_Z2WJR[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventPlayerControllerDestroyedCalled
{
public:
	class AthenaPlayerController*                                Controller;                                        // 0x0(0x8)
};


// Size 0x40
struct NPCOnSurfaceCannonManagerCannon
{
public:
	class Cannon*                                                Cannon;                                            // 0x0(0x8)
	char                                                         pad0x8_9FK2Y[0x8];                                 // 0x8(0x8)
	struct Transform                                             NearestLocation;                                   // 0x10(0x30)
};


// Size 0x20
struct VoyageOnDemandArrivalTunnelOfTheDamnedInitializedTelemetryEvent
{
public:
	struct Guid                                                  VoyageID;                                          // 0x0(0x10)
	struct Guid                                                  MigrationId;                                       // 0x10(0x10)
};


// Size 0x40
struct TreasureSoldTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	char                                                         BootyType;                                         // 0x10(0x1)
	char                                                         pad0x7_0CWZY[0x7];                                 // 0x11(0x7)
	struct FString                                               Rarity;                                            // 0x18(0x10)
	bool                                                         GoldAwarded;                                       // 0x28(0x1)
	char                                                         Source;                                            // 0x29(0x1)
	char                                                         pad0x6_DNS8T[0x6];                                 // 0x2a(0x6)
	struct FString                                               TreasurePurchaser;                                 // 0x30(0x10)
};


// Size 0x28
struct ClientBootFlowLocStateLocRetrievalTelemetryEvent
{
public:
	struct FString                                               Culture;                                           // 0x0(0x10)
	bool                                                         Success;                                           // 0x10(0x1)
	char                                                         pad0x7_10EKZ[0x7];                                 // 0x11(0x7)
	struct FString                                               Reason;                                            // 0x18(0x10)
};


// Size 0x1
struct ViewCustomVoyageBanners
{
public:
	char                                                         ShowQuestReceivedBanners;                          // 0x0(0x1)
};


// Size 0x8
struct ShipCustomizationChestUnequipShipCustomizationEvent
{
public:
	class UClass*                                                Desc;                                              // 0x0(0x8)
};


// Size 0x10
struct DefinitionUpdatedMessage
{
public:
	struct FString                                               ContentHash;                                       // 0x0(0x10)
};


// Size 0x1
struct NotifyFrontendOfCurrentPirateStatus
{
public:
	bool                                                         Locked;                                            // 0x0(0x1)
};


// Size 0x28
struct ResponseInvasionStatusNetworkEvent
{
public:
	char                                                         pad0x18_NVX0N[0x18];                               // 0x0(0x18)
	TArray<String>                                               InvasionStatusLog;                                 // 0x18(0x10)
};


// Size 0x1
struct TavernBoardMyMapsRequestEvent
{
public:
	char                                                         pad0x1_PYYAO[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventRequestMimic
{
public:
	class Actor*                                                 MimicActor;                                        // 0x0(0x8)
};


// Size 0x20
struct EjectFromTunnelOfTheDamnedActionStateParams
{
public:
	float                                                        FadeDuration;                                      // 0x0(0x4)
	float                                                        FadeEventTimeout;                                  // 0x4(0x4)
	float                                                        FadeServerTimeout;                                 // 0x8(0x4)
	struct LinearColor                                           FadeColour;                                        // 0xc(0x10)
	bool                                                         FadeAudio;                                         // 0x1c(0x1)
	char                                                         pad0x3_N0JIW[0x3];                                 // 0x1d(0x3)
};


// Size 0x30
struct AthenaAnimationMapTable
{
public:
	TArray<class AnimSequence*>                                  Into;                                              // 0x0(0x10)
	TArray<class AnimSequence*>                                  IdleCycle;                                         // 0x10(0x10)
	TArray<class AnimSequence*>                                  Outof;                                             // 0x20(0x10)
};


// Size 0x20
struct MerchantQuestContractCompleteNetworkEvent
{
public:
	char                                                         pad0x18_OQM44[0x18];                               // 0x0(0x18)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x18(0x8)
};


// Size 0x10
struct EntitlementLoadFailedTelemetryEvent
{
public:
	struct FString                                               AssetName;                                         // 0x0(0x10)
};


// Size 0x10
struct AthenaAnimationSittingAnimData
{
public:
	class AnimSequence*                                          Into;                                              // 0x0(0x8)
	class AnimSequence*                                          Loop;                                              // 0x8(0x8)
};


// Size 0x28
struct ChainLink
{
public:
	class Actor*                                                 Source;                                            // 0x0(0x8)
	class Actor*                                                 Target;                                            // 0x8(0x8)
	struct Vector_NetQuantize                                    LastSourceLocation;                                // 0x10(0xc)
	struct Vector_NetQuantize                                    LastTargetLocation;                                // 0x1c(0xc)
};


// Size 0x68
struct AthenaAnimationCapstanAnimData
{
public:
	class AnimSequence*                                          Attach;                                            // 0x0(0x8)
	class AnimSequence*                                          Detach;                                            // 0x8(0x8)
	TArray<class BlendSpace1D*>                                  NeutralForce;                                      // 0x10(0x10)
	TArray<class BlendSpace1D*>                                  PushForce;                                         // 0x20(0x10)
	TArray<class BlendSpace1D*>                                  PullForce;                                         // 0x30(0x10)
	class BlendSpace1D*                                          PullToNeutral;                                     // 0x40(0x8)
	class BlendSpace1D*                                          PushToPull;                                        // 0x48(0x8)
	class BlendSpace1D*                                          PullToPush;                                        // 0x50(0x8)
	float                                                        RemapSpeed;                                        // 0x58(0x4)
	char                                                         pad0x4_DD61H[0x4];                                 // 0x5c(0x4)
	class BlendSpace1D*                                          UpperIntent;                                       // 0x60(0x8)
};


// Size 0x30
struct NPCStateData
{
public:
	char                                                         pad0x20_ATUNI[0x20];                               // 0x0(0x20)
	struct FString                                               Name;                                              // 0x20(0x10)
};


// Size 0x8
struct EventPlayerControllerPossess
{
public:
	class Pawn*                                                  Pawn;                                              // 0x0(0x8)
};


// Size 0x20
struct SpikeMechanismMaterialAnimationContext
{
public:
	char                                                         pad0x20_LBYFY[0x20];                               // 0x0(0x20)
};


// Size 0x50
struct AthenaAnimationRowboatAnimationsThirdPerson
{
public:
	class AnimSequence*                                          SitDown;                                           // 0x0(0x8)
	class AnimSequence*                                          Stand;                                             // 0x8(0x8)
	class AnimSequence*                                          Idle;                                              // 0x10(0x8)
	class BlendSpace1D*                                          Row;                                               // 0x18(0x8)
	class BlendSpace1D*                                          Recover;                                           // 0x20(0x8)
	class BlendSpace1D*                                          IntoRow;                                           // 0x28(0x8)
	class BlendSpace1D*                                          IntoRowBrake;                                      // 0x30(0x8)
	class BlendSpace1D*                                          BrakeRow;                                          // 0x38(0x8)
	class BlendSpace1D*                                          BrakeRecover;                                      // 0x40(0x8)
	class BlendSpace1D*                                          BrakeIdle;                                         // 0x48(0x8)
};


// Size 0x28
struct LargeSessionServerEncounterDevTelemetryEvent
{
public:
	struct FString                                               InitiatingUserId;                                  // 0x0(0x10)
	struct FString                                               EncounteredUserId;                                 // 0x10(0x10)
	bool                                                         TaskSucceeded;                                     // 0x20(0x1)
	char                                                         pad0x7_8F8CM[0x7];                                 // 0x21(0x7)
};


// Size 0x68
struct FiredFromActorActionStateConstructionInfo
{
public:
	char                                                         pad0x48_NFZDA[0x48];                               // 0x0(0x48)
	struct NetActorPtr                                           FiringActor;                                       // 0x48(0x14)
	struct Vector                                                LaunchVelocity;                                    // 0x5c(0xc)
};


// Size 0x40
struct EventPlayerSendOutDirectTextMessage
{
public:
	class PlayerState*                                           Sender;                                            // 0x0(0x8)
	struct FText                                                 Message;                                           // 0x8(0x38)
};


// Size 0x18
struct UIReturnedToPlayerEvent
{
public:
	char                                                         pad0x18_TT8SX[0x18];                               // 0x0(0x18)
};


// Size 0x68
struct VoyageChapterBegunAnimationEvent
{
public:
	int                                                          ChapterIndex;                                      // 0x0(0x4)
	int                                                          ChapterCount;                                      // 0x4(0x4)
	struct FText                                                 VoyageTitle;                                       // 0x8(0x38)
	struct FString                                               AudioSwitchName;                                   // 0x40(0x10)
	struct FString                                               AudioSwitchValue;                                  // 0x50(0x10)
	struct FName                                                 CompanyId;                                         // 0x60(0x8)
};


// Size 0x40
struct AthenaAnimationPlayingFacialAnimations
{
public:
	class BlendSpace1D*                                          Capstan;                                           // 0x0(0x8)
	class AnimSequence*                                          SailAction;                                        // 0x8(0x8)
	class AnimSequence*                                          SailIdle;                                          // 0x10(0x8)
	class AnimSequence*                                          CannonFire;                                        // 0x18(0x8)
	class AnimSequence*                                          CannonAim;                                         // 0x20(0x8)
	class AnimSequence*                                          HarpoonFire;                                       // 0x28(0x8)
	class AnimSequence*                                          FacialIdle0;                                       // 0x30(0x8)
	class AnimSequence*                                          FacialIdle1;                                       // 0x38(0x8)
};


// Size 0x1
struct SessionTypeSelectionResponseEvent
{
public:
	char                                                         SessionType;                                       // 0x0(0x1)
};


// Size 0x10
struct PetRoamingAnimationStateDefinitionWeightedDataAsset
{
public:
	class PetRoamingAnimationStateDefinitionDataAsset*           AnimationDefinitionData;                           // 0x0(0x8)
	float                                                        Weighting;                                         // 0x8(0x4)
	char                                                         pad0x4_2SG39[0x4];                                 // 0xc(0x4)
};


// Size 0x40
struct DistinctionBanners
{
public:
	char                                                         pad0x8_DX9N4[0x8];                                 // 0x0(0x8)
	struct FText                                                 Title;                                             // 0x8(0x38)
};


// Size 0x38
struct IslandEventData
{
public:
	class UClass*                                                EventType;                                         // 0x0(0x8)
	struct StringAssetReference                                  VoyageDescAssetString;                             // 0x8(0x10)
	struct Vector2D                                              WorldPos;                                          // 0x18(0x8)
	bool                                                         IsActive;                                          // 0x20(0x1)
	char                                                         pad0x3_KF5BE[0x3];                                 // 0x21(0x3)
	struct Guid                                                  EventId;                                           // 0x24(0x10)
	char                                                         pad0x4_7O884[0x4];                                 // 0x34(0x4)
};


// Size 0x10
struct FeaturedShipCustomizationCategory
{
public:
	class UClass*                                                Category;                                          // 0x0(0x8)
	struct FName                                                 Feature;                                           // 0x8(0x8)
};


// Size 0x1
struct EventUserGameSettingsRequest
{
public:
	char                                                         pad0x1_O5WVQ[0x1];                                 // 0x0(0x1)
};


// Size 0x150
struct QuestTableCompanyVoyageCategoryData
{
public:
	class UClass*                                                CategoryId;                                        // 0x0(0x8)
	struct FText                                                 CategoryName;                                      // 0x8(0x38)
	struct StringAssetReference                                  CategoryIcon;                                      // 0x40(0x10)
	struct FText                                                 CategoryLockedDescription;                         // 0x50(0x38)
	bool                                                         IsTutorialCategory;                                // 0x88(0x1)
	bool                                                         IsInfoCategory;                                    // 0x89(0x1)
	bool                                                         IsInfoCategoryWhenNoVoyagesAvailable;              // 0x8a(0x1)
	char                                                         pad0x5_18RQ0[0x5];                                 // 0x8b(0x5)
	struct FText                                                 InfoCategoryTitle;                                 // 0x90(0x38)
	struct FText                                                 InfoCategoryDescription;                           // 0xc8(0x38)
	struct FText                                                 InfoCategorySuggestion;                            // 0x100(0x38)
	bool                                                         HideInfoCategorySuggestionInSaferSeas;             // 0x138(0x1)
	char                                                         pad0x7_3NH9G[0x7];                                 // 0x139(0x7)
	struct StringAssetReference                                  InfoCategoryBackgroundImage;                       // 0x140(0x10)
};


// Size 0x1
struct ContestRequestCrewManagementEvent
{
public:
	char                                                         pad0x1_VWTDV[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct TornMapTearingParams
{
public:
	int                                                          NumPieces;                                         // 0x0(0x4)
	char                                                         pad0x4_S8IER[0x4];                                 // 0x4(0x4)
	struct StringAssetReference                                  VisibilityMask1;                                   // 0x8(0x10)
	struct StringAssetReference                                  VisibilityMask2;                                   // 0x18(0x10)
};


// Size 0x58
struct BucketContentsInfo
{
public:
	char                                                         ThrowableLiquidType;                               // 0x0(0x1)
	char                                                         pad0x7_RROH4[0x7];                                 // 0x1(0x7)
	class UClass*                                                ProjectileClassToSpawn;                            // 0x8(0x8)
	class UClass*                                                ProjectileClassToSpawnAtWielder;                   // 0x10(0x8)
	class WwiseEvent*                                            ThrowSfx;                                          // 0x18(0x8)
	class Object*                                                ThrowVfxFirstPerson;                               // 0x20(0x8)
	class Object*                                                ThrowVfxThirdPerson;                               // 0x28(0x8)
	class Object*                                                DrenchWielderVfxThirdPerson;                       // 0x30(0x8)
	class Object*                                                BucketContentsParticleSystemFirstPerson;           // 0x38(0x8)
	class Object*                                                BucketContentsParticleSystemThirdPerson;           // 0x40(0x8)
	struct FName                                                 SwitchState;                                       // 0x48(0x8)
	float                                                        LiquidLevel;                                       // 0x50(0x4)
	char                                                         pad0x4_FKCJO[0x4];                                 // 0x54(0x4)
};


// Size 0x1
struct ShipMastCollapseStateTelemetryEvent
{
public:
	bool                                                         MastCollapsedState;                                // 0x0(0x1)
};


// Size 0x50
struct EventUserGameSettingsRadialMappings
{
public:
	struct FName                                                 RadialSlotIndex0SelectedKeyboard;                  // 0x0(0x8)
	struct FName                                                 RadialSlotIndex1SelectedKeyboard;                  // 0x8(0x8)
	struct FName                                                 RadialSlotIndex2SelectedKeyboard;                  // 0x10(0x8)
	struct FName                                                 RadialSlotIndex3SelectedKeyboard;                  // 0x18(0x8)
	struct FName                                                 RadialSlotIndex4SelectedKeyboard;                  // 0x20(0x8)
	struct FName                                                 RadialSlotIndex5SelectedKeyboard;                  // 0x28(0x8)
	struct FName                                                 RadialSlotIndex6SelectedKeyboard;                  // 0x30(0x8)
	struct FName                                                 RadialSlotIndex7SelectedKeyboard;                  // 0x38(0x8)
	struct FName                                                 RadialSlotClockwise;                               // 0x40(0x8)
	struct FName                                                 RadialSlotCounterClockwise;                        // 0x48(0x8)
};


// Size 0x28
struct AIShipEncounterDynamicWaveNetworkEvent
{
public:
	char                                                         pad0x28_7YFR3[0x28];                               // 0x0(0x28)
};


// Size 0x30
struct QuickTransferTelemetryEvent
{
public:
	struct FString                                               SrcClass;                                          // 0x0(0x10)
	struct FString                                               DestClass;                                         // 0x10(0x10)
	float                                                        TransferTime;                                      // 0x20(0x4)
	int                                                          NumTransferred;                                    // 0x24(0x4)
	bool                                                         Giving;                                            // 0x28(0x1)
	char                                                         pad0x7_LZSJB[0x7];                                 // 0x29(0x7)
};


// Size 0x18
struct MigrationSetupCompleteNetworkEvent
{
public:
	char                                                         pad0x18_VZQWY[0x18];                               // 0x0(0x18)
};


// Size 0x30
struct PlayerCompanyProgress
{
public:
	struct FName                                                 CompanyId;                                         // 0x0(0x8)
	struct FString                                               Sig;                                               // 0x20(0x10)
};


// Size 0x40
struct NPCChat
{
public:
	struct FString                                               SenderName;                                        // 0x0(0x10)
	struct FString                                               Text;                                              // 0x10(0x10)
	char                                                         Type;                                              // 0x20(0x1)
	char                                                         pad0x7_EO9TV[0x7];                                 // 0x21(0x7)
	struct FString                                               Image;                                             // 0x28(0x10)
	int                                                          Timeout;                                           // 0x38(0x4)
	char                                                         pad0x4_WBCBR[0x4];                                 // 0x3c(0x4)
};


// Size 0x38
struct GhostShipRewardData
{
public:
	class WeightedItemDescSpawnDataAsset*                        Rewards;                                           // 0x0(0x8)
	struct WeightedProbabilityRange                              NumberOfItemsToSpawn;                              // 0x8(0x20)
	TArray<struct Transform>                                     SpawnTransforms;                                   // 0x28(0x10)
};


// Size 0x8
struct EventPopUpQueueServicePaused
{
public:
	bool                                                         Paused;                                            // 0x0(0x1)
	char                                                         pad0x3_FNHJO[0x3];                                 // 0x1(0x3)
	int                                                          Reason;                                            // 0x4(0x4)
};


// Size 0x50
struct TunnelDestinationInfo
{
public:
	char                                                         pad0x50_9IQY6[0x50];                               // 0x0(0x50)
};


// Size 0x28
struct VfxSelectorEntry
{
public:
	class Object*                                                ParticleSystem;                                    // 0x0(0x8)
	class WwiseEvent*                                            WiseEvent;                                         // 0x8(0x8)
	class WwiseObjectPoolWrapper*                                WwisePoolToUse;                                    // 0x10(0x8)
	struct FName                                                 RTPCName;                                          // 0x18(0x8)
	float                                                        RTPCValue;                                         // 0x20(0x4)
	char                                                         pad0x4_5LQCV[0x4];                                 // 0x24(0x4)
};


// Size 0x58
struct CrewShipSessionData
{
public:
	bool                                                         IsCaptainedSession;                                // 0x0(0x1)
	char                                                         pad0x3_F6Y70[0x3];                                 // 0x1(0x3)
	struct Guid                                                  ShipId;                                            // 0x4(0x10)
	char                                                         pad0x4_K8GT8[0x4];                                 // 0x14(0x4)
	struct FString                                               CaptainPirateId;                                   // 0x18(0x10)
	struct UniqueNetIdRepl                                       CaptainUserId;                                     // 0x28(0x18)
	bool                                                         CaptainIsPresent;                                  // 0x40(0x1)
	char                                                         pad0x3_8CG4G[0x3];                                 // 0x41(0x3)
	struct Guid                                                  GuildId;                                           // 0x44(0x10)
	char                                                         pad0x4_6S7G0[0x4];                                 // 0x54(0x4)
};


// Size 0x18
struct PlayerBuriedItemServiceMapTakenFromTavernBoardEvent
{
public:
	struct FString                                               PlayerName;                                        // 0x0(0x10)
	class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x10(0x8)
};


// Size 0x8
struct EventGhostShipPlayerSpawnLocationCreated
{
public:
	class GhostShipPlayerSpawnLocation*                          SpawnLocation;                                     // 0x0(0x8)
};


// Size 0x80
struct TutorialStepCycleWeapons
{
public:
	char                                                         pad0x80_0HPYW[0x80];                               // 0x0(0x80)
};


// Size 0x1
struct RequestWalletBalanceUpdateHUDEvent
{
public:
	char                                                         pad0x1_RXPOD[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ScrambleGamertagsSettingsChanged
{
public:
	bool                                                         ShouldScrambleGamertags;                           // 0x0(0x1)
};


// Size 0x10
struct SkullOfStormsFallDamagePreventedTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
};


// Size 0x20
struct CrewSpawnedAtNamedLocationTelemetryEvent
{
public:
	struct FString                                               LocationName;                                      // 0x0(0x10)
	struct Vector                                                Location;                                          // 0x10(0xc)
	char                                                         pad0x4_Z3U82[0x4];                                 // 0x1c(0x4)
};


// Size 0x28
struct StorageContainerMetaWrapper
{
public:
	char                                                         pad0x28_69WBW[0x28];                               // 0x0(0x28)
};


// Size 0x1
struct EventActorStoppedUsingSeat
{
public:
	char                                                         pad0x1_L6X64[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct AthenaAnimationLocomotionTurningAnimData
{
public:
	class AnimSequence*                                          Turn90;                                            // 0x0(0x8)
};


// Size 0x20
struct GlobalIslandChanceToSpawnOverride
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	float                                                        GlobalIslandChanceToSpawn;                         // 0xc(0x4)
	TArray<class SpawnRequirement*>                              Requirements;                                      // 0x10(0x10)
};


// Size 0x20
struct GetItemsInRadiusGameServerRequestModel
{
public:
	char                                                         pad0x10_IO3RX[0x10];                               // 0x0(0x10)
	struct FString                                               ItemName;                                          // 0x10(0x10)
};


// Size 0x8
struct ConsistentPercentageRewardDistributionModel
{
public:
	float                                                        PrimaryCrewPercentage;                             // 0x0(0x4)
	float                                                        SecondaryCrewsPercentage;                          // 0x4(0x4)
};


// Size 0x8
struct FishSizeAndWeight
{
public:
	char                                                         Size;                                              // 0x0(0x1)
	char                                                         pad0x3_ZL5K2[0x3];                                 // 0x1(0x3)
	float                                                        Weight;                                            // 0x4(0x4)
};


// Size 0x10
struct StartPickupObjectActionRuleParams
{
public:
	TArray<char>                                                 WieldableItemSizesDisablePickup;                   // 0x0(0x10)
};


// Size 0x10
struct CrewBeganTaleEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x20
struct UICompanyState
{
public:
	struct FName                                                 CompanyId;                                         // 0x0(0x8)
	bool                                                         IsLocked;                                          // 0x8(0x1)
	char                                                         pad0x7_1W63J[0x7];                                 // 0x9(0x7)
	struct FString                                               RibbonImageUrl;                                    // 0x10(0x10)
};


// Size 0x40
struct PhraseData
{
public:
	struct FText                                                 TextToBroadcast;                                   // 0x0(0x38)
	bool                                                         RequiresWieldedItemObjectNameAsArgument;           // 0x38(0x1)
	bool                                                         WieldedItemObjectNameIsNotLocalised;               // 0x39(0x1)
	char                                                         pad0x6_VZNPW[0x6];                                 // 0x3a(0x6)
};


// Size 0xc
struct SpotLightData
{
public:
	float                                                        InnerConeAngle;                                    // 0x0(0x4)
	float                                                        OuterConeAngle;                                    // 0x4(0x4)
	float                                                        KickBackRatio;                                     // 0x8(0x4)
};


// Size 0x20
struct TaleQuestFailedNetworkEvent
{
public:
	char                                                         pad0x18_IVF8O[0x18];                               // 0x0(0x18)
	class UClass*                                                FailureRunnable;                                   // 0x18(0x8)
};


// Size 0x18
struct PlayerHideoutInfo
{
public:
	class PlayerState*                                           PlayerState;                                       // 0x0(0x8)
	TArray<class SpawnLocation*>                                 ExitPoints;                                        // 0x8(0x10)
};


// Size 0x20
struct RequestPurchasePremiumShopOfferEvent
{
public:
	struct Guid                                                  OfferId;                                           // 0x0(0x10)
	struct FString                                               CatalogName;                                       // 0x10(0x10)
};


// Size 0x30
struct PopupQueuePlay
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
	struct FString                                               EventName;                                         // 0x10(0x10)
	struct FString                                               EventData;                                         // 0x20(0x10)
};


// Size 0xc
struct EventCompanyPromotionClaimed
{
public:
	char                                                         pad0xc_2CGGQ[0xc];                                 // 0x0(0xc)
};


// Size 0x20
struct ReapersTributeShipMigrationData
{
public:
	char                                                         pad0x10_E1B3R[0x10];                               // 0x0(0x10)
	class Actor*                                                 ReapersTributeShip;                                // 0x10(0x8)
	char                                                         pad0x8_Z2ZD7[0x8];                                 // 0x18(0x8)
};


// Size 0x2c
struct BlowpipeWeaponTelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	char                                                         DartType;                                          // 0x10(0x1)
	char                                                         LastFiredDartType;                                 // 0x11(0x1)
	bool                                                         Hipfired;                                          // 0x12(0x1)
	bool                                                         UsingInfiniteAmmo;                                 // 0x13(0x1)
	float                                                        RequestedGravityFalloffScalar;                     // 0x14(0x4)
	float                                                        FinalGravityFalloffScalar;                         // 0x18(0x4)
	bool                                                         GravityFalloffScalarExceededServerTolerance;       // 0x1c(0x1)
	char                                                         pad0x3_3R80D[0x3];                                 // 0x1d(0x3)
	float                                                        RequestedOverrideVelocity;                         // 0x20(0x4)
	float                                                        FinalOverrideVelocity;                             // 0x24(0x4)
	bool                                                         OverrideVelocityExceededServerTolerance;           // 0x28(0x1)
	char                                                         pad0x3_F0LU9[0x3];                                 // 0x29(0x3)
};


// Size 0x1
struct ActiveGuildBrandingRequest
{
public:
	char                                                         pad0x1_H2ZOM[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct RequestOpenMultiShopSelectionScreenEvent
{
public:
	char                                                         MultiShopTypeValue;                                // 0x0(0x1)
};


// Size 0x1
struct PirateProfilesBeginPirateCreationToGame
{
public:
	char                                                         pad0x1_5TI1A[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct LightingControllerMaterialInstances
{
public:
	TArray<class MaterialInstanceDynamic*>                       SkyDomeMaterials;                                  // 0x0(0x10)
	class MaterialInstanceDynamic*                               NorthStarMaterial;                                 // 0x10(0x8)
	class MaterialInstanceDynamic*                               MoonMaterial;                                      // 0x18(0x8)
};


// Size 0x1
struct PirateProfiles_ConsumableEntitlementsErrorResponseEvent
{
public:
	char                                                         pad0x1_BBD8D[0x1];                                 // 0x0(0x1)
};


// Size 0xc
struct MaxHolePerIslandDataAsset
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	int                                                          MaxHoles;                                          // 0x8(0x4)
};


// Size 0xd8
struct TutorialStepBeginTallTale
{
public:
	char                                                         pad0xd8_QCJ17[0xd8];                               // 0x0(0xd8)
};


// Size 0x1
struct BootFlowStartLoadIntoGameEvent
{
public:
	char                                                         pad0x1_6YVE1[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct WheelMovementDeniedTelemetryEvent
{
public:
	struct FString                                               Event;                                             // 0x0(0x10)
	float                                                        MaxServerAngleDeltaExpected;                       // 0x10(0x4)
	float                                                        DetectedAngleDelta;                                // 0x14(0x4)
};


// Size 0x10
struct ShipCustomizationLoadoutUpdatedEvent
{
public:
	char                                                         pad0x10_BISI0[0x10];                               // 0x0(0x10)
};


// Size 0x1
struct EventDockingStateChanged
{
public:
	char                                                         pad0x1_QXGQ7[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct CloudTypeNormalizedWeight
{
public:
	struct LinearColor                                           LodScreenPercentages;                              // 0x0(0x10)
	float                                                        ProbabilityWeight;                                 // 0x10(0x4)
	float                                                        MeshRadius;                                        // 0x14(0x4)
};


// Size 0x10
struct EventGhostShipRequestIndefiniteDoorLock
{
public:
	class Controller*                                            PlayerController;                                  // 0x0(0x8)
	class Object*                                                Owner;                                             // 0x8(0x8)
};


// Size 0x1
struct EventPlayerConfigRequestAllConfigs
{
public:
	char                                                         pad0x1_E8A4C[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct RewardId
{
public:
	struct FName                                                 RewardId;                                          // 0x0(0x8)
};


// Size 0x28
struct ForkedStep
{
public:
	int                                                          Index;                                             // 0x0(0x4)
	struct Guid                                                  Id;                                                // 0x4(0x10)
	char                                                         pad0x4_8K99P[0x4];                                 // 0x14(0x4)
	char                                                         pad0x10_9DTNA[0x10];                               // 0x18(0x10)
};


// Size 0x1
struct CrewMemberLeftTunnelOfTheDamnedTelemetryEvent
{
public:
	char                                                         pad0x1_EM7TI[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct RevealableStateChangeServerRpc
{
public:
	char                                                         pad0x18_ST85C[0x18];                               // 0x0(0x18)
	class RevealableComponent*                                   RevealableComponent;                               // 0x18(0x8)
	char                                                         RevealState;                                       // 0x20(0x1)
	char                                                         pad0x7_UTJIR[0x7];                                 // 0x21(0x7)
};


// Size 0x28
struct ServerDeniedClientAtPreLoginTelemetryEvent
{
public:
	struct FString                                               ErrorMessage;                                      // 0x0(0x10)
	struct FString                                               UserId;                                            // 0x10(0x10)
	char                                                         ReasonCode;                                        // 0x20(0x1)
	char                                                         pad0x7_DC4JU[0x7];                                 // 0x21(0x7)
};


// Size 0x60
struct WorldMapIslandData
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	struct FString                                               IslandUrl;                                         // 0x38(0x10)
	float                                                        MinX;                                              // 0x48(0x4)
	float                                                        MinY;                                              // 0x4c(0x4)
	float                                                        MaxX;                                              // 0x50(0x4)
	float                                                        MaxY;                                              // 0x54(0x4)
	float                                                        Rotation;                                          // 0x58(0x4)
	float                                                        LabelOffset;                                       // 0x5c(0x4)
};


// Size 0x48
struct RecentPlayer
{
public:
	struct FString                                               Gamertag;                                          // 0x0(0x10)
	struct FString                                               Xuid;                                              // 0x10(0x10)
	char                                                         Platform;                                          // 0x20(0x1)
	char                                                         pad0x7_8CB8U[0x7];                                 // 0x21(0x7)
	struct FString                                               PlatformUsername;                                  // 0x28(0x10)
	struct FString                                               PlatformUserId;                                    // 0x38(0x10)
};


// Size 0x1
struct EventPrimaryPlayerProfileDisconnected
{
public:
	char                                                         pad0x1_UK7UC[0x1];                                 // 0x0(0x1)
};


// Size 0x68
struct AthenaAnimationLocomotion
{
public:
	struct Vector                                                CharacterVelocity;                                 // 0x0(0xc)
	float                                                        WantedMovementSpeed;                               // 0xc(0x4)
	float                                                        HalfWantedMovementSpeed;                           // 0x10(0x4)
	bool                                                         CharacterMoving;                                   // 0x14(0x1)
	bool                                                         RunStopWanted;                                     // 0x15(0x1)
	char                                                         pad0x2_HSV51[0x2];                                 // 0x16(0x2)
	float                                                        TurnRate;                                          // 0x18(0x4)
	float                                                        CurrentYaw;                                        // 0x1c(0x4)
	float                                                        CurrentDirection;                                  // 0x20(0x4)
	bool                                                         TurningActive;                                     // 0x24(0x1)
	bool                                                         TurningLeft;                                       // 0x25(0x1)
	bool                                                         IsSwimming;                                        // 0x26(0x1)
	bool                                                         IsUnderwaterSwimming;                              // 0x27(0x1)
	float                                                        BlendedTurnRate;                                   // 0x28(0x4)
	float                                                        MinimumMoveSpeedToTriggerRunStop;                  // 0x2c(0x4)
	float                                                        InterpSpeed;                                       // 0x30(0x4)
	float                                                        TurnRateToDisableTurns;                            // 0x34(0x4)
	float                                                        TurningAnimationExplicitTime;                      // 0x38(0x4)
	float                                                        FixedBlendedTurnRateForAI;                         // 0x3c(0x4)
	bool                                                         IsInAITurn;                                        // 0x40(0x1)
	char                                                         pad0x17_K76TP[0x17];                               // 0x41(0x17)
	class AthenaAnimationInstance*                               CachedOwner;                                       // 0x58(0x8)
	char                                                         pad0x8_KPO9G[0x8];                                 // 0x60(0x8)
};


// Size 0xa0
struct LoadoutCostResponseModel
{
public:
	char                                                         pad0xa0_25EHF[0xa0];                               // 0x0(0xa0)
};


// Size 0x10
struct CrewCancelVoteToBrigEvent
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
};


// Size 0x8
struct TutorialHideFootstepEvent
{
public:
	char                                                         pad0x8_QLZ3U[0x8];                                 // 0x0(0x8)
};


// Size 0x28
struct SessionManagementCommandSetRolePermission
{
public:
	char                                                         pad0x20_YXPPB[0x20];                               // 0x0(0x20)
	char                                                         PermissionToChange;                                // 0x20(0x1)
	char                                                         NewRole;                                           // 0x21(0x1)
	char                                                         pad0x6_D8YBJ[0x6];                                 // 0x22(0x6)
};


// Size 0x88
struct ItemReactionItemProxyActionRuleParams
{
public:
	float                                                        ItemReactionHoldTime;                              // 0x0(0x4)
	char                                                         pad0x4_N5GU5[0x4];                                 // 0x4(0x4)
	class UClass*                                                PressedNotificationInputId;                        // 0x8(0x8)
	class UClass*                                                ReleasedNotificationInputId;                       // 0x10(0x8)
	struct FText                                                 ItemReactionItemProxyText;                         // 0x18(0x38)
	struct FText                                                 ItemReactionIncorrectWieldableProxyText;           // 0x50(0x38)
};


// Size 0x30
struct EngagementMessageServiceResultEvent
{
public:
	char                                                         pad0x30_LSEZS[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVarPLSection
{
public:
	char                                                         pad0x30_IRA2P[0x30];                               // 0x0(0x30)
};


// Size 0x18
struct CrewMutePlayerVoiceEvent
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
	bool                                                         IsMuted;                                           // 0x10(0x1)
	char                                                         pad0x7_0GD2P[0x7];                                 // 0x11(0x7)
};


// Size 0x30
struct VoteRemovedNetworkEvent
{
public:
	char                                                         pad0x18_FOJBM[0x18];                               // 0x0(0x18)
	struct FName                                                 CompanyId;                                         // 0x18(0x8)
	struct Guid                                                  CrewId;                                            // 0x20(0x10)
};


// Size 0x1
struct BootFlowPirateProfilesTabEnteredEvent
{
public:
	char                                                         pad0x1_7D19A[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ShipCustomizationChestUpdateSavedLoadoutFailedEvent
{
public:
	char                                                         pad0x1_0UWPM[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct CrewSessionLostEvent
{
public:
	char                                                         pad0x1_3NLGJ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ScuttleAndChangeSeaTelemetryEvent
{
public:
	bool                                                         bIsCancellingEvent;                                // 0x0(0x1)
};


// Size 0x10
struct VaultPuzzleSolutionPositions
{
public:
	TArray<int>                                                  SolutionPositions;                                 // 0x0(0x10)
};


// Size 0x1
struct AthenaAICharacterNewWaveGroupSpawned
{
public:
	char                                                         pad0x1_IK35C[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct PetChestPetNameUpdatedEvent
{
public:
	struct FString                                               PetName;                                           // 0x0(0x10)
};


// Size 0x20
struct ConditionalStatContext
{
public:
	class Object*                                                ObjectOfInterest1;                                 // 0x0(0x8)
	class Object*                                                ObjectOfInterest2;                                 // 0x8(0x8)
	char                                                         pad0x10_IZVMU[0x10];                               // 0x10(0x10)
};


// Size 0x40
struct BuoyancyHelperParams
{
public:
	char                                                         pad0x8_VAHHD[0x8];                                 // 0x0(0x8)
	class Actor*                                                 BuoyancyComponentOwner;                            // 0x8(0x8)
	class ShapeComponent*                                        BuoyancyBaseComponent;                             // 0x10(0x8)
	char                                                         pad0x28_59FU9[0x28];                               // 0x18(0x28)
};


// Size 0x10
struct ClientStartLobbyTelemetryEvent
{
public:
	struct FString                                               SessionType;                                       // 0x0(0x10)
};


// Size 0x18
struct EventPlayerDockToObjectEnd
{
public:
	char                                                         pad0x10_GI7Y9[0x10];                               // 0x0(0x10)
	bool                                                         CanLookAtBeDisabledWhenDockedToObject;             // 0x10(0x1)
	char                                                         pad0x7_WVUNN[0x7];                                 // 0x11(0x7)
};


// Size 0x1
struct EventPreStartStow
{
public:
	char                                                         StowMethod;                                        // 0x0(0x1)
};


// Size 0x8
struct RequestCreateItemPreviewEvent
{
public:
	int                                                          ResolutionX;                                       // 0x0(0x4)
	int                                                          ResolutionY;                                       // 0x4(0x4)
};


// Size 0xc
struct SetTriggerDetectingItemGameServerRequestModel
{
public:
	char                                                         pad0x8_PDRMK[0x8];                                 // 0x0(0x8)
	int                                                          ItemId;                                            // 0x8(0x4)
};


// Size 0x10
struct ShipPreviewCreatedEvent
{
public:
	struct FString                                               PreviewURL;                                        // 0x0(0x10)
};


// Size 0xc
struct SingleStickMappingUserSettingsBoolean
{
public:
	struct FName                                                 SettingName;                                       // 0x0(0x8)
	bool                                                         Value;                                             // 0x8(0x1)
	char                                                         pad0x3_NJ0AP[0x3];                                 // 0x9(0x3)
};


// Size 0x18
struct ScheduledShutdownSettingsClient
{
public:
	float                                                        StartScreenFadeWithTimeRemainingSeconds;           // 0x0(0x4)
	float                                                        ScreenFadeTimeSeconds;                             // 0x4(0x4)
	float                                                        QuitGameTimeRemainingSeconds;                      // 0x8(0x4)
	float                                                        UpperDisplayPeriodTimeSeconds;                     // 0xc(0x4)
	float                                                        LowerDisplayPeriodTimeSeconds;                     // 0x10(0x4)
	float                                                        SwitchToLowerTimePeriodWithTimeRemainingSeconds;   // 0x14(0x4)
};


// Size 0x8
struct EventItemRepresentationReplicated
{
public:
	class Actor*                                                 ItemRepresentation;                                // 0x0(0x8)
};


// Size 0xd0
struct StormScalingParameters
{
public:
	struct FName                                                 MaterialMaskPropertyName;                          // 0x0(0x8)
	struct FName                                                 RainOpacityPropertyName;                           // 0x8(0x8)
	class CurveFloat*                                            RadiusCurve;                                       // 0x10(0x8)
	class CurveFloat*                                            OuterRadiusCurve;                                  // 0x18(0x8)
	class CurveFloat*                                            RainSheetOuterOpacityCurve;                        // 0x20(0x8)
	class CurveFloat*                                            RainSheetInnerOpacityCurve;                        // 0x28(0x8)
	class CurveFloat*                                            BaseCloudHeightCurve;                              // 0x30(0x8)
	class CurveFloat*                                            BaseCloudMaskCurve;                                // 0x38(0x8)
	class CurveFloat*                                            RingCloudHeightCurve;                              // 0x40(0x8)
	class CurveFloat*                                            RingCloudMaskCurve;                                // 0x48(0x8)
	class CurveFloat*                                            TopCloudHeightCurve;                               // 0x50(0x8)
	class CurveFloat*                                            TopCloudMaskCurve;                                 // 0x58(0x8)
	class CurveFloat*                                            PressureZoneRadiusCurve;                           // 0x60(0x8)
	class CurveFloat*                                            PressureZoneTargetCurve;                           // 0x68(0x8)
	class CurveFloat*                                            PressureZonePushCurve;                             // 0x70(0x8)
	class CurveFloat*                                            PressureZoneWeightCurve;                           // 0x78(0x8)
	class CurveFloat*                                            RainStrengthCurve;                                 // 0x80(0x8)
	class CurveFloat*                                            WindStrengthCurve;                                 // 0x88(0x8)
	class CurveFloat*                                            WindInnerRadiusCurve;                              // 0x90(0x8)
	class CurveFloat*                                            WaterStrengthCurve;                                // 0x98(0x8)
	class CurveLinearColor*                                      RainSheetOuterScaleCurve;                          // 0xa0(0x8)
	class CurveLinearColor*                                      RainSheetInnerScaleCurve;                          // 0xa8(0x8)
	class CurveLinearColor*                                      BaseCloudScaleCurve;                               // 0xb0(0x8)
	class CurveLinearColor*                                      RingCloudScaleCurve;                               // 0xb8(0x8)
	class CurveLinearColor*                                      TopCloudScaleCurve;                                // 0xc0(0x8)
	float                                                        AngryWaterLerpRatio;                               // 0xc8(0x4)
	char                                                         pad0x4_E02CG[0x4];                                 // 0xcc(0x4)
};


// Size 0x10
struct CrewRequestedRivalChangeEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x10
struct KrakenAnimatedTentacleHeldTargetVomittingChance
{
public:
	float                                                        Chance;                                            // 0x0(0x4)
	char                                                         pad0x4_OLB3Y[0x4];                                 // 0x4(0x4)
	class UClass*                                                CurrentState;                                      // 0x8(0x8)
};


// Size 0x1
struct EventSaveUserGameSettingsRequest
{
public:
	char                                                         pad0x1_DGW4H[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct VirtualActionBindingDefinition
{
public:
	TArray<struct Name>                                          ActionNames;                                       // 0x0(0x10)
	struct FString                                               BindingName;                                       // 0x10(0x10)
};


// Size 0x10
struct NotesRemoteServiceModel
{
public:
	TArray<struct Guid>                                          Notes;                                             // 0x0(0x10)
};


// Size 0x80
struct MovedByActorActionStateConstructionInfo
{
public:
	char                                                         pad0x48_8URNP[0x48];                               // 0x0(0x48)
	struct NetActorPtr                                           MovementSourceActor;                               // 0x48(0x14)
	struct Vector                                                StartLocation;                                     // 0x5c(0xc)
	class SceneComponent*                                        TargetComponent;                                   // 0x68(0x8)
	struct Vector                                                TargetRelativeLocation;                            // 0x70(0xc)
	char                                                         pad0x4_5PCZA[0x4];                                 // 0x7c(0x4)
};


// Size 0x40
struct PlayerCrewAssignmentMessage
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct UniqueNetIdRepl                                       UserId;                                            // 0x10(0x18)
	struct FString                                               PirateId;                                          // 0x28(0x10)
	char                                                         SessionType;                                       // 0x38(0x1)
	char                                                         pad0x3_JO0K7[0x3];                                 // 0x39(0x3)
	int                                                          ServerCrewCapacity;                                // 0x3c(0x4)
};


// Size 0x80
struct TreasureMapWidgetLocalisedTextWithFontOverride
{
public:
	char                                                         pad0x78_78U69[0x78];                               // 0x0(0x78)
	class Font*                                                  FontOverride;                                      // 0x78(0x8)
};


// Size 0x1
struct EventAthenaLocalPlayerGamepadTypeChange
{
public:
	char                                                         GamepadType;                                       // 0x0(0x1)
};


// Size 0x1
struct EventShipExitedWater
{
public:
	char                                                         pad0x1_FZEXO[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct CurrencyGrantedEvent
{
public:
	char                                                         pad0x4_ZDUVJ[0x4];                                 // 0x0(0x4)
	char                                                         Currency;                                          // 0x4(0x1)
	char                                                         pad0x3_30MC9[0x3];                                 // 0x5(0x3)
	struct Guid                                                  TransactionId;                                     // 0x8(0x10)
	struct FName                                                 EmissaryAffiliation;                               // 0x18(0x8)
	double                                                       EmissaryMultiplier;                                // 0x28(0x8)
};


// Size 0x1
struct EventTavernStepsOpened
{
public:
	char                                                         pad0x1_3T35H[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct CrewChangeFailedEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x80
struct TradeRouteMapData
{
public:
	char                                                         pad0x48_EZTGV[0x48];                               // 0x0(0x48)
	struct InterpCurveVector2D                                   TradeRoutePath;                                    // 0x48(0x18)
	struct Vector2D                                              TradeRoutePathOffset;                              // 0x60(0x8)
	float                                                        TradeRoutePathSpacing;                             // 0x68(0x4)
	float                                                        TradeRoutePathSegmentTextureWidth;                 // 0x6c(0x4)
	float                                                        TradeRoutePathSegmentTextureLength;                // 0x70(0x4)
	bool                                                         NormalizeSplinePointSpacing;                       // 0x74(0x1)
	char                                                         pad0x3_EX79T[0x3];                                 // 0x75(0x3)
	float                                                        NormalizeAdjustment;                               // 0x78(0x4)
	bool                                                         IgnoreFirstPoint;                                  // 0x7c(0x1)
	char                                                         pad0x3_4P03J[0x3];                                 // 0x7d(0x3)
};


// Size 0x18
struct ReplenishableContentsInfo
{
public:
	struct FString                                               ItemDesc;                                          // 0x0(0x10)
	int                                                          Stock;                                             // 0x10(0x4)
	char                                                         pad0x4_NO6PW[0x4];                                 // 0x14(0x4)
};


// Size 0x30
struct QuestVariableVector
{
public:
	char                                                         pad0x30_F4T36[0x30];                               // 0x0(0x30)
};


// Size 0x18
struct UIQuestTableCloseTelemetryEvent
{
public:
	float                                                        TotalTimeInQuestTable;                             // 0x0(0x4)
	char                                                         pad0x4_KU4SY[0x4];                                 // 0x4(0x4)
	struct FString                                               SessionId;                                         // 0x8(0x10)
};


// Size 0x10
struct ItemReplenisherItem
{
public:
	char                                                         pad0x10_AD38J[0x10];                               // 0x0(0x10)
};


// Size 0x1
struct BootFlowStartMarketingOptInStateEvent
{
public:
	char                                                         pad0x1_03BRE[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct QuestVariableFloat
{
public:
	char                                                         pad0x30_LQOXF[0x30];                               // 0x0(0x30)
};


// Size 0x4
struct VengeanceDurationServerTelemetryEvent
{
public:
	float                                                        VengeanceDuration;                                 // 0x0(0x4)
};


// Size 0x50
struct StarFieldRevealerMaskAudioParams
{
public:
	class WwiseObjectPoolWrapper*                                WwisePool;                                         // 0x0(0x8)
	struct FName                                                 WwiseEmitterName;                                  // 0x8(0x8)
	char                                                         pad0x20_QTSU5[0x20];                               // 0x10(0x20)
	class WwiseEvent*                                            WearMaskEvent;                                     // 0x30(0x8)
	class WwiseEvent*                                            RemoveMaskEvent;                                   // 0x38(0x8)
	class WwiseEvent*                                            MaskSkySpinSFXEvent;                               // 0x40(0x8)
	class WwiseEvent*                                            MaskSkySpinMusicEvent;                             // 0x48(0x8)
};


// Size 0x10
struct MusicEvent
{
public:
	class WwiseEvent*                                            StartEvent;                                        // 0x0(0x8)
	class WwiseEvent*                                            StopEvent;                                         // 0x8(0x8)
};


// Size 0x30
struct SpawnerCreatedAutomationEvent
{
public:
	class Actor*                                                 SpawnerLocation;                                   // 0x0(0x8)
	char                                                         pad0x20_T7RHD[0x20];                               // 0x8(0x20)
	class AISpawner*                                             Spawner;                                           // 0x28(0x8)
};


// Size 0x1
struct PlayerInfoRequest
{
public:
	char                                                         pad0x1_NTGKZ[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct WeightedItemDescSpawnData
{
public:
	class ItemSpawnData*                                         ItemSpawnData;                                     // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	bool                                                         LimitMaxSpawnedItems;                              // 0xc(0x1)
	char                                                         pad0x3_P7SFH[0x3];                                 // 0xd(0x3)
	struct FName                                                 Feature;                                           // 0x14(0x8)
	bool                                                         InvertFeatureCheck;                                // 0x1c(0x1)
	char                                                         pad0x3_6KOGC[0x3];                                 // 0x1d(0x3)
	TArray<class SpawnRequirement*>                              Requirements;                                      // 0x20(0x10)
	bool                                                         CustomLifetimeManagement;                          // 0x30(0x1)
	char                                                         pad0x7_1KPPW[0x7];                                 // 0x31(0x7)
};


// Size 0x50
struct CanvasWorldMapSeaAreaItems
{
public:
	class Texture*                                               Texture;                                           // 0x0(0x8)
	struct FText                                                 Name;                                              // 0x8(0x38)
	struct Vector2D                                              Location;                                          // 0x40(0x8)
	struct FName                                                 FeatureName;                                       // 0x48(0x8)
};


// Size 0x8
struct AthenaPlayerControllerEndingPlayInContestStage
{
public:
	class AthenaPlayerController*                                Controller;                                        // 0x0(0x8)
};


// Size 0x18
struct WeightedTreasureChestDesc
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	struct FName                                                 Feature;                                           // 0x4(0x8)
	char                                                         pad0x4_XML9M[0x4];                                 // 0xc(0x4)
	class UClass*                                                Desc;                                              // 0x10(0x8)
};


// Size 0x28
struct SyncLoad
{
public:
	struct FString                                               PackageOrObject;                                   // 0x0(0x10)
	struct FString                                               Outer;                                             // 0x10(0x10)
	double                                                       DurationInSeconds;                                 // 0x20(0x8)
};


// Size 0x1
struct EventApplicationSuspended
{
public:
	char                                                         pad0x1_TO4XG[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct BountyQuestApproachesLandmarkTelemetryEvent
{
public:
	struct FString                                               LandmarkName;                                      // 0x0(0x10)
};


// Size 0x58
struct CategoryTab
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	struct FString                                               UniqueTextIdentifier;                              // 0x38(0x10)
	struct FString                                               IconPath;                                          // 0x48(0x10)
};


// Size 0x18
struct BootyItemDroppedOnShipEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	class ItemInfo*                                              ItemOnShip;                                        // 0x8(0x8)
	bool                                                         FirstTimeDroppedOnOwnOrAnotherShipByCrew;          // 0x10(0x1)
	bool                                                         FirstTimeDroppedOnShipByAnyCrew;                   // 0x11(0x1)
	char                                                         pad0x6_7QFMW[0x6];                                 // 0x12(0x6)
};


// Size 0x20
struct ProposedTaleEntry
{
public:
	class VoyageDescDataAsset*                                   TaleData;                                          // 0x0(0x8)
	class VoyageProposalDesc*                                    TaleProposal;                                      // 0x8(0x8)
	class Actor*                                                 ProposingObject;                                   // 0x10(0x8)
	bool                                                         CanStartTale;                                      // 0x18(0x1)
	char                                                         pad0x7_2BFRT[0x7];                                 // 0x19(0x7)
};


// Size 0x1
struct EventInGameBlurRequest
{
public:
	bool                                                         ShouldBlurGame;                                    // 0x0(0x1)
};


// Size 0x1
struct RejectRejoinEvent
{
public:
	char                                                         pad0x1_J44C9[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct RequestShowGamerCard
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
};


// Size 0x70
struct Island
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	char                                                         IslandType;                                        // 0x8(0x1)
	char                                                         pad0x7_GBSGL[0x7];                                 // 0x9(0x7)
	class UClass*                                                Sea;                                               // 0x10(0x8)
	struct Vector                                                IslandBoundsCentre;                                // 0x18(0xc)
	float                                                        IslandBoundsRadius;                                // 0x24(0x4)
	float                                                        IslandTriggerRadius;                               // 0x28(0x4)
	float                                                        IslandSafeZoneRadius;                              // 0x2c(0x4)
	float                                                        ShipDiveAndResurfaceExclusionZoneRadius;           // 0x30(0x4)
	float                                                        Rotation;                                          // 0x34(0x4)
	struct Vector                                                CompassDirectionIslandCentre;                      // 0x38(0xc)
	char                                                         pad0x4_9FO6L[0x4];                                 // 0x44(0x4)
	class AICreatureMovementModifierParamsDataAsset*             PetMovementParamsData;                             // 0x48(0x8)
	char                                                         pad0x10_6QXJ0[0x10];                               // 0x50(0x10)
	TArray<struct Name>                                          IslandFeatureNames;                                // 0x60(0x10)
};


// Size 0x30
struct ClothingLoadout
{
public:
	TArray<class Class*>                                         Items;                                             // 0x0(0x10)
	TArray<class Class*>                                         CachedEmoteItems;                                  // 0x10(0x10)
	TArray<class Class*>                                         CachedWalkableEmoteItems;                          // 0x20(0x10)
};


// Size 0x20
struct ClientInfoTelemetryEvent
{
public:
	struct FString                                               OSVersion;                                         // 0x0(0x10)
	struct FString                                               OSSubVersion;                                      // 0x10(0x10)
};


// Size 0x1
struct ShipVoteToScuttleAndChangeSeasEvent
{
public:
	char                                                         pad0x1_W7YIB[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventCurseDrunkennessEnd
{
public:
	char                                                         pad0x1_S2DAE[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct AIShipSpawnedEvent
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	struct Guid                                                  SpawningCrew;                                      // 0x8(0x10)
	struct Guid                                                  SpawningEventId;                                   // 0x18(0x10)
	struct Guid                                                  SpawnConfigId;                                     // 0x28(0x10)
	int                                                          Wave;                                              // 0x38(0x4)
	char                                                         pad0x4_LXWN4[0x4];                                 // 0x3c(0x4)
};


// Size 0x1
struct CachingOfShipPreviewLoadoutsCompleteEvent
{
public:
	char                                                         pad0x1_7V1IA[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct NPCCustomAnimationBlueprintPlayingAnimations
{
public:
	class AnimSequenceBase*                                      OneShot;                                           // 0x0(0x8)
	class AnimSequenceBase*                                      ContinouousIn;                                     // 0x8(0x8)
	class AnimSequenceBase*                                      ContinouousLoop_A;                                 // 0x10(0x8)
	class AnimSequenceBase*                                      ContinouousLoop_B;                                 // 0x18(0x8)
	class AnimSequenceBase*                                      ContinouousOut;                                    // 0x20(0x8)
};


// Size 0x10
struct ClientStartConnectingToServerTelemetryEvent
{
public:
	struct Guid                                                  MatchmakingAttemptId;                              // 0x0(0x10)
};


// Size 0x30
struct BundleMetadataResponse
{
public:
	struct FString                                               ProductId;                                         // 0x0(0x10)
	struct FString                                               ImageUri;                                          // 0x10(0x10)
	TArray<String>                                               MetaTags;                                          // 0x20(0x10)
};


// Size 0x1
struct EventCompanyDataRequest
{
public:
	char                                                         pad0x1_PXQKP[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct WalkableEmoteDescHelpers
{
public:
	char                                                         pad0x1_FJA9E[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventGhostShipPlayerSpawnLocationDestroyed
{
public:
	class GhostShipPlayerSpawnLocation*                          SpawnLocation;                                     // 0x0(0x8)
};


// Size 0x58
struct AimAssistStyleData
{
public:
	class UClass*                                                WeaponCategory;                                    // 0x0(0x8)
	float                                                        HipFireTargetMaxDistance;                          // 0x8(0x4)
	char                                                         pad0x4_6U7KG[0x4];                                 // 0xc(0x4)
	class CurveFloat*                                            HipFireTargetDistanceFromPlayerToInfluenceRadius;  // 0x10(0x8)
	float                                                        AimingDownSightsTargetMaxDistance;                 // 0x18(0x4)
	char                                                         pad0x4_EPHBH[0x4];                                 // 0x1c(0x4)
	class CurveFloat*                                            AimingDownSightsTargetDistanceFromPlayerToInfluenceRadius; // 0x20(0x8)
	class CurveFloat*                                            TargetDistanceFromPlayerToSlowDownAtZeroPlayerSpeed; // 0x28(0x8)
	class CurveFloat*                                            TargetDistanceFromPlayerToSlowDownAtFullPlayerSpeed; // 0x30(0x8)
	class CurveFloat*                                            TargetDistanceFromPlayerToSlowDownAtZeroPlayerSpeedHipFire; // 0x38(0x8)
	class CurveFloat*                                            TargetDistanceFromPlayerToSlowDownAtFullPlayerSpeedHipFire; // 0x40(0x8)
	class CurveFloat*                                            TargetDistanceFromPlayerToTargetRotationalVeloctyCompensation; // 0x48(0x8)
	class CurveFloat*                                            TargetDistanceFromPlayerToTargetRotationalVeloctyCompensationHipFire; // 0x50(0x8)
};


// Size 0x28
struct ClientBootFlowStampSwapResultTelemetryEvent
{
public:
	struct FString                                               FromStampId;                                       // 0x0(0x10)
	struct FString                                               ToStampId;                                         // 0x10(0x10)
	bool                                                         StampSwapOccurred;                                 // 0x20(0x1)
	char                                                         pad0x7_HZKG7[0x7];                                 // 0x21(0x7)
};


// Size 0x48
struct UIPremiumStorePageTransitionTelemetryEvent
{
public:
	struct FString                                               CurrentPage;                                       // 0x0(0x10)
	struct FString                                               PreviousHighlight;                                 // 0x10(0x10)
	struct FString                                               PreviousPage;                                      // 0x20(0x10)
	struct FString                                               SessionId;                                         // 0x30(0x10)
	float                                                        TimeOnPreviousPage;                                // 0x40(0x4)
	char                                                         pad0x4_KVRKZ[0x4];                                 // 0x44(0x4)
};


// Size 0x68
struct RewardGrantedEvent
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
	struct FString                                               RewardId;                                          // 0x10(0x10)
	char                                                         CurrencyId;                                        // 0x20(0x1)
	char                                                         pad0x3_5YVLZ[0x3];                                 // 0x21(0x3)
	struct FString                                               CompanyId;                                         // 0x28(0x10)
	TArray<String>                                               Entitlements;                                      // 0x40(0x10)
	struct FString                                               DeferralReason;                                    // 0x50(0x10)
	char                                                         Propogation;                                       // 0x60(0x1)
	char                                                         pad0x7_9HATM[0x7];                                 // 0x61(0x7)
};


// Size 0x1
struct SwingDoorOpenedEvent
{
public:
	char                                                         pad0x1_645VX[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct ScoreReasonIcons
{
public:
	char                                                         ReasonForScore;                                    // 0x0(0x1)
	char                                                         pad0x7_3LEWC[0x7];                                 // 0x1(0x7)
	struct StringAssetReference                                  ScoringIconAssetReference;                         // 0x8(0x10)
	class Texture*                                               ScoreScrollScoringIcon;                            // 0x18(0x8)
};


// Size 0x1
struct ArenaTutorialFinishedEvent
{
public:
	char                                                         pad0x1_1I9CK[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct CaptainsLogAccoladesCommittedEvent
{
public:
	TArray<String>                                               PirateAccolades;                                   // 0x0(0x10)
	TArray<String>                                               ShipAccolades;                                     // 0x10(0x10)
};


// Size 0x190
struct TutorialStepReturnToStranger
{
public:
	char                                                         pad0x190_NWQUK[0x190];                             // 0x0(0x190)
};


// Size 0x10
struct CrewManagementMemberBrigState
{
public:
	bool                                                         Voted;                                             // 0x0(0x1)
	char                                                         pad0x3_WCFD1[0x3];                                 // 0x1(0x3)
	int                                                          VotesCast;                                         // 0x4(0x4)
	int                                                          VotesRequired;                                     // 0x8(0x4)
	char                                                         State;                                             // 0xc(0x1)
	char                                                         pad0x3_X72R6[0x3];                                 // 0xd(0x3)
};


// Size 0x20
struct LadderTransitionDeniedTelemetryEvent
{
public:
	struct FString                                               ObjectId;                                          // 0x0(0x10)
	struct FString                                               Reason;                                            // 0x10(0x10)
};


// Size 0x10
struct CampfireDamageLightingChance
{
public:
	class UClass*                                                DamageType;                                        // 0x0(0x8)
	float                                                        Chance;                                            // 0x8(0x4)
	char                                                         pad0x4_SJUNL[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct EventShipTopDeckBlocked
{
public:
	struct Guid                                                  BlockerId;                                         // 0x0(0x10)
};


// Size 0x18
struct DeferralReasonPopUpNotificationInfo
{
public:
	struct FString                                               DeferralReason;                                    // 0x0(0x10)
	class PopUpMessageDesc*                                      PopUp;                                             // 0x10(0x8)
};


// Size 0x10
struct FishStormFishParams
{
public:
	char                                                         pad0x10_5SCNL[0x10];                               // 0x0(0x10)
};


// Size 0x48
struct ShipHullAudioData
{
public:
	struct WwiseEmitter                                          Emitter;                                           // 0x0(0x20)
	class WwiseObjectPoolWrapper*                                WwiseObjectPoolWrapper;                            // 0x20(0x8)
	class WwiseEvent*                                            WwiseEvent;                                        // 0x28(0x8)
	struct FName                                                 Name;                                              // 0x30(0x8)
	struct Vector                                                Offset;                                            // 0x38(0xc)
	bool                                                         SetRTPC_Pitch;                                     // 0x44(0x1)
	bool                                                         SetRTPC_Roll;                                      // 0x44(0x1)
	bool                                                         SetRTPC_Velocity;                                  // 0x44(0x1)
	char                                                         pad0x3_C6Z8Q[0x3];                                 // 0x45(0x3)
};


// Size 0x38
struct StartCameraFadeRpc
{
public:
	char                                                         pad0x18_KYSGB[0x18];                               // 0x0(0x18)
	float                                                        FromAlpha;                                         // 0x18(0x4)
	float                                                        ToAlpha;                                           // 0x1c(0x4)
	float                                                        FadeTimeInSeconds;                                 // 0x20(0x4)
	struct LinearColor                                           FadeColour;                                        // 0x24(0x10)
	bool                                                         ShouldFadeAudio;                                   // 0x34(0x1)
	bool                                                         HoldFadeWhenFinished;                              // 0x35(0x1)
	char                                                         pad0x2_BWHAX[0x2];                                 // 0x36(0x2)
};


// Size 0x20
struct RemoteConfigurationProviderUpdateConfigurationEvent
{
public:
	char                                                         pad0x20_UCN66[0x20];                               // 0x0(0x20)
};


// Size 0x38
struct LightingControllerMoonParams
{
public:
	TArray<float>                                                MoonPhaseAngles;                                   // 0x0(0x10)
	float                                                        MoonYaw;                                           // 0x10(0x4)
	float                                                        MoonElevation;                                     // 0x14(0x4)
	float                                                        MoonOrbitVerticalOffset;                           // 0x18(0x4)
	float                                                        MoonMeshDistance;                                  // 0x1c(0x4)
	float                                                        MoonMeshSize;                                      // 0x20(0x4)
	float                                                        SunInfluenceDuration;                              // 0x24(0x4)
	float                                                        SunInfluenceDistance;                              // 0x28(0x4)
	int                                                          NumMoonPhases;                                     // 0x2c(0x4)
	int                                                          DaysInMoonCycle;                                   // 0x30(0x4)
	bool                                                         SunInfluencesRotation;                             // 0x34(0x1)
	bool                                                         SunInfluencesLighting;                             // 0x34(0x1)
	char                                                         pad0x3_J8H9W[0x3];                                 // 0x35(0x3)
};


// Size 0x70
struct QuestTableLimitedInfoTileDetails
{
public:
	char                                                         pad0x20_8RAJE[0x20];                               // 0x0(0x20)
	struct FString                                               StartDateTimeUtc;                                  // 0x20(0x10)
	struct FString                                               EndDateTimeUtc;                                    // 0x30(0x10)
	TArray<String>                                               LinkedStartDatesUtc;                               // 0x40(0x10)
	TArray<String>                                               LinkedEndDatesUtc;                                 // 0x50(0x10)
	TArray<String>                                               LocalisedDateStrings;                              // 0x60(0x10)
};


// Size 0x18
struct AnimatedMechanismActionState
{
public:
	int                                                          AnimationID;                                       // 0x0(0x4)
	char                                                         pad0x4_S5SP8[0x4];                                 // 0x4(0x4)
	double                                                       StartTime;                                         // 0x8(0x8)
	double                                                       EndTime;                                           // 0x10(0x8)
};


// Size 0x8
struct OnPlayerPromotedEvent
{
public:
	class PlayerState*                                           PromotedPlayerState;                               // 0x0(0x8)
};


// Size 0x10
struct WeightedAIBoobyTrapSpawner
{
public:
	class AIBoobyTrapSpawner*                                    Spawner;                                           // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	int                                                          CrewSize;                                          // 0xc(0x4)
};


// Size 0x1
struct EventCompanyPromotionNPCRequest
{
public:
	char                                                         pad0x1_2OI5I[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventSendCapturedKeybind
{
public:
	struct FString                                               CapturedKey;                                       // 0x0(0x10)
};


// Size 0x8
struct EventPlayerCapstanUsageStart
{
public:
	class Actor*                                                 ObjectBeingUsed;                                   // 0x0(0x8)
};


// Size 0x10
struct WieldedItemData
{
public:
	class Actor*                                                 Wieldable;                                         // 0x0(0x8)
	class UClass*                                                ItemCategory;                                      // 0x8(0x8)
};


// Size 0x1
struct VoyageEndTelemetryEvent
{
public:
	char                                                         pad0x1_7M3F7[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct InvalidFireRequestDetected
{
public:
	class Object*                                                RequestingObject;                                  // 0x0(0x8)
	char                                                         pad0x8_YJ2K6[0x8];                                 // 0x8(0x8)
};


// Size 0x50
struct GameEventSchedulerEventStateChangeTelemetryEvent
{
public:
	struct Guid                                                  ConfigId;                                          // 0x0(0x10)
	struct Guid                                                  EventHandleId;                                     // 0x10(0x10)
	struct Guid                                                  CrewId;                                            // 0x20(0x10)
	char                                                         EventType;                                         // 0x30(0x1)
	char                                                         GameEventStatus;                                   // 0x31(0x1)
	char                                                         pad0x6_HQTJK[0x6];                                 // 0x32(0x6)
	struct FString                                               StatusInfo;                                        // 0x38(0x10)
	char                                                         HandleState;                                       // 0x48(0x1)
	char                                                         pad0x3_66S5Z[0x3];                                 // 0x49(0x3)
	float                                                        TimeTillChange;                                    // 0x4c(0x4)
};


// Size 0x1
struct GenericModalContinueConfirmEvent
{
public:
	char                                                         pad0x1_F7RLU[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct LevelLoadRequestedTelemetryEvent
{
public:
	char                                                         pad0x30_XIKQH[0x30];                               // 0x0(0x30)
};


// Size 0x1
struct LastPlayerArrivedInTunnelOfTheDamnedTelemetryEvent
{
public:
	char                                                         pad0x1_LLO57[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct SpawnTransformToPositionMapping
{
public:
	struct Transform                                             SpawnTransform;                                    // 0x0(0x30)
	char                                                         Position;                                          // 0x30(0x1)
	char                                                         pad0xf_6K9TV[0xf];                                 // 0x31(0xf)
};


// Size 0x20
struct CompanyShopSkin
{
public:
	struct StringAssetReference                                  TopBanner;                                         // 0x0(0x10)
	struct StringAssetReference                                  BottomBanner;                                      // 0x10(0x10)
};


// Size 0x50
struct EventPlayerConfigRequestAllConfigsResponse
{
public:
	char                                                         pad0x50_TMQMK[0x50];                               // 0x0(0x50)
};


// Size 0x1
struct ClientPerformanceTelemetryEvent
{
public:
	char                                                         pad0x1_70DHR[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct PlayerPlatformInfoResponse
{
public:
	char                                                         Platform;                                          // 0x0(0x1)
	char                                                         pad0x7_2QJ67[0x7];                                 // 0x1(0x7)
	struct FString                                               PlatformUsername;                                  // 0x8(0x10)
	struct FString                                               PlatformUserId;                                    // 0x18(0x10)
};


// Size 0x1
struct ShipSittingInteractionDisabledSettingChanged
{
public:
	bool                                                         ShipSittingInteractionsDisabled;                   // 0x0(0x1)
};


// Size 0x40
struct CargoRunQuestDescDataCompanyLocationHintEntry
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	struct FText                                                 LocationHint;                                      // 0x8(0x38)
};


// Size 0x30
struct LevelUnloadCompletedTelemetryEvent
{
public:
	char                                                         pad0x30_HNQ8D[0x30];                               // 0x0(0x30)
};


// Size 0x1
struct EventPlayerCharacterPuzzleVaultIncorrect
{
public:
	char                                                         pad0x1_VUB0L[0x1];                                 // 0x0(0x1)
};


// Size 0x80
struct LaunchedFromKrakenActionStateConstructionInfo
{
public:
	char                                                         pad0x68_E9W85[0x68];                               // 0x0(0x68)
	struct NetActorPtr                                           Tentacle;                                          // 0x68(0x14)
	char                                                         pad0x4_16LZE[0x4];                                 // 0x7c(0x4)
};


// Size 0x20
struct PlayerNonVerbalComponentTelemetry
{
public:
	class AthenaPlayerController*                                PlayerController;                                  // 0x0(0x8)
	char                                                         pad0x18_XJOVK[0x18];                               // 0x8(0x18)
};


// Size 0x1
struct VomitFacialAnim
{
public:
	char                                                         pad0x1_75Q5W[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct PuzzleVaultKeyUsedTelemetryEvent
{
public:
	struct Guid                                                  VaultId;                                           // 0x0(0x10)
	struct FName                                                 VaultType;                                         // 0x10(0x8)
	struct FName                                                 VaultKeyUsed;                                      // 0x18(0x8)
};


// Size 0x20
struct PlayerChangedShipLoadoutEvent
{
public:
	struct FString                                               ShipEquippedType;                                  // 0x0(0x10)
	struct FString                                               ShipEquippedName;                                  // 0x10(0x10)
};


// Size 0x8
struct EventReceiveAmmoTransferComponentState
{
public:
	class AmmoTransferComponent*                                 Source;                                            // 0x0(0x8)
};


// Size 0x10
struct EventPlayerSetFootOnIsland
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	char                                                         pad0x8_ON11H[0x8];                                 // 0x8(0x8)
};


// Size 0x40
struct ContestLeaderboardEntry
{
public:
	char                                                         pad0x18_5TWHQ[0x18];                               // 0x0(0x18)
	struct FString                                               CrewIconPath;                                      // 0x18(0x10)
	bool                                                         IsMyCrew;                                          // 0x28(0x1)
	char                                                         pad0x3_2KX0H[0x3];                                 // 0x29(0x3)
	int                                                          Amount;                                            // 0x2c(0x4)
	struct FString                                               DisplayAmount;                                     // 0x30(0x10)
};


// Size 0x28
struct HitRegSnapshotDisagreementTelemetryEntry
{
public:
	int                                                          SubAttackGroupId;                                  // 0x0(0x4)
	char                                                         pad0x4_V6UZQ[0x4];                                 // 0x4(0x4)
	struct FString                                               ServerHitActor;                                    // 0x8(0x10)
	struct FString                                               AttackingClientHitActor;                           // 0x18(0x10)
};


// Size 0x1
struct EventWaitingToSpawnNetRelevantActorsCreated
{
public:
	char                                                         pad0x1_94ODS[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct ExplosionShipSizeDamageParamsOverride
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	struct ShipDamageParams                                      ShipSizeShipDamageParams;                          // 0x8(0x10)
};


// Size 0x30
struct PlayerTalkingSettings
{
public:
	struct LinearColor                                           IconTint;                                          // 0x0(0x10)
	class Texture2D*                                             Icon;                                              // 0x10(0x8)
	float                                                        ScreenEdgePadding;                                 // 0x18(0x4)
	float                                                        Scale;                                             // 0x1c(0x4)
	float                                                        FadeInTimeInSeconds;                               // 0x20(0x4)
	char                                                         pad0xc_GZU1Z[0xc];                                 // 0x24(0xc)
};


// Size 0x1
struct EventMeleeAttackProcessorComplete
{
public:
	char                                                         pad0x1_5DU1J[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct TextboxFocusRequest
{
public:
	bool                                                         ShouldFocusTextbox;                                // 0x0(0x1)
};


// Size 0x38
struct LevelCancelCompletedTelemetryEvent
{
public:
	char                                                         pad0x30_092PW[0x30];                               // 0x0(0x30)
	float                                                        TimeSinceCancelRequested;                          // 0x30(0x4)
	char                                                         pad0x4_WAYIE[0x4];                                 // 0x34(0x4)
};


// Size 0x1
struct NetPerformanceMonitorHeartbeat
{
public:
	char                                                         pad0x1_507PV[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct QueryServerMemoryRpc
{
public:
	char                                                         pad0x18_7UO0P[0x18];                               // 0x0(0x18)
	class AthenaPlayerController*                                AthenaPlayerController;                            // 0x18(0x8)
};


// Size 0x1
struct HauntedFortTargetDestroyed
{
public:
	char                                                         pad0x1_IXLZK[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct MaterialAnimatorAnimationEntry
{
public:
	struct FName                                                 AnimationName;                                     // 0x0(0x8)
	struct FName                                                 NextAnimationName;                                 // 0x8(0x8)
	class CurveFloat*                                            AnimationCurve;                                    // 0x10(0x8)
};


// Size 0x18
struct ProjectileWeaponFireInaccuracySeedMismatchTelemetryEvent
{
public:
	struct Guid                                                  TelemetryAttackId;                                 // 0x0(0x10)
	int                                                          ClientSeed;                                        // 0x10(0x4)
	int                                                          ServerSeed;                                        // 0x14(0x4)
};


// Size 0x1
struct QueryConfirmInviteRequest
{
public:
	char                                                         pad0x1_QSCMR[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct MultipleNPCCompaniesRedirectionData
{
public:
	TArray<class Class*>                                         Companies;                                         // 0x0(0x10)
	struct FText                                                 VisitNPCTooltip;                                   // 0x10(0x38)
};


// Size 0x18
struct LargeSessionEncounterDevTelemetryEvent
{
public:
	struct FString                                               EncounteredUserId;                                 // 0x0(0x10)
	bool                                                         TaskSucceeded;                                     // 0x10(0x1)
	char                                                         pad0x7_LPUL5[0x7];                                 // 0x11(0x7)
};


// Size 0x20
struct UseItemOnServerRpc
{
public:
	char                                                         pad0x18_HG3EK[0x18];                               // 0x0(0x18)
	class WieldableItem*                                         Item;                                              // 0x18(0x8)
};


// Size 0x20
struct EntitlementsRequestEvent
{
public:
	TArray<String>                                               EntitlementIds;                                    // 0x0(0x10)
	struct FString                                               Id;                                                // 0x10(0x10)
};


// Size 0x8
struct EventPlayerStoppedSwimming
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x68
struct UseBalanceableWalkwayActionStateConstructionInfo
{
public:
	char                                                         pad0x60_W48CZ[0x60];                               // 0x0(0x60)
	class BalanceableWalkwayComponent*                           WalkwayComponent;                                  // 0x60(0x8)
};


// Size 0x18
struct SeasonTierInfo
{
public:
	int                                                          Number;                                            // 0x0(0x4)
	char                                                         pad0x4_XTKAR[0x4];                                 // 0x4(0x4)
	struct FString                                               LocalizedTitle;                                    // 0x8(0x10)
};


// Size 0x1
struct EventAnimationWieldedItemContinuousUseStateEntered
{
public:
	char                                                         pad0x1_G3H7D[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct PirateProfilesRenameProfileToGame
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
	struct FString                                               NewName;                                           // 0x10(0x10)
};


// Size 0x8
struct SetPresenceConnectionStringResponseModel
{
public:
	struct Timespan                                              ResetAfter;                                        // 0x0(0x8)
};


// Size 0x90
struct PetShopPetBreed
{
public:
	struct FText                                                 Title;                                             // 0x0(0x38)
	struct StringAssetReference                                  Icon;                                              // 0x38(0x10)
	struct FText                                                 Description;                                       // 0x48(0x38)
	TArray<class Class*>                                         Categories;                                        // 0x80(0x10)
};


// Size 0x20
struct QuestTableInfoTileDetails
{
public:
	struct FString                                               TileId;                                            // 0x0(0x10)
	struct FString                                               InfoTipId;                                         // 0x10(0x10)
};


// Size 0x8
struct EventShipStoppedBurning
{
public:
	char                                                         pad0x8_47NHY[0x8];                                 // 0x0(0x8)
};


// Size 0x60
struct AIKnockbackActionStateConstructionInfo
{
public:
	char                                                         pad0x48_NQ0N6[0x48];                               // 0x0(0x48)
	struct Vector                                                KnockbackDirection;                                // 0x48(0xc)
	float                                                        KnockbackSpeed;                                    // 0x54(0x4)
	float                                                        KnockbackAccel;                                    // 0x58(0x4)
	char                                                         KnockbackStrengthType;                             // 0x5c(0x1)
	char                                                         pad0x3_UO5WF[0x3];                                 // 0x5d(0x3)
};


// Size 0x8
struct PlayerStartedDiggingEvent
{
public:
	class Actor*                                                 ActorBeingDugUp;                                   // 0x0(0x8)
};


// Size 0x14
struct LinearTransitionLadderActionStateParams
{
public:
	char                                                         pad0x10_316OS[0x10];                               // 0x0(0x10)
	float                                                        Duration;                                          // 0x10(0x4)
};


// Size 0x8
struct EventReceiveWeepingComponentState
{
public:
	class WeepingComponent*                                      Source;                                            // 0x0(0x8)
};


// Size 0x1
struct BootFlowStartHandleErrorStateEvent
{
public:
	char                                                         pad0x1_37ASI[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventAllIslandsLoaded
{
public:
	char                                                         pad0x1_YZ5UI[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct SpawningCommandSpawnKrakenEvent
{
public:
	TArray<class PlayerState*>                                   TargetActors;                                      // 0x0(0x10)
};


// Size 0x60
struct RemoveWorldEventGameServerRequestModel
{
public:
	struct FString                                               EventType;                                         // 0x0(0x10)
	char                                                         pad0x50_MAGJV[0x50];                               // 0x10(0x50)
};


// Size 0x10
struct BlockDecalMaterials
{
public:
	TArray<class MaterialInterface*>                             BlockMaterials;                                    // 0x0(0x10)
};


// Size 0x10
struct ClientPirateDeleteTelemetryEvent
{
public:
	struct FString                                               PirateId;                                          // 0x0(0x10)
};


// Size 0x20
struct PurchaseRequestSuccessResponse
{
public:
	struct Guid                                                  TransactionId;                                     // 0x0(0x10)
	TArray<String>                                               PurchasedItems;                                    // 0x10(0x10)
};


// Size 0x30
struct MessageInABottleGivenVoyageTelemetryEvent
{
public:
	struct Guid                                                  BottleId;                                          // 0x0(0x10)
	struct Guid                                                  VoyageID;                                          // 0x10(0x10)
	struct FString                                               EmergentVoyageSource;                              // 0x20(0x10)
};


// Size 0x8
struct EventShipBecameUseless
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
};


// Size 0x8
struct RugsPartDesc
{
public:
	class MaterialInterface*                                     RugsMaterial;                                      // 0x0(0x8)
};


// Size 0x78
struct CycleFlameOfFateParams
{
public:
	bool                                                         IncludeCycleFlameOfFateOneShotResponse;            // 0x0(0x1)
	char                                                         pad0x7_8RYE3[0x7];                                 // 0x1(0x7)
	class UClass*                                                OneShotResponseNotificationInputId;                // 0x8(0x8)
	bool                                                         IncludeCycleFlameOfFateActionRule;                 // 0x10(0x1)
	char                                                         pad0x7_D84SG[0x7];                                 // 0x11(0x7)
	class UClass*                                                ActionRuleNotificationInputId;                     // 0x18(0x8)
	char                                                         ActionRulePriority;                                // 0x20(0x1)
	char                                                         pad0x7_LI3D9[0x7];                                 // 0x21(0x7)
	struct FText                                                 CycleFlameOfFateActionRuleVerbiage;                // 0x28(0x38)
	struct CycleFlameOfFateSequence                              FlameOfFateSequence;                               // 0x60(0x18)
};


// Size 0x18
struct FeatureToggledLevels
{
public:
	struct FName                                                 Feature;                                           // 0x0(0x8)
	TArray<struct StringAssetReference>                          Levels;                                            // 0x8(0x10)
};


// Size 0x18
struct RevealRequirementContext
{
public:
	class Object*                                                Revealable;                                        // 0x0(0x8)
	class Object*                                                Revealer;                                          // 0x8(0x8)
	class Object*                                                WorldContextObject;                                // 0x10(0x8)
};


// Size 0x20
struct ServerAsyncLoadingCompleteAckNetworkEvent
{
public:
	char                                                         pad0x18_6ZM9Y[0x18];                               // 0x0(0x18)
	char                                                         Reason;                                            // 0x18(0x1)
	char                                                         pad0x7_OK5CF[0x7];                                 // 0x19(0x7)
};


// Size 0x18
struct RatManagerPseudoRandomEntry
{
public:
	double                                                       TimeBoundary;                                      // 0x0(0x8)
	float                                                        RatSpeed;                                          // 0x8(0x4)
	float                                                        RatScale;                                          // 0xc(0x4)
	struct FName                                                 LocationName;                                      // 0x10(0x8)
};


// Size 0x118
struct Entitlements
{
public:
	char                                                         pad0x8_Z6L0D[0x8];                                 // 0x0(0x8)
	TArray<class Class*>                                         PreCachedEntitlementTypes;                         // 0x8(0x10)
	TArray<class Class*>                                         OrderedEntitlements;                               // 0x18(0x10)
	char                                                         pad0xf0_4F1OU[0xf0];                               // 0x28(0xf0)
};


// Size 0x1
struct VoyageCompleteTelemetryEvent
{
public:
	char                                                         pad0x1_5S0CP[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct PlayerItemUsageEndTelemetryEvent
{
public:
	char                                                         pad0x1_WXUQQ[0x1];                                 // 0x0(0x1)
};


// Size 0x58
struct EndedHangingTelemetry
{
public:
	double                                                       TimeSpentHangingFromPoint;                         // 0x0(0x8)
	float                                                        DistanceTravelledWhileHanging;                     // 0x8(0x4)
	char                                                         pad0x4_XE9EJ[0x4];                                 // 0xc(0x4)
	struct FString                                               HangingComponentOwner;                             // 0x10(0x10)
	struct FString                                               HangingComponentName;                              // 0x20(0x10)
	bool                                                         IsPlayerOnOwnShip;                                 // 0x30(0x1)
	char                                                         pad0x3_B0XS5[0x3];                                 // 0x31(0x3)
	struct Guid                                                  ShipId;                                            // 0x34(0x10)
	struct Guid                                                  HangingId;                                         // 0x44(0x10)
	char                                                         pad0x4_GTXSH[0x4];                                 // 0x54(0x4)
};


// Size 0x1
struct EventSummonMegalodon
{
public:
	char                                                         SoulType;                                          // 0x0(0x1)
};


// Size 0x50
struct PromptCountersModel
{
public:
	char                                                         pad0x50_83SUD[0x50];                               // 0x0(0x50)
};


// Size 0x1
struct EventOnExitFarSight
{
public:
	char                                                         pad0x1_YUQYG[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventSequencerCutSceneStarted
{
public:
	char                                                         pad0x1_6IJDM[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct RequestPetChestPreviewUpdateEvent
{
public:
	char                                                         Action;                                            // 0x0(0x1)
	char                                                         pad0x7_QEW39[0x7];                                 // 0x1(0x7)
	struct FString                                               Subject;                                           // 0x8(0x10)
};


// Size 0x2
struct SeaFortAlignmentChangedEvent
{
public:
	char                                                         pad0x2_HU9JG[0x2];                                 // 0x0(0x2)
};


// Size 0x48
struct BlockedInputActionStateConstructionInfo
{
public:
	char                                                         pad0x48_YS3EZ[0x48];                               // 0x0(0x48)
};


// Size 0x8
struct AggressiveGhostShipState
{
public:
	bool                                                         IsShipVisible;                                     // 0x0(0x1)
	bool                                                         IsShipDead;                                        // 0x1(0x1)
	char                                                         pad0x2_SYAP2[0x2];                                 // 0x2(0x2)
	float                                                        ShipSpeed;                                         // 0x4(0x4)
};


// Size 0x10
struct EventSpawnComponentRequest
{
public:
	class SalvageItemSpawnComponent*                             SalvageItemSpawnComponent;                         // 0x0(0x8)
	int                                                          NumberOfLocationsRequested;                        // 0x8(0x4)
	char                                                         pad0x4_LMB7C[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct GetGuildOverviewsForInvitesRequestModel
{
public:
	TArray<struct Guid>                                          GuildIds;                                          // 0x0(0x10)
};


// Size 0x10
struct RewardGroup
{
public:
	TArray<class Class*>                                         Rewards;                                           // 0x0(0x10)
};


// Size 0x18
struct AchievementSailCloseToShipWithoutFiring
{
public:
	float                                                        RangeToRemainWithinInMetres;                       // 0x0(0x4)
	float                                                        DistanceToTravelInMetres;                          // 0x4(0x4)
	char                                                         pad0x10_RSQ10[0x10];                               // 0x8(0x10)
};


// Size 0x8
struct ClothingChestUnequipClothingEvent
{
public:
	class UClass*                                                Desc;                                              // 0x0(0x8)
};


// Size 0x4
struct QuestTableLikedVoyages
{
public:
	int                                                          Capacity;                                          // 0x0(0x4)
};


// Size 0x10
struct ClueSiteTypeToMarkId
{
public:
	class UClass*                                                ClueSiteType;                                      // 0x0(0x8)
	class UClass*                                                MapMarkId;                                         // 0x8(0x8)
};


// Size 0x1
struct PetShopErrorEvent
{
public:
	char                                                         pad0x1_1JC4G[0x1];                                 // 0x0(0x1)
};


// Size 0x50
struct CombinationLockMechanismTriggerActionStateConstructionInfo
{
public:
	char                                                         pad0x48_0YZMN[0x48];                               // 0x0(0x48)
	class SceneComponent*                                        SceneComponent;                                    // 0x48(0x8)
};


// Size 0x48
struct AthenaAnimationObjectActionOneShot
{
public:
	TArray<class AnimSequence*>                                  MainAction;                                        // 0x0(0x10)
	TArray<class BlendSpace*>                                    MainActionLocomotion;                              // 0x10(0x10)
	TArray<class AnimSequence*>                                  AlternateAction;                                   // 0x20(0x10)
	TArray<class BlendSpace*>                                    AlternateActionLocomotion;                         // 0x30(0x10)
	bool                                                         IgnoreOverlayHandAdditiveForAction;                // 0x40(0x1)
	char                                                         pad0x7_QTHF5[0x7];                                 // 0x41(0x7)
};


// Size 0x1
struct EventCurseSleep
{
public:
	char                                                         pad0x1_WEGSV[0x1];                                 // 0x0(0x1)
};


// Size 0x14
struct CrewAllianceJoinStatus
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	char                                                         AllianceJoinStatus;                                // 0x10(0x1)
	char                                                         LastAllianceJoinStatus;                            // 0x11(0x1)
	char                                                         pad0x2_RFR88[0x2];                                 // 0x12(0x2)
};


// Size 0x28
struct EmoteDataEntryFrontend
{
public:
	struct FName                                                 EmoteIdent;                                        // 0x0(0x8)
	char                                                         pad0x20_XB4I4[0x20];                               // 0x8(0x20)
};


// Size 0x20
struct GuildInvitesSentResponseEvent
{
public:
	struct FString                                               GuildId;                                           // 0x0(0x10)
	TArray<String>                                               XUIDs;                                             // 0x10(0x10)
};


// Size 0x10
struct PirateProfiles_RequestUpdatePreviewEvent
{
public:
	struct FString                                               PirateProfileId;                                   // 0x0(0x10)
};


// Size 0x18
struct ResettableSettingsGroup
{
public:
	struct FName                                                 SettingsGroupName;                                 // 0x0(0x8)
	TArray<struct Name>                                          SettingsNames;                                     // 0x8(0x10)
};


// Size 0x2
struct OnRepIsSoloSeas
{
public:
	bool                                                         IsSet;                                             // 0x0(0x1)
	bool                                                         IsSoloSeasServer;                                  // 0x1(0x1)
};


// Size 0x44
struct PlayerBuriedItemsMapAddedToStoreTelemetryEvent
{
public:
	struct Guid                                                  MapBundleId;                                       // 0x0(0x10)
	struct Guid                                                  OwningCrewID;                                      // 0x10(0x10)
	struct Guid                                                  OwningCrewSessionId;                               // 0x20(0x10)
	struct Guid                                                  MapID;                                             // 0x30(0x10)
	char                                                         pad0x4_UOQYB[0x4];                                 // 0x40(0x4)
};


// Size 0x10
struct ImpactSurfaceData
{
public:
	char                                                         SurfaceType;                                       // 0x0(0x1)
	char                                                         pad0x7_W7GYP[0x7];                                 // 0x1(0x7)
	class ImpactDataAsset*                                       ImpactData;                                        // 0x8(0x8)
};


// Size 0x38
struct AthenaAnimationTalking
{
public:
	bool                                                         Talking;                                           // 0x0(0x1)
	char                                                         pad0x3_F2MMO[0x3];                                 // 0x1(0x3)
	char                                                         pad0x34_23JZA[0x34];                               // 0x4(0x34)
};


// Size 0x10
struct CurrentKeyDescInfo
{
public:
	class UClass*                                                VaultKeyDesc;                                      // 0x0(0x8)
	int                                                          CrewSize;                                          // 0x8(0x4)
	char                                                         pad0x4_VZNXR[0x4];                                 // 0xc(0x4)
};


// Size 0x38
struct TeleportStageCompletedTelemetryEvent
{
public:
	struct Guid                                                  Id;                                                // 0x0(0x10)
	float                                                        Duration;                                          // 0x10(0x4)
	char                                                         pad0x4_O53S0[0x4];                                 // 0x14(0x4)
	struct FString                                               Reason;                                            // 0x18(0x10)
	struct FString                                               CompletedStage;                                    // 0x28(0x10)
};


// Size 0x20
struct PlayerPositionTelemetryFragment
{
public:
	struct Vector                                                Position;                                          // 0x0(0xc)
	char                                                         pad0x4_RT24X[0x4];                                 // 0xc(0x4)
	struct FString                                               WorldLocationName;                                 // 0x10(0x10)
};


// Size 0x8
struct EventShipSpawnLocationCreated
{
public:
	class ShipSpawnLocation*                                     SpawnLocation;                                     // 0x0(0x8)
};


// Size 0x8
struct ChestOfRageDamageTableEntry
{
public:
	char                                                         Reason;                                            // 0x0(0x1)
	char                                                         pad0x3_L954N[0x3];                                 // 0x1(0x3)
	float                                                        TimeToAdd;                                         // 0x4(0x4)
};


// Size 0x30
struct BuoyantObjectWeightedGroup
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	char                                                         pad0x4_WSHWL[0x4];                                 // 0x4(0x4)
	struct WeightedProbabilityRange                              NumberOfItems;                                     // 0x8(0x20)
	class ItemSpawnDistributionAsset*                            Items;                                             // 0x28(0x8)
};


// Size 0x208
struct NetworkPerformanceMonitorPayload
{
public:
	char                                                         pad0x208_YTLP6[0x208];                             // 0x0(0x208)
};


// Size 0x30
struct KrakenAnimatedTentacleWaterTriggerableFX
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	float                                                        WaterHeightOffset;                                 // 0x8(0x4)
	char                                                         pad0x4_VS31M[0x4];                                 // 0xc(0x4)
	class Object*                                                FirstPersonTargetVFX;                              // 0x10(0x8)
	class Object*                                                ThirdPersonTargetVFX;                              // 0x18(0x8)
	class Object*                                                AboveWaterVFX;                                     // 0x20(0x8)
	class Object*                                                BelowWaterVFX;                                     // 0x28(0x8)
};


// Size 0x20
struct MountedWeaponFireRejectionRpc
{
public:
	char                                                         pad0x18_7NKPF[0x18];                               // 0x0(0x18)
	class Object*                                                MountedWeaponObject;                               // 0x18(0x8)
};


// Size 0x8
struct EventPlayerEnteredSinkingTunnelActionState
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
	int                                                          Entry;                                             // 0x4(0x4)
};


// Size 0x28
struct FrontendCrewMember
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
	struct FString                                               Gamertag;                                          // 0x10(0x10)
	bool                                                         CurrentPlayer;                                     // 0x20(0x1)
	bool                                                         Captain;                                           // 0x21(0x1)
	bool                                                         ReservedForPlayerThatDroppedConnection;            // 0x22(0x1)
	char                                                         Platform;                                          // 0x23(0x1)
	char                                                         pad0x4_QIOTK[0x4];                                 // 0x24(0x4)
};


// Size 0x28
struct ResponseEventSchedulerStatusNetworkEvent
{
public:
	char                                                         pad0x18_CKP30[0x18];                               // 0x0(0x18)
	TArray<String>                                               EventStatus;                                       // 0x18(0x10)
};


// Size 0x10
struct FrontendMessageEvent
{
public:
	struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x4
struct MermaidSuppressionTelemetryEvent
{
public:
	float                                                        SuppressionDuration;                               // 0x0(0x4)
};


// Size 0x8
struct ServerStartingForcedShutdownEvent
{
public:
	struct Timespan                                              TimeTillShutdown;                                  // 0x0(0x8)
};


// Size 0x20
struct SeaOfThievesOnDemandTreasurePopupConversionPair
{
public:
	struct StringAssetReference                                  From;                                              // 0x0(0x10)
	struct StringAssetReference                                  To;                                                // 0x10(0x10)
};


// Size 0x30
struct ProjectileServiceUpdateRewindFailedEvent
{
public:
	TArray<struct Guid>                                          AffectedProjectilesTelemetryAttackIds;             // 0x0(0x10)
	struct FString                                               DamagerType;                                       // 0x10(0x10)
	float                                                        AttackGroupStartTime;                              // 0x20(0x4)
	float                                                        AttackGroupEndTime;                                // 0x24(0x4)
	int                                                          Count;                                             // 0x28(0x4)
	char                                                         pad0x4_J0AF5[0x4];                                 // 0x2c(0x4)
};


// Size 0x18
struct ConditionContextPayloadWieldedItemInfoSelector
{
public:
	char                                                         pad0x18_MS0GN[0x18];                               // 0x0(0x18)
};


// Size 0x1
struct TributeUICardFlipped
{
public:
	char                                                         pad0x1_WT171[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct AthenaAnimationObjectActionOneShotPlayingStructPitchOverride
{
public:
	class BlendSpace1D*                                          Action;                                            // 0x0(0x8)
	class BlendSpace1D*                                          ActionVariant1;                                    // 0x8(0x8)
	class BlendSpace1D*                                          ActionVariant2;                                    // 0x10(0x8)
	class BlendSpace1D*                                          ActionVariant3;                                    // 0x18(0x8)
	class BlendSpace1D*                                          ActionVariant4;                                    // 0x20(0x8)
};


// Size 0x18
struct LoadableProjectileData
{
public:
	struct StringAssetReference                                  DataAsset;                                         // 0x0(0x10)
	int                                                          GeneratedDataRNGSeed;                              // 0x10(0x4)
	bool                                                         ShouldProjectileTrailDoReflections;                // 0x14(0x1)
	char                                                         pad0x3_LPO72[0x3];                                 // 0x15(0x3)
};


// Size 0x28
struct RetrieveAllPiratesRequestFailedEvent
{
public:
	struct UniqueNetIdRepl                                       UserId;                                            // 0x0(0x18)
	struct Guid                                                  RequestID;                                         // 0x18(0x10)
};


// Size 0x10
struct ClientChatModerationConfigUpdateRequestFailedEvent
{
public:
	struct FString                                               FailureReason;                                     // 0x0(0x10)
};


// Size 0x1
struct EventToggleNonCrewVoiceMuteState
{
public:
	char                                                         pad0x1_HYHK7[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct StopNpcAnimationNetworkEvent
{
public:
	char                                                         pad0x18_SXV6F[0x18];                               // 0x0(0x18)
	class Actor*                                                 TargetActor;                                       // 0x18(0x8)
	class PlaceableReaction*                                     PlaceableReaction;                                 // 0x20(0x8)
};


// Size 0x38
struct ShipPartChangedEvent
{
public:
	char                                                         pad0x18_V5VCK[0x18];                               // 0x0(0x18)
	struct FString                                               PartId;                                            // 0x18(0x10)
	struct FString                                               EntitlementId;                                     // 0x28(0x10)
};


// Size 0xc
struct RewardIdCount
{
public:
	struct FName                                                 RewardId;                                          // 0x0(0x8)
	int                                                          Count;                                             // 0x8(0x4)
};


// Size 0x20
struct GuildEnrolledShipModel
{
public:
	struct Guid                                                  GuildId;                                           // 0x0(0x10)
	struct Guid                                                  ShipId;                                            // 0x10(0x10)
};


// Size 0x18
struct SeagullManagerLocationBank
{
public:
	TArray<struct Name>                                          Locations;                                         // 0x0(0x10)
	class ShipCreatureManagerCreatureInstanceMotionModifierDataAsset* MotionModifierDataAsset;                           // 0x10(0x8)
};


// Size 0x60
struct DeferredRewardRequestMessage
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
	struct FName                                                 CompanyAffiliation;                                // 0x10(0x8)
	struct FName                                                 RewardId;                                          // 0x18(0x8)
	struct FString                                               UserId;                                            // 0x20(0x10)
	struct FString                                               PirateId;                                          // 0x30(0x10)
	bool                                                         RewardAccount;                                     // 0x40(0x1)
	bool                                                         NotifyPlayer;                                      // 0x41(0x1)
	bool                                                         DontRewardCurrency;                                // 0x42(0x1)
	bool                                                         DontRewardXp;                                      // 0x43(0x1)
	bool                                                         DontRewardSeasonXp;                                // 0x44(0x1)
	char                                                         pad0x3_BATSN[0x3];                                 // 0x45(0x3)
	struct FString                                               DeferralReason;                                    // 0x48(0x10)
	double                                                       RewardMultiplier;                                  // 0x58(0x8)
};


// Size 0x8
struct TaleResourceHandle
{
public:
	int                                                          ResourceHandle;                                    // 0x0(0x4)
	int                                                          ValidationId;                                      // 0x4(0x4)
};


// Size 0x10
struct FeatureToggledIsland
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	struct FName                                                 IslandName;                                        // 0x8(0x8)
};


// Size 0x1
struct EventPickupableObjectDropped
{
public:
	char                                                         SurfaceType;                                       // 0x0(0x1)
};


// Size 0x8
struct PlayerMapsRegisteredEvent
{
public:
	class Actor*                                                 Map;                                               // 0x0(0x8)
};


// Size 0x1
struct EventFishingFishEscaping
{
public:
	char                                                         pad0x1_W8UJV[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct FriendsListError
{
public:
	struct FString                                               Error;                                             // 0x0(0x10)
};


// Size 0x10
struct UIAudioCueEvent
{
public:
	struct FString                                               CueKey;                                            // 0x0(0x10)
};


// Size 0x10
struct EventBroadcastWwiseEventToInstigatorsCrew
{
public:
	class Actor*                                                 Instigator;                                        // 0x0(0x8)
	class WwiseEvent*                                            WwiseEvent;                                        // 0x8(0x8)
};


// Size 0x38
struct ReactionVOEntry
{
public:
	struct FName                                                 VOGroupName;                                       // 0x0(0x8)
	struct WeightedProbabilityRangeOfRanges                      VOCooldown;                                        // 0x8(0x30)
};


// Size 0x1
struct PirateRerollEvent_RequestReroll
{
public:
	char                                                         pad0x1_29BR0[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct AthenaAnimationActiveItemComplexAnimData
{
public:
	class AnimSequence*                                          WarmUp;                                            // 0x0(0x8)
	class AnimSequence*                                          HeavyWarmUp;                                       // 0x8(0x8)
	class AnimSequence*                                          Action;                                            // 0x10(0x8)
	class AnimSequence*                                          Recover;                                           // 0x18(0x8)
	class AnimSequence*                                          HeavyAttackStunRecover;                            // 0x20(0x8)
	char                                                         AnimType;                                          // 0x28(0x1)
	char                                                         pad0x3_ZVR90[0x3];                                 // 0x29(0x3)
	float                                                        WarmUpPlaySpeed;                                   // 0x2c(0x4)
	bool                                                         IsHeavyAttackActive;                               // 0x30(0x1)
	char                                                         pad0x7_156CK[0x7];                                 // 0x31(0x7)
};


// Size 0x20
struct UserPresenceRequestEvent
{
public:
	TArray<String>                                               XUIDs;                                             // 0x0(0x10)
	struct FString                                               Id;                                                // 0x10(0x10)
};


// Size 0x10
struct EventAISenseAnimationChange
{
public:
	char                                                         ActiveSenseState;                                  // 0x0(0x1)
	char                                                         pad0x7_XP4UP[0x7];                                 // 0x1(0x7)
	class AthenaCharacter*                                       Owner;                                             // 0x8(0x8)
};


// Size 0x10
struct EventCompanyRankProgressUpdateNotification
{
public:
	struct FName                                                 Company;                                           // 0x0(0x8)
	char                                                         pad0x8_CVAT4[0x8];                                 // 0x8(0x8)
};


// Size 0x10
struct PirateProfiles_SelectPirateEvent
{
public:
	struct FString                                               Id;                                                // 0x0(0x10)
};


// Size 0x10
struct LandmarkReactionKeyFrame
{
public:
	class LandmarkReactionEvent*                                 Event;                                             // 0x0(0x8)
	float                                                        KeyFrame;                                          // 0x8(0x4)
	char                                                         pad0x4_XPW96[0x4];                                 // 0xc(0x4)
};


// Size 0x40
struct SpawningCommandSpawnSkeletonShip
{
public:
	char                                                         pad0x20_JRUC9[0x20];                               // 0x0(0x20)
	TArray<class PlayerState*>                                   TargetActors;                                      // 0x20(0x10)
	class UClass*                                                ShipSize;                                          // 0x30(0x8)
	bool                                                         IsAggressive;                                      // 0x38(0x1)
	char                                                         pad0x7_3I0VG[0x7];                                 // 0x39(0x7)
};


// Size 0x1
struct RequestWaterloggedShipRecoverEvent
{
public:
	char                                                         pad0x1_D8R1H[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct ConstellationAudioPair
{
public:
	class UClass*                                                ConstellationClass;                                // 0x0(0x8)
	class WwiseEvent*                                            AudioStartEvent;                                   // 0x8(0x8)
	class WwiseEvent*                                            AudioStopEvent;                                    // 0x10(0x8)
};


// Size 0x8
struct EventPlayerControllerPossessed
{
public:
	class PlayerController*                                      PlayerController;                                  // 0x0(0x8)
};


// Size 0x1
struct AlwaysSkipMapTableAnimationChangeEvent
{
public:
	bool                                                         AlwaysSkipMapTableAnimation;                       // 0x0(0x1)
};


// Size 0x20
struct OnlinePermissionsResponseData
{
public:
	struct UniqueNetIdRepl                                       PlayerUserId;                                      // 0x0(0x18)
	bool                                                         HasPermission;                                     // 0x18(0x1)
	char                                                         pad0x7_QR8IZ[0x7];                                 // 0x19(0x7)
};


// Size 0x18
struct ReapersTributeShipCrewOwnershipChanged
{
public:
	class Actor*                                                 ReapersTributeShipActor;                           // 0x0(0x8)
	struct Guid                                                  ControllingCrewId;                                 // 0x8(0x10)
};


// Size 0x28
struct SyncLoadPackageTelemetryEvent
{
public:
	struct FString                                               ObjectName;                                        // 0x0(0x10)
	struct FString                                               PackageName;                                       // 0x10(0x10)
	double                                                       DurationSeconds;                                   // 0x20(0x8)
};


// Size 0x1
struct BootFlowStartEngageStateEvent
{
public:
	char                                                         pad0x1_4ZWZ5[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventMovedByPortableHarpoonRetractionEnd
{
public:
	class Actor*                                                 MovedActor;                                        // 0x0(0x8)
	class Actor*                                                 MovementInstigator;                                // 0x8(0x8)
};


// Size 0x14
struct ContestParticipantData
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	int                                                          NumberOfCrewMembers;                               // 0x10(0x4)
};


// Size 0x4
struct SinkShipGameServerRequestModel
{
public:
	int                                                          ShipNetGUID;                                       // 0x0(0x4)
};


// Size 0x8
struct BuoyancyComponentExclusionParams
{
public:
	float                                                        MaxDistanceCheck;                                  // 0x0(0x4)
	char                                                         HitsChannel;                                       // 0x4(0x1)
	char                                                         pad0x3_CNPJJ[0x3];                                 // 0x5(0x3)
};


// Size 0x18
struct ExplosionShipSizeKnockbackModifier
{
public:
	struct FName                                                 FeatureFlag;                                       // 0x0(0x8)
	class UClass*                                                ShipSize;                                          // 0x8(0x8)
	float                                                        HorizontalVelocity;                                // 0x10(0x4)
	float                                                        VerticalVelocity;                                  // 0x14(0x4)
};


// Size 0x1
struct EventPlayerControllerHitNotificationOld
{
public:
	bool                                                         PlaySfx;                                           // 0x0(0x1)
};


// Size 0x8
struct LightingZoneDistances
{
public:
	char                                                         pad0x8_9YYGY[0x8];                                 // 0x0(0x8)
};


// Size 0x20
struct WheelAdditiveProperties
{
public:
	float                                                        RightHandOnHandleAMin;                             // 0x0(0x4)
	float                                                        RightHandOnHandleAMax;                             // 0x4(0x4)
	float                                                        RightHandOnHandleBMin;                             // 0x8(0x4)
	float                                                        RightHandOnHandleBMax;                             // 0xc(0x4)
	float                                                        LeftHandOnHandleAMin;                              // 0x10(0x4)
	float                                                        LeftHandOnHandleAMax;                              // 0x14(0x4)
	float                                                        LeftHandOnHandleBMin;                              // 0x18(0x4)
	float                                                        LeftHandOnHandleBMax;                              // 0x1c(0x4)
};


// Size 0x8
struct ChestLeaveWatercraftEvent
{
public:
	class Actor*                                                 CurrentWatercraft;                                 // 0x0(0x8)
};


// Size 0x10
struct ServerMigrateFromTelemetryEvent
{
public:
	struct Guid                                                  MigrationId;                                       // 0x0(0x10)
};


// Size 0x10
struct TrackedActorTelemetryFragmentInput
{
public:
	char                                                         pad0x10_86J8T[0x10];                               // 0x0(0x10)
};


// Size 0x20
struct LightingControllerTimeParams
{
public:
	class CurveFloat*                                            TimeScalerCurve;                                   // 0x0(0x8)
	float                                                        SunRiseTime;                                       // 0x8(0x4)
	float                                                        SunSetTime;                                        // 0xc(0x4)
	float                                                        InitialTimeOfDay;                                  // 0x10(0x4)
	float                                                        ReflectionCaptureTimeOfDay;                        // 0x14(0x4)
	int                                                          InitialDay;                                        // 0x18(0x4)
	float                                                        TutorialTimeOfDay;                                 // 0x1c(0x4)
};


// Size 0x60
struct ModalInteractionActionStateConstructionInfo
{
public:
	char                                                         pad0x48_UYOU7[0x48];                               // 0x0(0x48)
	struct NetActorPtr                                           InteractionProxy;                                  // 0x48(0x14)
	char                                                         pad0x4_ERMAB[0x4];                                 // 0x5c(0x4)
};


// Size 0x40
struct CutscenePool
{
public:
	struct FName                                                 CutsceneName;                                      // 0x0(0x8)
	int                                                          Priority;                                          // 0x8(0x4)
	int                                                          ActivationChance;                                  // 0xc(0x4)
	bool                                                         ShouldQueue;                                       // 0x10(0x1)
	char                                                         pad0x3_BZBTQ[0x3];                                 // 0x11(0x3)
	float                                                        AdditionalPoolCooldown;                            // 0x14(0x4)
	class CutscenePoolType*                                      PoolType;                                          // 0x18(0x8)
	TArray<class SceneDialogueData*>                             DialogueData;                                      // 0x20(0x10)
	TArray<float>                                                CutsceneLengths;                                   // 0x30(0x10)
};


// Size 0x14
struct CrewCompletedEmergentVoyageEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x10(0x1)
	char                                                         pad0x3_T9ZBB[0x3];                                 // 0x11(0x3)
};


// Size 0x10
struct RequestArmoryItemLoadoutEvent
{
public:
	TArray<String>                                               Categories;                                        // 0x0(0x10)
};


// Size 0x18
struct CrewMutePlayerChatEvent
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
	bool                                                         IsMuted;                                           // 0x10(0x1)
	char                                                         pad0x7_RWF5W[0x7];                                 // 0x11(0x7)
};


// Size 0x38
struct ContestCrewManagementMemberData
{
public:
	struct FString                                               Xuid;                                              // 0x0(0x10)
	struct FString                                               Gamertag;                                          // 0x10(0x10)
	char                                                         Muted;                                             // 0x20(0x1)
	char                                                         pad0x7_FWXAB[0x7];                                 // 0x21(0x7)
	struct FString                                               CrewIcon;                                          // 0x28(0x10)
};


// Size 0x20
struct ProjectileWeaponQuickSwitchTimingTelemetryEvent
{
public:
	struct FString                                               QuickSwitchType;                                   // 0x0(0x10)
	float                                                        OtherWeaponFireTimestamp;                          // 0x10(0x4)
	float                                                        WorldTimeSeconds;                                  // 0x14(0x4)
	float                                                        MaxTimeDiffAllowed;                                // 0x18(0x4)
	bool                                                         HasCancelledEquipAnim;                             // 0x1c(0x1)
	char                                                         pad0x3_TQ6DR[0x3];                                 // 0x1d(0x3)
};


// Size 0x20
struct SkullOfStormsFireDousedTelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	struct Guid                                                  ShipCrewId;                                        // 0x10(0x10)
};


// Size 0x24
struct FogBankStoryRelatedSettings
{
public:
	struct StoryFlag                                             Story;                                             // 0x0(0x8)
	float                                                        Density;                                           // 0x8(0x4)
	struct LinearColor                                           FogColour;                                         // 0xc(0x10)
	float                                                        FadeInDuration;                                    // 0x1c(0x4)
	float                                                        MaximumAudioFogIntensityRTPC;                      // 0x20(0x4)
};


// Size 0x38
struct SinkingTunnelOfTheDamnedActionStateSerialisableData
{
public:
	char                                                         pad0x30_3YY6F[0x30];                               // 0x0(0x30)
	bool                                                         FadeRequested;                                     // 0x30(0x1)
	char                                                         pad0x7_EPO2T[0x7];                                 // 0x31(0x7)
};


// Size 0x1
struct EventFireWeapon
{
public:
	bool                                                         bForFirstPerson;                                   // 0x0(0x1)
};


// Size 0x10
struct EventActiveDialogueInteractorsOnServerChanged
{
public:
	TArray<class Actor*>                                         ActiveDialogueInteractors;                         // 0x0(0x10)
};


// Size 0x8
struct EventCharacterKnockedBack
{
public:
	struct FName                                                 RumbleTag;                                         // 0x0(0x8)
};


// Size 0x10
struct UpdateUniversalDescriptionEvent
{
public:
	char                                                         pad0x10_V4SDU[0x10];                               // 0x0(0x10)
};


// Size 0x38
struct PlayerModerationReportablePlayerDetails
{
public:
	struct FString                                               ReportableGamerTag;                                // 0x0(0x10)
	struct FString                                               ScrambledGamerTag;                                 // 0x10(0x10)
	struct FString                                               Xuid;                                              // 0x20(0x10)
	char                                                         Platform;                                          // 0x30(0x1)
	char                                                         pad0x7_Z9GAR[0x7];                                 // 0x31(0x7)
};


// Size 0x70
struct OpenTrinketBoxActionRuleVerbiage
{
public:
	struct FText                                                 OpenTrinketBoxVerbiage;                            // 0x0(0x38)
	struct FText                                                 ReplaceTrinketVerbiage;                            // 0x38(0x38)
};


// Size 0x1
struct InvertRadialYInputEvent
{
public:
	bool                                                         InvertRadialYInputEvent;                           // 0x0(0x1)
};


// Size 0x28
struct AthenaAnimationAsyncLoadedObjectActionOneShotPitchOverride
{
public:
	char                                                         pad0x8_LSM2E[0x8];                                 // 0x0(0x8)
	TArray<Class>                                                MainAction;                                        // 0x8(0x10)
	TArray<Class>                                                AlternateAction;                                   // 0x18(0x10)
};


// Size 0x28
struct SessionManagementPlayerData
{
public:
	char                                                         pad0x18_8KHWM[0x18];                               // 0x0(0x18)
	class PlayerState*                                           PlayerState;                                       // 0x18(0x8)
	char                                                         SessionRole;                                       // 0x20(0x1)
	char                                                         pad0x7_8DAFT[0x7];                                 // 0x21(0x7)
};


// Size 0x68
struct MeshMemoryConstraintCannonDelayedHealthReport
{
public:
	char                                                         pad0x18_F2XI5[0x18];                               // 0x0(0x18)
	bool                                                         DidMakeAttemptToSetBoxMesh;                        // 0x18(0x1)
	bool                                                         DidMakeAttemptToSetBarrelMesh;                     // 0x19(0x1)
	char                                                         pad0x6_OJQAR[0x6];                                 // 0x1a(0x6)
	struct FString                                               BoxDescAssetPathName;                              // 0x20(0x10)
	struct FString                                               BarrelDescAssetPathName;                           // 0x30(0x10)
	bool                                                         BoxMeshIsValid;                                    // 0x40(0x1)
	bool                                                         BarrelMeshIsValid;                                 // 0x41(0x1)
	char                                                         pad0x6_NA7GN[0x6];                                 // 0x42(0x6)
	struct FString                                               BoxMeshAssetPathName;                              // 0x48(0x10)
	struct FString                                               BarrelMeshAssetPathName;                           // 0x58(0x10)
};


// Size 0x20
struct ShovelTelemetryEvent
{
public:
	struct FString                                               DigType;                                           // 0x0(0x10)
	struct FString                                               Terrain;                                           // 0x10(0x10)
};


// Size 0x8
struct EventPlayerLeftProximity
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x1
struct LocalGameChatStatusEvent
{
public:
	char                                                         Status;                                            // 0x0(0x1)
};


// Size 0x1
struct ItemLoadoutSlotsUpdatedEvent
{
public:
	char                                                         pad0x1_JT0WA[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct CanShowQuaternaryActionButton
{
public:
	char                                                         pad0x4_N1PC2[0x4];                                 // 0x0(0x4)
	bool                                                         CanShow;                                           // 0x4(0x1)
	char                                                         pad0x3_E8T4E[0x3];                                 // 0x5(0x3)
	struct FText                                                 Text;                                              // 0x8(0x38)
};


// Size 0x18
struct NPCDialogComponentConditionContextPayload
{
public:
	char                                                         pad0x18_3QV2E[0x18];                               // 0x0(0x18)
};


// Size 0xc
struct MermaidAnimMapping
{
public:
	char                                                         State;                                             // 0x0(0x1)
	char                                                         pad0x3_5N1VA[0x3];                                 // 0x1(0x3)
	struct FName                                                 MontageLabel;                                      // 0x4(0x8)
};


// Size 0x20
struct ActorStateData
{
public:
	int                                                          Id;                                                // 0x0(0x4)
	struct Vector                                                Position;                                          // 0x4(0xc)
	struct FString                                               IslandName;                                        // 0x10(0x10)
};


// Size 0x60
struct ContestShipLiverySet
{
public:
	struct Guid                                                  OwningCrewID;                                      // 0x0(0x10)
	char                                                         pad0x50_C25QN[0x50];                               // 0x10(0x50)
};


// Size 0x1
struct AllianceJoinStatusChangedEvent
{
public:
	char                                                         pad0x1_0E14S[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventWheelTurningThresholdExceeded
{
public:
	char                                                         pad0x1_DGP57[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct ReplyToGuildInviteEvent
{
public:
	struct FString                                               GuildId;                                           // 0x0(0x10)
	bool                                                         Accept;                                            // 0x10(0x1)
	char                                                         pad0x7_RJRAP[0x7];                                 // 0x11(0x7)
};


// Size 0x20
struct WorldMapAILocation
{
public:
	struct Guid                                                  AIActorId;                                         // 0x0(0x10)
	struct Vector2D                                              Location;                                          // 0x10(0x8)
	class UClass*                                                AIClassId;                                         // 0x18(0x8)
};


// Size 0x10
struct RevealableComponentSpawnedEvent
{
public:
	char                                                         pad0x10_SQJM0[0x10];                               // 0x0(0x10)
};


// Size 0x70
struct UIPremiumStoreItemInteractEvent
{
public:
	struct FString                                               CurrencyUsed;                                      // 0x0(0x10)
	struct FString                                               EngagementOutcome;                                 // 0x10(0x10)
	struct FString                                               ItemCost;                                          // 0x20(0x10)
	struct FString                                               ItemName;                                          // 0x30(0x10)
	struct FString                                               PageName;                                          // 0x40(0x10)
	struct FString                                               SessionId;                                         // 0x50(0x10)
	struct FString                                               OfferId;                                           // 0x60(0x10)
};


// Size 0x1
struct HideJupiterAccountLinkingConfirmationPrompt
{
public:
	char                                                         pad0x1_GQMFI[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct BootFlowStartSaferSeasModeSessionStateEvent
{
public:
	char                                                         pad0x1_T2DF8[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct FishingComedyItemInfo
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	char                                                         pad0x4_KYCGA[0x4];                                 // 0x4(0x4)
	class UClass*                                                ItemDesc;                                          // 0x8(0x8)
	struct Transform                                             SpawnOffset;                                       // 0x10(0x30)
};


// Size 0x18
struct ShowNewInviteConfirmationModalEvent
{
public:
	bool                                                         IsSaferSeasInvite;                                 // 0x0(0x1)
	char                                                         pad0x7_0JT04[0x7];                                 // 0x1(0x7)
	struct FString                                               Message;                                           // 0x8(0x10)
};


// Size 0x10
struct CompanyConditionalStatsTriggerType
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	class UClass*                                                ConditionalStatsTriggerType;                       // 0x8(0x8)
};


// Size 0x10
struct SplineTransitionLadderActionStateParams
{
public:
	char                                                         pad0x10_OPLV3[0x10];                               // 0x0(0x10)
};


// Size 0x8
struct GuildLedgerPositionChangedEvent
{
public:
	int                                                          OldLedgerPosition;                                 // 0x0(0x4)
	int                                                          CurrentLedgerPosition;                             // 0x4(0x4)
};


// Size 0x20
struct AthenaAnimationHandHeldItemParams
{
public:
	bool                                                         LeftArmOverlayActive;                              // 0x0(0x1)
	bool                                                         RightArmOverlayActive;                             // 0x1(0x1)
	bool                                                         UpperBodyOverlayActive;                            // 0x2(0x1)
	bool                                                         FullBodyOverlayActive;                             // 0x3(0x1)
	bool                                                         SpineOverlayActive;                                // 0x4(0x1)
	bool                                                         SpineLockActive;                                   // 0x5(0x1)
	bool                                                         ObjectActive;                                      // 0x6(0x1)
	bool                                                         ObjectOverrideStateActive;                         // 0x7(0x1)
	struct FString                                               OverlayAnimationName;                              // 0x8(0x10)
	char                                                         ObjectPassiveState;                                // 0x18(0x1)
	bool                                                         QuickStow;                                         // 0x19(0x1)
	bool                                                         Reload;                                            // 0x1a(0x1)
	bool                                                         ContinuousInteractionCustomLocomotionEnabled;      // 0x1b(0x1)
	char                                                         pad0x4_GRQES[0x4];                                 // 0x1c(0x4)
};


// Size 0x8
struct EventHealthChangeContinuousStart
{
public:
	float                                                        CurrentHealth;                                     // 0x0(0x4)
	float                                                        ChangeRate;                                        // 0x4(0x4)
};


// Size 0x10
struct RequestCompanyProgressFailedEvent
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
};


// Size 0x8
struct PopUpQueueServicePausedTelemetryEvent
{
public:
	bool                                                         Paused;                                            // 0x0(0x1)
	char                                                         pad0x3_RTF16[0x3];                                 // 0x1(0x3)
	int                                                          Reason;                                            // 0x4(0x4)
};


// Size 0x18
struct GuildIconTextureKeyValue
{
public:
	struct FString                                               ImageKey;                                          // 0x0(0x10)
	class Texture*                                               Image;                                             // 0x10(0x8)
};


// Size 0x8
struct EventPlayerRepairObjectStart
{
public:
	char                                                         pad0x8_0YPEO[0x8];                                 // 0x0(0x8)
};


// Size 0x10
struct StateChangeCoordination
{
public:
	class Actor*                                                 OtherCutscene;                                     // 0x0(0x8)
	char                                                         OtherCutsceneStateChangeCondition;                 // 0x8(0x1)
	char                                                         CutsceneStateChangeResponse;                       // 0x9(0x1)
	char                                                         pad0x6_Z0DT5[0x6];                                 // 0xa(0x6)
};


// Size 0x30
struct EntitlementBundle
{
public:
	bool                                                         IsCommodity;                                       // 0x0(0x1)
	char                                                         pad0x7_J8JLM[0x7];                                 // 0x1(0x7)
	class UClass*                                                BundleKey;                                         // 0x8(0x8)
	struct Guid                                                  BundleOfferId;                                     // 0x10(0x10)
	TArray<class Class*>                                         BundleContents;                                    // 0x20(0x10)
};


// Size 0x8
struct EventPlayerCapstanUsageEnd
{
public:
	class Actor*                                                 ObjectBeingUsed;                                   // 0x0(0x8)
};


// Size 0x1
struct RequestSwitchAccountEvent
{
public:
	char                                                         pad0x1_L1QXL[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct VotersByOption
{
public:
	int                                                          VoteOption;                                        // 0x0(0x4)
	char                                                         pad0x4_4OUZQ[0x4];                                 // 0x4(0x4)
	TArray<class Object*>                                        Voters;                                            // 0x8(0x10)
};


// Size 0x30
struct QuestVariableAssetArray
{
public:
	char                                                         pad0x30_HAEDF[0x30];                               // 0x0(0x30)
};


// Size 0x10
struct ShroudBreakerDeactivatedEvent
{
public:
	struct Guid                                                  ShroudBreakerId;                                   // 0x0(0x10)
};


// Size 0x10
struct InvasionMatchmakingCancellationRequestEvent
{
public:
	char                                                         pad0x10_UHWXT[0x10];                               // 0x0(0x10)
};


// Size 0xe8
struct CaptainsLogCrewAccolades
{
public:
	struct FText                                                 CrewNickname;                                      // 0x0(0x38)
	int                                                          PirateTitleIndex;                                  // 0x38(0x4)
	char                                                         pad0x4_3V2D0[0x4];                                 // 0x3c(0x4)
	struct FText                                                 AccoladeOne;                                       // 0x40(0x38)
	struct FText                                                 AccoladeTwo;                                       // 0x78(0x38)
	struct FText                                                 AccoladeThree;                                     // 0xb0(0x38)
};


// Size 0x1
struct EventSailGotPerfectWind
{
public:
	char                                                         pad0x1_DOSIR[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct CaptainsShopInventoryCountsRequestEvent
{
public:
	TArray<String>                                               Requests;                                          // 0x0(0x10)
};


// Size 0x10
struct RequestEquipmentChestEquipItemEvent
{
public:
	struct FString                                               ItemDesc;                                          // 0x0(0x10)
};


// Size 0x20
struct TitleDescIconEntry
{
public:
	struct FeatureFlag                                           FeatureFlag;                                       // 0x0(0xc)
	char                                                         pad0x4_MZA59[0x4];                                 // 0xc(0x4)
	struct StringAssetReference                                  IconPath;                                          // 0x10(0x10)
};


// Size 0x1
struct EventSwimmingCreatureUnderwaterStateChange
{
public:
	bool                                                         IsAboveWater;                                      // 0x0(0x1)
};


// Size 0x40
struct HangingActionStateSerialisableData
{
public:
	char                                                         pad0x40_635EJ[0x40];                               // 0x0(0x40)
};


// Size 0x1
struct PirateCreationEvent_InitialModalRemoved
{
public:
	char                                                         pad0x1_RPYIO[0x1];                                 // 0x0(0x1)
};


// Size 0x40
struct AssetDelayLoadEntry
{
public:
	struct FString                                               Comment;                                           // 0x0(0x10)
	char                                                         LoadAtPhase;                                       // 0x10(0x1)
	char                                                         Persistence;                                       // 0x11(0x1)
	bool                                                         LoadForClient;                                     // 0x12(0x1)
	bool                                                         LoadForServer;                                     // 0x13(0x1)
	struct FName                                                 Feature;                                           // 0x14(0x8)
	char                                                         pad0x4_F9D8A[0x4];                                 // 0x1c(0x4)
	TArray<struct StringAssetReference>                          AssetsToLoad;                                      // 0x20(0x10)
	TArray<Class>                                                BlueprintsToLoad;                                  // 0x30(0x10)
};


// Size 0x10
struct FaunaAnimationTurningStructure
{
public:
	class AnimSequence*                                          TurnLeft;                                          // 0x0(0x8)
	class AnimSequence*                                          TurnRight;                                         // 0x8(0x8)
};


// Size 0x8
struct BlowpipeAmmoStruct
{
public:
	int                                                          DartType;                                          // 0x0(0x4)
	int                                                          AmmoCount;                                         // 0x4(0x4)
};


// Size 0x18
struct ItemDiggingBaseOverride
{
public:
	TArray<Class>                                                Classes;                                           // 0x0(0x10)
	class ItemDiggingBaseConfig*                                 DiggingBaseConfig;                                 // 0x10(0x8)
};


// Size 0x1
struct EnableDefaultFogBanksGameServerRequestModel
{
public:
	bool                                                         Enable;                                            // 0x0(0x1)
};


// Size 0x10
struct EventWieldableItemUseStartingAndJustMadeVisible
{
public:
	class Actor*                                                 Item;                                              // 0x0(0x8)
	char                                                         PerspectiveType;                                   // 0x8(0x1)
	char                                                         pad0x7_Y2MQQ[0x7];                                 // 0x9(0x7)
};


// Size 0x18
struct EventConversationParticipantReactionRequest
{
public:
	class Actor*                                                 ConversationStarter;                               // 0x0(0x8)
	class UClass*                                                OptionalInteractResponseType;                      // 0x8(0x8)
	class WwiseEvent*                                            OptionalDialogAudioEvent;                          // 0x10(0x8)
};


// Size 0x18
struct PetAnimationCycleMontage
{
public:
	class AnimMontage*                                           In;                                                // 0x0(0x8)
	class AnimMontage*                                           Loop;                                              // 0x8(0x8)
	class AnimMontage*                                           Out;                                               // 0x10(0x8)
};


// Size 0x18
struct UIPremiumStoreOpenEvent
{
public:
	bool                                                         IsFrontend;                                        // 0x0(0x1)
	char                                                         pad0x7_SQHYZ[0x7];                                 // 0x1(0x7)
	struct FString                                               SessionId;                                         // 0x8(0x10)
};


// Size 0x1
struct OnHandleBackwardMovementStarted
{
public:
	char                                                         pad0x1_UEQXQ[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct WwiseEventsIcon
{
public:
	class Texture2D*                                             IconTexture;                                       // 0x0(0x8)
