#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Athena_Structs.h"


// Size 0x20 (Full Size[0xaa8] - InheritedSize[0xa88]
class AthenaGameEngine: public RareGameEngine
{
public:
	class AthenaGameEngineSettings*                              EngineSettings;                                    // 0xa90(0x8)
};


// Size 0x60 (Full Size[0x428] - InheritedSize[0x3c8]
class SeaFortCannonsMechanismTrigger: public Actor
{
public:
	class SceneComponent*                                        Root;                                              // 0x3c8(0x8)
	class MechanismTriggerComponent*                             MechanismTriggerComponent;                         // 0x3d0(0x8)
	float                                                        InnerRadius;                                       // 0x3d8(0x4)
	float                                                        OuterRadius;                                       // 0x3dc(0x4)
	bool                                                         EnableReactivationTimeLimit;                       // 0x3e0(0x1)
	float                                                        ReactivationTimeLimitMinutes;                      // 0x3e4(0x4)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class CaptainsVoyageRecipesDebugMenuGenerator: public DebugMenuEntryGenerator
{
public:
	bool                                                         Regenerate;                                        // 0x28(0x1)
	TArray<struct StringClassReference>                          Proposals;                                         // 0x30(0x10)
	TArray<String>                                               AssetNames;                                        // 0x40(0x10)
};


// Size 0x8 (Full Size[0xd0] - InheritedSize[0xc8]
class PlayerPermissionsComponent: public ActorComponent
{
public:
	bool                                                         AllowDebugMenuAccess;                              // 0xc8(0x1)
	bool                                                         AllowDebugMenuButtonShortcutsAccess;               // 0xc9(0x1)
	bool                                                         AllowExecuteOnServer;                              // 0xca(0x1)
	bool                                                         DisableWatermark;                                  // 0xcb(0x1)
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class CrewOnlyWwwiseAudioComponent: public ActorComponent
{
public:
	class WwiseObjectPoolWrapper*                                SfxPool;                                           // 0xc8(0x8)
};


// Size 0xf8 (Full Size[0x120] - InheritedSize[0x28]
class CharacterAudioFootfallControllerParams: public DataAsset
{
public:
	struct FName                                                 PlayerSpeedRtpcName;                               // 0x28(0x8)
	float                                                        MinPlayerSpeedRtpcValue;                           // 0x30(0x4)
	float                                                        MaxPlayerSpeedRtpcValue;                           // 0x34(0x4)
	struct FName                                                 WadingRtpcName;                                    // 0x38(0x8)
	float                                                        MinWadingWwiseRtpcValue;                           // 0x40(0x4)
	float                                                        MaxWadingWwiseRtpcValue;                           // 0x44(0x4)
	struct FName                                                 FootstepSquelchRtpcName;                           // 0x48(0x8)
	struct FName                                                 PlayerPerspectiveRtpcName;                         // 0x50(0x8)
	float                                                        PlayerPerspectiveRtpcValue;                        // 0x58(0x4)
	float                                                        RemotePlayerPerspectiveRtpcValue;                  // 0x5c(0x4)
	class WwiseEvent*                                            FootfallEvent;                                     // 0x60(0x8)
	class WwiseEvent*                                            FootfallPacingEvent;                               // 0x68(0x8)
	class WwiseEvent*                                            CharacterCleanLandEvent;                           // 0x70(0x8)
	class WwiseEvent*                                            CharacterJumpEvent;                                // 0x78(0x8)
	class WwiseEvent*                                            CharacterSplashEvent;                              // 0x80(0x8)
	class WwiseObjectPoolWrapper*                                FootfallsPool;                                     // 0x88(0x8)
	struct FName                                                 VerticalSpeedRtpcName;                             // 0x90(0x8)
	float                                                        MinVerticalSpeedRtpcValue;                         // 0x98(0x4)
	float                                                        MaxVerticalSpeedRtpcValue;                         // 0x9c(0x4)
	struct FName                                                 BrokenLegSwitchGroup;                              // 0xa0(0x8)
	struct FName                                                 BrokenLegSwitchBroken;                             // 0xa8(0x8)
	struct FName                                                 FootwareCategorySwitchGroup;                       // 0xb0(0x8)
	struct FName                                                 FootwareCategoryBoots;                             // 0xb8(0x8)
	struct FName                                                 FootwareCategoryBarefoot;                          // 0xc0(0x8)
	struct FName                                                 FootwareCategoryPegleg;                            // 0xc8(0x8)
	struct FName                                                 FootfallEmoteSwitchGroup;                          // 0xd0(0x8)
	struct FName                                                 PlayingEmoteSwitch;                                // 0xd8(0x8)
	struct FName                                                 HotFloorSwitchGroup;                               // 0xe0(0x8)
	struct FName                                                 HotFloorActive;                                    // 0xe8(0x8)
	struct FName                                                 FootfallBuriedTreasureRTPCName;                    // 0xf0(0x8)
	float                                                        DecalOverlapRadius;                                // 0xf8(0x4)
	float                                                        SteppingOnDecalRTPCValue;                          // 0xfc(0x4)
	float                                                        NotSteppingOnDecalRTPCValue;                       // 0x100(0x4)
	struct FName                                                 PirateTypeSwitchGroup;                             // 0x104(0x8)
	struct FName                                                 PirateTypeGhost;                                   // 0x10c(0x8)
	struct FName                                                 PirateTypeSkeleton;                                // 0x114(0x8)
};


// Size 0x8 (Full Size[0x178] - InheritedSize[0x170]
class EnvQueryTest_InGameEventExclusionZone: public EnvQueryTest
{
public:
	float                                                        Radius;                                            // 0x170(0x4)
};


// Size 0x70 (Full Size[0xe8] - InheritedSize[0x78]
class VulnerabilityAIAbility: public AthenaAIAbility
{
public:
	class Pawn*                                                  Owner;                                             // 0x78(0x8)
	class VulnerabilityAIAbilityParams*                          SetupAbilityParams;                                // 0x80(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class MeleeAttackLockOnComponentSettings: public DataAsset
{
public:
	class LockOnCameraModifierSettings*                          CameraModifierSettings;                            // 0x28(0x8)
	float                                                        BreakDistance;                                     // 0x30(0x4)
	bool                                                         DelayTargetEvaluationUntilEndOfStrike;             // 0x34(0x1)
	bool                                                         AllowTargetSwitching;                              // 0x35(0x1)
	float                                                        MaxLockOnAngle;                                    // 0x38(0x4)
	float                                                        MaxLockOnDistance;                                 // 0x3c(0x4)
};


// Size 0xb8 (Full Size[0xe0] - InheritedSize[0x28]
class QuestBookPagesInContainerDataAsset: public DataAsset
{
public:
	struct                                                       Transform;                                         // 0x30(0x30)
	class StaticMesh*                                            PagesMesh;                                         // 0x60(0x8)
	struct FText                                                 ActionTooltipDisplayString;                        // 0x68(0x38)
	struct FText                                                 ActionTooltipDisplayStringSentence;                // 0xa0(0x38)
};


// Size 0x390 (Full Size[0xb80] - InheritedSize[0x7f0]
class QuestBook: public SkeletalMeshWieldableItem
{
public:
	class InventoryItemComponent*                                InventoryItem;                                     // 0x800(0x8)
	map                                                          ProcPageCache;                                     // 0x818(0x50)
	struct                                                       MaterialHandler;                                   // 0x868(0x140)
	float                                                        ExtraPageTurnDurationForForceRedraw;               // 0x9a8(0x4)
	struct                                                       ReplicationInfo;                                   // 0x9b0(0x28)
	class QuestBookPageList*                                     PageList;                                          // 0x9d8(0x8)
	class UClass*                                                RemapperClass;                                     // 0x9e0(0x8)
	class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x9e8(0x8)
	class DirectionalLightComponent*                             DirectionalLightComponent;                         // 0x9f0(0x8)
	float                                                        ShadowCascadeDistributionExponentWhenUsing;        // 0x9f8(0x4)
	float                                                        ShadowCascadeDistributionExponentTransitionTime;   // 0x9fc(0x4)
	float                                                        PageTurnDuration;                                  // 0xa08(0x4)
	float                                                        PageTurnForceRedrawDuration;                       // 0xa0c(0x4)
	int                                                          PageWidth;                                         // 0xb60(0x4)
	int                                                          PageHeight;                                        // 0xb64(0x4)
	struct                                                       PageTextRenderer;                                  // 0xb68(0x18)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class ItemActionComponentAudioParams: public DataAsset
{
public:
	class WwiseObjectPoolWrapper*                                ItemActionAudioPool;                               // 0x28(0x8)
	class WwiseEvent*                                            ActionStartEvent;                                  // 0x30(0x8)
	class WwiseEvent*                                            ActionStopEvent;                                   // 0x38(0x8)
	bool                                                         ActionStartEventIsLoop;                            // 0x40(0x1)
	float                                                        ActionStartEventFadeTime;                          // 0x44(0x4)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class PuzzleManager: public Actor
{
public:
	TArray<class PuzzleManagerPolicy*>                           PuzzleManagerPolicies;                             // 0x3c8(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class IteratorFrame: public Object
{
public:
	class TaleQuestParallelForeachStepDesc*                      Desc;                                              // 0x40(0x8)
	class ScriptStruct*                                          StructForCollector;                                // 0x48(0x8)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class SceneDialogueData: public Object
{
public:
	TArray<struct Name>                                          ActorNames;                                        // 0x28(0x10)
	char                                                         ChatType;                                          // 0x38(0x1)
	TArray<class SceneDialogueSection*>                          TextSections;                                      // 0x40(0x10)
	bool                                                         ChainedDialogue;                                   // 0x50(0x1)
	struct FString                                               SourceText;                                        // 0x58(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class RammableExplosiveDataAsset: public DataAsset
{
public:
	TArray<struct RammableExplosiveEntry>                        ExplosiveSpeedParams;                              // 0x28(0x10)
};


// Size 0x8 (Full Size[0x1a8] - InheritedSize[0x1a0]
class FixedIntentComponent: public ControllableIntentComponent
{
public:
	float                                                        Intent;                                            // 0x1a0(0x4)
};


// Size 0x70 (Full Size[0x4b0] - InheritedSize[0x440]
class AnimatedCosmeticItemAnimationInstance: public AnimInstance
{
public:
	TArray<struct NPCOneShotAnimationElement>                    OneShotSequences;                                  // 0x448(0x10)
	TArray<struct NPCContinuousAnimationElement>                 ContinuousSequences;                               // 0x458(0x10)
	class AnimInstance*                                          ParentCharacterAnimationInstance;                  // 0x468(0x8)
	class AnimMontage*                                           CurrentPlayingMontage;                             // 0x470(0x8)
	class AnimSequenceBase*                                      OneShot;                                           // 0x478(0x8)
	class AnimSequenceBase*                                      ContinuousIn;                                      // 0x480(0x8)
	class AnimSequenceBase*                                      ContinuousLoopA;                                   // 0x488(0x8)
	class AnimSequenceBase*                                      ContinuousLoopB;                                   // 0x490(0x8)
	class AnimSequenceBase*                                      ContinuousOut;                                     // 0x498(0x8)
};


// Size 0x1138 (Full Size[0x1160] - InheritedSize[0x28]
class AthenaAnimationsGroupingAssetBase: public DataAsset
{
public:
	class UClass*                                                ItemId;                                            // 0x28(0x8)
	struct                                                       FishingAnimations;                                 // 0x30(0x1e0)
	struct                                                       ItemAnimations;                                    // 0x210(0x9e8)
	struct                                                       LocomotionAnimations;                              // 0xbf8(0x100)
	struct                                                       JumpingAnimations;                                 // 0xcf8(0x80)
	struct                                                       IdleAnimations;                                    // 0xd78(0x60)
	assetobject                                                  HandAdditive;                                      // 0xdd8(0x20)
	struct                                                       PersistentLoadedAnimations;                        // 0xdf8(0x358)
	struct                                                       FeatureToggle;                                     // 0x1150(0xc)
};


// Size 0x28 (Full Size[0x908] - InheritedSize[0x8e0]
class DroppableTankardStaticSimpleBootyItemProxy: public StaticSimpleBootyItemProxy
{
public:
	float                                                        RemainingVolume;                                   // 0x8e8(0x4)
	class InteractableComponent*                                 InteractableComponent;                             // 0x8f0(0x8)
	class LiquidLevelTransferComponent*                          LiquidLevelTransferComponent;                      // 0x8f8(0x8)
	class LiquidContainerComponent*                              LiquidContainerComponent;                          // 0x900(0x8)
};


// Size 0x108 (Full Size[0x178] - InheritedSize[0x70]
class BTService_RunLoopingCustomAnimation: public BTService
{
public:
	bool                                                         UseFixedLoopingCustomAnimationName;                // 0x70(0x1)
	struct FName                                                 FixedLoopingCustomAnimationName;                   // 0x74(0x8)
	struct                                                       LoopingCustomAnimationNameKey;                     // 0x80(0x28)
	bool                                                         GetAnimationDurations;                             // 0xa8(0x1)
	struct                                                       IntoAnimationEffectTime;                           // 0xb0(0x28)
	struct                                                       IntoAnimationDuration;                             // 0xd8(0x28)
	struct                                                       OutOfUndockTime;                                   // 0x100(0x28)
	struct                                                       OutOfAnimationDuration;                            // 0x128(0x28)
	struct                                                       AlternateOutOfAnimationIndex;                      // 0x150(0x28)
};


// Size 0x78 (Full Size[0x140] - InheritedSize[0xc8]
class FireBreathAIAbilityParams: public AthenaAIAbilityParams
{
public:
	struct                                                       FireBreathDuration;                                // 0xc8(0x10)
	class UClass*                                                FireBreathObject;                                  // 0xd8(0x8)
	struct                                                       FireBreathVFXParams;                               // 0xe0(0x40)
	struct                                                       FireCollisionVolumeSize;                           // 0x120(0xc)
	float                                                        FireBreathZoneStartOffset;                         // 0x12c(0x4)
	float                                                        FireStartDelay;                                    // 0x130(0x4)
	float                                                        FireEndPreWarn;                                    // 0x134(0x4)
	class UClass*                                                VfxSpawner;                                        // 0x138(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ScrambledNamesDataAsset: public DataAsset
{
public:
	TArray<struct Text>                                          ScrambledNames;                                    // 0x28(0x10)
};


// Size 0x28 (Full Size[0xa8] - InheritedSize[0x80]
class SharkPartsDesc: public MeshMemoryConstraintsAIPartsDesc
{
public:
	struct FString                                               SharkPartsTag;                                     // 0x80(0x10)
	struct                                                       SharkPlayerStats;                                  // 0x90(0x8)
	TArray<struct SharkMaterialEntry>                            Materials;                                         // 0x98(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EntitlementRedirectorDataAsset: public DataAsset
{
public:
	TArray<struct EntitlementRedirectorEntry>                    Redirectors;                                       // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EntitlementBundleMapperDataAsset: public DataAsset
{
public:
	TArray<struct EntitlementBundle>                             Bundles;                                           // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PhrasesRadialDataAsset: public DataAsset
{
public:
	TArray<struct PhraseData>                                    Phrases;                                           // 0x28(0x10)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class DockableComponent: public ActorComponent
{
public:
	bool                                                         CanFocusOnOtherInteractablesWhileDocked;           // 0xd0(0x1)
};


// Size 0x10f0 (Full Size[0x1860] - InheritedSize[0x770]
class AthenaPlayerController: public PlayerController
{
public:
	class PioneerComponent*                                      PioneerComponent;                                  // 0x7f8(0x8)
	class PlayerPermissionsComponent*                            PlayerPermissionsComponent;                        // 0x800(0x8)
	class PlayerTelemetryComponent*                              PlayerTelemetryComponent;                          // 0x808(0x8)
	class PlayerStatsComponent*                                  PlayerStatsComponent;                              // 0x810(0x8)
	class PlayerSeasonProgressionComponent*                      PlayerSeasonProgressionComponent;                  // 0x818(0x8)
	class PlayerHeroStatsComponent*                              PlayerHeroStatsComponent;                          // 0x820(0x8)
	class PlayerWalletComponent*                                 PlayerWalletComponent;                             // 0x828(0x8)
	class BoxedRpcDispatcherComponent*                           BoxedRpcDispatcherComponent;                       // 0x830(0x8)
	class PlayerEntitlementComponent*                            PlayerEntitlementComponent;                        // 0x838(0x8)
	class PlayerMigratableStatusComponent*                       PlayerMigratableStatusComponent;                   // 0x840(0x8)
	class EmblemComponent*                                       EmblemComponent;                                   // 0x848(0x8)
	class PlayerCompanyComponent*                                PlayerCompanyComponent;                            // 0x850(0x8)
	class LeaderboardComponent*                                  LeaderboardComponent;                              // 0x858(0x8)
	class RewardComponent*                                       RewardComponent;                                   // 0x860(0x8)
	class PlayerNonVerbalComponent*                              PlayerNonVerbalComponent;                          // 0x868(0x8)
	class PlayerCrewComponent*                                   PlayerCrewComponent;                               // 0x870(0x8)
	class PlayerMuteComponent*                                   PlayerMuteComponent;                               // 0x878(0x8)
	class UIResponceComponent*                                   PlayerUIReturnedResponceComponent;                 // 0x880(0x8)
	class PopUpNotificationComponent*                            PopUpNotificationComponent;                        // 0x888(0x8)
	class EncounterListenerComponent*                            EncounterListenerComponent;                        // 0x890(0x8)
	class CharacterAnimaticSettingsComponent*                    CharacterAnimaticSettingsComponent;                // 0x898(0x8)
	class AthenaTutorialComponent*                               TutorialComponent;                                 // 0x8a0(0x8)
	class ContextualTutorialComponent*                           ContextualTutorialComponent;                       // 0x8a8(0x8)
	class ShantySelectionComponent*                              ShantySelectionComponent;                          // 0x8b0(0x8)
	class TutorialManager*                                       TutorialManagerComponent;                          // 0x8b8(0x8)
	class EmissaryActionRewardBoostComponent*                    EmissaryActionRewardBoostComponent;                // 0x8c0(0x8)
	class PlayerMysteriousNoteComponent*                         PlayerMysteriousNoteComponent;                     // 0x8c8(0x8)
	class EmissaryParticipantComponent*                          EmissaryParticipantComponent;                      // 0x8d0(0x8)
	class CommodityPurchaseTrackingComponent*                    CommodityPurchaseTrackingComponent;                // 0x8d8(0x8)
	class PlayerActivityComponent*                               PlayerActivityComponent;                           // 0x8e0(0x8)
	class IslandEventTrackerComponent*                           IslandEventTrackerComponent;                       // 0x8e8(0x8)
	class CampaignComponent*                                     CampaignComponent;                                 // 0x8f0(0x8)
	class TaleQuestQueryableStatesAccessComponent*               TaleQuestQueryableStatesAccessComponent;           // 0x8f8(0x8)
	class AudioReportingComponent*                               AudioReportingComponent;                           // 0x900(0x8)
	class GuildInviteeComponent*                                 GuildInviteeComponent;                             // 0x908(0x8)
	class ExperienceRefreshComponent*                            ExperienceRefreshComponent;                        // 0x910(0x8)
	float                                                        InputRawYawScale;                                  // 0x918(0x4)
	float                                                        InputRawPitchScale;                                // 0x91c(0x4)
	struct                                                       InventoryMemory;                                   // 0x920(0x50)
	class CinematicCameraController*                             CinematicCameraController;                         // 0x978(0x8)
	struct                                                       ClientSessionId;                                   // 0x1590(0x10)
	uint32                                                       MigratedPossessCount;                              // 0x15b0(0x4)
	class PromptsLocalService*                                   PromptsLocalService;                               // 0x1618(0x8)
	class CurveFloat*                                            AutoCentreCurve;                                   // 0x1620(0x8)
	struct                                                       CinematicCameraControllerLocation;                 // 0x1668(0xc)
	struct                                                       CinematicCameraControllerRotation;                 // 0x1674(0xc)
	struct                                                       PirateIdentity;                                    // 0x1680(0x78)
	char                                                         DeathFlameOfFateType;                              // 0x16f8(0x1)
	char                                                         FlameOfFateType;                                   // 0x16f9(0x1)
	char                                                         PlayerDeathType;                                   // 0x16fa(0x1)
	class IndividualReplicationChannel*                          IndividualReplicationChannel;                      // 0x1700(0x8)
	struct FString                                               DebugServerMigrationEndpoint;                      // 0x1720(0x10)
};


// Size 0x500 (Full Size[0x940] - InheritedSize[0x440]
class SwimmingCreaturePawn: public Pawn
{
public:
	class ActionStateMachineComponent*                           ActionStateMachineComponent;                       // 0x498(0x8)
	class ActionStatePriorityTableData*                          ActionStatePriorityTableData;                      // 0x4a0(0x8)
	class UClass*                                                ActionStateCreatorDefinition;                      // 0x4a8(0x8)
	class AthenaAIControllerParamsDataAsset*                     AIControllerParams;                                // 0x4b0(0x8)
	class ShapeComponent*                                        CollisionComponent;                                // 0x4b8(0x8)
	class SkeletalMeshMemoryConstraintComponent*                 Mesh;                                              // 0x4c0(0x8)
	class SwimmingCreatureMovementComponent*                     FloatingMovementComponent;                         // 0x4c8(0x8)
	class RewindComponent*                                       RewindComponent;                                   // 0x4d0(0x8)
	class PrimitiveComponent*                                    ProjectileTraceHitVolume;                          // 0x4d8(0x8)
	class HealthComponent*                                       HealthComponent;                                   // 0x4e0(0x8)
	class ActorDamageableComponent*                              DamageableComponent;                               // 0x4e8(0x8)
	class DitherComponent*                                       DitherComponent;                                   // 0x4f0(0x8)
	class AIPartsRetrievalComponent*                             AIPartsRetrievalComponent;                         // 0x4f8(0x8)
	class NetworkSyncedAnimationComponent*                       NetworkSyncedAnimationComponent;                   // 0x500(0x8)
	class NetworkTriggeredVFXComponent*                          NetworkTriggeredVFXComponent;                      // 0x508(0x8)
	class WaterHeightProviderComponent*                          WaterHeightProviderComponent;                      // 0x510(0x8)
	class WaterInteractionComponent*                             WaterInteractionComponent;                         // 0x518(0x8)
	float                                                        FadeOutTime;                                       // 0x520(0x4)
	char                                                         SwimmingCreatureType;                              // 0x524(0x1)
	struct                                                       CollisionShapeScaleOnDeath;                        // 0x528(0xc)
	struct                                                       PawnEncounterSpec;                                 // 0x620(0xd0)
	TArray<struct SwimmingCreatureLoadedMaterial>                CurrentlyLoadedMaterials;                          // 0x8a0(0x10)
	class UClass*                                                CurrentAIStrategy;                                 // 0x8b0(0x8)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class TaleAddStormAvoidanceAreaStepDesc: public TaleQuestStepDesc
{
public:
	struct                                                       Location;                                          // 0x80(0x30)
	struct                                                       Radius;                                            // 0xb0(0x30)
};


// Size 0x20 (Full Size[0x548] - InheritedSize[0x528]
class CompassWieldableReplica: public PoseableMeshWieldableReplica
{
public:
	class CompassSpinComponent*                                  SpinComponent;                                     // 0x528(0x8)
};


// Size 0x1e8 (Full Size[0x5b0] - InheritedSize[0x3c8]
class SeaFortsService: public Actor
{
public:
	struct                                                       DistantLightsAssetLoader;                          // 0x3d8(0x28)
	TArray<struct SeaFortDistantLightsSignal>                    ReplicatedDistantLightsSignals;                    // 0x400(0x10)
	map                                                          FortAlignmentStateCountsMap;                       // 0x410(0x50)
	class SeaFortsWorldDataAsset*                                SeaFortsData;                                      // 0x460(0x8)
	TArray<class Seafort*>                                       SeaForts;                                          // 0x468(0x10)
	map                                                          SeaFortDistantLightsIslandMap;                     // 0x478(0x50)
};


// Size 0x30 (Full Size[0xc0] - InheritedSize[0x90]
class ShadowAIFormDataAsset: public AthenaAIFormDataAsset
{
public:
	float                                                        LightStateActivationTime;                          // 0x90(0x4)
	float                                                        LightStateCooldown;                                // 0x94(0x4)
	float                                                        PlayerLanternIdleLightRange;                       // 0x98(0x4)
	float                                                        PlayerLanternRaisedLightRange;                     // 0x9c(0x4)
	float                                                        FlareLightRange;                                   // 0xa0(0x4)
	float                                                        LightExposureStunDuration;                         // 0xa4(0x4)
	TArray<char>                                                 FlamePhobias;                                      // 0xa8(0x10)
	bool                                                         AfraidOfLight;                                     // 0xb8(0x1)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class FishSpawnParamsDataAsset: public DataAsset
{
public:
	char                                                         TimeOfDay;                                         // 0x28(0x1)
	bool                                                         InPool;                                            // 0x29(0x1)
	bool                                                         CloseToActiveFortOrSkellyShip;                     // 0x2a(0x1)
	bool                                                         InStorm;                                           // 0x2b(0x1)
	bool                                                         CloseToShipwreck;                                  // 0x2c(0x1)
	class UClass*                                                Sea;                                               // 0x30(0x8)
	class VoyageLocationOnlyNamedIslandListDataAsset*            Islands;                                           // 0x38(0x8)
	char                                                         BaitType;                                          // 0x40(0x1)
	float                                                        CatchWeight;                                       // 0x44(0x4)
	struct FName                                                 FishName;                                          // 0x48(0x8)
	TArray<struct FishSizeAndType>                               FishTypes;                                         // 0x50(0x10)
	class FishSizeWeightsDataAsset*                              SizeWeights;                                       // 0x60(0x8)
};


// Size 0x50 (Full Size[0x330] - InheritedSize[0x2e0]
class TeleportLocationComponent: public SceneComponent
{
public:
	struct FName                                                 FeatureFlagToBeIncluded;                           // 0x2e0(0x8)
	struct FName                                                 FeatureFlagToBeExcluded;                           // 0x2e8(0x8)
	struct                                                       TeleportLocation;                                  // 0x2f0(0x40)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestNotificationUsingVariableStep: public TaleQuestStep
{
public:
	class TaleQuestNotificationUsingVariableStepDesc*            Desc;                                              // 0x98(0x8)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class SpawnRequirement: public Object
{
public:
	TArray<class SpawnRequirement*>                              OR_Requirements;                                   // 0x40(0x10)
};


// Size 0x8 (Full Size[0x48] - InheritedSize[0x40]
class VulnerabilityAbilityStageParams: public AthenaAIAbilityStageParams
{
public:
	float                                                        VulnerabilityDurationMultiplier;                   // 0x40(0x4)
	float                                                        MaxVulnerabilityPeriodHealthMultiplier;            // 0x44(0x4)
};


// Size 0x80 (Full Size[0x448] - InheritedSize[0x3c8]
class WaveBasedMechanismVisualController: public Actor
{
public:
	class MechanismActionComponent*                              MechanismActionComponent;                          // 0x3c8(0x8)
	TArray<class Actor*>                                         WaveVisualActors;                                  // 0x3d0(0x10)
	struct FName                                                 StaticMeshDynamicMaterialTag;                      // 0x3e0(0x8)
	class CurveFloat*                                            ScalarParameterCurve;                              // 0x3e8(0x8)
	struct FName                                                 MaterialScalarParameterName;                       // 0x3f0(0x8)
	float                                                        NewWaveDelay;                                      // 0x3f8(0x4)
	int                                                          WaveIndex;                                         // 0x3fc(0x4)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0x410(0x10)
	TArray<class MaterialInstanceDynamic*>                       MaterialsToTransition;                             // 0x430(0x10)
};


// Size 0x350 (Full Size[0xb40] - InheritedSize[0x7f0]
class MeleeWeapon: public StaticMeshWieldableItem
{
public:
	class InventoryItemComponent*                                InventoryItem;                                     // 0x7f8(0x8)
	class ParticleSystemComponent*                               TrailParticleSystem_FP;                            // 0x800(0x8)
	class ParticleSystemComponent*                               TrailParticleSystem_TP;                            // 0x808(0x8)
	class MeleeWeaponDataAsset*                                  DataAsset;                                         // 0x810(0x8)
	class InventoryManipulatorComponent*                         InventoryManipulator;                              // 0x818(0x8)
	bool                                                         CanUseWeaponToBlock;                               // 0x820(0x1)
	bool                                                         PreventCombosOnHealthChange;                       // 0x821(0x1)
	float                                                        MaxAcceptableAttackTimeStampDelta;                 // 0x898(0x4)
	float                                                        MaxAcceptableAttackLocationDelta;                  // 0x89c(0x4)
	float                                                        MaxAcceptableAttackLocationOnShipDelta;            // 0x8a0(0x4)
	float                                                        MaxAcceptableAttackShipVelocityForLocation;        // 0x8a4(0x4)
	class MeleeAttackProcessorComponent*                         WieldersAttackProcessor;                           // 0x8b8(0x8)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class NPCDialogPredicateAtHealthStage: public NPCDialogPredicate
{
public:
	int                                                          ActorIdx;                                          // 0x38(0x4)
	int                                                          HealthStage;                                       // 0x3c(0x4)
};


// Size 0xe0 (Full Size[0x1a8] - InheritedSize[0xc8]
class WorldMarkerManagerComponent: public ActorComponent
{
public:
	TArray<struct MarkerVariantDesc>                             MarkerVariants;                                    // 0xd0(0x10)
	TArray<struct FeatureToggledMarkerVariants>                  FeatureToggledMarkerVariants;                      // 0xe0(0x10)
	TArray<class BaseWorldMarker*>                               MarkerDataObjects;                                 // 0xf0(0x10)
	TArray<struct ClientMarkerRepresentation>                    ClientMarkerRepresentations;                       // 0x100(0x10)
};


// Size 0xf0 (Full Size[0x118] - InheritedSize[0x28]
class OutOfAmmoDestroyEffect: public AmmoBaseEffect
{
public:
	struct                                                       DestructionEffects;                                // 0x28(0x80)
	class Actor*                                                 OwningActor;                                       // 0xa8(0x8)
};


// Size 0x160 (Full Size[0x528] - InheritedSize[0x3c8]
class WieldableReplica: public Actor
{
public:
	class PrimitiveComponent*                                    MeshComponent;                                     // 0x3d0(0x8)
	class CosmeticItemAnimationSetDataAsset*                     CachedAnimationSet;                                // 0x3d8(0x8)
	class UClass*                                                ReplicaCategory;                                   // 0x3e0(0x8)
	class UClass*                                                AlternateReplicaCategory;                          // 0x3e8(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class PlayerPermissionsTestActor: public Actor
{
public:
	class PlayerPermissionsComponent*                            PlayerPermissionsComponent;                        // 0x3c8(0x8)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class GameEventSchedulerSettingsAsset: public DataAsset
{
public:
	TArray<struct GameEventSettings>                             EventSettings;                                     // 0x28(0x10)
	TArray<struct GameEventSchedulerMainConfig>                  Configs;                                           // 0x38(0x10)
	TArray<struct GameEventCount>                                GlobalEvents;                                      // 0x48(0x10)
	float                                                        InitialStartupTime;                                // 0x58(0x4)
	float                                                        BlockingVerificationFrequency;                     // 0x5c(0x4)
	float                                                        InvalidEventDeactivationQueryFrequency;            // 0x60(0x4)
	float                                                        InvalidEventDeactivationThreshold;                 // 0x64(0x4)
};


// Size 0x88 (Full Size[0x450] - InheritedSize[0x3c8]
class CutSceneActor: public Actor
{
public:
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x3d0(0x8)
	class CutSceneSubtitlesComponent*                            CutSceneSubtitlesComponent;                        // 0x3d8(0x8)
	double                                                       StartTimeInSeconds;                                // 0x3e0(0x8)
	bool                                                         CutsceneActivated;                                 // 0x3e8(0x1)
	TArray<class Actor*>                                         TargetActors;                                      // 0x3f0(0x10)
	struct FName                                                 AnimationNameToPlay;                               // 0x400(0x8)
	class UClass*                                                LocalMusicZone;                                    // 0x408(0x8)
	class PlaceableReaction*                                     PlaceableReaction;                                 // 0x410(0x8)
	class SceneDialogueData*                                     DialogueData;                                      // 0x418(0x8)
	TArray<struct Text>                                          LocalisableNames;                                  // 0x420(0x10)
};


// Size 0x18 (Full Size[0xe0] - InheritedSize[0xc8]
class CharacterVfxComponent: public ActorComponent
{
public:
	class ParticleSystemComponent*                               WindVFX;                                           // 0xc8(0x8)
	class AthenaPlayerCharacter*                                 OwnerCharacter;                                    // 0xd0(0x8)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AthenaAnimationUndoRepairDataAsset: public DataAsset
{
public:
	struct                                                       UndoRepairInto;                                    // 0x28(0x10)
	struct                                                       UndoRepairLoop;                                    // 0x38(0x10)
	class UClass*                                                UndoRepairStateId;                                 // 0x48(0x8)
};


// Size 0x30 (Full Size[0x78] - InheritedSize[0x48]
class LockOnCameraModifier: public CameraModifier
{
public:
	class LockOnCameraModifierSettings*                          Settings;                                          // 0x48(0x8)
	bool                                                         IsYawLocked;                                       // 0x50(0x1)
	bool                                                         OwnerInputsIgnored;                                // 0x51(0x1)
	class Actor*                                                 TargetActor;                                       // 0x58(0x8)
};


// Size 0xb98 (Full Size[0xbc0] - InheritedSize[0x28]
class WaterGunLiquidLauncherController: public Object
{
public:
	struct                                                       LiquidLauncherCollisionParams;                     // 0x30(0x68)
	struct                                                       LiquidLauncherCollisionStatusEffect;               // 0x98(0x18)
	float                                                        TimeUntilApplyStatusEffect;                        // 0xb0(0x4)
	float                                                        TimeToConsiderActorOutsideLiquid;                  // 0xb4(0x4)
	float                                                        LiquidLauncherCollisionDamageAmount;               // 0xb8(0x4)
	float                                                        DamagePerSecondInsideLiquid;                       // 0xbc(0x4)
	float                                                        GravityStrength;                                   // 0xc0(0x4)
	float                                                        GravityCurveStrength;                              // 0xc4(0x4)
	float                                                        LiquidLauncherGoopBurningTime;                     // 0xc8(0x4)
	float                                                        LiquidLauncherGoopBurningDrainPerSecond;           // 0xcc(0x4)
	class WaterGunWieldableItem*                                 WaterGun;                                          // 0xd0(0x8)
	map                                                          ActorsInsideLiquid;                                // 0xd8(0x50)
	map                                                          ActorsWithLiquidGoopStatus;                        // 0x128(0x50)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class FirstPersonAnimaticList: public DataAsset
{
public:
	TArray<struct NamedFirstPersonAnimatic>                      NamedFirstPersonAnimatics;                         // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AthenaAnimationEmoteGroupingAsset: public DataAsset
{
public:
	TArray<struct AthenaAnimationEmoteAnimations>                EmoteAnimationData;                                // 0x28(0x10)
};


// Size 0x30 (Full Size[0x128] - InheritedSize[0xf8]
class TaleQuestSequenceStep: public TaleQuestFramedStep
{
public:
	class TaleQuestSequenceStepDesc*                             Desc;                                              // 0xf8(0x8)
	interface                                                    CurrentStep;                                       // 0x100(0x10)
	TArray<struct ForkedStep>                                    ForkedSteps;                                       // 0x118(0x10)
};


// Size 0x1b8 (Full Size[0x280] - InheritedSize[0xc8]
class CoherentToWwiseEventComponent: public ActorComponent
{
public:
	struct                                                       UIAudioCuesTableLocation;                          // 0xc8(0x10)
	class CoherentToWwiseEventDataAsset*                         UIAudioCuesAsset;                                  // 0xd8(0x8)
	struct FName                                                 AudioGameStateGroup;                               // 0xe0(0x8)
	struct FName                                                 AudioGameStateIngame;                              // 0xe8(0x8)
	struct FName                                                 AudioGameStateInMenu;                              // 0xf0(0x8)
	struct FName                                                 AudioGameStateLoading;                             // 0xf8(0x8)
	struct FName                                                 AudioGameStateInFrontEnd;                          // 0x100(0x8)
};


// Size 0x40 (Full Size[0x408] - InheritedSize[0x3c8]
class ShantyZone: public Actor
{
public:
	class OverlapTriggerComponent*                               AudioZone;                                         // 0x3c8(0x8)
	class UClass*                                                BaseInstrument;                                    // 0x3d0(0x8)
	class PrimitiveComponent*                                    Root;                                              // 0x3e8(0x8)
	TArray<class Actor*>                                         PlayersInZone;                                     // 0x3f0(0x10)
	class MusicalInstrument*                                     Instrument;                                        // 0x400(0x8)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class ChandelierPartDescAsset: public ShipPartDescAsset
{
public:
	struct                                                       ChandelierPartDesc;                                // 0x28(0x30)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class WheelDescAsset: public ShipPartDescAsset
{
public:
	struct                                                       WheelDesc;                                         // 0x28(0x28)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class TimeOfDayDataAsset: public DataAsset
{
public:
	float                                                        SunriseStartHour;                                  // 0x28(0x4)
	float                                                        MorningStartHour;                                  // 0x2c(0x4)
	float                                                        MidDayStartHour;                                   // 0x30(0x4)
	float                                                        AfternoonStartHour;                                // 0x34(0x4)
	float                                                        SunsetStartHour;                                   // 0x38(0x4)
	float                                                        NightStartHour;                                    // 0x3c(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class EntitlementReward: public Reward
{
public:
	class UClass*                                                EntitlementDesc;                                   // 0x28(0x8)
};


// Size 0x50 (Full Size[0x88] - InheritedSize[0x38]
class AnimNotify_AthenaPlayParticleEffect: public AnimNotify
{
public:
	class Object*                                                PSTemplate;                                        // 0x38(0x8)
	struct FName                                                 SocketName;                                        // 0x40(0x8)
	struct                                                       LocationOffset;                                    // 0x48(0xc)
	struct                                                       RotationOffset;                                    // 0x54(0xc)
	struct                                                       RelativeScale;                                     // 0x60(0xc)
	struct                                                       ColorTint;                                         // 0x6c(0x10)
	float                                                        CustomParameter;                                   // 0x7c(0x4)
	bool                                                         Attached;                                          // 0x80(0x1)
	bool                                                         KeepWorldScale;                                    // 0x80(0x1)
	bool                                                         OwnerOnlySee;                                      // 0x80(0x1)
	bool                                                         OwnerNoSee;                                        // 0x80(0x1)
	bool                                                         OwnedByWorld;                                      // 0x80(0x1)
	char                                                         UnderwaterMode;                                    // 0x84(0x1)
	char                                                         CustomLocalSpaceMode;                              // 0x85(0x1)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class DiscardTransientActorStepDesc: public TaleQuestStepDesc
{
public:
	struct                                                       Actor;                                             // 0x80(0x30)
	char                                                         DiscardType;                                       // 0xb0(0x1)
};


// Size 0xf8 (Full Size[0x168] - InheritedSize[0x70]
class BTService_ObserveTargetReceivedDamage: public BTService
{
public:
	struct                                                       ObservedActorKey;                                  // 0x70(0x28)
	struct                                                       HasObservedActorReceivedSufficientDamageResultKey; // 0x98(0x28)
	struct                                                       ObservedActorDamageThreshold;                      // 0xc0(0x30)
};


// Size 0x10 (Full Size[0x2f0] - InheritedSize[0x2e0]
class AirBubbleComponent: public SceneComponent
{
public:
	float                                                        Radius;                                            // 0x2e0(0x4)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class StatusResponseAINamedControllerParamHealthChange: public StatusResponse
{
public:
	char                                                         HealthChangedReason;                               // 0x30(0x1)
	struct FName                                                 AINamedControllerParam;                            // 0x34(0x8)
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class AmmoTransferComponent: public ActorComponent
{
public:
	int                                                          AmmoCount;                                         // 0xc8(0x4)
	class Actor*                                                 ActorOwner;                                        // 0xd0(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AggressiveGhostShipNamesDataAsset: public DataAsset
{
public:
	TArray<struct AggressiveGhostShipNameBucket>                 NameBuckets;                                       // 0x28(0x10)
};


// Size 0x20 (Full Size[0xb8] - InheritedSize[0x98]
class TaleQuestNumericSwitchStep: public TaleQuestStep
{
public:
	class TaleQuestNumericSwitchStepDesc*                        Desc;                                              // 0x98(0x8)
	interface                                                    CurrentStep;                                       // 0xa0(0x10)
};


// Size 0xb0 (Full Size[0xd8] - InheritedSize[0x28]
class TunnelDependencies: public Object
{
public:
	interface                                                    CrewService;                                       // 0x28(0x10)
	interface                                                    ShipGetter;                                        // 0x38(0x10)
	interface                                                    CrewSpawnLocationsService;                         // 0x48(0x10)
	interface                                                    IslandService;                                     // 0x58(0x10)
	interface                                                    PortalService;                                     // 0x68(0x10)
	interface                                                    TunnelsOfTheDamnedService;                         // 0x78(0x10)
	interface                                                    StreamedLevelService;                              // 0x88(0x10)
	interface                                                    FactionService;                                    // 0x98(0x10)
};


// Size 0x10 (Full Size[0x5b8] - InheritedSize[0x5a8]
class AIEmergentCaptainSpawner: public AIPerCrewSpawner
{
public:
	class NamedAIDataAsset*                                      NamedAIDataAsset;                                  // 0x5b0(0x8)
};


// Size 0x30 (Full Size[0xf8] - InheritedSize[0xc8]
class CutSceneSubtitlesComponent: public ActorComponent
{
public:
	float                                                        SubtitleSphereRadiusInCm;                          // 0xd0(0x4)
	bool                                                         CanDrawDebugSubtitleRadius;                        // 0xd4(0x1)
	float                                                        SubtitleSphereRadiusInCmSqr;                       // 0xf4(0x4)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class WaterSensitiveComponentDataAsset: public DataAsset
{
public:
	struct                                                       HealthChangeInRainPerSecond;                       // 0x28(0x8)
	struct                                                       HealthChangeSubmergedPerSecond;                    // 0x30(0x8)
	struct                                                       HealthChangeWhenDryPerSecond;                      // 0x38(0x8)
	struct                                                       HealthChangeOnLiquidProjectileImpact;              // 0x40(0x8)
};


// Size 0x138 (Full Size[0x500] - InheritedSize[0x3c8]
class CoordinatedCutsceneTrigger: public Actor
{
public:
	class SceneComponent*                                        Root;                                              // 0x3d0(0x8)
	struct FName                                                 CutsceneName;                                      // 0x3d8(0x8)
	bool                                                         ActivationInitiallyEnabled;                        // 0x3e0(0x1)
	bool                                                         AllowInfiniteNumberOfReactivations;                // 0x3e1(0x1)
	int                                                          SpecificNumberOfReactivationsAllowed;              // 0x3e4(0x4)
	bool                                                         ReattemptActivationAfterConflictingCutsceneFinishes; // 0x3e8(0x1)
	struct                                                       CutsceneStartDelayWhenReattemptingActivation;      // 0x3ec(0x8)
	TArray<struct StateChangeCoordination>                       StateChangeCoordination;                           // 0x3f8(0x10)
	multicastinlinedelegate                                      OnCutsceneTriggerStateChangedCallback;             // 0x408(0x10)
	multicastinlinedelegate                                      OnCutsceneTriggerActivationFailedCallback;         // 0x418(0x10)
	class BillboardComponent*                                    EditorOnlyIcon;                                    // 0x4e8(0x8)
	class TextRenderComponent*                                   EditorOnlyCutsceneNameDisplay;                     // 0x4f0(0x8)
	struct                                                       AllEditingPreferences;                             // 0x4f8(0x3)
};


// Size 0x68 (Full Size[0x130] - InheritedSize[0xc8]
class FogTrackerComponent: public ActorComponent
{
public:
	float                                                        FogDensityThreshold;                               // 0xd0(0x4)
};


// Size 0x8b8 (Full Size[0x8e0] - InheritedSize[0x28]
class AthenaGameContext: public Object
{
public:
	class VoiceChatRenderer*                                     VoiceChatRenderer;                                 // 0xb8(0x8)
	class AthenaPlayModeLevelsDataAsset*                         PlayModeLevels;                                    // 0xc0(0x8)
	class FeatureToggledLevelsDataAsset*                         FeatureToggledLevels;                              // 0xc8(0x8)
	class GameInstance*                                          PrimaryGameInstance;                               // 0x280(0x8)
	class AthenaServerIdentityManager*                           AthenaServerIdentityManager;                       // 0x288(0x8)
	struct                                                       ServiceCoordinator;                                // 0x290(0x20)
	class AthenaLocalPlayerManager*                              AthenaLocalPlayerManager;                          // 0x530(0x8)
	class AthenaLocalPlayerReengage*                             AthenaLocalPlayerReengage;                         // 0x538(0x8)
	class GameNarrationCoordinator*                              GameNarrationCoordinator;                          // 0x540(0x8)
	class ApplicationSettings*                                   ApplicationSettings;                               // 0x548(0x8)
};


// Size 0x300 (Full Size[0x328] - InheritedSize[0x28]
class LightingControllerSettings: public DataAsset
{
public:
	class CurveFloat*                                            FogDensityCurve;                                   // 0x28(0x8)
	class CurveFloat*                                            FogStartDistanceCurve;                             // 0x30(0x8)
	class CurveFloat*                                            LightIntensityCurve;                               // 0x38(0x8)
	class CurveFloat*                                            SkyDomeBrightnessCurve;                            // 0x40(0x8)
	class CurveFloat*                                            SkyDomeMoonVisibilityCurve;                        // 0x48(0x8)
	class CurveFloat*                                            SkyDomeStarBrightnessCurve;                        // 0x50(0x8)
	class CurveFloat*                                            SkyDomeSunBrightnessCurve;                         // 0x58(0x8)
	class CurveFloat*                                            PostLPVIntensityCurve;                             // 0x60(0x8)
	class CurveFloat*                                            PostExposureBiasCurve;                             // 0x68(0x8)
	class CurveFloat*                                            PostLPVOcclusionIntensityCurve;                    // 0x70(0x8)
	class CurveFloat*                                            SkyLightIntensityCurve;                            // 0x78(0x8)
	class CurveFloat*                                            FogBrightnessNearCurve;                            // 0x80(0x8)
	class CurveFloat*                                            FogBrightnessFarCurve;                             // 0x88(0x8)
	class CurveFloat*                                            PostBloomIntensityCurve;                           // 0x90(0x8)
	class CurveFloat*                                            PostBloomThresholdCurve;                           // 0x98(0x8)
	class CurveFloat*                                            SkyDomeAuraBrightnessCurve;                        // 0xa0(0x8)
	class CurveFloat*                                            PostReflectionProbeBrightnessCurve;                // 0xa8(0x8)
	class CurveFloat*                                            PostReflectionProbeShadowBrightnessCurve;          // 0xb0(0x8)
	class CurveFloat*                                            VfxControllerCurve;                                // 0xb8(0x8)
	class CurveFloat*                                            FogMaxOpacityCurve;                                // 0xc0(0x8)
	class CurveFloat*                                            FogScatterExpCurve;                                // 0xc8(0x8)
	class CurveFloat*                                            FogUnderwaterDensityCurve;                         // 0xd0(0x8)
	class CurveFloat*                                            PostLensFlareIntensityCurve;                       // 0xd8(0x8)
	class CurveFloat*                                            EmissiveFoliageCurve;                              // 0xe0(0x8)
	class CurveFloat*                                            EmissiveLightsCurve;                               // 0xe8(0x8)
	class CurveFloat*                                            PostExposureMinBrightnessCurve;                    // 0xf0(0x8)
	class CurveFloat*                                            PostExposureMaxBrightnessCurve;                    // 0xf8(0x8)
	class CurveFloat*                                            SkyDomeMoonBrightnessCurve;                        // 0x100(0x8)
	class CurveFloat*                                            SkyDomeHorizonCloudBrightnessCurve;                // 0x108(0x8)
	class CurveFloat*                                            SkyDomeGreenFlashStrengthCurve;                    // 0x110(0x8)
	class CurveFloat*                                            PostSaturationCurve;                               // 0x118(0x8)
	class CurveFloat*                                            PostContrastCurve;                                 // 0x120(0x8)
	class CurveFloat*                                            CloudRimlightScaleCurve;                           // 0x128(0x8)
	class CurveFloat*                                            CloudSkylightScaleCurve;                           // 0x130(0x8)
	class CurveFloat*                                            CloudSunlightScaleCurve;                           // 0x138(0x8)
	class CurveFloat*                                            CloudGlobalPressureCurve;                          // 0x140(0x8)
	class CurveFloat*                                            PostUnderWaterBrightnessCurve;                     // 0x148(0x8)
	class CurveFloat*                                            VfxCloudBrightnessCurve;                           // 0x150(0x8)
	class CurveFloat*                                            LightGodRayIntensityCurve;                         // 0x158(0x8)
	class CurveFloat*                                            CloudBottomBrightnessCurve;                        // 0x160(0x8)
	class CurveFloat*                                            CloudSunlightShadowingCurve;                       // 0x168(0x8)
	class CurveFloat*                                            SunDiscScaleCurve;                                 // 0x170(0x8)
	class CurveFloat*                                            WaterSpecularBrightnessCurve;                      // 0x178(0x8)
	class CurveFloat*                                            VfxAmbientScaleCurve;                              // 0x180(0x8)
	class CurveFloat*                                            CloudShadowBrightnessCurve;                        // 0x188(0x8)
	class CurveFloat*                                            StormCloudShadowBrightnessCurve;                   // 0x190(0x8)
	class CurveFloat*                                            StormPostBloomIntensityCurve;                      // 0x198(0x8)
	class CurveFloat*                                            StormPostBloomThresholdCurve;                      // 0x1a0(0x8)
	class CurveFloat*                                            DirectionalLightShadowSteppingRateCurve;           // 0x1a8(0x8)
	class CurveFloat*                                            SkullBrightnessCurve;                              // 0x1b0(0x8)
	class CurveLinearColor*                                      FogColourAwayCurve;                                // 0x1b8(0x8)
	class CurveLinearColor*                                      FogColourTowardsCurve;                             // 0x1c0(0x8)
	class CurveLinearColor*                                      LightSunColourCurve;                               // 0x1c8(0x8)
	class CurveLinearColor*                                      SkyDomeHorizonColourCurve;                         // 0x1d0(0x8)
	class CurveLinearColor*                                      SkyDomeZenithColourCurve;                          // 0x1d8(0x8)
	class CurveLinearColor*                                      SkyLightColourCurve;                               // 0x1e0(0x8)
	class CurveLinearColor*                                      PostAmbientShadowColourCurve;                      // 0x1e8(0x8)
	class CurveLinearColor*                                      FogColourAwayFarCurve;                             // 0x1f0(0x8)
	class CurveLinearColor*                                      FogColourUnderwaterCurve;                          // 0x1f8(0x8)
	class CurveLinearColor*                                      FogColourAwayUnderwaterCurve;                      // 0x200(0x8)
	class CurveLinearColor*                                      WaterColourCurve;                                  // 0x208(0x8)
	class CurveLinearColor*                                      WaterColourShallowCurve;                           // 0x210(0x8)
	class CurveLinearColor*                                      WaterBackLitColourCurve;                           // 0x218(0x8)
	class CurveLinearColor*                                      WaterFoamColourCurve;                              // 0x220(0x8)
	class CurveLinearColor*                                      WaterFoamHighlightColourCurve;                     // 0x228(0x8)
	class CurveLinearColor*                                      WaterAmbientColourCurve;                           // 0x230(0x8)
	class CurveLinearColor*                                      PostReflectionProbeTintCurve;                      // 0x238(0x8)
	class CurveLinearColor*                                      CloudRimlightColourCurve;                          // 0x240(0x8)
	class CurveLinearColor*                                      CloudSkylightColourCurve;                          // 0x248(0x8)
	class CurveLinearColor*                                      CloudSunlightColourCurve;                          // 0x250(0x8)
	class CurveLinearColor*                                      PostUnderWaterTintCurve;                           // 0x258(0x8)
	class CurveLinearColor*                                      SkyDomeMoonColourCurve;                            // 0x260(0x8)
	class CurveLinearColor*                                      PostGammaCurve;                                    // 0x268(0x8)
	class CurveLinearColor*                                      SkyDomeSunColourCurve;                             // 0x270(0x8)
	class CurveLinearColor*                                      VFXFoamColourCurve;                                // 0x278(0x8)
	class CurveLinearColor*                                      VFXWindColourCurve;                                // 0x280(0x8)
	class CurveLinearColor*                                      VFXUnderwaterTintCurve;                            // 0x288(0x8)
	class CurveLinearColor*                                      StormRainColourCurve;                              // 0x290(0x8)
	class CurveLinearColor*                                      StormSkyLightColourCurve;                          // 0x298(0x8)
	class CurveLinearColor*                                      StormPostGammaCurve;                               // 0x2a0(0x8)
	class CurveLinearColor*                                      StormFogColourUnderwaterCurve;                     // 0x2a8(0x8)
	class CurveLinearColor*                                      StormFogColourAwayUnderwaterCurve;                 // 0x2b0(0x8)
	class CurveLinearColor*                                      StormWaterColourCurve;                             // 0x2b8(0x8)
	class CurveLinearColor*                                      StormWaterColourShallowCurve;                      // 0x2c0(0x8)
	class CurveLinearColor*                                      StormWaterBackLitColourCurve;                      // 0x2c8(0x8)
	class CurveLinearColor*                                      StormWaterFoamColourCurve;                         // 0x2d0(0x8)
	class CurveLinearColor*                                      StormWaterFoamHighlightColourCurve;                // 0x2d8(0x8)
	class CurveLinearColor*                                      StormWaterAmbientColourCurve;                      // 0x2e0(0x8)
	class CurveLinearColor*                                      StormPostReflectionProbeTintCurve;                 // 0x2e8(0x8)
	class CurveLinearColor*                                      SkullEyeColourCurve;                               // 0x2f0(0x8)
	struct                                                       SandColourStatic;                                  // 0x2f8(0x10)
	float                                                        FogUnderwaterMaxOpacityStatic;                     // 0x308(0x4)
	float                                                        FogUnderwaterScatterExpStatic;                     // 0x30c(0x4)
	float                                                        FogUnderwaterStartDistanceStatic;                  // 0x310(0x4)
	float                                                        FogUnderwaterBrightnessNearStatic;                 // 0x314(0x4)
	float                                                        FogUnderwaterBrightnessFarStatic;                  // 0x318(0x4)
	float                                                        FogDirectionalInscatteringStartStatic;             // 0x31c(0x4)
	float                                                        FogUnderwaterDirectionalInscatteringStartStatic;   // 0x320(0x4)
	float                                                        UnderwaterDirectionalLightMinBrightnessStatic;     // 0x324(0x4)
};


// Size 0xb8 (Full Size[0x480] - InheritedSize[0x3c8]
class SkeletonActionStateCreatorDefinition: public ActionStateCreatorDefinition
{
public:
	struct                                                       AISpawnParams;                                     // 0x3c8(0x10)
	struct                                                       AIDeadParams;                                      // 0x3d8(0x4)
	struct                                                       UseItemParams;                                     // 0x3dc(0x1)
	struct                                                       UseCannonParams;                                   // 0x3e0(0x60)
	struct                                                       RepairObjectParams;                                // 0x440(0x8)
	struct                                                       ControlObjectParams;                               // 0x448(0x18)
	struct                                                       HiddenStateParams;                                 // 0x460(0x5)
};


// Size 0x28 (Full Size[0xf0] - InheritedSize[0xc8]
class IntentCombinerComponent: public ActorComponent
{
public:
	float                                                        CooperationMultiplier;                             // 0xc8(0x4)
	float                                                        StartMovingThreshold;                              // 0xcc(0x4)
	float                                                        StopMovingThreshold;                               // 0xd0(0x4)
	float                                                        ConflictedStartMovingThreshold;                    // 0xd4(0x4)
	float                                                        ConflictedStopMovingThreshold;                     // 0xd8(0x4)
	TArray<class Object*>                                        IntentProviders;                                   // 0xe0(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class CutsceneAnimationDataAsset: public DataAsset
{
public:
	TArray<struct CutsceneAnimationElement>                      CutsceneElements;                                  // 0x30(0x10)
};


// Size 0x2d8 (Full Size[0x6a0] - InheritedSize[0x3c8]
class ShipService: public Actor
{
public:
	struct                                                       PersistentCrewShipData;                            // 0x408(0x10)
	TArray<struct WeakActorHandle>                               ShipList;                                          // 0x418(0x10)
	TArray<struct CrewShipEntry>                                 CrewedShips;                                       // 0x428(0x10)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class ShipActivityComponent: public ActorComponent
{
public:
	bool                                                         ShipInPvEEncounter;                                // 0xd0(0x1)
};


// Size 0x7a0 (Full Size[0xcd0] - InheritedSize[0x530]
class AthenaGameState: public ServiceProviderGameState
{
public:
	class WindService*                                           WindService;                                       // 0x5a8(0x8)
	class PlayerManagerService*                                  PlayerManagerService;                              // 0x5b0(0x8)
	class ShipService*                                           ShipService;                                       // 0x5b8(0x8)
	class WatercraftService*                                     WatercraftService;                                 // 0x5c0(0x8)
	class TimeService*                                           TimeService;                                       // 0x5c8(0x8)
	class HealthCustomizationService*                            HealthService;                                     // 0x5d0(0x8)
	class CustomWeatherService*                                  CustomWeatherService;                              // 0x5d8(0x8)
	class CustomStatusesService*                                 CustomStatusesService;                             // 0x5e0(0x8)
	class FFTWaterService*                                       WaterService;                                      // 0x5e8(0x8)
	class StormService*                                          StormService;                                      // 0x5f0(0x8)
	class CrewService*                                           CrewService;                                       // 0x5f8(0x8)
	class CaptainedSessionService*                               CaptainedSessionService;                           // 0x600(0x8)
	class ContestZoneService*                                    ContestZoneService;                                // 0x608(0x8)
	class IslandService*                                         IslandService;                                     // 0x610(0x8)
	class NPCService*                                            NPCService;                                        // 0x618(0x8)
	class SkellyFortService*                                     SkellyFortService;                                 // 0x620(0x8)
	class DeepSeaRegionService*                                  DeepSeaRegionService;                              // 0x628(0x8)
	class AIActionSpotService*                                   AIActionSpotService;                               // 0x630(0x8)
	class AIDioramaService*                                      AIDioramaService;                                  // 0x638(0x8)
	class AshenLordEncounterService*                             AshenLordEncounterService;                         // 0x640(0x8)
	class AggressiveGhostShipsEncounterService*                  AggressiveGhostShipsEncounterService;              // 0x648(0x8)
	class TallTaleService*                                       TallTaleService;                                   // 0x650(0x8)
	class AIShipObstacleService*                                 AIShipObstacleService;                             // 0x658(0x8)
	class AIShipService*                                         AIShipService;                                     // 0x660(0x8)
	class AITargetService*                                       AITargetService;                                   // 0x668(0x8)
	class ShipLiveryCatalogueService*                            ShipLiveryCatalogueService;                        // 0x670(0x8)
	class DrawDebugService*                                      DrawDebugService;                                  // 0x678(0x8)
	class WorldEventZoneService*                                 WorldEventZoneService;                             // 0x680(0x8)
	class WorldResourceRegistry*                                 WorldResourceRegistry;                             // 0x688(0x8)
	class KrakenService*                                         KrakenService;                                     // 0x690(0x8)
	class PlayerNameService*                                     PlayerNameService;                                 // 0x698(0x8)
	class TinySharkService*                                      TinySharkService;                                  // 0x6a0(0x8)
	class ReapersTributeShipEventService*                        ReapersTributeShipEventService;                    // 0x6a8(0x8)
	class SkeletonCampService*                                   SkeletonCampService;                               // 0x6b0(0x8)
	class ProjectileService*                                     ProjectileService;                                 // 0x6b8(0x8)
	class ProjectileHitRegService*                               ProjectileHitRegService;                           // 0x6c0(0x8)
	class LaunchableProjectileService*                           LaunchableProjectileService;                       // 0x6c8(0x8)
	class ServerNotificationsService*                            ServerNotificationsService;                        // 0x6d0(0x8)
	class AIManagerService*                                      AIManagerService;                                  // 0x6d8(0x8)
	class AIEncounterService*                                    AIEncounterService;                                // 0x6e0(0x8)
	class AIEncounterGenerationService*                          AIEncounterGenerationService;                      // 0x6e8(0x8)
	class EncounterService*                                      EncounterService;                                  // 0x6f0(0x8)
	class GameEventSchedulerService*                             GameEventSchedulerService;                         // 0x6f8(0x8)
	class GameEventsOnDemandAvailabilityService*                 GameEventsOnDemandAvailabilityService;             // 0x700(0x8)
	class GameEventsOnDemandLoserTunnelService*                  GameEventsOnDemandLoserTunnelService;              // 0x708(0x8)
	class HideoutService*                                        HideoutService;                                    // 0x710(0x8)
	class AthenaStreamedLevelService*                            StreamedLevelService;                              // 0x718(0x8)
	class LocationProviderService*                               LocationProviderService;                           // 0x720(0x8)
	class HoleService*                                           HoleService;                                       // 0x728(0x8)
	class PlayerBuriedItemService*                               PlayerBuriedItemService;                           // 0x730(0x8)
	class LoadoutService*                                        LoadoutService;                                    // 0x738(0x8)
	class OcclusionService*                                      OcclusionService;                                  // 0x740(0x8)
	class PetsService*                                           PetsService;                                       // 0x748(0x8)
	class AthenaAITeamsService*                                  AthenaAITeamsService;                              // 0x750(0x8)
	class AllianceService*                                       AllianceService;                                   // 0x758(0x8)
	class MaterialAccessibilityService*                          MaterialAccessibilityService;                      // 0x760(0x8)
	class NPCLoadedOnClientService*                              NPCLoadedOnClientService;                          // 0x768(0x8)
	class ReapersMarkService*                                    ReapersMarkService;                                // 0x770(0x8)
	class EmissaryLevelService*                                  EmissaryLevelService;                              // 0x778(0x8)
	class FactionService*                                        FactionService;                                    // 0x780(0x8)
	class CampaignService*                                       CampaignService;                                   // 0x788(0x8)
	class StoryService*                                          StoryService;                                      // 0x790(0x8)
	class StorySpawnedActorsService*                             StorySpawnedActorsService;                         // 0x798(0x8)
	class StoryClaimedResourcesService*                          StoryClaimedResourcesService;                      // 0x7a0(0x8)
	class GlobalVoyageDirectorService*                           GlobalVoyageDirector;                              // 0x7a8(0x8)
	class UtilityVoyageService*                                  UtilityVoyageService;                              // 0x7b0(0x8)
	class FlamesOfFateSettingsService*                           FlamesOfFateSettingsService;                       // 0x7b8(0x8)
	class ServiceStatusNotificationsService*                     ServiceStatusNotificationsService;                 // 0x7c0(0x8)
	class MigrationService*                                      MigrationService;                                  // 0x7c8(0x8)
	class ShipStockService*                                      ShipStockService;                                  // 0x7d0(0x8)
	class ShroudBreakerService*                                  ShroudBreakerService;                              // 0x7d8(0x8)
	class ServerUpdateReportingService*                          ServerUpdateReportingService;                      // 0x7e0(0x8)
	class GenericMarkerService*                                  GenericMarkerService;                              // 0x7e8(0x8)
	class MechanismsService*                                     MechanismsService;                                 // 0x7f0(0x8)
	class MerchantContractsService*                              MerchantContractsService;                          // 0x7f8(0x8)
	class ShipFactory*                                           ShipFactory;                                       // 0x800(0x8)
	class RewindPhysicsService*                                  RewindPhysicsService;                              // 0x808(0x8)
	class NotificationMessagesDataAsset*                         NotificationMessagesDataAsset;                     // 0x810(0x8)
	class ProjectileCooldownService*                             ProjectileCooldownService;                         // 0x818(0x8)
	class IslandReservationService*                              IslandReservationService;                          // 0x820(0x8)
	class PortalService*                                         PortalService;                                     // 0x828(0x8)
	class MeshMemoryConstraintService*                           MeshMemoryConstraintService;                       // 0x830(0x8)
	class BootyStorageService*                                   BootyStorageService;                               // 0x838(0x8)
	class LoadoutCostService*                                    LoadoutCostService;                                // 0x840(0x8)
	class SpireService*                                          SpireService;                                      // 0x848(0x8)
	class FireworkService*                                       FireworkService;                                   // 0x850(0x8)
	class InvasionService*                                       InvasionService;                                   // 0x858(0x8)
	class AirGivingService*                                      AirGivingService;                                  // 0x860(0x8)
	class CutsceneService*                                       CutsceneService;                                   // 0x868(0x8)
	class CargoRunService*                                       CargoRunService;                                   // 0x870(0x8)
	class CommodityDemandService*                                CommodityDemandService;                            // 0x878(0x8)
	class DebugTeleportationDestinationService*                  DebugTeleportationDestinationService;              // 0x880(0x8)
	class SeasonProgressionUIService*                            SeasonProgressionUIService;                        // 0x888(0x8)
	class TransientActorService*                                 TransientActorService;                             // 0x890(0x8)
	class TunnelsOfTheDamnedService*                             TunnelsOfTheDamnedService;                         // 0x898(0x8)
	class WorldSequenceService*                                  WorldSequenceService;                              // 0x8a0(0x8)
	class ItemLifetimeManagerService*                            ItemLifetimeManagerService;                        // 0x8a8(0x8)
	class ShipStorageJettisonService*                            ShipStorageJettisonService;                        // 0x8b0(0x8)
	class SeaFortsService*                                       SeaFortsService;                                   // 0x8b8(0x8)
	class CustomServerLocalisationService*                       CustomServerLocalisationService;                   // 0x8c0(0x8)
	class BeckonService*                                         BeckonService;                                     // 0x8c8(0x8)
	class VolcanoService*                                        VolcanoService;                                    // 0x8d0(0x8)
	class ShipAnnouncementService*                               ShipAnnouncementService;                           // 0x8d8(0x8)
	class ShipsLogService*                                       ShipsLogService;                                   // 0x8e0(0x8)
	class AsyncLoadingMonitoringService*                         AsyncLoadingMonitoringService;                     // 0x8e8(0x8)
	class ActorOfInterestService*                                ActorOfInterestService;                            // 0x8f0(0x8)
	class EnemyAIOnShipService*                                  EnemyAIOnShipService;                              // 0x8f8(0x8)
	class UserSettingsService*                                   UserSettingsService;                               // 0x900(0x8)
	class GuildService*                                          GuildService;                                      // 0x908(0x8)
	class GuildChroniclesService*                                GuildChroniclesService;                            // 0x910(0x8)
	class PlayerLootMarkerService*                               PlayerLootMarkerService;                           // 0x918(0x8)
	class BoneCallerService*                                     BoneCallerService;                                 // 0x920(0x8)
	class InventoryPersistenceService*                           InventoryPersistenceService;                       // 0x928(0x8)
	class AdventureOnDemandService*                              AdventureOnDemandService;                          // 0x930(0x8)
	class ScrambledNamesService*                                 ScrambledNamesService;                             // 0x938(0x8)
	class ExperienceService*                                     ExperienceService;                                 // 0x940(0x8)
	class QuestTableService*                                     QuestTableService;                                 // 0x948(0x8)
	class CompetitiveVoyagesService*                             CompetitiveVoyagesService;                         // 0x950(0x8)
	class SaferSeasDataAssetProviderService*                     SaferSeasDataAssetProviderService;                 // 0x958(0x8)
	class PlayerStreamedLevelService*                            PlayerStreamedLevelService;                        // 0x960(0x8)
	struct                                                       ServiceCoordinator;                                // 0xb28(0x20)
	TArray<class Interface*>                                     ChatComponents;                                    // 0xb70(0x10)
	bool                                                         IsXboxGamePadOnlyServer;                           // 0xc18(0x1)
	struct                                                       IsSoloSeasServer;                                  // 0xc19(0x2)
	bool                                                         IsCrossplayEnabledOnServer;                        // 0xc1b(0x1)
	bool                                                         ShouldDisableAsyncOcclusionCheck;                  // 0xc1c(0x1)
	struct FString                                               SubPlayMode;                                       // 0xc20(0x10)
	class CustomVaultService*                                    CustomVaultService;                                // 0xc30(0x8)
	class EntityEnumerationService*                              EntityEnumerationService;                          // 0xc38(0x8)
	class LevelAssetCachingService*                              LevelAssetCachingService;                          // 0xc40(0x8)
	class CrewSkillRatingService*                                CrewSkillRatingService;                            // 0xc48(0x8)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class WaitForMechanismActivationStep: public TaleQuestStep
{
public:
	class WaitForMechanismActivationStepDesc*                    Desc;                                              // 0x98(0x8)
};


// Size 0xb8 (Full Size[0x180] - InheritedSize[0xc8]
class BodyLightControllerComponent: public ActorComponent
{
public:
	class CurveFloat*                                            HourOfDayToIntensityMultiplierCurve;               // 0xc8(0x8)
	float                                                        BaseLightIntensity;                                // 0xd0(0x4)
	float                                                        IntensitySpringAccel;                              // 0xd4(0x4)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class GrenadeSetupDataAsset: public DataAsset
{
public:
	struct                                                       ServerThrowOffset;                                 // 0x28(0xc)
	struct                                                       FirstPersonThrowOffset;                            // 0x34(0xc)
	class CurveFloat*                                            PitchToProjectileSpeedCurve;                       // 0x40(0x8)
	class CurveFloat*                                            ProjectileSpeedToAngleVarianceCurve;               // 0x48(0x8)
	float                                                        ProjectileGravityScale;                            // 0x50(0x4)
	class CurveFloat*                                            ExtraPitchCurve;                                   // 0x58(0x8)
	float                                                        MinPitch;                                          // 0x60(0x4)
	float                                                        MaxPitch;                                          // 0x64(0x4)
	float                                                        PlayerSpeedModifier;                               // 0x68(0x4)
	float                                                        FirstPersonScaleModifier;                          // 0x6c(0x4)
	float                                                        TimeToPreventThrowingAfterLeavingConcealment;      // 0x70(0x4)
	float                                                        TimeToEquip;                                       // 0x74(0x4)
	float                                                        MinTimeBetweenOfferingAndThrowing;                 // 0x78(0x4)
	float                                                        TimeToConsumePostThrow;                            // 0x7c(0x4)
	bool                                                         UseVisualThrowOffset;                              // 0x80(0x1)
	float                                                        AIThrowDelayTime;                                  // 0x84(0x4)
	float                                                        AIThrowProjectileSpeed;                            // 0x88(0x4)
	bool                                                         AIThrowPreferHigherAngles;                         // 0x8c(0x1)
};


// Size 0x20 (Full Size[0x3e8] - InheritedSize[0x3c8]
class FogBankManager: public Actor
{
public:
	TArray<struct FeatureToggledFogBankManagerAsset>             FeatureToggledManagerAssetsArray;                  // 0x3c8(0x10)
	class FogBankManagerDataAsset*                               DefaultFogBankManagerDataAsset;                    // 0x3d8(0x8)
	class FogBankManagerDataAsset*                               ActiveFogBankManagerDataAsset;                     // 0x3e0(0x8)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class AddNPCOnShipStepDesc: public TaleQuestStepDesc
{
public:
	class NPCOnShipDataAsset*                                    NPCOnShipDataAsset;                                // 0x80(0x8)
	struct                                                       NPCOnShipManager;                                  // 0x88(0x30)
	struct                                                       PhaseClusterToSpawnFor;                            // 0xb8(0x30)
};


// Size 0xa8 (Full Size[0x170] - InheritedSize[0xc8]
class LegendOfTheSunkenKingdomVoyageOwnershipComponent: public ActorComponent
{
public:
	TArray<struct LegendOfTheSunkenKingdomPrerequisite>          Prerequisites;                                     // 0xd0(0x10)
	struct                                                       PirateIdentity;                                    // 0xe0(0x78)
	TArray<int>                                                  SatisfiedPrerequisites;                            // 0x160(0x10)
};


// Size 0xa8 (Full Size[0x470] - InheritedSize[0x3c8]
class GhostShipDoor: public Actor
{
public:
	multicastinlinedelegate                                      OnDoorOpenedDelegate;                              // 0x3d0(0x10)
	TArray<struct OpenForListEntry>                              OpenForList;                                       // 0x3e0(0x10)
	float                                                        DoorFullyOpenTimer;                                // 0x3f0(0x4)
	class ClientSkeletalMeshComponent*                           DoorMesh;                                          // 0x3f8(0x8)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterialInstances;                          // 0x400(0x10)
	class AnimSequence*                                          DoorOpeningAnimation;                              // 0x410(0x8)
	class WwiseEvent*                                            DoorOpeningSfx;                                    // 0x418(0x8)
	struct                                                       DoorBoundingVolume;                                // 0x420(0x1c)
	struct                                                       MaxBoundingVolume;                                 // 0x43c(0xc)
	float                                                        DoorDeformationWhenFullyOpen;                      // 0x448(0x4)
	bool                                                         BlockPlayerLeftGhostshipDelegate;                  // 0x44c(0x1)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class AthenaItemsSettings: public DeveloperSettings
{
public:
	char                                                         ProjectileCollisionChannel;                        // 0x38(0x1)
	char                                                         ThrowableCollisionChannel;                         // 0x39(0x1)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class CannonDescAsset: public ShipPartDescAsset
{
public:
	struct                                                       CannonDesc;                                        // 0x28(0x30)
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class CustomAnimationHandlerComponent: public ActorComponent
{
public:
	TArray<struct StringAssetReference>                          CurrentCustomAnimationDataAssetReferences;         // 0xd8(0x10)
	struct                                                       RequestedLoopingAnim;                              // 0xe8(0x10)
	class AthenaAnimationCustomSkeletonAnimationData*            MergedCustomAnimationData;                         // 0xf8(0x8)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AdjustableWaterLevelPuzzleAudioParams: public DataAsset
{
public:
	class WwiseObjectPoolWrapper*                                WaterLevelPuzzlePool;                              // 0x28(0x8)
	class WwiseEvent*                                            PuzzleWaterRiseStartEvent;                         // 0x30(0x8)
	class WwiseEvent*                                            PuzzleWaterRiseEndEvent;                           // 0x38(0x8)
	class WwiseEvent*                                            PuzzleWaterFallStartEvent;                         // 0x40(0x8)
	class WwiseEvent*                                            PuzzleWaterFallEndEvent;                           // 0x48(0x8)
};


// Size 0x8 (Full Size[0x2b8] - InheritedSize[0x2b0]
class HarpoonInputComponent: public MountedWeaponAimAndFireInputComponent
{
public:
	class HarpoonLauncher*                                       HarpoonLauncher;                                   // 0x2b0(0x8)
};


// Size 0xb8 (Full Size[0x138] - InheritedSize[0x80]
class BasePlayNpcAnimationStepDesc: public TaleQuestStepDesc
{
public:
	struct                                                       PlaceableReaction;                                 // 0x80(0x30)
	struct                                                       CutSceneActor;                                     // 0xb0(0x30)
	struct FName                                                 AnimationNameToPlay;                               // 0xe0(0x8)
	float                                                        SubtitleMaxDistance;                               // 0xe8(0x4)
	bool                                                         UseServerDrivenDialogue;                           // 0xec(0x1)
	class SceneDialogueData*                                     DialogueData;                                      // 0xf0(0x8)
	class UClass*                                                LocalMusicZone;                                    // 0xf8(0x8)
	bool                                                         PreventServerMigration;                            // 0x100(0x1)
	struct                                                       PhaseClusterToSpawnFor;                            // 0x108(0x30)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class StatusResponseBallast: public StatusResponse
{
public:
	float                                                        WaterLevel;                                        // 0x30(0x4)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class PlayerActivitySettings: public DeveloperSettings
{
public:
	struct                                                       PlayerActivityLifetimeRulesCatalogue;              // 0x38(0x10)
	struct                                                       PlayerActivityIconCatalogue;                       // 0x48(0x10)
	float                                                        NameplateMaxVisibilityDistance;                    // 0x58(0x4)
};


// Size 0x88 (Full Size[0xb0] - InheritedSize[0x28]
class MeleeWeaponDataAsset: public DataAsset
{
public:
	float                                                        PlayerAttackSelectionTime;                         // 0x28(0x4)
	class MeleeWeaponMovementSpeedConfig*                        MovementSpeedConfig;                               // 0x30(0x8)
	TArray<class MeleeAttackDataAsset*>                          ComboAttacks;                                      // 0x38(0x10)
	class MeleeAttackDataAsset*                                  HeavyAttack;                                       // 0x48(0x8)
	float                                                        HeavyAttackChargeDuration;                         // 0x50(0x4)
	TArray<struct MeleeWeaponSpecialAttackData>                  SpecialAttacks;                                    // 0x58(0x10)
	struct                                                       BlockingParameters;                                // 0x68(0x4)
	class PhysicalMaterial*                                      BlockingPhysicalMaterial;                          // 0x70(0x8)
	char                                                         BlockingMovementSpeed;                             // 0x78(0x1)
	float                                                        HitBlockingMovementDisableTime;                    // 0x7c(0x4)
	class ParticleSystem*                                        TrailParticleSystem_FP;                            // 0x80(0x8)
	class ParticleSystem*                                        TrailParticleSystem_TP;                            // 0x88(0x8)
	struct FName                                                 TrailStartSocketName;                              // 0x90(0x8)
	struct FName                                                 TrailEndSocketName;                                // 0x98(0x8)
	char                                                         TrailWidthMode;                                    // 0xa0(0x1)
	float                                                        TrailWidth;                                        // 0xa4(0x4)
	float                                                        PerceptionHearingRange;                            // 0xa8(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AssetListDataAsset: public DataAsset
{
public:
	TArray<struct StringAssetReference>                          AssetList;                                         // 0x28(0x10)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class StatusResponseEmote: public StatusResponse
{
public:
	struct FName                                                 EmoteIdentifier;                                   // 0x30(0x8)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class LoadoutAsset: public DataAsset
{
public:
	struct                                                       ItemLoadout;                                       // 0x28(0x20)
	struct FName                                                 FeatureName;                                       // 0x48(0x8)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class ClothingLoadoutContainsItemRadialContext: public RadialContextBase
{
public:
	class UClass*                                                TargetItem;                                        // 0x28(0x8)
	TArray<class Class*>                                         MustAlsoBeWearing;                                 // 0x30(0x10)
	TArray<class Class*>                                         MustNotBeWearing;                                  // 0x40(0x10)
};


// Size 0x68 (Full Size[0x430] - InheritedSize[0x3c8]
class SharedObjectReplicationService: public Actor
{
public:
	map                                                          ReplicatedObjects;                                 // 0x3d0(0x50)
	TArray<class Object*>                                        RepArray;                                          // 0x420(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class NPCDialogConditional: public Object
{
public:
	bool                                                         ConditionalExpected;                               // 0x28(0x1)
};


// Size 0x3d8 (Full Size[0x400] - InheritedSize[0x28]
class GameEventSchedulerService: public Object
{
public:
	class GameEventSchedulerSettingsAsset*                       Settings;                                          // 0x40(0x8)
	TArray<struct GameEventSchedulerMainConfig>                  Configs_OldVersion;                                // 0x110(0x10)
	TArray<struct GameEventSchedulerMainConfig>                  NextConfigs;                                       // 0x128(0x10)
	class World*                                                 World;                                             // 0x138(0x8)
	TArray<struct GameEventCount>                                AvailableEventsForNextConfig;                      // 0x190(0x10)
	TArray<struct GameEventExclusionZone>                        EventExclusionZones;                               // 0x1b0(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class InvasionTunnelDioramaLimitedQuantitySpawnCondition: public InvasionTunnelDioramaSpawnCondition
{
public:
	int                                                          MaximumActiveAtOnce;                               // 0x28(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class DioramaDebugMenuEntries: public DataAsset
{
public:
	TArray<struct DioramaDebugMenuEntry>                         Dioramas;                                          // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class RevealRequirement: public Object
{
public:
	TArray<class RevealRequirement*>                             OR_Requirements;                                   // 0x28(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class PlayerBuriedItemServiceMapStorePopulator: public Object
{
public:
	class PlayerBuriedItemServiceMapStorePopulatorDataAsset*     DataAsset;                                         // 0x28(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ShipAssetClassDatabaseService: public Object
{
public:
	class StringToAssetClassMap*                                 StringToAssetClassMap;                             // 0x30(0x8)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class WaitForTunnelOfTheDamnedMigrationTaleQuestStepDesc: public TaleQuestStepDesc
{
public:
	char                                                         ExpectedSourcePlayMode;                            // 0x80(0x1)
	struct FString                                               ExpectedSourceSubMode;                             // 0x88(0x10)
	char                                                         ExpectedDestinationPlayMode;                       // 0x98(0x1)
	struct FString                                               ExpectedDestinationSubMode;                        // 0xa0(0x10)
};


// Size 0x10 (Full Size[0x70] - InheritedSize[0x60]
class BlockVolcanoTaleQuestService: public TaleQuestService
{
public:
	class BlockVolcanoTaleQuestServiceDesc*                      Desc;                                              // 0x60(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class PirateLegendSectionBundle: public DataAsset
{
public:
	struct FName                                                 FeatureName;                                       // 0x28(0x8)
	TArray<struct PLSectionBundleEntry>                          Entries;                                           // 0x30(0x10)
};


// Size 0xb8 (Full Size[0x480] - InheritedSize[0x3c8]
class PledgeToReapersVoteInteractionActor: public Actor
{
public:
	class BoxedRpcDispatcherComponent*                           BoxedRpcDispatcherComponent;                       // 0x3d0(0x8)
	class PledgeToReapersVoteAudioComponent*                     PledgeToReapersVoteAudioComponent;                 // 0x3d8(0x8)
};


// Size 0x68 (Full Size[0x440] - InheritedSize[0x3d8]
class PossessionsChestInteraction: public ModalInteraction
{
public:
	char                                                         PossessionsChestType;                              // 0x3d8(0x1)
};


// Size 0x110 (Full Size[0x138] - InheritedSize[0x28]
class VoyageGeneratorSimResult: public Object
{
public:
	struct                                                       StartingLocation;                                  // 0x128(0xc)
};


// Size 0xf0 (Full Size[0x930] - InheritedSize[0x840]
class BlendedPostProcessingZoneComponentBase: public PostProcessComponent
{
public:
	class CurveFloat*                                            FadeCurveNormalised;                               // 0x850(0x8)
	float                                                        BlendDistance;                                     // 0x858(0x4)
};


// Size 0xd0 (Full Size[0x198] - InheritedSize[0xc8]
class PuzzleStatueVFXComponent: public ActorComponent
{
public:
	class ParticleSystemComponent*                               LockPositionParticleSystem;                        // 0x118(0x8)
	class ParticleSystemComponent*                               OneShotLockPositionParticleSystem;                 // 0x120(0x8)
	class ParticleSystemComponent*                               BroadcasterShockwaveParticleSystem;                // 0x128(0x8)
	class ParticleSystemComponent*                               BroadcasterHornDustParticleSystem;                 // 0x130(0x8)
	class Object*                                                HornVFXTemplate;                                   // 0x138(0x8)
	class StaticMeshComponent*                                   BroadcasterArmStaticMesh;                          // 0x140(0x8)
	class CurveFloat*                                            PulseGlowCurve;                                    // 0x148(0x8)
	float                                                        StatueInactiveIntensityThreshold;                  // 0x150(0x4)
	float                                                        StatueActivatedIntensityThreshold;                 // 0x154(0x4)
	float                                                        ReactionSequenceIntensityThreshold;                // 0x158(0x4)
	float                                                        SingingIntensityThreshold;                         // 0x15c(0x4)
	float                                                        IntensityInterpolationSpeed;                       // 0x160(0x4)
	TArray<struct Name>                                          ScalarParameterNamesToOverride;                    // 0x168(0x10)
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class UserSettingsMapMarkProviderComponent: public ActorComponent
{
public:
	TArray<struct UserSettingsMapMarkDefinition>                 MarkMappings;                                      // 0xd0(0x10)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class GetIsShipInGoodConditionStepDesc: public TaleQuestStepDesc
{
public:
	struct                                                       Result;                                            // 0x80(0x30)
};


// Size 0x68 (Full Size[0x430] - InheritedSize[0x3c8]
class StormService: public Actor
{
public:
	TArray<class Actor*>                                         StormList;                                         // 0x418(0x10)
};


// Size 0x50 (Full Size[0xb8] - InheritedSize[0x68]
class BTDecorator_ActorWieldedItemCategory: public BTDecorator_BaseConditional
{
public:
	float                                                        Interval;                                          // 0x68(0x4)
	struct                                                       BlackboardKey;                                     // 0x70(0x28)
	assetclass                                                   ItemCategoryToTest;                                // 0x98(0x20)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class ActorPhasingComponent: public ActorComponent
{
public:
	class Actor*                                                 ActorToHide;                                       // 0xd0(0x8)
};


// Size 0x140 (Full Size[0x508] - InheritedSize[0x3c8]
class HauntedFort: public Actor
{
public:
	class StaticMeshComponent*                                   FortMesh;                                          // 0x3d8(0x8)
	class ChildActorComponent*                                   Target_A;                                          // 0x3e0(0x8)
	class ChildActorComponent*                                   Target_B;                                          // 0x3e8(0x8)
	class ChildActorComponent*                                   Target_C;                                          // 0x3f0(0x8)
	class ChildActorComponent*                                   Target_D;                                          // 0x3f8(0x8)
	class ChildActorComponent*                                   Target_E;                                          // 0x400(0x8)
	class ChildActorComponent*                                   Target_F;                                          // 0x408(0x8)
	class ChildActorComponent*                                   Target_G;                                          // 0x410(0x8)
	class ChildActorComponent*                                   Target_H;                                          // 0x418(0x8)
	class ChildActorComponent*                                   Target_I;                                          // 0x420(0x8)
	class HauntedFortEmplacement*                                Emplacement_A;                                     // 0x428(0x8)
	class HauntedFortEmplacement*                                Emplacement_B;                                     // 0x430(0x8)
	class HauntedFortEmplacement*                                Emplacement_C;                                     // 0x438(0x8)
	TArray<class HauntedFortTarget*>                             TargetsArray;                                      // 0x440(0x10)
	TArray<class HauntedFortTarget*>                             EmplacementsArray;                                 // 0x450(0x10)
	float                                                        ServerMigrationExclusionRadius;                    // 0x460(0x4)
};


// Size 0x58 (Full Size[0x120] - InheritedSize[0xc8]
class ReapersTributeShipDespawnComponent: public ActorComponent
{
public:
	float                                                        DespawningSequenceDuration;                        // 0xc8(0x4)
	bool                                                         ApplyAlphaValueToDynamicMaterials;                 // 0xcc(0x1)
	struct FName                                                 MaterialParamToUseForAlpha;                        // 0xd0(0x8)
	multicastinlinedelegate                                      OnDespawningSequenceTicked;                        // 0xd8(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PlayerActivityLifetimeRuleCatalogueDataAsset: public DataAsset
{
public:
	TArray<struct PlayerActivityLifetimeRule>                    PlayerActivityLifetimeRules;                       // 0x28(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class BowSplashContainer: public DataAsset
{
public:
	bool                                                         EnableProbes;                                      // 0x28(0x1)
	float                                                        VisibleCullDistance;                               // 0x2c(0x4)
	float                                                        HiddenCullDistance;                                // 0x30(0x4)
	float                                                        SpeedThreshold;                                    // 0x34(0x4)
	float                                                        BowSplashFieldOfViewAngleAddition;                 // 0x38(0x4)
	TArray<struct BowSplashProbe>                                Probes;                                            // 0x40(0x10)
};


// Size 0x220 (Full Size[0x5e8] - InheritedSize[0x3c8]
class ContestZone: public Actor
{
public:
	TArray<struct ContestZoneVendorShipData>                     VendorShipsToSpawnInContest;                       // 0x3d8(0x10)
	class SphereComponent*                                       ContestZoneBoundaryComponent;                      // 0x3e8(0x8)
	struct FName                                                 ContestZoneName;                                   // 0x3f0(0x8)
	float                                                        ContestZoneRadius;                                 // 0x3f8(0x4)
	float                                                        RespawnSafeZoneRadius;                             // 0x3fc(0x4)
	float                                                        RespawnDistanceThreshold;                          // 0x400(0x4)
	bool                                                         IsFullyActivated;                                  // 0x404(0x1)
	struct                                                       ContestZoneObjectMessagingDispatcher;              // 0x408(0xa0)
	TArray<struct InitialShipSpawnLocations>                     InitialSpawnLocations;                             // 0x4a8(0x10)
	TArray<class IslandData*>                                    IslandsWithinContestZone;                          // 0x4b8(0x10)
	struct                                                       RespawnPointAsset;                                 // 0x4c8(0x10)
	class ContestSafeRegion*                                     ContestSafeRegion;                                 // 0x4d8(0x8)
	float                                                        ContestZoneRadiusSquared;                          // 0x4e0(0x4)
	float                                                        ContestZoneDiameter;                               // 0x4e4(0x4)
	float                                                        ContestZoneArea;                                   // 0x4e8(0x4)
	TArray<class ArenaVendorShip*>                               VendorShips;                                       // 0x4f0(0x10)
	TArray<struct Transform>                                     RespawnLocations;                                  // 0x500(0x10)
	class ShipSpawnLocation*                                     PooledRespawnLocation;                             // 0x510(0x8)
	TArray<class ShipSpawnLocation*>                             ShipSpawnLocationsForContest;                      // 0x518(0x10)
	int                                                          NumberOfSpawnPointsToGenerate;                     // 0x5b0(0x4)
	float                                                        MinimumDistanceFromBounds;                         // 0x5b4(0x4)
	char                                                         ContestZoneRespawnLocationOrientation;             // 0x5b8(0x1)
	float                                                        RadiusForStaticObjectCheck;                        // 0x5bc(0x4)
	TArray<class CalmWaterComponent*>                            CalmWaters;                                        // 0x5d8(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class NPCIdAsset: public DataAsset
{
public:
	TArray<struct Name>                                          NPCIds;                                            // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SeaIdValidationDataAsset: public DataAsset
{
public:
	TArray<class Class*>                                         AllSeaIds;                                         // 0x28(0x10)
};


// Size 0x18 (Full Size[0x78] - InheritedSize[0x60]
class FogBankTaleService: public TaleQuestService
{
public:
	class FogBankTaleServiceDesc*                                Desc;                                              // 0x60(0x8)
	TArray<struct FogBankManagerFogAvoidanceArea>                FogBankAvoidanceAreas;                             // 0x68(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class AthenaCharacterMovementCheatDetectionSettings: public Object
{
public:
	float                                                        MinLifetime;                                       // 0x28(0x4)
	float                                                        MinRatioLifetimeToLifetimeRawTimeDiscrepancy;      // 0x2c(0x4)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class SetMechanismActivationModeStepDesc: public TaleQuestStepDesc
{
public:
	struct                                                       Action;                                            // 0x80(0x30)
	char                                                         ActivationMode;                                    // 0xb0(0x1)
};


// Size 0x28 (Full Size[0xb0] - InheritedSize[0x88]
class BTTask_ClearReapersTributeIslandTarget: public BTTask_BlackboardBase
{
public:
	struct                                                       IslandTargetKey;                                   // 0x88(0x28)
};


// Size 0x70 (Full Size[0x138] - InheritedSize[0xc8]
class AudioVisualiserHudComponent: public ActorComponent
{
public:
	TArray<struct HoopData>                                      Hoops;                                             // 0xd8(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class PetAnimationDataStore: public AnimationData
{
public:
	class PetsAnimationData*                                     PetAnimationData;                                  // 0x28(0x8)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class IslandFrameworkSettings: public DeveloperSettings
{
public:
	struct FName                                                 IslandTypeStateGroup;                              // 0x38(0x8)
	struct                                                       IslandDataFileLocation;                            // 0x40(0x10)
	float                                                        SurfaceUpperBound;                                 // 0x50(0x4)
	float                                                        SurfaceLowerBound;                                 // 0x54(0x4)
	float                                                        TreasuryAwarenessProximity;                        // 0x58(0x4)
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class AthenaContestTavern: public Actor
{
public:
	TArray<class SpawnLocation*>                                 TavernSpawnPoints;                                 // 0x3c8(0x10)
	TArray<class Actor*>                                         TavernLevelActorsToPrepare;                        // 0x3d8(0x10)
};


// Size 0x108 (Full Size[0x130] - InheritedSize[0x28]
class FishingMiniGameFishDataAsset: public DataAsset
{
public:
	float                                                        ChanceOfEscapePositionBeingLeft;                   // 0x28(0x4)
	float                                                        ChanceOfEscapePositionBeingAway;                   // 0x2c(0x4)
	float                                                        ChanceOfEscapePositionBeingRight;                  // 0x30(0x4)
	struct                                                       HowLongBeforeUnfoughtFishEscapes;                  // 0x38(0x30)
	struct                                                       TimeToTire;                                        // 0x68(0x30)
	struct                                                       SwitchesBeforeRecovery;                            // 0x98(0x30)
	struct                                                       TimeSpentRecovering;                               // 0xc8(0x30)
	float                                                        SpeedMovingBackToCentreWhenRecovering;             // 0xf8(0x4)
	float                                                        SpeedMovingBackToCentreWhenRecoveringWhenReeling;  // 0xfc(0x4)
	struct                                                       NumFakeOuts;                                       // 0x100(0x30)
};


// Size 0x18 (Full Size[0x3e0] - InheritedSize[0x3c8]
class PlayerStreamedLevelService: public Actor
{
public:
	TArray<struct StreamedLevelData>                             StreamedLevelData;                                 // 0x3d0(0x10)
};


// Size 0x18 (Full Size[0xe0] - InheritedSize[0xc8]
class MeleeChargeAIAbilityParams: public AthenaAIAbilityParams
{
public:
	float                                                        MinAngleToTargetToActivate;                        // 0xc8(0x4)
	float                                                        MaxAngleToTargetToActivate;                        // 0xcc(0x4)
	float                                                        MinTimeBetweenCheck;                               // 0xd0(0x4)
	float                                                        MaxTimeBetweenCheck;                               // 0xd4(0x4)
	float                                                        ChanceOfActivation;                                // 0xd8(0x4)
	float                                                        ChargeTime;                                        // 0xdc(0x4)
};


// Size 0x4410 (Full Size[0x4a70] - InheritedSize[0x660]
class AthenaAnimationInstance: public CharacterAnimationInstance
{
public:
	char                                                         ControllableObjectType;                            // 0x698(0x1)
	TArray<struct AthenaAnimationLoadObjectsWrapper>             AllLoadedItemData;                                 // 0x6a0(0x10)
	struct                                                       HandHeldItemParams;                                // 0x6b0(0x20)
	struct                                                       IdleVariantParams;                                 // 0x6d0(0x10)
	struct                                                       WheelAnimationParams;                              // 0x6e0(0x1f0)
	struct                                                       CapstanAnimationParams;                            // 0x8d0(0x178)
	struct                                                       FacialParams;                                      // 0xa48(0x90)
	struct                                                       Fire;                                              // 0xad8(0x20)
	char                                                         MeleeSpecialState;                                 // 0xaf8(0x1)
	float                                                        DodgeDirection;                                    // 0xafc(0x4)
	struct                                                       RowboatParams;                                     // 0xb00(0xc8)
	struct                                                       Rowing;                                            // 0xbc8(0xe0)
	struct                                                       WaterPumpAnimations;                               // 0xca8(0x28)
	struct                                                       WaterPumpAnimationParams;                          // 0xcd0(0xc)
	struct                                                       FishingParams;                                     // 0xcdc(0x34)
	struct                                                       Fishing;                                           // 0xd10(0x3f0)
	struct                                                       WaterSlideControlAnimData;                         // 0x1100(0xe0)
	struct                                                       ZiplineControlAnimData;                            // 0x11e0(0x68)
	struct                                                       BalanceableWalkwayParams;                          // 0x1248(0x170)
	struct                                                       BalanceableWalkwayAnimation;                       // 0x13b8(0xc0)
	class AthenaCharacter*                                       AthenaCharacter;                                   // 0x1478(0x8)
	struct                                                       JumpingAnimationParams;                            // 0x1480(0xf0)
	float                                                        SpineBlendAlpha;                                   // 0x1570(0x4)
	float                                                        DockingTransitionAlpha;                            // 0x1574(0x4)
	struct                                                       AthenaAnimationWaterPump;                          // 0x1578(0x30)
	struct                                                       AnimationLODSettings;                              // 0x15a8(0x3)
	struct                                                       Locomotion;                                        // 0x15b0(0x68)
	struct                                                       WieldedItemStateMachine;                           // 0x1618(0x5f0)
	struct                                                       ItemLoading;                                       // 0x1c10(0x940)
	class UClass*                                                CurrentWieldedItemALK;                             // 0x2550(0x8)
	struct                                                       ItemPrimaryContinousUseAnims;                      // 0x2558(0xa8)
	struct                                                       ItemSecondaryContinousUseAnims;                    // 0x2600(0xa8)
	struct                                                       ItemPrimaryContinousUseAlternateAnims;             // 0x26a8(0xa8)
	struct                                                       ItemSecondaryContinousUseAlternateAnims;           // 0x2750(0xa8)
	struct                                                       ItemPrimaryContinousUseSwimmingAnims;              // 0x27f8(0x20)
	struct                                                       ItemSecondaryContinousUseSwimmingAnims;            // 0x2818(0x20)
	struct                                                       ItemPrimaryContinousUseSwimmingAlternateAnims;     // 0x2838(0x20)
	struct                                                       ItemSecondaryContinousUseSwimmingAlternateAnims;   // 0x2858(0x20)
	struct                                                       ItemPrimaryContinousUseJumpingAnims;               // 0x2878(0x20)
	struct                                                       ItemSecondaryContinousUseJumpingAnims;             // 0x2898(0x20)
	struct                                                       ItemPrimaryContinousUseJumpingAlternateAnims;      // 0x28b8(0x20)
	struct                                                       ItemSecondaryContinousUseJumpingAlternateAnims;    // 0x28d8(0x20)
	struct                                                       ActiveOneShotAnimations;                           // 0x28f8(0x20)
	struct                                                       DuplicateActiveOneShotAnimations;                  // 0x2918(0x20)
	struct                                                       ItemPrimaryOneShotAnims;                           // 0x2938(0x30)
	struct                                                       ItemSecondaryOneShotAnims;                         // 0x2968(0x30)
	struct                                                       ItemPrimaryOneShotAlternateAnims;                  // 0x2998(0x30)
	struct                                                       ItemSecondaryOneShotAlternateAnims;                // 0x29c8(0x30)
	struct                                                       CurrentComplexOneShotData;                         // 0x29f8(0x38)
	struct                                                       CurrentMeleeAttackSequencePlaySpeeds;              // 0x2a30(0x14)
	struct                                                       ItemCombatBlockingAnims;                           // 0x2a48(0x60)
	class UClass*                                                FishingRodAnimStoreID;                             // 0x2aa8(0x8)
	class UClass*                                                QuestBookAnimStoreID;                              // 0x2ab0(0x8)
	class UClass*                                                WoodenPlankAnimStoreID;                            // 0x2ab8(0x8)
	float                                                        UnequipPlayRate;                                   // 0x2ac0(0x4)
	struct                                                       LoadOnDemandItemParams;                            // 0x2ac8(0x1ac0)
	char                                                         ControllableSocketGroup;                           // 0x4588(0x1)
	char                                                         ControllableSocketGroupCharacterSize;              // 0x4589(0x1)
	char                                                         LocomotionState;                                   // 0x458a(0x1)
	struct                                                       DebugTrackingParams;                               // 0x458b(0x4)
	struct                                                       Death;                                             // 0x4590(0x100)
	struct                                                       UndoRepair;                                        // 0x4690(0x70)
	struct                                                       Sitting;                                           // 0x4700(0x70)
	char                                                         PropWieldLocation;                                 // 0x4770(0x1)
	struct                                                       PropOffsetLocation;                                // 0x4774(0xc)
	struct                                                       PropOffsetRotation;                                // 0x4780(0xc)
	struct                                                       PropOffsetScale;                                   // 0x478c(0xc)
	bool                                                         FaunaAddedToCrate;                                 // 0x4798(0x1)
	bool                                                         InDockingTransition;                               // 0x4798(0x1)
	bool                                                         WieldedItemIsMeleeWeapon;                          // 0x4798(0x1)
	bool                                                         MeleeV2IgnoresHandAdditive;                        // 0x4798(0x1)
	bool                                                         InMeleeCombat;                                     // 0x4798(0x1)
	bool                                                         IsBlockingLeft;                                    // 0x4798(0x1)
	bool                                                         IsFishingWithWieldedRod;                           // 0x4798(0x1)
	bool                                                         UsePropOffset;                                     // 0x4798(0x1)
	bool                                                         IsOnLadder;                                        // 0x4799(0x1)
	bool                                                         IsUsingAdditiveHandOverlayPose;                    // 0x4799(0x1)
	bool                                                         IgnoreIdleBlendTransition;                         // 0x4799(0x1)
	bool                                                         UseDuplicateOneShotState;                          // 0x4799(0x1)
};


// Size 0x38 (Full Size[0x100] - InheritedSize[0xc8]
class AmmoStoreComponent: public ActorComponent
{
public:
	int                                                          MaxAmmo;                                           // 0xd0(0x4)
	class WwiseEvent*                                            ReloadSFX;                                         // 0xd8(0x8)
	class WwiseEvent*                                            RestockSFX;                                        // 0xe0(0x8)
	int                                                          CurrentAmmo;                                       // 0xe8(0x4)
};


// Size 0x20 (Full Size[0x300] - InheritedSize[0x2e0]
class RainZoneComponent: public SceneComponent
{
public:
	struct                                                       RainZoneParameters;                                // 0x2e8(0xc)
};


// Size 0x158 (Full Size[0x220] - InheritedSize[0xc8]
class PlayerGeneratedMapsContainerComponent: public ActorComponent
{
public:
	struct FText                                                 ContainerDisplayName;                              // 0xd0(0x38)
	struct                                                       InstanceTransform;                                 // 0x110(0x30)
	class UClass*                                                MapDesc;                                           // 0x140(0x8)
	class PlayerGeneratedMapsContainerComponentDataAsset*        ContainerDataAsset;                                // 0x148(0x8)
	TArray<struct PlayerGeneratedMapDisplayData>                 PlayerMapInventory;                                // 0x150(0x10)
	TArray<struct PlayerGeneratedMapDisplayData>                 StoreMapInventory;                                 // 0x160(0x10)
	class WwiseEvent*                                            AddMapSFX;                                         // 0x170(0x8)
	class WwiseEvent*                                            TakeMapSFX;                                        // 0x178(0x8)
	class WwiseEvent*                                            OpenContainerSFX;                                  // 0x180(0x8)
	int                                                          MaxNumStoreMapsToReplicate;                        // 0x188(0x4)
	int                                                          MaxNumPlayerMapsToReplicate;                       // 0x18c(0x4)
	int                                                          DailyMapLimit;                                     // 0x190(0x4)
	struct                                                       MapTakenBackgroundImage;                           // 0x198(0x10)
	TArray<struct StringAssetReference>                          MapTakenImages;                                    // 0x1a8(0x10)
	TArray<class Actor*>                                         ServerAttachedPlayers;                             // 0x1b8(0x10)
	class WwiseObjectPoolWrapper*                                SfxPool;                                           // 0x1c8(0x8)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ApplicationSettings: public Object
{
public:
	int                                                          GameLanguage;                                      // 0x28(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class QuestConditionalStatIdentifier: public Object
{
public:
	class UClass*                                                QuestMapOverride;                                  // 0x30(0x8)
};


// Size 0x30 (Full Size[0x310] - InheritedSize[0x2e0]
class LightingZoneComponent: public SceneComponent
{
public:
	struct                                                       LightingZoneParameters;                            // 0x2e8(0x20)
};


// Size 0x98 (Full Size[0xc0] - InheritedSize[0x28]
class FortDataAsset: public DataAsset
{
public:
	float                                                        MinActivationDistanceFromPlayers;                  // 0x28(0x4)
	float                                                        MinEngagedDistanceFromPlayers;                     // 0x2c(0x4)
	struct FString                                               MinEngagedDistanceFromPlayersRemoteConfigKey;      // 0x30(0x10)
	TArray<class AIBountySpawner*>                               BountySpawners;                                    // 0x40(0x10)
	class NamedAIDataAsset*                                      NamedAIDataAsset;                                  // 0x50(0x8)
	struct FName                                                 NavMeshOverride;                                   // 0x58(0x8)
	class AISpawner*                                             AISpawnerWhenFortInactive;                         // 0x60(0x8)
	class AISpawner*                                             CannonsAISpawnerWhenFortInactive;                  // 0x68(0x8)
	class AISpawner*                                             AISpawnerWhenFortActive;                           // 0x70(0x8)
	class AISpawner*                                             CannonsAISpawnerWhenFortActive;                    // 0x78(0x8)
	class WwiseEvent*                                            WaveSpawnSoundEffect;                              // 0x80(0x8)
	class WwiseEvent*                                            FinalWaveSpawnSoundEffect;                         // 0x88(0x8)
	class WwiseEvent*                                            FortCompleteSoundEffect;                           // 0x90(0x8)
	float                                                        WaveSpawnSoundEffectDelay;                         // 0x98(0x4)
	float                                                        AnticipationAudioZoneRadiusMetres;                 // 0x9c(0x4)
	float                                                        ActionAudioZoneRadiusMetres;                       // 0xa0(0x4)
	class UClass*                                                KeyItemToUnlockDoor;                               // 0xa8(0x8)
	class ItemDescSpawnData*                                     KeySpawnData;                                      // 0xb0(0x8)
	char                                                         EncounterSightingType;                             // 0xb8(0x1)
	char                                                         EncounterCloseType;                                // 0xb9(0x1)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EmblemSettings: public Object
{
public:
	struct                                                       EmblemDefinitionAssetListLocation;                 // 0x28(0x10)
};


// Size 0x30 (Full Size[0x90] - InheritedSize[0x60]
class TaleQuestResetShipBuoyancyService: public TaleQuestService
{
public:
	class TaleQuestResetShipBuoyancyServiceDesc*                 ServiceDesc;                                       // 0x60(0x8)
};


// Size 0x98 (Full Size[0xc0] - InheritedSize[0x28]
class FishingFloatSetupDataAsset: public DataAsset
{
public:
	class WwiseObjectPoolWrapper*                                FishingFloatPool;                                  // 0x28(0x8)
	class WwiseEvent*                                            RodCastFloatLandInWater;                           // 0x30(0x8)
	float                                                        DelayBeforeDetachingFloat;                         // 0x38(0x4)
	float                                                        FloatBobDepthWhenMovedAndNotHooked;                // 0x3c(0x4)
	float                                                        RetractingDuration;                                // 0x40(0x4)
	float                                                        ViolentlyRetractingDuration;                       // 0x44(0x4)
	class CurveFloat*                                            CastingFloatMovementXY;                            // 0x48(0x8)
	class CurveFloat*                                            CastingFloatMovementZAtMinDistance;                // 0x50(0x8)
	class CurveFloat*                                            CastingFloatMovementZAtMaxDistance;                // 0x58(0x8)
	class CurveFloat*                                            ReelingInFloatMovementXY;                          // 0x60(0x8)
	class CurveFloat*                                            ReelingInFloatMovementZ;                           // 0x68(0x8)
	class Object*                                                SplashVFXWhenFloatLandsOnWater;                    // 0x70(0x8)
	float                                                        MaxAboveDistance;                                  // 0x78(0x4)
	float                                                        MaxBelowDistance;                                  // 0x7c(0x4)
	float                                                        ExtraOffsetWhenFishNotAttached;                    // 0x80(0x4)
	float                                                        MaxDriftCompensationOffset;                        // 0x84(0x4)
	float                                                        FloatBobDepthOnComedyItemBeingHooked;              // 0x88(0x4)
	float                                                        BringingInCatchDuration;                           // 0x8c(0x4)
	float                                                        FloatZOffset;                                      // 0x90(0x4)
	float                                                        WobbleSpeed;                                       // 0x94(0x4)
	float                                                        MinWobbleAngle;                                    // 0x98(0x4)
	float                                                        MaxWobbleAngle;                                    // 0x9c(0x4)
	float                                                        TimeToBlendAwaySway;                               // 0xa0(0x4)
	float                                                        WobbleYawAngleOffset;                              // 0xa4(0x4)
	float                                                        FlavourYawMinTimeToNextChange;                     // 0xa8(0x4)
	float                                                        FlavourYawMaxTimeToNextChange;                     // 0xac(0x4)
	float                                                        FlavourYawMinSpeed;                                // 0xb0(0x4)
	float                                                        FlavourYawMaxSpeed;                                // 0xb4(0x4)
	float                                                        FlavourYawAcceleration;                            // 0xb8(0x4)
};


// Size 0x1a8 (Full Size[0x570] - InheritedSize[0x3c8]
class TutorialEventControlledObject: public Actor
{
public:
	struct                                                       ActivateEventHandle;                               // 0x3d0(0x58)
	struct                                                       DeactivateEventHandle;                             // 0x428(0x58)
	class WwiseEvent*                                            ActivationSfx;                                     // 0x480(0x8)
	class WwiseEvent*                                            FullyActivatedSfx;                                 // 0x488(0x8)
	class WwiseEvent*                                            DeactivationSfx;                                   // 0x490(0x8)
	class WwiseEvent*                                            FullyDeactivatedSfx;                               // 0x498(0x8)
	bool                                                         IsActivated;                                       // 0x4a0(0x1)
	struct                                                       EventDispatcher;                                   // 0x4a8(0xa0)
	class AthenaPlayerController*                                RegisteredController;                              // 0x548(0x8)
};


// Size 0xc8 (Full Size[0x490] - InheritedSize[0x3c8]
class PhasedGenericMarkerService: public Actor
{
public:
	TArray<struct CanvasWorldMapGeneric>                         GenericMarkers;                                    // 0x3f0(0x10)
	TArray<struct Guid>                                          RelevantCrewIds;                                   // 0x400(0x10)
};


// Size 0x218 (Full Size[0x240] - InheritedSize[0x28]
class AggressiveGhostShipDifficultyDataAsset: public DataAsset
{
public:
	struct                                                       NumShotsToDestroyShip;                             // 0x28(0x20)
	float                                                        PersistentDamageScale;                             // 0x48(0x4)
	TArray<struct AggressiveGhostHealthToVfxLevel>               HealthToVFxLevel;                                  // 0x50(0x10)
	struct                                                       Speed;                                             // 0x60(0x30)
	struct                                                       TimeBetweenShots;                                  // 0x90(0x30)
	struct                                                       WraithballCooldownTime;                            // 0xc0(0x30)
	struct                                                       TimeBetweenCheckingIfAShipIsBehindYou;             // 0xf0(0x30)
	float                                                        MaxDistanceBehindShipToBeMineTargetInMetres;       // 0x120(0x4)
	float                                                        MaxMineTargetAngle;                                // 0x124(0x4)
	float                                                        ChanceOfDroppingMines;                             // 0x128(0x4)
	struct                                                       NumMinesToDrop;                                    // 0x130(0x20)
	struct                                                       MinTimeBetweenDroppingMoreMines;                   // 0x150(0x30)
	bool                                                         CanAnchorDrop;                                     // 0x180(0x1)
	struct                                                       TimeBetweenAnchorDrops;                            // 0x188(0x30)
	struct                                                       AnchorDropWarningTime;                             // 0x1b8(0x30)
	float                                                        TimeBetweenPortalJumpChecks;                       // 0x1e8(0x4)
	float                                                        MinDistanceFromAnyShipsToConsiderAPortalJumpInMetres; // 0x1ec(0x4)
	float                                                        TimeToBeAwayFromAnyShipsToConsiderPortalJumping;   // 0x1f0(0x4)
	float                                                        ChanceOfPortalJumping;                             // 0x1f4(0x4)
	struct                                                       PortalJumpDuration;                                // 0x1f8(0x30)
	float                                                        PortalJumpCooldown;                                // 0x228(0x4)
	TArray<struct AggressiveGhostShipImpactDamage>               ProjectileDamageData;                              // 0x230(0x10)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class AlliancePennantAsset: public DataAsset
{
public:
	TArray<struct AlliancePennantData>                           AlliancePennants;                                  // 0x28(0x10)
	TArray<struct ShipSizePartCustomizationNameData>             ShipAlliancePennantPartNames;                      // 0x38(0x10)
	struct                                                       EmptyPennantDesc;                                  // 0x48(0x10)
};


// Size 0x48 (Full Size[0x410] - InheritedSize[0x3c8]
class AggressiveGhostShipPortal: public Actor
{
public:
	float                                                        OpenDuration;                                      // 0x400(0x4)
	float                                                        ClosingDuration;                                   // 0x404(0x4)
};


// Size 0x1e0 (Full Size[0x760] - InheritedSize[0x580]
class AthenaWorldSettings: public WorldSettings
{
public:
	struct                                                       WorldMax;                                          // 0x5f0(0x8)
	struct                                                       WorldMapMin;                                       // 0x5f8(0x8)
	struct                                                       WorldMapMax;                                       // 0x600(0x8)
	float                                                        AdventureDistanceFromWorldSafeRegionEdgeToKillZone; // 0x60c(0x4)
	float                                                        ArenaDistanceFromWorldSafeRegionEdgeToKillZone;    // 0x610(0x4)
	float                                                        EndOfWorldWarningOffset;                           // 0x614(0x4)
	float                                                        AdventureDistanceFromWorldSafeRegionEdgeToFullStrainAndLighting; // 0x61c(0x4)
	float                                                        ArenaDistanceFromWorldSafeRegionEdgeToFullStrainAndLighting; // 0x620(0x4)
	int                                                          EndOfWorldWarningLightingIndex;                    // 0x624(0x4)
	class BuoyantObjectSpawnParamsDataAsset*                     BuoyantObjectSpawnParams;                          // 0x628(0x8)
	class SeaFortsWorldDataAsset*                                SeaFortsData;                                      // 0x630(0x8)
	class SeaRockDataAsset*                                      SeaRockLocations;                                  // 0x638(0x8)
	struct                                                       TradeRoutes;                                       // 0x640(0x10)
	TArray<struct AthenaStreamedLevelItem>                       ManuallyStreamedLevels;                            // 0x650(0x10)
	class TunnelWorldConfig*                                     TunnelWorldConfig;                                 // 0x660(0x8)
	class SpireStreamedLevelDataAsset*                           SpireLevels;                                       // 0x668(0x8)
	struct                                                       KrakenParams;                                      // 0x670(0x1)
	struct                                                       TinySharkParams;                                   // 0x671(0x1)
	struct                                                       AIShipParams;                                      // 0x678(0x18)
	class InvasionLocationsDataAsset*                            InvasionLocationsDataAsset;                        // 0x690(0x8)
	class IslandDataAsset*                                       IslandDataAsset;                                   // 0x698(0x8)
	class PrebakedIslandAsset*                                   PrebakedIslandData;                                // 0x6a0(0x8)
	class MapTableCanvasDataAsset*                               MapTableCanvasData;                                // 0x6a8(0x8)
	class VoyageDescDataAsset*                                   TutorialTale;                                      // 0x6b0(0x8)
	class VoyageDescDataAsset*                                   ScuttleShipVoyageDescAsset;                        // 0x6b8(0x8)
	float                                                        DevilsShroudPlayerDamageMaxDamage;                 // 0x6c0(0x4)
	bool                                                         AllowCompanyOnboardingTutorial;                    // 0x6c4(0x1)
	bool                                                         AllowContextualTutorial;                           // 0x6c5(0x1)
	bool                                                         ShowMapTable;                                      // 0x6c6(0x1)
	bool                                                         UseDevDefinition;                                  // 0x6c7(0x1)
	bool                                                         EnableGlobalVoyages;                               // 0x6c8(0x1)
	class GlobalVoyageOverrideAsset*                             GlobalVoyageOverrideAsset;                         // 0x6d0(0x8)
	TArray<class Class*>                                         NPCOnBeachVoyageCheckpoints;                       // 0x6d8(0x10)
	float                                                        ServerChatMessageStickyTime;                       // 0x6e8(0x4)
	float                                                        SaferSeasServerChatMessageStickyTime;              // 0x6ec(0x4)
	bool                                                         UseGameEventSchedulerRemoteServices;               // 0x6f0(0x1)
	class GameEventSchedulerSettingsAsset*                       DefaultGameEventSchedulerSettings;                 // 0x6f8(0x8)
	TArray<struct AthenaWorldSettingsGameEventSchedulerSettingsConfiguration> GameEventSchedulerSettingsConfigurations;          // 0x700(0x10)
	class StormServiceAsset*                                     StormServiceSettings;                              // 0x710(0x8)
	TArray<struct WorldSafeZone>                                 SafeZonesIncludingRequiresShroudBreaker;           // 0x718(0x10)
	TArray<struct WorldSafeZone>                                 SafeZonesExcludingRequiresShroudBreaker;           // 0x728(0x10)
	TArray<struct WorldSafeZone>                                 MainWorldSafeZones;                                // 0x738(0x10)
	TArray<struct WorldSafeZone>                                 OverridingSafeZones;                               // 0x748(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InventoryItemDescToSlotRemappingPolicyAsset: public DataAsset
{
public:
	TArray<class Class*>                                         Slots;                                             // 0x28(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class TaleQuestCheckpointServiceDesc: public TaleQuestServiceDesc
{
public:
	class PopUpMessageDesc*                                      Notification;                                      // 0x28(0x8)
};


// Size 0x78 (Full Size[0x140] - InheritedSize[0xc8]
class CannonRecoilComponent: public ActorComponent
{
public:
	float                                                        RecoilForce;                                       // 0xc8(0x4)
	class CurveFloat*                                            YawToRecoilForceModifierCurve;                     // 0xd0(0x8)
	bool                                                         IgnoreRecoilIfAttachedToParent;                    // 0xd8(0x1)
};


// Size 0x50 (Full Size[0x88] - InheritedSize[0x38]
class TradeRouteMapSettings: public DeveloperSettings
{
public:
	struct                                                       TradeRouteLandscapeMapItemDescClass;               // 0x38(0x10)
	struct                                                       TradeRoutePortraitMapItemDescClass;                // 0x48(0x10)
	char                                                         DefaultIslandBlendMode;                            // 0x58(0x1)
	struct                                                       DefaultPathTexture;                                // 0x60(0x10)
	char                                                         DefaultPathBlendMode;                              // 0x70(0x1)
	class UClass*                                                DefaultClueMarkId;                                 // 0x78(0x8)
	char                                                         DefaultClueBlendMode;                              // 0x80(0x1)
	float                                                        DefaultClueScale;                                  // 0x84(0x4)
};


// Size 0x138 (Full Size[0x160] - InheritedSize[0x28]
class BalanceableWalkwayDataAsset: public DataAsset
{
public:
	struct FText                                                 UseBalanceableWalkwayTooltip;                      // 0x28(0x38)
	struct FText                                                 SlideDownWalkwayTooltip;                           // 0x60(0x38)
	struct FText                                                 InWaterTooltip;                                    // 0x98(0x38)
	struct FText                                                 AngleTooBigTooltip;                                // 0xd0(0x38)
	struct FText                                                 TooShortTooltip;                                   // 0x108(0x38)
	struct                                                       TooltipOffset;                                     // 0x140(0xc)
	float                                                        InteractionAreaSize;                               // 0x14c(0x4)
	float                                                        MaxTooltipDistance;                                // 0x150(0x4)
	float                                                        MaxAngleOfRopeToInteract;                          // 0x154(0x4)
	float                                                        MaxAngleOfRopeToWalk;                              // 0x158(0x4)
};


// Size 0x2a0 (Full Size[0xa90] - InheritedSize[0x7f0]
class WaterGunWieldableItem: public SimpleBootyWieldableItem
{
public:
	class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x840(0x8)
	class ParticleSystemComponent*                               LiquidLauncherParticleSystemComponent;             // 0x848(0x8)
	class ParticleSystemComponent*                               LiquidLauncherChargeParticleSystemComponent;       // 0x850(0x8)
	class ParticleSystemComponent*                               LiquidLauncherCurrentPressureParticleSystemComponent; // 0x858(0x8)
	class MaterialAnimatorComponent*                             MaterialAnimatorComponent;                         // 0x860(0x8)
	class WaterGunLiquidLauncherController*                      LiquidLauncherController;                          // 0x868(0x8)
	struct                                                       ItemUseSpeedModifiers;                             // 0x870(0x8)
	float                                                        ItemUseFOVBlendSpeed;                              // 0x878(0x4)
	float                                                        ItemUseTargetFOV;                                  // 0x87c(0x4)
	float                                                        AimingDownSightsEffectsDelayAmount;                // 0x880(0x4)
	float                                                        StartLiquidLauncherOnServerDelayLatencyCompensation; // 0x884(0x4)
	float                                                        LiquidLauncherParticleSystemMaxLength;             // 0x888(0x4)
	char                                                         LiquidLauncherParticleSystemCustomLocalSpaceMode;  // 0x88c(0x1)
	struct FName                                                 OpenJawMaterialAnimationName;                      // 0x890(0x8)
	struct FName                                                 CloseJawMaterialAnimationName;                     // 0x898(0x8)
	struct                                                       LiquidLauncherParticleSystemThirdPersonAttachPoint; // 0x8a0(0xc)
	struct                                                       LiquidLauncherParticleSystemThirdPersonRotation;   // 0x8ac(0xc)
	struct                                                       LiquidLauncherParticleSystemFirstPersonAttachPoint; // 0x8b8(0xc)
	struct                                                       LiquidLauncherParticleSystemFirstPersonRotation;   // 0x8c4(0xc)
	struct                                                       LiquidLauncherCurrentPressureParticleSystemFirstPersonRotation; // 0x8d0(0xc)
	struct                                                       LiquidLauncherCurrentPressureParticleSystemFirstPersonAttachPoint; // 0x8dc(0xc)
	struct                                                       LiquidLauncherChargeParticleSystemFirstPersonRotation; // 0x8e8(0xc)
	struct                                                       LiquidLauncherChargeParticleSystemPersonAttachPoint; // 0x8f4(0xc)
	bool                                                         EnableCustomParticleSystemBelowWater;              // 0x900(0x1)
	class ParticleSystem*                                        AboveWaterThirdPersonParticleSystem;               // 0x908(0x8)
	class ParticleSystem*                                        BelowWaterThirdPersonParticleSystem;               // 0x910(0x8)
	class ParticleSystem*                                        AboveWaterFirstPersonParticleSystem;               // 0x918(0x8)
	class ParticleSystem*                                        BelowWaterFirstPersonParticleSystem;               // 0x920(0x8)
	class ParticleSystem*                                        CurrentPressureZeroParticleSystem;                 // 0x928(0x8)
	class ParticleSystem*                                        CurrentPressureOverchargedParticleSystem;          // 0x930(0x8)
	class ParticleSystem*                                        CurrentPressureAboveZeroParticleSystem;            // 0x938(0x8)
	class ParticleSystem*                                        LiquidLauncherChargeParticleSystem;                // 0x940(0x8)
	class WwiseEvent*                                            LiquidLauncherLoopStartEvent;                      // 0x948(0x8)
	class WwiseEvent*                                            LiquidLauncherLoopStopEvent;                       // 0x950(0x8)
	struct FName                                                 LiquidLauncherLoopChargeLevelRTPC;                 // 0x958(0x8)
	struct                                                       LiquidLauncherLoopChargeLevelRTPCRange;            // 0x960(0x10)
	struct FName                                                 LiquidLauncherLoopPressureLevelRTPC;               // 0x970(0x8)
	struct                                                       LiquidLauncherLoopPressureLevelRTPCRange;          // 0x978(0x10)
	class WwiseEvent*                                            LiquidLauncherActivatedEvent;                      // 0x988(0x8)
	class WwiseEvent*                                            LiquidLauncherDeactivatedEvent;                    // 0x990(0x8)
	float                                                        PressureTooLowForSFX;                              // 0x998(0x4)
	class ForceFeedbackEffect*                                   PrimaryUsingLiquidLauncherForceFeedback;           // 0x9a0(0x8)
	class ForceFeedbackEffect*                                   SecondaryUsingLiquidLauncherForceFeedback;         // 0x9a8(0x8)
	class ForceFeedbackEffect*                                   OverchargeUsingLiquidLauncherForceFeedback;        // 0x9b0(0x8)
	float                                                        MaxAmmo;                                           // 0x9b8(0x4)
	float                                                        AmmoDrainPerSecond;                                // 0x9bc(0x4)
	float                                                        MaxPressure;                                       // 0x9c0(0x4)
	float                                                        MaxPressureOvercharge;                             // 0x9c4(0x4)
	float                                                        PressureDrainPerSecond;                            // 0x9c8(0x4)
	float                                                        PressureChargePerSecond;                           // 0x9cc(0x4)
	float                                                        OverchargeDrainDelayInSeconds;                     // 0x9d0(0x4)
	float                                                        FizzSpeed;                                         // 0x9d4(0x4)
	float                                                        WobbleSpeed;                                       // 0x9d8(0x4)
	float                                                        LiquidLevelMin;                                    // 0x9dc(0x4)
	float                                                        LiquidLevelMax;                                    // 0x9e0(0x4)
	class Pawn*                                                  Wielder;                                           // 0x9e8(0x8)
	interface                                                    LiquidLauncherChargeInterface;                     // 0x9f0(0x10)
	class LiquidLauncherChargeVisuals*                           LiquidLauncherChargeVisuals;                       // 0xa00(0x8)
	float                                                        CurrentAmmo;                                       // 0xa58(0x4)
	float                                                        CurrentPressure;                                   // 0xa5c(0x4)
	class MaterialInstanceDynamic*                               FirstPersonLiquidLauncherLiquidMaterial;           // 0xa68(0x8)
	class MaterialInstanceDynamic*                               ThirdPersonLiquidLauncherLiquidMaterial;           // 0xa70(0x8)
};


// Size 0x428 (Full Size[0x7f0] - InheritedSize[0x3c8]
class WieldableItem: public Actor
{
public:
	class PrimitiveComponent*                                    FirstPersonMesh;                                   // 0x428(0x8)
	class PrimitiveComponent*                                    ThirdPersonMesh;                                   // 0x430(0x8)
	class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x438(0x8)
	class UClass*                                                AnimationKey;                                      // 0x440(0x8)
	struct                                                       MessagingDispatcher;                               // 0x448(0xa0)
	struct                                                       AnimationOffset;                                   // 0x4f0(0x30)
	class WwiseEvent*                                            EquipSfx;                                          // 0x520(0x8)
	class WwiseEvent*                                            UnequipSfx;                                        // 0x528(0x8)
	class WwiseEvent*                                            WielderLandedJumpSfx;                              // 0x530(0x8)
	class WwiseEvent*                                            WielderFootstepLayerOneshot;                       // 0x538(0x8)
	struct FName                                                 PlayerWalkSpeedRtpc;                               // 0x540(0x8)
	class WwiseEvent*                                            FirstTimeEquipSfx;                                 // 0x548(0x8)
	bool                                                         ForceUnequipSfx;                                   // 0x550(0x1)
	char                                                         ItemSize;                                          // 0x551(0x1)
	struct                                                       DetailAppearence;                                  // 0x558(0x30)
	bool                                                         PropagateVisibilityToChildren;                     // 0x588(0x1)
	struct FName                                                 AINoiseTag;                                        // 0x58c(0x8)
	TArray<struct Name>                                          ThirdPersonExtraMeshNames;                         // 0x598(0x10)
	TArray<struct Name>                                          StashedExtraMeshNames;                             // 0x5a8(0x10)
	class MeshComponent*                                         StashedMeshComponent;                              // 0x5b8(0x8)
	struct FName                                                 StashedMeshAttachSocket;                           // 0x5c0(0x8)
	struct FName                                                 ServerWieldAttachSocket;                           // 0x5c8(0x8)
	class PhrasesRadialDataAsset*                                Phrases;                                           // 0x5d0(0x8)
	class Object*                                                CachedFirstPersonProxyMesh;                        // 0x5d8(0x8)
	class Object*                                                CachedThirdPersonProxyMesh;                        // 0x5e0(0x8)
	class UClass*                                                ItemCategory;                                      // 0x758(0x8)
	class ItemInfo*                                              ItemInfo;                                          // 0x760(0x8)
	class InterpolatingItem*                                     InterpolatingItem;                                 // 0x768(0x8)
	class Actor*                                                 LastKnownWielder;                                  // 0x788(0x8)
	class WieldableItemVfxComponent*                             WieldableItemVfxComponent;                         // 0x790(0x8)
	TArray<class MeshComponent*>                                 ThirdPersonExtraMeshes;                            // 0x798(0x10)
	TArray<class MeshComponent*>                                 StashedExtraMeshes;                                // 0x7a8(0x10)
	bool                                                         OfferingEnabled;                                   // 0x7d1(0x1)
	struct                                                       QuestId;                                           // 0x7d4(0x10)
};


// Size 0x50 (Full Size[0x418] - InheritedSize[0x3c8]
class TrinketActor: public Actor
{
public:
	class MountableComponent*                                    MountableComponent;                                // 0x3d8(0x8)
	class SceneComponent*                                        RootSceneComponent;                                // 0x3e0(0x8)
	class MergedStaticMeshMemoryConstraintComponent*             MergedStaticMeshMemoryConstraintComponent;         // 0x3e8(0x8)
	class SceneComponent*                                        Pivot;                                             // 0x3f0(0x8)
	class NudgeInterpolationParamsDataAsset*                     NudgeDataAsset;                                    // 0x3f8(0x8)
	class TrinketSfxDataAsset*                                   SfxDataAsset;                                      // 0x400(0x8)
	TArray<struct TrinketIconMaterialParamOverride>              MaterialParamOverridesForIconCapture;              // 0x408(0x10)
};


// Size 0x58 (Full Size[0x420] - InheritedSize[0x3c8]
class ProjectileLauncherMechanismAction: public Actor
{
public:
	class MechanismActionComponent*                              MechanismActionComponent;                          // 0x3d8(0x8)
	char                                                         Mode;                                              // 0x3e0(0x1)
	struct                                                       ProjectilePoolConfiguration;                       // 0x3e8(0x18)
	TArray<class Actor*>                                         IndependentProjectileLaunchers;                    // 0x400(0x10)
};


// Size 0x100 (Full Size[0x4c8] - InheritedSize[0x3c8]
class PreviewShip: public Actor
{
public:
	class SceneComponent*                                        Root;                                              // 0x3d0(0x8)
	class ShipLiveryComponent*                                   LiveryComponent;                                   // 0x3d8(0x8)
	class ReplicatedShipPartCustomizationComponent*              HullLiveryCustomizationComponent;                  // 0x3e0(0x8)
	class ReplicatedShipPartCustomizationComponent*              SailsLiveryCustomizationComponent;                 // 0x3e8(0x8)
	class UClass*                                                FirePropagationBlueprint;                          // 0x3f0(0x8)
	struct                                                       ShipPersistenceIdentifier;                         // 0x3f8(0x10)
	class ShipFirePropagationComponent*                          FirePropagationComponent;                          // 0x408(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ShipHullDamageDataAsset: public DataAsset
{
public:
	struct                                                       DamageParams;                                      // 0x28(0x10)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class ServerPerformanceReplicator: public Actor
{
public:
	float                                                        ServerAverageFPS;                                  // 0x3c8(0x4)
	float                                                        ServerAverageMS;                                   // 0x3cc(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AggressiveGhostShipEncounterFormationsDataAsset: public DataAsset
{
public:
	TArray<struct AggressiveGhostShipEncounterFormationDescGroup> FormationDescGroups;                               // 0x28(0x10)
};


// Size 0x18 (Full Size[0x90] - InheritedSize[0x78]
class AshCloudAIAbility: public AthenaAIAbility
{
public:
	class Pawn*                                                  Owner;                                             // 0x78(0x8)
	class AshCloudAIAbilityParams*                               SetupAbilityParams;                                // 0x80(0x8)
	class AshenLordAshCloud*                                     AshCloudInstance;                                  // 0x88(0x8)
};


// Size 0x80 (Full Size[0x448] - InheritedSize[0x3c8]
class ShroudBreakerService: public Actor
{
public:
	class World*                                                 World;                                             // 0x440(0x8)
};


// Size 0x60 (Full Size[0xc0] - InheritedSize[0x60]
class EventTaleQuestService: public TaleQuestService
{
public:
	map                                                          BoundDelegates;                                    // 0x60(0x50)
};


// Size 0x168 (Full Size[0x1e8] - InheritedSize[0x80]
class BuriedItemStepDesc: public TaleQuestStepDesc
{
public:
	struct                                                       ItemType;                                          // 0x80(0x30)
	struct                                                       ItemSpawnData;                                     // 0xb0(0x30)
	struct                                                       ItemId;                                            // 0xe0(0x30)
	float                                                        DigRadius;                                         // 0x110(0x4)
	struct                                                       SpawnedItemInfo;                                   // 0x118(0x30)
	struct                                                       DiscoveringCharacter;                              // 0x148(0x30)
	bool                                                         TrackBuriedItem;                                   // 0x178(0x1)
	bool                                                         MarkBuriedItemAsCritical;                          // 0x179(0x1)
	bool                                                         MarkActorAsPhased;                                 // 0x17a(0x1)
	struct FText                                                 CriticalActorLostMessage;                          // 0x180(0x38)
	struct                                                       MarkerClass;                                       // 0x1b8(0x30)
};


// Size 0x2f0 (Full Size[0x600] - InheritedSize[0x310]
class KrakenTentacleAIAudioComponent: public AICharacterAudioComponent
{
public:
	float                                                        MouthHeightOffset;                                 // 0x310(0x4)
	class KrakenTentacleAIAudioComponentParams*                  KrakenTentacleAudioParams;                         // 0x318(0x8)
	struct                                                       KrakenTentacleMouthEmitter;                        // 0x320(0x20)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SelectionOfSirenStatues: public Object
{
public:
	TArray<Class>                                                Statues;                                           // 0x28(0x10)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class IslandReservationComponent: public ActorComponent
{
public:
	TArray<struct StoryFlag>                                     ReservationStories;                                // 0xc8(0x10)
};


// Size 0x8 (Full Size[0x8c8] - InheritedSize[0x8c0]
class StaticMeshFloatingItemProxyWithPickupSFX: public StaticMeshFloatingItemProxy
{
public:
	class WwiseEvent*                                            OnPickedUpSfx;                                     // 0x8c0(0x8)
};


// Size 0x18 (Full Size[0x50] - InheritedSize[0x38]
class AnimNotify_RumbleController: public AnimNotify
{
public:
	class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x38(0x8)
	struct FName                                                 ForceFeedbackTag;                                  // 0x40(0x8)
	class ForceFeedbackCondition*                                ForceFeedbackCondition;                            // 0x48(0x8)
};


// Size 0x30 (Full Size[0x90] - InheritedSize[0x60]
class AISpawnContextTaleQuestService: public TaleQuestService
{
public:
	class AISpawnContextTaleQuestServiceDesc*                    Desc;                                              // 0x60(0x8)
};


// Size 0xb0 (Full Size[0x478] - InheritedSize[0x3c8]
class ReapersTributeShipTeleportLocationContainer: public Actor
{
public:
	class TeleportLocationRetrievalComponent*                    TeleportLocationRetrievalComponent;                // 0x3d0(0x8)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class GoldReward: public Reward
{
public:
	uint32                                                       MinGold;                                           // 0x28(0x4)
	uint32                                                       MaxGold;                                           // 0x2c(0x4)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class CompanyVoyageCategoryId: public Object
{
public:
	bool                                                         UseFixedCategoryName;                              // 0x28(0x1)
	struct FString                                               FixedCategoryName;                                 // 0x30(0x10)
};


// Size 0x1b8 (Full Size[0x1e0] - InheritedSize[0x28]
class SirenTridentProjectileParams: public DataAsset
{
public:
	char                                                         ParameterState;                                    // 0x28(0x1)
	struct                                                       ExplosionParams;                                   // 0x30(0x160)
	float                                                        CollisionRadius;                                   // 0x190(0x4)
	float                                                        MaterialScale;                                     // 0x194(0x4)
	float                                                        MaterialScaleChangeDuration;                       // 0x198(0x4)
	float                                                        LaunchSpeed;                                       // 0x19c(0x4)
	float                                                        ChargeTime;                                        // 0x1a0(0x4)
	float                                                        LifeSpan;                                          // 0x1a4(0x4)
	int                                                          AmmoCost;                                          // 0x1a8(0x4)
	float                                                        VfxCustomParameterValue;                           // 0x1ac(0x4)
	struct FName                                                 ProjectileAudioSwitchState;                        // 0x1b0(0x8)
	class WwiseEvent*                                            TrailSfxEventStart;                                // 0x1b8(0x8)
	class WwiseEvent*                                            TrailSfxEventStop;                                 // 0x1c0(0x8)
	class UClass*                                                ImpactId;                                          // 0x1c8(0x8)
	class ForceFeedbackEffect*                                   FireForceFeedback;                                 // 0x1d0(0x8)
	class ForceFeedbackEffect*                                   SizeChangeForceFeedback;                           // 0x1d8(0x8)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class FlamesOfFateSettingsService: public Actor
{
public:
	class FlamesOfFateSettingsAsset*                             Settings;                                          // 0x3d0(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class TaleBlockedByFactionDataAsset: public DataAsset
{
public:
	TArray<struct Name>                                          BlockedCampaignId;                                 // 0x28(0x10)
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class ResolveActorStringReferenceStepDesc: public TaleQuestStepDesc
{
public:
	struct                                                       ActorVariable;                                     // 0x80(0x30)
	struct                                                       ActorReference;                                    // 0xb0(0x10)
};


// Size 0x40 (Full Size[0x320] - InheritedSize[0x2e0]
class WorldRegionComponent: public SceneComponent
{
public:
	struct FName                                                 WorldRegionName;                                   // 0x2e0(0x8)
	class UClass*                                                RegionShanty;                                      // 0x2e8(0x8)
	float                                                        WorldRegionRadius;                                 // 0x2f0(0x4)
};


// Size 0x80 (Full Size[0x448] - InheritedSize[0x3c8]
class PuzzleStatueBase: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x3d8(0x8)
	class PuzzleStatueInteractableComponent*                     InteractableComponent;                             // 0x3e0(0x8)
	class LockComponent*                                         LockComponent;                                     // 0x3e8(0x8)
	bool                                                         IsStatueDisabled;                                  // 0x3f0(0x1)
	bool                                                         IsStatueActive;                                    // 0x3f1(0x1)
	float                                                        MinDamageToTriggerStatue;                          // 0x3f4(0x4)
	class PuzzleStatueBaseAudioParamsDataAsset*                  PuzzleStatueBaseAudioParams;                       // 0x400(0x8)
	class PuzzleStatueVFXComponent*                              PuzzleStatueVFXComponent;                          // 0x408(0x8)
	class ParticleSystemComponent*                               LockPositionParticleSystem;                        // 0x410(0x8)
	class ParticleSystemComponent*                               OneShotLockPositionParticleSystem;                 // 0x418(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AthenaAnimationItemListingAsset: public DataAsset
{
public:
	TArray<class AthenaAnimationsGroupingAssetBase*>             AnimationGroupings;                                // 0x28(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class CutsceneService: public Object
{
public:
	TArray<class Actor*>                                         RegisteredCutsceneActors;                          // 0x30(0x10)
};


// Size 0x10 (Full Size[0x70] - InheritedSize[0x60]
class BlockEarthquakeTaleQuestService: public TaleQuestService
{
public:
	class BlockEarthquakeTaleQuestServiceDesc*                   Desc;                                              // 0x60(0x8)
};


// Size 0x20 (Full Size[0x3e8] - InheritedSize[0x3c8]
class CargoRunService: public Actor
{
public:
	TArray<struct ClientCargoRunCrewDataUnit>                    ClientCrewData;                                    // 0x3d8(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class GenericPartDescAsset: public ShipPartDescAsset
{
public:
	struct                                                       GenericPartDesc;                                   // 0x28(0x18)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class NPCOnSurfaceCannonManager: public Object
{
public:
	TArray<struct NPCOnSurfaceCannonManagerCannon>               Cannons;                                           // 0x28(0x10)
	class NPCOnSurfaceCannonManagerDataAsset*                    CannonManagerDataAsset;                            // 0x38(0x8)
	class NPCOnSurfaceCannonManagerCrewSizeSettingsDataAsset*    CannonManagerCrewSizeSettingsDataAsset;            // 0x40(0x8)
};


// Size 0x168 (Full Size[0x530] - InheritedSize[0x3c8]
class ItemInfo: public Actor
{
public:
	bool                                                         CanBeStoredInInventory;                            // 0x3e8(0x1)
	multicastinlinedelegate                                      OnItemPickedUpDelegate;                            // 0x3f0(0x10)
	multicastinlinedelegate                                      OnItemDroppedDeletage;                             // 0x400(0x10)
	class UClass*                                                WieldableType;                                     // 0x440(0x8)
	class UClass*                                                ProxyType;                                         // 0x448(0x8)
	class WieldableItemPersistentCooldownComponent*              WieldableItemPersistenceCooldownComponent;         // 0x450(0x8)
	bool                                                         ExcludeFromMigration;                              // 0x458(0x1)
	class ItemDesc*                                              Desc;                                              // 0x460(0x8)
	char                                                         CurrentRepresentation;                             // 0x468(0x1)
	class Actor*                                                 CurrentRepresentationInstance;                     // 0x470(0x8)
	class Actor*                                                 CurrentOwner;                                      // 0x478(0x8)
	class Actor*                                                 TutorialOwner;                                     // 0x480(0x8)
	bool                                                         DoNotConsiderForMigrationGather;                   // 0x529(0x1)
	bool                                                         DestroyPostMigration;                              // 0x52b(0x1)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class VaultMaterialSetDataAsset: public DataAsset
{
public:
	TArray<struct BlockDecalMaterials>                           BlockConfigurations;                               // 0x28(0x10)
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class StatusResponseToggleInteractionPoint: public StatusResponse
{
public:
	TArray<class Class*>                                         InteractionPointClasses;                           // 0x30(0x10)
	char                                                         ShipCurseTag;                                      // 0x40(0x1)
	char                                                         CurseTag;                                          // 0x41(0x1)
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class StarChart: public Actor
{
public:
	TArray<class Actor*>                                         StarClustersAndConstellations;                     // 0x3d8(0x10)
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class StatusResponseStun: public StatusResponse
{
public:
	char                                                         AnimType;                                          // 0x30(0x1)
	char                                                         IsItemWieldingAllowed;                             // 0x31(0x1)
	float                                                        Duration;                                          // 0x34(0x4)
	bool                                                         PlayScreenVfx;                                     // 0x38(0x1)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class BedPartDescAsset: public ShipPartDescAsset
{
public:
	struct                                                       BedPartDesc;                                       // 0x28(0x10)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class StatusResponsePlayAudioOneShotOnLocalClient: public StatusResponse
{
public:
	class WwiseEvent*                                            OneShotAudioEvent;                                 // 0x30(0x8)
};


// Size 0x30 (Full Size[0x820] - InheritedSize[0x7f0]
class MerchantCrate: public LargeSkeletalMeshWieldableItem
{
public:
	struct                                                       FullCrateSfx;                                      // 0x7e8(0x20)
	interface                                                    MountpointInterface;                               // 0x808(0x10)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class StatusResponsePlayAudioLoopOnAllClients: public StatusResponse
{
public:
	class WwiseEvent*                                            StartLoopEvent;                                    // 0x30(0x8)
	class WwiseEvent*                                            StopLoopEvent;                                     // 0x38(0x8)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class DeliverableCompanyRequirement: public DeliverableRequirementBase
{
public:
	TArray<class Class*>                                         AcceptedCompanies;                                 // 0x30(0x10)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class WorldMapIslandDataAsset: public DataAsset
{
public:
	class Texture*                                               Texture;                                           // 0x28(0x8)
	struct                                                       CaptureParams;                                     // 0x30(0x40)
	float                                                        LabelOffset;                                       // 0x70(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AggressiveGhostShipMineFormationsDataAsset: public DataAsset
{
public:
	TArray<struct AggressiveGhostShipMineFormationOptions>       MineFormationOptions;                              // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AthenaAnimationEmoteListingAsset: public DataAsset
{
public:
	TArray<class AthenaAnimationEmoteGroupingAsset*>             EmoteGroupings;                                    // 0x28(0x10)
};


// Size 0x30 (Full Size[0x3f8] - InheritedSize[0x3c8]
class Hole: public Actor
{
public:
	float                                                        BoundsScaleFactor;                                 // 0x3c8(0x4)
	float                                                        LifeTimeSpan;                                      // 0x3cc(0x4)
	float                                                        DestroyTimeSpan;                                   // 0x3d0(0x4)
	float                                                        ChanceOfSpawningAnItem;                            // 0x3d4(0x4)
	TArray<struct HoleItemToSpawn>                               ItemsToSpawn;                                      // 0x3d8(0x10)
	char                                                         State;                                             // 0x3f0(0x1)
};


// Size 0x28 (Full Size[0x88] - InheritedSize[0x60]
class AnimNotifyState_AthenaTimedParticleEffect: public AnimNotifyState_TimedParticleEffect
{
public:
	struct                                                       RelativeScale;                                     // 0x60(0xc)
	struct                                                       ColorTint;                                         // 0x6c(0x10)
	float                                                        CustomParameter;                                   // 0x7c(0x4)
	bool                                                         Attached;                                          // 0x80(0x1)
	bool                                                         KeepWorldScale;                                    // 0x80(0x1)
	char                                                         UnderwaterMode;                                    // 0x84(0x1)
	char                                                         CustomLocalSpaceMode;                              // 0x85(0x1)
};


// Size 0x250 (Full Size[0x690] - InheritedSize[0x440]
class NPCAnimInstance: public AnimInstance
{
public:
	class Actor*                                                 LeftHandObject;                                    // 0x470(0x8)
	class Actor*                                                 RightHandObject;                                   // 0x478(0x8)
	class NPCHeldObjectData*                                     HeldObjectList;                                    // 0x480(0x8)
	class SkeletalMeshComponent*                                 NPCSkeletalMesh;                                   // 0x488(0x8)
	TArray<class Actor*>                                         InitialSpawnedCosmeticItems;                       // 0x490(0x10)
	struct                                                       HitReactionState;                                  // 0x4a0(0x28)
	struct                                                       HitReactionData;                                   // 0x4c8(0x8)
	bool                                                         LookAtActive;                                      // 0x4d0(0x1)
	bool                                                         CustomAnimationLookAtActive;                       // 0x4d1(0x1)
	float                                                        LookAtIKAlpha;                                     // 0x4d4(0x4)
	float                                                        LookAtEnabledInterpolationTime;                    // 0x4d8(0x4)
	float                                                        LookAtDisabledInterpolationTime;                   // 0x4dc(0x4)
	bool                                                         DisableLookAt;                                     // 0x4e0(0x1)
	float                                                        MinimumRunSpeed;                                   // 0x4e4(0x4)
	class NPCCustomAnimationDataAsset*                           NPCCustomAnimationData;                            // 0x4e8(0x8)
	struct                                                       NPCCustomAnimationBlueprintData;                   // 0x4f0(0x68)
	bool                                                         InitialSpawnedCosmeticItemsActive;                 // 0x558(0x1)
	class AnimMontage*                                           NPCCustomAnimationCurrentMontage;                  // 0x560(0x8)
	class AnimMontage*                                           NPCCustomAnimationCurrentFacialAdditiveMontage;    // 0x568(0x8)
	TArray<class AnimSequence*>                                  IdleVariantAnims;                                  // 0x570(0x10)
	TArray<class AnimSequence*>                                  InactiveVariantAnims;                              // 0x580(0x10)
	TArray<class AnimSequence*>                                  InteractVariantAnims;                              // 0x590(0x10)
	struct                                                       NPCAllocatedIdleAnimations;                        // 0x5a0(0x20)
	struct                                                       NPCAllocatedInteractResponseAnimations;            // 0x5c0(0x10)
	class NPCInteractAnimResponseDataAsset*                      NPCInteractAnimResponseDataAsset;                  // 0x5d0(0x8)
	class UClass*                                                CurrentInteractResponse;                           // 0x5d8(0x8)
	float                                                        InteractResponseEntryTime;                         // 0x5e0(0x4)
	bool                                                         ResetInteractResponse;                             // 0x5e4(0x1)
	bool                                                         IsReacting;                                        // 0x5e5(0x1)
	class AnimSequence*                                          DefaultInteractionResponseStateAnim;               // 0x5e8(0x8)
	class AnimSequence*                                          PositiveInteractionResponseStateAnim;              // 0x5f0(0x8)
	class AnimSequence*                                          NegitiveInteractionResponseStateAnim;              // 0x5f8(0x8)
	bool                                                         Active;                                            // 0x600(0x1)
	bool                                                         Interacting;                                       // 0x601(0x1)
	float                                                        DotProductFOV;                                     // 0x604(0x4)
	char                                                         PreviousCustomAnimationState;                      // 0x608(0x1)
	bool                                                         UseLookAt;                                         // 0x609(0x1)
	bool                                                         SafeUseLookAt;                                     // 0x60a(0x1)
	struct                                                       LookAtPlayerPosition;                              // 0x60c(0xc)
	bool                                                         PlayerCharacterIsValid;                            // 0x618(0x1)
	bool                                                         IsPlayingSequencerAnim;                            // 0x619(0x1)
	bool                                                         IsOffering;                                        // 0x61a(0x1)
	bool                                                         IsShowingOffer;                                    // 0x61b(0x1)
	bool                                                         IsMoving;                                          // 0x61c(0x1)
	bool                                                         IsRunning;                                         // 0x61d(0x1)
	float                                                        MovementSpeed;                                     // 0x620(0x4)
	bool                                                         IsTalking;                                         // 0x624(0x1)
	bool                                                         ShouldIdleWhileInteracting;                        // 0x625(0x1)
	bool                                                         CanGoInactive;                                     // 0x626(0x1)
	float                                                        InteractionRange;                                  // 0x65c(0x4)
	bool                                                         UseTalkingAdditive;                                // 0x660(0x1)
	float                                                        TalkingAdditiveAlpha;                              // 0x664(0x4)
	float                                                        InactiveStateSupressionTime;                       // 0x668(0x4)
	class Character*                                             PlayerCharacter;                                   // 0x670(0x8)
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class AthenaAnimationDeathDataAsset: public DataAsset
{
public:
	class AnimSequence*                                          SwimmingSurfaceDeath;                              // 0x28(0x8)
	class AnimSequence*                                          LocomotionDeath;                                   // 0x30(0x8)
	class AnimSequence*                                          DrowningDeath;                                     // 0x38(0x8)
	struct                                                       WakeUp;                                            // 0x40(0x10)
	struct                                                       WakeUpSwimming;                                    // 0x50(0x10)
	class BlendSpace1D*                                          DrowningDeathBS;                                   // 0x60(0x8)
	struct                                                       BeckonInto;                                        // 0x68(0x10)
	struct                                                       BeckonLoop;                                        // 0x78(0x10)
	class UClass*                                                RevivingStateId;                                   // 0x88(0x8)
	class UClass*                                                DeadStateId;                                       // 0x90(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class LimpingTestActor: public Actor
{
public:
	class LimpingComponent*                                      Limping;                                           // 0x3c8(0x8)
};


// Size 0x20 (Full Size[0x3e8] - InheritedSize[0x3c8]
class GlobalEmitterService: public Actor
{
public:
	class ImpactListDataAsset*                                   ImpactListDataAsset;                               // 0x3e0(0x8)
};


// Size 0x18 (Full Size[0xe0] - InheritedSize[0xc8]
class NetworkTriggeredVFXComponent: public ActorComponent
{
public:
	TArray<class Object*>                                        NetworkTriggerableVFX;                             // 0xc8(0x10)
	class ParticleSystemComponent*                               CurrentlyPlayingParticleSystem;                    // 0xd8(0x8)
};


// Size 0x108 (Full Size[0x1d0] - InheritedSize[0xc8]
class DitherComponent: public ActorComponent
{
public:
	bool                                                         FindMeshOnOwner;                                   // 0xd0(0x1)
	float                                                        FadeTime;                                          // 0xd4(0x4)
	map                                                          DynamicMaterialsPerMeshComponent;                  // 0xe8(0x50)
	bool                                                         PurgeOverrideMatsOnDynamicMatMeshLoaded;           // 0x1cc(0x1)
	bool                                                         FadeInOnStart;                                     // 0x1cd(0x1)
};


// Size 0x98 (Full Size[0xf8] - InheritedSize[0x60]
class TaleQuestStructGenService: public TaleQuestService
{
public:
	struct                                                       Params;                                            // 0x60(0x78)
	TArray<struct TQStructGenSelection>                          QuestChain;                                        // 0xd8(0x10)
	class TaleResourceBrokerService*                             ResourceBroker;                                    // 0xe8(0x8)
	class GameEventExclusionZoneTaleService*                     GameEventExclusionZoneService;                     // 0xf0(0x8)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class SkellyFortListDataAsset: public DataAsset
{
public:
	TArray<class SkellyFortDataAsset*>                           FortsList;                                         // 0x28(0x10)
	TArray<class Class*>                                         SaferSeasEventBlacklist;                           // 0x38(0x10)
};


// Size 0x588 (Full Size[0x650] - InheritedSize[0xc8]
class ScreenSpaceVfxComponent: public ActorComponent
{
public:
	class ScreenSpaceVFXComponentParams*                         Params;                                            // 0xc8(0x8)
	TArray<class ParticleSystemComponent*>                       ScreenSpaceParticleSystems;                        // 0xd8(0x10)
};


// Size 0x30 (Full Size[0x470] - InheritedSize[0x440]
class MemoryTestPawn: public Pawn
{
public:
	float                                                        Speed;                                             // 0x440(0x4)
	multicastinlinedelegate                                      OnIslandVisited;                                   // 0x448(0x10)
};


// Size 0x70 (Full Size[0x448] - InheritedSize[0x3d8]
class CaptaincyShipCustomizationChestInteraction: public ModalInteraction
{
public:
	TArray<struct FeaturedShipCustomizationCategory>             ShipLiveryCategories;                              // 0x3d8(0x10)
	TArray<struct FeaturedShipCustomizationCategory>             ShipDecorationCategories;                          // 0x3e8(0x10)
	bool                                                         AllTab;                                            // 0x3f8(0x1)
	bool                                                         SwapAllToSavedLoadout;                             // 0x3f9(0x1)
	TArray<class Class*>                                         PreviousLoadout;                                   // 0x438(0x10)
};


// Size 0x160 (Full Size[0x440] - InheritedSize[0x2e0]
class WieldedItemComponent: public SceneComponent
{
public:
	class WieldableItemSetComponent*                             WieldableItemSetComponent;                         // 0x2e0(0x8)
	class Actor*                                                 ReplicatedCurrentlyWieldedItem;                    // 0x2e8(0x8)
	class Actor*                                                 CurrentlyWieldedItem;                              // 0x2f0(0x8)
	int                                                          EpochId;                                           // 0x410(0x4)
	struct                                                       PendingServerWieldSet;                             // 0x420(0x1c)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ProjectileWeaponValidationFunctionLibrary: public BlueprintFunctionLibrary
{
public:
	float                                                        AimPositionValidationTolerance;                    // 0x28(0x4)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class MeshMemoryConstraintFallbackCategoryDataAsset: public DataAsset
{
public:
	class UClass*                                                ConstraintCategory;                                // 0x28(0x8)
	struct                                                       MeshFallbackReference;                             // 0x30(0x10)
	int64                                                        CachedMeshResourceSize;                            // 0x40(0x8)
};


// Size 0x50 (Full Size[0x98] - InheritedSize[0x48]
class PreSpawnMusicZoneSpawnerStrategy: public SpawnerBehaviourStrategy
{
public:
	class UClass*                                                PreSpawnMusicZoneActor;                            // 0x48(0x8)
	class UClass*                                                PostSpawnMusicZoneActor;                           // 0x50(0x8)
	bool                                                         ShouldPlayBattleWonSting;                          // 0x58(0x1)
	bool                                                         ShouldStopMusicZoneWhenWaveCompleted;              // 0x59(0x1)
	class Actor*                                                 SpawnedActor;                                      // 0x60(0x8)
	class MusicZoneComponent*                                    MusicZoneComponent;                                // 0x68(0x8)
};


// Size 0xa0 (Full Size[0x168] - InheritedSize[0xc8]
class TankardRefillerComponent: public ActorComponent
{
public:
	char                                                         ActionDisplayPriority;                             // 0xc8(0x1)
	class UClass*                                                NotificationInputId;                               // 0xd0(0x8)
	char                                                         RefillLiquidType;                                  // 0xd8(0x1)
	bool                                                         IgnoreLiquidType;                                  // 0xd9(0x1)
	int                                                          Capacity;                                          // 0xdc(0x4)
	int                                                          RemainingGrogs;                                    // 0xe0(0x4)
	struct FText                                                 RefillTankardTooltipDescription;                   // 0xe8(0x38)
	struct FText                                                 NotWieldingTankardTooltipDescription;              // 0x120(0x38)
};


// Size 0x48 (Full Size[0x410] - InheritedSize[0x3c8]
class TeleportTriggerObject: public TriggerObject
{
public:
	class Actor*                                                 TargetTeleportActor;                               // 0x3c8(0x8)
	struct                                                       TeleportOffset;                                    // 0x3d0(0x30)
	float                                                        RelevancyTimeout;                                  // 0x400(0x4)
};


// Size 0x160 (Full Size[0x188] - InheritedSize[0x28]
class FragileComponentDataAsset: public DataAsset
{
public:
	float                                                        DefaultDamageScalar;                               // 0x28(0x4)
	class CurveFloat*                                            DropDistanceToDamageCurve;                         // 0x30(0x8)
	class CurveFloat*                                            FallSpeedToDamageCurve;                            // 0x38(0x8)
	class WwiseEvent*                                            DamageSound;                                       // 0x40(0x8)
	struct FName                                                 ObjectDamageRTPCName;                              // 0x48(0x8)
	class Object*                                                DamageVfx;                                         // 0x50(0x8)
	struct FName                                                 DamageVfxSocketName;                               // 0x58(0x8)
	float                                                        SignificantHealthChangeAbsolute;                   // 0x60(0x4)
	map                                                          ShipDamageTypeMappings;                            // 0x68(0x50)
	TArray<struct FragileComponentShipDamageTypeEntry>           ShipDamageTypeValues;                              // 0x158(0x10)
	TArray<struct FragileComponentHealthScalarEntry>             DamageTypeScalars;                                 // 0x168(0x10)
	TArray<char>                                                 BlockedHealthChangedReasons;                       // 0x178(0x10)
};


// Size 0x1e8 (Full Size[0x2b0] - InheritedSize[0xc8]
class PlayerTelemetryComponent: public ActorComponent
{
public:
	float                                                        HeartbeatInterval;                                 // 0x12c(0x4)
	struct                                                       SpawnTimestamp;                                    // 0x280(0x8)
};


// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class EntitlementDesc: public DataAsset
{
public:
	struct FText                                                 Title;                                             // 0x28(0x38)
	struct FText                                                 Description;                                       // 0x60(0x38)
	struct                                                       IconInvPath;                                       // 0x98(0x10)
	struct                                                       IconPrvPath;                                       // 0xa8(0x10)
	class UClass*                                                Category;                                          // 0xb8(0x8)
	class UClass*                                                Company;                                           // 0xc0(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class DiggingEffectsDataAsset: public DataAsset
{
public:
	TArray<struct ItemDiggingEffectsOverride>                    EffectsOverrides;                                  // 0x28(0x10)
	class ItemDiggingEffectsConfig*                              Default;                                           // 0x38(0x8)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class ContestAddItemToHandInListStepDesc: public TaleQuestStepDesc
{
public:
	class UClass*                                                Item;                                              // 0x80(0x8)
	struct                                                       NPC;                                               // 0x88(0x30)
};


// Size 0x20 (Full Size[0x3e8] - InheritedSize[0x3c8]
class FlamesOfFateLantern: public Actor
{
public:
	char                                                         FlameOfFateType;                                   // 0x3c8(0x1)
};


// Size 0x120 (Full Size[0x148] - InheritedSize[0x28]
class AthenaCharacterMovementUnderwater: public DataAsset
{
public:
	bool                                                         bSphere;                                           // 0x28(0x1)
	float                                                        Radius;                                            // 0x2c(0x4)
	float                                                        HalfHeight;                                        // 0x30(0x4)
	float                                                        PenResolveInflation;                               // 0x34(0x4)
	float                                                        PullBackDistance;                                  // 0x38(0x4)
	float                                                        FanOutAngle;                                       // 0x3c(0x4)
	float                                                        MaxFanOutScalar;                                   // 0x40(0x4)
	uint32                                                       FanOutNumSteps;                                    // 0x44(0x4)
	float                                                        IdleBobSpeed;                                      // 0x48(0x4)
	float                                                        IdleBobDuration;                                   // 0x4c(0x4)
	struct FName                                                 CollisionProfileName;                              // 0x50(0x8)
	class CurveFloat*                                            VelocityToAngle;                                   // 0x58(0x8)
	uint32                                                       MaxExpectedHits;                                   // 0x60(0x4)
	bool                                                         bDrawDebugCapsule;                                 // 0x64(0x1)
	bool                                                         bDebugOldMovement;                                 // 0x65(0x1)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class CheckIsActorCriticalStep: public TaleQuestStep
{
public:
	class CheckIsActorCriticalStepDesc*                          StepDesc;                                          // 0x98(0x8)
};


// Size 0x100 (Full Size[0x128] - InheritedSize[0x28]
class CrewVoyageParticipant: public Object
{
public:
	class PlayerState*                                           PlayerState;                                       // 0x108(0x8)
};


// Size 0xf8 (Full Size[0x120] - InheritedSize[0x28]
class NPCOnSurfaceCannonManagerDataAsset: public DataAsset
{
public:
	struct FName                                                 CannonLocationsGroupName;                          // 0x28(0x8)
	bool                                                         GoStraightToCannonIfPossible;                      // 0x30(0x1)
	bool                                                         StayOnCannonEvenWhenThereAreNoTargets;             // 0x31(0x1)
	struct                                                       MinTimeInFallbackLocation;                         // 0x38(0x30)
	float                                                        TimeOnCannonBeforeStartAiming;                     // 0x68(0x4)
	float                                                        TimeBetweenCannonChangeLocationCheck;              // 0x6c(0x4)
	struct                                                       MinTimeOnCannon;                                   // 0x70(0x30)
	float                                                        TimeBetweenCannonBeingUsedChecks;                  // 0xa0(0x4)
	float                                                        TimeBetweenTargetUpdates;                          // 0xa4(0x4)
	float                                                        TimeBetweenCannonMoveUpdates;                      // 0xa8(0x4)
	float                                                        TimeToWaitForCannonToAimBeforeTryingToFireAgain;   // 0xac(0x4)
	float                                                        CannonPitchYawAimTolerenceHalfAngle;               // 0xb0(0x4)
	struct                                                       NearMissDistanceInMetres;                          // 0xb8(0x30)
	class UClass*                                                DefaultCannonballItemDesc;                         // 0xe8(0x8)
	assetclass                                                   AnimationData;                                     // 0xf0(0x20)
	float                                                        NearbyEncountersDistanceInMetres;                  // 0x110(0x4)
	struct                                                       FireCannonMontageId;                               // 0x114(0x8)
};


// Size 0x30 (Full Size[0xf8] - InheritedSize[0xc8]
class LightFadingComponent: public ActorComponent
{
public:
	bool                                                         FindLightOnOwner;                                  // 0xd0(0x1)
	float                                                        FadeTime;                                          // 0xd4(0x4)
	class LightComponent*                                        LightComponent;                                    // 0xe0(0x8)
	bool                                                         FadeInOnStart;                                     // 0xf0(0x1)
};


// Size 0xc0 (Full Size[0x188] - InheritedSize[0xc8]
class IntentComponent: public ActorComponent
{
public:
	char                                                         AckToken;                                          // 0xd8(0x1)
	bool                                                         RequiresHandshake;                                 // 0xd9(0x1)
	float                                                        ServerIntent;                                      // 0xdc(0x4)
	float                                                        LocalIntent;                                       // 0xe0(0x4)
};


// Size 0x28 (Full Size[0xf0] - InheritedSize[0xc8]
class LoadingPointComponent: public ActorComponent
{
public:
	TArray<struct CanLoadItemCategoryEntry>                      CanLoadItemCategories;                             // 0xd0(0x10)
	TArray<struct CanLoadItemCategoryEntry>                      CanUnloadItemCategories;                           // 0xe0(0x10)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class GetIsShipInSafeWatersStepDesc: public TaleQuestStepDesc
{
public:
	struct                                                       Result;                                            // 0x80(0x30)
};


// Size 0x80 (Full Size[0xa8] - InheritedSize[0x28]
class GameEventBannerDataAsset: public DataAsset
{
public:
	struct FText                                                 Header;                                            // 0x28(0x38)
	struct FText                                                 Footer;                                            // 0x60(0x38)
	struct FName                                                 Tag;                                               // 0x98(0x8)
	bool                                                         DisableMusic;                                      // 0xa0(0x1)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SirenStatuesSelector_BasedOnShipSize: public SirenStatuesSelector
{
public:
	TArray<struct SirenStatuesSelector_BasedOnShipSize_Entry>    Entries;                                           // 0x28(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class MapMarkRenderResource: public MapRenderResource
{
public:
	class UClass*                                                MarkTypeId;                                        // 0x28(0x8)
};


// Size 0x10 (Full Size[0x320] - InheritedSize[0x310]
class ShipwreckAudioEmitterComponent: public WwiseEmitterComponent
{
public:
	class WwiseEvent*                                            WwiseEvent;                                        // 0x310(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class TavernStrangersBarrel: public Actor
{
public:
	class StaticMeshComponent*                                   BarrelMeshComponent;                               // 0x3c8(0x8)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class DebugTeleportCrewStep: public TaleQuestStep
{
public:
	class DebugTeleportCrewStepDesc*                             Desc;                                              // 0x98(0x8)
};


// Size 0xe8 (Full Size[0x4b0] - InheritedSize[0x3c8]
class Ensemble: public Actor
{
public:
	class ShantyItemDesc*                                        ShantyDesc;                                        // 0x3f8(0x8)
	TArray<class Actor*>                                         Instruments;                                       // 0x400(0x10)
	TArray<struct InstrumentHandlePairedWithActor>               OldInstruments;                                    // 0x410(0x10)
	TArray<struct InstrumentHandlePairedWithActor>               NewInstruments;                                    // 0x420(0x10)
	struct                                                       OverrideLeadPosition;                              // 0x430(0xc)
	bool                                                         UseOverrideLeadPosition;                           // 0x43c(0x1)
	struct                                                       ShantyData;                                        // 0x458(0x30)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class RewardDistributionModelDataAsset: public DataAsset
{
public:
	struct                                                       RewardDistributionModelData;                       // 0x28(0x20)
};


// Size 0x3e0 (Full Size[0xbd0] - InheritedSize[0x7f0]
class WieldableBook: public SkeletalMeshWieldableItem
{
public:
	map                                                          ProcPageCache;                                     // 0x7f8(0x50)
	class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x848(0x8)
	struct                                                       MaterialHandler;                                   // 0x850(0x188)
	class WieldableBookRendererSettings*                         RendererSettings;                                  // 0x9d8(0x8)
	class DirectionalLightComponent*                             DirectionalLightComponent;                         // 0x9e0(0x8)
	bool                                                         BuildProceduralPageCacheOnRep;                     // 0x9e8(0x1)
	float                                                        ShadowCascadeDistributionExponentWhenUsing;        // 0x9ec(0x4)
	float                                                        ShadowCascadeDistributionExponentTransitionTime;   // 0x9f0(0x4)
	float                                                        ExtraPageTurnDurationForForceRedraw;               // 0x9f4(0x4)
	bool                                                         ShouldAlterAudio;                                  // 0x9f8(0x1)
	struct FName                                                 AudioGameStateGroup;                               // 0x9fc(0x8)
	struct FName                                                 AudioGameStateIngame;                              // 0xa04(0x8)
	struct FName                                                 AudioGameStateInBook;                              // 0xa0c(0x8)
	float                                                        PageTurnDuration;                                  // 0xa14(0x4)
	float                                                        PageTurnForceRedrawDuration;                       // 0xa18(0x4)
	class PostProcessComponent*                                  CachedPostProcessComponent;                        // 0xa20(0x8)
	class MaterialInterface*                                     WieldedPostProcessMaterial;                        // 0xa28(0x8)
	class MaterialInstanceDynamic*                               WieldedPostProcessMaterialInstance;                // 0xa30(0x8)
	float                                                        WieldedPostProcessStartBlend;                      // 0xa38(0x4)
	float                                                        WieldedPostProcessEndBlend;                        // 0xa3c(0x4)
	float                                                        WieldedPostProcessDuration;                        // 0xa40(0x4)
	bool                                                         WieldedPostProcessShouldIgnoreMesh;                // 0xa44(0x1)
	struct FName                                                 WieldedTimedBlendVectorName;                       // 0xa48(0x8)
	struct                                                       ReplicationInfo;                                   // 0xa50(0x28)
	class WieldableBookPageList*                                 PageList;                                          // 0xa78(0x8)
};


// Size 0x10 (Full Size[0x800] - InheritedSize[0x7f0]
class WoodPlank: public StaticMeshWieldableItem
{
public:
	class InventoryItemComponent*                                InventoryItem;                                     // 0x7f0(0x8)
	class ConsumableWieldableComponent*                          ConsumableWieldable;                               // 0x7f8(0x8)
};


// Size 0x28 (Full Size[0xf0] - InheritedSize[0xc8]
class AnimatedStepsComponent: public ActorComponent
{
public:
	class PoseableSkeletalMeshComponent*                         Mesh;                                              // 0xc8(0x8)
	TArray<class BoxComponent*>                                  Boxes;                                             // 0xd0(0x10)
	TArray<struct Vector>                                        BoxOrigins;                                        // 0xe0(0x10)
};


// Size 0x88 (Full Size[0x150] - InheritedSize[0xc8]
class MechanismTriggerComponent: public ActorComponent
{
public:
	char                                                         TriggerType;                                       // 0xd8(0x1)
	multicastinlinedelegate                                      OnMechanismActionRegisteredWithTriggerDelegate;    // 0xe0(0x10)
	multicastinlinedelegate                                      OnMechanismActionUnregisteredWithTriggerDelegate;  // 0xf0(0x10)
	multicastinlinedelegate                                      OnMechanismTriggerChangedMechanismActionStatesDelegate; // 0x100(0x10)
	multicastinlinedelegate                                      OnMechanismTriggerStateChangedDelegate;            // 0x110(0x10)
	multicastinlinedelegate                                      OnMechanismTriggerResetDelegate;                   // 0x120(0x10)
	char                                                         TriggerState;                                      // 0x140(0x1)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class DeliverableRedirectionBootyContextHandler: public DeliverableRedirectionContextHandlerBase
{
public:
	TArray<char>                                                 TargetBootyTypes;                                  // 0x30(0x10)
};


// Size 0xa8 (Full Size[0xe0] - InheritedSize[0x38]
class ItemSettings: public DeveloperSettings
{
public:
	struct                                                       DropItemParams;                                    // 0x38(0x48)
	struct                                                       AIPriorityDropItemParams;                          // 0x80(0x48)
	char                                                         AutoAimCollisionChannel;                           // 0xc8(0x1)
	TArray<class Class*>                                         ItemClassesToBeNamedByCategory;                    // 0xd0(0x10)
};


// Size 0x198 (Full Size[0x1c0] - InheritedSize[0x28]
class FishingRodSetupDataAsset: public DataAsset
{
public:
	class UClass*                                                FishActorInteractionDesc;                          // 0x28(0x8)
	float                                                        DelayBeforeAllowingACast;                          // 0x30(0x4)
	float                                                        DelayBeforeCreatingFishingFloat;                   // 0x34(0x4)
	float                                                        DelayBeforeDestroyingFishingFloat;                 // 0x38(0x4)
	class UClass*                                                FishingFloatType;                                  // 0x40(0x8)
	char                                                         HitTestTraceChannel;                               // 0x48(0x1)
	float                                                        PreCastingPlayerSpeedModifier;                     // 0x4c(0x4)
	float                                                        CastingTimeBeforeTurningOnHits;                    // 0x50(0x4)
	float                                                        TimeBetweenIsFloatLocationValidChecks;             // 0x54(0x4)
	float                                                        SingleFishAnimationLoopDuration;                   // 0x58(0x4)
	float                                                        DriftOffsetToStopFishJumping;                      // 0x5c(0x4)
	TArray<struct DebugFishSelectionBreed>                       FishBreeds;                                        // 0x60(0x10)
	TArray<struct DebugFishSelectionBreed>                       FishBreedsInAPond;                                 // 0x70(0x10)
	TArray<struct FishingRodForceFeedbackLevel>                  ForceFeedbackLevels;                               // 0x80(0x10)
	TArray<struct FishingComedyItemInfo>                         ComedyItems;                                       // 0x90(0x10)
	float                                                        ChanceOfComedyItems;                               // 0xa0(0x4)
	float                                                        DistanceFromPlayerToCatchComedyItem;               // 0xa4(0x4)
	TArray<class Class*>                                         DisallowedTunnelsOfTheDamnedFish;                  // 0xa8(0x10)
	TArray<class Class*>                                         DisallowedTunnelsOfTheDamnedComedyItems;           // 0xb8(0x10)
	TArray<struct FishBaitInfo>                                  FishBait;                                          // 0xc8(0x10)
	float                                                        RopeThickness;                                     // 0xd8(0x4)
	float                                                        RopeSlackAtMaxDistance;                            // 0xdc(0x4)
	float                                                        RopeSlackAtMinDistance;                            // 0xe0(0x4)
	float                                                        RopeOnRodSlack;                                    // 0xe4(0x4)
	float                                                        RopeOnRodMaxSway;                                  // 0xe8(0x4)
	float                                                        TimeToBlendAwaySway;                               // 0xec(0x4)
	float                                                        MaxTimeToWaitForAnimationStateToFinish;            // 0xf0(0x4)
	struct                                                       ServerEstimateRodEndPosition;                      // 0xf4(0xc)
	struct                                                       ServerEstimateRodBasePosition;                     // 0x100(0xc)
	struct                                                       RodBaseHitDetectionExtraOffset;                    // 0x10c(0xc)
	float                                                        MinimumShakeValue;                                 // 0x118(0x4)
	float                                                        ReelingCooldownMultiplier;                         // 0x11c(0x4)
	class WwiseEvent*                                            RodCastAudioDrawBack;                              // 0x120(0x8)
	class WwiseEvent*                                            RodCastAudioCast;                                  // 0x128(0x8)
	class WwiseEvent*                                            RodBendStart;                                      // 0x130(0x8)
	class WwiseEvent*                                            RodBendStop;                                       // 0x138(0x8)
	float                                                        RodBendFactorAmountToTriggerSound;                 // 0x140(0x4)
	float                                                        AmountOfWrongDirectionStrainToTriggerSound;        // 0x144(0x4)
	float                                                        RodBendCooldown;                                   // 0x148(0x4)
	struct FName                                                 RodBendFactorRtpc;                                 // 0x14c(0x8)
	class WwiseEvent*                                            RodCastReelLoopStart;                              // 0x158(0x8)
	class WwiseEvent*                                            RodCastReelLoopStop;                               // 0x160(0x8)
	struct FName                                                 RodCastReelSpeedRtpc;                              // 0x168(0x8)
	float                                                        RtpcSpeedFactorCasting;                            // 0x170(0x4)
	float                                                        RtpcSpeedFactorFishing;                            // 0x174(0x4)
	float                                                        RtpcSpeedFactorReeling;                            // 0x178(0x4)
	class WwiseEvent*                                            FishingBendWrongDirectionStart;                    // 0x180(0x8)
	class WwiseEvent*                                            FishingBendWrongDirectionStop;                     // 0x188(0x8)
	class WwiseEvent*                                            FishingLineSnap;                                   // 0x190(0x8)
	class WwiseEvent*                                            RodCastFishOutOfWaterWriggling;                    // 0x198(0x8)
	class WwiseObjectPoolWrapper*                                FishingRodPool;                                    // 0x1a0(0x8)
	struct FName                                                 RodStrainMagnitudeRtpc;                            // 0x1a8(0x8)
	class WwiseEvent*                                            FishTakenFromRod;                                  // 0x1b0(0x8)
	class WwiseEvent*                                            BaitAddedToHook;                                   // 0x1b8(0x8)
};


// Size 0x150 (Full Size[0x518] - InheritedSize[0x3c8]
class LandmarkReactionPlayer: public Actor
{
public:
	TArray<struct LandmarkReactionKeyFrame>                      OrderedReactions;                                  // 0x3d0(0x10)
	TArray<class ParticleSystemComponent*>                       ActiveParticleSystems;                             // 0x438(0x10)
};


// Size 0x1c8 (Full Size[0x590] - InheritedSize[0x3c8]
class SpawnAIWaveMechanismAction: public Actor
{
public:
	class MechanismActionComponent*                              MechanismActionComponent;                          // 0x3c8(0x8)
	class AIProgressiveWavesSpawner*                             ProgressiveWavesSpawnerTemplate;                   // 0x3d0(0x8)
	class AIProgressiveWavesSpawner*                             OnePlayerCrewSpawnerTemplateOverride;              // 0x3d8(0x8)
	class AIProgressiveWavesSpawner*                             TwoPlayerCrewSpawnerTemplateOverride;              // 0x3e0(0x8)
	class AIProgressiveWavesSpawner*                             ThreePlayerCrewSpawnerTemplateOverride;            // 0x3e8(0x8)
	class AIProgressiveWavesSpawner*                             FourOrMorePlayerCrewSpawnerTemplateOverride;       // 0x3f0(0x8)
	int                                                          PerCrewAISpawnCooldownTimeInSeconds;               // 0x3f8(0x4)
	int                                                          GlobalCooldownInSeconds;                           // 0x3fc(0x4)
	float                                                        SpawnRollChance;                                   // 0x400(0x4)
	class Actor*                                                 ActorWithTargetAIRegion;                           // 0x408(0x8)
	float                                                        ResetSpawnerDelay;                                 // 0x410(0x4)
	class AIProximityPlayerTracker*                              ProximityPlayerTracker;                            // 0x4f0(0x8)
	class AISpawnerMusicZoneComponent*                           MusicZoneComponent;                                // 0x4f8(0x8)
};


// Size 0x18 (Full Size[0x918] - InheritedSize[0x900]
class MerchantCrateFilledItemProxy: public StaticMerchantCrateItemProxy
{
public:
	class StorageContainerComponent*                             StorageContainerComponent;                         // 0x900(0x8)
	bool                                                         FillCrateToCapacity;                               // 0x908(0x1)
};


// Size 0x20 (Full Size[0xa0] - InheritedSize[0x80]
class BlockMigrationForCrewTaskStepDesc: public TaleQuestStepDesc
{
public:
	class TaleQuestStepDesc*                                     TaskDesc;                                          // 0x80(0x8)
	struct FName                                                 RemoteConfigKeyBlockServerMigration;               // 0x88(0x8)
	struct FString                                               Reason;                                            // 0x90(0x10)
};


// Size 0x948 (Full Size[0x970] - InheritedSize[0x28]
class AshenWindsFlamethrowerController: public Object
{
public:
	struct                                                       FlamethrowerCollisionParams;                       // 0x30(0x68)
	class FireGridCellSelectionParamsDataAsset*                  FlamethrowerFirePropagationIgnitionParams;         // 0x98(0x8)
	struct                                                       FlamethrowerCollisionStatusEffect;                 // 0xa0(0x18)
	float                                                        TimeUntilApplyStatusEffect;                        // 0xb8(0x4)
	float                                                        TimeUntilIgniteFirePropagation;                    // 0xbc(0x4)
	float                                                        TimeToConsiderActorOutsideFlame;                   // 0xc0(0x4)
	float                                                        AngleBehindWielderToIgnoreCollisions;              // 0xc4(0x4)
	float                                                        FlamethrowerCollisionDamageAmount;                 // 0xc8(0x4)
	float                                                        DamagePerSecondInsideFlame;                        // 0xcc(0x4)
	struct                                                       DamageableInterfaceStat;                           // 0xd0(0x4)
	class UClass*                                                DamagerTypeClass;                                  // 0xd8(0x8)
	char                                                         HealthChangedReason;                               // 0xe0(0x1)
	bool                                                         ShouldFireStatsOnActorWithFirePropogationInterface; // 0xe1(0x1)
	class AshenWindsSkull*                                       AshenWindsSkull;                                   // 0xe8(0x8)
	map                                                          ActorsInsideFlame;                                 // 0xf0(0x50)
};


// Size 0x1b8 (Full Size[0x1e0] - InheritedSize[0x28]
class FogBankDataAsset: public DataAsset
{
public:
	char                                                         FogBankType;                                       // 0x28(0x1)
	struct                                                       Density;                                           // 0x30(0x30)
	struct                                                       RadiusXInKm;                                       // 0x60(0x30)
	struct                                                       RadiusYInKm;                                       // 0x90(0x30)
	struct                                                       HeightInKm;                                        // 0xc0(0x30)
	struct                                                       DefaultColour;                                     // 0xf0(0x10)
	TArray<struct FogColourForSea>                               FogColourForSea;                                   // 0x100(0x10)
	struct                                                       FadeInDuration;                                    // 0x110(0x30)
	struct                                                       ActiveDuration;                                    // 0x140(0x30)
	struct                                                       FadeOutDuration;                                   // 0x170(0x30)
	struct                                                       EmergencyFadeOutDuration;                          // 0x1a0(0x30)
	bool                                                         Persistent;                                        // 0x1d0(0x1)
	float                                                        TimeBetweenLocalPlayerDensityModifierUpdate;       // 0x1d4(0x4)
	float                                                        NotCulledDistanceFromPlayerInKm;                   // 0x1d8(0x4)
	float                                                        FullyCulledDistanceFromPlayerInKm;                 // 0x1dc(0x4)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class ClientNotificationsService: public Object
{
public:
	bool                                                         PlayerTextChatEnabled;                             // 0x58(0x1)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class QuestDescDataAsset: public DataAsset
{
public:
	bool                                                         IsEmergent;                                        // 0x28(0x1)
};


// Size 0x48 (Full Size[0x168] - InheritedSize[0x120]
class CaptainsLogItemDesc: public WieldableBookItemDesc
{
public:
	class WieldableBookPageList*                                 SmallShipPageList;                                 // 0x120(0x8)
	class WieldableBookPageList*                                 MediumShipPageList;                                // 0x128(0x8)
	class WieldableBookPageList*                                 LargeShipPageList;                                 // 0x130(0x8)
	class WieldableBookPageList*                                 SmallGuildShipPageList;                            // 0x138(0x8)
	class WieldableBookPageList*                                 MediumGuildShipPageList;                           // 0x140(0x8)
	class WieldableBookPageList*                                 LargeGuildShipPageList;                            // 0x148(0x8)
	class WieldableBookPageList*                                 RuinedSmallShipPageList;                           // 0x150(0x8)
	class WieldableBookPageList*                                 RuinedMediumShipPageList;                          // 0x158(0x8)
	class WieldableBookPageList*                                 RuinedLargeShipPageList;                           // 0x160(0x8)
};


// Size 0x100 (Full Size[0x1c8] - InheritedSize[0xc8]
class InGameScrambledNamesComponent: public ActorComponent
{
public:
	class ScrambledNamesDataAsset*                               ScrambledPlayerNamesDataAsset;                     // 0x1b0(0x8)
	class ScrambledNamesDataAsset*                               ScrambledShipNamesDataAsset;                       // 0x1b8(0x8)
	class ScrambledNamesDataAsset*                               ScrambledGuildNamesDataAsset;                      // 0x1c0(0x8)
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class VoteAudioComponent: public ActorComponent
{
public:
	class WwiseEvent*                                            VoteCastAudioEvent;                                // 0xd0(0x8)
	class WwiseEvent*                                            VoteRemovedAudioEvent;                             // 0xd8(0x8)
	class WwiseObjectPoolWrapper*                                AudioPool;                                         // 0xe0(0x8)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class NPCLoadedOnClientService: public Object
{
public:
	TArray<struct NPCData>                                       AllNPCData;                                        // 0x30(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class IsWieldingItemCategoryRadialContext: public RadialContextBase
{
public:
	TArray<class Class*>                                         TargetItemCategories;                              // 0x28(0x10)
};


// Size 0xe0 (Full Size[0x108] - InheritedSize[0x28]
class ShopDesc: public DataAsset
{
public:
	struct FText                                                 ShopName;                                          // 0x28(0x38)
	class CatalogDataAsset*                                      Catalog;                                           // 0x60(0x8)
	struct                                                       CatalogData;                                       // 0x68(0x1)
	TArray<struct CatalogDescTab>                                Catalogs;                                          // 0x70(0x10)
	class PremiumCatalogDataAsset*                               PremiumCatalog;                                    // 0x80(0x8)
	TArray<struct FeatureToggledPremiumCatalog>                  FeatureToggledPremiumCatalogs;                     // 0x88(0x10)
	struct FString                                               Storefront;                                        // 0x98(0x10)
	struct FString                                               OpenAudioCue;                                      // 0xa8(0x10)
	bool                                                         EnablePiratePreview;                               // 0xb8(0x1)
	bool                                                         IsPremiumShop;                                     // 0xb9(0x1)
	bool                                                         IsCompanyNPCShop;                                  // 0xba(0x1)
	class ShopDialogue*                                          Dialogue;                                          // 0xc0(0x8)
	class UClass*                                                Company;                                           // 0xc8(0x8)
	TArray<class Class*>                                         Categories;                                        // 0xd0(0x10)
	struct                                                       AllTabIcon;                                        // 0xe0(0x10)
	char                                                         PiratePreviewSkeletonCurseMode;                    // 0xf0(0x1)
	TArray<struct MultiShopResponse>                             MultiShopResponse;                                 // 0xf8(0x10)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class SetHiddenOnKeyTakenStep: public TaleQuestStep
{
public:
	class SetHiddenOnKeyTakenStepDesc*                           StepDesc;                                          // 0x98(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class VoyageRewardDataAsset: public DataAsset
{
public:
	TArray<struct PerChapterRankRewardEntry>                     RankEntries;                                       // 0x28(0x10)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class AggressiveGhostShipVisualsDataAsset: public DataAsset
{
public:
	TArray<struct AggressiveGhostShipVisualsMaterialOverride>    MaterialOverrides;                                 // 0x28(0x10)
	TArray<struct AggressiveGhostShipVisualsExtraMesh>           ExtraMeshes;                                       // 0x38(0x10)
	class AggressiveGhostShipAnimationDataAsset*                 AppearAnimation;                                   // 0x48(0x8)
	class AggressiveGhostShipAnimationDataAsset*                 DisappearAnimation;                                // 0x50(0x8)
	class AggressiveGhostShipAnimationDataAsset*                 SinkingAnimation;                                  // 0x58(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class WeightedTreasureChestDescAsset: public DataAsset
{
public:
	TArray<struct WeightedTreasureChestDesc>                     Rewards;                                           // 0x28(0x10)
};


// Size 0x68 (Full Size[0x130] - InheritedSize[0xc8]
class PhrasesRadialComponent: public ActorComponent
{
public:
	TArray<struct PlayModePhrases>                               DefaultPhrasesByPlayMode;                          // 0xd0(0x10)
	class PhrasesRadialDataAsset*                                DefaultPhrasesRadialDataAsset;                     // 0xe0(0x8)
	class PhrasesRadialDataAsset*                                DockablePhrasesRadialDataAsset;                    // 0xe8(0x8)
	class PhrasesRadialDataAsset*                                WieldedItemPhrasesRadialDataAsset;                 // 0xf0(0x8)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class RevealableServiceSettingsDataAsset: public DataAsset
{
public:
	class RevealableSceneMappingsDataAsset*                      SceneTypeMappingsDataAsset;                        // 0x28(0x8)
};


// Size 0x170 (Full Size[0x538] - InheritedSize[0x3c8]
class ShipwreckService: public Actor
{
public:
	TArray<class Interface*>                                     ToMoveList;                                        // 0x3d0(0x10)
	struct                                                       WreckProbRange;                                    // 0x3e0(0x20)
	class UClass*                                                WreckClass;                                        // 0x400(0x8)
	class ShipwreckSiteGeneratorComponent*                       SiteGenerator;                                     // 0x408(0x8)
	class ShipwreckNameGeneratorAbstract*                        NameGenerator;                                     // 0x410(0x8)
	float                                                        ShipwreckLifetime;                                 // 0x418(0x4)
	float                                                        PlayerDistanceMoveThreshold;                       // 0x41c(0x4)
	float                                                        ShipDistanceMoveThreshold;                         // 0x420(0x4)
	TArray<class Class*>                                         GameEventExclusionExceptions;                      // 0x428(0x10)
	struct                                                       SpawnQueryData;                                    // 0x498(0x10)
	TArray<class Interface*>                                     WreckList;                                         // 0x4a8(0x10)
	TArray<struct CustomWreckEntry>                              ActiveCustomWreckList;                             // 0x4c8(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class CannonEnchantmentDescAsset: public ShipPartDescAsset
{
public:
	struct                                                       CannonEnchantmentDesc;                             // 0x28(0x18)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class NPCDialogPredicateOnTutorialStep: public NPCDialogPredicate
{
public:
	struct FName                                                 TutorialStepName;                                  // 0x38(0x8)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class TaleQuestStatQueryFunctionComparator: public Object
{
public:
	uint64                                                       Value;                                             // 0x28(0x8)
};


// Size 0x80 (Full Size[0x148] - InheritedSize[0xc8]
class ShipCreatureManagerComponent: public ActorComponent
{
public:
	TArray<struct ActorComponentSelector>                        CreatureMeshComponents;                            // 0xc8(0x10)
	TArray<struct ShipCreatureManagerCreatureInstance>           CreatureInstances;                                 // 0xd8(0x10)
	class SceneComponent*                                        CreatureMeshAttachParent;                          // 0xe8(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class NPCOnSurfaceCannonManagerCrewSizeSettingsDataAsset: public DataAsset
{
public:
	TArray<struct NPCOnSurfaceCannonManagerCrewSizeSettings>     CrewSizeSettings;                                  // 0x28(0x10)
};


// Size 0x110 (Full Size[0x900] - InheritedSize[0x7f0]
class StarFieldRevealerMask: public StaticMeshWieldableItem
{
public:
	class StaticMeshComponent*                                   SkySphere;                                         // 0x7f0(0x8)
	class PostProcessComponent*                                  PostProcessComponent;                              // 0x7f8(0x8)
	class InventoryItemComponent*                                InventoryItemComponent;                            // 0x800(0x8)
	class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x808(0x8)
	class RevealerComponent*                                     RevealerComponent;                                 // 0x810(0x8)
	char                                                         ReplicatedStarFieldSkySpinState;                   // 0x818(0x1)
	float                                                        WearMaskTransitionTime;                            // 0x81c(0x4)
	struct                                                       SkySphereMaterialParams;                           // 0x838(0x18)
	struct                                                       MaskPostProcessParams;                             // 0x850(0x50)
	struct                                                       MaskAudioParams;                                   // 0x8a0(0x50)
};


// Size 0x9b0 (Full Size[0x9d8] - InheritedSize[0x28]
class AthenaGameSettings: public Object
{
public:
	int                                                          NumberOfDaysInEachMonth;                           // 0x28(0x4)
	struct FString                                               EntryMap;                                          // 0x30(0x10)
	struct FString                                               FrontendMap;                                       // 0x40(0x10)
	struct FString                                               InGameMap;                                         // 0x50(0x10)
	struct FString                                               TutorialMap;                                       // 0x60(0x10)
	struct                                                       PlayModeLevels;                                    // 0x70(0x10)
	struct                                                       FeatureToggledLevels;                              // 0x80(0x10)
	struct FString                                               OverrideServerURL;                                 // 0x90(0x10)
	float                                                        LoadLevelTimeoutTime;                              // 0xa0(0x4)
	float                                                        ServiceBridgeConnectTimeout;                       // 0xa4(0x4)
	TArray<Class>                                                MaidenVoyageProgressionEntitlements;               // 0xa8(0x10)
	assetclass                                                   VoiceChatRendererClass;                            // 0xb8(0x20)
	assetclass                                                   GameNarrationCoordinatorClass;                     // 0xd8(0x20)
	assetclass                                                   ApplicationSettingsClass;                          // 0xf8(0x20)
	struct                                                       CinematicCameraControllerClass;                    // 0x118(0x10)
	struct                                                       CinematicCameraSpectatorPawnClass;                 // 0x128(0x10)
	struct                                                       MaterialTranslationTableFileLocation;              // 0x138(0x10)
	struct                                                       MaterialAudioTableFileLocation;                    // 0x148(0x10)
	struct                                                       MaterialVFXTableFileLocation;                      // 0x158(0x10)
	struct                                                       DebugMenuFileLocation;                             // 0x168(0x10)
	struct                                                       SpawnLocationKeywordPriorityListLocation;          // 0x178(0x10)
	struct                                                       CrewSpawnLocationVariablesListAsset;               // 0x188(0x10)
	struct                                                       SkellyFortDataFileLocation;                        // 0x198(0x10)
	struct                                                       SkellyFortListDataFileLocation;                    // 0x1a8(0x10)
	struct                                                       EnemyAIOnShipServiceDataAssetFileLocation;         // 0x1b8(0x10)
	struct                                                       ProjectileServiceDataFileLocation;                 // 0x1c8(0x10)
	struct                                                       ThrottledProjectileTickDataAssetLocation;          // 0x1d8(0x10)
	struct                                                       HoleDataFileLocation;                              // 0x1e8(0x10)
	struct                                                       PlayerBuriedItemServiceDataFileLocation;           // 0x1f8(0x10)
	struct                                                       ItemLifetimeIslandCapsDataFileLocation;            // 0x208(0x10)
	struct                                                       CursedCannonballDataAsset;                         // 0x218(0x10)
	struct                                                       Throwables;                                        // 0x228(0x10)
	struct                                                       ThrowablesItemCategory;                            // 0x238(0x10)
	struct                                                       SpawnableItemsDataAssetLocation;                   // 0x248(0x10)
	struct                                                       FireworksDebugSpawnItemsDataAsset;                 // 0x258(0x10)
	struct                                                       UnlockableEntitlementsDataAssetLocation;           // 0x268(0x10)
	struct                                                       DebugWieldablesDataAsset;                          // 0x278(0x10)
	struct                                                       StrongholdKeyDataAsset;                            // 0x288(0x10)
	struct                                                       MigrationUIContentsFileLocation;                   // 0x298(0x10)
	struct                                                       InventoryRemappingAssetLocation;                   // 0x2a8(0x10)
	struct                                                       AllianceSettingsAssetLocation;                     // 0x2b8(0x10)
	struct                                                       ReapersMarkSettingsAssetLocation;                  // 0x2c8(0x10)
	struct                                                       EmissaryLevelSettingsAssetLocation;                // 0x2d8(0x10)
	struct                                                       EmissaryRewardSettingsAssetLocation;               // 0x2e8(0x10)
	struct                                                       FactionSettingsAssetLocation;                      // 0x2f8(0x10)
	struct                                                       FactionLootLevelRewardsAssetLocation;              // 0x308(0x10)
	struct                                                       FlamesOfFateSettingsAssetLocation;                 // 0x318(0x10)
	struct                                                       DiggingConfigResolverAssetLocation;                // 0x328(0x10)
	struct                                                       CrewNotificationToastSettings;                     // 0x338(0x10)
	struct                                                       FireSettingsDataAsset;                             // 0x348(0x10)
	struct FString                                               InventoryDefaultItemURL;                           // 0x358(0x10)
	float                                                        CheatFlyingSpeedSlow;                              // 0x368(0x4)
	float                                                        CheatFlyingSpeedDefault;                           // 0x36c(0x4)
	float                                                        CheatFlyingSpeedFast;                              // 0x370(0x4)
	float                                                        CheatFlyingAcceleration;                           // 0x374(0x4)
	struct                                                       EncounterServiceParams;                            // 0x378(0x20)
	struct                                                       CrewServiceParams;                                 // 0x398(0x70)
	struct                                                       SharedShovelParams;                                // 0x408(0x60)
	struct                                                       MermaidServiceParams;                              // 0x468(0x8c)
	struct                                                       ContestSpecificMermaidServiceParamsToggleLocked;   // 0x4f4(0x8c)
	struct                                                       InvasionSpecificMermaidServiceParams;              // 0x580(0x8c)
	struct                                                       MakeFriendsEmoteParams;                            // 0x610(0x18)
	struct                                                       MermaidRespawnConfiguration;                       // 0x628(0x28)
	struct                                                       CharacterSocketCollisionServiceParams;             // 0x650(0x8)
	struct                                                       AAthenaAICharacterParams;                          // 0x658(0x14)
	int                                                          AssumedMaxFPSOnServer;                             // 0x66c(0x4)
	struct FName                                                 WwiseObjectUnderwaterStateSwitchGroup;             // 0x670(0x8)
	struct FName                                                 WwiseObjectUnderwaterSwitchDefaultState;           // 0x678(0x8)
	struct FName                                                 WwiseObjectUnderwaterSwitchUnderwaterState;        // 0x680(0x8)
	float                                                        StormQuantisePrecision;                            // 0x688(0x4)
	struct                                                       ShipLiveryCatalogueDataAssetLocation;              // 0x690(0x10)
	struct                                                       ShipPartsCatalogueDataAssetLocation;               // 0x6a0(0x10)
	struct                                                       RowboatSpawnParamsDataAssetLocation;               // 0x6b0(0x10)
	struct                                                       HarpoonLauncherItemExclusionDataAssetLocation;     // 0x6c0(0x10)
	struct                                                       BalanceableWalkwayDataAssetLocation;               // 0x6d0(0x10)
	struct                                                       BalanceableWalkwayFXDataAssetLocation;             // 0x6e0(0x10)
	struct                                                       KrakenTentacleClassLocation;                       // 0x6f0(0x10)
	struct                                                       KrakenShipTentacleClassLocation;                   // 0x700(0x10)
	struct                                                       KrakenServiceParamsDataAssetLocation;              // 0x710(0x10)
	struct                                                       AmbientTinySharkServiceParamsDataAssetLocation;    // 0x720(0x10)
	struct                                                       SunkenIslandSettings;                              // 0x730(0x10)
	struct                                                       CompanyDataListAssetLocation;                      // 0x740(0x10)
	struct                                                       CoherentUIGTAssetRootLocation;                     // 0x750(0x10)
	struct                                                       CoherentUIGTPersistentDataAssetLocation;           // 0x760(0x10)
	struct                                                       CoherentContentEngagementMessageLocation;          // 0x770(0x10)
	struct                                                       NestedWorldRootDataAssetLocation;                  // 0x780(0x10)
	struct                                                       AshenLordEncounterServiceParams;                   // 0x790(0x10)
	struct                                                       PortalServiceParams;                               // 0x7a0(0x10)
	struct                                                       AggressiveGhostShipsEncounterServiceParams;        // 0x7b0(0x10)
	TArray<Class>                                                RequiredLoadoutCategories;                         // 0x7c0(0x10)
	struct                                                       CarouselGenerationParams;                          // 0x7d0(0x10)
	float                                                        SinkingShipDestructionDistanceThreshold;           // 0x7e0(0x4)
	struct                                                       DefaultItemsToBeDisplayedOnInventoryPanel;         // 0x7e8(0x10)
	struct                                                       DefaultFogBank;                                    // 0x7f8(0x10)
	struct                                                       DefaultFogBankManager;                             // 0x808(0x10)
	struct                                                       TunnelsOfTheDamnedServiceParamsDataAssetLocation;  // 0x818(0x10)
	struct                                                       PlayerModerationParams;                            // 0x828(0xc)
	struct                                                       SpireServiceParamsDataAssetLocation;               // 0x838(0x10)
	struct                                                       GhostCurseEntitlement;                             // 0x848(0x10)
	struct FName                                                 GhostCurseRewardId;                                // 0x858(0x8)
	struct                                                       GoldGhostCurseEntitlement;                         // 0x860(0x10)
	struct FName                                                 GoldGhostCurseRewardId;                            // 0x870(0x8)
	struct                                                       SkeletonCurseEntitlement;                          // 0x878(0x10)
	struct FName                                                 SkeletonCurseRewardId;                             // 0x888(0x8)
	struct FName                                                 SkeletonCurseWardrobeKey;                          // 0x890(0x8)
	TArray<Class>                                                SkeletonClothingCategories;                        // 0x898(0x10)
	struct                                                       SkeletonClothingEntitlementMapDataAsset;           // 0x8a8(0x10)
	TArray<char>                                                 KillNotificationHealthChangeReasons;               // 0x8b8(0x10)
	struct                                                       ShipStorageJettisonParamsDataAsset;                // 0x8c8(0x10)
	struct                                                       WorldEdgeItemParamsDataAsset;                      // 0x8d8(0x10)
	struct                                                       PlayerLootMarkerServiceParamsFileLocation;         // 0x8e8(0x10)
	struct                                                       DefaultEmblemPopUpBackgroundFileLocation;          // 0x8f8(0x10)
	struct                                                       AdventureOnDemandServiceParamsAssetFileLocation;   // 0x908(0x10)
	struct                                                       AdventureOnDemandVoyageSelectionDataAssetFileLocation; // 0x918(0x10)
	struct                                                       QuestTableAdventureOnDemandParamsFileLocation;     // 0x928(0x10)
	struct                                                       TradingCompanyPopUpBackgroundCollectionAssetFileLocation; // 0x938(0x10)
	struct                                                       SeaOfThievesOnDemandRewardPopupsConversionTable;   // 0x948(0x10)
	struct                                                       SkellyFortAvailabilityParamsAssetFileLocation;     // 0x958(0x10)
	struct                                                       KrakenAvailabilityParamsAssetFileLocation;         // 0x968(0x10)
	struct                                                       AshenLordAvailabilityParamsAssetFileLocation;      // 0x978(0x10)
	struct                                                       AggressiveGhostShipEncounterAvailabilityParamsAssetFileLocation; // 0x988(0x10)
	struct                                                       AIShipBattleAvailabilityParamsAssetFileLocation;   // 0x998(0x10)
	struct                                                       CompetitiveVoyagesServiceParamsDataAsset;          // 0x9a8(0x10)
	struct                                                       BoneCallerServiceParamsDataAsset;                  // 0x9b8(0x10)
	TArray<struct RareGameServiceSpecification>                  GameContextServiceSpecifications;                  // 0x9c8(0x10)
};


// Size 0x180 (Full Size[0x248] - InheritedSize[0xc8]
class PlayerWalletComponent: public ActorComponent
{
public:
	struct                                                       LastKnownBalance;                                  // 0xd0(0x10)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class CutsceneResponseComponent: public ActorComponent
{
public:
	TArray<class CutsceneResponseSheet*>                         Sheets;                                            // 0xc8(0x10)
};


// Size 0x48 (Full Size[0x110] - InheritedSize[0xc8]
class InventoryItemComponent: public ActorComponent
{
public:
	char                                                         Type;                                              // 0xd0(0x1)
	struct                                                       Icon;                                              // 0xd8(0x10)
	struct                                                       BackgroundImage;                                   // 0xe8(0x10)
	struct FString                                               IconUrl;                                           // 0xf8(0x10)
	float                                                        IconRotation;                                      // 0x108(0x4)
	float                                                        IconScale;                                         // 0x10c(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class VoyageLocationOnlyNamedIslandListDataAsset: public DataAsset
{
public:
	TArray<struct Name>                                          OnlyNamedIslandsList;                              // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ImpactSettings: public Object
{
public:
	struct                                                       ImpactListAssetRef;                                // 0x28(0x10)
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class NarratedAccessibilityComponent: public ActorComponent
{
public:
	float                                                        ContinuousNarrationCooldown;                       // 0xc8(0x4)
	interface                                                    SettingsInterface;                                 // 0xd8(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class CharacterMovementAINoiseEventComponentParams: public DataAsset
{
public:
	struct FName                                                 MovementTag;                                       // 0x28(0x8)
	class CurveFloat*                                            WalkingSpeedToNoiseRange;                          // 0x30(0x8)
	float                                                        CrouchedWalkingNoiseRange;                         // 0x38(0x4)
	float                                                        MovingInWaterNoiseRange;                           // 0x3c(0x4)
	float                                                        JumpNoiseRange;                                    // 0x40(0x4)
	float                                                        LandNoiseRange;                                    // 0x44(0x4)
	float                                                        MinSpeedToTriggerLandedEvent;                      // 0x48(0x4)
};


// Size 0x90 (Full Size[0x458] - InheritedSize[0x3c8]
class PlayerBuriedItemService: public Actor
{
public:
	TArray<class TavernBoard*>                                   RegisteredTavernBoards;                            // 0x3d8(0x10)
	TArray<struct PlayerBuriedItemServiceNumMapsTakenFromStoreThisDayPerCrew> NumMapsTakenFromStoreThisDayPerCrew;               // 0x3e8(0x10)
	class PlayerBuriedItemServiceDataAsset*                      DataAsset;                                         // 0x3f8(0x8)
	class PlayerBuriedItemServiceMapStorePopulator*              MapStorePopulator;                                 // 0x400(0x8)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class BeckonGestureDataAsset: public DataAsset
{
public:
	class AnimSequence*                                          BeckonAnimation;                                   // 0x28(0x8)
};


// Size 0x90 (Full Size[0x670] - InheritedSize[0x5e0]
class PickupActorMock: public Character
{
public:
	interface                                                    MockWieldableItem;                                 // 0x630(0x10)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class CutscenePoolType: public DataAsset
{
public:
	bool                                                         DialogueSelectedRandomly;                          // 0x28(0x1)
	TArray<int>                                                  AvailableIndices;                                  // 0x30(0x10)
	TArray<int>                                                  OriginalIndices;                                   // 0x48(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EventRoomParamsDataAsset: public DataAsset
{
public:
	float                                                        AftermathTimer;                                    // 0x28(0x4)
	bool                                                         SpawnPlayerOnShipInsteadOfExitLocation;            // 0x2c(0x1)
	float                                                        FailTimer;                                         // 0x30(0x4)
};


// Size 0x180 (Full Size[0x5c0] - InheritedSize[0x440]
class SwimmingCreatureAnimationInstance: public AnimInstance
{
public:
	float                                                        Speed;                                             // 0x458(0x4)
	float                                                        PlayRate;                                          // 0x45c(0x4)
	float                                                        Direction;                                         // 0x460(0x4)
	class AnimMontage*                                           DeathMontage;                                      // 0x468(0x8)
	class AnimMontage*                                           SinkingMontage;                                    // 0x470(0x8)
	class AnimSequenceBase*                                      DefaultImpactAnim;                                 // 0x478(0x8)
	TArray<struct SwimmingCreatureImpactAnimData>                ImpactAnims;                                       // 0x480(0x10)
	float                                                        MaxAccelerationForSpeed;                           // 0x490(0x4)
	float                                                        MaxPitchForSpeed;                                  // 0x494(0x4)
	float                                                        MaxYawForDirection;                                // 0x498(0x4)
	float                                                        SpeedSmoothingFactor;                              // 0x49c(0x4)
	float                                                        DirectionSmoothingFactor;                          // 0x4a0(0x4)
	float                                                        AccelerationSmoothingFactor;                       // 0x4a4(0x4)
	float                                                        YawSmoothingFactor;                                // 0x4a8(0x4)
	float                                                        NetworkAnimationBlendTime;                         // 0x4ac(0x4)
	TArray<class Object*>                                        RPCPlayableMontages;                               // 0x4b0(0x10)
	TArray<class AnimSequenceBase*>                              NetworkPlayableAnimations;                         // 0x4c0(0x10)
	TArray<struct AIStrategySpeedOverride>                       StrategySpeedOverrides;                            // 0x4d0(0x10)
	TArray<class Class*>                                         HitReactBlockingAIStrategies;                      // 0x4e0(0x10)
	class AnimMontage*                                           CurrentlyPlayingNetworkMontage;                    // 0x4f0(0x8)
	class SwimmingCreatureMovementComponent*                     MovementComponent;                                 // 0x598(0x8)
	class NetworkSyncedAnimationComponent*                       NetworkSyncedAnimationComponent;                   // 0x5b8(0x8)
};


// Size 0x198 (Full Size[0x560] - InheritedSize[0x3c8]
class ItemReplenisher: public Actor
{
public:
	class SceneComponent*                                        Root;                                              // 0x3d8(0x8)
	class InteractableComponentWithActionRules*                  InteractableWithActionRulesComponent;              // 0x3e0(0x8)
	struct                                                       ItemSpawnTransform;                                // 0x3f0(0x30)
	class UClass*                                                ItemToSpawn;                                       // 0x420(0x8)
	int                                                          MaxItems;                                          // 0x428(0x4)
	bool                                                         ShouldItemBeSpawnedOnStart;                        // 0x42c(0x1)
	bool                                                         WieldItemWhenSpawned;                              // 0x42d(0x1)
	struct                                                       InteractionParams;                                 // 0x430(0x78)
	bool                                                         CanInteractOnStart;                                // 0x4a8(0x1)
	bool                                                         CanInteract;                                       // 0x4a9(0x1)
	int                                                          CurrentNumberOfItemsSpawned;                       // 0x4ac(0x4)
};


// Size 0x10 (Full Size[0x2f0] - InheritedSize[0x2e0]
class SpawnActorComponent: public SceneComponent
{
public:
	class UClass*                                                ChildActorClass;                                   // 0x2e0(0x8)
	class Actor*                                                 ChildActor;                                        // 0x2e8(0x8)
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class WorldMarkerRoutingComponent: public ActorComponent
{
public:
	class UClass*                                                DefaultListenerType;                               // 0xd0(0x8)
	interface                                                    MarkerListener;                                    // 0xd8(0x10)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class ShipBuilder: public Object
{
public:
	class Ship*                                                  Template;                                          // 0x58(0x8)
};


// Size 0x220 (Full Size[0x750] - InheritedSize[0x530]
class BootyItemInfo: public NonStorableItemInfo
{
public:
	char                                                         BootyType;                                         // 0x560(0x1)
	struct                                                       Id;                                                // 0x564(0x10)
	bool                                                         PlayedFirstTimeEquipSfx;                           // 0x574(0x1)
	TArray<struct PlayerStat>                                    HandInPlayerStats;                                 // 0x578(0x10)
	TArray<struct PlayerStat>                                    HandInStolenPlayerStats;                           // 0x588(0x10)
	TArray<struct PlayerStat>                                    HandInStolenFromPlayerStats;                       // 0x598(0x10)
	TArray<struct PlayerStat>                                    HandInGiftPlayerStats;                             // 0x5a8(0x10)
	TArray<struct PlayerStat>                                    HandInAsPirateLegendPlayerStats;                   // 0x5b8(0x10)
	TArray<struct PlayerStat>                                    HandInOnSchedulePlayerStats;                       // 0x5c8(0x10)
	TArray<struct PlayerStat>                                    HandInAsPirateLegendOnSchedulePlayerStats;         // 0x5d8(0x10)
	TArray<struct EmissaryBootyItemStats>                        HandInAsEmissaryPlayerStats;                       // 0x5e8(0x10)
	TArray<struct EmissaryBootyItemStats>                        HandInAsMaxLevelEmissaryPlayerStats;               // 0x5f8(0x10)
	TArray<struct EmissaryBootyItemStats>                        HandInStolenAsEmissaryPlayerStats;                 // 0x608(0x10)
	TArray<struct EmissaryBootyItemStats>                        HandInStolenAsMaxLevelEmissaryPlayerStats;         // 0x618(0x10)
	TArray<struct PlayerStat>                                    UsePlayerStats;                                    // 0x628(0x10)
	TArray<struct PlayerStat>                                    UseStolenPlayerStats;                              // 0x638(0x10)
	struct                                                       CompanySpecificStats;                              // 0x648(0x10)
	struct                                                       ConditionalHandInStat;                             // 0x658(0x20)
	class PopUpMessageDesc*                                      DiscoveredPopupDesc;                               // 0x678(0x8)
	struct                                                       SellPrerequisites;                                 // 0x680(0x10)
	class TrackedOwnerComponent*                                 TrackedOwnerComponent;                             // 0x690(0x8)
	class ItemQualityComponent*                                  ItemQualityComponent;                              // 0x698(0x8)
	char                                                         ItemQualityLevel;                                  // 0x6a0(0x1)
	TArray<struct PerComanyItemQualityEntry>                     CompanySpecificItemQualityLevel;                   // 0x6a8(0x10)
	struct                                                       HandInRewardId;                                    // 0x6b8(0x8)
	TArray<struct CompanySpecificBootyReward>                    HandInRewardIdCompanySpecific;                     // 0x6c0(0x10)
	bool                                                         RewardToOwnCrewOnly;                               // 0x6d0(0x1)
	struct FName                                                 Rarity;                                            // 0x6d4(0x8)
	class UClass*                                                AwardAllegianceToFaction;                          // 0x6e0(0x8)
	class UClass*                                                CargoRunXPOverrideCompany;                         // 0x6e8(0x8)
	class DeliverableComponent*                                  DeliverableComponent;                              // 0x708(0x8)
	class CrewOwnershipTrackingComponent*                        CrewOwnershipTrackingComponent;                    // 0x710(0x8)
	class BootyItemShipOwnershipComponent*                       BootyItemShipOwnershipComponent;                   // 0x718(0x8)
	char                                                         SpawnSource;                                       // 0x720(0x1)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class RewardPopUpNotificationDataAsset: public DataAsset
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x28(0x8)
	TArray<struct RewardPopUpNotificationInfo>                   RewardPopUpNotifications;                          // 0x30(0x10)
};


// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class AIRowboatEncounterDefinition: public DataAsset
{
public:
	TArray<struct AIRowboatEncounterParamsSpawnerData>           Rowers;                                            // 0x28(0x10)
	TArray<struct AIRowboatEncounterParamsSpawnerData>           Passengers;                                        // 0x38(0x10)
	int                                                          CowardiceThreshold;                                // 0x48(0x4)
	TArray<struct Name>                                          WorldRegions;                                      // 0x50(0x10)
	TArray<char>                                                 IslandTypesToSpawnOn;                              // 0x60(0x10)
	bool                                                         SpawnOnShipwrecks;                                 // 0x70(0x1)
	assetclass                                                   WatercraftClass;                                   // 0x78(0x20)
	class RowboatLiveryPicker*                                   LiveryPicker;                                      // 0x98(0x8)
};


// Size 0x70 (Full Size[0x438] - InheritedSize[0x3c8]
class ShipCompass: public Actor
{
public:
	class PoseableMeshComponent*                                 CompassMesh;                                       // 0x3c8(0x8)
	struct FName                                                 DialBoneName;                                      // 0x3d0(0x8)
	class CompassSpinComponent*                                  SpinComponent;                                     // 0x3d8(0x8)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class AthenaStreamedLevelDataAsset: public DataAsset
{
public:
	TArray<struct StringAssetReference>                          LevelsToLoad;                                      // 0x28(0x10)
	struct FString                                               PackagePath;                                       // 0x38(0x10)
	struct FName                                                 StreamingLevelFeature;                             // 0x48(0x8)
	TArray<char>                                                 RequiredPlayModes;                                 // 0x50(0x10)
};


// Size 0x50 (Full Size[0x418] - InheritedSize[0x3c8]
class IndividualReplicationChannel: public Actor
{
public:
	map                                                          ReplicationChannelComponents;                      // 0x3c8(0x50)
};


// Size 0x108 (Full Size[0x1d0] - InheritedSize[0xc8]
class ShipLightComponent: public ActorComponent
{
public:
	TArray<char>                                                 DormantShipRegions;                                // 0xd0(0x10)
	bool                                                         ExposeToNetProxy;                                  // 0xe0(0x1)
	int                                                          NetProxyBitIndex;                                  // 0xe4(0x4)
	class InteractableLightParameters*                           LightParameters;                                   // 0xe8(0x8)
	bool                                                         LightIsOn_Server;                                  // 0xf1(0x1)
	TArray<class PointLightComponent*>                           Lights;                                            // 0x108(0x10)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class LiquidLauncherChargeVisuals: public Object
{
public:
