// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ForceFeedbackCondition: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaEngineInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaGameStateInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BoxedRpcDispatcherInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0xd0] - InheritedSize[0xc8]
class BoxedRpcDispatcherComponent: public ActorComponent
{
public:
	char                                                         pad0x8_M09Y7[0x8];                                 // 0xc8(0x8)
};


// Size 0x130 (Full Size[0x5e0] - InheritedSize[0x4b0]
class DynamicColourPointLightComponent: public PointLightComponent
{
public:
	struct RuntimeFloatCurve                                     ActivationCurve;                                   // 0x4a8(0x80)
	struct RuntimeFloatCurve                                     DeactivationCurve;                                 // 0x528(0x80)
	char                                                         pad0x38_AEFX1[0x38];                               // 0x5a8(0x38)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EmptyObject: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameInstanceSessionIdProviderInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class NestedWorldRootDataAsset: public DataAsset
{
public:
	char                                                         pad0x10_DTFKS[0x10];                               // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OnlinePlayerPermissionsRetrieverInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class PersistentAssetCollectionDataAsset: public DataAsset
{
public:
	TArray<class Object*>                                        Blueprints;                                        // 0x28(0x10)
	TArray<class Object*>                                        Assets;                                            // 0x38(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayModeHelpers: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayModeInterface: public Interface
{
public:
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class PrimitiveCollisionExtentAdjustOverTimeComponent: public ActorComponent
{
public:
	float                                                        DelayBeforeExtentAdjustment;                       // 0xc8(0x4)
	char                                                         pad0x2c_P5VOF[0x2c];                               // 0xcc(0x2c)
	class World*                                                 CachedWorld;                                       // 0xf8(0x8)
	char                                                         pad0x8_719OQ[0x8];                                 // 0x100(0x8)
};


// Size 0x30 (Full Size[0x138] - InheritedSize[0x108]
class BoxCollisionExtentAdjustOverTimeComponent: public PrimitiveCollisionExtentAdjustOverTimeComponent
{
public:
	bool                                                         ShouldAdjustBoxExtentX;                            // 0x108(0x1)
	char                                                         pad0x3_CRW5Y[0x3];                                 // 0x109(0x3)
	float                                                        PostAdjustmentBoxExtentX;                          // 0x10c(0x4)
	bool                                                         ShouldAdjustBoxExtentY;                            // 0x110(0x1)
	char                                                         pad0x3_MV410[0x3];                                 // 0x111(0x3)
	float                                                        PostAdjustmentBoxExtentY;                          // 0x114(0x4)
	bool                                                         ShouldAdjustBoxExtentZ;                            // 0x118(0x1)
	char                                                         pad0x3_JADSX[0x3];                                 // 0x119(0x3)
	float                                                        PostAdjustmentBoxExtentZ;                          // 0x11c(0x4)
	struct Vector                                                ServerSizeScale;                                   // 0x120(0xc)
	char                                                         pad0x4_QFV82[0x4];                                 // 0x12c(0x4)
	class BoxComponent*                                          BoxCollisionToAdjust;                              // 0x130(0x8)
};


// Size 0x18 (Full Size[0x120] - InheritedSize[0x108]
class SphereCollisionExtentAdjustOverTimeComponent: public PrimitiveCollisionExtentAdjustOverTimeComponent
{
public:
	bool                                                         ShouldAdjustSphereRadius;                          // 0x108(0x1)
	char                                                         pad0x3_DVUOX[0x3];                                 // 0x109(0x3)
	float                                                        PostAdjustmentSphereRadius;                        // 0x10c(0x4)
	float                                                        ServerSizeScale;                                   // 0x110(0x4)
	char                                                         pad0x4_VPIX8[0x4];                                 // 0x114(0x4)
	class SphereComponent*                                       SphereCollisionToAdjust;                           // 0x118(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ResourceProviderInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0xf8] - InheritedSize[0xc8]
class RotateMeshToActorComponent: public ActorComponent
{
public:
	class MeshComponent*                                         MeshToRotate;                                      // 0xc8(0x8)
	class Actor*                                                 ActorToRotateTo;                                   // 0xd0(0x8)
	float                                                        CloseProximityRadius;                              // 0xd8(0x4)
	bool                                                         Use2DDistanceForCloseProximityRadius;              // 0xdc(0x1)
	bool                                                         WhenInCloseProximityKeepLastYaw;                   // 0xdd(0x1)
	char                                                         pad0x2_5OLRJ[0x2];                                 // 0xde(0x2)
	float                                                        RotationSpeed;                                     // 0xe0(0x4)
	bool                                                         PreventPitchModification;                          // 0xe4(0x1)
	char                                                         pad0x3_I81NN[0x3];                                 // 0xe5(0x3)
	float                                                        MaxPitch;                                          // 0xe8(0x4)
	float                                                        CloseProximityYawRotation;                         // 0xec(0x4)
	char                                                         pad0x8_ETGRN[0x8];                                 // 0xf0(0x8)
};


// Size 0x0 (Full Size[0xf8] - InheritedSize[0xf8]
class RotateMeshToLocalPlayerComponent: public RotateMeshToActorComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ServicesStampIdInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0xf8] - InheritedSize[0xc8]
class SkeletalMeshAggregateTickComponent: public ActorComponent
{
public:
	class SkeletalMeshComponent*                                 Mesh;                                              // 0xc8(0x8)
	char                                                         pad0x28_CFVQH[0x28];                               // 0xd0(0x28)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class StringToAssetClassMap: public DataAsset
{
public:
	TArray<struct StringAssetClassPair>                          StringAssetClassPairs;                             // 0x28(0x10)
	char                                                         pad0x18_EWVFT[0x18];                               // 0x38(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SyncedRandomRetrievalInterface: public Interface
{
public:
};


}