#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x50
struct ServerMigrationRequestEvent
{
public:
	struct                                                       MigrationId;                                       // 0x0(0x10)
	struct FString                                               DestinationAddress;                                // 0x10(0x10)
	TArray<struct Guid>                                          CrewIds;                                           // 0x20(0x10)
	struct FString                                               SubMode;                                           // 0x30(0x10)
	TArray<char>                                                 MatchmakingReasons;                                // 0x40(0x10)
};


// Size 0x20
struct ServerMigrationRequestBroadcastEvent
{
public:
	struct FString                                               DestinationAddress;                                // 0x0(0x10)
	struct                                                       CrewId;                                            // 0x10(0x10)
};


// Size 0x20
struct ServerMigrationRefusedEvent
{
public:
	struct                                                       MigrationId;                                       // 0x0(0x10)
	TArray<struct Guid>                                          CrewIds;                                           // 0x10(0x10)
};


// Size 0xc
struct IncomingMigrationPreventionZone
{
public:
	struct                                                       Location;                                          // 0x0(0x8)
	float                                                        Radius;                                            // 0x8(0x4)
};


// Size 0x10
struct AthenaServerMigrationClientContext
{
public:
	struct FString                                               StampId;                                           // 0x0(0x10)
};


// Size 0x20
struct ServerMigrationInstanceEventBase
{
public:
	struct                                                       ServerId;                                          // 0x0(0x10)
	struct                                                       MigrationId;                                       // 0x10(0x10)
};


