#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Athena_Structs.h"


// Size 0x30 (Full Size[0xf8] - InheritedSize[0xc8]
class VenomComponent: public ActorComponent
{
public:
	struct Status                                                VenomStatusUsed;                                   // 0xd0(0x18)
	char                                                         CollisionChannel;                                  // 0xe8(0x1)
	float                                                        RangeDistance;                                     // 0xec(0x4)
	float                                                        RangeAngle;                                        // 0xf0(0x4)
	float                                                        EffectDuration;                                    // 0xf4(0x4)
};


// Size 0xb8 (Full Size[0x480] - InheritedSize[0x3c8]
class SkeletonActionStateCreatorDefinition: public ActionStateCreatorDefinition
{
public:
	struct AISpawnActionStateParams                              AISpawnParams;                                     // 0x3c8(0x10)
	struct AIDeadActionStateParams                               AIDeadParams;                                      // 0x3d8(0x4)
	struct UseItemActionStateParams                              UseItemParams;                                     // 0x3dc(0x1)
	struct UseCannonActionStateParams                            UseCannonParams;                                   // 0x3e0(0x60)
	struct RepairObjectActionStateParams                         RepairObjectParams;                                // 0x440(0x8)
	struct ControlObjectActionStateParams                        ControlObjectParams;                               // 0x448(0x18)
	struct HiddenActionStateParams                               HiddenStateParams;                                 // 0x460(0x5)
};


// Size 0x30 (Full Size[0x3f8] - InheritedSize[0x3c8]
class Mechanism: public Actor
{
public:
	TArray<struct MechanismBinding>                              Bindings;                                          // 0x3d8(0x10)
	multicastinlinedelegate                                      OnMechanismResetDelegate;                          // 0x3e8(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class CharacterAudioEventControllerParams: public DataAsset
{
public:
	class WwiseEvent*                                            WieldEvent;                                        // 0x28(0x8)
	class WwiseEvent*                                            StowEvent;                                         // 0x30(0x8)
	class WwiseEvent*                                            EnemyHitNotifyEvent;                               // 0x38(0x8)
	class WwiseEvent*                                            EnemyHitWithAimAssistAudioOnNotifyEvent;           // 0x40(0x8)
	class WwiseObjectPoolWrapper*                                EnemyHitNotifyPool;                                // 0x48(0x8)
};


// Size 0x70 (Full Size[0x438] - InheritedSize[0x3c8]
class MechanismGroup: public Actor
{
public:
	TArray<class Mechanism*>                                     Mechanisms;                                        // 0x3d8(0x10)
	struct WeightedProbabilityRangeOfRanges                      MechanismsToSelect;                                // 0x3e8(0x30)
	multicastinlinedelegate                                      OnMechanismGroupResetDelegate;                     // 0x418(0x10)
	TArray<class Mechanism*>                                     SelectedMechanisms;                                // 0x428(0x10)
};


// Size 0x50 (Full Size[0x198] - InheritedSize[0x148]
class InteractableStorageContainer: public InteractableComponent
{
public:
	class Object*                                                Aggregator;                                        // 0x188(0x8)
	class UClass*                                                InteractInput;                                     // 0x190(0x8)
};


// Size 0x50 (Full Size[0x118] - InheritedSize[0xc8]
class StaticMeshVoteVisualiserComponent: public ActorComponent
{
public:
	TArray<struct StaticMeshVoteIndicator>                       VoteIndicators;                                    // 0xe8(0x10)
	float                                                        VoteAnimationTime;                                 // 0xf8(0x4)
	class UClass*                                                CurrentCompany;                                    // 0x100(0x8)
	TArray<class Class*>                                         VoteCompanies;                                     // 0x108(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class CaptainCurtainsPartDescAsset: public ShipPartDescAsset
{
public:
	struct CaptainCurtainsPartDesc                               CaptainCurtainsPartDesc;                           // 0x28(0x20)
};


// Size 0x18 (Full Size[0x50] - InheritedSize[0x38]
class NPCDialogPredicateEquals: public NPCDialogPredicate
{
public:
	struct FName                                                 ParameterName;                                     // 0x38(0x8)
	struct FString                                               Value;                                             // 0x40(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class RammableDamageDataAsset: public DataAsset
{
public:
	TArray<struct RammableDamageSpeedEntry>                      DamageSpeedParams;                                 // 0x28(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class IsProjectileOfGivenImpactProjectileId: public StatCondition
{
public:
	class UClass*                                                ImpactProjectileId;                                // 0x28(0x8)
};


// Size 0x18 (Full Size[0xe0] - InheritedSize[0xc8]
class ReapersMarkTrackedItemComponent: public ActorComponent
{
public:
	char                                                         ItemType;                                          // 0xd8(0x1)
};


// Size 0x80 (Full Size[0xa8] - InheritedSize[0x28]
class ContentEngagementMessageParams: public DataAsset
{
public:
	struct FText                                                 Title;                                             // 0x28(0x38)
	struct FText                                                 Body;                                              // 0x60(0x38)
	struct StringAssetReference                                  KeyArt;                                            // 0x98(0x10)
};


// Size 0x218 (Full Size[0x2e0] - InheritedSize[0xc8]
class ItemActionComponent: public ActorComponent
{
public:
	char                                                         ActionType;                                        // 0xc8(0x1)
	bool                                                         ShouldFireEventOnActionStart;                      // 0xc9(0x1)
	bool                                                         ShouldFireEventOnActionStop;                       // 0xca(0x1)
	bool                                                         ShouldApplyAimAndMovementSlowdown;                 // 0xcb(0x1)
	float                                                        ActionCooldown;                                    // 0xcc(0x4)
	struct WwiseEmitterCreationParams                            ActionStartSfxParams;                              // 0x128(0x28)
	struct WwiseEmitterCreationParams                            ActionStopSfxParams;                               // 0x150(0x28)
	class UClass*                                                StartInputId;                                      // 0x200(0x8)
	class UClass*                                                StopInputId;                                       // 0x208(0x8)
	TArray<class ItemActionEffect*>                              ActionEffects;                                     // 0x228(0x10)
	class ItemActionComponentAudioParams*                        ItemActionAudio;                                   // 0x288(0x8)
	class ForceFeedbackEffect*                                   ActionForceFeedback;                               // 0x290(0x8)
	struct FName                                                 ActionForceFeedbackTag;                            // 0x298(0x8)
	class Pawn*                                                  Wielder;                                           // 0x2c8(0x8)
	class WieldableItem*                                         ItemOwner;                                         // 0x2d0(0x8)
	char                                                         ActionState;                                       // 0x2d8(0x1)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class CompanySettings: public DeveloperSettings
{
public:
	TArray<struct Name>                                          CompaniesThatDoNotSupportDistinctions;             // 0x38(0x10)
};


// Size 0x68 (Full Size[0x130] - InheritedSize[0xc8]
class UIInputForwardComponent: public ActorComponent
{
public:
	class CoherentUIGTBaseComponent*                             TargetView;                                        // 0xc8(0x8)
};


// Size 0x90 (Full Size[0x158] - InheritedSize[0xc8]
class ChainLightningReceiverComponent: public ActorComponent
{
public:
	float                                                        ShockDuration;                                     // 0xd0(0x4)
};


// Size 0x1e8 (Full Size[0x5b0] - InheritedSize[0x3c8]
class SeaFortAlignmentFlagPole: public Actor
{
public:
	class SceneComponent*                                        ActorRoot;                                         // 0x3d8(0x8)
	class StaticMeshComponent*                                   FlagPoleMesh;                                      // 0x3e0(0x8)
	class StaticMeshComponent*                                   FlagMesh;                                          // 0x3e8(0x8)
	class InteractableComponentWithActionRules*                  FlagPoleInteractableComponent;                     // 0x3f0(0x8)
	struct AlignmentFlagMeshParams                               AlignmentFlagMeshParams;                           // 0x3f8(0x40)
	struct AlignmentFlagActionRuleParams                         AlignmentFlagActionRuleParams;                     // 0x438(0x18)
	struct AlignmentWorldMarkerParams                            AlignmentWorldMarkerParams;                        // 0x450(0x20)
	struct SeaFortAlignmentFlagPoleAudioParams                   FlagPoleAudioParams;                               // 0x470(0x70)
	char                                                         FlagAlignment;                                     // 0x4f8(0x1)
	bool                                                         AreAllFortEnemiesDefeated;                         // 0x4f9(0x1)
};


// Size 0xf0 (Full Size[0x118] - InheritedSize[0x28]
class BuoyantObjectSpawnProfileDataAsset: public DataAsset
{
public:
	struct BuoyantObjectSpawnProfile                             Profile;                                           // 0x28(0xf0)
};


// Size 0x28 (Full Size[0xf0] - InheritedSize[0xc8]
class TeleportAIAbilityParams: public AthenaAIAbilityParams
{
public:
	class EnvQuery*                                              QueryTemplate;                                     // 0xc8(0x8)
	float                                                        MinDistance;                                       // 0xd0(0x4)
	float                                                        MaxDistance;                                       // 0xd4(0x4)
	bool                                                         MaintainRotation;                                  // 0xd8(0x1)
	bool                                                         UseResurfaceDelay;                                 // 0xd9(0x1)
	struct AthenaAIAbilityPlayerBasedRanges                      ResurfaceDelay;                                    // 0xe0(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class GameEventParams: public DataAsset
{
public:
	float                                                        KeepAliveRadius;                                   // 0x28(0x4)
	struct FString                                               KeepAliveRadiusRemoteConfigKey;                    // 0x30(0x10)
	float                                                        InnerEncounterRadius;                              // 0x40(0x4)
	float                                                        OuterEncounterRadius;                              // 0x44(0x4)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class CategoryBase: public Object
{
public:
	struct FText                                                 Name;                                              // 0x28(0x38)
	struct FName                                                 UniqueTextIdentifier;                              // 0x60(0x8)
	struct StringAssetReference                                  IconPath;                                          // 0x68(0x10)
	struct FeatureFlag                                           FeatureToggle;                                     // 0x78(0xc)
};


// Size 0x38 (Full Size[0x100] - InheritedSize[0xc8]
class RewindDataVisualisationComponent: public ActorComponent
{
public:
	struct RewindPhysicsServiceEntry                             RewindEntry;                                       // 0xd0(0x30)
};


// Size 0x10 (Full Size[0x320] - InheritedSize[0x310]
class ShipAudioEmitterComponent: public WwiseEmitterComponent
{
public:
	class WwiseEvent*                                            WwiseEvent;                                        // 0x310(0x8)
	bool                                                         SetRTPC_Pitch;                                     // 0x318(0x1)
	bool                                                         SetRTPC_Roll;                                      // 0x319(0x1)
	bool                                                         SetRTPC_Velocity;                                  // 0x31a(0x1)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class FlamesOfFateSettingsAsset: public DataAsset
{
public:
	TArray<struct FlamesOfFateFlameInfo>                         FlameInfo;                                         // 0x28(0x10)
	TArray<struct FlamesOfFateShipInfo>                          ShipInfo;                                          // 0x38(0x10)
	TArray<char>                                                 SailWithFlamesAboardFlameTypesToIgnore;            // 0x48(0x10)
	TArray<struct SailWithFlameOfFateColoursAboardStatData>      SailWithFlamesAboardStatDataArray;                 // 0x58(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class FeatureToggleStatCondition: public StatCondition
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x28(0x8)
};


// Size 0x90 (Full Size[0x158] - InheritedSize[0xc8]
class GiveVoyageOnItemHandInRewardComponent: public ActorComponent
{
public:
	class UClass*                                                Company;                                           // 0xd0(0x8)
	TArray<struct VoyageHandInEntry>                             VoyageEntries;                                     // 0xd8(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class MerchantQuestRandomRequiredItemsDataAsset: public DataAsset
{
public:
	TArray<struct MerchantQuestCategoryGroup>                    CategoryGroups;                                    // 0x28(0x10)
};


// Size 0x4f0 (Full Size[0x8b8] - InheritedSize[0x3c8]
class Capstan: public Actor
{
public:
	struct CapstanParams                                         Parameters;                                        // 0x410(0x14)
	float                                                        MaxReleaseAngle;                                   // 0x424(0x4)
	float                                                        MaxReleaseHeight;                                  // 0x428(0x4)
	float                                                        MaxAngle;                                          // 0x42c(0x4)
	bool                                                         StartRaised;                                       // 0x430(0x1)
	class ControllableIntentCombinerComponent*                   IntentCombinerComponent;                           // 0x438(0x8)
	class SceneComponent*                                        RootSceneComponent;                                // 0x440(0x8)
	class StaticMeshMemoryConstraintComponent*                   MeshComponent;                                     // 0x448(0x8)
	class ChildActorComponent*                                   CapstanReleaseComponent;                           // 0x450(0x8)
	class ReplicatedShipPartCustomizationComponent*              CustomizationComponent;                            // 0x458(0x8)
	class CircularItemDropRedirectorComponent*                   ItemDropRedirector;                                // 0x460(0x8)
	TArray<class CapstanArm*>                                    CapstanArms;                                       // 0x468(0x10)
	struct CapstanAudioParams                                    AudioParameters;                                   // 0x478(0x68)
	bool                                                         CanSpinInfinitely;                                 // 0x4e0(0x1)
	class ShipDamageableComponent*                               CapstanDamageComponent;                            // 0x4f8(0x8)
	float                                                        ChanceToDropTheAnchorOnDamage;                     // 0x500(0x4)
	struct Vector                                                ShipPartFireCellActorSpaceLocation;                // 0x504(0xc)
	struct CapstanNetState                                       NetState;                                          // 0x560(0x8)
	struct WwiseEmitter                                          CapstanEmitter;                                    // 0x568(0x20)
	class DamageableShipPartAudioParams*                         CapstanDamageLevelAudio;                           // 0x588(0x8)
	class ParticleSystem*                                        CapstanDamageParticleSystem;                       // 0x590(0x8)
	struct ObjectMessagingDispatcher                             EventDispatcher;                                   // 0x598(0xa0)
	class CapstanDescAsset*                                      DescToSetWhenSafe;                                 // 0x868(0x8)
	class CapstanDescAsset*                                      CurrentCapstanDesc;                                // 0x870(0x8)
	bool                                                         IsCursed;                                          // 0x87a(0x1)
	float                                                        CursedIntent;                                      // 0x87c(0x4)
	class MemoryConstrainedMeshInitializer*                      MMCMeshInitializer;                                // 0x8a8(0x8)
};


// Size 0xf8 (Full Size[0x9e0] - InheritedSize[0x8e8]
class ItemReactionItemProxy: public StaticSimpleBootyItemProxy
{
public:
	class InteractableComponentWithActionRules*                  InteractableComponentWithActionRules;              // 0x8f0(0x8)
	struct ItemReactionItemProxyActionRuleParams                 ItemReactionItemProxyActionRuleParams;             // 0x8f8(0x88)
	TArray<Class>                                                InAllowedItems;                                    // 0x980(0x10)
	class UClass*                                                ItemToGive;                                        // 0x990(0x8)
	class WwiseEvent*                                            ExecuteInteractSFX;                                // 0x998(0x8)
	class WwiseEvent*                                            InsertKeySFX;                                      // 0x9a0(0x8)
	class WwiseEvent*                                            ReleaseKeySFX;                                     // 0x9a8(0x8)
	class WwiseObjectPoolWrapper*                                WwisePool;                                         // 0x9b0(0x8)
	struct FName                                                 WwiseEmitterName;                                  // 0x9b8(0x8)
};


// Size 0x1b0 (Full Size[0x278] - InheritedSize[0xc8]
class WeepingComponent: public ActorComponent
{
public:
	float                                                        FillRate;                                          // 0xc8(0x4)
	float                                                        MinWeepDuration;                                   // 0xcc(0x4)
	float                                                        MaxWeepDuration;                                   // 0xd0(0x4)
	float                                                        MinCalmDuration;                                   // 0xd4(0x4)
	float                                                        MaxCalmDuration;                                   // 0xd8(0x4)
	float                                                        MaterialBlendInTime;                               // 0xdc(0x4)
	float                                                        MaterialBlendOutTime;                              // 0xe0(0x4)
	float                                                        DecalBlendInTime;                                  // 0xe4(0x4)
	float                                                        DecalBlendOutTime;                                 // 0xe8(0x4)
	float                                                        SFXEmitterHeightOffset;                            // 0xec(0x4)
	class WwiseEvent*                                            StartWeepingSFX;                                   // 0xf0(0x8)
	class WwiseEvent*                                            StopWeepingSFX;                                    // 0xf8(0x8)
	class WwiseObjectPoolWrapper*                                WeepingSFXPool;                                    // 0x138(0x8)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0x140(0x10)
	class MaterialInstanceDynamic*                               DecalMaterial;                                     // 0x150(0x8)
	char                                                         State;                                             // 0x158(0x1)
	struct FName                                                 SupressableEmitterTag;                             // 0x190(0x8)
	TArray<class ParticleSystemComponent*>                       ParticleEmitters;                                  // 0x198(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class SeatStat: public Object
{
public:
	struct PlayerStat                                            Stat;                                              // 0x28(0x4)
};


// Size 0x180 (Full Size[0x248] - InheritedSize[0xc8]
class PlayerWalletComponent: public ActorComponent
{
public:
	struct WalletBalance                                         LastKnownBalance;                                  // 0xd0(0x10)
};


// Size 0x3e0 (Full Size[0x408] - InheritedSize[0x28]
class QuestsConfig: public DataAsset
{
public:
	TArray<struct CanvasLOD>                                     CanvasLODs;                                        // 0x28(0x10)
	class NamedAIDataAsset*                                      NamedAIDataAsset;                                  // 0x38(0x8)
	class UClass*                                                XMarksTheSpotMapItemInfoDescClass;                 // 0x40(0x8)
	float                                                        DefaultDigRadius;                                  // 0x48(0x4)
	float                                                        MinDistanceBetweenTreasureLocations;               // 0x4c(0x4)
	float                                                        DefaultRiddleDigRadius;                            // 0x50(0x4)
	class UClass*                                                RiddleMapItemInfoDescClass;                        // 0x58(0x8)
	class RiddleTextPhrasebookDataAsset*                         RiddlePhrasebookDataAsset;                         // 0x60(0x8)
	class RiddleQuestData*                                       RiddleQuestDataAsset;                              // 0x68(0x8)
	class RiddleQuestDescGeneratorData*                          RiddleQuestDescGeneratorData;                      // 0x70(0x8)
	class RiddleQuestValidLocationGeneratorData*                 RiddleQuestValidLocationGeneratorData;             // 0x78(0x8)
	class UClass*                                                BountyMapItemInfoDescClass;                        // 0x80(0x8)
	class BountyQuestData*                                       BountyQuestData;                                   // 0x88(0x8)
	class BountyQuestDescData*                                   BountyQuestDescData;                               // 0x90(0x8)
	class MerchantQuestData*                                     MerchantQuestData;                                 // 0x98(0x8)
	class UClass*                                                MerchantMapItemInfoDescClass;                      // 0xa0(0x8)
	class CargoRunQuestData*                                     CargoRunQuestData;                                 // 0xa8(0x8)
	class UClass*                                                CargoRunMapItemInfoDescClass;                      // 0xb0(0x8)
	class UClass*                                                HuntersCallCompany;                                // 0xb8(0x8)
	class VoyageProposalAssetSelector*                           VoyageProposalAssetData;                           // 0xc0(0x8)
	class WwiseEvent*                                            VoyageSelectionVoteCompletedSound;                 // 0xc8(0x8)
	struct BuriedTreasureChestParams                             BuriedTreasureChestParams;                         // 0xd0(0x48)
	TArray<struct VoyageProposalOverride>                        VoyageProposalOverrides;                           // 0x118(0x10)
	class UClass*                                                VoyageProposal;                                    // 0x128(0x8)
	class UClass*                                                VoyageProposal2;                                   // 0x130(0x8)
	class UClass*                                                VoyageProposal3;                                   // 0x138(0x8)
	class UClass*                                                VoyageProposal4;                                   // 0x140(0x8)
	struct StringAssetReference                                  VotingTableVoyageProposalDiveShipMesh;             // 0x148(0x10)
	struct Vector                                                VotingTableVoyageProposalDiveShipOffset;           // 0x158(0xc)
	TArray<struct QuestTableShipOffset>                          VotingTableVoyageProposalDiveShipOffsetPerCompany; // 0x168(0x10)
	struct Vector                                                VotingTableVoyageProposalDiveShipTallTaleOffset;   // 0x178(0xc)
	float                                                        VotingTableVoyageProposalDiveShipYaw;              // 0x184(0x4)
	float                                                        VotingTableVoyageProposalDiveShipScale;            // 0x188(0x4)
	TArray<class Class*>                                         AllTreasureArtifactsItemInfoDescs;                 // 0x190(0x10)
	TArray<class Class*>                                         AllMessageInBottles;                               // 0x1a0(0x10)
	TArray<class Class*>                                         AllSkeletonOrders;                                 // 0x1b0(0x10)
	TArray<class Class*>                                         AllCollectorsChests;                               // 0x1c0(0x10)
	class GoldInContainerDataAsset*                              GoldInContainerDataAsset;                          // 0x1d0(0x8)
	TArray<class Class*>                                         AllGoldMounds;                                     // 0x1d8(0x10)
	TArray<class Class*>                                         DefaultSeas;                                       // 0x1e8(0x10)
	struct StringAssetReference                                  MessageInABottleMapsDiscoveredBackgroundImage;     // 0x1f8(0x10)
	TArray<struct StringAssetReference>                          MessageInABottleMapsDiscoveredImages;              // 0x208(0x10)
	struct StringAssetReference                                  SkeletonOrderMapsDiscoveredBackgroundImage;        // 0x218(0x10)
	TArray<struct StringAssetReference>                          SkeletonOrderMapsDiscoveredImages;                 // 0x228(0x10)
	struct StringAssetReference                                  CoralMessageInABottleMapsDiscoveredBackgroundImage; // 0x238(0x10)
	TArray<struct StringAssetReference>                          CoralMessageInABottleMapsDiscoveredImages;         // 0x248(0x10)
	struct StringAssetReference                                  AthenaMessageInABottleMapsDiscoveredBackgroundImage; // 0x258(0x10)
	TArray<struct StringAssetReference>                          AthenaMessageInABottleMapsDiscoveredImages;        // 0x268(0x10)
	struct StringAssetReference                                  AshenMessageInABottleMapsDiscoveredBackgroundImage; // 0x278(0x10)
	TArray<struct StringAssetReference>                          AshenMessageInABottleMapsDiscoveredImages;         // 0x288(0x10)
	struct StringAssetReference                                  GoldMessageInABottleMapsDiscoveredBackgroundImage; // 0x298(0x10)
	TArray<struct StringAssetReference>                          GoldMessageInABottleMapsDiscoveredImages;          // 0x2a8(0x10)
	class WwiseEvent*                                            TutorialStepStartSfx;                              // 0x2b8(0x8)
	struct Rotator                                               TutorialCutsceneSpawnpointRotation;                // 0x2c0(0xc)
	struct Vector                                                TutorialCutsceneFirstPersonMeshOffset;             // 0x2cc(0xc)
	float                                                        TutorialCutsceneCharacterModelReplacedEventTimeout; // 0x2d8(0x4)
	float                                                        TutorialCutsceneTimeBeforeFadeIn;                  // 0x2dc(0x4)
	float                                                        TutorialCutsceneFadeInDuration;                    // 0x2e0(0x4)
	class UClass*                                                FoodToAddToInventoryInEatingTutorial;              // 0x2e8(0x8)
	float                                                        TutorialStartingHealth;                            // 0x2f0(0x4)
	class PopUpMessageDesc*                                      TutorialEatBananaOpenRadial;                       // 0x2f8(0x8)
	class PopUpMessageDesc*                                      TutorialSelectBananaPopupDesc;                     // 0x300(0x8)
	class PopUpMessageDesc*                                      TutorialEatBananaPopupDesc;                        // 0x308(0x8)
	class PopUpMessageDesc*                                      TutorialCycleWeaponPopupDesc;                      // 0x310(0x8)
	class PopUpMessageDesc*                                      TutorialUseMapOpenRadial;                          // 0x318(0x8)
	class PopUpMessageDesc*                                      TutorialSelectMap;                                 // 0x320(0x8)
	class PopUpMessageDesc*                                      TutorialUseMapPopupDesc;                           // 0x328(0x8)
	class PopUpMessageDesc*                                      TutorialShowMapPopupDesc;                          // 0x330(0x8)
	class UClass*                                                MapToAddToInventoryInTutorial;                     // 0x338(0x8)
	class PopUpMessageDesc*                                      TutorialBuyVoyagePopupDesc;                        // 0x340(0x8)
	class PopUpMessageDesc*                                      TutorialBuyVoyageNextOptionsDesc;                  // 0x348(0x8)
	class PopUpMessageDesc*                                      PlaceVoyageOnCaptainTablePopupDesc;                // 0x350(0x8)
	class PopUpMessageDesc*                                      ReturnBootyToTraderPopupDesc;                      // 0x358(0x8)
	class PopUpMessageDesc*                                      TutorialBuyClothesPopupDesc;                       // 0x360(0x8)
	class PopUpMessageDesc*                                      TutorialEquipItemPopupDesc;                        // 0x368(0x8)
	class FootstepIDAsset*                                       GoldHoarderToClothesShopFootstepID;                // 0x370(0x8)
	class FootstepIDAsset*                                       ClothesShopToVanityChestFootstepID;                // 0x378(0x8)
	class PopUpMessageDesc*                                      MermaidTutorialPopupDesc;                          // 0x380(0x8)
	struct RewardId                                              OnTutorialEndedRewardId;                           // 0x388(0x8)
	struct FName                                                 OnTutorialEndedRewardCompanyName;                  // 0x390(0x8)
	class UClass*                                                ChestInventoryInSellTreasureStep;                  // 0x398(0x8)
	TArray<struct Name>                                          IslandNamesWithFemaleStranger;                     // 0x3a0(0x10)
	class PopUpMessageDesc*                                      TutorialTalkToStrangerPopupDesc;                   // 0x3b0(0x8)
	class PopUpMessageDesc*                                      TutorialTalkToFemaleStrangerPopupDesc;             // 0x3b8(0x8)
	class PopUpMessageDesc*                                      TutorialSellTreasurePopupDesc;                     // 0x3c0(0x8)
	class PopUpMessageDesc*                                      TutorialPickUpChestPopupDesc;                      // 0x3c8(0x8)
	class FootstepIDAsset*                                       StrangerToGoldHoarderFootstepID;                   // 0x3d0(0x8)
	class PopUpMessageDesc*                                      ReturnToStrangerPopupDesc;                         // 0x3d8(0x8)
	class PopUpMessageDesc*                                      ReturnToStrangerFemalePopupDesc;                   // 0x3e0(0x8)
	class PopUpMessageDesc*                                      GoItAlonePopupDesc;                                // 0x3e8(0x8)
	class PopUpMessageDesc*                                      BeginTallTalePopupDesc;                            // 0x3f0(0x8)
	TArray<struct EmissaryCompanyQuestIcons>                     EmissaryCompanyIcons;                              // 0x3f8(0x10)
};


// Size 0x110 (Full Size[0x4d8] - InheritedSize[0x3c8]
class MatineeUtility: public Actor
{
public:
	class AthenaPlayerCharacter*                                 BoundCharacter;                                    // 0x4d0(0x8)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class OnBuryAdjustFuseTimeScale: public OnBuryStrategy
{
public:
	float                                                        FuseTimeScaleOnBury;                               // 0x28(0x4)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class CutsceneResponseComponent: public ActorComponent
{
public:
	TArray<class CutsceneResponseSheet*>                         Sheets;                                            // 0xc8(0x10)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class AmmoChangeEffect: public AmmoBaseEffect
{
public:
	struct AmmoChangeEffectParams                                AmmoChangeEffectParams;                            // 0x28(0x40)
};


// Size 0x148 (Full Size[0x290] - InheritedSize[0x148]
class FlamesOfFateInteractableComponent: public InteractableComponent
{
public:
	struct FText                                                 DisplayName;                                       // 0x160(0x38)
	struct FText                                                 TakeFlameTooltipText;                              // 0x198(0x38)
	struct FText                                                 LanternNotRaisedToolTipText;                       // 0x1d0(0x38)
	struct FText                                                 NotWieldingFlameTooltipText;                       // 0x208(0x38)
	struct FText                                                 CannotSetFlameTooltipText;                         // 0x240(0x38)
	char                                                         FlameColour;                                       // 0x278(0x1)
};


// Size 0x10 (Full Size[0x180] - InheritedSize[0x170]
class EnvQueryTest_InSpecificIslandZone: public EnvQueryTest
{
public:
	float                                                        Radius;                                            // 0x170(0x4)
	struct FName                                                 IslandName;                                        // 0x174(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class SceneDialogueContext: public Object
{
public:
	class SceneDialogueSection*                                  Section;                                           // 0x38(0x8)
};


// Size 0x1c0 (Full Size[0x2c0] - InheritedSize[0x100]
class PiratePreviewComponent: public CoherentUIGTRenderToTextureLiveView
{
public:
	struct FName                                                 DefaultCamera;                                     // 0x168(0x8)
	assetclass                                                   ClassToSpawn;                                      // 0x170(0x20)
	struct IntPoint                                              DefaultResolution;                                 // 0x190(0x8)
	struct PiratePreviewView                                     CurrentView;                                       // 0x198(0x20)
	TArray<class Class*>                                         CurrentlySuppressedCategories;                     // 0x1b8(0x10)
	class RenderToTextureSceneDetails*                           Details;                                           // 0x1e0(0x8)
	struct ClothingLoadout                                       ClothingLoadout;                                   // 0x1e8(0x30)
};


// Size 0x18 (Full Size[0x78] - InheritedSize[0x60]
class TaleAggressiveGhostShipEncounterService: public TaleQuestService
{
public:
	class TaleAggressiveGhostShipEncounterServiceDesc*           ServiceDesc;                                       // 0x68(0x8)
	class AggressiveGhostShipsEncounter*                         ActiveGhostShipEncounter;                          // 0x70(0x8)
};


// Size 0x1b8 (Full Size[0x280] - InheritedSize[0xc8]
class RevealableComponent: public ActorComponent
{
public:
	float                                                        ActorHiddenDistance;                               // 0xd0(0x4)
	float                                                        MaterialVisibleDistance;                           // 0xd4(0x4)
	float                                                        CloseRevealDistance;                               // 0xd8(0x4)
	bool                                                         InverseRevealableLogic;                            // 0xdc(0x1)
	class UClass*                                                SceneType;                                         // 0xe0(0x8)
	TArray<class RevealRequirement*>                             RevealRequirements;                                // 0xe8(0x10)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0xf8(0x10)
	multicastinlinedelegate                                      OnCloseRevealDelegate;                             // 0x108(0x10)
	multicastinlinedelegate                                      OnFarRevealDelegate;                               // 0x118(0x10)
	multicastinlinedelegate                                      OnHideDelegate;                                    // 0x128(0x10)
	multicastinlinedelegate                                      OnServerCloseRevealDelegate;                       // 0x138(0x10)
	multicastinlinedelegate                                      OnServerFarRevealDelegate;                         // 0x148(0x10)
	multicastinlinedelegate                                      OnServerHideDelegate;                              // 0x158(0x10)
	class Object*                                                TargetGameStateObject;                             // 0x168(0x8)
	bool                                                         PermanentlyRevealed;                               // 0x170(0x1)
	TArray<class RevealRequirement*>                             RequirementsPerRevealer;                           // 0x1e8(0x10)
	TArray<class RevealRequirement*>                             RequirementsPerRevealable;                         // 0x1f8(0x10)
};


// Size 0x28 (Full Size[0xc0] - InheritedSize[0x98]
class TaleQuestAssignVaultStep: public TaleQuestStep
{
public:
	class TaleQuestAssignVaultStepDesc*                          StepDesc;                                          // 0x98(0x8)
	bool                                                         VaultAssigned;                                     // 0xa0(0x1)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class HasEntitlementStatCondition: public StatCondition
{
public:
	int                                                          RequiredNumberToMatch;                             // 0x28(0x4)
	TArray<class Class*>                                         RequiredEntitlements;                              // 0x30(0x10)
};


// Size 0x250 (Full Size[0x318] - InheritedSize[0xc8]
class LightningComponent: public ActorComponent
{
public:
	class LightningDataAsset*                                    LightningDataAsset;                                // 0xc8(0x8)
	class ExplosionComponent*                                    CachedExplosionComponent;                          // 0xd0(0x8)
	class StaticMeshComponent*                                   BaseCloudMeshComponent;                            // 0xd8(0x8)
	struct ActiveLightning                                       ActiveLightning;                                   // 0xe0(0xc8)
	TArray<class StaticMeshComponent*>                           LightningMeshComponents;                           // 0x270(0x10)
};


// Size 0x8 (Full Size[0x990] - InheritedSize[0x988]
class CollectorsChestItemProxyWithOpenableComponent: public CollectorsChestItemProxyBase
{
public:
	class OpenableItemComponent*                                 OpenableItemComponent;                             // 0x988(0x8)
};


// Size 0xc0 (Full Size[0x188] - InheritedSize[0xc8]
class ReapersTributeShipDespawnComponent: public ActorComponent
{
public:
	float                                                        DespawningSequenceDuration;                        // 0xc8(0x4)
	bool                                                         ApplyAlphaValueToDynamicMaterials;                 // 0xcc(0x1)
	struct FName                                                 MaterialParamToUseForAlpha;                        // 0xd0(0x8)
	class MaterialInterface*                                     MaterialToReplaceIncompatibleMaterialsWith;        // 0xd8(0x8)
	multicastinlinedelegate                                      OnDespawningSequenceTicked;                        // 0xe0(0x10)
	class WwiseEvent*                                            DespawnSFX;                                        // 0xf0(0x8)
	class WwiseObjectPoolWrapper*                                PoolWrapper;                                       // 0xf8(0x8)
};


// Size 0x2f0 (Full Size[0x600] - InheritedSize[0x310]
class KrakenTentacleAIAudioComponent: public AICharacterAudioComponent
{
public:
	float                                                        MouthHeightOffset;                                 // 0x310(0x4)
	class KrakenTentacleAIAudioComponentParams*                  KrakenTentacleAudioParams;                         // 0x318(0x8)
	struct WwiseEmitter                                          KrakenTentacleMouthEmitter;                        // 0x320(0x20)
};


// Size 0xc8 (Full Size[0x190] - InheritedSize[0xc8]
class OnboardCharacterTrackerComponent: public ActorComponent
{
public:
	TArray<uintptr_t>                                            OnboardCharacters;                                 // 0x180(0x10)
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class CountTooltipCustomizerComponent: public ActorComponent
{
public:
	class UClass*                                                CountType;                                         // 0xe0(0x8)
	struct FText                                                 DescriptionDisplayText;                            // 0xe8(0x38)
	bool                                                         DisplayBaseTooltipOnlyWhenCountIsAboveACertainValue; // 0x120(0x1)
	float                                                        MinimumValueToDisplayModifiedTooltip;              // 0x124(0x4)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class NPCDialogPredicateIsWearingAny: public NPCDialogPredicate
{
public:
	TArray<class Class*>                                         ClothingItems;                                     // 0x38(0x10)
};


// Size 0x8 (Full Size[0x178] - InheritedSize[0x170]
class EnvQueryTest_InIslandSafeZone: public EnvQueryTest
{
public:
	float                                                        Radius;                                            // 0x170(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class XPReward: public Reward
{
public:
	uint32                                                       Xp;                                                // 0x28(0x4)
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class BTTask_WaitForWieldBase: public BTTaskNode
{
public:
	bool                                                         WaitForUnstashed;                                  // 0x60(0x1)
};


// Size 0x80 (Full Size[0xa8] - InheritedSize[0x28]
class BalanceableWalkwayFXParams: public DataAsset
{
public:
	class WwiseEvent*                                            WalkwayStartSFX;                                   // 0x28(0x8)
	class WwiseEvent*                                            WalkwayEndSFX;                                     // 0x30(0x8)
	class WwiseEvent*                                            AttachToWalkwayAdditiveOneShotSFX;                 // 0x38(0x8)
	class WwiseEvent*                                            DetachFromWalkwayAdditiveOneShotSFX;               // 0x40(0x8)
	class WwiseEvent*                                            WalkwayLoopStartSFX;                               // 0x48(0x8)
	class WwiseEvent*                                            WalkwayLoopEndSFX;                                 // 0x50(0x8)
	class WwiseEvent*                                            WalkwaySprintLoopStartSFX;                         // 0x58(0x8)
	class WwiseEvent*                                            WalkwaySprintLoopEndSFX;                           // 0x60(0x8)
	class WwiseEvent*                                            WalkwaySlideLoopStartSFX;                          // 0x68(0x8)
	class WwiseEvent*                                            WalkwaySlideLoopEndSFX;                            // 0x70(0x8)
	class WwiseEvent*                                            WalkwaySlideEndSFX;                                // 0x78(0x8)
	struct FName                                                 PlayerSpeedOnWalkwayRTPC;                          // 0x80(0x8)
	struct FName                                                 PlayerTiltOnWalkwayRTPC;                           // 0x88(0x8)
	class ParticleSystem*                                        PlayerWalkwayWindVFX;                              // 0x90(0x8)
	class ParticleSystem*                                        PlayerWalkwayTrailVFX;                             // 0x98(0x8)
	struct Vector2D                                              SpawnParticleSpeedThreshold;                       // 0xa0(0x8)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ConditionalStatsTriggerType: public Object
{
public:
	struct FName                                                 UniqueTextIdentifier;                              // 0x28(0x8)
};


// Size 0xd8 (Full Size[0x4a0] - InheritedSize[0x3c8]
class CoordinatedKraken: public Actor
{
public:
	multicastinlinedelegate                                      OnSpecialEventDelegate;                            // 0x3d0(0x10)
	class UClass*                                                TentacleType;                                      // 0x3e0(0x8)
	class UClass*                                                HeadType;                                          // 0x3e8(0x8)
	class SceneComponent*                                        KrakenRoot;                                        // 0x3f0(0x8)
	class KrakenActionCoordinatorComponent*                      KrakenActionCoordinator;                           // 0x3f8(0x8)
	TArray<struct CoordinatedKrakenPhaseAssetEntry>              PhaseAssets;                                       // 0x400(0x10)
	struct Transform                                             HeadSpawnTransform;                                // 0x440(0x30)
	class KrakenHead*                                            SpawnedHead;                                       // 0x470(0x8)
	class NetworkClusterEventRoom*                               NetworkClusterEventRoom;                           // 0x478(0x8)
	class Actor*                                                 TargetActor;                                       // 0x480(0x8)
	TArray<struct CoordinatedKrakenTentacleSpawnInfo>            TentacleSpawnInfo;                                 // 0x488(0x10)
	char                                                         ReplicatedTargetActorOverride;                     // 0x498(0x1)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class CustomVaultService: public Object
{
public:
	class World*                                                 World;                                             // 0x30(0x8)
	struct Guid                                                  CustomVaultServiceId;                              // 0x38(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class MechanismEvent: public Object
{
public:
	class Actor*                                                 Owner;                                             // 0x28(0x8)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class StatusResponseSoberUpOverTime: public StatusResponse
{
public:
	char                                                         SourceOfDrunkenness;                               // 0x30(0x1)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class ContestSettings: public DeveloperSettings
{
public:
	struct StringAssetReference                                  ContestModuleSettingsDataAsset;                    // 0x38(0x10)
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class TaleQuestIsFeatureEnabledStepDesc: public TaleQuestStepDesc
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x80(0xc)
	struct QuestVariableBool                                     Enabled;                                           // 0x90(0x30)
};


// Size 0xb98 (Full Size[0xbc0] - InheritedSize[0x28]
class WaterGunLiquidLauncherController: public Object
{
public:
	struct LiquidLauncherCollisionsParams                        LiquidLauncherCollisionParams;                     // 0x30(0x68)
	struct Status                                                LiquidLauncherCollisionStatusEffect;               // 0x98(0x18)
	float                                                        TimeUntilApplyStatusEffect;                        // 0xb0(0x4)
	float                                                        TimeToConsiderActorOutsideLiquid;                  // 0xb4(0x4)
	float                                                        LiquidLauncherCollisionDamageAmount;               // 0xb8(0x4)
	float                                                        DamagePerSecondInsideLiquid;                       // 0xbc(0x4)
	float                                                        GravityStrength;                                   // 0xc0(0x4)
	float                                                        GravityCurveStrength;                              // 0xc4(0x4)
	float                                                        LiquidLauncherGoopBurningTime;                     // 0xc8(0x4)
	float                                                        LiquidLauncherGoopBurningDrainPerSecond;           // 0xcc(0x4)
	class WaterGunWieldableItem*                                 WaterGun;                                          // 0xd0(0x8)
	map                                                          ActorsInsideLiquid;                                // 0xd8(0x50)
	map                                                          ActorsWithLiquidGoopStatus;                        // 0x128(0x50)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class LootTeleportFilterDataAsset: public DataAsset
{
public:
	TArray<Class>                                                TargetProxyTypes;                                  // 0x28(0x10)
	TArray<Class>                                                IgnoredProxyTypes;                                 // 0x38(0x10)
	assetclass                                                   EmissaryFlagBaseType;                              // 0x48(0x20)
	bool                                                         IgnoreStorageContainers;                           // 0x68(0x1)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class IslandFrameworkSettings: public DeveloperSettings
{
public:
	struct FName                                                 IslandTypeStateGroup;                              // 0x38(0x8)
	struct StringAssetReference                                  IslandDataFileLocation;                            // 0x40(0x10)
	float                                                        SurfaceUpperBound;                                 // 0x50(0x4)
	float                                                        SurfaceLowerBound;                                 // 0x54(0x4)
	float                                                        TreasuryAwarenessProximity;                        // 0x58(0x4)
};


// Size 0xb8 (Full Size[0xe0] - InheritedSize[0x28]
class QuestBookPagesInContainerDataAsset: public DataAsset
{
public:
	struct Transform                                             Transform;                                         // 0x30(0x30)
	class StaticMesh*                                            PagesMesh;                                         // 0x60(0x8)
	struct FText                                                 ActionTooltipDisplayString;                        // 0x68(0x38)
	struct FText                                                 ActionTooltipDisplayStringSentence;                // 0xa0(0x38)
};


// Size 0x80 (Full Size[0xa8] - InheritedSize[0x28]
class ShantyService: public Object
{
public:
	TArray<class Ensemble*>                                      EnsembleActors;                                    // 0x30(0x10)
	class ShantySettings*                                        ShantySettings;                                    // 0x40(0x8)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class LightningManagerDataAsset: public DataAsset
{
public:
	float                                                        LightningTargetHeightThreshold;                    // 0x28(0x4)
	float                                                        ShipNearMissMaxX;                                  // 0x2c(0x4)
	float                                                        ShipNearMissMaxY;                                  // 0x30(0x4)
	float                                                        NearPlayerMinRadius;                               // 0x34(0x4)
	float                                                        NearPlayerMaxRadius;                               // 0x38(0x4)
	float                                                        InactiveTimePerTest;                               // 0x3c(0x4)
	float                                                        NearbyGhostShipEncounterRadiusInMetres;            // 0x40(0x4)
	TArray<struct LightningStrikeFrequency>                      LightningStrikeFrequency;                          // 0x48(0x10)
	struct LightningTargetSelector                               TargetSelector;                                    // 0x58(0x10)
};


// Size 0x20 (Full Size[0xb8] - InheritedSize[0x98]
class TaleQuestBranchStep: public TaleQuestStep
{
public:
	class TaleQuestBranchStepDesc*                               Desc;                                              // 0x98(0x8)
	interface                                                    Step;                                              // 0xa0(0x10)
};


// Size 0x128 (Full Size[0x1f0] - InheritedSize[0xc8]
class PacingComponent: public ActorComponent
{
public:
	class PacingComponentPublicData*                             PublicData;                                        // 0xd0(0x8)
	class AthenaPlayerCharacter*                                 Player;                                            // 0xe8(0x8)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class PlayerAtmosphericsAudioComponentParams: public DataAsset
{
public:
	class WwiseEvent*                                            WindStartEvent;                                    // 0x28(0x8)
	class WwiseEvent*                                            WindStopEvent;                                     // 0x30(0x8)
	class WwiseEvent*                                            RainStartEvent;                                    // 0x38(0x8)
	class WwiseEvent*                                            RainStopEvent;                                     // 0x40(0x8)
	struct FName                                                 GlobalWindSpeedRtpc;                               // 0x48(0x8)
	struct FName                                                 PlayerWindAngleRtpc;                               // 0x50(0x8)
	struct FName                                                 PlayerVerticalSpeedRtpc;                           // 0x58(0x8)
	struct FName                                                 AtmosphericPressureFreqRtpc;                       // 0x60(0x8)
	struct FName                                                 AtmosphericPressureVolRtpc;                        // 0x68(0x8)
	float                                                        AtmosphericPressureFreqTimebase;                   // 0x70(0x4)
	float                                                        AtmosphericPressureVolTimebase;                    // 0x74(0x4)
	TArray<struct PoolDensityData>                               PoolDensityWrapperData;                            // 0x78(0x10)
};


// Size 0x108 (Full Size[0x1d0] - InheritedSize[0xc8]
class FrontendScrambledNamesComponent: public ActorComponent
{
public:
	class ScrambledNamesDataAsset*                               ScrambledPlayerNamesDataAsset;                     // 0x1b8(0x8)
	class ScrambledNamesDataAsset*                               ScrambledShipNamesDataAsset;                       // 0x1c0(0x8)
	class ScrambledNamesDataAsset*                               ScrambledGuildNamesDataAsset;                      // 0x1c8(0x8)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class WheelDescAsset: public ShipPartDescAsset
{
public:
	struct WheelDesc                                             WheelDesc;                                         // 0x28(0x28)
};


// Size 0x8 (Full Size[0xd0] - InheritedSize[0xc8]
class AshCloudAIAbilityParams: public AthenaAIAbilityParams
{
public:
	class UClass*                                                AshCloudClass;                                     // 0xc8(0x8)
};


// Size 0x1b8 (Full Size[0x280] - InheritedSize[0xc8]
class CoherentToWwiseEventComponent: public ActorComponent
{
public:
	struct StringAssetReference                                  UIAudioCuesTableLocation;                          // 0xc8(0x10)
	class CoherentToWwiseEventDataAsset*                         UIAudioCuesAsset;                                  // 0xd8(0x8)
	struct FName                                                 AudioGameStateGroup;                               // 0xe0(0x8)
	struct FName                                                 AudioGameStateIngame;                              // 0xe8(0x8)
	struct FName                                                 AudioGameStateInMenu;                              // 0xf0(0x8)
	struct FName                                                 AudioGameStateLoading;                             // 0xf8(0x8)
	struct FName                                                 AudioGameStateInFrontEnd;                          // 0x100(0x8)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class SetMechanismActionCutsceneNameStepDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 CutsceneName;                                      // 0x80(0x8)
	struct QuestVariableActor                                    MechanismActor;                                    // 0x88(0x30)
};


// Size 0x360 (Full Size[0x388] - InheritedSize[0x28]
class AggressiveGhostShipAnimationDataAsset: public DataAsset
{
public:
	struct RuntimeVectorCurve                                    LocationCurve;                                     // 0x28(0x170)
	struct RuntimeVectorCurve                                    RotationCurve;                                     // 0x198(0x170)
	struct RuntimeFloatCurve                                     VelocityCurve;                                     // 0x308(0x80)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class FireStatStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariablePlayerStat                               Stat;                                              // 0x80(0x30)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class CampaignPopUpNotificationDataAsset: public DataAsset
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x28(0x8)
	TArray<struct CampaignPopUpNotificationInfo>                 CampaignPopUpNotifications;                        // 0x30(0x10)
};


// Size 0x8 (Full Size[0x150] - InheritedSize[0x148]
class PuzzleStatueInteractableComponent: public InteractableComponent
{
public:
	class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x148(0x8)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class GhostShipTickManager: public Actor
{
public:
	TArray<class Actor*>                                         GhostShipActors;                                   // 0x3c8(0x10)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class LandmarkReactionEvent: public Object
{
public:
	assetobject                                                  Target;                                            // 0x28(0x20)
	bool                                                         UseDefaultTarget;                                  // 0x48(0x1)
	class Actor*                                                 ResolvedTarget;                                    // 0x50(0x8)
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class ReplicatedShipPartCustomizationComponent: public ShipPartCustomizationComponent
{
public:
	struct PartDesc                                              PartDesc;                                          // 0xc8(0x20)
};


// Size 0x158 (Full Size[0x2a0] - InheritedSize[0x148]
class CollectorsChestItemSlotInteractable: public InteractableComponent
{
public:
	int                                                          SlotId;                                            // 0x158(0x4)
	class StaticMeshMemoryConstraintComponent*                   ItemMeshComponent;                                 // 0x170(0x8)
	struct CollectorsChestStoredItemInfo                         StoredItemInfo;                                    // 0x178(0x68)
	class WwiseEvent*                                            PlaceItemSound;                                    // 0x1f0(0x8)
	class WwiseEvent*                                            PickupItemSound;                                   // 0x1f8(0x8)
	class WwiseObjectPoolWrapper*                                EmitterPool;                                       // 0x200(0x8)
	float                                                        PlaceLerpTime;                                     // 0x208(0x4)
	float                                                        LocalPredictionTimeout;                            // 0x20c(0x4)
	class MemoryConstrainedMeshInitializer*                      MMCMeshInitializer;                                // 0x290(0x8)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class SetMechanismActivationModeStep: public TaleQuestStep
{
public:
	class SetMechanismActivationModeStepDesc*                    Desc;                                              // 0x98(0x8)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class CaptainsLogPartDescAsset: public ShipPartDescAsset
{
public:
	struct CaptainsLogPartDesc                                   CaptainsLogPartDesc;                               // 0x28(0x40)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestAssignContendedResourceStep: public TaleQuestStep
{
public:
	class TaleQuestAssignContendedResourceStepDesc*              StepDesc;                                          // 0x98(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class TimeOfDayDataAsset: public DataAsset
{
public:
	float                                                        SunriseStartHour;                                  // 0x28(0x4)
	float                                                        MorningStartHour;                                  // 0x2c(0x4)
	float                                                        MidDayStartHour;                                   // 0x30(0x4)
	float                                                        AfternoonStartHour;                                // 0x34(0x4)
	float                                                        SunsetStartHour;                                   // 0x38(0x4)
	float                                                        NightStartHour;                                    // 0x3c(0x4)
};


// Size 0x20 (Full Size[0x3e8] - InheritedSize[0x3c8]
class GlobalEmitterService: public Actor
{
public:
	class ImpactListDataAsset*                                   ImpactListDataAsset;                               // 0x3e0(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ClueSiteTypeToMapMarkIdDataAsset: public DataAsset
{
public:
	TArray<struct ClueSiteTypeToMarkId>                          ClueSiteTypeToMarkIdMap;                           // 0x28(0x10)
};


// Size 0x58 (Full Size[0x120] - InheritedSize[0xc8]
class SequenceComponent: public ActorComponent
{
public:
	multicastinlinedelegate                                      CorrectKeyPressedDelegate;                         // 0xc8(0x10)
	multicastinlinedelegate                                      IncorrectKeyPressedDelegate;                       // 0xd8(0x10)
	multicastinlinedelegate                                      SequenceCompleteDelegate;                          // 0xe8(0x10)
	TArray<int>                                                  Sequence;                                          // 0xf8(0x10)
	bool                                                         ResetOnError;                                      // 0x108(0x1)
	bool                                                         SequenceComplete;                                  // 0x109(0x1)
	TArray<struct SequenceResponseContainer>                     Responses;                                         // 0x110(0x10)
};


// Size 0x300 (Full Size[0x328] - InheritedSize[0x28]
class LightingControllerSettings: public DataAsset
{
public:
	class CurveFloat*                                            FogDensityCurve;                                   // 0x28(0x8)
	class CurveFloat*                                            FogStartDistanceCurve;                             // 0x30(0x8)
	class CurveFloat*                                            LightIntensityCurve;                               // 0x38(0x8)
	class CurveFloat*                                            SkyDomeBrightnessCurve;                            // 0x40(0x8)
	class CurveFloat*                                            SkyDomeMoonVisibilityCurve;                        // 0x48(0x8)
	class CurveFloat*                                            SkyDomeStarBrightnessCurve;                        // 0x50(0x8)
	class CurveFloat*                                            SkyDomeSunBrightnessCurve;                         // 0x58(0x8)
	class CurveFloat*                                            PostLPVIntensityCurve;                             // 0x60(0x8)
	class CurveFloat*                                            PostExposureBiasCurve;                             // 0x68(0x8)
	class CurveFloat*                                            PostLPVOcclusionIntensityCurve;                    // 0x70(0x8)
	class CurveFloat*                                            SkyLightIntensityCurve;                            // 0x78(0x8)
	class CurveFloat*                                            FogBrightnessNearCurve;                            // 0x80(0x8)
	class CurveFloat*                                            FogBrightnessFarCurve;                             // 0x88(0x8)
	class CurveFloat*                                            PostBloomIntensityCurve;                           // 0x90(0x8)
	class CurveFloat*                                            PostBloomThresholdCurve;                           // 0x98(0x8)
	class CurveFloat*                                            SkyDomeAuraBrightnessCurve;                        // 0xa0(0x8)
	class CurveFloat*                                            PostReflectionProbeBrightnessCurve;                // 0xa8(0x8)
	class CurveFloat*                                            PostReflectionProbeShadowBrightnessCurve;          // 0xb0(0x8)
	class CurveFloat*                                            VfxControllerCurve;                                // 0xb8(0x8)
	class CurveFloat*                                            FogMaxOpacityCurve;                                // 0xc0(0x8)
	class CurveFloat*                                            FogScatterExpCurve;                                // 0xc8(0x8)
	class CurveFloat*                                            FogUnderwaterDensityCurve;                         // 0xd0(0x8)
	class CurveFloat*                                            PostLensFlareIntensityCurve;                       // 0xd8(0x8)
	class CurveFloat*                                            EmissiveFoliageCurve;                              // 0xe0(0x8)
	class CurveFloat*                                            EmissiveLightsCurve;                               // 0xe8(0x8)
	class CurveFloat*                                            PostExposureMinBrightnessCurve;                    // 0xf0(0x8)
	class CurveFloat*                                            PostExposureMaxBrightnessCurve;                    // 0xf8(0x8)
	class CurveFloat*                                            SkyDomeMoonBrightnessCurve;                        // 0x100(0x8)
	class CurveFloat*                                            SkyDomeHorizonCloudBrightnessCurve;                // 0x108(0x8)
	class CurveFloat*                                            SkyDomeGreenFlashStrengthCurve;                    // 0x110(0x8)
	class CurveFloat*                                            PostSaturationCurve;                               // 0x118(0x8)
	class CurveFloat*                                            PostContrastCurve;                                 // 0x120(0x8)
	class CurveFloat*                                            CloudRimlightScaleCurve;                           // 0x128(0x8)
	class CurveFloat*                                            CloudSkylightScaleCurve;                           // 0x130(0x8)
	class CurveFloat*                                            CloudSunlightScaleCurve;                           // 0x138(0x8)
	class CurveFloat*                                            CloudGlobalPressureCurve;                          // 0x140(0x8)
	class CurveFloat*                                            PostUnderWaterBrightnessCurve;                     // 0x148(0x8)
	class CurveFloat*                                            VfxCloudBrightnessCurve;                           // 0x150(0x8)
	class CurveFloat*                                            LightGodRayIntensityCurve;                         // 0x158(0x8)
	class CurveFloat*                                            CloudBottomBrightnessCurve;                        // 0x160(0x8)
	class CurveFloat*                                            CloudSunlightShadowingCurve;                       // 0x168(0x8)
	class CurveFloat*                                            SunDiscScaleCurve;                                 // 0x170(0x8)
	class CurveFloat*                                            WaterSpecularBrightnessCurve;                      // 0x178(0x8)
	class CurveFloat*                                            VfxAmbientScaleCurve;                              // 0x180(0x8)
	class CurveFloat*                                            CloudShadowBrightnessCurve;                        // 0x188(0x8)
	class CurveFloat*                                            StormCloudShadowBrightnessCurve;                   // 0x190(0x8)
	class CurveFloat*                                            StormPostBloomIntensityCurve;                      // 0x198(0x8)
	class CurveFloat*                                            StormPostBloomThresholdCurve;                      // 0x1a0(0x8)
	class CurveFloat*                                            DirectionalLightShadowSteppingRateCurve;           // 0x1a8(0x8)
	class CurveFloat*                                            SkullBrightnessCurve;                              // 0x1b0(0x8)
	class CurveLinearColor*                                      FogColourAwayCurve;                                // 0x1b8(0x8)
	class CurveLinearColor*                                      FogColourTowardsCurve;                             // 0x1c0(0x8)
	class CurveLinearColor*                                      LightSunColourCurve;                               // 0x1c8(0x8)
	class CurveLinearColor*                                      SkyDomeHorizonColourCurve;                         // 0x1d0(0x8)
	class CurveLinearColor*                                      SkyDomeZenithColourCurve;                          // 0x1d8(0x8)
	class CurveLinearColor*                                      SkyLightColourCurve;                               // 0x1e0(0x8)
	class CurveLinearColor*                                      PostAmbientShadowColourCurve;                      // 0x1e8(0x8)
	class CurveLinearColor*                                      FogColourAwayFarCurve;                             // 0x1f0(0x8)
	class CurveLinearColor*                                      FogColourUnderwaterCurve;                          // 0x1f8(0x8)
	class CurveLinearColor*                                      FogColourAwayUnderwaterCurve;                      // 0x200(0x8)
	class CurveLinearColor*                                      WaterColourCurve;                                  // 0x208(0x8)
	class CurveLinearColor*                                      WaterColourShallowCurve;                           // 0x210(0x8)
	class CurveLinearColor*                                      WaterBackLitColourCurve;                           // 0x218(0x8)
	class CurveLinearColor*                                      WaterFoamColourCurve;                              // 0x220(0x8)
	class CurveLinearColor*                                      WaterFoamHighlightColourCurve;                     // 0x228(0x8)
	class CurveLinearColor*                                      WaterAmbientColourCurve;                           // 0x230(0x8)
	class CurveLinearColor*                                      PostReflectionProbeTintCurve;                      // 0x238(0x8)
	class CurveLinearColor*                                      CloudRimlightColourCurve;                          // 0x240(0x8)
	class CurveLinearColor*                                      CloudSkylightColourCurve;                          // 0x248(0x8)
	class CurveLinearColor*                                      CloudSunlightColourCurve;                          // 0x250(0x8)
	class CurveLinearColor*                                      PostUnderWaterTintCurve;                           // 0x258(0x8)
	class CurveLinearColor*                                      SkyDomeMoonColourCurve;                            // 0x260(0x8)
	class CurveLinearColor*                                      PostGammaCurve;                                    // 0x268(0x8)
	class CurveLinearColor*                                      SkyDomeSunColourCurve;                             // 0x270(0x8)
	class CurveLinearColor*                                      VFXFoamColourCurve;                                // 0x278(0x8)
	class CurveLinearColor*                                      VFXWindColourCurve;                                // 0x280(0x8)
	class CurveLinearColor*                                      VFXUnderwaterTintCurve;                            // 0x288(0x8)
	class CurveLinearColor*                                      StormRainColourCurve;                              // 0x290(0x8)
	class CurveLinearColor*                                      StormSkyLightColourCurve;                          // 0x298(0x8)
	class CurveLinearColor*                                      StormPostGammaCurve;                               // 0x2a0(0x8)
	class CurveLinearColor*                                      StormFogColourUnderwaterCurve;                     // 0x2a8(0x8)
	class CurveLinearColor*                                      StormFogColourAwayUnderwaterCurve;                 // 0x2b0(0x8)
	class CurveLinearColor*                                      StormWaterColourCurve;                             // 0x2b8(0x8)
	class CurveLinearColor*                                      StormWaterColourShallowCurve;                      // 0x2c0(0x8)
	class CurveLinearColor*                                      StormWaterBackLitColourCurve;                      // 0x2c8(0x8)
	class CurveLinearColor*                                      StormWaterFoamColourCurve;                         // 0x2d0(0x8)
	class CurveLinearColor*                                      StormWaterFoamHighlightColourCurve;                // 0x2d8(0x8)
	class CurveLinearColor*                                      StormWaterAmbientColourCurve;                      // 0x2e0(0x8)
	class CurveLinearColor*                                      StormPostReflectionProbeTintCurve;                 // 0x2e8(0x8)
	class CurveLinearColor*                                      SkullEyeColourCurve;                               // 0x2f0(0x8)
	struct LinearColor                                           SandColourStatic;                                  // 0x2f8(0x10)
	float                                                        FogUnderwaterMaxOpacityStatic;                     // 0x308(0x4)
	float                                                        FogUnderwaterScatterExpStatic;                     // 0x30c(0x4)
	float                                                        FogUnderwaterStartDistanceStatic;                  // 0x310(0x4)
	float                                                        FogUnderwaterBrightnessNearStatic;                 // 0x314(0x4)
	float                                                        FogUnderwaterBrightnessFarStatic;                  // 0x318(0x4)
	float                                                        FogDirectionalInscatteringStartStatic;             // 0x31c(0x4)
	float                                                        FogUnderwaterDirectionalInscatteringStartStatic;   // 0x320(0x4)
	float                                                        UnderwaterDirectionalLightMinBrightnessStatic;     // 0x324(0x4)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class TornMapSettings: public DeveloperSettings
{
public:
	class UClass*                                                TornMapItemDescClass;                              // 0x38(0x8)
	struct StringAssetReference                                  DefaultParams;                                     // 0x40(0x10)
	char                                                         DefaultMapBlendMode;                               // 0x50(0x1)
	float                                                        DefaultMarkScale;                                  // 0x54(0x4)
	char                                                         DefaultMarkBlendMode;                              // 0x58(0x1)
};


// Size 0x8 (Full Size[0x178] - InheritedSize[0x170]
class EnvQueryTest_InGameEventExclusionZone: public EnvQueryTest
{
public:
	float                                                        Radius;                                            // 0x170(0x4)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class GuildLogbookIconsAsset: public DataAsset
{
public:
	class Texture*                                               DefaultImage;                                      // 0x28(0x8)
	TArray<struct GuildIconTextureKeyValue>                      Icons;                                             // 0x30(0x10)
};


// Size 0x90 (Full Size[0x158] - InheritedSize[0xc8]
class CutsceneTargetRetrievalComponent: public ActorComponent
{
public:
	class Actor*                                                 CutsceneTarget;                                    // 0xd0(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AggressiveGhostShipNamesDataAsset: public DataAsset
{
public:
	TArray<struct AggressiveGhostShipNameBucket>                 NameBuckets;                                       // 0x28(0x10)
};


// Size 0x20 (Full Size[0x3e8] - InheritedSize[0x3c8]
class DestroyableMechanismTrigger: public Actor
{
public:
	class HealthComponent*                                       HealthComponent;                                   // 0x3c8(0x8)
	class OptInDamageableComponent*                              DamageableComponent;                               // 0x3d0(0x8)
	class MechanismTriggerComponent*                             MechanismTriggerComponent;                         // 0x3d8(0x8)
	float                                                        TriggerMechanismAtOrBelowHealthValue;              // 0x3e0(0x4)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class TaleQuestWeightedItemDescSpawnDataAsset: public DataAsset
{
public:
	TArray<struct TaleQuestWeightedItemDescSpawnData>            WeightedItemSpawnDatas;                            // 0x28(0x10)
	class ItemSpawnData*                                         QuestObjectSpawnData;                              // 0x38(0x8)
};


// Size 0xe0 (Full Size[0x4a8] - InheritedSize[0x3c8]
class InvasionDepartureTunnelScrollingScenery: public Actor
{
public:
	double                                                       ReplicatedServerStartTime;                         // 0x3c8(0x8)
	TArray<struct Vector>                                        ServerMovingObjectsCachedLocations;                // 0x3d0(0x10)
	TArray<class Class*>                                         CurrentlyLoadedTileAssets;                         // 0x3e0(0x10)
	class BoxComponent*                                          MovementRoot;                                      // 0x3f0(0x8)
	struct Vector                                                ScrollVelocity;                                    // 0x3f8(0xc)
	struct InvasionTunnelCreatureDioramaSpawnManager             CreatureDioramaManager;                            // 0x408(0x18)
	bool                                                         HaltRequested;                                     // 0x420(0x1)
	int                                                          ReplicatedRandomSeed;                              // 0x424(0x4)
	class SceneComponent*                                        SharedRoot;                                        // 0x428(0x8)
	TArray<class SceneComponent*>                                MovingObjects;                                     // 0x430(0x10)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class GetIsShipInSafeWatersStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableBool                                     Result;                                            // 0x80(0x30)
};


// Size 0x88 (Full Size[0x5b8] - InheritedSize[0x530]
class ServerIslandPerfTestGameState: public ServiceProviderGameState
{
public:
	struct GameServiceCoordinator                                ServiceCoordinator;                                // 0x588(0x20)
	class PerfTestIslandService*                                 IslandService;                                     // 0x5a8(0x8)
	class FFTWaterService*                                       WaterService;                                      // 0x5b0(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AthenaAnimationEmoteGroupingAsset: public DataAsset
{
public:
	TArray<struct AthenaAnimationEmoteAnimations>                EmoteAnimationData;                                // 0x28(0x10)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class RegisterTransientActorStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    Actor;                                             // 0x80(0x30)
	float                                                        DestructionRadius;                                 // 0xb0(0x4)
	bool                                                         IsPendingDestruction;                              // 0xb4(0x1)
};


// Size 0xa8 (Full Size[0x170] - InheritedSize[0xc8]
class FragileComponent: public ActorComponent
{
public:
	class FragileComponentDataAsset*                             FragileComponentDataAsset;                         // 0xc8(0x8)
};


// Size 0xb0 (Full Size[0x130] - InheritedSize[0x80]
class TaleQuestGetNPCOnIslandStepDesc: public TaleQuestStepDesc
{
public:
	class UClass*                                                Company;                                           // 0x80(0x8)
	struct FString                                               NameSearchString;                                  // 0x88(0x10)
	class UClass*                                                NPCClass;                                          // 0x98(0x8)
	struct QuestVariableName                                     IslandName;                                        // 0xa0(0x30)
	struct QuestVariableVector                                   Location;                                          // 0xd0(0x30)
	struct QuestVariableActor                                    NPC;                                               // 0x100(0x30)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class VfxStoryResponseDataAsset: public DataAsset
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x28(0xc)
	TArray<struct VfxStoryResponseSetting>                       StoryResponses;                                    // 0x38(0x10)
	TArray<class VfxStoryResponseDataAsset*>                     AssetsList;                                        // 0x48(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PirateLegendSection: public DataAsset
{
public:
	char                                                         SectionType;                                       // 0x28(0x1)
	class TaleQuestDescAsset*                                    QuestDescription;                                  // 0x30(0x8)
};


// Size 0xa8 (Full Size[0x170] - InheritedSize[0xc8]
class DockerComponent: public ActorComponent
{
public:
	class UClass*                                                DockingPolicyDefinition;                           // 0xd0(0x8)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class DartCharacterBoneOffsets: public DataAsset
{
public:
	TArray<String>                                               ChestBoneNames;                                    // 0x28(0x10)
	float                                                        FemaleDefaultBodyLimbsOffset;                      // 0x38(0x4)
	float                                                        FemaleDefaultBodyChestOffset;                      // 0x3c(0x4)
	float                                                        MaleDefaultBodyLimbsOffset;                        // 0x40(0x4)
	float                                                        MaleDefaultBodyChestOffset;                        // 0x44(0x4)
	float                                                        FemaleAthleticBodyLimbsOffset;                     // 0x48(0x4)
	float                                                        FemaleAthleticBodyChestOffset;                     // 0x4c(0x4)
	float                                                        MaleAthleticBodyLimbsOffset;                       // 0x50(0x4)
	float                                                        MaleAthleticBodyChestOffset;                       // 0x54(0x4)
	float                                                        FemaleThinBodyLimbsOffset;                         // 0x58(0x4)
	float                                                        FemaleThinBodyChestOffset;                         // 0x5c(0x4)
	float                                                        MaleThinBodyLimbsOffset;                           // 0x60(0x4)
	float                                                        MaleThinBodyChestOffset;                           // 0x64(0x4)
	float                                                        FemaleLargeBodyLimbsOffset;                        // 0x68(0x4)
	float                                                        FemaleLargeBodyChestOffset;                        // 0x6c(0x4)
	float                                                        MaleLargeBodyLimbsOffset;                          // 0x70(0x4)
	float                                                        MaleLargeBodyChestOffset;                          // 0x74(0x4)
	float                                                        FemaleUnfitBodyLimbsOffset;                        // 0x78(0x4)
	float                                                        FemaleUnfitBodyChestOffset;                        // 0x7c(0x4)
	float                                                        MaleUnfitBodyLimbsOffset;                          // 0x80(0x4)
	float                                                        MaleUnfitBodyChestOffset;                          // 0x84(0x4)
	float                                                        FaunaOffset;                                       // 0x88(0x4)
};


// Size 0x8 (Full Size[0x50] - InheritedSize[0x48]
class CaptainsLogDynamicSinglePageLayout: public WieldableBookSinglePageLayout
{
public:
	char                                                         PageType;                                          // 0x48(0x1)
	int                                                          PageSetIndex;                                      // 0x4c(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SelectionOfSirenStatues: public Object
{
public:
	TArray<Class>                                                Statues;                                           // 0x28(0x10)
};


// Size 0x30 (Full Size[0x430] - InheritedSize[0x400]
class CutsceneTriggerVolume: public Volume
{
public:
	struct FName                                                 CutsceneName;                                      // 0x400(0x8)
	bool                                                         SingleUse;                                         // 0x408(0x1)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PersistenceIdentifierSettingsAsset: public DataAsset
{
public:
	TArray<class PersistenceIdentifierMap*>                      PersistenceMapData;                                // 0x28(0x10)
};


// Size 0x28 (Full Size[0x3f0] - InheritedSize[0x3c8]
class PlayerStreamedLevelExit: public Actor
{
public:
	class BoxComponent*                                          TriggerZoneComponent;                              // 0x3c8(0x8)
	char                                                         TeleportItemMode;                                  // 0x3d0(0x1)
};


// Size 0x208 (Full Size[0x5d0] - InheritedSize[0x3c8]
class ProjectileService: public Actor
{
public:
	TArray<struct WeaponProjectile>                              DeadProjectiles;                                   // 0x3f0(0x10)
	TArray<struct ProjectileAttackGroup>                         ProjectileAttackGroups;                            // 0x460(0x10)
	class AthenaProjectilesThrottledTickCollectionAsset*         ProjectileThrottledTickData;                       // 0x560(0x8)
};


// Size 0x198 (Full Size[0x1c0] - InheritedSize[0x28]
class FishingRodSetupDataAsset: public DataAsset
{
public:
	class UClass*                                                FishActorInteractionDesc;                          // 0x28(0x8)
	float                                                        DelayBeforeAllowingACast;                          // 0x30(0x4)
	float                                                        DelayBeforeCreatingFishingFloat;                   // 0x34(0x4)
	float                                                        DelayBeforeDestroyingFishingFloat;                 // 0x38(0x4)
	class UClass*                                                FishingFloatType;                                  // 0x40(0x8)
	char                                                         HitTestTraceChannel;                               // 0x48(0x1)
	float                                                        PreCastingPlayerSpeedModifier;                     // 0x4c(0x4)
	float                                                        CastingTimeBeforeTurningOnHits;                    // 0x50(0x4)
	float                                                        TimeBetweenIsFloatLocationValidChecks;             // 0x54(0x4)
	float                                                        SingleFishAnimationLoopDuration;                   // 0x58(0x4)
	float                                                        DriftOffsetToStopFishJumping;                      // 0x5c(0x4)
	TArray<struct DebugFishSelectionBreed>                       FishBreeds;                                        // 0x60(0x10)
	TArray<struct DebugFishSelectionBreed>                       FishBreedsInAPond;                                 // 0x70(0x10)
	TArray<struct FishingRodForceFeedbackLevel>                  ForceFeedbackLevels;                               // 0x80(0x10)
	TArray<struct FishingComedyItemInfo>                         ComedyItems;                                       // 0x90(0x10)
	float                                                        ChanceOfComedyItems;                               // 0xa0(0x4)
	float                                                        DistanceFromPlayerToCatchComedyItem;               // 0xa4(0x4)
	TArray<class Class*>                                         DisallowedTunnelsOfTheDamnedFish;                  // 0xa8(0x10)
	TArray<class Class*>                                         DisallowedTunnelsOfTheDamnedComedyItems;           // 0xb8(0x10)
	TArray<struct FishBaitInfo>                                  FishBait;                                          // 0xc8(0x10)
	float                                                        RopeThickness;                                     // 0xd8(0x4)
	float                                                        RopeSlackAtMaxDistance;                            // 0xdc(0x4)
	float                                                        RopeSlackAtMinDistance;                            // 0xe0(0x4)
	float                                                        RopeOnRodSlack;                                    // 0xe4(0x4)
	float                                                        RopeOnRodMaxSway;                                  // 0xe8(0x4)
	float                                                        TimeToBlendAwaySway;                               // 0xec(0x4)
	float                                                        MaxTimeToWaitForAnimationStateToFinish;            // 0xf0(0x4)
	struct Vector                                                ServerEstimateRodEndPosition;                      // 0xf4(0xc)
	struct Vector                                                ServerEstimateRodBasePosition;                     // 0x100(0xc)
	struct Vector                                                RodBaseHitDetectionExtraOffset;                    // 0x10c(0xc)
	float                                                        MinimumShakeValue;                                 // 0x118(0x4)
	float                                                        ReelingCooldownMultiplier;                         // 0x11c(0x4)
	class WwiseEvent*                                            RodCastAudioDrawBack;                              // 0x120(0x8)
	class WwiseEvent*                                            RodCastAudioCast;                                  // 0x128(0x8)
	class WwiseEvent*                                            RodBendStart;                                      // 0x130(0x8)
	class WwiseEvent*                                            RodBendStop;                                       // 0x138(0x8)
	float                                                        RodBendFactorAmountToTriggerSound;                 // 0x140(0x4)
	float                                                        AmountOfWrongDirectionStrainToTriggerSound;        // 0x144(0x4)
	float                                                        RodBendCooldown;                                   // 0x148(0x4)
	struct FName                                                 RodBendFactorRtpc;                                 // 0x14c(0x8)
	class WwiseEvent*                                            RodCastReelLoopStart;                              // 0x158(0x8)
	class WwiseEvent*                                            RodCastReelLoopStop;                               // 0x160(0x8)
	struct FName                                                 RodCastReelSpeedRtpc;                              // 0x168(0x8)
	float                                                        RtpcSpeedFactorCasting;                            // 0x170(0x4)
	float                                                        RtpcSpeedFactorFishing;                            // 0x174(0x4)
	float                                                        RtpcSpeedFactorReeling;                            // 0x178(0x4)
	class WwiseEvent*                                            FishingBendWrongDirectionStart;                    // 0x180(0x8)
	class WwiseEvent*                                            FishingBendWrongDirectionStop;                     // 0x188(0x8)
	class WwiseEvent*                                            FishingLineSnap;                                   // 0x190(0x8)
	class WwiseEvent*                                            RodCastFishOutOfWaterWriggling;                    // 0x198(0x8)
	class WwiseObjectPoolWrapper*                                FishingRodPool;                                    // 0x1a0(0x8)
	struct FName                                                 RodStrainMagnitudeRtpc;                            // 0x1a8(0x8)
	class WwiseEvent*                                            FishTakenFromRod;                                  // 0x1b0(0x8)
	class WwiseEvent*                                            BaitAddedToHook;                                   // 0x1b8(0x8)
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class TaleQuestParallelForeachStep: public TaleQuestStep
{
public:
	class TaleQuestParallelForeachStepDesc*                      Desc;                                              // 0x98(0x8)
	int                                                          Count;                                             // 0xa0(0x4)
	TArray<class Interface*>                                     Steps;                                             // 0xa8(0x10)
	TArray<class IteratorFrame*>                                 Frames;                                            // 0xb8(0x10)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class SetTaleProgressStep: public TaleQuestStep
{
public:
	class SetTaleProgressStepDesc*                               StepDesc;                                          // 0x98(0x8)
};


// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class TaleQuestStructGenServiceDesc: public TaleQuestServiceDesc
{
public:
	struct TQStructGenParams                                     Params;                                            // 0x28(0x78)
};


// Size 0x290 (Full Size[0x570] - InheritedSize[0x2e0]
class TrinketMountpointManagerComponent: public SceneComponent
{
public:
	class MountpointParamsDataAsset*                             MountpointParamsDataAsset;                         // 0x2f8(0x8)
	TArray<struct ReplicatedMountpointData>                      ReplicatedMountpointData;                          // 0x300(0x10)
	TArray<bool>                                                 IsNudged;                                          // 0x310(0x10)
	multicastinlinedelegate                                      OnBeginInteractionDelegate;                        // 0x320(0x10)
	multicastinlinedelegate                                      OnEndInteractionDelegate;                          // 0x330(0x10)
	int                                                          MountedItemCount;                                  // 0x340(0x4)
	class WwiseObjectPoolWrapper*                                TrinketSfxPool;                                    // 0x348(0x8)
	bool                                                         TrinketsEnabled;                                   // 0x350(0x1)
	bool                                                         TrinketsShouldBeDisplayed;                         // 0x351(0x1)
	struct FName                                                 Feature;                                           // 0x354(0x8)
	struct MountTrinketActionRuleParams                          MountTrinketActionRuleParams;                      // 0x360(0x88)
	struct StraightenNudgedTrinketActionRuleParams               StraightenNudgedTrinketActionRuleParams;           // 0x3e8(0x40)
	TArray<class Class*>                                         TrinketCategoriesToDisplayInUI;                    // 0x428(0x10)
	TArray<class Class*>                                         ComponentsAllowedForTrinketVisuals;                // 0x438(0x10)
	TArray<class NudgePolicy*>                                   NudgePolicies;                                     // 0x448(0x10)
	class TrinketLoadoutFinderPolicyBase*                        TrinketLoadoutFinderPolicy;                        // 0x458(0x8)
	TArray<bool>                                                 CachedCanTrinketEverBeNudged;                      // 0x460(0x10)
	TArray<struct MountpointClientState>                         MountpointClientStates;                            // 0x470(0x10)
	TArray<struct TrinketNudgeProgress>                          NudgingTrinketProgress;                            // 0x480(0x10)
	TArray<class StaticMeshComponent*>                           TrinketReplacementMeshes;                          // 0x550(0x10)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class WaitOnCollectableQuestObjectStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    CollectableActor;                                  // 0x80(0x30)
	struct QuestVariablePlayerActor                              CollectingPlayerActor;                             // 0xb0(0x30)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestStopAISpawningStepDesc: public TaleQuestStepDesc
{
public:
	int                                                          SpawnerIndex;                                      // 0x80(0x4)
	bool                                                         StopAllActiveSpawners;                             // 0x84(0x1)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PlayerBuriedItemServiceHaulSizeDataAsset: public DataAsset
{
public:
	TArray<struct PlayerBuriedItemServiceHaulSizeEntry>          HaulSizes;                                         // 0x28(0x10)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class PacingComponentPublicData: public DataAsset
{
public:
	class CurveFloat*                                            PacingCameraCurve;                                 // 0x28(0x8)
	float                                                        PacingMovementSpeedModifier;                       // 0x30(0x4)
	float                                                        CameraCurveTToPlayRumble;                          // 0x34(0x4)
	float                                                        CameraCurveTToPlayFootstepSFX;                     // 0x38(0x4)
	float                                                        MinStickDeflectionToMove;                          // 0x3c(0x4)
	float                                                        CameraSpringAccel;                                 // 0x40(0x4)
	float                                                        CamPitchScalar;                                    // 0x44(0x4)
	class ForceFeedbackEffect*                                   TakingAStepRumble;                                 // 0x48(0x8)
	class WwiseEvent*                                            TakingAStepAudioStateEvent;                        // 0x50(0x8)
	char                                                         HitTestTraceChannel;                               // 0x58(0x1)
};


// Size 0x88 (Full Size[0x150] - InheritedSize[0xc8]
class CollectorsChestPickUpFromSlotRewardComponent: public ActorComponent
{
public:
	class UClass*                                                Company;                                           // 0xc8(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class CannonEnchantmentDescAsset: public ShipPartDescAsset
{
public:
	struct CannonEnchantmentDesc                                 CannonEnchantmentDesc;                             // 0x28(0x18)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class BattleElevatorEventRoomHeightReachedPolicy: public BattleElevatorEventRoomBasePolicy
{
public:
	float                                                        TargetHeightPercentage;                            // 0x28(0x4)
};


// Size 0x198 (Full Size[0x2e0] - InheritedSize[0x148]
class ShadowAIFormComponent: public AthenaAIFormComponent
{
public:
	char                                                         FlameSpecificPhobia;                               // 0x148(0x1)
	class ParticleSystem*                                        LightStateConstantParticlesTemplate;               // 0x150(0x8)
	class ParticleSystem*                                        DarkStateConstantParticlesTemplate;                // 0x158(0x8)
	class ParticleSystem*                                        ToLightTransitionParticlesTemplate;                // 0x160(0x8)
	class ParticleSystem*                                        ToDarkTransitionParticlesTemplate;                 // 0x168(0x8)
	class PhysicalMaterial*                                      ClientLightStatePhysMaterialOverride;              // 0x170(0x8)
	class PhysicalMaterial*                                      ClientDarkStatePhysMaterialOverride;               // 0x178(0x8)
	class WwiseEvent*                                            StartDarkStateAudioLoopEvent;                      // 0x180(0x8)
	class WwiseEvent*                                            StopDarkStateAudioLoopEvent;                       // 0x188(0x8)
	TArray<Class>                                                ShadowBaseMaterials;                               // 0x190(0x10)
	struct FName                                                 ShadowShaderParamName;                             // 0x1a0(0x8)
	float                                                        LightStateShaderParamValue;                        // 0x1a8(0x4)
	float                                                        DarkStateShaderParamValue;                         // 0x1ac(0x4)
	float                                                        ShaderParamBlendSpeed;                             // 0x1b0(0x4)
	struct FName                                                 SeedShaderParamName;                               // 0x1b4(0x8)
	int                                                          MaxSeedShaderValue;                                // 0x1bc(0x4)
	char                                                         CurrentState;                                      // 0x1c0(0x1)
	class ParticleSystemComponent*                               LightStateConstantParticleSystemComponent;         // 0x1c8(0x8)
	class ParticleSystemComponent*                               DarkStateConstantParticleSystemComponent;          // 0x1d0(0x8)
	TArray<class MaterialInstanceDynamic*>                       ShadowDynamicMaterialInstances;                    // 0x1d8(0x10)
	TArray<struct FlameSpecificDataEntry>                        FlameSpecificDataMap;                              // 0x260(0x10)
};


// Size 0xb8 (Full Size[0x180] - InheritedSize[0xc8]
class LimpingComponent: public ActorComponent
{
public:
	class CurveFloat*                                            LimpStickDeflectionCurve;                          // 0xc8(0x8)
	class CurveFloat*                                            LimpCameraCurve;                                   // 0xd0(0x8)
	int                                                          NumAntiCheatSamplesOnServer;                       // 0xd8(0x4)
	float                                                        MaxAveragePlayerSpeedServerTolerance;              // 0xdc(0x4)
	float                                                        MinLimpStrengthToCrossToPlayRumbleAndSfx;          // 0xe0(0x4)
	float                                                        PredictionValidityTime;                            // 0xe4(0x4)
	float                                                        MinStickDeflectionToLimp;                          // 0xe8(0x4)
	class ForceFeedbackEffect*                                   LimpCrunchRumble;                                  // 0xf0(0x8)
	float                                                        CameraSpringAccel;                                 // 0xf8(0x4)
	float                                                        CamPitchScalar;                                    // 0xfc(0x4)
	float                                                        CamRollScalar;                                     // 0x100(0x4)
	class WwiseEvent*                                            LocalBrokenLegAudioStateEvent;                     // 0x108(0x8)
	float                                                        DelayUntilStartCheatDetection;                     // 0x110(0x4)
	float                                                        CheatTimeThresholdToApplyServerPenalty;            // 0x114(0x4)
	float                                                        MoveSpeedScalarIfCheating;                         // 0x118(0x4)
	float                                                        CheatTimerDecaySpeed;                              // 0x11c(0x4)
	float                                                        CheatPenaltyTime;                                  // 0x120(0x4)
	int                                                          CheatPunishmentIncreasePerViolation;               // 0x124(0x4)
	class AthenaPlayerCharacter*                                 Player;                                            // 0x148(0x8)
	bool                                                         bIsLimping;                                        // 0x17e(0x1)
};


// Size 0xf0 (Full Size[0x118] - InheritedSize[0x28]
class FishingSetupDataAsset: public DataAsset
{
public:
	float                                                        CastDistanceMin;                                   // 0x28(0x4)
	float                                                        CastDistanceMax;                                   // 0x2c(0x4)
	float                                                        PreCastTimeForMaxCastDistance;                     // 0x30(0x4)
	float                                                        DistanceRequiredToReelInToCatchTheFish;            // 0x34(0x4)
	float                                                        MinFloatDistanceFromPlayer;                        // 0x38(0x4)
	float                                                        MaxFishSpawnDepth;                                 // 0x3c(0x4)
	float                                                        CastingThrowDurationAtMinDistance;                 // 0x40(0x4)
	float                                                        CastingThrowDurationAtMaxDistance;                 // 0x44(0x4)
	float                                                        FishSpawnHitDetectionHalfExtentXY;                 // 0x48(0x4)
	float                                                        FishSpawnHitDetectionHalfExtentZ;                  // 0x4c(0x4)
	struct WeightedProbabilityRangeOfRanges                      TimeBeforeAppearing;                               // 0x50(0x30)
	float                                                        DelayBeforeTrackingFloat;                          // 0x80(0x4)
	float                                                        MaxDistanceFromFloatBeforeFishGivesUp;             // 0x84(0x4)
	struct WeightedProbabilityRangeOfRanges                      TimeSpentBiting;                                   // 0x88(0x30)
	float                                                        FloatReelingMoveSpeedWhenNoFishOnLine;             // 0xb8(0x4)
	float                                                        ReelingAnimationMaxSpeedWhenNoFishOnLine;          // 0xbc(0x4)
	float                                                        ReelingAnimationSpeedChangePerSec;                 // 0xc0(0x4)
	float                                                        ReelingAnimationStoppingSpeedChangePerSec;         // 0xc4(0x4)
	float                                                        MaxReelingWhenFailedTime;                          // 0xc8(0x4)
	float                                                        FishingMiniGameLeftRightInputAngle;                // 0xcc(0x4)
	float                                                        FishingMiniGameBattlingAngle;                      // 0xd0(0x4)
	float                                                        FishingMiniGameInputThreshold;                     // 0xd4(0x4)
	float                                                        TimeBeforeTurningOnFishHits;                       // 0xd8(0x4)
	float                                                        FOVChangeWhenBattling;                             // 0xdc(0x4)
	float                                                        FOVBlendSpeedWhenBattling;                         // 0xe0(0x4)
	float                                                        TimeBeforeDestroyingFishAndAwardingPlayer;         // 0xe4(0x4)
	float                                                        CameraYawFishMaxOffset;                            // 0xe8(0x4)
	float                                                        CameraMaxYaw;                                      // 0xec(0x4)
	float                                                        CameraYawSpringAcc;                                // 0xf0(0x4)
	float                                                        CameraYawSpringAccWhenResetting;                   // 0xf4(0x4)
	float                                                        CameraExtraPitchWhenPullingBack;                   // 0xf8(0x4)
	float                                                        CameraExtraPitchSpringAcc;                         // 0xfc(0x4)
	float                                                        CameraExtraPitchSpringAccWhenResetting;            // 0x100(0x4)
	float                                                        BlendBackFromDisabledCameraDuration;               // 0x104(0x4)
	float                                                        RodDirectionBendMaxAngleOfFishFromFromRod;         // 0x108(0x4)
	float                                                        RodDirectionMaxBendLeft;                           // 0x10c(0x4)
	float                                                        RodDirectionMaxBendRight;                          // 0x110(0x4)
	float                                                        ReturnFromFreeLookSpringAcc;                       // 0x114(0x4)
};


// Size 0x8 (Full Size[0x178] - InheritedSize[0x170]
class EnvQueryTest_InWorldEventZone: public EnvQueryTest
{
public:
	float                                                        Radius;                                            // 0x170(0x4)
};


// Size 0x8 (Full Size[0x8d0] - InheritedSize[0x8c8]
class StaticMeshFloatingItemProxyWithPickupSFX: public StaticMeshFloatingItemProxy
{
public:
	class WwiseEvent*                                            OnPickedUpSfx;                                     // 0x8c8(0x8)
};


// Size 0x70 (Full Size[0x1b8] - InheritedSize[0x148]
class RetrieveBootyHandInComponent: public InteractableComponent
{
public:
	class UClass*                                                NotificationStartInputID;                          // 0x148(0x8)
	class UClass*                                                NotificationReleaseInputID;                        // 0x150(0x8)
	char                                                         DisplayPriority;                                   // 0x158(0x1)
	struct Vector                                                RetrieveTargetPoint;                               // 0x15c(0xc)
	class BootyStorageSettings*                                  BootyStorageSettings;                              // 0x178(0x8)
	class WwiseEvent*                                            OnRetrievedSFX;                                    // 0x198(0x8)
	class ActionRulesComponent*                                  OwnerActionRulesComponent;                         // 0x1a0(0x8)
	class EnvQuery*                                              SpawnBootyEQSQuery;                                // 0x1a8(0x8)
	bool                                                         ShouldTellStoredBootyCounterOnTooltip;             // 0x1b0(0x1)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class DiggingAnimationDataAsset: public DataAsset
{
public:
	TArray<struct ItemDiggingAnimationOverride>                  AnimationOverrides;                                // 0x28(0x10)
	class ItemDiggingAnimationConfig*                            Default;                                           // 0x38(0x8)
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class StreamingLocationComponent: public ActorComponent
{
public:
	struct StreamingLocation                                     StreamingLocationOverride;                         // 0xd0(0x10)
	bool                                                         StreamingLocationActive;                           // 0xe0(0x1)
};


// Size 0x8 (Full Size[0xd8] - InheritedSize[0xd0]
class GiveItemUponConsumptionComponent: public ConsumableWieldableComponent
{
public:
	class UClass*                                                ItemToGive;                                        // 0xd0(0x8)
};


// Size 0x1b8 (Full Size[0x300] - InheritedSize[0x148]
class ActionSequenceInteractableComponent: public InteractableComponent
{
public:
	struct WwiseEmitter                                          Emitter;                                           // 0x150(0x20)
	class WwiseObjectPoolWrapper*                                EmitterPool;                                       // 0x170(0x8)
	struct ActionSequenceInteractableAudioParams                 InteractionAudioParams;                            // 0x178(0x30)
	struct ActionSequenceInteractableParams                      InteractionParams;                                 // 0x1a8(0x28)
	multicastinlinedelegate                                      OnInteractionStarted;                              // 0x1d0(0x10)
	multicastinlinedelegate                                      OnHoldInteractionCancelled;                        // 0x1e0(0x10)
	multicastinlinedelegate                                      OnInteractionCompletedClient;                      // 0x1f0(0x10)
	multicastinlinedelegate                                      OnInteractionCompletedServer;                      // 0x200(0x10)
	multicastinlinedelegate                                      OnHoldInteractionCompletedWithFailedCondition;     // 0x210(0x10)
	bool                                                         ShouldBeInteractable;                              // 0x220(0x1)
	struct ActionSequenceInteractableInteractionStateData        InteractionStateData;                              // 0x228(0x10)
};


// Size 0x18 (Full Size[0x50] - InheritedSize[0x38]
class TinVoyageSettings: public DeveloperSettings
{
public:
	int                                                          ShipVoyageOverallInventoryCapacity;                // 0x38(0x4)
	int                                                          ShipVoyageCompanyIndicatorCount;                   // 0x3c(0x4)
	TArray<struct TinVoyageDebugEntry>                           DebugVoyageEntries;                                // 0x40(0x10)
};


// Size 0x608 (Full Size[0x9d0] - InheritedSize[0x3c8]
class WarMapProposalContainer: public Actor
{
public:
	class SceneComponent*                                        RootSceneComponent;                                // 0x3e8(0x8)
	TArray<class WarMapInteractionVoteComponent*>                VoteComponents;                                    // 0x3f0(0x10)
	class WarMapInteractionComponent*                            InteractionComponent;                              // 0x400(0x8)
	class StaticMeshComponent*                                   WarMapMesh;                                        // 0x408(0x8)
	class StaticMeshComponent*                                   WarMapMeshHardMode;                                // 0x410(0x8)
	class MaterialAnimatorComponent*                             MaterialAnimatorComponent;                         // 0x418(0x8)
	struct FName                                                 OpenScrollMaterialAnimationName;                   // 0x420(0x8)
	struct FName                                                 CloseScrollMaterialAnimationName;                  // 0x428(0x8)
	struct FText                                                 CloseMapInteractionText;                           // 0x430(0x38)
	class UClass*                                                CloseMapInteractionInput;                          // 0x468(0x8)
	class UClass*                                                CloseMapHoldInteractionInput;                      // 0x470(0x8)
	float                                                        CloseMapHoldDuration;                              // 0x478(0x4)
	class WwiseEvent*                                            OpenMapSfx;                                        // 0x480(0x8)
	class WwiseEvent*                                            CloseMapSfx;                                       // 0x488(0x8)
	class WwiseObjectPoolWrapper*                                SfxPool;                                           // 0x490(0x8)
	bool                                                         IsWarMapOpen;                                      // 0x498(0x1)
	bool                                                         ShowHardModeVoting;                                // 0x499(0x1)
	bool                                                         ShipCrewHasJoinedFaction;                          // 0x49a(0x1)
	class Ship*                                                  ParentShip;                                        // 0x4a0(0x8)
	struct Guid                                                  ParentShipCrewId;                                  // 0x4a8(0x10)
	struct FText                                                 CrewFactionDisplayName;                            // 0x4b8(0x38)
};


// Size 0x40 (Full Size[0x118] - InheritedSize[0xd8]
class InvasionArrivalTunnelDependencies: public ArrivalTunnelDependencies
{
public:
	interface                                                    InvasionService;                                   // 0xd8(0x10)
	interface                                                    MigrationService;                                  // 0xe8(0x10)
	interface                                                    TimeService;                                       // 0xf8(0x10)
	interface                                                    CrewSkillRatingService;                            // 0x108(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class DiggingBaseParamsDataAsset: public DataAsset
{
public:
	TArray<struct ItemDiggingBaseOverride>                       BaseOverrides;                                     // 0x28(0x10)
	class ItemDiggingBaseConfig*                                 Default;                                           // 0x38(0x8)
};


// Size 0x108 (Full Size[0x188] - InheritedSize[0x80]
class SpawnRewardStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableItemSpawnDataType                        ItemSpawnData;                                     // 0x80(0x30)
	struct QuestVariableVector                                   SpawnLocationVector;                               // 0xb0(0x30)
	struct QuestVariableTransform                                SpawnLocationTransform;                            // 0xe0(0x38)
	struct QuestVariableActor                                    SpawnedActor;                                      // 0x118(0x30)
	bool                                                         Tracked;                                           // 0x148(0x1)
	bool                                                         TrackedProxy;                                      // 0x149(0x1)
	bool                                                         Critical;                                          // 0x14a(0x1)
	bool                                                         DropOnSpawn;                                       // 0x14b(0x1)
	struct FText                                                 FailureMessage;                                    // 0x150(0x38)
};


// Size 0x118 (Full Size[0x4e0] - InheritedSize[0x3c8]
class ShipPreviewActor: public Actor
{
public:
	class SceneComponent*                                        Root;                                              // 0x3d0(0x8)
	class ShipCustomizationLoadoutComponent*                     ShipCustomizationLoadoutComponent;                 // 0x3d8(0x8)
	class ChildActorComponent*                                   LargeShip;                                         // 0x3e0(0x8)
	class ChildActorComponent*                                   MediumShip;                                        // 0x3e8(0x8)
	class ChildActorComponent*                                   SmallShip;                                         // 0x3f0(0x8)
	multicastinlinedelegate                                      ShipPreviewWorldUpdatedDelegate;                   // 0x3f8(0x10)
	class UClass*                                                BeginPlayShipVisibility;                           // 0x408(0x8)
	TArray<class Class*>                                         DefaultShipLiveryEntitlements;                     // 0x410(0x10)
	multicastinlinedelegate                                      ShipPreviewWorldSetLocationAndRotationOfObjectDelegate; // 0x420(0x10)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class PortalSignalCutSceneAnchor: public Actor
{
public:
	class SceneComponent*                                        Root;                                              // 0x3c8(0x8)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class ShipAnnouncementPartDescAsset: public ShipPartDescAsset
{
public:
	struct ShipAnnouncementPartDesc                              ShipAnnouncementPartDesc;                          // 0x28(0x38)
};


// Size 0xf0 (Full Size[0x170] - InheritedSize[0x80]
class SpawnShipwreckTaleStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableShipwreck                                SpawnedShipwreck;                                  // 0x80(0x30)
	struct QuestVariableClass                                    CustomWreckType;                                   // 0xb0(0x30)
	struct QuestVariableVector                                   CustomWreckLocation;                               // 0xe0(0x30)
	struct QuestVariableRotator                                  CustomWreckRotation;                               // 0x110(0x30)
	struct QuestVariableText                                     CustomWreckVesselName;                             // 0x140(0x30)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class GenericPartDescAsset: public ShipPartDescAsset
{
public:
	struct GenericPartDesc                                       GenericPartDesc;                                   // 0x28(0x18)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class LogicalOrStatCondition: public StatCondition
{
public:
	TArray<class StatCondition*>                                 StatConditions;                                    // 0x28(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class CaptainsVoyageRecipesDebugMenuGenerator: public DebugMenuEntryGenerator
{
public:
	bool                                                         Regenerate;                                        // 0x28(0x1)
	TArray<struct StringClassReference>                          Proposals;                                         // 0x30(0x10)
	TArray<String>                                               AssetNames;                                        // 0x40(0x10)
};


// Size 0x30 (Full Size[0x3f8] - InheritedSize[0x3c8]
class NetProxy: public Actor
{
public:
	multicastinlinedelegate                                      OnVisibilityChanged;                               // 0x3c8(0x10)
	class Actor*                                                 OwningActor;                                       // 0x3d8(0x8)
	class StaticMeshComponent*                                   Mesh;                                              // 0x3e0(0x8)
	float                                                        MinimumNetRelevancyDistanceFraction;               // 0x3e8(0x4)
	float                                                        DepthCutOffForNonReplication;                      // 0x3ec(0x4)
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class ImpactProxySpawnerComponent: public ActorComponent
{
public:
	class UClass*                                                ItemToSpawn;                                       // 0xc8(0x8)
	class ItemInfo*                                              SpawnedItemInfo;                                   // 0xd0(0x8)
	struct Vector                                                HeightAdjustment;                                  // 0xd8(0xc)
	struct Vector                                                SafePosHeightAdjustment;                           // 0xe4(0xc)
	float                                                        ImpactOffsetScale;                                 // 0xf0(0x4)
	float                                                        ImpactWallOffsetScale;                             // 0xf4(0x4)
	float                                                        ImpactWallOffsetAngle;                             // 0xf8(0x4)
	float                                                        RandomAngleRange;                                  // 0xfc(0x4)
	bool                                                         OverrideInstigator;                                // 0x100(0x1)
};


// Size 0x30 (Full Size[0x128] - InheritedSize[0xf8]
class TaleQuestSequenceStep: public TaleQuestFramedStep
{
public:
	class TaleQuestSequenceStepDesc*                             Desc;                                              // 0xf8(0x8)
	interface                                                    CurrentStep;                                       // 0x100(0x10)
	TArray<struct ForkedStep>                                    ForkedSteps;                                       // 0x118(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class UnlockLockConditionalStatTrigger: public Object
{
public:
	struct PlayerStat                                            Stat;                                              // 0x28(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class PirateLegendTypeFilter: public PirateLegendSectionFilter
{
public:
	char                                                         AllowedType;                                       // 0x28(0x1)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PlayerActivityLifetimeRuleCatalogueDataAsset: public DataAsset
{
public:
	TArray<struct PlayerActivityLifetimeRule>                    PlayerActivityLifetimeRules;                       // 0x28(0x10)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class FeedableComponent: public ActorComponent
{
public:
	char                                                         FeedableType;                                      // 0xd0(0x1)
	bool                                                         Feedable;                                          // 0xd1(0x1)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class RemoveCriticalActorStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    ActorVar;                                          // 0x80(0x30)
};


// Size 0x1d0 (Full Size[0x9c0] - InheritedSize[0x7f0]
class AshenWindsSkull: public StaticSimpleBootyWieldableItem
{
public:
	class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x808(0x8)
	class ParticleSystemComponent*                               FlamethrowerParticleSystemComponent;               // 0x810(0x8)
	class ParticleSystemComponent*                               FlamethrowerChargeParticleSystemComponent;         // 0x818(0x8)
	class MaterialAnimatorComponent*                             MaterialAnimatorComponent;                         // 0x820(0x8)
	class AshenWindsSkullAdaptiveTriggerComponent*               AdaptiveTriggerComponent;                          // 0x828(0x8)
	class AshenWindsFlamethrowerController*                      FlamethrowerController;                            // 0x830(0x8)
	struct ItemUseSpeedParams                                    ItemUseSpeedModifiers;                             // 0x838(0x8)
	float                                                        ItemUseFOVBlendSpeed;                              // 0x840(0x4)
	float                                                        ItemUseTargetFOV;                                  // 0x844(0x4)
	float                                                        HipfireEffectsDelayAmount;                         // 0x848(0x4)
	float                                                        AimingDownSightsEffectsDelayAmount;                // 0x84c(0x4)
	float                                                        StartFlamethrowerOnServerDelayLatencyCompensation; // 0x850(0x4)
	float                                                        FlamethrowerParticleSystemMaxLength;               // 0x854(0x4)
	char                                                         FlamethrowerParticleSystemCustomLocalSpaceMode;    // 0x858(0x1)
	struct FName                                                 OpenJawMaterialAnimationName;                      // 0x85c(0x8)
	struct FName                                                 CloseJawMaterialAnimationName;                     // 0x864(0x8)
	struct Vector                                                FlamethrowerParticleSystemThirdPersonAttachPoint;  // 0x86c(0xc)
	struct Rotator                                               FlamethrowerParticleSystemThirdPersonRotation;     // 0x878(0xc)
	struct Vector                                                FlamethrowerParticleSystemFirstPersonAttachPoint;  // 0x884(0xc)
	struct Rotator                                               FlamethrowerParticleSystemFirstPersonRotation;     // 0x890(0xc)
	bool                                                         EnableCustomParticleSystemBelowWater;              // 0x89c(0x1)
	class ParticleSystem*                                        AboveWaterParticleSystem;                          // 0x8a0(0x8)
	class ParticleSystem*                                        AboveWaterParticleSystemThirdPerson;               // 0x8a8(0x8)
	class ParticleSystem*                                        BelowWaterParticleSystem;                          // 0x8b0(0x8)
	class ParticleSystem*                                        BelowWaterParticleSystemThirdPerson;               // 0x8b8(0x8)
	bool                                                         EnableVisualFlamethrowerMissfiring;                // 0x8c0(0x1)
	TArray<struct AshenWindsSkullMissfireParams>                 FlamethrowerMissfireParams;                        // 0x8c8(0x10)
	class WwiseEvent*                                            FlamethrowerLoopStartEvent;                        // 0x8d8(0x8)
	class WwiseEvent*                                            FlamethrowerLoopStopEvent;                         // 0x8e0(0x8)
	struct FName                                                 FlamethrowerLoopChargeLevelRTPC;                   // 0x8e8(0x8)
	struct FloatRange                                            FlamethrowerLoopChargeLevelRTPCRange;              // 0x8f0(0x10)
	class WwiseEvent*                                            FlamethrowerStartUsingEvent;                       // 0x900(0x8)
	class WwiseEvent*                                            FlamethrowerStopUsingEvent;                        // 0x908(0x8)
	float                                                        UseTimeRequiredToPlayStopEvent;                    // 0x910(0x4)
	class WwiseEvent*                                            FlamethrowerActivatedEvent;                        // 0x918(0x8)
	class WwiseEvent*                                            FlamethrowerDeactivatedEvent;                      // 0x920(0x8)
	class WwiseEvent*                                            FlamethrowerChargeLevelStageChangedEvent;          // 0x928(0x8)
	class ForceFeedbackEffect*                                   UsingFlamethrowerForceFeedback;                    // 0x930(0x8)
	class Pawn*                                                  Wielder;                                           // 0x938(0x8)
	interface                                                    FlamethrowerChargeInterface;                       // 0x940(0x10)
	class FlamethrowerChargeVisuals*                             FlamethrowerChargeVisuals;                         // 0x950(0x8)
};


// Size 0xb8 (Full Size[0xe0] - InheritedSize[0x28]
class PuzzleManagerPolicy: public Object
{
public:
	class Actor*                                                 PuzzleManager;                                     // 0x38(0x8)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class BlowpipeDartDataAsset: public DataAsset
{
public:
	class StaticMesh*                                            DartMesh;                                          // 0x28(0x8)
	class UClass*                                                DartItemDesc;                                      // 0x30(0x8)
	int                                                          MaxDartCapacity;                                   // 0x38(0x4)
	bool                                                         CreateImpactProxy;                                 // 0x3c(0x1)
	struct FName                                                 FeatureName;                                       // 0x40(0x8)
};


// Size 0x9b0 (Full Size[0x9d8] - InheritedSize[0x28]
class AthenaGameSettings: public Object
{
public:
	int                                                          NumberOfDaysInEachMonth;                           // 0x28(0x4)
	struct FString                                               EntryMap;                                          // 0x30(0x10)
	struct FString                                               FrontendMap;                                       // 0x40(0x10)
	struct FString                                               InGameMap;                                         // 0x50(0x10)
	struct FString                                               TutorialMap;                                       // 0x60(0x10)
	struct StringAssetReference                                  PlayModeLevels;                                    // 0x70(0x10)
	struct StringAssetReference                                  FeatureToggledLevels;                              // 0x80(0x10)
	struct FString                                               OverrideServerURL;                                 // 0x90(0x10)
	float                                                        LoadLevelTimeoutTime;                              // 0xa0(0x4)
	float                                                        ServiceBridgeConnectTimeout;                       // 0xa4(0x4)
	TArray<Class>                                                MaidenVoyageProgressionEntitlements;               // 0xa8(0x10)
	assetclass                                                   VoiceChatRendererClass;                            // 0xb8(0x20)
	assetclass                                                   GameNarrationCoordinatorClass;                     // 0xd8(0x20)
	assetclass                                                   ApplicationSettingsClass;                          // 0xf8(0x20)
	struct StringAssetReference                                  CinematicCameraControllerClass;                    // 0x118(0x10)
	struct StringAssetReference                                  CinematicCameraSpectatorPawnClass;                 // 0x128(0x10)
	struct StringAssetReference                                  MaterialTranslationTableFileLocation;              // 0x138(0x10)
	struct StringAssetReference                                  MaterialAudioTableFileLocation;                    // 0x148(0x10)
	struct StringAssetReference                                  MaterialVFXTableFileLocation;                      // 0x158(0x10)
	struct StringAssetReference                                  DebugMenuFileLocation;                             // 0x168(0x10)
	struct StringAssetReference                                  SpawnLocationKeywordPriorityListLocation;          // 0x178(0x10)
	struct StringAssetReference                                  CrewSpawnLocationVariablesListAsset;               // 0x188(0x10)
	struct StringAssetReference                                  SkellyFortDataFileLocation;                        // 0x198(0x10)
	struct StringAssetReference                                  SkellyFortListDataFileLocation;                    // 0x1a8(0x10)
	struct StringAssetReference                                  EnemyAIOnShipServiceDataAssetFileLocation;         // 0x1b8(0x10)
	struct StringAssetReference                                  ProjectileServiceDataFileLocation;                 // 0x1c8(0x10)
	struct StringAssetReference                                  ThrottledProjectileTickDataAssetLocation;          // 0x1d8(0x10)
	struct StringAssetReference                                  HoleDataFileLocation;                              // 0x1e8(0x10)
	struct StringAssetReference                                  PlayerBuriedItemServiceDataFileLocation;           // 0x1f8(0x10)
	struct StringAssetReference                                  ItemLifetimeIslandCapsDataFileLocation;            // 0x208(0x10)
	struct StringAssetReference                                  CursedCannonballDataAsset;                         // 0x218(0x10)
	struct StringAssetReference                                  Throwables;                                        // 0x228(0x10)
	struct StringClassReference                                  ThrowablesItemCategory;                            // 0x238(0x10)
	struct StringAssetReference                                  SpawnableItemsDataAssetLocation;                   // 0x248(0x10)
	struct StringAssetReference                                  FireworksDebugSpawnItemsDataAsset;                 // 0x258(0x10)
	struct StringAssetReference                                  UnlockableEntitlementsDataAssetLocation;           // 0x268(0x10)
	struct StringAssetReference                                  DebugWieldablesDataAsset;                          // 0x278(0x10)
	struct StringAssetReference                                  StrongholdKeyDataAsset;                            // 0x288(0x10)
	struct StringAssetReference                                  MigrationUIContentsFileLocation;                   // 0x298(0x10)
	struct StringAssetReference                                  InventoryRemappingAssetLocation;                   // 0x2a8(0x10)
	struct StringAssetReference                                  AllianceSettingsAssetLocation;                     // 0x2b8(0x10)
	struct StringAssetReference                                  ReapersMarkSettingsAssetLocation;                  // 0x2c8(0x10)
	struct StringAssetReference                                  EmissaryLevelSettingsAssetLocation;                // 0x2d8(0x10)
	struct StringAssetReference                                  EmissaryRewardSettingsAssetLocation;               // 0x2e8(0x10)
	struct StringAssetReference                                  FactionSettingsAssetLocation;                      // 0x2f8(0x10)
	struct StringAssetReference                                  FactionLootLevelRewardsAssetLocation;              // 0x308(0x10)
	struct StringAssetReference                                  FlamesOfFateSettingsAssetLocation;                 // 0x318(0x10)
	struct StringAssetReference                                  DiggingConfigResolverAssetLocation;                // 0x328(0x10)
	struct StringAssetReference                                  CrewNotificationToastSettings;                     // 0x338(0x10)
	struct StringAssetReference                                  FireSettingsDataAsset;                             // 0x348(0x10)
	struct FString                                               InventoryDefaultItemURL;                           // 0x358(0x10)
	float                                                        CheatFlyingSpeedSlow;                              // 0x368(0x4)
	float                                                        CheatFlyingSpeedDefault;                           // 0x36c(0x4)
	float                                                        CheatFlyingSpeedFast;                              // 0x370(0x4)
	float                                                        CheatFlyingAcceleration;                           // 0x374(0x4)
	struct EncounterServiceParams                                EncounterServiceParams;                            // 0x378(0x20)
	struct CrewServiceParams                                     CrewServiceParams;                                 // 0x398(0x70)
	struct SharedShovelParams                                    SharedShovelParams;                                // 0x408(0x60)
	struct MermaidServiceParams                                  MermaidServiceParams;                              // 0x468(0x8c)
	struct MermaidServiceParams                                  ContestSpecificMermaidServiceParamsToggleLocked;   // 0x4f4(0x8c)
	struct MermaidServiceParams                                  InvasionSpecificMermaidServiceParams;              // 0x580(0x8c)
	struct MakeFriendsEmoteParams                                MakeFriendsEmoteParams;                            // 0x610(0x18)
	struct MermaidRespawnConfig                                  MermaidRespawnConfiguration;                       // 0x628(0x28)
	struct CharacterSocketCollisionServiceParams                 CharacterSocketCollisionServiceParams;             // 0x650(0x8)
	struct AthenaAICharacterParams                               AAthenaAICharacterParams;                          // 0x658(0x14)
	int                                                          AssumedMaxFPSOnServer;                             // 0x66c(0x4)
	struct FName                                                 WwiseObjectUnderwaterStateSwitchGroup;             // 0x670(0x8)
	struct FName                                                 WwiseObjectUnderwaterSwitchDefaultState;           // 0x678(0x8)
	struct FName                                                 WwiseObjectUnderwaterSwitchUnderwaterState;        // 0x680(0x8)
	float                                                        StormQuantisePrecision;                            // 0x688(0x4)
	struct StringAssetReference                                  ShipLiveryCatalogueDataAssetLocation;              // 0x690(0x10)
	struct StringAssetReference                                  ShipPartsCatalogueDataAssetLocation;               // 0x6a0(0x10)
	struct StringAssetReference                                  RowboatSpawnParamsDataAssetLocation;               // 0x6b0(0x10)
	struct StringAssetReference                                  HarpoonLauncherItemExclusionDataAssetLocation;     // 0x6c0(0x10)
	struct StringAssetReference                                  BalanceableWalkwayDataAssetLocation;               // 0x6d0(0x10)
	struct StringAssetReference                                  BalanceableWalkwayFXDataAssetLocation;             // 0x6e0(0x10)
	struct StringAssetReference                                  KrakenTentacleClassLocation;                       // 0x6f0(0x10)
	struct StringAssetReference                                  KrakenShipTentacleClassLocation;                   // 0x700(0x10)
	struct StringAssetReference                                  KrakenServiceParamsDataAssetLocation;              // 0x710(0x10)
	struct StringAssetReference                                  AmbientTinySharkServiceParamsDataAssetLocation;    // 0x720(0x10)
	struct StringAssetReference                                  SunkenIslandSettings;                              // 0x730(0x10)
	struct StringAssetReference                                  CompanyDataListAssetLocation;                      // 0x740(0x10)
	struct StringAssetReference                                  CoherentUIGTAssetRootLocation;                     // 0x750(0x10)
	struct StringAssetReference                                  CoherentUIGTPersistentDataAssetLocation;           // 0x760(0x10)
	struct StringAssetReference                                  CoherentContentEngagementMessageLocation;          // 0x770(0x10)
	struct StringAssetReference                                  NestedWorldRootDataAssetLocation;                  // 0x780(0x10)
	struct StringAssetReference                                  AshenLordEncounterServiceParams;                   // 0x790(0x10)
	struct StringAssetReference                                  PortalServiceParams;                               // 0x7a0(0x10)
	struct StringAssetReference                                  AggressiveGhostShipsEncounterServiceParams;        // 0x7b0(0x10)
	TArray<Class>                                                RequiredLoadoutCategories;                         // 0x7c0(0x10)
	struct StringAssetReference                                  CarouselGenerationParams;                          // 0x7d0(0x10)
	float                                                        SinkingShipDestructionDistanceThreshold;           // 0x7e0(0x4)
	struct StringAssetReference                                  DefaultItemsToBeDisplayedOnInventoryPanel;         // 0x7e8(0x10)
	struct StringClassReference                                  DefaultFogBank;                                    // 0x7f8(0x10)
	struct StringClassReference                                  DefaultFogBankManager;                             // 0x808(0x10)
	struct StringAssetReference                                  TunnelsOfTheDamnedServiceParamsDataAssetLocation;  // 0x818(0x10)
	struct PlayerModerationParams                                PlayerModerationParams;                            // 0x828(0xc)
	struct StringAssetReference                                  SpireServiceParamsDataAssetLocation;               // 0x838(0x10)
	struct StringClassReference                                  GhostCurseEntitlement;                             // 0x848(0x10)
	struct FName                                                 GhostCurseRewardId;                                // 0x858(0x8)
	struct StringClassReference                                  GoldGhostCurseEntitlement;                         // 0x860(0x10)
	struct FName                                                 GoldGhostCurseRewardId;                            // 0x870(0x8)
	struct StringClassReference                                  SkeletonCurseEntitlement;                          // 0x878(0x10)
	struct FName                                                 SkeletonCurseRewardId;                             // 0x888(0x8)
	struct FName                                                 SkeletonCurseWardrobeKey;                          // 0x890(0x8)
	TArray<Class>                                                SkeletonClothingCategories;                        // 0x898(0x10)
	struct StringAssetReference                                  SkeletonClothingEntitlementMapDataAsset;           // 0x8a8(0x10)
	TArray<char>                                                 KillNotificationHealthChangeReasons;               // 0x8b8(0x10)
	struct StringAssetReference                                  ShipStorageJettisonParamsDataAsset;                // 0x8c8(0x10)
	struct StringAssetReference                                  WorldEdgeItemParamsDataAsset;                      // 0x8d8(0x10)
	struct StringAssetReference                                  PlayerLootMarkerServiceParamsFileLocation;         // 0x8e8(0x10)
	struct StringAssetReference                                  DefaultEmblemPopUpBackgroundFileLocation;          // 0x8f8(0x10)
	struct StringAssetReference                                  AdventureOnDemandServiceParamsAssetFileLocation;   // 0x908(0x10)
	struct StringAssetReference                                  AdventureOnDemandVoyageSelectionDataAssetFileLocation; // 0x918(0x10)
	struct StringAssetReference                                  QuestTableAdventureOnDemandParamsFileLocation;     // 0x928(0x10)
	struct StringAssetReference                                  TradingCompanyPopUpBackgroundCollectionAssetFileLocation; // 0x938(0x10)
	struct SeaOfThievesOnDemandTreasurePopupConversionTable      SeaOfThievesOnDemandRewardPopupsConversionTable;   // 0x948(0x10)
	struct StringAssetReference                                  SkellyFortAvailabilityParamsAssetFileLocation;     // 0x958(0x10)
	struct StringAssetReference                                  KrakenAvailabilityParamsAssetFileLocation;         // 0x968(0x10)
	struct StringAssetReference                                  AshenLordAvailabilityParamsAssetFileLocation;      // 0x978(0x10)
	struct StringAssetReference                                  AggressiveGhostShipEncounterAvailabilityParamsAssetFileLocation; // 0x988(0x10)
	struct StringAssetReference                                  AIShipBattleAvailabilityParamsAssetFileLocation;   // 0x998(0x10)
	struct StringAssetReference                                  CompetitiveVoyagesServiceParamsDataAsset;          // 0x9a8(0x10)
	struct StringAssetReference                                  BoneCallerServiceParamsDataAsset;                  // 0x9b8(0x10)
	TArray<struct RareGameServiceSpecification>                  GameContextServiceSpecifications;                  // 0x9c8(0x10)
};


// Size 0x168 (Full Size[0x230] - InheritedSize[0xc8]
class StaggerComponent: public ActorComponent
{
public:
	class CurveFloat*                                            XStickInputOverloaderAmplitude;                    // 0xc8(0x8)
	class CurveFloat*                                            YStickInputOverloaderAmplitude;                    // 0xd0(0x8)
	float                                                        MinInputOverloaderSpd;                             // 0xd8(0x4)
	float                                                        MaxInputOverloaderSpd;                             // 0xdc(0x4)
	float                                                        ChanceToChangeDirectionOnSpeedChange;              // 0xe0(0x4)
	float                                                        InputOverloaderSpdChangePerSec;                    // 0xe4(0x4)
	float                                                        MinOverloaderSpdChangeTime;                        // 0xe8(0x4)
	float                                                        MaxOverloaderSpdChangeTime;                        // 0xec(0x4)
	float                                                        StickInputForMaxInterferenceScalar;                // 0xf0(0x4)
	float                                                        InterferenceScalarAtMinStickInput;                 // 0xf4(0x4)
	float                                                        InterferenceScalarOnLadderStationary;              // 0xf8(0x4)
	float                                                        InterferenceScalarOnLadderMoving;                  // 0xfc(0x4)
	float                                                        MaxStickDeflectionOnLadderToConsiderStationary;    // 0x100(0x4)
	float                                                        StickDeflectionForMaxScalingOnLadder;              // 0x104(0x4)
	TArray<struct StaggerModifiersEntry>                         StaggerModifierEntries;                            // 0x108(0x10)
};


// Size 0x30 (Full Size[0x470] - InheritedSize[0x440]
class MemoryTestPawn: public Pawn
{
public:
	float                                                        Speed;                                             // 0x440(0x4)
	multicastinlinedelegate                                      OnIslandVisited;                                   // 0x448(0x10)
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class RewardService: public Object
{
public:
	TArray<class RewardDefinitionAsset*>                         RewardDefinitionAssets;                            // 0x38(0x10)
};


// Size 0x20 (Full Size[0x548] - InheritedSize[0x528]
class CompassWieldableReplica: public PoseableMeshWieldableReplica
{
public:
	class CompassSpinComponent*                                  SpinComponent;                                     // 0x528(0x8)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class StatusResponseActivateAudioState: public StatusResponse
{
public:
	struct FName                                                 StateName;                                         // 0x30(0x8)
};


// Size 0x208 (Full Size[0x2d0] - InheritedSize[0xc8]
class MeleeAttackProcessorComponent: public ActorComponent
{
public:
	int                                                          MaxPlayerHitResponsesBroadcastPerAttack;           // 0xd0(0x4)
	int                                                          MaxNonPlayerPawnHitResponsesBroadcastPerAttack;    // 0xd4(0x4)
	int                                                          MaxOtherHitResponsesBroadcastPerAttack;            // 0xd8(0x4)
	float                                                        RewindInstigatorEstimationMaxSearchTime;           // 0xdc(0x4)
	float                                                        RewindInstigatorEstimationStepSize;                // 0xe0(0x4)
	struct MeleeAttackHitResponses                               PredictiveHitResponses;                            // 0x128(0x1)
	struct MeleeAttackHitResponses                               ValidatedHitResponses;                             // 0x129(0x1)
	struct MeleeAttackHitResponses                               AuthoritativeHitResponses;                         // 0x12a(0x1)
	struct MeleeAttackHitResponses                               ServerHitResponses;                                // 0x12b(0x1)
	float                                                        ClientHitRangeReduction;                           // 0x12c(0x4)
	bool                                                         ApplyStatusEffectsToAllies;                        // 0x130(0x1)
};


// Size 0x240 (Full Size[0x308] - InheritedSize[0xc8]
class PremiumShopViewModelComponentBase: public ActorComponent
{
public:
	class PetShopDataAsset*                                      PetShopDataAsset;                                  // 0x278(0x8)
};


// Size 0x8 (Full Size[0x178] - InheritedSize[0x170]
class EnvQueryTest_InShipwreckZone: public EnvQueryTest
{
public:
	float                                                        Radius;                                            // 0x170(0x4)
};


// Size 0x390 (Full Size[0x758] - InheritedSize[0x3c8]
class BootyStorageService: public Actor
{
public:
	class BootyStorageSettings*                                  BootyStorageSettings;                              // 0x450(0x8)
	class BootyStorageSettingsAsset*                             BootyStorageSettingsAsset;                         // 0x458(0x8)
	TArray<struct CrewBootyStorage>                              Storage;                                           // 0x460(0x10)
	struct EnvQueryRequest                                       SpawnBootyEQSRequest;                              // 0x470(0x170)
	struct EnvQueryRequest                                       SpawnRetrievalActorEQSRequest;                     // 0x5e0(0x170)
};


// Size 0x10 (Full Size[0x320] - InheritedSize[0x310]
class AnimNotifyAdditionalEventsWwiseEmitterComponent: public AnimNotifyWwiseEmitterComponent
{
public:
	TArray<struct AnimNotifyWwiseObserver>                       AnimNotifyObservers;                               // 0x310(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class EquippedWithClothingStatCondition: public StatCondition
{
public:
	struct RequiredClothingData                                  RequiredClothingData;                              // 0x28(0x18)
};


// Size 0x128 (Full Size[0x4f0] - InheritedSize[0x3c8]
class TreasureRoom: public Actor
{
public:
	multicastinlinedelegate                                      StartedDelegate;                                   // 0x3c8(0x10)
	multicastinlinedelegate                                      FailDelegate;                                      // 0x3d8(0x10)
	multicastinlinedelegate                                      EndedDelegate;                                     // 0x3e8(0x10)
	class BoxComponent*                                          RoomAreaComponent;                                 // 0x3f8(0x8)
	class AISpawner*                                             GoldHoarderSpawner;                                // 0x400(0x8)
	class Actor*                                                 SourceLocationActor;                               // 0x408(0x8)
	class AIDioramaDesc*                                         AIDioramaDesc;                                     // 0x410(0x8)
	float                                                        TriggerRadius;                                     // 0x418(0x4)
	class AISpawnerMusicZoneComponent*                           MusicZoneComponent;                                // 0x420(0x8)
	class AIProximityPlayerTracker*                              ProximityPlayerTracker;                            // 0x428(0x8)
	class AISpawner*                                             ActiveSpawner;                                     // 0x430(0x8)
	class AIDioramaController*                                   AIDioramaController;                               // 0x438(0x8)
	TArray<class Actor*>                                         OverlappingActors;                                 // 0x4d0(0x10)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class RemoveFogBankAvoidanceAreaStep: public TaleQuestStep
{
public:
	class RemoveFogBankAvoidanceAreaStepDesc*                    StepDesc;                                          // 0x98(0x8)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class NPCCustomAnimationDataAsset: public DataAsset
{
public:
	struct NPCCustomAnimationDataStructure                       NPCCustomAnimationData;                            // 0x30(0x38)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AthenaDebugSettings: public Object
{
public:
	struct StringAssetReference                                  Dioramas;                                          // 0x28(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class PlayNpcAnimationResource: public DataAsset
{
public:
	struct FName                                                 AnimationNameToPlay;                               // 0x28(0x8)
	class SceneDialogueData*                                     DialogueData;                                      // 0x30(0x8)
	class UClass*                                                LocalMusicZone;                                    // 0x38(0x8)
	TArray<struct Text>                                          SpeakingActorLocalisableNames;                     // 0x40(0x10)
};


// Size 0x28 (Full Size[0xc0] - InheritedSize[0x98]
class BlockMigrationForCrewTaskStep: public TaleQuestStep
{
public:
	class BlockMigrationForCrewTaskStepDesc*                     Desc;                                              // 0x98(0x8)
	interface                                                    TaskStep;                                          // 0xa0(0x10)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class StoryDrivenFogBankDataAsset: public DataAsset
{
public:
	struct FeatureFlag                                           Feature;                                           // 0x28(0xc)
	TArray<struct FogBankStoryRelatedSettings>                   StoryResponses;                                    // 0x38(0x10)
	TArray<class StoryDrivenFogBankDataAsset*>                   AssetsList;                                        // 0x48(0x10)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class AthenaAnimationItemListingMappingsAsset: public DataAsset
{
public:
	struct AthenaAnimationItemListingMappingType                 MaleListings;                                      // 0x28(0x20)
	struct AthenaAnimationItemListingMappingType                 FemaleListings;                                    // 0x48(0x20)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class BuriedItemStep: public TaleQuestStep
{
public:
	class BuriedItemStepDesc*                                    StepDesc;                                          // 0x98(0x8)
};


// Size 0x1e8 (Full Size[0x2b0] - InheritedSize[0xc8]
class PlayerTelemetryComponent: public ActorComponent
{
public:
	float                                                        HeartbeatInterval;                                 // 0x12c(0x4)
	struct DateTime                                              SpawnTimestamp;                                    // 0x280(0x8)
};


// Size 0x10 (Full Size[0x800] - InheritedSize[0x7f0]
class CannonBall: public StaticMeshWieldableItem
{
public:
	class InventoryItemComponent*                                InventoryItem;                                     // 0x7f0(0x8)
	class ConsumableWieldableComponent*                          ConsumableWieldable;                               // 0x7f8(0x8)
};


// Size 0x88 (Full Size[0xb0] - InheritedSize[0x28]
class KrakenTentacleAIAudioComponentParams: public DataAsset
{
public:
	class WwiseObjectPoolWrapper*                                TentacleEmitterPool;                               // 0x28(0x8)
	class WwiseObjectPoolWrapper*                                MouthEmitterPool;                                  // 0x30(0x8)
	class WwiseEvent*                                            PlayKrakenTentacleEmerge;                          // 0x38(0x8)
	class WwiseEvent*                                            PlayKrakenTentacleSubmerge;                        // 0x40(0x8)
	class WwiseEvent*                                            PlayKrakenTentacleSuckTell;                        // 0x48(0x8)
	class WwiseEvent*                                            StopKrakenTentacleSuckTell;                        // 0x50(0x8)
	class WwiseEvent*                                            PlayKrakenTentacleSuck;                            // 0x58(0x8)
	class WwiseEvent*                                            StopKrakenTentacleSuck;                            // 0x60(0x8)
	class WwiseEvent*                                            PlayKrakenTentacleMouthAmbience;                   // 0x68(0x8)
	class WwiseEvent*                                            StopKrakenTentacleMouthAmbience;                   // 0x70(0x8)
	class WwiseEvent*                                            PlayPlayerInAirWind;                               // 0x78(0x8)
	class WwiseEvent*                                            StopPlayerInAirWind;                               // 0x80(0x8)
	class WwiseEvent*                                            PlayKrakenCatchPlayer;                             // 0x88(0x8)
	class WwiseEvent*                                            PlayKrakenSpitPlayer;                              // 0x90(0x8)
	struct FName                                                 KrakenSuckFactorRtpc;                              // 0x98(0x8)
	class WwiseEvent*                                            PlayKrakenTentacleWrapTell;                        // 0xa0(0x8)
	class WwiseEvent*                                            StopKrakenTentacleWrapTell;                        // 0xa8(0x8)
};


// Size 0x170 (Full Size[0x960] - InheritedSize[0x7f0]
class Bucket: public SkeletalMeshWieldableItem
{
public:
	class InventoryItemComponent*                                InventoryItem;                                     // 0x7f8(0x8)
	TArray<struct BucketContentsInfo>                            BucketContentsInfos;                               // 0x800(0x10)
	class WwiseEvent*                                            ScoopSfx;                                          // 0x810(0x8)
	struct FName                                                 ThrowSocketName;                                   // 0x818(0x8)
	struct FName                                                 DrenchWielderSocketName;                           // 0x820(0x8)
	float                                                        ScoopActionTime;                                   // 0x828(0x4)
	float                                                        ScoopCompleteTime;                                 // 0x82c(0x4)
	float                                                        ThrowActionTime;                                   // 0x830(0x4)
	float                                                        ThrowCompleteTime;                                 // 0x834(0x4)
	float                                                        DrenchWielderActionTime;                           // 0x838(0x4)
	float                                                        DrenchWielderCompleteTime;                         // 0x83c(0x4)
	float                                                        RequestToleranceTimeOnServer;                      // 0x840(0x4)
	float                                                        ProjectileSpeed;                                   // 0x844(0x4)
	float                                                        ProjectileAdditionalLiftAngle;                     // 0x848(0x4)
	float                                                        WaterFillFromShip;                                 // 0x84c(0x4)
	float                                                        WaterFillFromSea;                                  // 0x850(0x4)
	float                                                        WaterTransferFillAmountModifier;                   // 0x854(0x4)
	float                                                        ScoopBufferDistance;                               // 0x858(0x4)
	char                                                         ScoopHitTestTraceChannel;                          // 0x85c(0x1)
	class UClass*                                                BucketScoopCooldownType;                           // 0x860(0x8)
	class UClass*                                                BucketThrowCooldownType;                           // 0x868(0x8)
	class UClass*                                                BucketDouseCooldownType;                           // 0x870(0x8)
	float                                                        ThrowLiquidAINoiseRange;                           // 0x878(0x4)
	class LiquidContainerComponent*                              LiquidContainer;                                   // 0x880(0x8)
	struct LiquidContents                                        Contents;                                          // 0x888(0x40)
	char                                                         FillState;                                         // 0x940(0x1)
	class ParticleSystemComponent*                               BucketContentsEffect;                              // 0x948(0x8)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class NPCDialogConditionalText: public Object
{
public:
	struct FText                                                 Text;                                              // 0x28(0x38)
	class NPCDialogExpression*                                   Expression;                                        // 0x60(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ShipFactory: public Object
{
public:
	TArray<class ShipBuilder*>                                   Builders;                                          // 0x30(0x10)
};


// Size 0x80 (Full Size[0x148] - InheritedSize[0xc8]
class AimAssistComponent: public ActorComponent
{
public:
	class AimAssistDataAsset*                                    AimAssistDataAsset;                                // 0xc8(0x8)
	class AimAssistCameraModifier*                               AimAssistCameraModifier;                           // 0xd8(0x8)
	class AimAssistDebugComponent*                               AimAssistDebugComponent;                           // 0xe0(0x8)
	class CameraComponent*                                       Camera;                                            // 0xe8(0x8)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class WaitForArrivalTunnelOfTheDamnedCompletionTaleStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableGuid                                     CrewId;                                            // 0x80(0x30)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class IsPlayerParticipatingInQuestTypeStatCondition: public StatCondition
{
public:
	char                                                         TargetQuestType;                                   // 0x28(0x1)
};


// Size 0x90 (Full Size[0xa60] - InheritedSize[0x9d0]
class SkeletalMeshMemoryConstraintComponent: public SkeletalMeshComponent
{
public:
	class MeshMemoryConstraintHandler*                           Handler;                                           // 0x9f0(0x8)
	TArray<struct StringAssetReference>                          FallbackOverrideMaterials;                         // 0x9f8(0x10)
	class UClass*                                                MeshFallbackCategory;                              // 0xa08(0x8)
	struct StringAssetReference                                  MeshReference;                                     // 0xa10(0x10)
	int64                                                        CachedMeshResourceSize;                            // 0xa20(0x8)
	bool                                                         MemoryAccountedFor;                                // 0xa28(0x1)
	bool                                                         NeedMeshLoadOnServer;                              // 0xa29(0x1)
	class UClass*                                                BudgetToCountMemoryAgainstIfNoFallback;            // 0xa30(0x8)
	struct FeatureFlag                                           OptionalFeatureToggleForMMC;                       // 0xa38(0xc)
	multicastinlinedelegate                                      OnChangeableMeshChanged;                           // 0xa48(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AthenaAnimationServerData: public AnimationServerData
{
public:
	TArray<struct AthenaAnimationServerAnimAISpawnData>          AISpawnData;                                       // 0x28(0x10)
};


// Size 0x28 (Full Size[0x3f0] - InheritedSize[0x3c8]
class LauncherParentMock: public Actor
{
public:
	TArray<class Actor*>                                         IgnoreActors;                                      // 0x3e0(0x10)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class GhostDataAsset: public DataAsset
{
public:
	class UClass*                                                RevivedAnimationStateId;                           // 0x28(0x8)
	float                                                        InitialSpawnTime;                                  // 0x30(0x4)
	float                                                        HeightOffsetFromCeilingCollision;                  // 0x34(0x4)
	TArray<struct GhostPlayModeParameters>                       PlayModeParameters;                                // 0x38(0x10)
	char                                                         GhostCollisionChannel;                             // 0x48(0x1)
	float                                                        GhostShader_Start_InitialAmount;                   // 0x4c(0x4)
	float                                                        GhostShader_Start_TargetAmount;                    // 0x50(0x4)
	float                                                        GhostShader_Start_Delay;                           // 0x54(0x4)
	float                                                        GhostShader_Start_Duration;                        // 0x58(0x4)
	float                                                        GhostShader_End_InitialAmount;                     // 0x5c(0x4)
	float                                                        GhostShader_End_TargetAmount;                      // 0x60(0x4)
	float                                                        GhostShader_End_Delay;                             // 0x64(0x4)
	float                                                        GhostShader_End_Duration;                          // 0x68(0x4)
};


// Size 0x250 (Full Size[0x618] - InheritedSize[0x3c8]
class CaptainedSessionService: public Actor
{
public:
	TArray<struct CaptainedCrew>                                 CaptainedCrews;                                    // 0x3e8(0x10)
	class ScrambledNamesDataAsset*                               ScrambledShipNamesDataAsset;                       // 0x610(0x8)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class NPCHideComponent: public ActorComponent
{
public:
	bool                                                         bHideActive;                                       // 0xd0(0x1)
};


// Size 0x1a8 (Full Size[0x270] - InheritedSize[0xc8]
class PlayerMigratableStatusComponent: public ActorComponent
{
public:
	class Actor*                                                 CurrentShip;                                       // 0x250(0x8)
};


// Size 0xe8 (Full Size[0x110] - InheritedSize[0x28]
class ContendedResourceService: public Object
{
public:
	class World*                                                 World;                                             // 0x38(0x8)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class TaleQuestLoopStepDesc: public TaleQuestStepDesc
{
public:
	class TaleQuestStepDesc*                                     LoopDesc;                                          // 0x80(0x8)
	struct QuestVariableBool                                     Condition;                                         // 0x88(0x30)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class CargoRunQuestRandomRequiredItemsDataAsset: public DataAsset
{
public:
	TArray<struct CargoRunQuestCategoryGroup>                    CategoryGroups;                                    // 0x28(0x10)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class SceneDialogueData: public Object
{
public:
	TArray<struct Name>                                          ActorNames;                                        // 0x28(0x10)
	char                                                         ChatType;                                          // 0x38(0x1)
	TArray<class SceneDialogueSection*>                          TextSections;                                      // 0x40(0x10)
	bool                                                         ChainedDialogue;                                   // 0x50(0x1)
	struct FString                                               SourceText;                                        // 0x58(0x10)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class PortableHarpoonInteractionIgnoreObstructionComponent: public ActorComponent
{
public:
	TArray<struct ActorComponentSelector>                        ComponentsToIgnoreForObstructions;                 // 0xc8(0x10)
};


// Size 0x118 (Full Size[0x560] - InheritedSize[0x448]
class SequencerCutSceneActor: public LevelSequenceActor
{
public:
	struct CutScenePlayData                                      CutScenePlayData;                                  // 0x450(0x38)
	TArray<struct CutSceneLoadData>                              CutSceneDataSet;                                   // 0x488(0x10)
	class CutSceneSubtitlesComponent*                            CutsceneSubtitleComponent;                         // 0x498(0x8)
	class Pawn*                                                  InteractingPlayerPawn;                             // 0x4a0(0x8)
	bool                                                         IsLooping;                                         // 0x4a8(0x1)
	TArray<struct Guid>                                          CutSceneCrewIds;                                   // 0x4b0(0x10)
	class LevelSequence*                                         LevelSequenceToPlay;                               // 0x4c0(0x8)
	TArray<class LevelSequence*>                                 LevelSequencesToPlay;                              // 0x4c8(0x10)
	bool                                                         SequenceIsLoading;                                 // 0x558(0x1)
};


// Size 0x190 (Full Size[0x1b8] - InheritedSize[0x28]
class GameNarrationCoordinator: public Object
{
public:
	class WwiseEvent*                                            NarrationSpeakEvent;                               // 0x28(0x8)
	struct WwiseEmitter                                          Emitter;                                           // 0x30(0x20)
	struct FString                                               CachedPreferredVoice;                              // 0x188(0x10)
	struct FString                                               CachedLanguage;                                    // 0x198(0x10)
	int                                                          CachedGender;                                      // 0x1a8(0x4)
	bool                                                         IsNarrationSettingEnabled;                         // 0x1ac(0x1)
	int                                                          NarrationOverride;                                 // 0x1b0(0x4)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class StorageContainerContentModifierSettings: public DeveloperSettings
{
public:
	struct StringAssetReference                                  StorageContainerContentModifierDataAssetLocation;  // 0x38(0x10)
};


// Size 0x58 (Full Size[0x2a0] - InheritedSize[0x248]
class GatedHealthComponent: public ItemHealthComponent
{
public:
	uint32                                                       NumOfGates;                                        // 0x250(0x4)
};


// Size 0x168 (Full Size[0x530] - InheritedSize[0x3c8]
class ItemInfo: public Actor
{
public:
	bool                                                         CanBeStoredInInventory;                            // 0x3e8(0x1)
	multicastinlinedelegate                                      OnItemPickedUpDelegate;                            // 0x3f0(0x10)
	multicastinlinedelegate                                      OnItemDroppedDeletage;                             // 0x400(0x10)
	class UClass*                                                WieldableType;                                     // 0x440(0x8)
	class UClass*                                                ProxyType;                                         // 0x448(0x8)
	class WieldableItemPersistentCooldownComponent*              WieldableItemPersistenceCooldownComponent;         // 0x450(0x8)
	bool                                                         ExcludeFromMigration;                              // 0x458(0x1)
	class ItemDesc*                                              Desc;                                              // 0x460(0x8)
	char                                                         CurrentRepresentation;                             // 0x468(0x1)
	class Actor*                                                 CurrentRepresentationInstance;                     // 0x470(0x8)
	class Actor*                                                 CurrentOwner;                                      // 0x478(0x8)
	class Actor*                                                 TutorialOwner;                                     // 0x480(0x8)
	bool                                                         DoNotConsiderForMigrationGather;                   // 0x529(0x1)
	bool                                                         DestroyPostMigration;                              // 0x52b(0x1)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class SceneDialogueTextPoint: public SceneDialoguePoint
{
public:
	bool                                                         IsDelay;                                           // 0x28(0x1)
	char                                                         ActorNumber;                                       // 0x29(0x1)
	struct FText                                                 Text;                                              // 0x30(0x38)
	float                                                        DelayAfter;                                        // 0x68(0x4)
	class AnimationAsset*                                        Animation;                                         // 0x70(0x8)
	class WwiseEvent*                                            Speech;                                            // 0x78(0x8)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class SlidingDoorAudioParams: public DataAsset
{
public:
	class WwiseObjectPoolWrapper*                                SlidingDoorPool;                                   // 0x28(0x8)
	class WwiseEvent*                                            SlidingDoorOpeningLoopStart;                       // 0x30(0x8)
	class WwiseEvent*                                            SlidingDoorOpeningLoopStop;                        // 0x38(0x8)
	class WwiseEvent*                                            SlidingDoorOpeningAdditionalStopSound;             // 0x40(0x8)
	class WwiseEvent*                                            SlidingDoorClosingLoopStart;                       // 0x48(0x8)
	class WwiseEvent*                                            SlidingDoorClosingLoopStop;                        // 0x50(0x8)
	class WwiseEvent*                                            SlidingDoorClosingAdditionalStopSound;             // 0x58(0x8)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class DeliverableVoyageRequirement: public DeliverableRequirementBase
{
public:
	TArray<Class>                                                AllowedVoyages;                                    // 0x30(0x10)
};


// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class EntitlementDesc: public DataAsset
{
public:
	struct FText                                                 Title;                                             // 0x28(0x38)
	struct FText                                                 Description;                                       // 0x60(0x38)
	struct StringAssetReference                                  IconInvPath;                                       // 0x98(0x10)
	struct StringAssetReference                                  IconPrvPath;                                       // 0xa8(0x10)
	class UClass*                                                Category;                                          // 0xb8(0x8)
	class UClass*                                                Company;                                           // 0xc0(0x8)
};


// Size 0x10 (Full Size[0x70] - InheritedSize[0x60]
class BlockVolcanoTaleQuestService: public TaleQuestService
{
public:
	class BlockVolcanoTaleQuestServiceDesc*                      Desc;                                              // 0x60(0x8)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class ShipEntitlementProcessingPolicy: public Object
{
public:
	TArray<class Class*>                                         AcceptedEntitlements;                              // 0x30(0x10)
	TArray<class Class*>                                         AcceptedCategories;                                // 0x40(0x10)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class StatusResponseHealthChangeOverTime: public StatusResponse
{
public:
	float                                                        HealthChangePerSecond;                             // 0x30(0x4)
	char                                                         HealthChangedReason;                               // 0x34(0x1)
	class UClass*                                                DamagerTypeForDamageModification;                  // 0x38(0x8)
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class AssociateActorToCrewTaskStep: public TaleQuestStep
{
public:
	class AssociateActorToCrewTaskStepDesc*                      Desc;                                              // 0x98(0x8)
	interface                                                    TaskStep;                                          // 0xa0(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class StrongholdKeyData: public DataAsset
{
public:
	TArray<struct StrongholdKeyInfo>                             StrongholdKeys;                                    // 0x28(0x10)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class AICombatDialogue: public Object
{
public:
	class SceneDialogueCoordinator*                              DialogueCoordinator;                               // 0x28(0x8)
	class SceneDialogueData*                                     DialogueData;                                      // 0x30(0x8)
	int                                                          NumAISlots;                                        // 0x38(0x4)
	float                                                        ChatMaxDistance;                                   // 0x3c(0x4)
	float                                                        RemoveAIDelay;                                     // 0x40(0x4)
	float                                                        EndDelay;                                          // 0x44(0x4)
	class SimpleDialogueStateProvider*                           StateProvider;                                     // 0x48(0x8)
};


// Size 0xf8 (Full Size[0x4c0] - InheritedSize[0x3c8]
class AllianceService: public Actor
{
public:
	class AllianceSettingsAsset*                                 Settings;                                          // 0x3d0(0x8)
	TArray<struct Alliance>                                      Alliances;                                         // 0x3d8(0x10)
	class AllianceServiceTelemetryComponent*                     TelemetryComponent;                                // 0x3e8(0x8)
	TArray<struct CrewAllianceJoinStatus>                        CrewAllianceJoinStatuses;                          // 0x3f0(0x10)
	multicastinlinedelegate                                      OnCrewJoinedAlliance;                              // 0x438(0x10)
};


// Size 0x70 (Full Size[0x138] - InheritedSize[0xc8]
class QuickInventoryComponent: public ActorComponent
{
public:
	class UClass*                                                CannonballItemCategory;                            // 0xe0(0x8)
	class UClass*                                                CursedCannonballItemCategory;                      // 0xe8(0x8)
	class UClass*                                                FoodItemCategory;                                  // 0xf0(0x8)
	class UClass*                                                RepairablesItemCategory;                           // 0xf8(0x8)
	class UClass*                                                BaitItemCategory;                                  // 0x100(0x8)
	class UClass*                                                FireBombCategory;                                  // 0x108(0x8)
	class UClass*                                                ChainShotCategory;                                 // 0x110(0x8)
	class UClass*                                                GrapeShotCategory;                                 // 0x118(0x8)
	class UClass*                                                FireworkCategory;                                  // 0x120(0x8)
};


// Size 0x80 (Full Size[0x448] - InheritedSize[0x3c8]
class InteractableMockActor: public Actor
{
public:
	class Actor*                                                 ActorThatInteracted;                               // 0x3e0(0x8)
	TArray<class Class*>                                         CanInteractNotifications;                          // 0x3f0(0x10)
	class CapsuleComponent*                                      PrimitiveComponent;                                // 0x400(0x8)
	class InteractableComponent*                                 InteractableComponent;                             // 0x408(0x8)
	class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x410(0x8)
	char                                                         CurrentInteractionState;                           // 0x418(0x1)
	TArray<class InteractionPrerequisiteBase*>                   Prerequisites;                                     // 0x420(0x10)
	bool                                                         CanSetInteractionState;                            // 0x430(0x1)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class ItemActionComponentAudioParams: public DataAsset
{
public:
	class WwiseObjectPoolWrapper*                                ItemActionAudioPool;                               // 0x28(0x8)
	class WwiseEvent*                                            ActionStartEvent;                                  // 0x30(0x8)
	class WwiseEvent*                                            ActionStopEvent;                                   // 0x38(0x8)
	bool                                                         ActionStartEventIsLoop;                            // 0x40(0x1)
	float                                                        ActionStartEventFadeTime;                          // 0x44(0x4)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class StatusResponseChangeSailHeight: public StatusResponse
{
public:
	float                                                        Duration;                                          // 0x30(0x4)
};


// Size 0xb8 (Full Size[0x180] - InheritedSize[0xc8]
class HitDetectionComponent: public ActorComponent
{
public:
	float                                                        MaxTimedSweepWaitTime;                             // 0xd0(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class RugsPartDescAsset: public ShipPartDescAsset
{
public:
	struct RugsPartDesc                                          RugsPartDesc;                                      // 0x28(0x8)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class SeaFortAddOnSharedDataAsset: public DataAsset
{
public:
	TArray<struct PrisonerToPositionMapping>                     SpawnablePrisonerToPositionMappings;               // 0x28(0x10)
	class UClass*                                                ItemToSpawn;                                       // 0x38(0x8)
	struct Vector                                                ItemSpawnRelativeLocation;                         // 0x40(0xc)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class InteractableLightParameters: public DataAsset
{
public:
	bool                                                         LiveUpdate;                                        // 0x28(0x1)
	bool                                                         StartLit;                                          // 0x29(0x1)
	TArray<struct InteractableLightParams>                       LightParams;                                       // 0x30(0x10)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class StatusResponseScreenSpaceParticles: public StatusResponse
{
public:
	class Object*                                                ParticleSystem;                                    // 0x30(0x8)
	bool                                                         DoesVFXTimeOut;                                    // 0x38(0x1)
};


// Size 0x128 (Full Size[0x1f0] - InheritedSize[0xc8]
class ProjectileWeaponQSDebugComponent: public ActorComponent
{
public:
	TArray<struct QuickSwitchDebugWeaponData>                    DebugData;                                         // 0xe0(0x10)
};


// Size 0x250 (Full Size[0x278] - InheritedSize[0x28]
class PetsAnimationData: public DataAsset
{
public:
	struct PetAnimationDataStructure                             PetAnimations;                                     // 0x28(0x218)
	struct FloatRange                                            LookAtPitchRange;                                  // 0x240(0x10)
	float                                                        LookAtClamp;                                       // 0x250(0x4)
	float                                                        LookAtTimeToComplete;                              // 0x254(0x4)
	float                                                        TransitionFromTurningMovementSpeed;                // 0x258(0x4)
	struct FloatRange                                            PositiveMoodAnimationRange;                        // 0x25c(0x10)
	float                                                        PositiveMoodBlendTime;                             // 0x26c(0x4)
	bool                                                         DefaultAllowHappyReact;                            // 0x270(0x1)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class SpawnPortalTaleStepDesc: public TaleQuestStepDesc
{
public:
	class PortalDesc*                                            PortalDesc;                                        // 0x80(0x8)
	struct QuestVariableActor                                    SpawnedPortal;                                     // 0x88(0x30)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ReceiverPuzzleStatueAudioParamsDataAsset: public DataAsset
{
public:
	class WwiseEvent*                                            ReceiverChangingPosition;                          // 0x28(0x8)
	class WwiseEvent*                                            GrindingStart;                                     // 0x30(0x8)
	class WwiseEvent*                                            GrindingStop;                                      // 0x38(0x8)
};


// Size 0xc8 (Full Size[0x4a0] - InheritedSize[0x3d8]
class AthenaTextRender: public StaticMeshActor
{
public:
	struct FText                                                 Text;                                              // 0x3d8(0x38)
	struct TreasureMapWidgetText                                 TextDesc;                                          // 0x410(0x3c)
	int                                                          CanvasWidth;                                       // 0x44c(0x4)
	int                                                          CanvasHeight;                                      // 0x450(0x4)
	class Font*                                                  Font;                                              // 0x458(0x8)
	struct Vector2D                                              FontScale;                                         // 0x460(0x8)
	float                                                        FontLineSpacingScale;                              // 0x468(0x4)
	class CanvasRenderTarget2D*                                  AthenaTextRenderTarget;                            // 0x478(0x8)
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class SimpleSceneDialogueComponent: public ActorComponent
{
public:
	TArray<class WwiseEvent*>                                    AudioEvents;                                       // 0xd0(0x10)
};


// Size 0x148 (Full Size[0x210] - InheritedSize[0xc8]
class DiggingComponent: public ActorComponent
{
public:
	multicastinlinedelegate                                      OnFinishedDigging;                                 // 0xd0(0x10)
	multicastinlinedelegate                                      OnFinishedBurying;                                 // 0xe0(0x10)
	class Actor*                                                 Discoverer;                                        // 0xf0(0x8)
	struct BuriedFactor                                          BuriedFactor;                                      // 0xf8(0x14)
	char                                                         State;                                             // 0x10c(0x1)
	struct Vector                                                StartingLocation;                                  // 0x110(0xc)
	struct Rotator                                               StartingRotation;                                  // 0x11c(0xc)
	class MaterialInstanceDynamic*                               ItemDynamicMaterial;                               // 0x128(0x8)
	struct ItemDiggingMergedConfig                               DiggingConfig;                                     // 0x130(0x28)
	class DiggingSettings*                                       DiggingSettings;                                   // 0x158(0x8)
	class WwiseObjectPoolWrapper*                                CachedSfxPool;                                     // 0x160(0x8)
};


// Size 0xf0 (Full Size[0x8e0] - InheritedSize[0x7f0]
class Spyglass: public SkeletalMeshWieldableItem
{
public:
	class InventoryItemComponent*                                InventoryItem;                                     // 0x800(0x8)
	class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x808(0x8)
	class AimSensitivityComponent*                               AimSensitivityComponent;                           // 0x810(0x8)
	float                                                        NameplateVisibilityRangeExtensionFactorWhileZoomed; // 0x828(0x4)
	float                                                        SecondsUntilZoomStarts;                            // 0x82c(0x4)
	float                                                        SecondsUntilPostStarts;                            // 0x830(0x4)
	float                                                        InAimFOV;                                          // 0x834(0x4)
	float                                                        BlendSpeed;                                        // 0x838(0x4)
	struct ItemUseSpeedParams                                    AimSpeedScaleParameters;                           // 0x83c(0x8)
	class PostProcessComponent*                                  PostProcessComponent;                              // 0x848(0x8)
	class CurveFloat*                                            BlurCurve;                                         // 0x850(0x8)
	class MaterialInstanceDynamic*                               DynamicMaterial;                                   // 0x890(0x8)
	bool                                                         TurningOn;                                         // 0x898(0x1)
	float                                                        BlurTime;                                          // 0x89c(0x4)
	float                                                        BlurInDuration;                                    // 0x8a0(0x4)
	float                                                        BlurOutDuration;                                   // 0x8a4(0x4)
	class StaticMeshComponent*                                   Glint;                                             // 0x8a8(0x8)
	class Material*                                              MaterialParent;                                    // 0x8b0(0x8)
	class Texture2D*                                             LensNormal;                                        // 0x8b8(0x8)
	class Texture2D*                                             LensMask;                                          // 0x8c0(0x8)
	struct LinearColor                                           LensTint;                                          // 0x8c8(0x10)
};


// Size 0x8 (Full Size[0x408] - InheritedSize[0x400]
class WorldSafeRegion: public BlockingVolume
{
public:
	bool                                                         RequiresShroudBreaker;                             // 0x401(0x1)
	bool                                                         IsMainWorldSafeZone;                               // 0x402(0x1)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class CanvasLODService: public Object
{
public:
	TArray<class Actor*>                                         ResourceManagedCanvases;                           // 0x38(0x10)
};


// Size 0x38 (Full Size[0x100] - InheritedSize[0xc8]
class LandmarkReactionTriggerComponent: public ActorComponent
{
public:
	TArray<struct LandmarkReactionKeyFrame>                      ReactionFrames;                                    // 0xd0(0x10)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class StatusResponseSetAICharacterMoveSpeedModifier: public StatusResponse
{
public:
	char                                                         Reason;                                            // 0x30(0x1)
	float                                                        Multiplier;                                        // 0x34(0x4)
};


// Size 0x1e8 (Full Size[0x5b0] - InheritedSize[0x3c8]
class SeaFortsService: public Actor
{
public:
	struct SeaFortDistantLightsAssetLoader                       DistantLightsAssetLoader;                          // 0x3d8(0x28)
	TArray<struct SeaFortDistantLightsSignal>                    ReplicatedDistantLightsSignals;                    // 0x400(0x10)
	map                                                          FortAlignmentStateCountsMap;                       // 0x410(0x50)
	class SeaFortsWorldDataAsset*                                SeaFortsData;                                      // 0x460(0x8)
	TArray<class Seafort*>                                       SeaForts;                                          // 0x468(0x10)
	map                                                          SeaFortDistantLightsIslandMap;                     // 0x478(0x50)
};


// Size 0x80 (Full Size[0x100] - InheritedSize[0x80]
class SetHiddenOnKeyTakenStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    CutsceneLockNPC;                                   // 0x80(0x30)
	struct QuestVariableActor                                    SequencerCutSceneActor;                            // 0xb0(0x30)
	class LevelSequence*                                         LevelSequence;                                     // 0xe0(0x8)
	struct FString                                               ActorName;                                         // 0xe8(0x10)
	bool                                                         Visible;                                           // 0xf8(0x1)
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class ShopDialogue: public DataAsset
{
public:
	struct FText                                                 ConfirmPurchaseMessage;                            // 0x28(0x38)
	struct FText                                                 PurchaseFailedMessage;                             // 0x60(0x38)
	struct FText                                                 PurchasePendingMessage;                            // 0x98(0x38)
	struct FText                                                 PurchaseSuccessMessage;                            // 0xd0(0x38)
	struct FText                                                 GetShopOffersFailedMessage;                        // 0x108(0x38)
};


// Size 0x80 (Full Size[0xa8] - InheritedSize[0x28]
class RadialCreationRuleAsset: public DataAsset
{
public:
	struct RadialInstance                                        Ruleset;                                           // 0x28(0x80)
};


// Size 0x658 (Full Size[0xa20] - InheritedSize[0x3c8]
class BaseContinuousAnimatedMechanismAction: public Actor
{
public:
	class SceneComponent*                                        Root;                                              // 0x3d8(0x8)
	class SceneComponent*                                        Pivot;                                             // 0x3e0(0x8)
	struct TransformBlendCurve                                   Animation;                                         // 0x3f0(0x500)
	bool                                                         AnimateWithAcceleration;                           // 0x8f0(0x1)
	bool                                                         EnableCameraLookAt;                                // 0x8f1(0x1)
	struct Vector                                                MechanismLookAtLocationRelativeToActor;            // 0x8f4(0xc)
	class WwiseObjectPoolWrapper*                                EmitterPool;                                       // 0x900(0x8)
	struct FName                                                 MechanismMovementProgressRateOfChangeRTPCName;     // 0x908(0x8)
	class WwiseEvent*                                            MechanismStartedMovingAudioEvent;                  // 0x910(0x8)
	class WwiseEvent*                                            MechanismStoppedMovingAudioEvent;                  // 0x918(0x8)
	class WwiseEvent*                                            MechanismStoppedInProgressAudioEvent;              // 0x920(0x8)
	class WwiseEvent*                                            MechanismReachedMinimumAudioEvent;                 // 0x928(0x8)
	class WwiseEvent*                                            MechanismReachedMaximumAudioEvent;                 // 0x930(0x8)
	bool                                                         TransformAudioEmitterWithPivot;                    // 0x938(0x1)
	bool                                                         ParticleSystemsInheritActorScale;                  // 0x939(0x1)
	class ParticleSystem*                                        MechanismMovingParticleSystem;                     // 0x940(0x8)
	struct Vector                                                MechanismMovingParticleSystemLocation;             // 0x948(0xc)
	struct Rotator                                               MechanismMovingParticleSystemRotation;             // 0x954(0xc)
	class ParticleSystem*                                        MechanismReachedMinimumParticleSystem;             // 0x960(0x8)
	struct Vector                                                MechanismReachedMinimumParticleSystemLocation;     // 0x968(0xc)
	struct Rotator                                               MechanismReachedMinimumParticleSystemRotation;     // 0x974(0xc)
	class ParticleSystem*                                        MechanismReachedMaximumParticleSystem;             // 0x980(0x8)
	struct Vector                                                MechanismReachedMaximumParticleSystemLocation;     // 0x988(0xc)
	struct Rotator                                               MechanismReachedMaximumParticleSystemRotation;     // 0x994(0xc)
	float                                                        CompletionThreshold;                               // 0x9a0(0x4)
	class ParticleSystemComponent*                               CachedMechanismMovingParticleSystem;               // 0x9a8(0x8)
};


// Size 0x180 (Full Size[0x5c0] - InheritedSize[0x440]
class SwimmingCreatureAnimationInstance: public AnimInstance
{
public:
	float                                                        Speed;                                             // 0x458(0x4)
	float                                                        PlayRate;                                          // 0x45c(0x4)
	float                                                        Direction;                                         // 0x460(0x4)
	class AnimMontage*                                           DeathMontage;                                      // 0x468(0x8)
	class AnimMontage*                                           SinkingMontage;                                    // 0x470(0x8)
	class AnimSequenceBase*                                      DefaultImpactAnim;                                 // 0x478(0x8)
	TArray<struct SwimmingCreatureImpactAnimData>                ImpactAnims;                                       // 0x480(0x10)
	float                                                        MaxAccelerationForSpeed;                           // 0x490(0x4)
	float                                                        MaxPitchForSpeed;                                  // 0x494(0x4)
	float                                                        MaxYawForDirection;                                // 0x498(0x4)
	float                                                        SpeedSmoothingFactor;                              // 0x49c(0x4)
	float                                                        DirectionSmoothingFactor;                          // 0x4a0(0x4)
	float                                                        AccelerationSmoothingFactor;                       // 0x4a4(0x4)
	float                                                        YawSmoothingFactor;                                // 0x4a8(0x4)
	float                                                        NetworkAnimationBlendTime;                         // 0x4ac(0x4)
	TArray<class Object*>                                        RPCPlayableMontages;                               // 0x4b0(0x10)
	TArray<class AnimSequenceBase*>                              NetworkPlayableAnimations;                         // 0x4c0(0x10)
	TArray<struct AIStrategySpeedOverride>                       StrategySpeedOverrides;                            // 0x4d0(0x10)
	TArray<class Class*>                                         HitReactBlockingAIStrategies;                      // 0x4e0(0x10)
	class AnimMontage*                                           CurrentlyPlayingNetworkMontage;                    // 0x4f0(0x8)
	class SwimmingCreatureMovementComponent*                     MovementComponent;                                 // 0x598(0x8)
	class NetworkSyncedAnimationComponent*                       NetworkSyncedAnimationComponent;                   // 0x5b8(0x8)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class MechanismAnimation: public DataAsset
{
public:
	TArray<class MechanismOneShotEvent*>                         AnimationStartedEvents;                            // 0x28(0x10)
	TArray<class MechanismAnimationEvent*>                       Events;                                            // 0x38(0x10)
	TArray<class MechanismOneShotEvent*>                         AnimationStoppedEvents;                            // 0x48(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class IsPlayModeStatCondition: public StatCondition
{
public:
	char                                                         PlayMode;                                          // 0x28(0x1)
};


// Size 0x60 (Full Size[0x1d0] - InheritedSize[0x170]
class EnvQueryTest_InsideWorldBounds: public EnvQueryTest
{
public:
	struct AIDataProviderFloatValue                              Radius;                                            // 0x170(0x30)
	struct AIDataProviderBoolValue                               IsShroudbreakerOnShip;                             // 0x1a0(0x30)
};


// Size 0x10 (Full Size[0xa0] - InheritedSize[0x90]
class AIFormWithVFXDataAsset: public AthenaAIFormDataAsset
{
public:
	class ParticleSystem*                                        ParticlesTemplate;                                 // 0x90(0x8)
	float                                                        ParticleActivationDelay;                           // 0x98(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class StorageContainerContentModifierDataAsset: public DataAsset
{
public:
	TArray<struct StorageContainerContentModifierEntry>          ModifierEntries;                                   // 0x28(0x10)
};


// Size 0x30 (Full Size[0x680] - InheritedSize[0x650]
class SplineWithEmitterComponent: public SplineComponent
{
public:
	class WwiseObjectPoolWrapper*                                SplineAudioPool;                                   // 0x648(0x8)
	class WwiseEvent*                                            LoopingSoundPlayEvent;                             // 0x650(0x8)
	class WwiseEvent*                                            LoopingSoundStopEvent;                             // 0x658(0x8)
	class WwiseEmitterComponent*                                 WwiseEmitterComponent;                             // 0x660(0x8)
};


// Size 0x8 (Full Size[0x178] - InheritedSize[0x170]
class EnvQueryTest_InSunkenIslandSurfaceZone: public EnvQueryTest
{
public:
	class UClass*                                                ExclusionType;                                     // 0x170(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ItemProxyShipTrackerComponentDataAsset: public DataAsset
{
public:
	TArray<class Class*>                                         ShipTypes;                                         // 0x28(0x10)
};


// Size 0x118 (Full Size[0x188] - InheritedSize[0x70]
class BTService_ObserveTargetMeleeAttacks: public BTService
{
public:
	struct BlackboardKeySelector                                 TargetActorKey;                                    // 0x70(0x28)
	struct BlackboardKeySelector                                 IsTargetAttackingResultKey;                        // 0x98(0x28)
};


// Size 0x98 (Full Size[0x110] - InheritedSize[0x78]
class WorldEndAIAbility: public AthenaAIAbility
{
public:
	class Pawn*                                                  Owner;                                             // 0x78(0x8)
	class WorldEndAIAbilityParams*                               SetupAbilityParams;                                // 0x80(0x8)
	class AshenLordVolcano*                                      VolcanicEmitter;                                   // 0x88(0x8)
	class GeyserManager*                                         GeyserManager;                                     // 0x90(0x8)
	struct AshenLordFireShroud                                   FireShroud;                                        // 0x98(0x20)
	class SuperheatedWater*                                      OwnedSuperHeatedWater;                             // 0xb8(0x8)
	class UClass*                                                LoadedCloudAsset;                                  // 0xc0(0x8)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class RemoveFlameOfFateTypeStep: public TaleQuestStep
{
public:
	class RemoveFlameOfFateTypeStepDesc*                         Desc;                                              // 0x98(0x8)
};


// Size 0x1e0 (Full Size[0x760] - InheritedSize[0x580]
class AthenaWorldSettings: public WorldSettings
{
public:
	struct Vector2D                                              WorldMax;                                          // 0x5f0(0x8)
	struct Vector2D                                              WorldMapMin;                                       // 0x5f8(0x8)
	struct Vector2D                                              WorldMapMax;                                       // 0x600(0x8)
	float                                                        AdventureDistanceFromWorldSafeRegionEdgeToKillZone; // 0x60c(0x4)
	float                                                        ArenaDistanceFromWorldSafeRegionEdgeToKillZone;    // 0x610(0x4)
	float                                                        EndOfWorldWarningOffset;                           // 0x614(0x4)
	float                                                        AdventureDistanceFromWorldSafeRegionEdgeToFullStrainAndLighting; // 0x61c(0x4)
	float                                                        ArenaDistanceFromWorldSafeRegionEdgeToFullStrainAndLighting; // 0x620(0x4)
	int                                                          EndOfWorldWarningLightingIndex;                    // 0x624(0x4)
	class BuoyantObjectSpawnParamsDataAsset*                     BuoyantObjectSpawnParams;                          // 0x628(0x8)
	class SeaFortsWorldDataAsset*                                SeaFortsData;                                      // 0x630(0x8)
	class SeaRockDataAsset*                                      SeaRockLocations;                                  // 0x638(0x8)
	struct StringAssetReference                                  TradeRoutes;                                       // 0x640(0x10)
	TArray<struct AthenaStreamedLevelItem>                       ManuallyStreamedLevels;                            // 0x650(0x10)
	class TunnelWorldConfig*                                     TunnelWorldConfig;                                 // 0x660(0x8)
	class SpireStreamedLevelDataAsset*                           SpireLevels;                                       // 0x668(0x8)
	struct KrakenWorldSettingsParams                             KrakenParams;                                      // 0x670(0x1)
	struct TinySharkWorldSettingsParams                          TinySharkParams;                                   // 0x671(0x1)
	struct AIShipWorldSettings                                   AIShipParams;                                      // 0x678(0x18)
	class InvasionLocationsDataAsset*                            InvasionLocationsDataAsset;                        // 0x690(0x8)
	class IslandDataAsset*                                       IslandDataAsset;                                   // 0x698(0x8)
	class PrebakedIslandAsset*                                   PrebakedIslandData;                                // 0x6a0(0x8)
	class MapTableCanvasDataAsset*                               MapTableCanvasData;                                // 0x6a8(0x8)
	class VoyageDescDataAsset*                                   TutorialTale;                                      // 0x6b0(0x8)
	class VoyageDescDataAsset*                                   ScuttleShipVoyageDescAsset;                        // 0x6b8(0x8)
	float                                                        DevilsShroudPlayerDamageMaxDamage;                 // 0x6c0(0x4)
	bool                                                         AllowCompanyOnboardingTutorial;                    // 0x6c4(0x1)
	bool                                                         AllowContextualTutorial;                           // 0x6c5(0x1)
	bool                                                         ShowMapTable;                                      // 0x6c6(0x1)
	bool                                                         UseDevDefinition;                                  // 0x6c7(0x1)
	bool                                                         EnableGlobalVoyages;                               // 0x6c8(0x1)
	class GlobalVoyageOverrideAsset*                             GlobalVoyageOverrideAsset;                         // 0x6d0(0x8)
	TArray<class Class*>                                         NPCOnBeachVoyageCheckpoints;                       // 0x6d8(0x10)
	float                                                        ServerChatMessageStickyTime;                       // 0x6e8(0x4)
	float                                                        SaferSeasServerChatMessageStickyTime;              // 0x6ec(0x4)
	bool                                                         UseGameEventSchedulerRemoteServices;               // 0x6f0(0x1)
	class GameEventSchedulerSettingsAsset*                       DefaultGameEventSchedulerSettings;                 // 0x6f8(0x8)
	TArray<struct AthenaWorldSettingsGameEventSchedulerSettingsConfiguration> GameEventSchedulerSettingsConfigurations;          // 0x700(0x10)
	class StormServiceAsset*                                     StormServiceSettings;                              // 0x710(0x8)
	TArray<struct WorldSafeZone>                                 SafeZonesIncludingRequiresShroudBreaker;           // 0x718(0x10)
	TArray<struct WorldSafeZone>                                 SafeZonesExcludingRequiresShroudBreaker;           // 0x728(0x10)
	TArray<struct WorldSafeZone>                                 MainWorldSafeZones;                                // 0x738(0x10)
	TArray<struct WorldSafeZone>                                 OverridingSafeZones;                               // 0x748(0x10)
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class HealthRegenerationPoolComponent: public ActorComponent
{
public:
	float                                                        MaxCapacity;                                       // 0xd0(0x4)
	float                                                        HealingRate;                                       // 0xd4(0x4)
	float                                                        HealingDelayWhenDamaged;                           // 0xd8(0x4)
	double                                                       UIUpdateThrottleMs;                                // 0xe0(0x8)
	struct HealthRegenState                                      RegenerationState;                                 // 0x120(0x8)
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class AthenaCharacterDodgeComponent: public ActorComponent
{
public:
	struct AthenaCharacterDodgeParams                            Params;                                            // 0xc8(0x10)
	float                                                        ConsecutiveDodgeCountResetTimer;                   // 0xd8(0x4)
	class CurveFloat*                                            BunnyHoppingScalarCurve;                           // 0xe0(0x8)
	class AthenaCharacter*                                       Character;                                         // 0xe8(0x8)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class DelayStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        Delay;                                             // 0x80(0x4)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class NPCDialogHeaderStorageContainer: public NPCDialogHeader
{
public:
	struct FText                                                 Text;                                              // 0x28(0x38)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class TunnelPresenterObjectBase: public Object
{
public:
	class UClass*                                                ShipSize;                                          // 0x28(0x8)
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class UsableWieldableComponent: public ActorComponent
{
public:
	TArray<struct OneShotInput>                                  OneShotInputNotifications;                         // 0xd8(0x10)
	TArray<struct HoldToUseInput>                                ContinuousUseNotification;                         // 0xe8(0x10)
	bool                                                         PreventOverlappingContinuousUses;                  // 0xf8(0x1)
	TArray<class Class*>                                         NotificationIdsToIgnore;                           // 0x100(0x10)
	TArray<class Class*>                                         CurrentlyActiveNotifications;                      // 0x110(0x10)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class LockOnCameraModifierSettings: public DataAsset
{
public:
	bool                                                         BlockLowerPriorityCameraModifiers;                 // 0x28(0x1)
	bool                                                         DisablePlayerInputDuringLockOn;                    // 0x29(0x1)
	struct FName                                                 TargetSocketName;                                  // 0x2c(0x8)
	float                                                        YawSnapStrength;                                   // 0x34(0x4)
	float                                                        PitchSnapStrength;                                 // 0x38(0x4)
	float                                                        MinYawLerpSpeed;                                   // 0x3c(0x4)
	bool                                                         LockOnScaledByInput;                               // 0x40(0x1)
	float                                                        InputYawToScaleTo;                                 // 0x44(0x4)
	float                                                        InputTowardsTarget_LockOnScale;                    // 0x48(0x4)
	float                                                        ZeroInput_LockOnScale;                             // 0x4c(0x4)
	float                                                        InputAwayFromTarget_LockOnScale;                   // 0x50(0x4)
	bool                                                         AutoLockAllowed;                                   // 0x54(0x1)
	bool                                                         LimitLockOnByInput;                                // 0x55(0x1)
	float                                                        InputAwayFromTarget_LockOnClampMultiplier;         // 0x58(0x4)
	bool                                                         FadeOutEnabled;                                    // 0x5c(0x1)
	float                                                        FullLockDuration;                                  // 0x60(0x4)
	float                                                        FadeOutDuration;                                   // 0x64(0x4)
};


// Size 0x250 (Full Size[0x278] - InheritedSize[0x28]
class MeleeAttackDataAsset: public DataAsset
{
public:
	struct FName                                                 AttackName;                                        // 0x28(0x8)
	float                                                        WarmUpDuration;                                    // 0x30(0x4)
	float                                                        StrikeDuration;                                    // 0x34(0x4)
	float                                                        RecoverMissDuration;                               // 0x38(0x4)
	float                                                        RecoverHitDuration;                                // 0x3c(0x4)
	float                                                        LungeMoveStartTime;                                // 0x40(0x4)
	float                                                        LungeMoveDuration;                                 // 0x44(0x4)
	float                                                        LungeMoveMaxSpeed;                                 // 0x48(0x4)
	char                                                         AttackMoveSpeed;                                   // 0x4c(0x1)
	float                                                        AttackMoveSpeedDeactivationAllowedWindow;          // 0x50(0x4)
	float                                                        ComboTime;                                         // 0x54(0x4)
	bool                                                         DefenderKnockbackEnabled;                          // 0x58(0x1)
	struct KnockBackInfo                                         DefenderKnockback;                                 // 0x5c(0x54)
	bool                                                         DefenderKnockbackWhenBlockingEnabled;              // 0xb0(0x1)
	struct KnockBackInfo                                         DefenderKnockbackWhenBlocking;                     // 0xb4(0x54)
	bool                                                         AttackerKnockbackEnabled;                          // 0x108(0x1)
	struct KnockBackInfo                                         AttackerKnockback;                                 // 0x10c(0x54)
	bool                                                         AttackerKnockbackWhenBlockingEnabled;              // 0x160(0x1)
	struct KnockBackInfo                                         AttackerKnockbackWhenBlocking;                     // 0x164(0x54)
	bool                                                         LockOnEnabled;                                     // 0x1b8(0x1)
	struct AttackTimingWindow                                    UninterruptableWindow;                             // 0x1bc(0x8)
	float                                                        HitStartRange;                                     // 0x1c4(0x4)
	float                                                        HitEndRange;                                       // 0x1c8(0x4)
	float                                                        HitStartAngle;                                     // 0x1cc(0x4)
	float                                                        HitAngleDelta;                                     // 0x1d0(0x4)
	float                                                        HitSphereRadius;                                   // 0x1d4(0x4)
	float                                                        HitTimeOffset;                                     // 0x1d8(0x4)
	float                                                        HitDuration;                                       // 0x1dc(0x4)
	TArray<struct HitDetectionParamsOverride>                    HitDetectionParamsOverrides;                       // 0x1e0(0x10)
	float                                                        AttackDamage;                                      // 0x1f0(0x4)
	class UClass*                                                DamagerType;                                       // 0x1f8(0x8)
	char                                                         HealthChangeReason;                                // 0x200(0x1)
	bool                                                         IsUnblockable;                                     // 0x201(0x1)
	bool                                                         StunOnMiss;                                        // 0x202(0x1)
	TArray<struct StunAttackerOnHitSurfacePair>                  StunAttackerOnHitSurfaces;                         // 0x208(0x10)
	bool                                                         StunOnHit;                                         // 0x218(0x1)
	float                                                        StunOnHitDurationPlayer;                           // 0x21c(0x4)
	float                                                        StunOnHitDurationCharacter;                        // 0x220(0x4)
	char                                                         AnimationLookupType;                               // 0x224(0x1)
	uint32                                                       AnimationLookupIndex;                              // 0x228(0x4)
	char                                                         AnimationType;                                     // 0x22c(0x1)
	class UClass*                                                ImpactId;                                          // 0x230(0x8)
	class UClass*                                                AttackerHitLandedCameraShake;                      // 0x238(0x8)
	class ForceFeedbackEffect*                                   AttackerHitLandedForceFeedbackEffect;              // 0x240(0x8)
	class UClass*                                                DefenderHitReceivedCameraShake;                    // 0x248(0x8)
	class ForceFeedbackEffect*                                   DefenderHitReceivedForceFeedbackEffect;            // 0x250(0x8)
	float                                                        ClampYawRange;                                     // 0x258(0x4)
	float                                                        ClampYawRate;                                      // 0x25c(0x4)
	struct Status                                                AppliedStatusOnHit;                                // 0x260(0x18)
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class CompanyService: public Object
{
public:
	TArray<class CompanyData*>                                   CompanyData;                                       // 0x38(0x10)
	map                                                          CompanyMap;                                        // 0x48(0x50)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class CircleMapSettings: public DeveloperSettings
{
public:
	struct StringAssetReference                                  CircleMapItemDescClass;                            // 0x38(0x10)
};


// Size 0x180 (Full Size[0x548] - InheritedSize[0x3c8]
class NPCOnSurface: public Actor
{
public:
	bool                                                         CanDamagePlayers;                                  // 0x3d8(0x1)
	class NPCOnSurfaceVODataAsset*                               VODataAsset;                                       // 0x3e0(0x8)
	struct FText                                                 NPCName;                                           // 0x3e8(0x38)
	class WwiseObjectPoolWrapper*                                Pool;                                              // 0x420(0x8)
	class SkeletalMeshComponent*                                 Mesh;                                              // 0x428(0x8)
	class WwiseEmitterComponent*                                 Emitter;                                           // 0x430(0x8)
	class CutSceneSubtitlesComponent*                            CutSceneSubtitlesComponent;                        // 0x438(0x8)
	class CustomAnimationMontageComponent*                       CustomAnimationMontageComponent;                   // 0x440(0x8)
	struct StringAssetReference                                  CurrentAnimInstance;                               // 0x448(0x10)
	bool                                                         IsPlayerCurrentlyNearNPC;                          // 0x458(0x1)
	multicastinlinedelegate                                      OnNPCSpawnedCallback;                              // 0x500(0x10)
};


// Size 0x80 (Full Size[0x448] - InheritedSize[0x3c8]
class WaveBasedMechanismVisualController: public Actor
{
public:
	class MechanismActionComponent*                              MechanismActionComponent;                          // 0x3c8(0x8)
	TArray<class Actor*>                                         WaveVisualActors;                                  // 0x3d0(0x10)
	struct FName                                                 StaticMeshDynamicMaterialTag;                      // 0x3e0(0x8)
	class CurveFloat*                                            ScalarParameterCurve;                              // 0x3e8(0x8)
	struct FName                                                 MaterialScalarParameterName;                       // 0x3f0(0x8)
	float                                                        NewWaveDelay;                                      // 0x3f8(0x4)
	int                                                          WaveIndex;                                         // 0x3fc(0x4)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0x410(0x10)
	TArray<class MaterialInstanceDynamic*>                       MaterialsToTransition;                             // 0x430(0x10)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class FortAIToggler: public Object
{
public:
	TArray<struct FortTogglerUnit>                               FortUnits;                                         // 0x68(0x10)
	class Object*                                                WorldContext;                                      // 0x78(0x8)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class SetSpawnProgressStep: public TaleQuestStep
{
public:
	class SetSpawnProgressStepDesc*                              StepDesc;                                          // 0x98(0x8)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class AddIslandToVoyageHistoryStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableName                                     IslandName;                                        // 0x80(0x30)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class LightingZoneService: public Object
{
public:
	TArray<class Interface*>                                     RegisteredLightingZones;                           // 0x30(0x10)
};


// Size 0xd8 (Full Size[0x1a0] - InheritedSize[0xc8]
class WaterSplashComponent: public ActorComponent
{
public:
	multicastinlinedelegate                                      OnEnteredWater;                                    // 0xc8(0x10)
	multicastinlinedelegate                                      OnExitedWater;                                     // 0xd8(0x10)
	multicastinlinedelegate                                      OnReachedTooDeepToExist;                           // 0xe8(0x10)
	class Object*                                                EnterWaterParticleSystem;                          // 0x100(0x8)
	class WwiseEvent*                                            EnterWaterSfx;                                     // 0x108(0x8)
	class WwiseObjectPoolWrapper*                                EnterWaterSfxWisePoolToUse;                        // 0x110(0x8)
	class Object*                                                ExitWaterParticleSystem;                           // 0x118(0x8)
	class WwiseEvent*                                            ExitWaterSfx;                                      // 0x120(0x8)
	class WwiseObjectPoolWrapper*                                ExitWaterSfxWisePoolToUse;                         // 0x128(0x8)
	char                                                         ParticleSystemAttachLocation;                      // 0x130(0x1)
	bool                                                         UseComplexWaterHeightDetection;                    // 0x131(0x1)
	bool                                                         SpawnParticleSystemsAttached;                      // 0x132(0x1)
	bool                                                         SpawnParticleSystemsAlignedVertically;             // 0x133(0x1)
	bool                                                         TriggerOnEntry;                                    // 0x134(0x1)
	bool                                                         TriggerOnExit;                                     // 0x135(0x1)
	bool                                                         AllowRepeatedEntryTriggers;                        // 0x136(0x1)
	bool                                                         AllowRepeatedExitTriggers;                         // 0x137(0x1)
	float                                                        DeepWaterThreshold;                                // 0x138(0x4)
	float                                                        OceanFloorThreshold;                               // 0x13c(0x4)
	float                                                        MinimumFallDistance;                               // 0x140(0x4)
};


// Size 0x108 (Full Size[0x1d0] - InheritedSize[0xc8]
class ShipLightComponent: public ActorComponent
{
public:
	TArray<char>                                                 DormantShipRegions;                                // 0xd0(0x10)
	bool                                                         ExposeToNetProxy;                                  // 0xe0(0x1)
	int                                                          NetProxyBitIndex;                                  // 0xe4(0x4)
	class InteractableLightParameters*                           LightParameters;                                   // 0xe8(0x8)
	bool                                                         LightIsOn_Server;                                  // 0xf1(0x1)
	TArray<class PointLightComponent*>                           Lights;                                            // 0x108(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class VaultPuzzleDataAsset: public DataAsset
{
public:
	TArray<struct VaultPuzzleSolutionEntry>                      SolutionSets;                                      // 0x28(0x10)
	char                                                         AudioSetting;                                      // 0x38(0x1)
	bool                                                         RequiresOpenDoor;                                  // 0x39(0x1)
	bool                                                         ShouldFillWithWater;                               // 0x3a(0x1)
	bool                                                         RequiresPuzzleSolution;                            // 0x3b(0x1)
	bool                                                         ShouldExtinguishBraziersOnComplete;                // 0x3c(0x1)
	bool                                                         ShouldOpenRewardDoorOnComplete;                    // 0x3d(0x1)
	TArray<float>                                                FillRateOverrides;                                 // 0x40(0x10)
};


// Size 0x108 (Full Size[0x130] - InheritedSize[0x28]
class WorldResourceRegistry: public Object
{
public:
	map                                                          ActorsById;                                        // 0x30(0x50)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class GlobalVoyageDirectorServiceSettings: public DeveloperSettings
{
public:
	TArray<struct DirectorSettingEntry>                          DefaultGlobalVoyages;                              // 0x38(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class VaultMaterialSetDataAsset: public DataAsset
{
public:
	TArray<struct BlockDecalMaterials>                           BlockConfigurations;                               // 0x28(0x10)
};


// Size 0x10 (Full Size[0x640] - InheritedSize[0x630]
class ClusterStaticMeshComponent: public StaticMeshComponent
{
public:
	class ItemDescSpawnData*                                     ItemDescSpawnData;                                 // 0x630(0x8)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class StatProgressStepDesc: public TaleQuestStepDesc
{
public:
	struct PlayerStat                                            Stat;                                              // 0x80(0x4)
};


// Size 0x48 (Full Size[0xd0] - InheritedSize[0x88]
class AthenaGameInstance: public GameInstance
{
public:
	class AthenaPlayModeLevelsDataAsset*                         AdditionalPlayModeLevels;                          // 0x90(0x8)
	uint64                                                       NumLevels;                                         // 0x98(0x8)
	class AthenaGameContext*                                     GameContext;                                       // 0xa0(0x8)
};


// Size 0x190 (Full Size[0x258] - InheritedSize[0xc8]
class ShipPersistenceComponent: public ActorComponent
{
public:
	class PersistenceIdentifierSettingsAsset*                    PersistenceIdentifierSettingsAsset;                // 0xd0(0x8)
	struct ShipCaptainedSessionData                              CaptaincyData;                                     // 0xd8(0x58)
	struct Guid                                                  ReplicatedCrewId;                                  // 0x130(0x10)
	struct ShipPersistenceModel                                  ShipModel;                                         // 0x140(0x50)
	struct ShipLoadoutPersistenceModel                           ShipLoadoutModel;                                  // 0x190(0x40)
	char                                                         LoadoutPersistence;                                // 0x1d0(0x1)
};


// Size 0x48 (Full Size[0x78] - InheritedSize[0x30]
class PledgeToReapersVoteValidator: public VoteValidatorInlineBase
{
public:
	class VoteConsumerInlineBase*                                Consumer;                                          // 0x30(0x8)
	class Actor*                                                 OwningActor;                                       // 0x38(0x8)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestReleaseVaultStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableTaleResourceHandle                       VaultHandleVar;                                    // 0x80(0x30)
};


// Size 0x30 (Full Size[0x3f8] - InheritedSize[0x3c8]
class DamageableProjectileLauncherMechanism: public Actor
{
public:
	class SceneComponent*                                        Root;                                              // 0x3d0(0x8)
	class ProjectileLauncherMechanismSourceComponent*            ProjectileLauncher;                                // 0x3d8(0x8)
	class DamageableComponent*                                   DamageableComponent;                               // 0x3e0(0x8)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class NPCDialogPredicateIsTrue: public NPCDialogPredicate
{
public:
	struct FName                                                 ParameterName;                                     // 0x38(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ImpactSettings: public Object
{
public:
	struct StringAssetReference                                  ImpactListAssetRef;                                // 0x28(0x10)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class ShipDescAsset: public Object
{
public:
	struct ShipDesc                                              Desc;                                              // 0x28(0x48)
};


// Size 0x28 (Full Size[0x90] - InheritedSize[0x68]
class BTDecorator_CanRepair: public BTDecorator_BaseConditional
{
public:
	struct BlackboardKeySelector                                 RepairActor;                                       // 0x68(0x28)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class PremiumCatalogDataAsset: public DataAsset
{
public:
	struct Guid                                                  CatalogId;                                         // 0x28(0x10)
	struct FText                                                 DisplayName;                                       // 0x38(0x38)
	TArray<struct PremiumCatalogLandingPageTab>                  Tabs;                                              // 0x70(0x10)
	bool                                                         Archive;                                           // 0x80(0x1)
};


// Size 0x100 (Full Size[0x1c8] - InheritedSize[0xc8]
class DrowningComponent: public ActorComponent
{
public:
	class DrowningComponentParams*                               Params;                                            // 0xd0(0x8)
	struct BlendableDrowningParams                               DrowningParams;                                    // 0xd8(0x28)
	class ParticleSystemComponent*                               BubbleVFXComponent;                                // 0x100(0x8)
	class ParticleSystemComponent*                               ExtraBubblesFirstPersonVFXComponent;               // 0x108(0x8)
	float                                                        OxygenLevel;                                       // 0x110(0x4)
	char                                                         ServerDrowningState;                               // 0x168(0x1)
	class Actor*                                                 OwnerCharacter;                                    // 0x170(0x8)
	class HealthComponent*                                       OwnerHealthComponent;                              // 0x178(0x8)
	bool                                                         IsDrowningDisabled;                                // 0x190(0x1)
};


// Size 0xf0 (Full Size[0x4b8] - InheritedSize[0x3c8]
class OneShotToggleCollisionAction: public Actor
{
public:
	class SceneComponent*                                        CollisionActionRoot;                               // 0x3c8(0x8)
	class PrimitiveComponent*                                    BlockingPrimitive;                                 // 0x3d0(0x8)
	class MechanismActionComponent*                              MechanismActionComponent;                          // 0x3d8(0x8)
	class ArrowComponent*                                        KnockbackArrowComponent;                           // 0x3e0(0x8)
	bool                                                         UseInactiveCollisionProfileByDefault;              // 0x3e8(0x1)
	struct KnockBackInfo                                         KnockBackInfo;                                     // 0x3ec(0x54)
	float                                                        KnockbackGracePeriod;                              // 0x440(0x4)
	struct CollisionProfileName                                  InactiveCollisionProfileName;                      // 0x444(0x8)
	struct CollisionProfileName                                  ActiveCollisionProfileName;                        // 0x44c(0x8)
	struct OneShotToggleCollisionAudioParams                     AudioParams;                                       // 0x458(0x38)
};


// Size 0x100 (Full Size[0x8f0] - InheritedSize[0x7f0]
class Compass: public PoseableMeshWieldableItem
{
public:
	class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x7f0(0x8)
	class CompassSpinComponent*                                  SpinComponent;                                     // 0x7f8(0x8)
	class NarratedCompassDirectionComponent*                     NarratedCompassDirectionComponent;                 // 0x800(0x8)
	class PoseableMeshComponent*                                 MeshToUse;                                         // 0x808(0x8)
};


// Size 0x250 (Full Size[0x690] - InheritedSize[0x440]
class NPCAnimInstance: public AnimInstance
{
public:
	class Actor*                                                 LeftHandObject;                                    // 0x470(0x8)
	class Actor*                                                 RightHandObject;                                   // 0x478(0x8)
	class NPCHeldObjectData*                                     HeldObjectList;                                    // 0x480(0x8)
	class SkeletalMeshComponent*                                 NPCSkeletalMesh;                                   // 0x488(0x8)
	TArray<class Actor*>                                         InitialSpawnedCosmeticItems;                       // 0x490(0x10)
	struct HitReactionAnimationState                             HitReactionState;                                  // 0x4a0(0x28)
	struct HitReactionAnimationData                              HitReactionData;                                   // 0x4c8(0x8)
	bool                                                         LookAtActive;                                      // 0x4d0(0x1)
	bool                                                         CustomAnimationLookAtActive;                       // 0x4d1(0x1)
	float                                                        LookAtIKAlpha;                                     // 0x4d4(0x4)
	float                                                        LookAtEnabledInterpolationTime;                    // 0x4d8(0x4)
	float                                                        LookAtDisabledInterpolationTime;                   // 0x4dc(0x4)
	bool                                                         DisableLookAt;                                     // 0x4e0(0x1)
	float                                                        MinimumRunSpeed;                                   // 0x4e4(0x4)
	class NPCCustomAnimationDataAsset*                           NPCCustomAnimationData;                            // 0x4e8(0x8)
	struct NPCCustomAnimationBlueprintData                       NPCCustomAnimationBlueprintData;                   // 0x4f0(0x68)
	bool                                                         InitialSpawnedCosmeticItemsActive;                 // 0x558(0x1)
	class AnimMontage*                                           NPCCustomAnimationCurrentMontage;                  // 0x560(0x8)
	class AnimMontage*                                           NPCCustomAnimationCurrentFacialAdditiveMontage;    // 0x568(0x8)
	TArray<class AnimSequence*>                                  IdleVariantAnims;                                  // 0x570(0x10)
	TArray<class AnimSequence*>                                  InactiveVariantAnims;                              // 0x580(0x10)
	TArray<class AnimSequence*>                                  InteractVariantAnims;                              // 0x590(0x10)
	struct NPCAnimationIdlesVariantStruct                        NPCAllocatedIdleAnimations;                        // 0x5a0(0x20)
	struct NPCAnimationResponseIdlesVariantStruct                NPCAllocatedInteractResponseAnimations;            // 0x5c0(0x10)
	class NPCInteractAnimResponseDataAsset*                      NPCInteractAnimResponseDataAsset;                  // 0x5d0(0x8)
	class UClass*                                                CurrentInteractResponse;                           // 0x5d8(0x8)
	float                                                        InteractResponseEntryTime;                         // 0x5e0(0x4)
	bool                                                         ResetInteractResponse;                             // 0x5e4(0x1)
	bool                                                         IsReacting;                                        // 0x5e5(0x1)
	class AnimSequence*                                          DefaultInteractionResponseStateAnim;               // 0x5e8(0x8)
	class AnimSequence*                                          PositiveInteractionResponseStateAnim;              // 0x5f0(0x8)
	class AnimSequence*                                          NegitiveInteractionResponseStateAnim;              // 0x5f8(0x8)
	bool                                                         Active;                                            // 0x600(0x1)
	bool                                                         Interacting;                                       // 0x601(0x1)
	float                                                        DotProductFOV;                                     // 0x604(0x4)
	char                                                         PreviousCustomAnimationState;                      // 0x608(0x1)
	bool                                                         UseLookAt;                                         // 0x609(0x1)
	bool                                                         SafeUseLookAt;                                     // 0x60a(0x1)
	struct Vector                                                LookAtPlayerPosition;                              // 0x60c(0xc)
	bool                                                         PlayerCharacterIsValid;                            // 0x618(0x1)
	bool                                                         IsPlayingSequencerAnim;                            // 0x619(0x1)
	bool                                                         IsOffering;                                        // 0x61a(0x1)
	bool                                                         IsShowingOffer;                                    // 0x61b(0x1)
	bool                                                         IsMoving;                                          // 0x61c(0x1)
	bool                                                         IsRunning;                                         // 0x61d(0x1)
	float                                                        MovementSpeed;                                     // 0x620(0x4)
	bool                                                         IsTalking;                                         // 0x624(0x1)
	bool                                                         ShouldIdleWhileInteracting;                        // 0x625(0x1)
	bool                                                         CanGoInactive;                                     // 0x626(0x1)
	float                                                        InteractionRange;                                  // 0x65c(0x4)
	bool                                                         UseTalkingAdditive;                                // 0x660(0x1)
	float                                                        TalkingAdditiveAlpha;                              // 0x664(0x4)
	float                                                        InactiveStateSupressionTime;                       // 0x668(0x4)
	class Character*                                             PlayerCharacter;                                   // 0x670(0x8)
};


// Size 0x18 (Full Size[0xe0] - InheritedSize[0xc8]
class CharacterVfxComponent: public ActorComponent
{
public:
	class ParticleSystemComponent*                               WindVFX;                                           // 0xc8(0x8)
	class AthenaPlayerCharacter*                                 OwnerCharacter;                                    // 0xd0(0x8)
};


// Size 0x30 (Full Size[0x3f8] - InheritedSize[0x3c8]
class UserSettingsService: public Actor
{
public:
	TArray<struct PlayerUserSettings>                            PlayerUserSettings;                                // 0x3d0(0x10)
};


// Size 0x10 (Full Size[0x70] - InheritedSize[0x60]
class BlockEarthquakeTaleQuestService: public TaleQuestService
{
public:
	class BlockEarthquakeTaleQuestServiceDesc*                   Desc;                                              // 0x60(0x8)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class StatusResponseHealthChange: public StatusResponse
{
public:
	float                                                        HealthChangeAmount;                                // 0x30(0x4)
	char                                                         HealthChangedReason;                               // 0x34(0x1)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class BedPartDescAsset: public ShipPartDescAsset
{
public:
	struct BedPartDesc                                           BedPartDesc;                                       // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class CoherentUIGTAssetContainer: public DataAsset
{
public:
	TArray<class Texture2D*>                                     TextureAssets;                                     // 0x28(0x10)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class CapstanDescAsset: public ShipPartDescAsset
{
public:
	struct CapstanDesc                                           CapstanDesc;                                       // 0x28(0x48)
};


// Size 0x10 (Full Size[0x408] - InheritedSize[0x3f8]
class SpawnLocation: public PlayerStart
{
public:
	struct FString                                               Description;                                       // 0x3f8(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class LogicalNotStatCondition: public StatCondition
{
public:
	class StatCondition*                                         StatCondition;                                     // 0x28(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class EmblemReward: public Reward
{
public:
	struct EmblemId                                              EmblemId;                                          // 0x28(0x18)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class RammableExplosiveDataAsset: public DataAsset
{
public:
	TArray<struct RammableExplosiveEntry>                        ExplosiveSpeedParams;                              // 0x28(0x10)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class PLQuestLocationDataAsset: public DataAsset
{
public:
	assetobject                                                  StartLocationActor;                                // 0x28(0x20)
	assetobject                                                  EndLocationActor;                                  // 0x48(0x20)
	struct FName                                                 PageAuthorName;                                    // 0x68(0x8)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class RemoveMechanismTriggerStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    Action;                                            // 0x80(0x30)
	struct QuestVariableActor                                    Trigger;                                           // 0xb0(0x30)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class TaleQuestLockCaptainCabinDoorStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableShipwreck                                Shipwreck;                                         // 0x80(0x30)
	struct QuestVariableItemInfo                                 CabinKey;                                          // 0xb0(0x30)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class CoordinatedCutsceneTriggerStatsAsset: public DataAsset
{
public:
	TArray<struct CoordinatedCutsceneTriggerStat>                StatsToFire;                                       // 0x28(0x10)
};


// Size 0xb0 (Full Size[0x4f0] - InheritedSize[0x440]
class FishAnimationInstance: public AnimInstance
{
public:
	class SkeletalMesh*                                          FishSkeletalMesh;                                  // 0x440(0x8)
	class FishingFish*                                           FishingFishCharacter;                              // 0x448(0x8)
	struct FishAnimationParams                                   FishingFishAnimationParams;                        // 0x450(0x8)
	struct FishAnimationSequences                                FishAnimationSequences;                            // 0x458(0x88)
	bool                                                         IsJumpActive;                                      // 0x4e0(0x1)
	bool                                                         IsOnSurface;                                       // 0x4e1(0x1)
	bool                                                         FishIsCaught;                                      // 0x4e2(0x1)
	class AnimMontage*                                           CurrentPlayingMontage;                             // 0x4e8(0x8)
};


// Size 0x18 (Full Size[0x3e0] - InheritedSize[0x3c8]
class PlayerStreamedLevelActor: public Actor
{
public:
	TArray<class SpawnLocation*>                                 AssociatedSpawnLocations;                          // 0x3c8(0x10)
	char                                                         StreamedLevelIdentity;                             // 0x3d8(0x1)
};


// Size 0x20 (Full Size[0xa0] - InheritedSize[0x80]
class MermaidPartsDesc: public MeshMemoryConstraintsAIPartsDesc
{
public:
	struct StringAssetReference                                  PlaySongEvent;                                     // 0x80(0x10)
	struct StringAssetReference                                  StopSongEvent;                                     // 0x90(0x10)
};


// Size 0x8 (Full Size[0x70] - InheritedSize[0x68]
class WaitInWaterloggedStateShipSinkingHandler: public SimpleShipSinkingHandler
{
public:
	float                                                        TimeHaltedBeforeSinking;                           // 0x68(0x4)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class AnimNotify_DitherActor: public AnimNotify
{
public:
	char                                                         FadeSetting;                                       // 0x38(0x1)
	float                                                        FadeTime;                                          // 0x3c(0x4)
	float                                                        FadeFromTransparencyValue;                         // 0x40(0x4)
	bool                                                         UseFadeFromTransparencyValue;                      // 0x44(0x1)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ShipLiveryCatalogueService: public Object
{
public:
	TArray<struct ShipLiveryCatalogueEntry>                      CatalogEntries;                                    // 0x30(0x10)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TelemetryProgressStep: public TaleQuestStep
{
public:
	class TelemetryProgressStepDesc*                             StepDesc;                                          // 0x98(0x8)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class SelectRewardStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableItemSpawnDataTypeArray                   ItemSpawnDatas;                                    // 0x80(0x30)
	struct QuestVariableItemSpawnDataType                        QuestItemSpawnData;                                // 0xb0(0x30)
	int                                                          NumberOfItemsToSpawn;                              // 0xe0(0x4)
	bool                                                         SelectChestsOnly;                                  // 0xe4(0x1)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class AddFogBankAvoidanceAreaStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableVector                                   Location;                                          // 0x80(0x30)
	struct QuestVariableFloat                                    Radius;                                            // 0xb0(0x30)
};


// Size 0x590 (Full Size[0xaa0] - InheritedSize[0x510]
class KrakenAnimatedTentacle: public KrakenTentacle
{
public:
	class SceneComponent*                                        RootSceneComponent;                                // 0x538(0x8)
	class CapsuleComponent*                                      BaseShipCollision;                                 // 0x540(0x8)
	class SceneComponent*                                        MeshOffsetComponent;                               // 0x548(0x8)
	class SkeletalMeshComponent*                                 TentacleMeshComponent;                             // 0x550(0x8)
	class KrakenTentacleAIAudioComponent*                        KrakenTentacleAudioComponent;                      // 0x558(0x8)
	struct FName                                                 AttachSocketNameFirstPerson;                       // 0x560(0x8)
	struct FName                                                 AttachSocketNameThirdPerson;                       // 0x568(0x8)
	struct CollisionProfileName                                  TentacleCollisionProfile;                          // 0x570(0x8)
	TArray<struct KrakenAnimatedTentacleCollisionSegment>        CollisionSegments;                                 // 0x578(0x10)
	bool                                                         EnabledShipCollision;                              // 0x588(0x1)
	bool                                                         DisableHeadCollisionsDuringHoldingState;           // 0x589(0x1)
	int                                                          CollisionBoneToUseForShipCollision;                // 0x58c(0x4)
	char                                                         SegmentsCollisionEnableType;                       // 0x590(0x1)
	char                                                         BaseShipCollisionEnableType;                       // 0x591(0x1)
	class KrakenAnimatedTentacleAnimationSpecDataAsset*          AnimationSpec;                                     // 0x598(0x8)
	class KrakenAnimatedTentacleAnimationMappingDataAsset*       AnimationMapping;                                  // 0x5a0(0x8)
	class KrakenAnimatedTentacleStateAnimationsDataAsset*        StateAnimationMapping;                             // 0x5a8(0x8)
	float                                                        AnimationPlayRate;                                 // 0x5b0(0x4)
	float                                                        RequestedAnimationPlayRateBlendTime;               // 0x5b4(0x4)
	float                                                        PlayRateAdjustMaxTimeDelta;                        // 0x5b8(0x4)
	float                                                        PlayRateAdjustMaxPercentageToSpeedUpPlayRate;      // 0x5bc(0x4)
	float                                                        PlayRateAdjustMaxPercentageToSlowDownPlayRate;     // 0x5c0(0x4)
	float                                                        ServerAnimationTimeOffsetLatencyMultiplierForSynchronisation; // 0x5c4(0x4)
	float                                                        DebugDrawBoneLocationRadius;                       // 0x5c8(0x4)
	float                                                        DebugDrawTargetRadius;                             // 0x5cc(0x4)
	float                                                        DebugDrawBoneRotationEndPointRadius;               // 0x5d0(0x4)
	float                                                        DebugDrawBoneRotationLength;                       // 0x5d4(0x4)
	float                                                        DebugDrawSuckingTargetRadius;                      // 0x5d8(0x4)
	float                                                        MinAnimationPlayedTimeToSetPendingStateChange;     // 0x5dc(0x4)
	float                                                        MinAnimationLeftTimeToSetPendingStateChange;       // 0x5e0(0x4)
	float                                                        AnimationOffsetTimeLeftForOptimalPendingStateChange; // 0x5e4(0x4)
	float                                                        SmoothNetUpdateLocationTime;                       // 0x5e8(0x4)
	float                                                        SmoothNetUpdateRotationTime;                       // 0x5ec(0x4)
	float                                                        MinDotToTargetToTryAndRotate;                      // 0x5f0(0x4)
	float                                                        MaxDotToTargetToTryAndRotate;                      // 0x5f4(0x4)
	float                                                        MinYawTurnRate;                                    // 0x5f8(0x4)
	float                                                        MaxYawTurnRate;                                    // 0x5fc(0x4)
	float                                                        MinInvisibleTime;                                  // 0x600(0x4)
	float                                                        MinSuckingTellTime;                                // 0x604(0x4)
	float                                                        MaxSuckingTellTime;                                // 0x608(0x4)
	float                                                        MaxSuckingPlayerDistance;                          // 0x60c(0x4)
	float                                                        MinHealthLossRequiredToAvoidAbortSuck;             // 0x610(0x4)
	class Object*                                                TentacleSuckingTellVFX;                            // 0x618(0x8)
	struct FName                                                 TargetVFXAttachSocketName;                         // 0x620(0x8)
	class Object*                                                TargetFirstPersonSuckingTellVFX;                   // 0x628(0x8)
	class Object*                                                TargetThirdPersonSuckingTellVFX;                   // 0x630(0x8)
	float                                                        MaxHealthLossRequiredToAvoidAbortSuck;             // 0x638(0x4)
	float                                                        SuckingVelocity;                                   // 0x63c(0x4)
	float                                                        SuckingPlayerAttachDistance;                       // 0x640(0x4)
	float                                                        MinHealthLossRequiredToDropPlayer;                 // 0x644(0x4)
	float                                                        MaxHealthLossRequiredToDropPlayer;                 // 0x648(0x4)
	float                                                        MinDamageDealtByCurrentTargetRequiredToDropPlayer; // 0x64c(0x4)
	float                                                        MaxDamageDealtByCurrentTargetRequiredToDropPlayer; // 0x650(0x4)
	float                                                        MinHoldingTime;                                    // 0x654(0x4)
	float                                                        MaxHoldingTime;                                    // 0x658(0x4)
	float                                                        MinWaterDunkTime;                                  // 0x65c(0x4)
	float                                                        MaxWaterDunkTime;                                  // 0x660(0x4)
	float                                                        PowerSlamDamageTime;                               // 0x664(0x4)
	float                                                        PowerSlamDamage;                                   // 0x668(0x4)
	struct FName                                                 IngestTargetSocketName;                            // 0x66c(0x8)
	int                                                          IngestTargetBoneIndexOffset;                       // 0x674(0x4)
	float                                                        MinIngestingTime;                                  // 0x678(0x4)
	float                                                        MaxIngestingTime;                                  // 0x67c(0x4)
	float                                                        IngestingDamageAmountPerSecond;                    // 0x680(0x4)
	float                                                        RegurgitatingSpeed;                                // 0x684(0x4)
	float                                                        RegurgitatingLaunchTime;                           // 0x688(0x4)
	float                                                        ThrowTargetLaunchTime;                             // 0x68c(0x4)
	float                                                        ThrowTargetVisibleTime;                            // 0x690(0x4)
	float                                                        ThrowingSpeed;                                     // 0x694(0x4)
	class Object*                                                TentacleFirstPersonThrowingVFX;                    // 0x698(0x8)
	class Object*                                                TentacleThirdPersonThrowingVFX;                    // 0x6a0(0x8)
	float                                                        MinTargetVomitingDelay;                            // 0x6a8(0x4)
	float                                                        MaxTargetVomitingDelay;                            // 0x6ac(0x4)
	float                                                        MinTargetVomitingDuration;                         // 0x6b0(0x4)
	float                                                        MaxTargetVomitingDuration;                         // 0x6b4(0x4)
	TArray<struct KrakenAnimatedTentacleHeldTargetVomittingChance> TargetVomitingChances;                             // 0x6b8(0x10)
	struct FName                                                 VomitVFXType;                                      // 0x6c8(0x8)
	TArray<struct KrakenAnimatedTentacleWaterTriggerableFX>      WaterTriggerableFX;                                // 0x6d0(0x10)
	int                                                          WaterQueryBoneIndex;                               // 0x6e0(0x4)
	class PhysicalMaterial*                                      TentaclePhysicalMaterial;                          // 0x6e8(0x8)
	float                                                        VisualLoggerUpdateTime;                            // 0x6f0(0x4)
	float                                                        ServerTimeToStartPlayingIdle;                      // 0x6f4(0x4)
	TArray<struct Vector>                                        AITargetVisibilityPoints;                          // 0x6f8(0x10)
	struct Vector                                                TargetBoxOffset;                                   // 0x708(0xc)
	struct Vector                                                TargetBoxScale;                                    // 0x714(0xc)
	float                                                        ReplicatedAnimationProgression;                    // 0x734(0x4)
	bool                                                         IsHitReactionsEnabled;                             // 0x738(0x1)
	class UClass*                                                PendingState;                                      // 0x760(0x8)
	class UClass*                                                ReplicatedCurrentState;                            // 0x770(0x8)
	class UClass*                                                PreviousState;                                     // 0x780(0x8)
	float                                                        IngestingProgress;                                 // 0x7b8(0x4)
	class KrakenAnimatedTentacleAnimationDataAsset*              AuthoritativeAnimation;                            // 0x7c0(0x8)
	float                                                        TentacleYaw;                                       // 0x7c8(0x4)
	struct Vector                                                TentacleWorldLocation;                             // 0x7cc(0xc)
	class AthenaCharacter*                                       CurrentTarget;                                     // 0x7d8(0x8)
	bool                                                         HasPlayedIntroAnim;                                // 0x7e0(0x1)
	class SceneComponent*                                        DockedToSceneComponent;                            // 0x950(0x8)
	struct Vector                                                DockedLocalSpaceOffset;                            // 0x958(0xc)
	struct Quat                                                  DockedLocalSpaceRotation;                          // 0x970(0x10)
	TArray<class CapsuleComponent*>                              CollisionCapsules;                                 // 0x980(0x10)
	class ParticleSystemComponent*                               TentacleSuckingTellParticleSystem;                 // 0x9d8(0x8)
	class ParticleSystemComponent*                               TargetFirstPersonSuckingTellParticleSystem;        // 0x9e0(0x8)
	class ParticleSystemComponent*                               TargetThirdPersonSuckingTellParticleSystem;        // 0x9e8(0x8)
};


// Size 0x48 (Full Size[0x110] - InheritedSize[0xc8]
class PlayerNameplateLocationOverrideComponent: public ActorComponent
{
public:
	struct Transform                                             NameplateLocation;                                 // 0xd0(0x30)
	float                                                        AdditionalHeight;                                  // 0x100(0x4)
};


// Size 0x50 (Full Size[0xb0] - InheritedSize[0x60]
class TaleQuestSpawnOnShipService: public TaleQuestService
{
public:
	class TaleQuestSpawnOnShipServiceDesc*                       ServiceDesc;                                       // 0x60(0x8)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class LandmarkFrameworkSettings: public DeveloperSettings
{
public:
	float                                                        LandmarkAudioZoneRadius;                           // 0x38(0x4)
	float                                                        LandmarkAudioZoneHeight;                           // 0x3c(0x4)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class AssignItemStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableClass                                    TypeVar;                                           // 0x80(0x30)
	class UClass*                                                TypeValue;                                         // 0xb0(0x8)
};


// Size 0x50 (Full Size[0x118] - InheritedSize[0xc8]
class RumbleHandlerComponent: public ActorComponent
{
public:
	TArray<struct RumbleParameters>                              RumbleParameters;                                  // 0xc8(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class CharacterMovementAINoiseEventComponentParams: public DataAsset
{
public:
	struct FName                                                 MovementTag;                                       // 0x28(0x8)
	class CurveFloat*                                            WalkingSpeedToNoiseRange;                          // 0x30(0x8)
	class CurveFloat*                                            CrouchingSpeedToNoiseRange;                        // 0x38(0x8)
	float                                                        MovingInWaterNoiseRange;                           // 0x40(0x4)
	float                                                        JumpNoiseRange;                                    // 0x44(0x4)
	float                                                        LandNoiseRange;                                    // 0x48(0x4)
	float                                                        MinSpeedToTriggerLandedEvent;                      // 0x4c(0x4)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class FishingFreeLookConstrainsDataAsset: public DataAsset
{
public:
	float                                                        YawDegrees;                                        // 0x28(0x4)
	float                                                        PitchMinDegrees;                                   // 0x2c(0x4)
	float                                                        PitchMaxDegrees;                                   // 0x30(0x4)
	float                                                        LookAroundRightStickInputToAngleModifier;          // 0x34(0x4)
	float                                                        LookAroundMouseInputToAngleModifier;               // 0x38(0x4)
	float                                                        LookAroundMouseInputAsMovementInputModifier;       // 0x3c(0x4)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class ShipwreckNameGeneratorDefault: public ShipwreckNameGeneratorAbstract
{
public:
	TArray<struct Text>                                          ShipwreckNames;                                    // 0x40(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class DioramaDebugMenuEntries: public DataAsset
{
public:
	TArray<struct DioramaDebugMenuEntry>                         Dioramas;                                          // 0x28(0x10)
};


// Size 0x8 (Full Size[0x48] - InheritedSize[0x40]
class FireBreathAbilityStageParams: public AthenaAIAbilityStageParams
{
public:
	float                                                        FireBreathDurationMultiplier;                      // 0x40(0x4)
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class PortableHarpoonInteractionOverrideComponent: public ActorComponent
{
public:
	struct ActorComponentSelector                                UseSpecificComponentForOverlaps;                   // 0xc8(0x10)
	bool                                                         BlockGrappling;                                    // 0xd8(0x1)
	bool                                                         BlockItemRetraction;                               // 0xd9(0x1)
	bool                                                         BlockCharacterRetraction;                          // 0xda(0x1)
	class PrimitiveComponent*                                    SelectedComponentForOverlaps;                      // 0xe0(0x8)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class Rugs: public Actor
{
public:
	class StaticMeshComponent*                                   RugMeshComponent;                                  // 0x3c8(0x8)
	class ReplicatedShipPartCustomizationComponent*              CustomizationComponent;                            // 0x3d0(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ShipCustomizationInfo: public DataAsset
{
public:
	class UClass*                                                Category;                                          // 0x28(0x8)
	TArray<struct ShipSizePartCustomizationInfo>                 ShipSizeCustomizations;                            // 0x30(0x10)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class AIRowboatServiceSettings: public DeveloperSettings
{
public:
	struct StringAssetReference                                  AIRowboatServiceSettingsAsset;                     // 0x38(0x10)
};


// Size 0x38 (Full Size[0x100] - InheritedSize[0xc8]
class PetCustomizationDesc: public PetEntitlementBaseDesc
{
public:
	TArray<struct PetCustomizationPartMapping>                   PetPartMapping;                                    // 0xc8(0x10)
	class UClass*                                                RelatedPetEntitlementCategory;                     // 0xd8(0x8)
	assetclass                                                   CustomizationPetClass;                             // 0xe0(0x20)
};


// Size 0x110 (Full Size[0x4d8] - InheritedSize[0x3c8]
class ContestZoneService: public Actor
{
public:
	TArray<struct Name>                                          ContestZoneNames;                                  // 0x400(0x10)
	bool                                                         HasLoadedContestZones;                             // 0x420(0x1)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class NotInActionStateRadialContext: public RadialContextBase
{
public:
	TArray<class Class*>                                         TargetActionStates;                                // 0x28(0x10)
};


// Size 0x58 (Full Size[0xb8] - InheritedSize[0x60]
class TemporaryEntitlementsTaleQuestService: public TaleQuestService
{
public:
	class TemporaryEntitlementsTaleQuestServiceDesc*             ServiceDesc;                                       // 0x60(0x8)
	TArray<struct LoadoutCacheEntry>                             CachedLoadouts;                                    // 0x70(0x10)
	TArray<class PlayerEntitlementComponent*>                    OverriddenComponents;                              // 0xa8(0x10)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class RiddleQuestValidLocationGeneratorData: public DataAsset
{
public:
	float                                                        PacesToCentimetres;                                // 0x28(0x4)
	uint32                                                       MinNumPaces;                                       // 0x2c(0x4)
	uint32                                                       MaxNumPaces;                                       // 0x30(0x4)
	uint32                                                       MinNumPacesForNonVagueNonUniqueLandmark;           // 0x34(0x4)
	uint32                                                       MaxNumPacesForNonVagueNonUniqueLandmark;           // 0x38(0x4)
	float                                                        IsBlockedTestHeight;                               // 0x3c(0x4)
	float                                                        CastDownOffset;                                    // 0x40(0x4)
	float                                                        CastDownLength;                                    // 0x44(0x4)
	float                                                        MaxAngleChangeBetweenPaces;                        // 0x48(0x4)
	float                                                        CollisionTestCapsuleHalfHeight;                    // 0x4c(0x4)
	float                                                        CollisionTestCapsuleRadius;                        // 0x50(0x4)
	float                                                        CollisionTestYOffset;                              // 0x54(0x4)
	char                                                         HitTestTraceChannel;                               // 0x58(0x1)
	float                                                        CardinalDirectionTolerance;                        // 0x5c(0x4)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ReapersTributeShipDefeatedStateDataAsset: public DataAsset
{
public:
	int                                                          NumberOfCannonHitsToSinkWaterloggedShip;           // 0x28(0x4)
	float                                                        TimeBeforeCannonHitsCountForDefeatedWaterloggedShip; // 0x2c(0x4)
	TArray<class Class*>                                         DamageTypesAllowed;                                // 0x30(0x10)
};


// Size 0x70 (Full Size[0xf0] - InheritedSize[0x80]
class TaleQuestParallelForeachStepDesc: public TaleQuestStepDesc
{
public:
	uint32                                                       Count;                                             // 0x80(0x4)
	bool                                                         CanEditCount;                                      // 0x84(0x1)
	map                                                          InputQuestMappings;                                // 0x88(0x50)
	class TaleQuestStepDesc*                                     BodyDesc;                                          // 0xd8(0x8)
	class UClass*                                                Generator;                                         // 0xe0(0x8)
	class ScriptStruct*                                          Variables;                                         // 0xe8(0x8)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class WaterSensitiveComponentDataAsset: public DataAsset
{
public:
	struct WaterSensitiveHealthChange                            HealthChangeInRainPerSecond;                       // 0x28(0x8)
	struct WaterSensitiveHealthChange                            HealthChangeSubmergedPerSecond;                    // 0x30(0x8)
	struct WaterSensitiveHealthChange                            HealthChangeWhenDryPerSecond;                      // 0x38(0x8)
	struct WaterSensitiveHealthChange                            HealthChangeOnLiquidProjectileImpact;              // 0x40(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class GeneratedLocationsDataAsset: public DataAsset
{
public:
	TArray<struct Vector>                                        Locations;                                         // 0x28(0x10)
};


// Size 0x48 (Full Size[0x1b8] - InheritedSize[0x170]
class EnvQueryTest_TraceByProfile: public EnvQueryTest
{
public:
	struct FName                                                 CollisionProfileName;                              // 0x170(0x8)
	struct AIDataProviderFloatValue                              Radius;                                            // 0x178(0x30)
	class UClass*                                                Context;                                           // 0x1a8(0x8)
	float                                                        ContextZOffset;                                    // 0x1b0(0x4)
