#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "AthenaRigging_Structs.h"


// Size 0xc0 (Full Size[0x660] - InheritedSize[0x5a0]
class InstancedRopeComponent: public PrimitiveComponent
{
public:
	class StaticMesh*                                            StaticMesh;                                        // 0x598(0x8)
	TArray<struct InstancedRopeParams>                           Ropes;                                             // 0x5a0(0x10)
	int                                                          ShadowLOD;                                         // 0x5b0(0x4)
	char                                                         pad0xac_99MVS[0xac];                               // 0x5b4(0xac)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RopeInterface: public Interface
{
public:
};


// Size 0x40 (Full Size[0x310] - InheritedSize[0x2d0]
class RiggingSystemComponent: public SceneComponent
{
public:
	struct RopeStyleParams                                       RopeStyle;                                         // 0x2d0(0x20)
	TArray<struct RiggingSystemLineGroup>                        LineGroups;                                        // 0x2f0(0x10)
	class RiggingSystem*                                         Impl;                                              // 0x300(0x8)
	char                                                         pad0x8_69NL0[0x8];                                 // 0x308(0x8)
};


// Size 0x150 (Full Size[0x4f0] - InheritedSize[0x3a0]
class RiggingSystem: public Actor
{
public:
	char                                                         pad0x8_FUUSM[0x8];                                 // 0x3a0(0x8)
	class SceneComponent*                                        Root;                                              // 0x3a8(0x8)
	class InstancedRopeComponent*                                InstancedRopes;                                    // 0x3b0(0x8)
	TArray<struct RiggingSystemLine>                             Lines;                                             // 0x3b8(0x10)
	TArray<struct InstancedRopeParams>                           Ropes;                                             // 0x3c8(0x10)
	TArray<class MobileInstancedStaticMeshComponent*>            PulleyInstances;                                   // 0x3d8(0x10)
	struct RiggingSystemPulleyData                               Pulleys;                                           // 0x3e8(0x60)
	TArray<struct SocketId>                                      Sockets;                                           // 0x448(0x10)
	TArray<float>                                                InitialMainRopeLengths;                            // 0x458(0x10)
	char                                                         pad0x88_MP516[0x88];                               // 0x468(0x88)
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class MaterialExpressionRopeParameter: public MaterialExpression
{
public:
	char                                                         RopeParameterType;                                 // 0x70(0x1)
	char                                                         pad0x7_T0HFS[0x7];                                 // 0x71(0x7)
};


// Size 0x0 (Full Size[0x640] - InheritedSize[0x640]
class RopeCatenaryRenderComponent: public CordRenderComponent
{
public:
};


