#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xc
struct IncomingMigrationPreventionZone
{
public:
	struct Vector2D                                              Location;                                          // 0x0(0x8)
	float                                                        Radius;                                            // 0x8(0x4)
};


// Size 0x20
struct ServerMigrationAboutToStartEvent
{
public:
	char                                                         pad0x20_GXZ7D[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct ServerMigrationRequestBroadcastEvent
{
public:
	struct FString                                               DestinationAddress;                                // 0x0(0x10)
	struct Guid                                                  CrewId;                                            // 0x10(0x10)
};


// Size 0x20
struct OutgoingServerMigrationAbortedEvent
{
public:
	char                                                         pad0x20_SZ6VI[0x20];                               // 0x0(0x20)
};


// Size 0x1
struct ServerMigrationSetupCompleteEvent
{
public:
	char                                                         pad0x1_5PYZ0[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct ServerMigrationAbortEvent
{
public:
	char                                                         pad0x20_TSTTP[0x20];                               // 0x0(0x20)
};


// Size 0x18
struct PrepareForWorldSwitchRpc
{
public:
	char                                                         pad0x18_MAPKI[0x18];                               // 0x0(0x18)
};


// Size 0x48
struct AddedPendingIncomingGameEventOnDemandCrewEvent
{
public:
	char                                                         pad0x48_NFJGS[0x48];                               // 0x0(0x48)
};


// Size 0x20
struct OutgoingServerMigrationCompleteEvent
{
public:
	char                                                         pad0x20_H1AE3[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct ServerMigrationInstanceEventBase
{
public:
	struct Guid                                                  ServerId;                                          // 0x0(0x10)
	struct Guid                                                  MigrationId;                                       // 0x10(0x10)
};


// Size 0x90
struct ServerMigrationReadyToTransferActors
{
public:
	char                                                         pad0x90_YS8Y2[0x90];                               // 0x0(0x90)
};


// Size 0x20
struct ServerMigrationRefusedEvent
{
public:
	struct Guid                                                  MigrationId;                                       // 0x0(0x10)
	TArray<struct Guid>                                          CrewIds;                                           // 0x10(0x10)
};


// Size 0x20
struct OutgoingServerMigrationCompletedEvent
{
public:
	char                                                         pad0x20_JVA2J[0x20];                               // 0x0(0x20)
};


// Size 0x1
struct ServerMigrationSetupRequestEvent
{
public:
	char                                                         pad0x1_Y3X9W[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct OutgoingServerMigrationStartedEvent
{
public:
	char                                                         pad0x20_HCC9F[0x20];                               // 0x0(0x20)
};


// Size 0x10
struct AthenaServerMigrationClientContext
{
public:
	struct FString                                               StampId;                                           // 0x0(0x10)
};


// Size 0x60
struct ServerMigrationRequestEvent
{
public:
	struct Guid                                                  MigrationId;                                       // 0x0(0x10)
	struct FString                                               DestinationAddress;                                // 0x10(0x10)
	TArray<struct Guid>                                          CrewIds;                                           // 0x20(0x10)
	struct FString                                               SubMode;                                           // 0x30(0x10)
	TArray<char>                                                 MatchmakingReasons;                                // 0x40(0x10)
	TArray<String>                                               RequestedGameEvents;                               // 0x50(0x10)
};


// Size 0x48
struct AddedPendingIncomingInvaderCrewEvent
{
public:
	char                                                         pad0x48_J8I49[0x48];                               // 0x0(0x48)
};


// Size 0x1
struct ServerMigrationCompleteEvent
{
public:
	char                                                         pad0x1_AAZ9T[0x1];                                 // 0x0(0x1)
};


