// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0 (Full Size[0x138] - InheritedSize[0x78]
class AthenaCheatManager: public CheatManager
{
public:
	class CinematicCameraController*                             CinematicCameraController;                         // 0x78(0x8)
	class UClass*                                                CinematicCameraControllerClass;                    // 0x80(0x8)
	char                                                         pad0x28_QJ9J1[0x28];                               // 0x88(0x28)
	TArray<struct WorldMarkerDesc>                               CreatedWorldMarkers;                               // 0xb0(0x10)
	class GameEventSchedulerSettingsAsset*                       DebugSchedulerSettings;                            // 0xc0(0x8)
	class ServerPerformanceReplicator*                           ServerPerformanceReplicator;                       // 0xc8(0x8)
	float                                                        TeleportToDigsiteHeightOffset;                     // 0xd0(0x4)
	char                                                         pad0x64_I9XV0[0x64];                               // 0xd4(0x64)
};


}