// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc
struct IncomingMigrationPreventionZone
{
public:
	Struct Vector2D                                              Location;                                          // 0x0(0x8)
	float                                                        Radius;                                            // 0x8(0x4)
};


// Size 0x1
struct ServerMigrationSetupCompleteEvent
{
public:
};


// Size 0x1
struct ServerMigrationSetupRequestEvent
{
public:
};


// Size 0x90
struct ServerMigrationReadyToTransferActors
{
public:
};


// Size 0x20
struct ServerMigrationAboutToStartEvent
{
public:
};


// Size 0x10
struct ServerMigrationAbortEvent
{
public:
};


// Size 0x1
struct ServerMigrationCompleteEvent
{
public:
};


// Size 0x20
struct ServerMigrationRefusedEvent
{
public:
	Struct Guid                                                  MigrationId;                                       // 0x0(0x10)
	TArray<Struct Guid>                                          CrewIds;                                           // 0x10(0x10)
};


// Size 0x20
struct OutgoingServerMigrationAbortedEvent
{
public:
};


// Size 0x20
struct ServerMigrationInstanceEventBase
{
public:
	Struct Guid                                                  ServerId;                                          // 0x0(0x10)
	Struct Guid                                                  MigrationId;                                       // 0x10(0x10)
};


// Size 0x20
struct OutgoingServerMigrationCompletedEvent
{
public:
};


// Size 0x20
struct OutgoingServerMigrationStartedEvent
{
public:
};


// Size 0x50
struct ServerMigrationRequestEvent
{
public:
	Struct Guid                                                  MigrationId;                                       // 0x0(0x10)
	Struct FString                                               DestinationAddress;                                // 0x10(0x10)
	TArray<Struct Guid>                                          CrewIds;                                           // 0x20(0x10)
	Struct FString                                               SubMode;                                           // 0x30(0x10)
	TArray<Byte MatchmakingReasons>                              MatchmakingReasons;                                // 0x40(0x10)
};


// Size 0x20
struct ServerMigrationRequestBroadcastEvent
{
public:
	Struct FString                                               DestinationAddress;                                // 0x0(0x10)
	Struct Guid                                                  CrewId;                                            // 0x10(0x10)
};


// Size 0x10
struct PrepareForWorldSwitchRpc
{
public:
};


// Size 0x10
struct AthenaServerMigrationClientContext
{
public:
	Struct FString                                               StampId;                                           // 0x0(0x10)
};


}