#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Athena_Structs.h"


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DockableBaseActionStateId: public ActionStateId
{
public:
};


// Size 0xf0 (Full Size[0x6f0] - InheritedSize[0x600]
class SeaFortAlignmentTableModelComponent: public StaticMeshComponent
{
public:
	char                                                         pad0x8_IBA49[0x8];                                 // 0x600(0x8)
	char                                                         IslandType;                                        // 0x608(0x1)
	char                                                         pad0x7_762ZD[0x7];                                 // 0x609(0x7)
	struct FlagAlignmentCosmetic                                 AlignmentCosmetic;                                 // 0x610(0x28)
	char                                                         pad0xb8_YR1N3[0xb8];                               // 0x638(0xb8)
};


// Size 0x0 (Full Size[0xb8] - InheritedSize[0xb8]
class CharacterMovementModeReporterComponent: public ActorComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AtmosphericPressureServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AtlasSlotRenderer: public Interface
{
public:
};


// Size 0x20 (Full Size[0xd8] - InheritedSize[0xb8]
class WorldMarkerRoutingComponent: public ActorComponent
{
public:
	char                                                         pad0x8_AV667[0x8];                                 // 0xb8(0x8)
	class UClass*                                                DefaultListenerType;                               // 0xc0(0x8)
	char                                                         pad0x10_CY649[0x10];                               // 0xc8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnvQueryContext_NamedActor: public EnvQueryContext
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class QuestBookRemapper: public Object
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SpawnCommandsAIAmmoList: public DataAsset
{
public:
	TArray<struct SpawnCommandsAIAmmo>                           AmmoList;                                          // 0x28(0x10)
};


// Size 0x118 (Full Size[0x1d0] - InheritedSize[0xb8]
class ItemLoadoutComponent: public ActorComponent
{
public:
	char                                                         pad0x10_V0HLW[0x10];                               // 0xb8(0x10)
	int                                                          MaxWeaponSlots;                                    // 0xc8(0x4)
	char                                                         pad0x4_W9B2L[0x4];                                 // 0xcc(0x4)
	struct ItemLoadout                                           ItemLoadout;                                       // 0xd0(0x20)
	struct ItemLoadoutComponentSlots                             LoadoutSlots;                                      // 0xf0(0x20)
	TArray<class Class*>                                         WeaponSlots_ClientPredicted;                       // 0x110(0x10)
	char                                                         pad0xb0_QIVEG[0xb0];                               // 0x120(0xb0)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShoresOfGoldTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class CancelStatus: public StatusBase
{
public:
};


// Size 0x48 (Full Size[0x100] - InheritedSize[0xb8]
class PortableHarpoonNonOverlapInteractionOverrideComponent: public ActorComponent
{
public:
	struct Vector                                                Origin;                                            // 0xb8(0xc)
	bool                                                         IsSphereVolume;                                    // 0xc4(0x1)
	char                                                         pad0x3_RD67W[0x3];                                 // 0xc5(0x3)
	float                                                        SphereRadius;                                      // 0xc8(0x4)
	struct Vector                                                BoxExtents;                                        // 0xcc(0xc)
	bool                                                         BlockGrappling;                                    // 0xd8(0x1)
	bool                                                         BlockItemRetraction;                               // 0xd9(0x1)
	bool                                                         BlockCharacterRetraction;                          // 0xda(0x1)
	char                                                         pad0x25_JOULX[0x25];                               // 0xdb(0x25)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaCharacterFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class IslandFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x1b8 (Full Size[0x1e0] - InheritedSize[0x28]
class FogBankDataAsset: public DataAsset
{
public:
	char                                                         FogBankType;                                       // 0x28(0x1)
	char                                                         pad0x7_GWJPC[0x7];                                 // 0x29(0x7)
	struct WeightedProbabilityRangeOfRanges                      Density;                                           // 0x30(0x30)
	struct WeightedProbabilityRangeOfRanges                      RadiusXInKm;                                       // 0x60(0x30)
	struct WeightedProbabilityRangeOfRanges                      RadiusYInKm;                                       // 0x90(0x30)
	struct WeightedProbabilityRangeOfRanges                      HeightInKm;                                        // 0xc0(0x30)
	struct LinearColor                                           DefaultColour;                                     // 0xf0(0x10)
	TArray<struct FogColourForSea>                               FogColourForSea;                                   // 0x100(0x10)
	struct WeightedProbabilityRangeOfRanges                      FadeInDuration;                                    // 0x110(0x30)
	struct WeightedProbabilityRangeOfRanges                      ActiveDuration;                                    // 0x140(0x30)
	struct WeightedProbabilityRangeOfRanges                      FadeOutDuration;                                   // 0x170(0x30)
	struct WeightedProbabilityRangeOfRanges                      EmergencyFadeOutDuration;                          // 0x1a0(0x30)
	bool                                                         Persistent;                                        // 0x1d0(0x1)
	char                                                         pad0x3_KVNUQ[0x3];                                 // 0x1d1(0x3)
	float                                                        TimeBetweenLocalPlayerDensityModifierUpdate;       // 0x1d4(0x4)
	float                                                        NotCulledDistanceFromPlayerInKm;                   // 0x1d8(0x4)
	float                                                        FullyCulledDistanceFromPlayerInKm;                 // 0x1dc(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RotationControlInterface: public Interface
{
public:
};


// Size 0x1e0 (Full Size[0x320] - InheritedSize[0x140]
class SeatComponentBase: public InteractableComponent
{
public:
	char                                                         pad0x48_SE18G[0x48];                               // 0x140(0x48)
	struct FText                                                 InteractionVerb;                                   // 0x188(0x38)
	struct FText                                                 InteractionDisplayName;                            // 0x1c0(0x38)
	class UClass*                                                InteractionInput;                                  // 0x1f8(0x8)
	bool                                                         HoldToInteract;                                    // 0x200(0x1)
	char                                                         pad0x7_3DICL[0x7];                                 // 0x201(0x7)
	class UClass*                                                HoldInteractionInput;                              // 0x208(0x8)
	float                                                        HoldDuration;                                      // 0x210(0x4)
	float                                                        IdleDisconnectThreshold;                           // 0x214(0x4)
	bool                                                         DisableCanBeControlled;                            // 0x218(0x1)
	char                                                         pad0x7_RX7B2[0x7];                                 // 0x219(0x7)
	class PhrasesRadialDataAsset*                                RadialPhrases;                                     // 0x220(0x8)
	bool                                                         CustomInteractionPoint;                            // 0x228(0x1)
	char                                                         pad0x3_RNT07[0x3];                                 // 0x229(0x3)
	struct Vector                                                CustomInteractionPointLocation;                    // 0x22c(0xc)
	TArray<class SeatStat*>                                      ConditionalSeatStats;                              // 0x238(0x10)
	bool                                                         CanBeUnderwater;                                   // 0x248(0x1)
	char                                                         pad0x7_UDYW1[0x7];                                 // 0x249(0x7)
	char                                                         pad0xd0_N2DW1[0xd0];                               // 0x250(0xd0)
};


// Size 0x2a8 (Full Size[0x360] - InheritedSize[0xb8]
class LockComponent: public ActorComponent
{
public:
	char                                                         pad0x8_ZMLN8[0x8];                                 // 0xb8(0x8)
	struct FName                                                 FeatureFlag;                                       // 0xc0(0x8)
	TArray<struct LockData>                                      Locks;                                             // 0xc8(0x10)
	TArray<struct VaultLock>                                     VaultLocks;                                        // 0xd8(0x10)
	class UClass*                                                KeyUsedToUnlock;                                   // 0x148(0x8)
	TArray<struct LockState>                                     LockStates;                                        // 0x150(0x10)
	bool                                                         IsLockAvailableDuringSaferSeas;                    // 0x160(0x1)
	char                                                         pad0x7_ZT02E[0x7];                                 // 0x161(0x7)
	class SceneComponent*                                        LockKeyMeshAttachParent;                           // 0x168(0x8)
	TArray<class StaticMeshMemoryConstraintComponent*>           LockKeyMeshComponents;                             // 0x170(0x10)
	class UClass*                                                UnlockInputId;                                     // 0x180(0x8)
	char                                                         TooltipDisplayPriority;                            // 0x188(0x1)
	char                                                         pad0x97_F2XBK[0x97];                               // 0x189(0x97)
	class ActionRulesComponent*                                  ActionRules;                                       // 0x220(0x8)
	TArray<class UnlockLockConditionalStatTrigger*>              ConditionalLockStats;                              // 0x228(0x10)
	struct FText                                                 UnlockText;                                        // 0x238(0x38)
	struct FText                                                 NeedKeyToUnlockText;                               // 0x270(0x38)
	struct FText                                                 VaultUnavailableUnlockText;                        // 0x2a8(0x38)
	struct FText                                                 UnavailableDuringSaferSeasText;                    // 0x2e0(0x38)
	class Actor*                                                 AssociatedOwnerObject;                             // 0x318(0x8)
	char                                                         pad0x40_QXC19[0x40];                               // 0x320(0x40)
};


// Size 0x0 (Full Size[0x3b0] - InheritedSize[0x3b0]
class ShipwrightInteractionProxy: public ModalInteraction
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CombinationLockMechanismTriggerInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class WaterBarrelLeverNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class MountableSpotlightAudioParamsDataAsset: public DataAsset
{
public:
	struct Vector                                                AudioEmitterOffset;                                // 0x28(0xc)
	struct FName                                                 MoveYawRateRTPCName;                               // 0x34(0x8)
	struct FName                                                 MovePitchRateRTPCName;                             // 0x3c(0x8)
	char                                                         pad0x4_NA8E9[0x4];                                 // 0x44(0x4)
	class WwiseEvent*                                            StartMovePitchAudioLoopEvent;                      // 0x48(0x8)
	class WwiseEvent*                                            StopMovePitchAudioLoopEvent;                       // 0x50(0x8)
	class WwiseEvent*                                            StartMoveYawAudioLoopEvent;                        // 0x58(0x8)
	class WwiseEvent*                                            StopMoveYawAudioLoopEvent;                         // 0x60(0x8)
	class WwiseEvent*                                            FocusBeamAudioEvent;                               // 0x68(0x8)
	class WwiseObjectPoolWrapper*                                AudioEmitterPool;                                  // 0x70(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CollidableCharacterInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class ConsumableWieldableComponent: public ActorComponent
{
public:
	char                                                         pad0x8_UHVG5[0x8];                                 // 0xb8(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ItemProxyShipTrackerComponentDataAsset: public DataAsset
{
public:
	TArray<class Class*>                                         ShipTypes;                                         // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LookAtInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x2e0] - InheritedSize[0x2d0]
class SpawnActorComponent: public SceneComponent
{
public:
	class UClass*                                                ChildActorClass;                                   // 0x2d0(0x8)
	class Actor*                                                 ChildActor;                                        // 0x2d8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MoveableObjectInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TitleLoadoutViewInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class SetPuzzleVaultResetOnLeaveStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    Vault;                                             // 0x80(0x30)
	bool                                                         CanVaultResetOnceAllPlayersLeave;                  // 0xb0(0x1)
	char                                                         pad0x7_DBBGM[0x7];                                 // 0xb1(0x7)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class AICombatDialogue: public Object
{
public:
	class SceneDialogueCoordinator*                              DialogueCoordinator;                               // 0x28(0x8)
	class SceneDialogueData*                                     DialogueData;                                      // 0x30(0x8)
	int                                                          NumAISlots;                                        // 0x38(0x4)
	float                                                        ChatMaxDistance;                                   // 0x3c(0x4)
	float                                                        RemoveAIDelay;                                     // 0x40(0x4)
	float                                                        EndDelay;                                          // 0x44(0x4)
	class SimpleDialogueStateProvider*                           StateProvider;                                     // 0x48(0x8)
	char                                                         pad0x28_LPP6Y[0x28];                               // 0x50(0x28)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class ContestAddItemToHandInListStepDesc: public TaleQuestStepDesc
{
public:
	class UClass*                                                Item;                                              // 0x80(0x8)
	struct QuestVariableActor                                    NPC;                                               // 0x88(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ProxyItemInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayerNameplateComponentInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DebugCrewServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TallTaleServiceInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class CollectorsChestSharedParamsDataAsset: public DataAsset
{
public:
	TArray<class CollectorsChestItemSlotDefinitionDataAsset*>    SlotDefinitions;                                   // 0x28(0x10)
};


// Size 0x138 (Full Size[0x1f0] - InheritedSize[0xb8]
class ChestOfRageComponent: public ActorComponent
{
public:
	char                                                         pad0x8_MKHO0[0x8];                                 // 0xb8(0x8)
	class ChestOfRageDataAsset*                                  ChestOfRageDataAsset;                              // 0xc0(0x8)
	struct ChestOfRageReplicatedData                             ReplicatedData;                                    // 0xc8(0xc)
	char                                                         pad0x8c_3FBN0[0x8c];                               // 0xd4(0x8c)
	class ParticleSystemComponent*                               RageBuildingVfxEmitter;                            // 0x160(0x8)
	class ParticleSystemComponent*                               SteamingVfxEmitter;                                // 0x168(0x8)
	class ParticleSystemComponent*                               OnFireVfxEmitter;                                  // 0x170(0x8)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0x178(0x10)
	TArray<class Actor*>                                         RageContributors;                                  // 0x188(0x10)
	char                                                         pad0x58_U5KH6[0x58];                               // 0x198(0x58)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EmblemServiceInterface: public Interface
{
public:
};


// Size 0xa8 (Full Size[0xd0] - InheritedSize[0x28]
class ItemPreviewDataObject: public Object
{
public:
	char                                                         pad0x8_C9SGZ[0x8];                                 // 0x28(0x8)
	struct StringAssetReference                                  RequestedAssetReference;                           // 0x30(0x10)
	struct StringAssetReference                                  CurrentPreviewAssetReference;                      // 0x48(0x10)
	char                                                         pad0x78_8STOT[0x78];                               // 0x58(0x78)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SpawnCommandsAILoadoutList: public DataAsset
{
public:
	TArray<struct SpawnCommandsAILoadout>                        LoadoutList;                                       // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MeshMemoryConstraintTelemetryInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ShipPartsCatalogueDataAsset: public DataAsset
{
public:
	struct ShipPartsCatalogue                                    Catalogue;                                         // 0x28(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class QuickCycleToFoodNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class WaitForCrewToArriveInTunnelOfTheDamnedTaleQuestStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class RadialSlotIndex3SelectedKeyboardNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ShipsVisitsAnIslandData: public Object
{
public:
	char                                                         pad0x8_DRBO0[0x8];                                 // 0x28(0x8)
};


// Size 0x0 (Full Size[0x2d0] - InheritedSize[0x2d0]
class PlanarReflectionPlaneComponent: public SceneComponent
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AggressiveGhostShipMineFormationsDataAsset: public DataAsset
{
public:
	TArray<struct AggressiveGhostShipMineFormationOptions>       MineFormationOptions;                              // 0x28(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class QuickCycleToThrowablesNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StarvingInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x118] - InheritedSize[0x108]
class AthenaDebugMenuComponent: public DebugMenuComponent
{
public:
	char                                                         pad0x10_0XU2R[0x10];                               // 0x108(0x10)
};


// Size 0x1a8 (Full Size[0x548] - InheritedSize[0x3a0]
class TutorialEventControlledObject: public Actor
{
public:
	char                                                         pad0x8_1KKJS[0x8];                                 // 0x3a0(0x8)
	struct ObjectMessagingHandle                                 ActivateEventHandle;                               // 0x3a8(0x58)
	struct ObjectMessagingHandle                                 DeactivateEventHandle;                             // 0x400(0x58)
	class WwiseEvent*                                            ActivationSfx;                                     // 0x458(0x8)
	class WwiseEvent*                                            FullyActivatedSfx;                                 // 0x460(0x8)
	class WwiseEvent*                                            DeactivationSfx;                                   // 0x468(0x8)
	class WwiseEvent*                                            FullyDeactivatedSfx;                               // 0x470(0x8)
	bool                                                         IsActivated;                                       // 0x478(0x1)
	char                                                         pad0x7_8I6JW[0x7];                                 // 0x479(0x7)
	struct ObjectMessagingDispatcher                             EventDispatcher;                                   // 0x480(0xa0)
	class AthenaPlayerController*                                RegisteredController;                              // 0x520(0x8)
	char                                                         pad0x20_MBROK[0x20];                               // 0x528(0x20)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SignalMechanismInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class MerchantQuestData: public DataAsset
{
public:
	class PopUpMessageDesc*                                      ContractCompletePopupDesc;                         // 0x28(0x8)
	class PopUpMessageDesc*                                      ContractExpiredPopupDesc;                          // 0x30(0x8)
};


// Size 0x170 (Full Size[0x198] - InheritedSize[0x28]
class ExperienceService: public Object
{
public:
	char                                                         pad0x8_GE9ON[0x8];                                 // 0x28(0x8)
	class World*                                                 World;                                             // 0x30(0x8)
	char                                                         pad0xc8_7UDM1[0xc8];                               // 0x38(0xc8)
	TArray<struct DisabledVoyageDetails>                         GlobalRestrictedVoyages;                           // 0x100(0x10)
	char                                                         pad0x88_EUBSQ[0x88];                               // 0x110(0x88)
};


// Size 0x3d0 (Full Size[0x488] - InheritedSize[0xb8]
class PopUpNotificationComponent: public ActorComponent
{
public:
	class RewardPopUpNotificationCollectionDataAsset*            RewardPopUpNotificationCollection;                 // 0xb8(0x8)
	TArray<class DeferralReasonPopUpNotificationDataAsset*>      DeferralReasonPopUpNotifications;                  // 0xc0(0x10)
	TArray<class CampaignPopUpNotificationDataAsset*>            CampaignPopUpNotifications;                        // 0xd0(0x10)
	class PopUpMessageDesc*                                      PeriodicObjectiveCompletePopUp;                    // 0xe0(0x8)
	class PopUpMessageDesc*                                      PeriodicObjectiveIncompletePopUp;                  // 0xe8(0x8)
	class PopUpMessageDesc*                                      NPCOnBeachFlowPopUpNoTaleCheckpointVoyage;         // 0xf0(0x8)
	class PopUpMessageDesc*                                      NPCOnBeachFlowPopUpHasTaleCheckpointVoyage;        // 0xf8(0x8)
	class PopUpMessageDesc*                                      GuildCosmeticEntitlementRemovedPopup;              // 0x100(0x8)
	class PopUpMessageDesc*                                      AncientKnowledgeGainedPopup;                       // 0x108(0x8)
	TArray<struct AlignmentOfTypePopUpInformation>               AlignmentOfTypePopUpInformation;                   // 0x110(0x10)
	struct MermaidServicePopUpData                               MermaidToggledPopUpData;                           // 0x120(0x10)
	TArray<struct NewVoyagesAvailablePerCompanyPopupMessage>     NewVoyagesAvailableToPlayerPrompts;                // 0x130(0x10)
	class CrewNotificationSettings*                              CrewNotificationDataAsset;                         // 0x140(0x8)
	class CaptainsLogbookAccoladeLocalisedTextDefinitionAsset*   AccoladeLocalisedTextDefinitionAsset;              // 0x148(0x8)
	TArray<class Class*>                                         Factions;                                          // 0x150(0x10)
	TArray<struct DistinctionBanners>                            DistinctionBanners;                                // 0x160(0x10)
	char                                                         pad0x18_4E3LO[0x18];                               // 0x170(0x18)
	struct EmissaryNotificationState                             EmissaryState;                                     // 0x188(0xc)
	char                                                         pad0x4_AU3IX[0x4];                                 // 0x194(0x4)
	class PopUpMessageDesc*                                      NewTitlesAvailableToBuyPopUp;                      // 0x198(0x8)
	int                                                          NewTitlePopupCompanyBackgroundGrade;               // 0x1a0(0x4)
	char                                                         pad0x4_W1AWJ[0x4];                                 // 0x1a4(0x4)
	class PrioritisedPromptsManager*                             PrioritisedPrompts;                                // 0x1a8(0x8)
	class EmissaryLevelSettingsAsset*                            EmissaryLevelSettings;                             // 0x1b0(0x8)
	class TradingCompanyPopUpBackgroundCollectionDataAsset*      CompanyPopUpBackgroundCollection;                  // 0x1b8(0x8)
	class SessionManagementServiceSettingsDataAsset*             SessionManagementSettings;                         // 0x1c0(0x8)
	char                                                         pad0x2c0_H1Y14[0x2c0];                             // 0x1c8(0x2c0)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SampledMovementInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PlayerManagerServiceInterface: public Interface
{
public:
};


// Size 0x28 (Full Size[0x410] - InheritedSize[0x3e8]
class RespawnAndTaleProgressTriggerVolume: public PhysicsVolume
{
public:
	class RespawnAndTaleProgressComponent*                       Progress;                                          // 0x3e8(0x8)
	bool                                                         ClearProgress;                                     // 0x3f0(0x1)
	char                                                         pad0x3_Z57HQ[0x3];                                 // 0x3f1(0x3)
	int                                                          ProgressLevel;                                     // 0x3f4(0x4)
	TArray<class ProgressSpawnLocation*>                         LinkedSpawnLocation;                               // 0x3f8(0x10)
	bool                                                         SetRespawnProgress;                                // 0x408(0x1)
	bool                                                         SetRespawnProgressForWholeCrew;                    // 0x409(0x1)
	bool                                                         SetTaleProgress;                                   // 0x40a(0x1)
	bool                                                         SetTaleProgressForWholeCrew;                       // 0x40b(0x1)
	char                                                         pad0x4_ZL4YC[0x4];                                 // 0x40c(0x4)
};


// Size 0x20 (Full Size[0xd8] - InheritedSize[0xb8]
class NarratedAccessibilityComponent: public ActorComponent
{
public:
	float                                                        ContinuousNarrationCooldown;                       // 0xb8(0x4)
	char                                                         pad0xc_SFCBC[0xc];                                 // 0xbc(0xc)
	char                                                         pad0x10_HUQWF[0x10];                               // 0xc8(0x10)
};


// Size 0x30 (Full Size[0x90] - InheritedSize[0x60]
class AISpawnContextTaleQuestService: public TaleQuestService
{
public:
	class AISpawnContextTaleQuestServiceDesc*                    Desc;                                              // 0x60(0x8)
	char                                                         pad0x28_UTJ85[0x28];                               // 0x68(0x28)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MountpointInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIKnockbackActionStateId: public ActionStateId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OptInDamageableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x170] - InheritedSize[0x170]
class EnvQueryTest_InAIShipEncounterZone: public EnvQueryTest
{
public:
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class AthenaAnimationPulleyDataAsset: public DataAsset
{
public:
	class AnimSequence*                                          Entry;                                             // 0x28(0x8)
	struct AthenaAnimationPulleyDataAssetEntry                   Left;                                              // 0x30(0x20)
	struct AthenaAnimationPulleyDataAssetEntry                   Right;                                             // 0x50(0x20)
};


// Size 0x1e8 (Full Size[0x2a0] - InheritedSize[0xb8]
class BootyItemShipOwnershipComponent: public ActorComponent
{
public:
	bool                                                         FirstTimeDroppedConditionalStatTriggerSent;        // 0xb8(0x1)
	char                                                         pad0x7_E0ZT1[0x7];                                 // 0xb9(0x7)
	class Actor*                                                 OwningShip;                                        // 0xc0(0x8)
	TArray<struct Guid>                                          CrewShipsOwnedByHistory;                           // 0xc8(0x10)
	char                                                         pad0x1c8_IRARF[0x1c8];                             // 0xd8(0x1c8)
};


// Size 0xd0 (Full Size[0x188] - InheritedSize[0xb8]
class VisualHealthResponseComponent: public ActorComponent
{
public:
	class ParticleSystemComponent*                               ActiveVfx;                                         // 0xb8(0x8)
	class VisualHealthResponseDataAsset*                         VisualHealthResponseData;                          // 0xc0(0x8)
	TArray<class MaterialInstanceDynamic*>                       HealthResponseMaterials;                           // 0xc8(0x10)
	char                                                         pad0x88_W3YHM[0x88];                               // 0xd8(0x88)
	bool                                                         WaitForAllMeshChange;                              // 0x170(0x1)
	char                                                         pad0x7_FZ8L5[0x7];                                 // 0x171(0x7)
	char                                                         pad0x10_8ADKC[0x10];                               // 0x178(0x10)
};


// Size 0x0 (Full Size[0x3a0] - InheritedSize[0x3a0]
class VoyageGeneratorSim: public Actor
{
public:
};


// Size 0x250 (Full Size[0x308] - InheritedSize[0xb8]
class PlayerCrewComponent: public ActorComponent
{
public:
	char                                                         pad0xc_8U2QB[0xc];                                 // 0xb8(0xc)
	int                                                          MaxTrapsInWorld;                                   // 0xc4(0x4)
	class DartLimitsDataAsset*                                   DartLimitsDataAsset;                               // 0xc8(0x8)
	char                                                         pad0x10_T3YRA[0x10];                               // 0xd0(0x10)
	struct ObjectMessagingHandle                                 OnCrewSessionChangedEventHandle;                   // 0xf0(0x58)
	char                                                         pad0xa8_6OJF5[0xa8];                               // 0x148(0xa8)
	TArray<struct CrewMemberData>                                CrewMembers;                                       // 0x1f0(0x10)
	struct CrewShipData                                          CrewShip;                                          // 0x200(0x5)
	struct CrewMatchmakingVisibilityData                         CrewMatchmakingVisibility;                         // 0x205(0x3)
	struct CrewArenaRivalVotingData                              CrewRivalVotingData;                               // 0x208(0x2)
	char                                                         pad0x6_YG6TE[0x6];                                 // 0x20a(0x6)
	bool                                                         HasValidSpawnProgress;                             // 0x220(0x1)
	char                                                         pad0x7_IKZT7[0x7];                                 // 0x221(0x7)
	int                                                          TaleProgressLevel;                                 // 0x238(0x4)
	bool                                                         IsCaptainedSession;                                // 0x23c(0x1)
	bool                                                         IsCaptain;                                         // 0x23d(0x1)
	bool                                                         IsShipCustomizationCaptainOnly;                    // 0x23e(0x1)
	char                                                         pad0x1_I96IL[0x1];                                 // 0x23f(0x1)
	struct Guid                                                  ShipId;                                            // 0x240(0x10)
	char                                                         pad0x4_Y0CBI[0x4];                                 // 0x250(0x4)
	bool                                                         CachedLocalCrossRegionOptOutSetting;               // 0x254(0x1)
	char                                                         pad0x33_QP883[0x33];                               // 0x255(0x33)
	TArray<struct Guid>                                          StashedMaps;                                       // 0x288(0x10)
	TArray<class ItemProxy*>                                     ThrowingKnifeItemProxies;                          // 0x298(0x10)
	TArray<class ItemProxy*>                                     TrapItemProxies;                                   // 0x2f8(0x10)
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class MeshMemoryConstraintHandler: public Object
{
public:
	class Actor*                                                 MeshOwner;                                         // 0x28(0x8)
	class Object*                                                CachedMesh;                                        // 0x70(0x8)
	struct FName                                                 CachedMeshName;                                    // 0x78(0x8)
	char                                                         pad0xc0_RN6MB[0xc0];                               // 0x80(0xc0)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AthenaAnimationZiplineDataAsset: public DataAsset
{
public:
	char                                                         pad0x20_6ES2S[0x20];                               // 0x28(0x20)
	class AnimSequenceBase*                                      ActionFallbackAnimation;                           // 0x48(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MeshMemoryConstraintCategory: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WorldMarkerVariant: public Object
{
public:
};


// Size 0x20 (Full Size[0xa0] - InheritedSize[0x80]
class BlockMigrationForCrewTaskStepDesc: public TaleQuestStepDesc
{
public:
	class TaleQuestStepDesc*                                     TaskDesc;                                          // 0x80(0x8)
	struct FName                                                 RemoteConfigKeyBlockServerMigration;               // 0x88(0x8)
	struct FString                                               Reason;                                            // 0x90(0x10)
};


// Size 0x40 (Full Size[0xf8] - InheritedSize[0xb8]
class UserSettingsMapMarkProviderComponent: public ActorComponent
{
public:
	char                                                         pad0x8_3X1GJ[0x8];                                 // 0xb8(0x8)
	TArray<struct UserSettingsMapMarkDefinition>                 MarkMappings;                                      // 0xc0(0x10)
	char                                                         pad0x28_WX5DR[0x28];                               // 0xd0(0x28)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ChainLightningSourceInterface: public Interface
{
public:
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class ControllableMock: public Object
{
public:
	char                                                         pad0x10_DIWXN[0x10];                               // 0x28(0x10)
	class Actor*                                                 ActorThatRequestedStateChange;                     // 0x38(0x8)
	struct FText                                                 ObjectDisplayName;                                 // 0x40(0x38)
	struct ControlObjectActionRuleParams                         ControlObjectActionRuleParams;                     // 0x78(0x10)
	char                                                         Role;                                              // 0x88(0x1)
	bool                                                         HasAController;                                    // 0x89(0x1)
	bool                                                         CanBeControlledByActorValue;                       // 0x8a(0x1)
	char                                                         pad0x5_AO2VY[0x5];                                 // 0x8b(0x5)
};


// Size 0x138 (Full Size[0x1f0] - InheritedSize[0xb8]
class IslandMechanismSelectionComponent: public ActorComponent
{
public:
	TArray<class MechanismGroup*>                                MechanismGroups;                                   // 0xb8(0x10)
	TArray<struct FeatureToggledMechanismGroups>                 FeatureToggledMechanismGroups;                     // 0xc8(0x10)
	float                                                        CoolDownDuration;                                  // 0xd8(0x4)
	bool                                                         EnableRandomSelection;                             // 0xdc(0x1)
	char                                                         pad0x3_I4HG8[0x3];                                 // 0xdd(0x3)
	struct WeightedProbabilityRangeOfRanges                      MechanismGroupsToSelect;                           // 0xe0(0x30)
	TArray<class MechanismGroup*>                                SelectedMechanismGroups;                           // 0x110(0x10)
	char                                                         pad0xd0_Y1MCQ[0xd0];                               // 0x120(0xd0)
};


// Size 0x108 (Full Size[0x130] - InheritedSize[0x28]
class GuildChroniclesService: public Object
{
public:
	char                                                         pad0xe0_8PGXA[0xe0];                               // 0x28(0xe0)
	class GameState*                                             GameState;                                         // 0x108(0x8)
	char                                                         pad0x20_SC3FO[0x20];                               // 0x110(0x20)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class InactivityTrackerInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0x98] - InheritedSize[0x78]
class MeleeSpinAIAbility: public AthenaAIAbility
{
public:
	struct MeleeAIAbilityAngleChecker                            AngleChecker;                                      // 0x78(0x18)
	char                                                         pad0x8_56ONG[0x8];                                 // 0x90(0x8)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class BoogieStatus: public StatusBase
{
public:
};


// Size 0x18 (Full Size[0xd0] - InheritedSize[0xb8]
class ReapersMarkTrackedItemComponent: public ActorComponent
{
public:
	char                                                         pad0x10_2WG35[0x10];                               // 0xb8(0x10)
	char                                                         ItemType;                                          // 0xc8(0x1)
	char                                                         pad0x7_779EJ[0x7];                                 // 0xc9(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ConsumableInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class ReapersTributeShipEventBannersDataAsset: public DataAsset
{
public:
	class GameEventBannerDataAsset*                              ApproachedAIControlledReapersTributeShipBanner;    // 0x28(0x8)
	class GameEventBannerDataAsset*                              DefeatedReapersTributeShipBanner;                  // 0x30(0x8)
	class GameEventBannerDataAsset*                              PledgedToReapersTributeShipBanner;                 // 0x38(0x8)
	class GameEventBannerDataAsset*                              ApproachedPlayerControlledReapersTributeShipBanner; // 0x40(0x8)
	class GameEventBannerDataAsset*                              DefeatedWhileControllingReapersTributeShipBanner;  // 0x48(0x8)
	class GameEventBannerDataAsset*                              HandedInReapersTributeShipBanner;                  // 0x50(0x8)
	float                                                        ReapersTributeShipHandInBannersDelay;              // 0x58(0x4)
	char                                                         pad0x4_NUGU2[0x4];                                 // 0x5c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnvQueryContext_OccupiedPositionsOnIsland: public EnvQueryContext
{
public:
};


// Size 0x198 (Full Size[0x288] - InheritedSize[0xf0]
class ItemPreviewComponent: public CoherentUIGTRenderToTextureLiveView
{
public:
	char                                                         pad0x8_WC1IL[0x8];                                 // 0xf0(0x8)
	struct StringAssetReference                                  FallbackPreviewIconAsset;                          // 0xf8(0x10)
	class UClass*                                                RequiredPreviewObjectClass;                        // 0x108(0x8)
	struct FName                                                 DefaultCamera;                                     // 0x110(0x8)
	class UClass*                                                ClassToSpawn;                                      // 0x118(0x8)
	struct IntPoint                                              DefaultResolution;                                 // 0x120(0x8)
	class RenderToTextureSceneDetails*                           Details;                                           // 0x128(0x8)
	struct StringAssetReference                                  RequestedAssetReference;                           // 0x130(0x10)
	struct StringAssetReference                                  ActiveAssetReference;                              // 0x140(0x10)
	class Actor*                                                 InteractionActor;                                  // 0x150(0x8)
	struct ItemPreviewView                                       CurrentView;                                       // 0x1c0(0x18)
	char                                                         pad0xa0_E4YO0[0xa0];                               // 0x1d8(0xa0)
	TArray<struct CategoryPreviewEntry>                          CategoryReplacementMap;                            // 0x278(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TelemetryDispatcherRetrievalInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x3b0] - InheritedSize[0x3a0]
class GhostShipTickManager: public Actor
{
public:
	TArray<class Actor*>                                         GhostShipActors;                                   // 0x3a0(0x10)
};


// Size 0x38 (Full Size[0x70] - InheritedSize[0x38]
class LocationMapSettings: public DeveloperSettings
{
public:
	class UClass*                                                LocationMapItemDescClass;                          // 0x38(0x8)
	struct StringAssetReference                                  DefaultParams;                                     // 0x40(0x10)
	char                                                         DefaultMapBlendMode;                               // 0x50(0x1)
	char                                                         DefaultBannerBlendMode;                            // 0x51(0x1)
	char                                                         DefaultVaultSymbolBlendMode;                       // 0x52(0x1)
	char                                                         pad0x5_OUCYE[0x5];                                 // 0x53(0x5)
	struct StringAssetReference                                  DefaultChest;                                      // 0x58(0x10)
	char                                                         DefaultChestBlendMode;                             // 0x68(0x1)
	char                                                         pad0x7_GMX0Y[0x7];                                 // 0x69(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ExperienceServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SecondaryItemUsePressedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0xc0 (Full Size[0x460] - InheritedSize[0x3a0]
class MockHitReactionActor: public Actor
{
public:
	char                                                         pad0x10_NQYXH[0x10];                               // 0x3a0(0x10)
	class MockHitReactionComponent*                              MockHitReactionComponent;                          // 0x3b0(0x8)
	char                                                         pad0xa8_6RDED[0xa8];                               // 0x3b8(0xa8)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class SendCrewToTunnelOfTheDamnedTaleStepDesc: public TaleQuestStepDesc
{
public:
	class TunnelDesc*                                            TunnelDesc;                                        // 0x80(0x8)
	struct QuestVariableBool                                     Success;                                           // 0x88(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ProjectileServiceInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PirateLegendSection: public DataAsset
{
public:
	char                                                         SectionType;                                       // 0x28(0x1)
	char                                                         pad0x7_IKG2E[0x7];                                 // 0x29(0x7)
	class TaleQuestDescAsset*                                    QuestDescription;                                  // 0x30(0x8)
};


// Size 0x18 (Full Size[0xd0] - InheritedSize[0xb8]
class NPCConversationParticipantComponent: public ActorComponent
{
public:
	char                                                         pad0x8_ITMV9[0x8];                                 // 0xb8(0x8)
	TArray<class Class*>                                         SupportedConversationTypes;                        // 0xc0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AwardableInterface: public Interface
{
public:
};


// Size 0x50 (Full Size[0xd0] - InheritedSize[0x80]
class TaleQuestSpawnFishingFishStepDesc: public TaleQuestStepDesc
{
public:
	struct Vector                                                SpawnBoxExtent;                                    // 0x80(0xc)
	float                                                        SpawnerDistanceFromWaterSurface;                   // 0x8c(0x4)
	bool                                                         SpawnBoxHiddenInGame;                              // 0x90(0x1)
	char                                                         pad0x7_PJDQV[0x7];                                 // 0x91(0x7)
	class AvailableFishForSpawning*                              CustomFishToSpawnList;                             // 0x98(0x8)
	struct QuestVariableFishingFishSpawner                       FishingFishSpawner;                                // 0xa0(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class KillableCharacterInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x70] - InheritedSize[0x60]
class TaleVaultService: public TaleQuestService
{
public:
	class PuzzleVault*                                           Vault;                                             // 0x60(0x8)
	class VaultPuzzleDataAsset*                                  SolutionAsset;                                     // 0x68(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaAnimationLocomotionComponentFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class NonVerbalRadialInventoryDeactivatedGamepadNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class ParticleSystemPickerAsset: public DataAsset
{
public:
	struct ParticleSystemPicker                                  ParticleSystems;                                   // 0x28(0x20)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WorldMarkerRepresentationInterface: public Interface
{
public:
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class ItemSpawnData: public Object
{
public:
	char                                                         pad0x60_5TQTP[0x60];                               // 0x28(0x60)
};


// Size 0xd0 (Full Size[0x188] - InheritedSize[0xb8]
class AthenaCharacterKnockbackComponent: public ActorComponent
{
public:
	char                                                         pad0x8_D8078[0x8];                                 // 0xb8(0x8)
	bool                                                         Disabled;                                          // 0xc0(0x1)
	char                                                         pad0x7_R4FU4[0x7];                                 // 0xc1(0x7)
	class AthenaCharacter*                                       Character;                                         // 0xc8(0x8)
	char                                                         pad0xb8_G0B1P[0xb8];                               // 0xd0(0xb8)
};


// Size 0x858 (Full Size[0x880] - InheritedSize[0x28]
class AthenaAITeamsService: public Object
{
public:
	char                                                         pad0x858_SEV6X[0x858];                             // 0x28(0x858)
};


// Size 0xf8 (Full Size[0x120] - InheritedSize[0x28]
class ChestOfRageDataAsset: public DataAsset
{
public:
	float                                                        DormantDuration;                                   // 0x28(0x4)
	float                                                        RageBuildingDuration;                              // 0x2c(0x4)
	float                                                        TimeInToRageBuildingToAbsorbWater;                 // 0x30(0x4)
	float                                                        SteamingDuration;                                  // 0x34(0x4)
	float                                                        TimeInToSteamingStateWhereHitWillCauseInstantExplosion; // 0x38(0x4)
	float                                                        OnFireDuration;                                    // 0x3c(0x4)
	float                                                        InWaterCoolingRate;                                // 0x40(0x4)
	float                                                        ForcedInWaterCoolingRate;                          // 0x44(0x4)
	float                                                        InRainCoolingRate;                                 // 0x48(0x4)
	float                                                        WaterHeightCheckOffset;                            // 0x4c(0x4)
	class CurveFloat*                                            TimeToRemovePerSplash;                             // 0x50(0x8)
	float                                                        HealthChangePerSecondWhilstCarryingASteamingChest; // 0x58(0x4)
	float                                                        PercentageToHeatHullWaterPerSecond;                // 0x5c(0x4)
	float                                                        ChestInSuperheatedWaterSteadyStatePercentage;      // 0x60(0x4)
	char                                                         pad0x4_VYUNX[0x4];                                 // 0x64(0x4)
	class CurveFloat*                                            RageLevelToMaterialParameterValue;                 // 0x68(0x8)
	class Object*                                                RageBuildingVfx;                                   // 0x70(0x8)
	float                                                        MinimumRageValueToTriggerRageBuildingVfx;          // 0x78(0x4)
	char                                                         pad0x4_OZTUW[0x4];                                 // 0x7c(0x4)
	class Object*                                                SteamingVfx;                                       // 0x80(0x8)
	class Object*                                                OnFireVfx;                                         // 0x88(0x8)
	class Object*                                                ExplosionVfx;                                      // 0x90(0x8)
	class Object*                                                CooledDownSteamBlast;                              // 0x98(0x8)
	class Object*                                                OnTakingDamageVfx;                                 // 0xa0(0x8)
	class WwiseEvent*                                            OnTakingDamageSfx;                                 // 0xa8(0x8)
	float                                                        WhistlingOneShotSfxDelay;                          // 0xb0(0x4)
	char                                                         pad0x4_XCOS8[0x4];                                 // 0xb4(0x4)
	class WwiseEvent*                                            StartWhistlingOneShotSfx;                          // 0xb8(0x8)
	class WwiseEvent*                                            StartWhistlingSfx;                                 // 0xc0(0x8)
	class WwiseEvent*                                            StopWhistlingSfx;                                  // 0xc8(0x8)
	class WwiseEvent*                                            StartRageBuildingSfx;                              // 0xd0(0x8)
	class WwiseEvent*                                            StopRageBuildingSfx;                               // 0xd8(0x8)
	class WwiseEvent*                                            ExplosionSfx;                                      // 0xe0(0x8)
	class WwiseEvent*                                            ExtinguishedSfx;                                   // 0xe8(0x8)
	class WwiseObjectPoolWrapper*                                AudioSFXPool;                                      // 0xf0(0x8)
	bool                                                         CanDamageChestOfRage;                              // 0xf8(0x1)
	char                                                         pad0x7_AV3XQ[0x7];                                 // 0xf9(0x7)
	TArray<struct ChestOfRageDamageTableEntry>                   DamageTable;                                       // 0x100(0x10)
	TArray<struct ChestOfRageShipSizeDamageTableOverride>        ShipSizeDamageTableOverride;                       // 0x110(0x10)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class DiscardTransientActorStep: public TaleQuestStep
{
public:
	class DiscardTransientActorStepDesc*                         Desc;                                              // 0x98(0x8)
};


// Size 0x8 (Full Size[0x148] - InheritedSize[0x140]
class PuzzleStatueInteractableComponent: public InteractableComponent
{
public:
	class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x140(0x8)
};


// Size 0x90 (Full Size[0x148] - InheritedSize[0xb8]
class ChainLightningReceiverComponent: public ActorComponent
{
public:
	char                                                         pad0x8_7VVG8[0x8];                                 // 0xb8(0x8)
	float                                                        ShockDuration;                                     // 0xc0(0x4)
	char                                                         pad0x84_IQBXL[0x84];                               // 0xc4(0x84)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventSchedulerDebugFunctions: public Object
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class BalanceableWalkwaySprintPressedInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StormServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StreamingLocationInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class GoldInContainerDataAsset: public DataAsset
{
public:
	TArray<struct GoldInContainerData>                           GoldData;                                          // 0x28(0x10)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class RewardedCurrencyConditionalStatsData: public Object
{
public:
	char                                                         pad0x30_MGLYZ[0x30];                               // 0x28(0x30)
};


// Size 0x40 (Full Size[0xc8] - InheritedSize[0x88]
class BTTask_RowToTarget: public BTTask_BlackboardBase
{
public:
	char                                                         pad0x40_1CO44[0x40];                               // 0x88(0x40)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class GlobalVoyageDirectorServiceSettings: public DeveloperSettings
{
public:
	TArray<struct DirectorSettingEntry>                          DefaultGlobalVoyages;                              // 0x38(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NetworkedEventsWhitelistDefinition: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SailManipulatorBlueprintFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x88 (Full Size[0x590] - InheritedSize[0x508]
class ServerIslandPerfTestGameState: public ServiceProviderGameState
{
public:
	char                                                         pad0x58_EWWVH[0x58];                               // 0x508(0x58)
	struct GameServiceCoordinator                                ServiceCoordinator;                                // 0x560(0x20)
	class PerfTestIslandService*                                 IslandService;                                     // 0x580(0x8)
	class FFTWaterService*                                       WaterService;                                      // 0x588(0x8)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class CaptainsVoyageRecipesDebugMenuGenerator: public DebugMenuEntryGenerator
{
public:
	bool                                                         Regenerate;                                        // 0x28(0x1)
	char                                                         pad0x7_ZP526[0x7];                                 // 0x29(0x7)
	TArray<struct StringClassReference>                          Proposals;                                         // 0x30(0x10)
	TArray<String>                                               AssetNames;                                        // 0x40(0x10)
};


// Size 0x180 (Full Size[0x2c0] - InheritedSize[0x140]
class RepairableComponent: public InteractableComponent
{
public:
	char                                                         pad0x48_1WWJ5[0x48];                               // 0x140(0x48)
	float                                                        InteractionPointDepthOffset;                       // 0x188(0x4)
	float                                                        MaximumRepairAngleToRepairer;                      // 0x18c(0x4)
	float                                                        MaximumRepairDistance;                             // 0x190(0x4)
	float                                                        RepairTime;                                        // 0x194(0x4)
	class UClass*                                                RepairType;                                        // 0x198(0x8)
	class SceneComponent*                                        RepairMountParent;                                 // 0x1a0(0x8)
	char                                                         pad0x8_BS1IS[0x8];                                 // 0x1a8(0x8)
	struct Transform                                             RepairMountOffset;                                 // 0x1b0(0x30)
	struct FName                                                 RepairMountSocket;                                 // 0x1e0(0x8)
	class UClass*                                                AIInteractionType;                                 // 0x1e8(0x8)
	struct Vector                                                AIInteractionOffset;                               // 0x1f0(0xc)
	int                                                          MaxDamageLevel;                                    // 0x1fc(0x4)
	TArray<struct RepairableComponentMaxDamageLevelOverride>     MaxDamageLevelOverrides;                           // 0x200(0x10)
	struct RepairableAuthoritiveRepairState                      AuthorityRepairableState;                          // 0x210(0x18)
	char                                                         RepairableState;                                   // 0x228(0x1)
	char                                                         pad0x3_CECVK[0x3];                                 // 0x229(0x3)
	int                                                          DamageLevel;                                       // 0x22c(0x4)
	char                                                         InteractionState;                                  // 0x230(0x1)
	char                                                         pad0x8f_6Y0VV[0x8f];                               // 0x231(0x8f)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class TurnRateWithFixedSensitivityAnalogInputId: public AnalogInputId
{
public:
};


// Size 0xc8 (Full Size[0x100] - InheritedSize[0x38]
class ReapersTributeShipEventSettings: public DeveloperSettings
{
public:
	struct StringAssetReference                                  ReapersTributeShipEventSpawnDataAsset;             // 0x38(0x10)
	struct StringAssetReference                                  AIControlledShipParamsDataAsset;                   // 0x48(0x10)
	struct StringAssetReference                                  PlayerControlledShipParamsDataAsset;               // 0x58(0x10)
	struct ReapersTributeBandRewardSet                           TributeBandRewardSet;                              // 0x68(0x10)
	struct StringAssetReference                                  ReapersTributeShipDefeatedStateDataAsset;          // 0x98(0x10)
	struct StringClassReference                                  HandInCompany;                                     // 0xa8(0x10)
	struct StringAssetReference                                  ReapersTributeCutsceneDataAsset;                   // 0xb8(0x10)
	struct StringAssetReference                                  GameEventAvailabilityParamsDataAsset;              // 0xc8(0x10)
	int                                                          HighAmountOfTributeForCrewStat;                    // 0xd8(0x4)
	char                                                         pad0x4_ZGQ4S[0x4];                                 // 0xdc(0x4)
	struct StringAssetReference                                  ReapersTributeShipEventBannersDataAsset;           // 0xe0(0x10)
	struct StringAssetReference                                  ReapersTributeShipEventPopupsDataAsset;            // 0xf0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StorageContainerInterface: public Interface
{
public:
};


// Size 0x330 (Full Size[0x358] - InheritedSize[0x28]
class CharacterAudioComponentParams: public DataAsset
{
public:
	class WwiseObjectPoolWrapper*                                CharacterAudioPool;                                // 0x28(0x8)
	class WwiseEvent*                                            CausedDamageAudioEvent;                            // 0x30(0x8)
	class WwiseEvent*                                            CausedDamageAudioEventNonMusic;                    // 0x38(0x8)
	class WwiseEvent*                                            CausedAIShipDamageAudioEvent;                      // 0x40(0x8)
	class WwiseEvent*                                            CausedAggressiveGhostShipDamageAudioEvent;         // 0x48(0x8)
	class WwiseEvent*                                            ReapersTributeShipCausedCannonDamageAudioEvent;    // 0x50(0x8)
	class WwiseEvent*                                            CharacterDeadAudioEvent;                           // 0x58(0x8)
	class WwiseEvent*                                            KilledCharacterAudioEvent;                         // 0x60(0x8)
	class WwiseEvent*                                            KilledCharacterSfxEvent;                           // 0x68(0x8)
	class WwiseEvent*                                            KilledCharacterAudioAssistSfxEvent;                // 0x70(0x8)
	class WwiseEvent*                                            LocalPlayerFireStart;                              // 0x78(0x8)
	class WwiseEvent*                                            LocalPlayerFireStop;                               // 0x80(0x8)
	class WwiseEvent*                                            RemotePlayerFireStart;                             // 0x88(0x8)
	class WwiseEvent*                                            RemotePlayerFireStop;                              // 0x90(0x8)
	class WwiseEvent*                                            LocalPlayerStunStart;                              // 0x98(0x8)
	class WwiseEvent*                                            LocalPlayerStunStop;                               // 0xa0(0x8)
	class WwiseEvent*                                            RemotePlayerStunStart;                             // 0xa8(0x8)
	class WwiseEvent*                                            RemotePlayerStunStop;                              // 0xb0(0x8)
	class WwiseEvent*                                            LocalPlayerExtinguished;                           // 0xb8(0x8)
	class WwiseEvent*                                            RemotePlayerExtinguished;                          // 0xc0(0x8)
	struct StateCategoryGroup                                    CharacterState;                                    // 0xc8(0x20)
	class WwiseEvent*                                            PlayCharacterRespawn;                              // 0xe8(0x8)
	struct FName                                                 CharacterStateDead;                                // 0xf0(0x8)
	struct FName                                                 CharacterStateFall;                                // 0xf8(0x8)
	struct FName                                                 CharacterStateStun;                                // 0x100(0x8)
	struct FName                                                 CharacterStateFire;                                // 0x108(0x8)
	struct FName                                                 CharacterStateDefault;                             // 0x110(0x8)
	struct FName                                                 CharacterStateTeleporting;                         // 0x118(0x8)
	struct FName                                                 CharacterStateSleeping;                            // 0x120(0x8)
	class WwiseEvent*                                            PlayPlayerVengeance;                               // 0x128(0x8)
	class WwiseEvent*                                            StopPlayerVengeance;                               // 0x130(0x8)
	class WwiseEvent*                                            PlayPlayerVengeanceFinished;                       // 0x138(0x8)
	struct FName                                                 PlayerVengeanceRTPC;                               // 0x140(0x8)
	float                                                        PlayerVengeanceMaxRtpc;                            // 0x148(0x4)
	char                                                         pad0x4_EZ9RQ[0x4];                                 // 0x14c(0x4)
	TArray<struct DamageTypeToAudio>                             ExplosionSoundEvents;                              // 0x150(0x10)
	class WwiseEvent*                                            PlayPlayerSlidingDownLadder;                       // 0x160(0x8)
	class WwiseEvent*                                            StopPlayerSlidingDownLadder;                       // 0x168(0x8)
	struct FName                                                 LadderSlideSpeedRtpc;                              // 0x170(0x8)
	class WwiseEvent*                                            LadderUse;                                         // 0x178(0x8)
	class WwiseEvent*                                            CannonUse;                                         // 0x180(0x8)
	class WwiseEvent*                                            WheelUse;                                          // 0x188(0x8)
	class WwiseEvent*                                            SailManipulatorUse;                                // 0x190(0x8)
	class WwiseEvent*                                            CharacterTorsoEnteredWater;                        // 0x198(0x8)
	class WwiseEvent*                                            CharacterTorsoExitedWater;                         // 0x1a0(0x8)
	class WwiseEvent*                                            CharacterLeftWaterToBoatLadder;                    // 0x1a8(0x8)
	struct FName                                                 PlayerSpeedRtpc;                                   // 0x1b0(0x8)
	float                                                        PlayerSpeedRtpcMin;                                // 0x1b8(0x4)
	float                                                        PlayerSpeedRtpcMax;                                // 0x1bc(0x4)
	struct FName                                                 PlayerLadderWaterExitSpeedRtpc;                    // 0x1c0(0x8)
	float                                                        PlayerLadderWaterExitSpeedMin;                     // 0x1c8(0x4)
	float                                                        PlayerLadderWaterExitSpeedMax;                     // 0x1cc(0x4)
	struct FName                                                 BoatSpeedForSeaRocksAmplificationRtpc;             // 0x1d0(0x8)
	float                                                        BoatSpeedForSeaRocksMax;                           // 0x1d8(0x4)
	struct FName                                                 BrokeLegSwitchGroupName;                           // 0x1dc(0x8)
	struct FName                                                 BrokeLegSwitch;                                    // 0x1e4(0x8)
	struct FName                                                 HealedLegSwitch;                                   // 0x1ec(0x8)
	struct FName                                                 FallDamageRTPC;                                    // 0x1f4(0x8)
	char                                                         pad0x4_U0EDB[0x4];                                 // 0x1fc(0x4)
	TArray<struct HealthChangeAudio>                             HealthChangeSfx;                                   // 0x200(0x10)
	class WwiseEvent*                                            LocalPlayerTeleportPlay;                           // 0x210(0x8)
	class WwiseEvent*                                            LocalPlayerTeleportStop;                           // 0x218(0x8)
	class AudioSpaceDataAsset*                                   LargeShipMapDeck;                                  // 0x220(0x8)
	class AudioSpaceDataAsset*                                   LargeShipBrigDeck;                                 // 0x228(0x8)
	class AudioSpaceDataAsset*                                   LargeShipCaptainsCabin;                            // 0x230(0x8)
	class AudioSpaceDataAsset*                                   IslandTavern;                                      // 0x238(0x8)
	class AudioSpaceDataAsset*                                   IslandCave;                                        // 0x240(0x8)
	float                                                        SmallestEnclosedRatioToTriggerCave;                // 0x248(0x4)
	char                                                         PredominantCaveSurface;                            // 0x24c(0x1)
	char                                                         pad0x3_RB0S7[0x3];                                 // 0x24d(0x3)
	float                                                        LargestCaveSizeMetersSquared;                      // 0x250(0x4)
	float                                                        SmallestCaveSizeMetersSquared;                     // 0x254(0x4)
	struct FName                                                 CaveSizeRtpcName;                                  // 0x258(0x8)
	float                                                        SmallestEnclosedRatioToTriggerCaveMusicNode;       // 0x260(0x4)
	float                                                        LandingEventCooldownTime;                          // 0x264(0x4)
	class WwiseEvent*                                            PortableHarpoonGrappleStarted;                     // 0x268(0x8)
	class WwiseEvent*                                            PortableHarpoonGrappleEnded;                       // 0x270(0x8)
	float                                                        FogPenetrationAudioThresholdMin;                   // 0x278(0x4)
	float                                                        FogPenetrationAudioThresholdMax;                   // 0x27c(0x4)
	struct FName                                                 FogDensityRTPC;                                    // 0x280(0x8)
	TArray<struct FogTypeToAudio>                                FogTypeSfx;                                        // 0x288(0x10)
	class WwiseEvent*                                            TrapTriggeredEvent;                                // 0x298(0x8)
	class WwiseEvent*                                            EmoteCameraStart;                                  // 0x2a0(0x8)
	class WwiseEvent*                                            EmoteCameraStop;                                   // 0x2a8(0x8)
	class WwiseEvent*                                            ReviveSuccessful;                                  // 0x2b0(0x8)
	class WwiseEvent*                                            OtherPlayers_BodyEvaporates;                       // 0x2b8(0x8)
	class WwiseEvent*                                            StartSleepingEvent;                                // 0x2c0(0x8)
	class WwiseEvent*                                            StopSleepingEvent;                                 // 0x2c8(0x8)
	class WwiseEvent*                                            StartSleepingWithoutFartingEvent;                  // 0x2d0(0x8)
	class WwiseEvent*                                            StopSleepingWithoutFartingEvent;                   // 0x2d8(0x8)
	struct FName                                                 GenderSwitchGroupName;                             // 0x2e0(0x8)
	struct FName                                                 GenderSwitchFemale;                                // 0x2e8(0x8)
	struct FName                                                 GenderSwitchMale;                                  // 0x2f0(0x8)
	class WwiseEvent*                                            AimAssistDirectlyOverTargetStart;                  // 0x2f8(0x8)
	class WwiseEvent*                                            AimAssistDirectlyOverTargetStop;                   // 0x300(0x8)
	class WwiseEvent*                                            AimAssistNearTargetStart;                          // 0x308(0x8)
	class WwiseEvent*                                            AimAssistNearTargetStop;                           // 0x310(0x8)
	struct FName                                                 AimAssistPercentageAwayFromTargetRTPC;             // 0x318(0x8)
	struct FName                                                 AimAssistPercentageXOffsetRTPC;                    // 0x320(0x8)
	struct FName                                                 AimAssistPercentageYOffsetRTPC;                    // 0x328(0x8)
	class WwiseEvent*                                            PlayLensZoom;                                      // 0x330(0x8)
	class WwiseEvent*                                            StopLensZoom;                                      // 0x338(0x8)
	class WwiseEvent*                                            PlayLensRetract;                                   // 0x340(0x8)
	class WwiseEvent*                                            PlayZoomLoop;                                      // 0x348(0x8)
	class WwiseEvent*                                            StopZoomLoop;                                      // 0x350(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EventFortKeyInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FishingActionStateId: public ActionStateId
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class NPCIdAsset: public DataAsset
{
public:
	TArray<struct Name>                                          NPCIds;                                            // 0x28(0x10)
};


// Size 0x20 (Full Size[0x460] - InheritedSize[0x440]
class CannonAnimInstance: public AnimInstance
{
public:
	char                                                         pad0x8_DEYMS[0x8];                                 // 0x440(0x8)
	bool                                                         CannonIsFiring;                                    // 0x448(0x1)
	char                                                         pad0x3_8B7QL[0x3];                                 // 0x449(0x3)
	float                                                        CannonFiringAnimBlend;                             // 0x44c(0x4)
	float                                                        Pitch;                                             // 0x450(0x4)
	float                                                        YawRangeMapped;                                    // 0x454(0x4)
	char                                                         pad0x8_AW76W[0x8];                                 // 0x458(0x8)
};


// Size 0x58 (Full Size[0x90] - InheritedSize[0x38]
class BootyStorageSettings: public DeveloperSettings
{
public:
	float                                                        StoreHoldTime;                                     // 0x38(0x4)
	float                                                        RetrieveHoldTime;                                  // 0x3c(0x4)
	float                                                        PickupPointSpawnDepth;                             // 0x40(0x4)
	float                                                        PickupDismissDuration;                             // 0x44(0x4)
	float                                                        ReapersTributeShipPickupDismissDistanceCheck;      // 0x48(0x4)
	float                                                        LargeShipPickupDismissDistanceCheck;               // 0x4c(0x4)
	float                                                        MediumShipPickupDismissDistanceCheck;              // 0x50(0x4)
	float                                                        SmallShipPickupDismissDistanceCheck;               // 0x54(0x4)
	char                                                         MaxStoragePerLocation;                             // 0x58(0x1)
	char                                                         pad0x7_3643P[0x7];                                 // 0x59(0x7)
	struct StringAssetReference                                  BootyStorageSettingsAsset;                         // 0x60(0x10)
	TArray<class Class*>                                         BlacklistedCategories;                             // 0x70(0x10)
	TArray<class Class*>                                         WhitelistedItems;                                  // 0x80(0x10)
};


// Size 0x18 (Full Size[0x50] - InheritedSize[0x38]
class StatusResponseAddManagedVulnerabilityLayer: public StatusResponse
{
public:
	struct FName                                                 VulnerabilityName;                                 // 0x38(0x8)
	class DamageableVulnerabilityLayer*                          VulnerabilityToApply;                              // 0x40(0x8)
	bool                                                         CancelVulnerabilityOnDeactivate;                   // 0x48(0x1)
	char                                                         pad0x3_A5RQR[0x3];                                 // 0x49(0x3)
	float                                                        VulnerabilityDuration;                             // 0x4c(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class RadialAction: public Object
{
public:
	class UClass*                                                InputID;                                           // 0x28(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class IdentifiedAsShipInterface: public Interface
{
public:
};


// Size 0x110 (Full Size[0x138] - InheritedSize[0x28]
class VoyageGeneratorSimResult: public Object
{
public:
	char                                                         pad0x100_5VW4R[0x100];                             // 0x28(0x100)
	struct Vector                                                StartingLocation;                                  // 0x128(0xc)
	char                                                         pad0x4_G6CWM[0x4];                                 // 0x134(0x4)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class EmotesRadialActivatedGamepadNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class LightningManagerDataAsset: public DataAsset
{
public:
	float                                                        LightningTargetHeightThreshold;                    // 0x28(0x4)
	float                                                        ShipNearMissMaxX;                                  // 0x2c(0x4)
	float                                                        ShipNearMissMaxY;                                  // 0x30(0x4)
	float                                                        NearPlayerMinRadius;                               // 0x34(0x4)
	float                                                        NearPlayerMaxRadius;                               // 0x38(0x4)
	float                                                        InactiveTimePerTest;                               // 0x3c(0x4)
	float                                                        NearbyGhostShipEncounterRadiusInMetres;            // 0x40(0x4)
	char                                                         pad0x4_0PP23[0x4];                                 // 0x44(0x4)
	TArray<struct LightningStrikeFrequency>                      LightningStrikeFrequency;                          // 0x48(0x10)
	struct LightningTargetSelector                               TargetSelector;                                    // 0x58(0x10)
};


// Size 0x58 (Full Size[0x3f8] - InheritedSize[0x3a0]
class VolumeMechanismTrigger: public Actor
{
public:
	class MechanismTriggerComponent*                             MechanismTriggerComponent;                         // 0x3a0(0x8)
	class BoxComponent*                                          TriggerVolume;                                     // 0x3a8(0x8)
	bool                                                         UsePerCrewOverlaps;                                // 0x3b0(0x1)
	char                                                         pad0x3_HBHZ7[0x3];                                 // 0x3b1(0x3)
	int                                                          PerCrewOverlapCooldownTimeInSeconds;               // 0x3b4(0x4)
	char                                                         pad0x40_5364O[0x40];                               // 0x3b8(0x40)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleVaultServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class MechanismEvent: public Object
{
public:
	class Actor*                                                 Owner;                                             // 0x28(0x8)
	char                                                         pad0x8_GDDUL[0x8];                                 // 0x30(0x8)
};


// Size 0x0 (Full Size[0x40] - InheritedSize[0x40]
class TeleportLungeAbilityStageParams: public AthenaAIAbilityStageParams
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EntitlementRedirectorDataAsset: public DataAsset
{
public:
	TArray<struct EntitlementRedirectorEntry>                    Redirectors;                                       // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ExhumableInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x2e0] - InheritedSize[0x2d0]
class AirBubbleComponent: public SceneComponent
{
public:
	float                                                        Radius;                                            // 0x2d0(0x4)
	char                                                         pad0xc_HA38X[0xc];                                 // 0x2d4(0xc)
};


// Size 0x2d8 (Full Size[0x390] - InheritedSize[0xb8]
class StorageContainerComponent: public ActorComponent
{
public:
	char                                                         pad0x20_IPV2T[0x20];                               // 0xb8(0x20)
	struct FText                                                 ContainerDisplayName;                              // 0xd8(0x38)
	bool                                                         ShowCapacityInDescription;                         // 0x110(0x1)
	char                                                         pad0xf_BJNZE[0xf];                                 // 0x111(0xf)
	struct Transform                                             InstanceTransform;                                 // 0x120(0x30)
	struct StorageContainerBackingStore                          ContainerNodes;                                    // 0x150(0x38)
	struct StorageContainerReplicatedContainerNodes              ReplicatedContainerNodes;                          // 0x188(0x40)
	TArray<uintptr_t>                                            QuickGivers;                                       // 0x218(0x10)
	TArray<uintptr_t>                                            QuickTakers;                                       // 0x228(0x10)
	class WwiseEvent*                                            AddItemSFX;                                        // 0x238(0x8)
	class WwiseEvent*                                            TakeItemSFX;                                       // 0x240(0x8)
	class WwiseEvent*                                            OpenContainerSFX;                                  // 0x248(0x8)
	class WwiseEvent*                                            BeginQuickGiveSFX;                                 // 0x250(0x8)
	class WwiseEvent*                                            EndQuickGiveSFX;                                   // 0x258(0x8)
	class WwiseEvent*                                            BeginQuickTakeSFX;                                 // 0x260(0x8)
	class WwiseEvent*                                            EndQuickTakeSFX;                                   // 0x268(0x8)
	class StorageContainerContentTypeSelector*                   CrateFillerContainerSelector;                      // 0x270(0x8)
	class StorageContainerContentTypeSelector*                   StorageContainerSelector;                          // 0x278(0x8)
	char                                                         pad0x28_OAQTY[0x28];                               // 0x280(0x28)
	class WwiseObjectPoolWrapper*                                SfxPool;                                           // 0x2a8(0x8)
	char                                                         pad0xd8_PD211[0xd8];                               // 0x2b0(0xd8)
	class Object*                                                Aggregator;                                        // 0x388(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaPlayerCharacterTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x128 (Full Size[0x1a8] - InheritedSize[0x80]
class CreateDigsiteTaleStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableVector                                   InDigsiteLocation;                                 // 0x80(0x30)
	struct QuestVariableFloat                                    InDigsiteRadius;                                   // 0xb0(0x30)
	struct QuestVariableGuid                                     InAssociatedCrewId;                                // 0xe0(0x30)
	struct QuestVariableInt                                      OutDigsiteID;                                      // 0x110(0x30)
	struct QuestVariableUObject                                  OutDigsiteObject;                                  // 0x140(0x30)
	struct QuestVariableBool                                     OutDigsiteHasBeenCompleted;                        // 0x170(0x30)
	bool                                                         AutoRemoveEmptyHoles;                              // 0x1a0(0x1)
	char                                                         pad0x7_QC044[0x7];                                 // 0x1a1(0x7)
};


// Size 0xb8 (Full Size[0xe0] - InheritedSize[0x28]
class DeliverableRedirectionNPCContext: public DeliverableRedirectionContextBase
{
public:
	struct NPCData                                               NPCData;                                           // 0x28(0xb8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GhostShipTimingInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class SetTaleProgressStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    TriggerVolume;                                     // 0x80(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ReapersTributeShipInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0x2f0] - InheritedSize[0x2d0]
class AtmosphericPressureZoneComponent: public SceneComponent
{
public:
	char                                                         pad0x8_LUZCG[0x8];                                 // 0x2d0(0x8)
	struct AtmosphericPressureZoneParameters                     PressureZoneParameters;                            // 0x2d8(0x14)
	char                                                         pad0x4_LXMOD[0x4];                                 // 0x2ec(0x4)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class ChainLightningVisualActorSettingsAsset: public DataAsset
{
public:
	class StaticMesh*                                            MeshAsset;                                         // 0x28(0x8)
	class MaterialInterface*                                     MaterialAsset;                                     // 0x30(0x8)
	class WwiseEvent*                                            ChainLightningCreatedOneShot;                      // 0x38(0x8)
	class WwiseObjectPoolWrapper*                                ChainLightningVisualActorPool;                     // 0x40(0x8)
	class Object*                                                PropogationVfx;                                    // 0x48(0x8)
};


// Size 0x28 (Full Size[0xe0] - InheritedSize[0xb8]
class NamedPointsComponent: public ActorComponent
{
public:
	char                                                         pad0x20_PXLI8[0x20];                               // 0xb8(0x20)
	class NamedPointsCollectionListDataAsset*                    NamedPointsAsset;                                  // 0xd8(0x8)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class CharacterAudioEventControllerParams: public DataAsset
{
public:
	class WwiseEvent*                                            WieldEvent;                                        // 0x28(0x8)
	class WwiseEvent*                                            StowEvent;                                         // 0x30(0x8)
	class WwiseEvent*                                            EnemyHitNotifyEvent;                               // 0x38(0x8)
	class WwiseEvent*                                            EnemyHitWithAimAssistAudioOnNotifyEvent;           // 0x40(0x8)
	class WwiseObjectPoolWrapper*                                EnemyHitNotifyPool;                                // 0x48(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MountableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SprintActivationNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class RadialSlotCounterClockwiseNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class GetIslandLocationStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableName                                     IslandName;                                        // 0x80(0x30)
	struct QuestVariableVector                                   IslandLocation;                                    // 0xb0(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OnboardingFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SinkingTunnelOfTheDamnedInterface: public Interface
{
public:
};


// Size 0x28 (Full Size[0x90] - InheritedSize[0x68]
class BTDecorator_CanRepair: public BTDecorator_BaseConditional
{
public:
	struct BlackboardKeySelector                                 RepairActor;                                       // 0x68(0x28)
};


// Size 0x8 (Full Size[0x178] - InheritedSize[0x170]
class EnvQueryTest_InSunkenIslandSurfaceZone: public EnvQueryTest
{
public:
	class UClass*                                                ExclusionType;                                     // 0x170(0x8)
};


// Size 0x40 (Full Size[0x3e0] - InheritedSize[0x3a0]
class ClientTimeModifier: public Actor
{
public:
	class SceneComponent*                                        Root;                                              // 0x3a0(0x8)
	float                                                        Radius;                                            // 0x3a8(0x4)
	float                                                        FixedTimeOfDay;                                    // 0x3ac(0x4)
	int                                                          FixedDay;                                          // 0x3b0(0x4)
	char                                                         pad0x2c_MT3IZ[0x2c];                               // 0x3b4(0x2c)
};


// Size 0x0 (Full Size[0xa20] - InheritedSize[0xa20]
class LiquidContainerTestMaterial: public Material
{
public:
};


// Size 0x0 (Full Size[0x90] - InheritedSize[0x90]
class BTTask_CharacterRotateToFaceBBEntry: public BTTask_RotateToFaceBBEntry
{
public:
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class ExitOnAllCrewsDestroyedStep: public TaleQuestStep
{
public:
	class ExitOnAllCrewsDestroyedStepDesc*                       Desc;                                              // 0x98(0x8)
	char                                                         pad0x8_2YV0B[0x8];                                 // 0xa0(0x8)
};


// Size 0x10 (Full Size[0xc8] - InheritedSize[0xb8]
class FaunaRammableComponent: public ActorComponent
{
public:
	char                                                         pad0x8_5PBPD[0x8];                                 // 0xb8(0x8)
	float                                                        OffsetBehindActorToTarget;                         // 0xc0(0x4)
	char                                                         pad0x4_CIYRH[0x4];                                 // 0xc4(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class FootstepIDAsset: public DataAsset
{
public:
	struct FName                                                 FootstepName;                                      // 0x28(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class SeaFortAddOnSharedDataAssetClient: public DataAsset
{
public:
	class UClass*                                                GhostShipToSpawn;                                  // 0x28(0x8)
	TArray<struct Transform>                                     GhostShipSpawnRelativeTransforms;                  // 0x30(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PremiumCatalogListDataAsset: public DataAsset
{
public:
	TArray<class PremiumCatalogDataAsset*>                       Catalogs;                                          // 0x28(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class RadialSlotIndex7SelectedKeyboardNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x20 (Full Size[0x2a8] - InheritedSize[0x288]
class AthenaClampedFreelookInputComponent: public AthenaCharacterBaseInputComponent
{
public:
	char                                                         pad0x20_IQSW1[0x20];                               // 0x288(0x20)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class SwitchDefinitionsDataAsset: public DataAsset
{
public:
	struct SwitchDefinitionsModel                                SwitchDefinitions;                                 // 0x28(0x10)
	struct FString                                               JSonObjectString;                                  // 0x38(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIShipCaptainActionStateId: public ActionStateId
{
public:
};


// Size 0x50 (Full Size[0x80] - InheritedSize[0x30]
class AnimNotifyStateQuestBookRenderingModeRequest: public AnimNotifyState
{
public:
	char                                                         pad0x50_IFPMO[0x50];                               // 0x30(0x50)
};


// Size 0x10 (Full Size[0xc8] - InheritedSize[0xb8]
class AbsorbsLiquidComponent: public ActorComponent
{
public:
	char                                                         pad0x10_0PGRG[0x10];                               // 0xb8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SailInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class BuriedItemStep: public TaleQuestStep
{
public:
	class BuriedItemStepDesc*                                    StepDesc;                                          // 0x98(0x8)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class DebugCreateAndPlayNpcAnimationStepDesc: public TaleQuestStepDesc
{
public:
	class UClass*                                                NpcToSpawn;                                        // 0x80(0x8)
	struct StringAssetReference                                  SpawnLocation;                                     // 0x88(0x10)
	struct StringAssetReference                                  PlaceableReaction;                                 // 0x98(0x10)
	class PlayNpcAnimationResource*                              AnimationParameters;                               // 0xa8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ItemDropFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x18 (Full Size[0x3b8] - InheritedSize[0x3a0]
class SkeletonCampService: public Actor
{
public:
	char                                                         pad0x18_TOS59[0x18];                               // 0x3a0(0x18)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class SeaFortAddOnSharedDataAsset: public DataAsset
{
public:
	TArray<struct PrisonerToPositionMapping>                     SpawnablePrisonerToPositionMappings;               // 0x28(0x10)
	class UClass*                                                ItemToSpawn;                                       // 0x38(0x8)
	struct Vector                                                ItemSpawnRelativeLocation;                         // 0x40(0xc)
	char                                                         pad0x4_3L65U[0x4];                                 // 0x4c(0x4)
};


// Size 0xa8 (Full Size[0x160] - InheritedSize[0xb8]
class CampaignComponent: public ActorComponent
{
public:
	char                                                         pad0xa8_8DRP9[0xa8];                               // 0xb8(0xa8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ClothingLoadoutViewInterface: public Interface
{
public:
};


// Size 0x98 (Full Size[0xf8] - InheritedSize[0x60]
class BTTask_RunOneShotCustomAnimation: public BTTaskNode
{
public:
	bool                                                         UseFixedOneShotCustomAnimationName;                // 0x60(0x1)
	char                                                         pad0x3_JLZSA[0x3];                                 // 0x61(0x3)
	struct FName                                                 FixedOneShotCustomAnimationName;                   // 0x64(0x8)
	char                                                         pad0x4_RJ205[0x4];                                 // 0x6c(0x4)
	struct BlackboardKeySelector                                 OneShotCustomAnimationNameKey;                     // 0x70(0x28)
	bool                                                         GetDurationAndEffectTime;                          // 0x98(0x1)
	char                                                         pad0x7_C2GUE[0x7];                                 // 0x99(0x7)
	struct BlackboardKeySelector                                 AnimationDuration;                                 // 0xa0(0x28)
	struct BlackboardKeySelector                                 AnimationEffectTime;                               // 0xc8(0x28)
	bool                                                         StopCurrentLoopingAnimation;                       // 0xf0(0x1)
	char                                                         pad0x7_OMNRR[0x7];                                 // 0xf1(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ControllableObjectFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameAudioInterface: public Interface
{
public:
};


// Size 0xe0 (Full Size[0x198] - InheritedSize[0xb8]
class WorldMarkerManagerComponent: public ActorComponent
{
public:
	char                                                         pad0x8_ZBQ3M[0x8];                                 // 0xb8(0x8)
	TArray<struct MarkerVariantDesc>                             MarkerVariants;                                    // 0xc0(0x10)
	TArray<struct FeatureToggledMarkerVariants>                  FeatureToggledMarkerVariants;                      // 0xd0(0x10)
	TArray<class BaseWorldMarker*>                               MarkerDataObjects;                                 // 0xe0(0x10)
	TArray<struct ClientMarkerRepresentation>                    ClientMarkerRepresentations;                       // 0xf0(0x10)
	char                                                         pad0x98_9BA59[0x98];                               // 0x100(0x98)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RewindableLaunchableProjectileInterface: public Interface
{
public:
};


// Size 0x188 (Full Size[0x528] - InheritedSize[0x3a0]
class FishingFishSpawnerManager: public Actor
{
public:
	char                                                         pad0x8_EO58Q[0x8];                                 // 0x3a0(0x8)
	class SceneComponent*                                        RootComp;                                          // 0x3a8(0x8)
	class UClass*                                                FishingFishSpawnerClass;                           // 0x3b0(0x8)
	struct TierFishToSpawnAcrossFishSpawners                     TierOneFishData;                                   // 0x3b8(0x10)
	struct TierFishToSpawnAcrossFishSpawners                     TierTwoFishData;                                   // 0x3c8(0x10)
	struct TierFishToSpawnAcrossFishSpawners                     TierThreeFishData;                                 // 0x3d8(0x10)
	TArray<class FishingFishSpawner*>                            FishingFishSpawners;                               // 0x3e8(0x10)
	char                                                         pad0x128_F4O1Z[0x128];                             // 0x3f8(0x128)
	bool                                                         AllFishCaught;                                     // 0x522(0x1)
	char                                                         pad0x5_WK1D9[0x5];                                 // 0x523(0x5)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleResourceBrokerServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BalancingInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIInteractableOperatorInterface: public Interface
{
public:
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class SelectRewardStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableItemSpawnDataTypeArray                   ItemSpawnDatas;                                    // 0x80(0x30)
	struct QuestVariableItemSpawnDataType                        QuestItemSpawnData;                                // 0xb0(0x30)
	int                                                          NumberOfItemsToSpawn;                              // 0xe0(0x4)
	bool                                                         SelectChestsOnly;                                  // 0xe4(0x1)
	char                                                         pad0x3_YZ3HO[0x3];                                 // 0xe5(0x3)
};


// Size 0xb8 (Full Size[0x138] - InheritedSize[0x80]
class BasePlayNpcAnimationStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    PlaceableReaction;                                 // 0x80(0x30)
	struct QuestVariableActor                                    CutSceneActor;                                     // 0xb0(0x30)
	struct FName                                                 AnimationNameToPlay;                               // 0xe0(0x8)
	float                                                        SubtitleMaxDistance;                               // 0xe8(0x4)
	bool                                                         UseServerDrivenDialogue;                           // 0xec(0x1)
	char                                                         pad0x3_30GWF[0x3];                                 // 0xed(0x3)
	class SceneDialogueData*                                     DialogueData;                                      // 0xf0(0x8)
	class UClass*                                                LocalMusicZone;                                    // 0xf8(0x8)
	bool                                                         PreventServerMigration;                            // 0x100(0x1)
	char                                                         pad0x7_28DKR[0x7];                                 // 0x101(0x7)
	struct TaleQuestPhaseClusterRootActor                        PhaseClusterToSpawnFor;                            // 0x108(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TestNetworkedEventsFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x28 (Full Size[0x70] - InheritedSize[0x48]
class CameraRollModifier: public CameraModifier
{
public:
	char                                                         pad0x28_W1IW7[0x28];                               // 0x48(0x28)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class RadialSettingsAsset: public DataAsset
{
public:
	TArray<struct BaseRadialEntry>                               BaseRadialCreationRules;                           // 0x28(0x10)
	TArray<class Class*>                                         BlockingAnalogInputs;                              // 0x38(0x10)
	float                                                        MinRadialSectorUnselectableFraction;               // 0x48(0x4)
	float                                                        MaxRadialSectorUnselectableFraction;               // 0x4c(0x4)
	float                                                        MinSelectionMagnitude;                             // 0x50(0x4)
	float                                                        SelectionTimeout;                                  // 0x54(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AmmoInterface: public Interface
{
public:
};


// Size 0x1a0 (Full Size[0x258] - InheritedSize[0xb8]
class PlayerGuildComponent: public ActorComponent
{
public:
	char                                                         pad0x8_I1DG1[0x8];                                 // 0xb8(0x8)
	bool                                                         SailingForGuild;                                   // 0xc0(0x1)
	char                                                         pad0x7_77YHR[0x7];                                 // 0xc1(0x7)
	TArray<char>                                                 CannotInviteReasons;                               // 0xc8(0x10)
	struct Guid                                                  GuildId;                                           // 0xd8(0x10)
	int                                                          GuildLevel;                                        // 0xe8(0x4)
	int                                                          DistinctionLevel;                                  // 0xec(0x4)
	int                                                          LedgerPosition;                                    // 0xf0(0x4)
	char                                                         pad0x4_LQPFQ[0x4];                                 // 0xf4(0x4)
	struct GuildBranding                                         GuildBranding;                                     // 0xf8(0x50)
	int                                                          NumberOfMembers;                                   // 0x148(0x4)
	int                                                          NumberOfShips;                                     // 0x14c(0x4)
	TArray<struct PlayerGuildAffiliation>                        PlayerGuildAffiliations;                           // 0x150(0x10)
	char                                                         pad0xa8_O1B0B[0xa8];                               // 0x160(0xa8)
	class GuildBrandingTexturesAsset*                            GuildBrandingTextureAsset;                         // 0x208(0x8)
	struct GuildSignUpToken                                      ActiveGuildSignUpToken;                            // 0x210(0x20)
	char                                                         pad0x28_7MMTR[0x28];                               // 0x230(0x28)
};


// Size 0x68 (Full Size[0x408] - InheritedSize[0x3a0]
class BuriedDecalServerService: public Actor
{
public:
	char                                                         pad0x8_N8PQ5[0x8];                                 // 0x3a0(0x8)
	class DiggingSettings*                                       Settings;                                          // 0x3a8(0x8)
	char                                                         pad0x58_A28SV[0x58];                               // 0x3b0(0x58)
};


// Size 0x20 (Full Size[0x120] - InheritedSize[0x100]
class RetractableItemProxyComponent: public RetractableComponent
{
public:
	char                                                         pad0x20_4QBZ6[0x20];                               // 0x100(0x20)
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class MaterialAccessibilityService: public Object
{
public:
	char                                                         pad0x58_B9CVX[0x58];                               // 0x28(0x58)
	class MaterialParameterCollection*                           MaterialAccessibilityParamCollection;              // 0x80(0x8)
	struct StringAssetReference                                  MaterialAccessibilityAssetRef;                     // 0x88(0x10)
};


// Size 0x20 (Full Size[0x3c0] - InheritedSize[0x3a0]
class CargoRunService: public Actor
{
public:
	char                                                         pad0x10_MT2XM[0x10];                               // 0x3a0(0x10)
	TArray<struct ClientCargoRunCrewDataUnit>                    ClientCrewData;                                    // 0x3b0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ChangeableMeshInterface: public Interface
{
public:
};


// Size 0x218 (Full Size[0x240] - InheritedSize[0x28]
class AggressiveGhostShipDifficultyDataAsset: public DataAsset
{
public:
	struct WeightedProbabilityRange                              NumShotsToDestroyShip;                             // 0x28(0x20)
	float                                                        PersistentDamageScale;                             // 0x48(0x4)
	char                                                         pad0x4_4C58R[0x4];                                 // 0x4c(0x4)
	TArray<struct AggressiveGhostHealthToVfxLevel>               HealthToVFxLevel;                                  // 0x50(0x10)
	struct WeightedProbabilityRangeOfRanges                      Speed;                                             // 0x60(0x30)
	struct WeightedProbabilityRangeOfRanges                      TimeBetweenShots;                                  // 0x90(0x30)
	struct WeightedProbabilityRangeOfRanges                      WraithballCooldownTime;                            // 0xc0(0x30)
	struct WeightedProbabilityRangeOfRanges                      TimeBetweenCheckingIfAShipIsBehindYou;             // 0xf0(0x30)
	float                                                        MaxDistanceBehindShipToBeMineTargetInMetres;       // 0x120(0x4)
	float                                                        MaxMineTargetAngle;                                // 0x124(0x4)
	float                                                        ChanceOfDroppingMines;                             // 0x128(0x4)
	char                                                         pad0x4_0RWAG[0x4];                                 // 0x12c(0x4)
	struct WeightedProbabilityRange                              NumMinesToDrop;                                    // 0x130(0x20)
	struct WeightedProbabilityRangeOfRanges                      MinTimeBetweenDroppingMoreMines;                   // 0x150(0x30)
	bool                                                         CanAnchorDrop;                                     // 0x180(0x1)
	char                                                         pad0x7_OPIJ9[0x7];                                 // 0x181(0x7)
	struct WeightedProbabilityRangeOfRanges                      TimeBetweenAnchorDrops;                            // 0x188(0x30)
	struct WeightedProbabilityRangeOfRanges                      AnchorDropWarningTime;                             // 0x1b8(0x30)
	float                                                        TimeBetweenPortalJumpChecks;                       // 0x1e8(0x4)
	float                                                        MinDistanceFromAnyShipsToConsiderAPortalJumpInMetres; // 0x1ec(0x4)
	float                                                        TimeToBeAwayFromAnyShipsToConsiderPortalJumping;   // 0x1f0(0x4)
	float                                                        ChanceOfPortalJumping;                             // 0x1f4(0x4)
	struct WeightedProbabilityRangeOfRanges                      PortalJumpDuration;                                // 0x1f8(0x30)
	float                                                        PortalJumpCooldown;                                // 0x228(0x4)
	char                                                         pad0x4_TE0H4[0x4];                                 // 0x22c(0x4)
	TArray<struct AggressiveGhostShipImpactDamage>               ProjectileDamageData;                              // 0x230(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShipPersistenceLocatorInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class PortalSignalCutSceneAnchor: public Actor
{
public:
	class SceneComponent*                                        Root;                                              // 0x3a0(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class HitReactionInterface: public Interface
{
public:
};


// Size 0x68 (Full Size[0x120] - InheritedSize[0xb8]
class CrewShipStockRedemptionComponent: public ActorComponent
{
public:
	TArray<class Class*>                                         PendingBundles;                                    // 0xb8(0x10)
	char                                                         pad0x58_AL47N[0x58];                               // 0xc8(0x58)
};


// Size 0x28 (Full Size[0xb0] - InheritedSize[0x88]
class BTTask_UpdateReapersTributeIslandTarget: public BTTask_BlackboardBase
{
public:
	struct BlackboardKeySelector                                 IslandTargetKey;                                   // 0x88(0x28)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class RadialActionEastNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class StorageContainerComponentData: public DataAsset
{
public:
	TArray<char>                                                 CloseInteractionExemptHealthChangeReasons;         // 0x28(0x10)
	class WwiseEvent*                                            BeginQuickGiveSFX;                                 // 0x38(0x8)
	class WwiseEvent*                                            EndQuickGiveSFX;                                   // 0x40(0x8)
	class WwiseEvent*                                            BeginQuickTakeSFX;                                 // 0x48(0x8)
	class WwiseEvent*                                            EndQuickTakeSFX;                                   // 0x50(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class QuickCycleToCompassNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class CannonPitchRateRightStickAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x80 (Full Size[0x138] - InheritedSize[0xb8]
class FaceTargetComponent: public ActorComponent
{
public:
	float                                                        BlendRotationInterpSpeed;                          // 0xb8(0x4)
	bool                                                         BlendRotationUseConstantInterp;                    // 0xbc(0x1)
	char                                                         pad0x1b_5ZF50[0x1b];                               // 0xbd(0x1b)
	class Actor*                                                 TargetActorToFace;                                 // 0xd8(0x8)
	char                                                         pad0x48_1GT3M[0x48];                               // 0xe0(0x48)
	float                                                        ClampYawRange;                                     // 0x128(0x4)
	float                                                        ClampYawCentre;                                    // 0x12c(0x4)
	float                                                        ClampYawRate;                                      // 0x130(0x4)
	char                                                         pad0x4_VC6PJ[0x4];                                 // 0x134(0x4)
};


// Size 0x12f0 (Full Size[0x1a38] - InheritedSize[0x748]
class AthenaPlayerController: public PlayerController
{
public:
	char                                                         pad0x88_TJ5T9[0x88];                               // 0x748(0x88)
	class PioneerComponent*                                      PioneerComponent;                                  // 0x7d0(0x8)
	class PlayerPermissionsComponent*                            PlayerPermissionsComponent;                        // 0x7d8(0x8)
	class PlayerTelemetryComponent*                              PlayerTelemetryComponent;                          // 0x7e0(0x8)
	class PlayerStatsComponent*                                  PlayerStatsComponent;                              // 0x7e8(0x8)
	class PlayerSeasonProgressionComponent*                      PlayerSeasonProgressionComponent;                  // 0x7f0(0x8)
	class PlayerHeroStatsComponent*                              PlayerHeroStatsComponent;                          // 0x7f8(0x8)
	class PlayerWalletComponent*                                 PlayerWalletComponent;                             // 0x800(0x8)
	class BoxedRpcDispatcherComponent*                           BoxedRpcDispatcherComponent;                       // 0x808(0x8)
	class PlayerEntitlementComponent*                            PlayerEntitlementComponent;                        // 0x810(0x8)
	class PlayerMigratableStatusComponent*                       PlayerMigratableStatusComponent;                   // 0x818(0x8)
	class EmblemComponent*                                       EmblemComponent;                                   // 0x820(0x8)
	class PlayerCompanyComponent*                                PlayerCompanyComponent;                            // 0x828(0x8)
	class LeaderboardComponent*                                  LeaderboardComponent;                              // 0x830(0x8)
	class RewardComponent*                                       RewardComponent;                                   // 0x838(0x8)
	class PlayerNonVerbalComponent*                              PlayerNonVerbalComponent;                          // 0x840(0x8)
	class PlayerCrewComponent*                                   PlayerCrewComponent;                               // 0x848(0x8)
	class PlayerMuteComponent*                                   PlayerMuteComponent;                               // 0x850(0x8)
	class UIResponceComponent*                                   PlayerUIReturnedResponceComponent;                 // 0x858(0x8)
	class PopUpNotificationComponent*                            PopUpNotificationComponent;                        // 0x860(0x8)
	class EncounterListenerComponent*                            EncounterListenerComponent;                        // 0x868(0x8)
	class CharacterAnimaticSettingsComponent*                    CharacterAnimaticSettingsComponent;                // 0x870(0x8)
	class AthenaTutorialComponent*                               TutorialComponent;                                 // 0x878(0x8)
	class ContextualTutorialComponent*                           ContextualTutorialComponent;                       // 0x880(0x8)
	class ShantySelectionComponent*                              ShantySelectionComponent;                          // 0x888(0x8)
	class TutorialManager*                                       TutorialManagerComponent;                          // 0x890(0x8)
	class EmissaryActionRewardBoostComponent*                    EmissaryActionRewardBoostComponent;                // 0x898(0x8)
	class PlayerMysteriousNoteComponent*                         PlayerMysteriousNoteComponent;                     // 0x8a0(0x8)
	class EmissaryParticipantComponent*                          EmissaryParticipantComponent;                      // 0x8a8(0x8)
	class CommodityPurchaseTrackingComponent*                    CommodityPurchaseTrackingComponent;                // 0x8b0(0x8)
	class IslandEventTrackerComponent*                           IslandEventTrackerComponent;                       // 0x8b8(0x8)
	class CampaignComponent*                                     CampaignComponent;                                 // 0x8c0(0x8)
	class TaleQuestQueryableStatesAccessComponent*               TaleQuestQueryableStatesAccessComponent;           // 0x8c8(0x8)
	class AudioReportingComponent*                               AudioReportingComponent;                           // 0x8d0(0x8)
	class GuildInviteeComponent*                                 GuildInviteeComponent;                             // 0x8d8(0x8)
	class ExperienceRefreshComponent*                            ExperienceRefreshComponent;                        // 0x8e0(0x8)
	class ExperienceEligibilityComponent*                        ExperienceEligibilityComponent;                    // 0x8e8(0x8)
	struct Vengeance                                             Vengeance;                                         // 0x8f0(0x200)
	class CrewShipStockRedemptionComponent*                      CrewShipStockRedemptionComponent;                  // 0xaf0(0x8)
	class HitchDebugComponent*                                   HitchDebugComponent;                               // 0xaf8(0x8)
	float                                                        InputRawYawScale;                                  // 0xb00(0x4)
	float                                                        InputRawPitchScale;                                // 0xb04(0x4)
	struct InventoryMemory                                       InventoryMemory;                                   // 0xb08(0x50)
	char                                                         pad0x8_2N1L5[0x8];                                 // 0xb58(0x8)
	class CinematicCameraController*                             CinematicCameraController;                         // 0xb60(0x8)
	char                                                         pad0xf0_VUJ2N[0xf0];                               // 0xb68(0xf0)
	float                                                        VengeanceDuration;                                 // 0xc58(0x4)
	char                                                         pad0xacc_8R7CD[0xacc];                             // 0xc5c(0xacc)
	struct Guid                                                  ClientSessionId;                                   // 0x1728(0x10)
	char                                                         pad0x10_RSAD9[0x10];                               // 0x1738(0x10)
	class PromptsLocalService*                                   PromptsLocalService;                               // 0x17b0(0x8)
	class CurveFloat*                                            AutoCentreCurve;                                   // 0x17b8(0x8)
	char                                                         pad0x40_YPNIO[0x40];                               // 0x17c0(0x40)
	struct Vector                                                CinematicCameraControllerLocation;                 // 0x1800(0xc)
	struct Rotator                                               CinematicCameraControllerRotation;                 // 0x180c(0xc)
	struct PirateIdentity                                        PirateIdentity;                                    // 0x1818(0x78)
	char                                                         DeathFlameOfFateType;                              // 0x1890(0x1)
	char                                                         FlameOfFateType;                                   // 0x1891(0x1)
	char                                                         PlayerDeathType;                                   // 0x1892(0x1)
	char                                                         pad0x5_OWBMI[0x5];                                 // 0x1893(0x5)
	class IndividualReplicationChannel*                          IndividualReplicationChannel;                      // 0x1898(0x8)
	char                                                         pad0x18_X7XN4[0x18];                               // 0x18a0(0x18)
	struct FString                                               DebugServerMigrationEndpoint;                      // 0x18b8(0x10)
	char                                                         pad0x170_OQAG5[0x170];                             // 0x18c8(0x170)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class OneShotUsableMock: public Object
{
public:
	char                                                         pad0x10_ADNAR[0x10];                               // 0x28(0x10)
};


// Size 0x10 (Full Size[0x3b0] - InheritedSize[0x3a0]
class OverlapTriggerActor: public Actor
{
public:
	class CapsuleComponent*                                      SceneComponent;                                    // 0x3a0(0x8)
	class OverlapTriggerComponent*                               OverlapComponent;                                  // 0x3a8(0x8)
};


// Size 0xb8 (Full Size[0xe0] - InheritedSize[0x28]
class PuzzleManagerPolicy: public Object
{
public:
	char                                                         pad0x10_6N6HN[0x10];                               // 0x28(0x10)
	class Actor*                                                 PuzzleManager;                                     // 0x38(0x8)
	char                                                         pad0xa0_14U74[0xa0];                               // 0x40(0xa0)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GuildChroniclesInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class WeightedTreasureChestDescAsset: public DataAsset
{
public:
	TArray<struct WeightedTreasureChestDesc>                     Rewards;                                           // 0x28(0x10)
};


// Size 0x8 (Full Size[0x48] - InheritedSize[0x40]
class SummonAbilityStageParams: public AthenaAIAbilityStageParams
{
public:
	float                                                        NumToSpawnMultiplier;                              // 0x40(0x4)
	char                                                         pad0x4_AKRN4[0x4];                                 // 0x44(0x4)
};


// Size 0x50 (Full Size[0x3f0] - InheritedSize[0x3a0]
class SirenActionStateCreatorDefinition: public ActionStateCreatorDefinition
{
public:
	struct AISpawnActionStateParams                              AISpawnParams;                                     // 0x3a0(0x10)
	struct AISwimmingCreatureDeadActionStateParams               AIDeadParams;                                      // 0x3b0(0x20)
	struct UseItemActionStateParams                              UseItemParams;                                     // 0x3d0(0x1)
	struct HiddenActionStateParams                               HiddenStateParams;                                 // 0x3d1(0x5)
	char                                                         pad0x1a_GRTL0[0x1a];                               // 0x3d6(0x1a)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class WaitForMechanismActivationStep: public TaleQuestStep
{
public:
	class WaitForMechanismActivationStepDesc*                    Desc;                                              // 0x98(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class UndoRepairActionStateId: public ActionStateId
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class BootyStorageSettingsAsset: public DataAsset
{
public:
	class EnvQuery*                                              SpawnBootyCheatEQSQuery;                           // 0x28(0x8)
	class UClass*                                                RetrievalActor;                                    // 0x30(0x8)
	class EnvQuery*                                              SpawnRetrievalActorEQSQuery;                       // 0x38(0x8)
};


// Size 0x90 (Full Size[0xa30] - InheritedSize[0x9a0]
class SkeletalMeshMemoryConstraintComponent: public SkeletalMeshComponent
{
public:
	char                                                         pad0x20_K52OI[0x20];                               // 0x9a0(0x20)
	class MeshMemoryConstraintHandler*                           Handler;                                           // 0x9c0(0x8)
	TArray<struct StringAssetReference>                          FallbackOverrideMaterials;                         // 0x9c8(0x10)
	class UClass*                                                MeshFallbackCategory;                              // 0x9d8(0x8)
	struct StringAssetReference                                  MeshReference;                                     // 0x9e0(0x10)
	bool                                                         MemoryAccountedFor;                                // 0x9f8(0x1)
	bool                                                         NeedMeshLoadOnServer;                              // 0x9f9(0x1)
	char                                                         pad0x6_Z1H4P[0x6];                                 // 0x9fa(0x6)
	class UClass*                                                BudgetToCountMemoryAgainstIfNoFallback;            // 0xa00(0x8)
	struct FeatureFlag                                           OptionalFeatureToggleForMMC;                       // 0xa08(0xc)
	char                                                         pad0x4_IMNQT[0x4];                                 // 0xa14(0x4)
	char                                                         pad0x18_3RFCE[0x18];                               // 0xa18(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LoadableContainerInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SceneDialoguePointWithConditional: public Object
{
public:
	class SceneDialoguePoint*                                    Point;                                             // 0x28(0x8)
	class NPCDialogConditional*                                  Conditional;                                       // 0x30(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class HealthCustomizationServiceInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0x58] - InheritedSize[0x38]
class AthenaItemsSettings: public DeveloperSettings
{
public:
	char                                                         ProjectileCollisionChannel;                        // 0x38(0x1)
	char                                                         pad0x7_AUJES[0x7];                                 // 0x39(0x7)
	TArray<struct AthenaItemsSettingsProjectileCollisionChannelOverride> ProjectileCollisionChannelOverrides;               // 0x40(0x10)
	char                                                         ThrowableCollisionChannel;                         // 0x50(0x1)
	char                                                         pad0x7_ZQYWU[0x7];                                 // 0x51(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PickerUpperInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class OpenQuickMenuNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class SeaFortsWorldDataAsset: public DataAsset
{
public:
	TArray<Class>                                                SeaForts;                                          // 0x28(0x10)
	int                                                          MaxActiveForts;                                    // 0x58(0x4)
	float                                                        ActivationMinDistanceFromPlayer;                   // 0x5c(0x4)
	struct FString                                               ActivationMinDistanceFromPlayerRemoteConfigKey;    // 0x60(0x10)
	float                                                        RandomActivationTimeMin;                           // 0x70(0x4)
	float                                                        RandomActivationTimeMax;                           // 0x74(0x4)
	float                                                        CrewVacantGracePeriod;                             // 0x78(0x4)
	float                                                        CrewVacantToStopBattleGracePeriod;                 // 0x7c(0x4)
	float                                                        SeaFortAlignmentReset;                             // 0x80(0x4)
	char                                                         pad0x4_6LJH9[0x4];                                 // 0x84(0x4)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class GetIsShipInGoodConditionStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableBool                                     Result;                                            // 0x80(0x30)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class StatusResponseShipCurseFX: public StatusResponse
{
public:
	struct ShipCurseFXData                                       CurseFXData;                                       // 0x38(0x30)
};


// Size 0xd8 (Full Size[0x190] - InheritedSize[0xb8]
class InvasionBattleBoundsComponent: public ActorComponent
{
public:
	char                                                         pad0x48_RNXSN[0x48];                               // 0xb8(0x48)
	class PostProcessComponent*                                  BattleBoundsPostProcessComponent;                  // 0x100(0x8)
	class Actor*                                                 HourglassOfFate;                                   // 0x108(0x8)
	class MaterialManipulationComponent*                         HourglassOfFateMaterialManipulationComponent;      // 0x110(0x8)
	class ParticleSystemComponent*                               HourglassOfFateParticleSystemComponent;            // 0x118(0x8)
	float                                                        MaxEffectsT;                                       // 0x120(0x4)
	char                                                         pad0x4_XVZ59[0x4];                                 // 0x124(0x4)
	class Object*                                                ExplosionParticleSystem;                           // 0x128(0x8)
	class Object*                                                HourglassOfFateParticleSystemReaper;               // 0x130(0x8)
	class Object*                                                HourglassOfFateParticleSystemAthena;               // 0x138(0x8)
	float                                                        HourglassOfFateParticleSystemStartT;               // 0x140(0x4)
	struct Vector                                                HourglassOfFateParticleSystemOffset;               // 0x144(0xc)
	class UClass*                                                AthenaFaction;                                     // 0x150(0x8)
	class WwiseObjectPoolWrapper*                                HourglassEmitterPool;                              // 0x158(0x8)
	class WwiseEvent*                                            InitialBoundaryTellSfx;                            // 0x160(0x8)
	class WwiseEvent*                                            FinalBoundaryExplosionSfx;                         // 0x168(0x8)
	class WwiseEvent*                                            BoundaryBuildUpLoopStart;                          // 0x170(0x8)
	class WwiseEvent*                                            BoundaryBuildUpLoopEnd;                            // 0x178(0x8)
	char                                                         pad0x10_H1GP0[0x10];                               // 0x180(0x10)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class RemoveMechanismTriggerStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    Action;                                            // 0x80(0x30)
	struct QuestVariableActor                                    Trigger;                                           // 0xb0(0x30)
};


// Size 0xc8 (Full Size[0x180] - InheritedSize[0xb8]
class WieldableItemCanvasRenderingComponent: public ActorComponent
{
public:
	char                                                         pad0x10_QMQFQ[0x10];                               // 0xb8(0x10)
	int                                                          CanvasWidth;                                       // 0xc8(0x4)
	int                                                          CanvasHeight;                                      // 0xcc(0x4)
	struct FName                                                 PrimaryMaterialTextureParameterName;               // 0xd0(0x8)
	class MaybeCompressedCanvasRenderTarget2D*                   PrimaryRenderTarget;                               // 0xe8(0x8)
	TArray<class MaybeCompressedCanvasRenderTarget2D*>           AdditionalRenderTargets;                           // 0xf0(0x10)
	char                                                         pad0x80_7GLMX[0x80];                               // 0x100(0x80)
};


// Size 0x430 (Full Size[0x7d0] - InheritedSize[0x3a0]
class FishingFloat: public Actor
{
public:
	char                                                         pad0x18_0S7H6[0x18];                               // 0x3a0(0x18)
	class WaterInteractionComponent*                             WaterInteractionComponent;                         // 0x3b8(0x8)
	class BoxComponent*                                          CollisionComponent;                                // 0x3c0(0x8)
	class FishingFloatSetupDataAsset*                            FishingFloatSetupDataAsset;                        // 0x3c8(0x8)
	class SphereComponent*                                       FreeRoamFishCollider;                              // 0x3d0(0x8)
	class StaticMeshComponent*                                   FishingFloatMesh;                                  // 0x3d8(0x8)
	TArray<class MaterialInstanceDynamic*>                       FloatMaterials;                                    // 0x3e0(0x10)
	char                                                         pad0x3cc_5EBO8[0x3cc];                             // 0x3f0(0x3cc)
	char                                                         pad0x14_H32LQ[0x14];                               // 0x7bc(0x14)
};


// Size 0x40 (Full Size[0x310] - InheritedSize[0x2d0]
class OnboardingIntroLocationComponent: public SceneComponent
{
public:
	char                                                         pad0x28_MV4L7[0x28];                               // 0x2d0(0x28)
	struct Rotator                                               SpawnRotation;                                     // 0x2f8(0xc)
	char                                                         pad0xc_XI44Q[0xc];                                 // 0x304(0xc)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WorldEventZoneInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ConfigurableBuryableItemInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class AirPocketStatus: public StatusBase
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class LiquidLauncherStatus: public StatusBase
{
public:
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class PlayerNameService: public Object
{
public:
	char                                                         pad0x68_HVU2Y[0x68];                               // 0x28(0x68)
	class ScrambledNamesDataAsset*                               PlayerNameDataAsset;                               // 0x90(0x8)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class PremiumCatalogDataAsset: public DataAsset
{
public:
	struct Guid                                                  CatalogId;                                         // 0x28(0x10)
	struct FText                                                 DisplayName;                                       // 0x38(0x38)
	TArray<struct PremiumCatalogLandingPageTab>                  Tabs;                                              // 0x70(0x10)
	bool                                                         Archive;                                           // 0x80(0x1)
	char                                                         pad0x7_DWFNL[0x7];                                 // 0x81(0x7)
};


// Size 0x220 (Full Size[0x5c0] - InheritedSize[0x3a0]
class Sail: public Actor
{
public:
	char                                                         pad0x10_1VQQ5[0x10];                               // 0x3a0(0x10)
	class SkeletalMeshComponent*                                 Mesh;                                              // 0x3b0(0x8)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0x3b8(0x10)
	struct Vector                                                PositionForSailDynamicsRelativeToSailActor;        // 0x3c8(0xc)
	char                                                         pad0x4_1QLM1[0x4];                                 // 0x3d4(0x4)
	class BaseSailDynamicsDesc*                                  SailDynamicsDesc;                                  // 0x3d8(0x8)
	float                                                        MinRelativeWindSpdForFullVisibleInflation;         // 0x3e0(0x4)
	float                                                        BaseWindStrength;                                  // 0x3e4(0x4)
	class CurveFloat*                                            WindToSailAngleEfficiencyCurve;                    // 0x3e8(0x8)
	class CurveFloat*                                            AlternateWindToSailAngleEfficiencyCurve;           // 0x3f0(0x8)
	struct FeatureFlag                                           AlternateSailForceToggle;                          // 0x3f8(0xc)
	float                                                        NormalBillowLimit;                                 // 0x404(0x4)
	float                                                        PerfectBillowValue;                                // 0x408(0x4)
	float                                                        PerfectBillowThreshold;                            // 0x40c(0x4)
	float                                                        SailLoweredPerfectWindThreshold;                   // 0x410(0x4)
	float                                                        BlendSpeed;                                        // 0x414(0x4)
	struct FName                                                 FurlMaterialParameterName;                         // 0x418(0x8)
	struct FName                                                 SuperBillowParameterName;                          // 0x420(0x8)
	float                                                        AnimationSailHeightScalar;                         // 0x428(0x4)
	char                                                         pad0x118_AZFYG[0x118];                             // 0x42c(0x118)
	float                                                        DamageScalar;                                      // 0x544(0x4)
	char                                                         pad0x1_8YT3J[0x1];                                 // 0x548(0x1)
	bool                                                         HasMultipleExtraWindApplied;                       // 0x549(0x1)
	char                                                         pad0x76_XUAS7[0x76];                               // 0x54a(0x76)
};


// Size 0x10 (Full Size[0x650] - InheritedSize[0x640]
class FishingLineRenderComponent: public RopeCatenaryRenderComponent
{
public:
	struct LinearColor                                           LineColour;                                        // 0x640(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CutsceneTargetInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CrewSpawnLocationsInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class StatusResponseBurpingGasChange: public StatusResponse
{
public:
	float                                                        IntensityMultiplier;                               // 0x38(0x4)
	char                                                         pad0x4_PNF03[0x4];                                 // 0x3c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SkeletonFortTrackerServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TrackedActorOriginInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x298] - InheritedSize[0x288]
class HideInObjectInputComponent: public AthenaCharacterBaseInputComponent
{
public:
	char                                                         pad0x10_DIAEC[0x10];                               // 0x288(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ConcealableInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0x78] - InheritedSize[0x60]
class FogBankTaleService: public TaleQuestService
{
public:
	class FogBankTaleServiceDesc*                                Desc;                                              // 0x60(0x8)
	TArray<struct FogBankManagerFogAvoidanceArea>                FogBankAvoidanceAreas;                             // 0x68(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class LookUpRateAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class RegisterTransientActorStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    Actor;                                             // 0x80(0x30)
	float                                                        DestructionRadius;                                 // 0xb0(0x4)
	bool                                                         IsPendingDestruction;                              // 0xb4(0x1)
	char                                                         pad0x3_4UQFS[0x3];                                 // 0xb5(0x3)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AimWeaponPressedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x118 (Full Size[0x4b8] - InheritedSize[0x3a0]
class ShipPreviewActor: public Actor
{
public:
	char                                                         pad0x8_YOH0F[0x8];                                 // 0x3a0(0x8)
	class SceneComponent*                                        Root;                                              // 0x3a8(0x8)
	class ShipCustomizationLoadoutComponent*                     ShipCustomizationLoadoutComponent;                 // 0x3b0(0x8)
	class ChildActorComponent*                                   LargeShip;                                         // 0x3b8(0x8)
	class ChildActorComponent*                                   MediumShip;                                        // 0x3c0(0x8)
	class ChildActorComponent*                                   SmallShip;                                         // 0x3c8(0x8)
	class UClass*                                                BeginPlayShipVisibility;                           // 0x3e0(0x8)
	TArray<class Class*>                                         DefaultShipLiveryEntitlements;                     // 0x3e8(0x10)
	char                                                         pad0xc0_2VNM6[0xc0];                               // 0x3f8(0xc0)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnsembleInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x178] - InheritedSize[0x170]
class EnvQueryTest_InsideTinySharkExperience: public EnvQueryTest
{
public:
	float                                                        BufferRadius;                                      // 0x170(0x4)
	char                                                         pad0x4_Z48D2[0x4];                                 // 0x174(0x4)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestNotificationStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OnDigStrategy: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LighthouseBeamDamageInterface: public Interface
{
public:
};


// Size 0x90 (Full Size[0x640] - InheritedSize[0x5b0]
class PickupActorMock: public Character
{
public:
	char                                                         pad0x90_IS3SO[0x90];                               // 0x5b0(0x90)
};


// Size 0x648 (Full Size[0x9e8] - InheritedSize[0x3a0]
class Mast: public Actor
{
public:
	char                                                         pad0x48_5KZTR[0x48];                               // 0x3a0(0x48)
	char                                                         MastType;                                          // 0x3e8(0x1)
	char                                                         pad0x7_2AYMD[0x7];                                 // 0x3e9(0x7)
	class MastAudioParams*                                       MastAudioParams;                                   // 0x3f0(0x8)
	class SceneComponent*                                        SceneRootComponent;                                // 0x3f8(0x8)
	class IntentCombinerComponent*                               AngleCombinerComponent;                            // 0x400(0x8)
	class IntentCombinerComponent*                               SailHoistIntentCombinerComponent;                  // 0x408(0x8)
	class IntentCombinerComponent*                               MastHoistIntentCombinerComponent;                  // 0x410(0x8)
	class SceneComponent*                                        MastMovingAttachComponent;                         // 0x418(0x8)
	class SceneComponent*                                        SailAnglePivotComponent;                           // 0x420(0x8)
	class ReplicatedShipPartCustomizationComponent*              CustomizationComponent;                            // 0x428(0x8)
	class RepairableComponent*                                   RepairableComponentFirst;                          // 0x430(0x8)
	class RepairableComponent*                                   RepairableComponentSecond;                         // 0x438(0x8)
	class RepairableComponent*                                   RepairableComponentThird;                          // 0x440(0x8)
	class ShipDamageableComponent*                               DamageableComponent;                               // 0x448(0x8)
	class MastFlammableComponent*                                MastFlammableComponent;                            // 0x450(0x8)
	float                                                        AngleBlend;                                        // 0x458(0x4)
	float                                                        LoweredBlend;                                      // 0x45c(0x4)
	float                                                        LoweringSpeed;                                     // 0x460(0x4)
	float                                                        RaisingSpeed;                                      // 0x464(0x4)
	float                                                        TurnSpeed;                                         // 0x468(0x4)
	float                                                        MaxTurnAngle;                                      // 0x46c(0x4)
	float                                                        SailOffsetFromMast;                                // 0x470(0x4)
	float                                                        SailWidth;                                         // 0x474(0x4)
	float                                                        SailHeight;                                        // 0x478(0x4)
	float                                                        SailStartOffset;                                   // 0x47c(0x4)
	struct Vector                                                LookAtPosLow;                                      // 0x480(0xc)
	struct Vector                                                LookAtPosHigh;                                     // 0x48c(0xc)
	class WwiseObjectPoolWrapper*                                SailAudioPool;                                     // 0x498(0x8)
	class WwiseEvent*                                            AmbientSailFlapsSfx;                               // 0x4a0(0x8)
	class WwiseEvent*                                            AmbientSailFlapsStopSfx;                           // 0x4a8(0x8)
	class WwiseEvent*                                            PerfectSailInflationOneShot;                       // 0x4b0(0x8)
	class WwiseEvent*                                            SailLostPerfectWindOneShot;                        // 0x4b8(0x8)
	struct FName                                                 InflationRTPC;                                     // 0x4c0(0x8)
	struct FName                                                 SailLengthRTPC;                                    // 0x4c8(0x8)
	float                                                        ClientSailBlendSpeed;                              // 0x4d0(0x4)
	char                                                         pad0x4_Q2XF4[0x4];                                 // 0x4d4(0x4)
	TArray<class StaticMeshComponent*>                           YardArms;                                          // 0x4d8(0x10)
	struct FName                                                 TelemetryIdentifier;                               // 0x4e8(0x8)
	bool                                                         MastShouldBeFractured;                             // 0x4f0(0x1)
	char                                                         pad0x3_U8WGV[0x3];                                 // 0x4f1(0x3)
	struct MastCollisionProfiles                                 MastCollisionProfiles;                             // 0x4f4(0x28)
	char                                                         pad0x4_EXL8W[0x4];                                 // 0x51c(0x4)
	struct MastPhysicsComponents                                 MastPhysicsComponents;                             // 0x520(0x38)
	class StaticMesh*                                            MastIntactMesh;                                    // 0x558(0x8)
	class StaticMesh*                                            MastFractureMeshBottom;                            // 0x560(0x8)
	float                                                        MastFractureMeshBottomScale;                       // 0x568(0x4)
	float                                                        MastFractureMeshOriginalScale;                     // 0x56c(0x4)
	class StaticMesh*                                            MastFractureMeshTop;                               // 0x570(0x8)
	class ParticleSystem*                                        DamageParticleSystem;                              // 0x578(0x8)
	float                                                        HingeHeight;                                       // 0x580(0x4)
	float                                                        HingeDistanceFromCentre;                           // 0x584(0x4)
	float                                                        HingeDirectionAngle;                               // 0x588(0x4)
	float                                                        MaxFallAngle;                                      // 0x58c(0x4)
	float                                                        MastLiftingSpeed;                                  // 0x590(0x4)
	bool                                                         OverrideSailLengthWhenFalling;                     // 0x594(0x1)
	char                                                         pad0x3_IL8LF[0x3];                                 // 0x595(0x3)
	float                                                        MaxFallenSailLength;                               // 0x598(0x4)
	float                                                        SailFoldingSpeed;                                  // 0x59c(0x4)
	bool                                                         OverrideSailAngleWhenFalling;                      // 0x5a0(0x1)
	char                                                         pad0x3_2ITQZ[0x3];                                 // 0x5a1(0x3)
	float                                                        DesiredFallingSailAngle;                           // 0x5a4(0x4)
	float                                                        SailTwistingSpeed;                                 // 0x5a8(0x4)
	char                                                         pad0x4_RYGZM[0x4];                                 // 0x5ac(0x4)
	class MastHinge*                                             Hinge;                                             // 0x5b0(0x8)
	struct WeightedProbabilityRangeOfRanges                      MastImpactForceToApplyToShip;                      // 0x5b8(0x30)
	float                                                        MastImpactForceModifierToApplyToKrakenWrappedShip; // 0x5e8(0x4)
	float                                                        MastImpactHeightLocation;                          // 0x5ec(0x4)
	class UClass*                                                CameraShake;                                       // 0x5f0(0x8)
	float                                                        CameraShakeInnerRadius;                            // 0x5f8(0x4)
	float                                                        CameraShakeOuterRadius;                            // 0x5fc(0x4)
	bool                                                         PreviewMastFallenPosition;                         // 0x600(0x1)
	char                                                         pad0x7_DZJKM[0x7];                                 // 0x601(0x7)
	TArray<class RepairableComponent*>                           RepairableComponents;                              // 0x608(0x10)
	struct MastDamageAudioParams                                 DamageAudioParameters;                             // 0x618(0xb0)
	char                                                         pad0x8_G8F1X[0x8];                                 // 0x6c8(0x8)
	class TetherCustomisationComponent*                          TetherCustomisationComponent;                      // 0x6d0(0x8)
	char                                                         pad0xa0_XAYC8[0xa0];                               // 0x6d8(0xa0)
	TArray<class ChildActorComponent*>                           LinkedSails;                                       // 0x778(0x10)
	struct IntentPredictor                                       LengthIntentPredictor;                             // 0x788(0x1c)
	struct IntentPredictor                                       AngleIntentPredictor;                              // 0x7a4(0x1c)
	struct IntentPredictor                                       MastHoistIntentPredictor;                          // 0x7c0(0x1c)
	bool                                                         MastHoistingControlSchemeActive;                   // 0x7dc(0x1)
	char                                                         pad0x3_WJ472[0x3];                                 // 0x7dd(0x3)
	struct ObjectMessagingHandle                                 SailGotPerfectWindEventHandle;                     // 0x7e0(0x58)
	struct ObjectMessagingHandle                                 SailLostPerfectWindEventHandle;                    // 0x838(0x58)
	struct ObjectMessagingHandle                                 MastRepairStoppedHandle;                           // 0x890(0x58)
	char                                                         pad0x10_V0GN6[0x10];                               // 0x8e8(0x10)
	struct WwiseEmitter                                          SailsAudioEmitter;                                 // 0x8f8(0x20)
	float                                                        ServerAngleRatio;                                  // 0x918(0x4)
	float                                                        ServerLoweredProportion;                           // 0x91c(0x4)
	char                                                         ForceBillowingState;                               // 0x920(0x1)
	char                                                         pad0x3_HZFD2[0x3];                                 // 0x921(0x3)
	float                                                        ServerMastFallingProportion;                       // 0x924(0x4)
	char                                                         pad0x1c_7XDM6[0x1c];                               // 0x928(0x1c)
	bool                                                         AllowedToFall;                                     // 0x944(0x1)
	bool                                                         PlayAudio;                                         // 0x945(0x1)
	char                                                         pad0x3a_ZOJ13[0x3a];                               // 0x946(0x3a)
	bool                                                         IsCursed;                                          // 0x980(0x1)
	char                                                         pad0x67_BE839[0x67];                               // 0x981(0x67)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class PrimaryInteractReleasedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AIShipServiceInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SpawnLocationKeywordPriorityListAsset: public DataAsset
{
public:
	TArray<String>                                               PriorityKeywords;                                  // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ForceFeedbackCondition_IsOwnerLocalPlayer: public ForceFeedbackCondition
{
public:
};


// Size 0xa8 (Full Size[0x448] - InheritedSize[0x3a0]
class GhostShipDoor: public Actor
{
public:
	char                                                         pad0x18_Q1JPF[0x18];                               // 0x3a0(0x18)
	TArray<struct OpenForListEntry>                              OpenForList;                                       // 0x3b8(0x10)
	float                                                        DoorFullyOpenTimer;                                // 0x3c8(0x4)
	char                                                         pad0x4_XIO6G[0x4];                                 // 0x3cc(0x4)
	class ClientSkeletalMeshComponent*                           DoorMesh;                                          // 0x3d0(0x8)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterialInstances;                          // 0x3d8(0x10)
	class AnimSequence*                                          DoorOpeningAnimation;                              // 0x3e8(0x8)
	class WwiseEvent*                                            DoorOpeningSfx;                                    // 0x3f0(0x8)
	struct Box                                                   DoorBoundingVolume;                                // 0x3f8(0x1c)
	struct Vector                                                MaxBoundingVolume;                                 // 0x414(0xc)
	float                                                        DoorDeformationWhenFullyOpen;                      // 0x420(0x4)
	bool                                                         BlockPlayerLeftGhostshipDelegate;                  // 0x424(0x1)
	char                                                         pad0x23_VWASH[0x23];                               // 0x425(0x23)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ItemSpawningBlueprintFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class SquirtStatus: public StatusBase
{
public:
};


// Size 0x2c8 (Full Size[0x668] - InheritedSize[0x3a0]
class EmissaryVoteInteractionActor: public Actor
{
public:
	char                                                         pad0x10_FSI8Y[0x10];                               // 0x3a0(0x10)
	class BoxedRpcDispatcherComponent*                           BoxedRpcDispatcherComponent;                       // 0x3b0(0x8)
	float                                                        FadeDuration;                                      // 0x3b8(0x4)
	char                                                         pad0x4_2TT0O[0x4];                                 // 0x3bc(0x4)
	struct EmissaryDisplayInformation                            EmissaryActiveInfo;                                // 0x3c0(0x90)
	struct EmissaryDisplayInformation                            EmissaryInactiveInfo;                              // 0x450(0x90)
	struct EmissaryDisplayInformation                            EmissarySaferSeasInfo;                             // 0x4e0(0x90)
	char                                                         pad0xf8_TOP7Y[0xf8];                               // 0x570(0xf8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class StatusResponseBoogieCurse: public StatusResponse
{
public:
};


// Size 0x50 (Full Size[0x88] - InheritedSize[0x38]
class StatusResponseShipAddAnchor: public StatusResponse
{
public:
	struct StandardAnchorDynamicsParameters                      Params;                                            // 0x38(0x28)
	struct Vector                                                AnchorOffsetFromShip;                              // 0x60(0xc)
	char                                                         pad0x1c_PPKHG[0x1c];                               // 0x6c(0x1c)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class RevealableSceneMappingsDataAsset: public DataAsset
{
public:
	TArray<struct RevealableSceneMapping>                        Mappings;                                          // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SpawnCommandsAIFormList: public DataAsset
{
public:
	TArray<struct SpawnCommandsAIForm>                           FormList;                                          // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NetworkedEventsWhitelistInterface: public Interface
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AthenaGameEngineSettings: public Object
{
public:
	char                                                         pad0x28_UEOM1[0x28];                               // 0x28(0x28)
};


// Size 0x38 (Full Size[0xf0] - InheritedSize[0xb8]
class HealthStageHandlerComponent: public ActorComponent
{
public:
	char                                                         pad0x38_4RSJ5[0x38];                               // 0xb8(0x38)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class TunnelWorldConfig: public DataAsset
{
public:
	TArray<struct Vector2D>                                      TunnelLocations;                                   // 0x28(0x10)
	TArray<struct TunnelLevelDefinition>                         TunnelLevelDefinitions;                            // 0x38(0x10)
};


// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class ShipSinkingParametersDataAsset: public DataAsset
{
public:
	struct SinkingShipParams                                     SinkingParameters;                                 // 0x28(0x38)
	struct BuoyancySampleMovement                                SinkingBuoyancySettings;                           // 0x60(0x68)
};


// Size 0x90 (Full Size[0x110] - InheritedSize[0x80]
class SpawnPhasedActorStepDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 SocketName;                                        // 0x80(0x8)
	struct QuestVariableActor                                    LocationVar;                                       // 0xa8(0x30)
	struct QuestVariableActor                                    ActorVar;                                          // 0xd8(0x30)
	bool                                                         bAttachToSocket;                                   // 0x108(0x1)
	char                                                         pad0x7_347JS[0x7];                                 // 0x109(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestDefinition: public Object
{
public:
};


// Size 0xd8 (Full Size[0x100] - InheritedSize[0x28]
class CrouchingAnimationDataAsset: public DataAsset
{
public:
	char                                                         pad0x40_U1F1U[0x40];                               // 0x28(0x40)
	class AnimSequence*                                          FirstPersonFallbackAnimation;                      // 0x68(0x8)
	class AnimSequence*                                          ThirdPersonIntoAnimation;                          // 0x70(0x8)
	float                                                        TimeToResetAnimations;                             // 0xf8(0x4)
	char                                                         pad0x4_GB9G7[0x4];                                 // 0xfc(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MeshMemoryConstraintListenerInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MapIslandTextureProviderInterface: public Interface
{
public:
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class CrewLobbyChatMember: public Object
{
public:
	char                                                         pad0x30_CXB7K[0x30];                               // 0x28(0x30)
	class VoiceChatComponent*                                    VoiceChatComponent;                                // 0x58(0x8)
	char                                                         pad0x8_H1WV8[0x8];                                 // 0x60(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class NonCrewVoiceMuteStateToggleNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class MockInventoryItem: public Actor
{
public:
	class InventoryItemComponent*                                InventoryItem;                                     // 0x3a0(0x8)
};


// Size 0x168 (Full Size[0x220] - InheritedSize[0xb8]
class StaggerComponent: public ActorComponent
{
public:
	class CurveFloat*                                            XStickInputOverloaderAmplitude;                    // 0xb8(0x8)
	class CurveFloat*                                            YStickInputOverloaderAmplitude;                    // 0xc0(0x8)
	float                                                        MinInputOverloaderSpd;                             // 0xc8(0x4)
	float                                                        MaxInputOverloaderSpd;                             // 0xcc(0x4)
	float                                                        ChanceToChangeDirectionOnSpeedChange;              // 0xd0(0x4)
	float                                                        InputOverloaderSpdChangePerSec;                    // 0xd4(0x4)
	float                                                        MinOverloaderSpdChangeTime;                        // 0xd8(0x4)
	float                                                        MaxOverloaderSpdChangeTime;                        // 0xdc(0x4)
	float                                                        StickInputForMaxInterferenceScalar;                // 0xe0(0x4)
	float                                                        InterferenceScalarAtMinStickInput;                 // 0xe4(0x4)
	float                                                        InterferenceScalarOnLadderStationary;              // 0xe8(0x4)
	float                                                        InterferenceScalarOnLadderMoving;                  // 0xec(0x4)
	float                                                        MaxStickDeflectionOnLadderToConsiderStationary;    // 0xf0(0x4)
	float                                                        StickDeflectionForMaxScalingOnLadder;              // 0xf4(0x4)
	TArray<struct StaggerModifiersEntry>                         StaggerModifierEntries;                            // 0xf8(0x10)
	char                                                         pad0x118_TVK8G[0x118];                             // 0x108(0x118)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MapMarkId: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MemoryReservationInformationBase: public Object
{
public:
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class PopUpAudioDesc: public DataAsset
{
public:
	struct FString                                               SfxEventName;                                      // 0x28(0x10)
	struct FString                                               EventName;                                         // 0x38(0x10)
	struct FString                                               SwitchName;                                        // 0x48(0x10)
	struct FString                                               SwitchValue;                                       // 0x58(0x10)
};


// Size 0x18 (Full Size[0x3b8] - InheritedSize[0x3a0]
class ParticleSystemService: public Actor
{
public:
	char                                                         pad0x18_RRK2K[0x18];                               // 0x3a0(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StreamingTelemetryProviderInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class GetVoyageDifficultyFromRankStepDesc: public TaleQuestStepDesc
{
public:
	char                                                         VoyageType;                                        // 0x80(0x1)
	char                                                         pad0x7_XRX9T[0x7];                                 // 0x81(0x7)
	struct QuestVariableInt                                      Difficulty;                                        // 0x88(0x30)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class TemporaryEntitlementsTaleQuestServiceDesc: public TaleQuestServiceDesc
{
public:
	TArray<Class>                                                Entitlements;                                      // 0x28(0x10)
	bool                                                         GrantTemporaryEntitlementOnStart;                  // 0x38(0x1)
	char                                                         pad0x7_FYZ70[0x7];                                 // 0x39(0x7)
};


// Size 0x8 (Full Size[0x178] - InheritedSize[0x170]
class EnvQueryTest_InKrakenZone: public EnvQueryTest
{
public:
	float                                                        BufferRadius;                                      // 0x170(0x4)
	char                                                         pad0x4_SUG2R[0x4];                                 // 0x174(0x4)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class GuildEmoteLoadoutDataAsset: public DataAsset
{
public:
	TArray<struct EmoteData>                                     GuildEmoteData;                                    // 0x28(0x10)
	TArray<class Class*>                                         GuildEmoteDesc;                                    // 0x38(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EffectBlendObjectBase: public Object
{
public:
	float                                                        SubItemBlendRangeMin;                              // 0x28(0x4)
	float                                                        SubItemBlendRangeMax;                              // 0x2c(0x4)
	char                                                         pad0x8_V3WP5[0x8];                                 // 0x30(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SnapshotOwnerInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class UnloadItemActionStateId: public ActionStateId
{
public:
};


// Size 0x48 (Full Size[0x100] - InheritedSize[0xb8]
class ScrambledIdentityProviderComponent: public ActorComponent
{
public:
	struct ScrambledIdentityServer                               Identity;                                          // 0xb8(0x40)
	bool                                                         IsProvidingEnabled;                                // 0xf8(0x1)
	char                                                         pad0x7_QFGCU[0x7];                                 // 0xf9(0x7)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class DeferralReasonPopUpNotificationDataAsset: public DataAsset
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x28(0x8)
	TArray<struct DeferralReasonPopUpNotificationInfo>           DeferralReasonPopUpNotifications;                  // 0x30(0x10)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class GetIsShipInOpenWaterStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        BufferRadiusInMetres;                              // 0x80(0x4)
	char                                                         pad0x4_FNIH8[0x4];                                 // 0x84(0x4)
	struct QuestVariableBool                                     Result;                                            // 0x88(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EmoteLoadoutViewInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0x3c0] - InheritedSize[0x3a0]
class GlobalEmitterService: public Actor
{
public:
	char                                                         pad0x18_2Y11E[0x18];                               // 0x3a0(0x18)
	class ImpactListDataAsset*                                   ImpactListDataAsset;                               // 0x3b8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ReplenishableItemsInterface: public Interface
{
public:
};


// Size 0xa0 (Full Size[0x120] - InheritedSize[0x80]
class TaleQuestNotificationStepDesc: public TaleQuestStepDesc
{
public:
	class PopUpMessageDesc*                                      Notification;                                      // 0x80(0x8)
	struct QuestVariablePlayerActor                              PreventNotificationForPlayer;                      // 0x88(0x30)
	struct QuestVariablePlayerActor                              Player;                                            // 0xb8(0x30)
	struct QuestVariableActorArray                               ExplicitPlayerList;                                // 0xe8(0x30)
	bool                                                         OnlyShowNotificationForDiscoveringPlayer;          // 0x118(0x1)
	char                                                         pad0x7_P1DGM[0x7];                                 // 0x119(0x7)
};


// Size 0xa0 (Full Size[0x158] - InheritedSize[0xb8]
class ItemProxyShipTrackerComponent: public ActorComponent
{
public:
	char                                                         pad0x10_FDHLC[0x10];                               // 0xb8(0x10)
	class ItemProxyShipTrackerComponentDataAsset*                ShipTrackingData;                                  // 0xc8(0x8)
	class Actor*                                                 CurrentShip;                                       // 0xd0(0x8)
	char                                                         pad0x80_S7N2U[0x80];                               // 0xd8(0x80)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NPCAnimationInteractionInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class NPCOnSurfaceLocationDataAsset: public DataAsset
{
public:
	TArray<struct NPCOnSurfaceShipSizeFloodedLevels>             ShipSizeFloodLevels;                               // 0x28(0x10)
	TArray<struct NPCOnSurfaceLocationGroup>                     Groups;                                            // 0x38(0x10)
	struct Vector                                                FireTestOffset;                                    // 0x48(0xc)
	char                                                         pad0x4_P7DB8[0x4];                                 // 0x54(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LocationMapCollectionInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BootyStorageInterface: public Interface
{
public:
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class AthenaAnimationWeaponDataAsset: public DataAsset
{
public:
	struct AthenaAnimationWeaponData                             WeaponData;                                        // 0x28(0x48)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EncounterStateInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class HarpoonRetractNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x18 (Full Size[0x50] - InheritedSize[0x38]
class AnimNotify_RumbleController: public AnimNotify
{
public:
	class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x38(0x8)
	struct FName                                                 ForceFeedbackTag;                                  // 0x40(0x8)
	class ForceFeedbackCondition*                                ForceFeedbackCondition;                            // 0x48(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AthenaPlayerControllerTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x50 (Full Size[0xb8] - InheritedSize[0x68]
class BTDecorator_ActorWieldedItemCategory: public BTDecorator_BaseConditional
{
public:
	float                                                        Interval;                                          // 0x68(0x4)
	char                                                         pad0x4_D92NK[0x4];                                 // 0x6c(0x4)
	struct BlackboardKeySelector                                 BlackboardKey;                                     // 0x70(0x28)
	char                                                         pad0x20_TGNG6[0x20];                               // 0x98(0x20)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class DeliverableCollectorsChestRequirement: public DeliverableRequirementBase
{
public:
};


// Size 0x98 (Full Size[0xc0] - InheritedSize[0x28]
class FishingFloatSetupDataAsset: public DataAsset
{
public:
	class WwiseObjectPoolWrapper*                                FishingFloatPool;                                  // 0x28(0x8)
	class WwiseEvent*                                            RodCastFloatLandInWater;                           // 0x30(0x8)
	float                                                        DelayBeforeDetachingFloat;                         // 0x38(0x4)
	float                                                        FloatBobDepthWhenMovedAndNotHooked;                // 0x3c(0x4)
	float                                                        RetractingDuration;                                // 0x40(0x4)
	float                                                        ViolentlyRetractingDuration;                       // 0x44(0x4)
	class CurveFloat*                                            CastingFloatMovementXY;                            // 0x48(0x8)
	class CurveFloat*                                            CastingFloatMovementZAtMinDistance;                // 0x50(0x8)
	class CurveFloat*                                            CastingFloatMovementZAtMaxDistance;                // 0x58(0x8)
	class CurveFloat*                                            ReelingInFloatMovementXY;                          // 0x60(0x8)
	class CurveFloat*                                            ReelingInFloatMovementZ;                           // 0x68(0x8)
	class Object*                                                SplashVFXWhenFloatLandsOnWater;                    // 0x70(0x8)
	float                                                        MaxAboveDistance;                                  // 0x78(0x4)
	float                                                        MaxBelowDistance;                                  // 0x7c(0x4)
	float                                                        ExtraOffsetWhenFishNotAttached;                    // 0x80(0x4)
	float                                                        MaxDriftCompensationOffset;                        // 0x84(0x4)
	float                                                        FloatBobDepthOnComedyItemBeingHooked;              // 0x88(0x4)
	float                                                        BringingInCatchDuration;                           // 0x8c(0x4)
	float                                                        FloatZOffset;                                      // 0x90(0x4)
	float                                                        WobbleSpeed;                                       // 0x94(0x4)
	float                                                        MinWobbleAngle;                                    // 0x98(0x4)
	float                                                        MaxWobbleAngle;                                    // 0x9c(0x4)
	float                                                        TimeToBlendAwaySway;                               // 0xa0(0x4)
	float                                                        WobbleYawAngleOffset;                              // 0xa4(0x4)
	float                                                        FlavourYawMinTimeToNextChange;                     // 0xa8(0x4)
	float                                                        FlavourYawMaxTimeToNextChange;                     // 0xac(0x4)
	float                                                        FlavourYawMinSpeed;                                // 0xb0(0x4)
	float                                                        FlavourYawMaxSpeed;                                // 0xb4(0x4)
	float                                                        FlavourYawAcceleration;                            // 0xb8(0x4)
	char                                                         pad0x4_9JP46[0x4];                                 // 0xbc(0x4)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class TrapStatus: public StatusBase
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class QuickCycleToFishingRodNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class FortAIToggler: public Object
{
public:
	char                                                         pad0x40_E8VR6[0x40];                               // 0x28(0x40)
	TArray<struct FortTogglerUnit>                               FortUnits;                                         // 0x68(0x10)
	class Object*                                                WorldContext;                                      // 0x78(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SteamAchievementPopUpSettings: public Object
{
public:
	struct StringAssetReference                                  SteamAchievementPopUpAssetLocation;                // 0x28(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class ScrambleGamertagsToggleInputId: public NotificationInputId
{
public:
};


// Size 0x78 (Full Size[0x130] - InheritedSize[0xb8]
class SimpleAmmoComponent: public ActorComponent
{
public:
	char                                                         pad0x8_Z3M56[0x8];                                 // 0xb8(0x8)
	int                                                          MaximumAmmoCount;                                  // 0xc0(0x4)
	bool                                                         ShouldShowAmmoUI;                                  // 0xc4(0x1)
	char                                                         AmmoType;                                          // 0xc5(0x1)
	char                                                         pad0x2_128DL[0x2];                                 // 0xc6(0x2)
	int                                                          AmmoLeft;                                          // 0xc8(0x4)
	char                                                         pad0x64_FVHK2[0x64];                               // 0xcc(0x64)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterSocketCollisionServiceInterface: public Interface
{
public:
};


// Size 0x98 (Full Size[0x150] - InheritedSize[0xb8]
class ContestOutOfBoundsComponent: public ActorComponent
{
public:
	char                                                         pad0x98_6FU7B[0x98];                               // 0xb8(0x98)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class LandmarkReactionEvent: public Object
{
public:
	char                                                         pad0x20_CSV2S[0x20];                               // 0x28(0x20)
	bool                                                         UseDefaultTarget;                                  // 0x48(0x1)
	char                                                         pad0x7_728BV[0x7];                                 // 0x49(0x7)
	class Actor*                                                 ResolvedTarget;                                    // 0x50(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LeakableInterface: public Interface
{
public:
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class TaleQuestSelectAISpawnerStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableAISpawnerArray                           SelectFromSpawnerArray;                            // 0x80(0x30)
	struct QuestVariableAISpawner                                SelectedSpawnerAsset;                              // 0xb0(0x30)
};


// Size 0x68 (Full Size[0x408] - InheritedSize[0x3a0]
class SharedObjectReplicationService: public Actor
{
public:
	char                                                         pad0x58_LH7LR[0x58];                               // 0x3a0(0x58)
	TArray<class Object*>                                        RepArray;                                          // 0x3f8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FlamesOfFateHelpers: public BlueprintFunctionLibrary
{
public:
};


// Size 0x448 (Full Size[0x7e8] - InheritedSize[0x3a0]
class MapTable: public Actor
{
public:
	char                                                         pad0x10_GUZQS[0x10];                               // 0x3a0(0x10)
	class StaticMeshComponent*                                   TableMeshComponent;                                // 0x3b0(0x8)
	float                                                        MousePanSpeed;                                     // 0x3b8(0x4)
	float                                                        MouseZoomSpeed;                                    // 0x3bc(0x4)
	float                                                        PanSpeedMinZoom;                                   // 0x3c0(0x4)
	float                                                        PanSpeedMaxZoom;                                   // 0x3c4(0x4)
	float                                                        ZoomSpeed;                                         // 0x3c8(0x4)
	float                                                        MinZoom;                                           // 0x3cc(0x4)
	float                                                        MaxZoom;                                           // 0x3d0(0x4)
	float                                                        InitialZoom;                                       // 0x3d4(0x4)
	float                                                        RemoteBlendTime;                                   // 0x3d8(0x4)
	float                                                        RemotePanSettleRange;                              // 0x3dc(0x4)
	float                                                        RemoteZoomSettleRange;                             // 0x3e0(0x4)
	float                                                        DrunknessStaggerScalarWhileUsing;                  // 0x3e4(0x4)
	int                                                          MaxPins;                                           // 0x3e8(0x4)
	float                                                        PinToggleDist;                                     // 0x3ec(0x4)
	int                                                          MaxTrail;                                          // 0x3f0(0x4)
	float                                                        MinDistPerTrailDrop;                               // 0x3f4(0x4)
	float                                                        TimePerTrailUpdate;                                // 0x3f8(0x4)
	char                                                         pad0x4_G0KRC[0x4];                                 // 0x3fc(0x4)
	class WwiseObjectPoolWrapper*                                MapTablePool;                                      // 0x400(0x8)
	class WwiseEvent*                                            JoinTableSfx;                                      // 0x408(0x8)
	class WwiseEvent*                                            LeaveTableSfx;                                     // 0x410(0x8)
	class WwiseEvent*                                            PlayMoveMapSfx;                                    // 0x418(0x8)
	class WwiseEvent*                                            StopMoveMapSfx;                                    // 0x420(0x8)
	class WwiseEvent*                                            PlacePinSfx;                                       // 0x428(0x8)
	class WwiseEvent*                                            RemovePinSfx;                                      // 0x430(0x8)
	class WwiseEvent*                                            ClearAllPinsSfx;                                   // 0x438(0x8)
	class WwiseEvent*                                            ShowTaleSfx;                                       // 0x440(0x8)
	class WwiseEvent*                                            HideTaleSfx;                                       // 0x448(0x8)
	class WwiseEvent*                                            HighlightTaleMarkerSfx;                            // 0x450(0x8)
	float                                                        TrackedBootyItemsUpdateInterval;                   // 0x458(0x4)
	float                                                        TrackedShipsUpdateInterval;                        // 0x45c(0x4)
	float                                                        TrackedAIActorsUpdateInterval;                     // 0x460(0x4)
	float                                                        TrackedShipDistanceThreshold;                      // 0x464(0x4)
	float                                                        TrackedAIActorSquareDistanceThreshold;             // 0x468(0x4)
	char                                                         pad0x4_BLD0B[0x4];                                 // 0x46c(0x4)
	class UClass*                                                ReapersMarkFlag;                                   // 0x470(0x8)
	bool                                                         DisplayFactionShips;                               // 0x478(0x1)
	bool                                                         DisplayTallTaleIcons;                              // 0x479(0x1)
	char                                                         pad0x6_JQVXH[0x6];                                 // 0x47a(0x6)
	class MaterialInstanceDynamic*                               DynamicMaterial;                                   // 0x480(0x8)
	class MaterialInterface*                                     ExpandedMapMaterial;                               // 0x488(0x8)
	class MaterialInterface*                                     BaseMapMaterial;                                   // 0x490(0x8)
	float                                                        TopMargin;                                         // 0x498(0x4)
	float                                                        RightMargin;                                       // 0x49c(0x4)
	float                                                        BottomMargin;                                      // 0x4a0(0x4)
	float                                                        LeftMargin;                                        // 0x4a4(0x4)
	struct Vector2D                                              ServerCentreLocation;                              // 0x4a8(0x8)
	float                                                        ServerZoomLevel;                                   // 0x4b0(0x4)
	char                                                         pad0x4_SQD44[0x4];                                 // 0x4b4(0x4)
	TArray<class Actor*>                                         ControllerQueue;                                   // 0x4b8(0x10)
	TArray<struct Vector2D>                                      MapPins;                                           // 0x4c8(0x10)
	TArray<struct WorldMapShipLocation>                          TrackedShips;                                      // 0x4d8(0x10)
	TArray<struct ReapersMarkTrackedBootyItemInfo>               TrackedBootyItemInfos;                             // 0x4e8(0x10)
	TArray<struct WorldMapAILocation>                            TrackedAIActors;                                   // 0x4f8(0x10)
	struct LinearColor                                           BoundaryData;                                      // 0x508(0x10)
	class Texture*                                               AllianceOverlayIcon;                               // 0x518(0x8)
	char                                                         pad0x2a0_YRJVQ[0x2a0];                             // 0x520(0x2a0)
	char                                                         CachedPlaymode;                                    // 0x7c0(0x1)
	char                                                         pad0x17_2OFBX[0x17];                               // 0x7c1(0x17)
	struct MapTableTutorialHandler                               MapTableTutorialHandler;                           // 0x7d8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DitherFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ShipCustomizationInfo: public DataAsset
{
public:
	class UClass*                                                Category;                                          // 0x28(0x8)
	TArray<struct ShipSizePartCustomizationInfo>                 ShipSizeCustomizations;                            // 0x30(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SoakableInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class MeleeSpinAIAbilityParams: public AthenaAIAbilityParams
{
public:
	float                                                        MinAngleToTargetToActivate;                        // 0xc8(0x4)
	float                                                        MaxAngleToTargetToActivate;                        // 0xcc(0x4)
	float                                                        MinTimeBetweenCheck;                               // 0xd0(0x4)
	float                                                        MaxTimeBetweenCheck;                               // 0xd4(0x4)
	float                                                        ChanceOfActivation;                                // 0xd8(0x4)
	float                                                        SpinWaitTime;                                      // 0xdc(0x4)
	float                                                        TurnSpeed;                                         // 0xe0(0x4)
	char                                                         pad0x4_EU4F4[0x4];                                 // 0xe4(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class LandmarkTreasureLocationsDataAsset: public DataAsset
{
public:
	TArray<struct LandmarkTreasureLocationEntry>                 Landmarks;                                         // 0x28(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class StormServiceAsset: public DataAsset
{
public:
	TArray<class StormParams*>                                   StormParams;                                       // 0x28(0x10)
	float                                                        StormCheckRadius;                                  // 0x38(0x4)
	float                                                        ChanceOfForwardTimeStep;                           // 0x3c(0x4)
	struct FloatRange                                            StaticTimeOffsetBounds;                            // 0x40(0x10)
};


// Size 0x150 (Full Size[0x4f0] - InheritedSize[0x3a0]
class LandmarkReactionPlayer: public Actor
{
public:
	char                                                         pad0x8_GV2CO[0x8];                                 // 0x3a0(0x8)
	TArray<struct LandmarkReactionKeyFrame>                      OrderedReactions;                                  // 0x3a8(0x10)
	char                                                         pad0x58_LIINO[0x58];                               // 0x3b8(0x58)
	TArray<class ParticleSystemComponent*>                       ActiveParticleSystems;                             // 0x410(0x10)
	char                                                         pad0xd0_JR52D[0xd0];                               // 0x420(0xd0)
};


// Size 0x30 (Full Size[0x3d0] - InheritedSize[0x3a0]
class InteractableBase: public Actor
{
public:
	char                                                         pad0x10_JBKIH[0x10];                               // 0x3a0(0x10)
	TArray<class InteractionPrerequisiteBase*>                   InteractionPrerequisites;                          // 0x3b0(0x10)
	char                                                         CurrentInteractionState;                           // 0x3c0(0x1)
	char                                                         InteractableIdentifier;                            // 0x3c1(0x1)
	char                                                         pad0x2_JLTPM[0x2];                                 // 0x3c2(0x2)
	bool                                                         RequiresFacingFront;                               // 0x3c4(0x1)
	bool                                                         RequiresNotBeingAirborne;                          // 0x3c4(0x1)
	bool                                                         RequiresNotSwimming;                               // 0x3c4(0x1)
	bool                                                         RequiresCrouching;                                 // 0x3c4(0x1)
	bool                                                         InteractionsCanBeDisabled;                         // 0x3c4(0x1)
	bool                                                         CanSetInteractionState;                            // 0x3c4(0x1)
	char                                                         pad0x3_SX79L[0x3];                                 // 0x3c5(0x3)
	class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x3c8(0x8)
};


// Size 0x38 (Full Size[0xf0] - InheritedSize[0xb8]
class ShipAnnouncementComponent: public ActorComponent
{
public:
	struct StringAssetReference                                  Icon;                                              // 0xb8(0x10)
	struct StringAssetReference                                  Alignment;                                         // 0xc8(0x10)
	char                                                         AlignmentId;                                       // 0xd8(0x1)
	char                                                         pad0x7_MD8FB[0x7];                                 // 0xd9(0x7)
	struct FString                                               AudioCueKey;                                       // 0xe0(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class TriggerCollisionHelper: public Object
{
public:
	int                                                          TriggerId;                                         // 0x28(0x4)
	char                                                         pad0x1c_QM4U2[0x1c];                               // 0x2c(0x1c)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestSetCanRevivableAIEnterRevivableStateOnDeath: public TaleQuestStep
{
public:
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class DeliverableRedirectionCompanyContextHandler: public DeliverableRedirectionContextHandlerBase
{
public:
	bool                                                         ContextCanContainMoreCompanies;                    // 0x30(0x1)
	char                                                         pad0x7_XKYMP[0x7];                                 // 0x31(0x7)
	TArray<class Class*>                                         TargetCompanies;                                   // 0x38(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CheerAIStrategyId: public AIStrategyId
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class NPCOnSurfaceVOManager: public Object
{
public:
	char                                                         pad0x10_VGWSN[0x10];                               // 0x28(0x10)
};


// Size 0xd8 (Full Size[0x100] - InheritedSize[0x28]
class EmoteInfo: public DataAsset
{
public:
	struct EmoteData                                             EmoteData;                                         // 0x28(0xc8)
	struct StringAssetReference                                  RadialIconPath;                                    // 0xf0(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class FireCannonNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EmoteLoadoutControlInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x108] - InheritedSize[0x100]
class RetractableCharacterComponent: public RetractableComponent
{
public:
	bool                                                         RetainOriginalOrientationOnRetraction;             // 0x100(0x1)
	char                                                         pad0x7_QL4PO[0x7];                                 // 0x101(0x7)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class SpawnCommandsItemCategory: public DataAsset
{
public:
	struct FName                                                 ItemCategoryName;                                  // 0x28(0x8)
	TArray<struct SpawnCommandsItemSubCategory>                  ItemSubCategories;                                 // 0x30(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class CategoryDefaults: public DataAsset
{
public:
	TArray<struct CategoryDefaultsUnit>                          CategoryDefaults;                                  // 0x28(0x10)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class FlamesOfFateSettingsAsset: public DataAsset
{
public:
	TArray<struct FlamesOfFateFlameInfo>                         FlameInfo;                                         // 0x28(0x10)
	TArray<struct FlamesOfFateShipInfo>                          ShipInfo;                                          // 0x38(0x10)
	TArray<char>                                                 SailWithFlamesAboardFlameTypesToIgnore;            // 0x48(0x10)
	TArray<struct SailWithFlameOfFateColoursAboardStatData>      SailWithFlamesAboardStatDataArray;                 // 0x58(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class DeliverableRedirectionBootyContext: public DeliverableRedirectionContextBase
{
public:
	char                                                         BootyType;                                         // 0x28(0x1)
	char                                                         pad0x7_P1GJP[0x7];                                 // 0x29(0x7)
};


// Size 0xc0 (Full Size[0x178] - InheritedSize[0xb8]
class AthenaCharacterStateManagerComponent: public ActorComponent
{
public:
	char                                                         pad0xc0_SBK91[0xc0];                               // 0xb8(0xc0)
};


// Size 0xe8 (Full Size[0x110] - InheritedSize[0x28]
class ContendedResourceService: public Object
{
public:
	char                                                         pad0x10_Q947I[0x10];                               // 0x28(0x10)
	class World*                                                 World;                                             // 0x38(0x8)
	char                                                         pad0xd0_PRID8[0xd0];                               // 0x40(0xd0)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class StatusResponseSpawnAIOnShip: public StatusResponse
{
public:
	class AIFixedWavesSpawner*                                   AISpawner;                                         // 0x38(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class FishingMouseYAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RevealableInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AggressiveGhostShipEncounterFormationsDataAsset: public DataAsset
{
public:
	TArray<struct AggressiveGhostShipEncounterFormationDescGroup> FormationDescGroups;                               // 0x28(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class QuickSwitchSecondaryWeaponNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x38 (Full Size[0x3d8] - InheritedSize[0x3a0]
class AthenaContestTavern: public Actor
{
public:
	TArray<class SpawnLocation*>                                 TavernSpawnPoints;                                 // 0x3a0(0x10)
	TArray<class Actor*>                                         TavernLevelActorsToPrepare;                        // 0x3b0(0x10)
	char                                                         pad0x18_B3J00[0x18];                               // 0x3c0(0x18)
};


// Size 0x208 (Full Size[0x2c0] - InheritedSize[0xb8]
class CompanyNPCComponent: public ActorComponent
{
public:
	char                                                         pad0x38_IQ57S[0x38];                               // 0xb8(0x38)
	class UClass*                                                Company;                                           // 0xf0(0x8)
	bool                                                         OverrideCompanyForRewards;                         // 0xf8(0x1)
	bool                                                         CanSellToInSaferSeas;                              // 0xf9(0x1)
	bool                                                         PrioritizeCompanyShopOverEmissaryMaxRankQuest;     // 0xfa(0x1)
	char                                                         pad0x5_JZRSS[0x5];                                 // 0xfb(0x5)
	class UClass*                                                OverrideRewardCompany;                             // 0x100(0x8)
	struct FText                                                 SellSpecificItemText;                              // 0x108(0x38)
	struct FText                                                 OpenCompanyShopText;                               // 0x140(0x38)
	struct FName                                                 NPCName;                                           // 0x178(0x8)
	class ShopDesc*                                              ShopDesc;                                          // 0x180(0x8)
	TArray<struct ShopDescOverride>                              ShopDescOverrides;                                 // 0x188(0x10)
	float                                                        HoldToHandInBootyDuration;                         // 0x198(0x4)
	char                                                         pad0x4_JGF52[0x4];                                 // 0x19c(0x4)
	class UClass*                                                ConditionalStatForBootyHandIn;                     // 0x1a0(0x8)
	char                                                         pad0x100_KJJ6F[0x100];                             // 0x1a8(0x100)
	TArray<class Class*>                                         SpecifiedItemsToPurchase;                          // 0x2a8(0x10)
	char                                                         pad0x8_B5IFJ[0x8];                                 // 0x2b8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ConstellationInterface: public Interface
{
public:
};


// Size 0x110 (Full Size[0x4b0] - InheritedSize[0x3a0]
class PreviewShip: public Actor
{
public:
	char                                                         pad0x10_N2WID[0x10];                               // 0x3a0(0x10)
	class SceneComponent*                                        Root;                                              // 0x3b0(0x8)
	class ShipLiveryComponent*                                   LiveryComponent;                                   // 0x3b8(0x8)
	class ReplicatedShipPartCustomizationComponent*              HullLiveryCustomizationComponent;                  // 0x3c0(0x8)
	class ReplicatedShipPartCustomizationComponent*              SailsLiveryCustomizationComponent;                 // 0x3c8(0x8)
	class ChildActorComponent*                                   ShipFireCellDataContainer;                         // 0x3d0(0x8)
	class UClass*                                                FirePropagationBlueprint;                          // 0x3d8(0x8)
	struct StringAssetReference                                  ShipPersistenceIdentifier;                         // 0x3e0(0x10)
	class ShipFirePropagationComponent*                          FirePropagationComponent;                          // 0x3f0(0x8)
	char                                                         pad0xb8_E9LWG[0xb8];                               // 0x3f8(0xb8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class RivalVoteButtonNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class NPCConversationService: public Object
{
public:
	char                                                         pad0x18_7LPW2[0x18];                               // 0x28(0x18)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class ClaimVaultStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableGuid                                     Id;                                                // 0x80(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ItemDroppedInDeepWaterOverrideInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ItemPreviewDataInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class AnimNotifyTriggerPlaceableReaction: public AnimNotify
{
public:
	struct StringAssetReference                                  PlaceableReactionToTrigger;                        // 0x38(0x10)
};


// Size 0x70 (Full Size[0x410] - InheritedSize[0x3a0]
class ExplosivesService: public Actor
{
public:
	char                                                         pad0x58_MZMLN[0x58];                               // 0x3a0(0x58)
	TArray<uintptr_t>                                            VFXBlockedExplosions;                              // 0x3f8(0x10)
	char                                                         pad0x8_A2CL8[0x8];                                 // 0x408(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DelayLoadServiceInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class ServerPerformanceReplicator: public Actor
{
public:
	float                                                        ServerAverageFPS;                                  // 0x3a0(0x4)
	float                                                        ServerAverageMS;                                   // 0x3a4(0x4)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SweepRightAshenLordUnarmedNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class SeaFortAddOnAISpawnDataAsset: public DataAsset
{
public:
	struct FText                                                 SpawnedAITargetName;                               // 0x28(0x38)
	class AIBountySpawner*                                       AIBountySpawner;                                   // 0x60(0x8)
	TArray<struct AIBountySpawnerWaveLocation>                   AIBountySpawnerLocations;                          // 0x68(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AdventuresActorBundleAsset: public DataAsset
{
public:
	TArray<struct AdventuresActorBundleInfo>                     Contents;                                          // 0x28(0x10)
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class WorldMarkerOnDigPositionComponent: public ActorComponent
{
public:
	class UClass*                                                MarkerVariant;                                     // 0xb8(0x8)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class StatusResponseHealthChange: public StatusResponse
{
public:
	float                                                        HealthChangeAmount;                                // 0x38(0x4)
	char                                                         HealthChangedReason;                               // 0x3c(0x1)
	char                                                         pad0x3_K9K18[0x3];                                 // 0x3d(0x3)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class ZoomMapLayout: public DataAsset
{
public:
	struct TreasureMapWidgetText                                 MapTitle;                                          // 0x28(0x3c)
	char                                                         pad0x4_MAR5H[0x4];                                 // 0x64(0x4)
	TArray<struct TreasureMapWidgetText>                         Descriptions;                                      // 0x68(0x10)
	struct Vector2D                                              Position;                                          // 0x78(0x8)
	float                                                        Width;                                             // 0x80(0x4)
	char                                                         pad0x4_7RAWX[0x4];                                 // 0x84(0x4)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class SilenceStatus: public StatusBase
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class RiddleQuestData: public DataAsset
{
public:
	class WwiseEvent*                                            DefaultGateCompletedAudioCue;                      // 0x28(0x8)
	class WwiseEvent*                                            DefaultGateCompletedMusicCue;                      // 0x30(0x8)
	TArray<class Class*>                                         AllTreasureChests;                                 // 0x38(0x10)
};


// Size 0x60 (Full Size[0x400] - InheritedSize[0x3a0]
class InvasionDepartureTunnelRandomisedSceneryTile: public Actor
{
public:
	TArray<Class>                                                RandomActors;                                      // 0x3a0(0x10)
	char                                                         pad0x20_I09FS[0x20];                               // 0x3b0(0x20)
	struct InvasionTunnelLoadedSceneryTileAssetEntryWrapper      LoadedRandomActors;                                // 0x3d0(0x10)
	class ChildActorComponent*                                   ChildActor;                                        // 0x3e0(0x8)
	class SceneComponent*                                        RootComp;                                          // 0x3e8(0x8)
	char                                                         pad0x10_UL6EN[0x10];                               // 0x3f0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GuildPlaqueAccessorInterface: public Interface
{
public:
};


// Size 0xa0 (Full Size[0x940] - InheritedSize[0x8a0]
class ShipPointParticleComponent: public ParticleSystemComponent
{
public:
	TArray<char>                                                 ValidShipRegions;                                  // 0x898(0x10)
	TArray<struct Vector>                                        SpawnPts;                                          // 0x8a8(0x10)
	struct FName                                                 SpawnRateParam;                                    // 0x8b8(0x8)
	struct Vector2D                                              ParamValueRange;                                   // 0x8c0(0x8)
	struct Vector2D                                              TimePerEmitMin;                                    // 0x8c8(0x8)
	struct Vector2D                                              TimePerEmitMax;                                    // 0x8d0(0x8)
	char                                                         ParamType;                                         // 0x8d8(0x1)
	char                                                         pad0x67_GNSE2[0x67];                               // 0x8d9(0x67)
};


// Size 0x60 (Full Size[0x118] - InheritedSize[0xb8]
class ViewModelComponentBase: public ActorComponent
{
public:
	char                                                         pad0x60_KFEWN[0x60];                               // 0xb8(0x60)
};


// Size 0x10 (Full Size[0xc8] - InheritedSize[0xb8]
class ActorPhasingComponent: public ActorComponent
{
public:
	char                                                         pad0x8_N4S0V[0x8];                                 // 0xb8(0x8)
	class Actor*                                                 ActorToHide;                                       // 0xc0(0x8)
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class ActivateAllSpawnersVaultStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LockableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShipTelemetryDescriptorInterface: public Interface
{
public:
};


// Size 0x348 (Full Size[0x400] - InheritedSize[0xb8]
class GuildUIComponent: public ActorComponent
{
public:
	char                                                         pad0x2b8_DWOLD[0x2b8];                             // 0xb8(0x2b8)
	struct PlayerCompanyProgressCache                            GuildProgressCache;                                // 0x370(0x68)
	class GuildSettings*                                         GuildSettings;                                     // 0x3d8(0x8)
	char                                                         pad0x18_0PEEZ[0x18];                               // 0x3e0(0x18)
	bool                                                         HasInitialCompanyProgressRequestBeenMade;          // 0x3f8(0x1)
	bool                                                         IsCompanyProgressRequestPending;                   // 0x3f8(0x1)
	bool                                                         ShouldCacheGuildReputation;                        // 0x3f8(0x1)
	bool                                                         IsPendingSentInvitesResponse;                      // 0x3f8(0x1)
	char                                                         pad0x7_W9N2V[0x7];                                 // 0x3f9(0x7)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class AIRowboatServiceSettings: public DeveloperSettings
{
public:
	struct StringAssetReference                                  AIRowboatServiceSettingsAsset;                     // 0x38(0x10)
};


// Size 0x0 (Full Size[0x40] - InheritedSize[0x40]
class AshCloudAbilityStageParams: public AthenaAIAbilityStageParams
{
public:
};


// Size 0x18 (Full Size[0x4b0] - InheritedSize[0x498]
class TestAthenaGameModeWithLoopBackServiceEndpoint: public GameMode
{
public:
	char                                                         pad0x18_KQPUS[0x18];                               // 0x498(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TornMapCollectionInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShovelInterface: public Interface
{
public:
};


// Size 0x1e8 (Full Size[0x588] - InheritedSize[0x3a0]
class SeaFortsService: public Actor
{
public:
	char                                                         pad0x10_Y4YFJ[0x10];                               // 0x3a0(0x10)
	struct SeaFortDistantLightsAssetLoader                       DistantLightsAssetLoader;                          // 0x3b0(0x28)
	TArray<struct SeaFortDistantLightsSignal>                    ReplicatedDistantLightsSignals;                    // 0x3d8(0x10)
	class SeaFortsWorldDataAsset*                                SeaFortsData;                                      // 0x438(0x8)
	TArray<class Seafort*>                                       SeaForts;                                          // 0x440(0x10)
	char                                                         pad0x138_G7ZVX[0x138];                             // 0x450(0x138)
};


// Size 0xa90 (Full Size[0xe30] - InheritedSize[0x3a0]
class HumanoidActionStateCreatorDefinition: public ActionStateCreatorDefinition
{
public:
	struct DebugSuperSailorActionStateParams                     DebugSuperSailorParams;                            // 0x3a0(0x10)
	struct ControlWheelActionStateParams                         ControlWheelParams;                                // 0x3b0(0x48)
	struct ControlCapstanArmActionStateParams                    ControlCapstanArmParams;                           // 0x3f8(0x48)
	struct ControlPulleyActionStateParams                        ControlPulleyParams;                               // 0x440(0x48)
	struct UseLadderActionStateParams                            UseLadderParams;                                   // 0x488(0x60)
	struct ClamberActionStateParams                              ClamberParams;                                     // 0x4e8(0x40)
	struct UseCannonActionStateParams                            UseCannonParams;                                   // 0x528(0x70)
	struct UseMountedWeaponActionStateParams                     UseHarpoonLauncherParams;                          // 0x598(0x68)
	struct UseMountableSpotlightActionStateParams                UseMountableSpotlightParams;                       // 0x600(0x88)
	struct UseMapTableActionStateParams                          UseMapTableParams;                                 // 0x688(0x30)
	struct LinearTransitionLadderActionStateParams               OffBottomTransitionLadderParams;                   // 0x6b8(0x28)
	struct LinearTransitionLadderActionStateParams               OnBottomTransitionLadderParams;                    // 0x6e0(0x28)
	struct SplineTransitionLadderActionStateParams               OffTopTransitionLadderParams;                      // 0x708(0x20)
	struct SplineTransitionLadderActionStateParams               OnTopTransitionLadderParams;                       // 0x728(0x20)
	struct TeleportActionStateParams                             TeleportParams;                                    // 0x748(0x30)
	struct WaitingToSpawnActionStateParams                       WaitingToSpawnParams;                              // 0x778(0x14)
	struct RepairObjectActionStateParams                         RepairObjectParams;                                // 0x78c(0x8)
	struct UndoRepairActionStateParams                           UndoRepairParams;                                  // 0x794(0x4)
	struct RemoveSpearActionStateParams                          RemoveSpearParams;                                 // 0x798(0x1)
	struct UseItemActionStateParams                              UseItemParams;                                     // 0x799(0x1)
	char                                                         pad0x6_NSYIH[0x6];                                 // 0x79a(0x6)
	struct DeadActionStateParams                                 DeadParams;                                        // 0x7a0(0x58)
	struct RevivedActionStateParams                              PostReviveParameters;                              // 0x7f8(0x10)
	struct HideInObjectActionStateParams                         HideInObjectParams;                                // 0x808(0x38)
	struct LeaveGhostShipActionStateParams                       LeaveGhostShipParams;                              // 0x840(0x24)
	char                                                         pad0x4_GQ4TL[0x4];                                 // 0x864(0x4)
	struct ShovelDigActionStateParams                            ShovelDigParams;                                   // 0x868(0x10)
	struct MigrationActionStateParams                            MigrationParams;                                   // 0x878(0x4)
	struct FiredFromActorActionStateParams                       FiredFromCannonParams;                             // 0x87c(0x28)
	struct FiredFromActorActionStateParams                       LaunchedFromKrakenParams;                          // 0x8a4(0x28)
	struct FiredFromActorActionStateParams                       LaunchedFromGeyserParams;                          // 0x8cc(0x28)
	struct TalkToNPCActionStateParams                            TalkToNPCParams;                                   // 0x8f4(0x10)
	char                                                         pad0x4_EOAJ9[0x4];                                 // 0x904(0x4)
	struct WaterBarrelActionStateParams                          WaterBarrelParams;                                 // 0x908(0x48)
	struct DockableCutsceneActionStateParams                     DockableCutsceneParams;                            // 0x950(0x48)
	struct DockableBaseActionStateParams                         DockableBaseParams;                                // 0x998(0x48)
	struct PlayDockableKeyedInstrumentActionStateParams          DockableMusicalInstrumentParams;                   // 0x9e0(0x30)
	struct CombinationLockMechanismTriggerActionStateParams      CombinationLockMechanismTriggerParams;             // 0xa10(0x30)
	struct ControlObjectActionStateParams                        TavernPianoParams;                                 // 0xa40(0x28)
	struct CapturedByKrakenActionStateParams                     CapturedByKrakenParams;                            // 0xa68(0x40)
	struct IngestedByKrakenActionStateParams                     IngestedByKrakenParams;                            // 0xaa8(0x4)
	struct SwallowedByKrakenActionStateParams                    SwallowedByKrakenParams;                           // 0xaac(0x8)
	char                                                         pad0x4_S74SN[0x4];                                 // 0xab4(0x4)
	struct RideTransitionActionStateParams                       RideTransitionParams;                              // 0xab8(0x28)
	struct WaterSlideActionStateParams                           WaterSlideParams;                                  // 0xae0(0x30)
	struct ZipLineActionStateParams                              ZipLineParams;                                     // 0xb10(0x28)
	struct EnterTunnelOfTheDamnedActionStateParams               EnterTunnelOfTheDamnedParams;                      // 0xb38(0x1c)
	struct EjectFromTunnelOfTheDamnedActionStateParams           EjectFromTunnelOfTheDamnedParams;                  // 0xb54(0x20)
	struct ExitTunnelOfTheDamnedActionStateParams                ExitTunnelOfTheDamnedParams;                       // 0xb74(0x14)
	struct ArrivalTunnelOfTheDamnedActionStateParams             ArrivalTunnelOfTheDamnedParams;                    // 0xb88(0x24)
	struct SinkingTunnelOfTheDamnedActionStateParams             SinkingTunnelOfTheDamnedParams;                    // 0xbac(0x3c)
	struct CaptainsLogInteractableActionStateParams              CaptainsLogParams;                                 // 0xbe8(0x38)
	struct AttachedToObjectActionStateParams                     AttachedToObjectParams;                            // 0xc20(0x40)
	struct CompanyShopActionStateParams                          CompanyShopParams;                                 // 0xc60(0x14)
	char                                                         pad0x4_0DW3P[0x4];                                 // 0xc74(0x4)
	struct StandingSpyglassActionStateParams                     StandingSpyglassParams;                            // 0xc78(0x28)
	struct UseBalanceableWalkwayActionStateParams                BalanceableWalkwayActionStateParams;               // 0xca0(0xf0)
	struct MovedByPortableHarpoonGrappleActionStateParams        MovedByPortableHarpoonGrappleParams;               // 0xd90(0x60)
	struct MovedByPortableHarpoonRetractionActionStateParams     MovedByPortableHarpoonRetractionParams;            // 0xdf0(0x1c)
	char                                                         pad0x24_M06R6[0x24];                               // 0xe0c(0x24)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BaseHullDragDynamicsDesc: public DataAsset
{
public:
};


// Size 0x68 (Full Size[0x120] - InheritedSize[0xb8]
class PhrasesRadialComponent: public ActorComponent
{
public:
	char                                                         pad0x8_1GNRR[0x8];                                 // 0xb8(0x8)
	TArray<struct PlayModePhrases>                               DefaultPhrasesByPlayMode;                          // 0xc0(0x10)
	class PhrasesRadialDataAsset*                                DefaultPhrasesRadialDataAsset;                     // 0xd0(0x8)
	class PhrasesRadialDataAsset*                                DockablePhrasesRadialDataAsset;                    // 0xd8(0x8)
	class PhrasesRadialDataAsset*                                WieldedItemPhrasesRadialDataAsset;                 // 0xe0(0x8)
	char                                                         pad0x38_1KTPS[0x38];                               // 0xe8(0x38)
};


// Size 0x70 (Full Size[0x410] - InheritedSize[0x3a0]
class MechanismGroup: public Actor
{
public:
	char                                                         pad0x10_7E7LR[0x10];                               // 0x3a0(0x10)
	TArray<class Mechanism*>                                     Mechanisms;                                        // 0x3b0(0x10)
	struct WeightedProbabilityRangeOfRanges                      MechanismsToSelect;                                // 0x3c0(0x30)
	TArray<class Mechanism*>                                     SelectedMechanisms;                                // 0x400(0x10)
};


// Size 0x0 (Full Size[0xb8] - InheritedSize[0xb8]
class ShroudBreakerComponent: public ActorComponent
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class DamageableShipPartAudioParams: public DataAsset
{
public:
	class WwiseEvent*                                            DamageLevelEvent;                                  // 0x28(0x8)
	class WwiseObjectPoolWrapper*                                DamageLevelAudioPool;                              // 0x30(0x8)
	struct FName                                                 DamageLevelAudioSwitchName;                        // 0x38(0x8)
	TArray<struct Name>                                          DamageLevelAudioSwitchValues;                      // 0x40(0x10)
};


// Size 0x60 (Full Size[0x118] - InheritedSize[0xb8]
class ActorActivationComponent: public ActorComponent
{
public:
	char                                                         pad0x8_XLCEF[0x8];                                 // 0xb8(0x8)
	float                                                        ActivationDuration;                                // 0xc0(0x4)
	float                                                        DeactivationDuration;                              // 0xc4(0x4)
	bool                                                         AutoDestroyOnDeactivation;                         // 0xc8(0x1)
	char                                                         pad0x7_CQWK5[0x7];                                 // 0xc9(0x7)
	char                                                         pad0x48_HOTVB[0x48];                               // 0xd0(0x48)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BeckonGestureID: public Object
{
public:
};


// Size 0x1e0 (Full Size[0x580] - InheritedSize[0x3a0]
class FishingFishSpawner: public Actor
{
public:
	char                                                         pad0x8_D6J4R[0x8];                                 // 0x3a0(0x8)
	float                                                        SpawnerDistanceFromWaterSurface;                   // 0x3a8(0x4)
	char                                                         pad0x4_XTOTW[0x4];                                 // 0x3ac(0x4)
	TArray<Class>                                                FishToSpawnList;                                   // 0x3b0(0x10)
	float                                                        PlayerProximityActivationRange;                    // 0x3c0(0x4)
	float                                                        NearbyShipRange;                                   // 0x3c4(0x4)
	float                                                        FishSpawnRate;                                     // 0x3c8(0x4)
	float                                                        FishRespawnRate;                                   // 0x3cc(0x4)
	char                                                         NumFishToSpawn;                                    // 0x3d0(0x1)
	char                                                         pad0x7_1KO3Y[0x7];                                 // 0x3d1(0x7)
	class SceneComponent*                                        RootComp;                                          // 0x3d8(0x8)
	class BoxComponent*                                          FishSpawningZoneCollider;                          // 0x3e0(0x8)
	char                                                         TotalFishCaughtOrDespawned;                        // 0x3e8(0x1)
	char                                                         pad0x3_4V0SF[0x3];                                 // 0x3e9(0x3)
	float                                                        TimeForVFXToHide;                                  // 0x3ec(0x4)
	char                                                         pad0x8_4HGFT[0x8];                                 // 0x3f0(0x8)
	TArray<class FishingFish*>                                   AllSpawnedFishingFish;                             // 0x3f8(0x10)
	TArray<struct Guid>                                          AllSpawnedFishingFishGUIDs;                        // 0x408(0x10)
	char                                                         pad0x8_C8Z2Y[0x8];                                 // 0x418(0x8)
	char                                                         NumOfFishSpawned;                                  // 0x420(0x1)
	char                                                         pad0x3_I4RBV[0x3];                                 // 0x421(0x3)
	struct Vector                                                FishSpawningZoneColliderExtent;                    // 0x424(0xc)
	bool                                                         FishSpawningZoneColliderHiddenInGame;              // 0x430(0x1)
	char                                                         pad0x2f_Q2DR7[0x2f];                               // 0x431(0x2f)
	struct ObjectMessagingDispatcher                             EventDispatcher;                                   // 0x460(0xa0)
	char                                                         pad0x8_5QTPG[0x8];                                 // 0x500(0x8)
	TArray<struct SpawnedFishData>                               AllSpawnedFishData;                                // 0x508(0x10)
	char                                                         OriginalNumOfFishToSpawnInTale;                    // 0x518(0x1)
	char                                                         NumOfFishCaught;                                   // 0x519(0x1)
	bool                                                         AllFishCaught;                                     // 0x51a(0x1)
	char                                                         pad0x1_OQD0V[0x1];                                 // 0x51b(0x1)
	struct Guid                                                  FishSpawnerID;                                     // 0x51c(0x10)
	struct Guid                                                  VoyageID;                                          // 0x52c(0x10)
	char                                                         pad0x44_DM666[0x44];                               // 0x53c(0x44)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PursuitAIStrategyId: public AIStrategyId
{
public:
};


// Size 0x118 (Full Size[0x538] - InheritedSize[0x420]
class SequencerCutSceneActor: public LevelSequenceActor
{
public:
	char                                                         pad0x8_WFVB8[0x8];                                 // 0x420(0x8)
	struct CutScenePlayData                                      CutScenePlayData;                                  // 0x428(0x38)
	TArray<struct CutSceneLoadData>                              CutSceneDataSet;                                   // 0x460(0x10)
	class CutSceneSubtitlesComponent*                            CutsceneSubtitleComponent;                         // 0x470(0x8)
	class Pawn*                                                  InteractingPlayerPawn;                             // 0x478(0x8)
	bool                                                         IsLooping;                                         // 0x480(0x1)
	char                                                         pad0x7_V84RQ[0x7];                                 // 0x481(0x7)
	TArray<struct Guid>                                          CutSceneCrewIds;                                   // 0x488(0x10)
	class LevelSequence*                                         LevelSequenceToPlay;                               // 0x498(0x8)
	TArray<class LevelSequence*>                                 LevelSequencesToPlay;                              // 0x4a0(0x10)
	char                                                         pad0x80_55MP3[0x80];                               // 0x4b0(0x80)
	bool                                                         SequenceIsLoading;                                 // 0x530(0x1)
	char                                                         pad0x7_WRLYD[0x7];                                 // 0x531(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterAudioInterface: public Interface
{
public:
};


// Size 0x58 (Full Size[0xf0] - InheritedSize[0x98]
class WaitForCrewToArriveInTunnelOfTheDamnedTaleQuestStep: public TaleQuestStep
{
public:
	char                                                         pad0x58_N54TR[0x58];                               // 0x98(0x58)
};


// Size 0x0 (Full Size[0xb8] - InheritedSize[0xb8]
class TallTaleSpawnedActorComponent: public ActorComponent
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class WorldEventsCommandSettings: public DataAsset
{
public:
	int                                                          NumOfAllowedMainEventsInCustomSeas;                // 0x28(0x4)
	char                                                         pad0x4_D8LZ0[0x4];                                 // 0x2c(0x4)
	TArray<struct WorldEventsCommandEventData>                   WorldEventsData;                                   // 0x30(0x10)
	class EnvQuery*                                              BurningBladeEQS;                                   // 0x40(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventSchedulerServiceInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0x3b8] - InheritedSize[0x3a0]
class WorldEventZoneService: public Actor
{
public:
	char                                                         pad0x18_Y11C0[0x18];                               // 0x3a0(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class IslandAirPocketComponentInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SailHoistTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class StatusResponseOCReceiveBuffAudio: public StatusResponse
{
public:
};


// Size 0xb8 (Full Size[0x170] - InheritedSize[0xb8]
class TrinketLoadoutComponent: public ActorComponent
{
public:
	char                                                         pad0x18_1NXUR[0x18];                               // 0xb8(0x18)
	struct TrinketLoadout                                        Loadout;                                           // 0xd0(0x48)
	struct Guid                                                  CrewId;                                            // 0x120(0x10)
	char                                                         pad0x40_3SQJE[0x40];                               // 0x130(0x40)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SeaIdValidationDataAsset: public DataAsset
{
public:
	TArray<class Class*>                                         AllSeaIds;                                         // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FaunaSpecies: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FogBankTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlockImpactProxyInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ReapersMarkServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DelayedMeshCharacterInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class PlayerWorldLocationComponent: public ActorComponent
{
public:
	struct FName                                                 CurrentWorldLocation;                              // 0xb8(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class StatusResponseSleepCurse: public StatusResponse
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class FishSizeWeightsDataAsset: public DataAsset
{
public:
	TArray<struct FishSizeAndWeight>                             Data;                                              // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class HiddenActionStateId: public ActionStateId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PortalServiceInterface: public Interface
{
public:
};


// Size 0x80 (Full Size[0x100] - InheritedSize[0x80]
class SetHiddenOnKeyTakenStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    CutsceneLockNPC;                                   // 0x80(0x30)
	struct QuestVariableActor                                    SequencerCutSceneActor;                            // 0xb0(0x30)
	class LevelSequence*                                         LevelSequence;                                     // 0xe0(0x8)
	struct FString                                               ActorName;                                         // 0xe8(0x10)
	bool                                                         Visible;                                           // 0xf8(0x1)
	char                                                         pad0x7_FBDJC[0x7];                                 // 0xf9(0x7)
};


// Size 0x10 (Full Size[0x90] - InheritedSize[0x80]
class TaleQuestAddTemporaryEntitlementStepDesc: public TaleQuestStepDesc
{
public:
	TArray<Class>                                                Entitlements;                                      // 0x80(0x10)
};


// Size 0x100 (Full Size[0x1b8] - InheritedSize[0xb8]
class InGameScrambledNamesComponent: public ActorComponent
{
public:
	char                                                         pad0xe8_CDI8F[0xe8];                               // 0xb8(0xe8)
	class ScrambledNamesDataAsset*                               ScrambledPlayerNamesDataAsset;                     // 0x1a0(0x8)
	class ScrambledNamesDataAsset*                               ScrambledShipNamesDataAsset;                       // 0x1a8(0x8)
	class ScrambledNamesDataAsset*                               ScrambledGuildNamesDataAsset;                      // 0x1b0(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class NonVerbalRadialInventoryActivatedGamepadNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AudioVisualiserHudComponentInterface: public Interface
{
public:
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class TrapSocketMMCData: public Object
{
public:
	char                                                         pad0x8_4W7IL[0x8];                                 // 0x28(0x8)
	struct StringAssetReference                                  StaticMesh;                                        // 0x30(0x10)
	TArray<class MaterialInterface*>                             Materials;                                         // 0x40(0x10)
	int                                                          MMC_ResourceSize;                                  // 0x50(0x4)
	char                                                         pad0x4_HMK47[0x4];                                 // 0x54(0x4)
	class UClass*                                                MMC_FallbackCategory;                              // 0x58(0x8)
	class UClass*                                                MMC_Budget;                                        // 0x60(0x8)
	TArray<struct StringAssetReference>                          MMC_FallbackMaterials;                             // 0x68(0x10)
};


// Size 0x1b8 (Full Size[0x270] - InheritedSize[0xb8]
class RevealableComponent: public ActorComponent
{
public:
	char                                                         pad0x8_Y7Q4D[0x8];                                 // 0xb8(0x8)
	float                                                        ActorHiddenDistance;                               // 0xc0(0x4)
	float                                                        MaterialVisibleDistance;                           // 0xc4(0x4)
	float                                                        CloseRevealDistance;                               // 0xc8(0x4)
	bool                                                         InverseRevealableLogic;                            // 0xcc(0x1)
	char                                                         pad0x3_Y4ZLW[0x3];                                 // 0xcd(0x3)
	class UClass*                                                SceneType;                                         // 0xd0(0x8)
	TArray<class RevealRequirement*>                             RevealRequirements;                                // 0xd8(0x10)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0xe8(0x10)
	class Object*                                                TargetGameStateObject;                             // 0x158(0x8)
	bool                                                         PermanentlyRevealed;                               // 0x160(0x1)
	char                                                         pad0x77_3V80P[0x77];                               // 0x161(0x77)
	TArray<class RevealRequirement*>                             RequirementsPerRevealer;                           // 0x1d8(0x10)
	TArray<class RevealRequirement*>                             RequirementsPerRevealable;                         // 0x1e8(0x10)
	char                                                         pad0x78_44SZG[0x78];                               // 0x1f8(0x78)
};


// Size 0x1f0 (Full Size[0x4c0] - InheritedSize[0x2d0]
class VoiceChatComponent: public SceneComponent
{
public:
	char                                                         pad0x8_0YV2J[0x8];                                 // 0x2d0(0x8)
	struct WwiseEmitter                                          Emitter;                                           // 0x2d8(0x20)
	struct FName                                                 MouthSocketNameOnCharacterMesh;                    // 0x2f8(0x8)
	char                                                         pad0x1c0_HE60W[0x1c0];                             // 0x300(0x1c0)
};


// Size 0x138 (Full Size[0x160] - InheritedSize[0x28]
class PlayerBuriedItemServiceDataAsset: public DataAsset
{
public:
	class PopUpMessageDesc*                                      TreasureDiscoveredMessage;                         // 0x28(0x8)
	class PopUpMessageDesc*                                      TreasureDiscoveredByYouMessage;                    // 0x30(0x8)
	class PopUpMessageDesc*                                      TreasureRetrievedMessage;                          // 0x38(0x8)
	class PopUpMessageDesc*                                      TreasureRetrievedByYouMessage;                     // 0x40(0x8)
	class PopUpMessageDesc*                                      TreasureBuriedMapAddedMessage;                     // 0x48(0x8)
	float                                                        TreasureBuriedByYouMessageDelay;                   // 0x50(0x4)
	char                                                         pad0x4_RY67U[0x4];                                 // 0x54(0x4)
	class PopUpMessageDesc*                                      TreasureBuriedByYouMapAddedMessage;                // 0x58(0x8)
	class PopUpMessageDesc*                                      TreasureBuriedMapUpdatedMessage;                   // 0x60(0x8)
	class PopUpMessageDesc*                                      TreasureBuriedByYouMapUpdatedMessage;              // 0x68(0x8)
	class PopUpMessageDesc*                                      TreasureBuriedXNotCreatedMessage;                  // 0x70(0x8)
	class PopUpMessageDesc*                                      TreasureBuriedByYouXNotCreatedMessage;             // 0x78(0x8)
	class PopUpMessageDesc*                                      MapGiftedMessage;                                  // 0x80(0x8)
	class PopUpMessageDesc*                                      MapGiftedByYouMessage;                             // 0x88(0x8)
	class PopUpMessageDesc*                                      MapGiftedToYourCrewMessage;                        // 0x90(0x8)
	class PopUpMessageDesc*                                      MapBundleStolenVictimMessage;                      // 0x98(0x8)
	class PopUpMessageDesc*                                      MapBundleStolenVictimWasYouMessage;                // 0xa0(0x8)
	class PopUpMessageDesc*                                      MapBundleStolenPerpetratorMessage;                 // 0xa8(0x8)
	class PopUpMessageDesc*                                      MapBundleStolenPerpetratorWasYouMessage;           // 0xb0(0x8)
	class PopUpMessageDesc*                                      MapBundlePlacedOnTableMessage;                     // 0xb8(0x8)
	class PopUpMessageDesc*                                      MapBundleRetrievedMessage;                         // 0xc0(0x8)
	class PopUpMessageDesc*                                      MapBundleWasSpawnedInSunkenShip;                   // 0xc8(0x8)
	class PopUpMessageDesc*                                      MapWasAddedToTavernBoard;                          // 0xd0(0x8)
	class PopUpMessageDesc*                                      MapWasTakenFromTavernBoard;                        // 0xd8(0x8)
	TArray<char>                                                 PrioritiseUseRewardIdAsPopup;                      // 0xe0(0x10)
	class UClass*                                                PlayerBuriedItemMapItemDesc;                       // 0xf0(0x8)
	class UClass*                                                PlayerBuriedItemMapBundleItemDesc;                 // 0xf8(0x8)
	float                                                        ItemDigUpRadius;                                   // 0x100(0x4)
	char                                                         pad0x4_FQCP4[0x4];                                 // 0x104(0x4)
	TArray<struct PlayerBuriedItemServiceItemDigUpRadiusSurfaceOverride> ItemDigUpRadiusSurfaceOverride;                    // 0x108(0x10)
	float                                                        IsUndergroundLineTraceLength;                      // 0x118(0x4)
	char                                                         IsUndergroundLineTraceChannel;                     // 0x11c(0x1)
	char                                                         pad0x3_SFCMH[0x3];                                 // 0x11d(0x3)
	TArray<char>                                                 IgnoreSurfaceTypes;                                // 0x120(0x10)
	int                                                          NumXsDonationCommendationThreshold;                // 0x130(0x4)
	int                                                          DailyMapLimit;                                     // 0x134(0x4)
	class PlayerBuriedItemServiceMapStorePopulatorDataAsset*     MapStorePopulatorDataAsset;                        // 0x138(0x8)
	class PlayerBuriedItemServiceHaulSizeDataAsset*              HaulSizeDataAsset;                                 // 0x140(0x8)
	float                                                        ServerShutdownCompensationRewardScalar;            // 0x148(0x4)
	float                                                        MapBundleLostByAnotherCrewCompensationRewardScalar; // 0x14c(0x4)
	float                                                        SendRewardCompensationForItemsSecondsBeforeShutdown; // 0x150(0x4)
	int                                                          NumItemsRequiredOnMapForHoardStat;                 // 0x154(0x4)
	float                                                        LineTraceHalfLength;                               // 0x158(0x4)
	char                                                         HitTestTraceChannel;                               // 0x15c(0x1)
	char                                                         pad0x3_7R045[0x3];                                 // 0x15d(0x3)
};


// Size 0x108 (Full Size[0x4a8] - InheritedSize[0x3a0]
class TestDockableObject: public Actor
{
public:
	char                                                         pad0x30_M5Y8Q[0x30];                               // 0x3a0(0x30)
	class SceneComponent*                                        SceneComponent;                                    // 0x3d0(0x8)
	char                                                         pad0xb9_H4ZGE[0xb9];                               // 0x3d8(0xb9)
	char                                                         CurrentInteractionState;                           // 0x491(0x1)
	bool                                                         CanSetInteractionState;                            // 0x492(0x1)
	char                                                         pad0x15_5AW5F[0x15];                               // 0x493(0x15)
};


// Size 0x170 (Full Size[0x510] - InheritedSize[0x3a0]
class TributeToolTipActor: public Actor
{
public:
	char                                                         pad0x8_4EN01[0x8];                                 // 0x3a0(0x8)
	class InteractableComponentWithTooltipDetailedEventProvider* InteractableComponentWithTooltipDetailedEventProvider; // 0x3a8(0x8)
	class BladeOfSoulsUICardManagerComponent*                    BladeOfSoulsUICardManagerComponent;                // 0x3b0(0x8)
	struct FName                                                 WwiseEmitterName;                                  // 0x3b8(0x8)
	class WwiseObjectPoolWrapper*                                ToolTipWwisePool;                                  // 0x3c0(0x8)
	class WwiseEvent*                                            CardFlippedWwiseEvent;                             // 0x3c8(0x8)
	char                                                         pad0x140_P18EW[0x140];                             // 0x3d0(0x140)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestReactionStep: public TaleQuestStep
{
public:
};


// Size 0x48 (Full Size[0x3e8] - InheritedSize[0x3a0]
class HideoutEntrance: public Actor
{
public:
	class BoxComponent*                                          TriggerZoneComponent;                              // 0x3a0(0x8)
	TArray<class SpawnLocation*>                                 HideoutExitSpawnPoints;                            // 0x3a8(0x10)
	char                                                         pad0x30_1H72L[0x30];                               // 0x3b8(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WaterModifierZoneType: public Object
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class SpawnPhantomAIOnShipStatus: public StatusBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TelemetrySubjectInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0xc8] - InheritedSize[0xb8]
class PlayerActivityComponent: public ActorComponent
{
public:
	char                                                         pad0x8_VK9RI[0x8];                                 // 0xb8(0x8)
	char                                                         TopPriorityActivity;                               // 0xc0(0x1)
	char                                                         pad0x7_G1IX2[0x7];                                 // 0xc1(0x7)
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class StarChartVisualsDataAsset: public DataAsset
{
public:
	float                                                        DefaultStarPointEmissive;                          // 0x28(0x4)
	float                                                        GlowingStarPointEmissive;                          // 0x2c(0x4)
	struct LinearColor                                           DefaultStarPointColour;                            // 0x30(0x10)
	struct LinearColor                                           HighlightedStarPointColour;                        // 0x40(0x10)
	struct LinearColor                                           SelectedStarPointColour;                           // 0x50(0x10)
	struct LinearColor                                           ActivatedStarPointColour;                          // 0x60(0x10)
	struct LinearColor                                           DeselectedStarPointColour;                         // 0x70(0x10)
	struct LinearColor                                           ConnectorColour;                                   // 0x80(0x10)
	float                                                        EndOfHighlightDuration;                            // 0x90(0x4)
	float                                                        ErrorDuration;                                     // 0x94(0x4)
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class ContestSelectIslandForItemStep: public TaleQuestStep
{
public:
	char                                                         pad0x8_441QR[0x8];                                 // 0x98(0x8)
	TArray<struct Name>                                          SelectedIslands;                                   // 0xa0(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class MapTablePanYAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class BlueprintTelemetrySettings: public DeveloperSettings
{
public:
	bool                                                         ShouldExcludeNativeUFunctions;                     // 0x38(0x1)
	char                                                         pad0x7_JM9Q7[0x7];                                 // 0x39(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CatalogOfferDataAsset: public DataAsset
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MechanismElementProxyInterface: public Interface
{
public:
};


// Size 0x1a8 (Full Size[0x260] - InheritedSize[0xb8]
class SeaFortAddOnComponent: public ActorComponent
{
public:
	class SeaFortAddOnAISpawnDataAsset*                          AISpawnDataAsset;                                  // 0xb8(0x8)
	class AIBountySpawner*                                       AIBountySpawner;                                   // 0xc0(0x8)
	struct StringAssetReference                                  SeaFortAddOnDataStringAssetReference;              // 0xc8(0x10)
	class Actor*                                                 SpawnedItem;                                       // 0xd8(0x8)
	class OneShotAnimatedMechanismAction*                        PrisonerCellDoor;                                  // 0xe0(0x8)
	class Actor*                                                 RitualCandle;                                      // 0xe8(0x8)
	char                                                         pad0x160_CSH0X[0x160];                             // 0xf0(0x160)
	class LockComponent*                                         PrisonerLockComponent;                             // 0x250(0x8)
	bool                                                         IsCandleVfxActive;                                 // 0x258(0x1)
	char                                                         pad0x7_B8382[0x7];                                 // 0x259(0x7)
};


// Size 0x210 (Full Size[0x2c8] - InheritedSize[0xb8]
class ShipSpeedModifierComponent: public ActorComponent
{
public:
	char                                                         pad0x210_WCJEG[0x210];                             // 0xb8(0x210)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ShipHullDamageDataAsset: public DataAsset
{
public:
	struct ShipHullDamageParams                                  DamageParams;                                      // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FirstPersonAnimaticActionStateId: public ActionStateId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MeshMemoryWorldSettingsInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OffBottomTransitionLadderActionStateId: public ActionStateId
{
public:
};


// Size 0x20 (Full Size[0xd8] - InheritedSize[0xb8]
class UsableItemObscuringComponent: public ActorComponent
{
public:
	char                                                         pad0x20_2DGPX[0x20];                               // 0xb8(0x20)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class MerchantQuestItemData: public DataAsset
{
public:
	class MerchantQuestItemPluralisationData*                    DisplayNameLookup;                                 // 0x28(0x8)
	struct RewardId                                              HandInOnTimeRewardId;                              // 0x30(0x8)
	class UClass*                                                CrateDesc;                                         // 0x38(0x8)
	TArray<struct MerchantQuestItemDescAndReward>                AcceptableAlternativeCrateItemData;                // 0x40(0x10)
	class Texture*                                               IconImage;                                         // 0x50(0x8)
	class UClass*                                                FaunaSpecies;                                      // 0x58(0x8)
	class UClass*                                                FaunaBreed;                                        // 0x60(0x8)
	class PopUpMessageDesc*                                      CrateFilledPopupDesc;                              // 0x68(0x8)
	bool                                                         IsOnlyFoundInWorld;                                // 0x70(0x1)
	char                                                         pad0x7_GEJQU[0x7];                                 // 0x71(0x7)
};


// Size 0x138 (Full Size[0x1f0] - InheritedSize[0xb8]
class CutsceneComponent: public ActorComponent
{
public:
	char                                                         pad0x10_H8ZNL[0x10];                               // 0xb8(0x10)
	TArray<struct Text>                                          LocalisedNames;                                    // 0xc8(0x10)
	class CutsceneDataAsset*                                     CutsceneAsset;                                     // 0xd8(0x8)
	class Actor*                                                 CutSceneActor;                                     // 0xe0(0x8)
	class UClass*                                                CutsceneActorType;                                 // 0xe8(0x8)
	float                                                        MaxPlayRange;                                      // 0x100(0x4)
	float                                                        DelayBeforeDequeueAttempt;                         // 0x104(0x4)
	char                                                         pad0xe8_3IO1T[0xe8];                               // 0x108(0xe8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ItemUserInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PetShopDataAsset: public DataAsset
{
public:
	TArray<struct PetShopPetSpecies>                             Species;                                           // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BalanceableWalkwayInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleBookInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestVoyageCompleteBannerStep: public TaleQuestStep
{
public:
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class NPCOnSurfaceManager: public Object
{
public:
	class NPCOnSurfaceDataAsset*                                 NPCOnSurfaceDataAsset;                             // 0x28(0x8)
	class NPCOnSurface*                                          NPC;                                               // 0x30(0x8)
	char                                                         pad0x18_W5AFJ[0x18];                               // 0x38(0x18)
	class Actor*                                                 ParentActor;                                       // 0x50(0x8)
	TArray<class Cannon*>                                        CannonActors;                                      // 0x58(0x10)
	class NPCOnSurfaceVOManager*                                 VOManager;                                         // 0x68(0x8)
	class NPCOnSurfaceCannonManager*                             CannonManager;                                     // 0x70(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class MapTableTogglePinNotificationInputId: public NotificationInputId
{
public:
};


// Size 0xc8 (Full Size[0x468] - InheritedSize[0x3a0]
class PortalService: public Actor
{
public:
	char                                                         pad0x8_93MPQ[0x8];                                 // 0x3a0(0x8)
	class PortalServiceParams*                                   Params;                                            // 0x3a8(0x8)
	TArray<struct ActivePortal>                                  ActivePortals;                                     // 0x3b0(0x10)
	TArray<struct PortalSpawningInfo>                            PortalSpawnInfos;                                  // 0x3c0(0x10)
	char                                                         pad0x98_RV0W8[0x98];                               // 0x3d0(0x98)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class ProtoTavernPianoKeyBNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class AnimNotify_PlayWorldCameraShake: public AnimNotify
{
public:
	class UClass*                                                CameraShake;                                       // 0x38(0x8)
	float                                                        ShakeInnerRadius;                                  // 0x40(0x4)
	float                                                        ShakeOuterRadius;                                  // 0x44(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class AthenaCharacterMovementCheatDetectionSettings: public Object
{
public:
	float                                                        MinLifetime;                                       // 0x28(0x4)
	float                                                        MinRatioLifetimeToLifetimeRawTimeDiscrepancy;      // 0x2c(0x4)
};


// Size 0x80 (Full Size[0x138] - InheritedSize[0xb8]
class QuickInventoryComponent: public ActorComponent
{
public:
	char                                                         pad0x18_PRP4A[0x18];                               // 0xb8(0x18)
	class UClass*                                                CannonballItemCategory;                            // 0xd0(0x8)
	class UClass*                                                CursedCannonballItemCategory;                      // 0xd8(0x8)
	class UClass*                                                FoodItemCategory;                                  // 0xe0(0x8)
	class UClass*                                                EnchantedFoodItemCategory;                         // 0xe8(0x8)
	class UClass*                                                RepairablesItemCategory;                           // 0xf0(0x8)
	class UClass*                                                BaitItemCategory;                                  // 0xf8(0x8)
	class UClass*                                                FireBombCategory;                                  // 0x100(0x8)
	class UClass*                                                ChainShotCategory;                                 // 0x108(0x8)
	class UClass*                                                GrapeShotCategory;                                 // 0x110(0x8)
	class UClass*                                                FireworkCategory;                                  // 0x118(0x8)
	class UClass*                                                DeployableCategory;                                // 0x120(0x8)
	char                                                         pad0x10_FPGU1[0x10];                               // 0x128(0x10)
};


// Size 0x78 (Full Size[0x300] - InheritedSize[0x288]
class AthenaCharacterBaseLocomotionInputComponent: public AthenaCharacterBaseInputComponent
{
public:
	char                                                         pad0x70_KXGL1[0x70];                               // 0x288(0x70)
	class UClass*                                                ThrowablesItemCategory;                            // 0x2f8(0x8)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class WaitForMechanismActionCompletionStep: public TaleQuestStep
{
public:
	class WaitForMechanismActionCompletionStepDesc*              Desc;                                              // 0x98(0x8)
};


// Size 0x0 (Full Size[0x3a0] - InheritedSize[0x3a0]
class ReapersTributeShipSequenceCutsceneSpawnLocation: public Actor
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ReapersTributeShipDefeatedStateDataAsset: public DataAsset
{
public:
	int                                                          NumberOfCannonHitsToSinkWaterloggedShip;           // 0x28(0x4)
	float                                                        TimeBeforeCannonHitsCountForDefeatedWaterloggedShip; // 0x2c(0x4)
	TArray<class Class*>                                         DamageTypesAllowed;                                // 0x30(0x10)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class SpawnCollectableQuestObjectStepDesc: public TaleQuestStepDesc
{
public:
	class UClass*                                                CollectableQuestBookPageToSpawn;                   // 0x80(0x8)
	struct QuestVariablePlayerActor                              CollectingPlayerActor;                             // 0x88(0x30)
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class VulnerabilityAIAbilityParams: public AthenaAIAbilityParams
{
public:
	struct AthenaAIAbilityPlayerBasedRanges                      VulnerabilityDuration;                             // 0xc8(0x10)
	struct AthenaAIAbilityPlayerBasedRanges                      MaxVulnerabilityPeriodDamageThreshold;             // 0xd8(0x10)
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class WaterSensitiveComponent: public ActorComponent
{
public:
	class WaterSensitiveComponentDataAsset*                      WaterSensitiveData;                                // 0xb8(0x8)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class SpawnPortalTaleStepDesc: public TaleQuestStepDesc
{
public:
	class PortalDesc*                                            PortalDesc;                                        // 0x80(0x8)
	struct QuestVariableActor                                    SpawnedPortal;                                     // 0x88(0x30)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class InGameCommandItemSpawnManager: public Object
{
public:
	class SpawnCommandsItemList*                                 ItemList;                                          // 0x28(0x8)
	char                                                         pad0x18_3WGN9[0x18];                               // 0x30(0x18)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class CutsceneAnimationDataAsset: public DataAsset
{
public:
	char                                                         pad0x8_3TISZ[0x8];                                 // 0x28(0x8)
	TArray<struct CutsceneAnimationElement>                      CutsceneElements;                                  // 0x30(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ServerNotificationsServiceInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestReactionStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    PlaceableReaction;                                 // 0x80(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WorldMarkerBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestNotificationUsingVariableStep: public TaleQuestStep
{
public:
	class TaleQuestNotificationUsingVariableStepDesc*            Desc;                                              // 0x98(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShovelDigActionStateId: public ActionStateId
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ShipMilestoneDescriptions: public DataAsset
{
public:
	TArray<struct MilestoneAlignment>                            ShipMilestoneAlignments;                           // 0x28(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class ToggleItemNotificationInputId: public NotificationInputId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ActorRelevancyTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ShipFactory: public Object
{
public:
	char                                                         pad0x8_SPH0X[0x8];                                 // 0x28(0x8)
	TArray<class ShipBuilder*>                                   Builders;                                          // 0x30(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShipSinkingHandlerInterface: public Interface
{
public:
};


// Size 0x178 (Full Size[0x2b8] - InheritedSize[0x140]
class BalanceableWalkwayComponent: public InteractableComponent
{
public:
	char                                                         pad0x30_PFFUY[0x30];                               // 0x140(0x30)
	struct Vector                                                StartPoint;                                        // 0x170(0xc)
	struct Vector                                                EndPoint;                                          // 0x17c(0xc)
	class CurveFloat*                                            UniqueRopeCounterBalanceForceCurve;                // 0x188(0x8)
	class BalanceableWalkwayDataAsset*                           WalkwayDataAsset;                                  // 0x190(0x8)
	class BalanceableWalkwayFXParams*                            WalkwayFXDataAsset;                                // 0x198(0x8)
	char                                                         pad0x14_XTXV0[0x14];                               // 0x1a0(0x14)
	bool                                                         IsValidWalkway;                                    // 0x1b4(0x1)
	char                                                         pad0x103_2VLLB[0x103];                             // 0x1b5(0x103)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PortalServiceParams: public DataAsset
{
public:
	float                                                        MinimumSpawnRangeInMeters;                         // 0x28(0x4)
	float                                                        MaximumSpawnRangeInMeters;                         // 0x2c(0x4)
	float                                                        PortalBoundsThreshold;                             // 0x30(0x4)
	char                                                         pad0x4_ZLCUX[0x4];                                 // 0x34(0x4)
};


// Size 0x2d0 (Full Size[0x5a0] - InheritedSize[0x2d0]
class TrinketMountpointManagerComponent: public SceneComponent
{
public:
	char                                                         pad0x18_AEU7Q[0x18];                               // 0x2d0(0x18)
	class MountpointParamsDataAsset*                             MountpointParamsDataAsset;                         // 0x2e8(0x8)
	TArray<struct ReplicatedMountpointData>                      ReplicatedMountpointData;                          // 0x2f0(0x10)
	TArray<bool>                                                 IsNudged;                                          // 0x300(0x10)
	int                                                          MountedItemCount;                                  // 0x330(0x4)
	char                                                         pad0x4_DKVAE[0x4];                                 // 0x334(0x4)
	class WwiseObjectPoolWrapper*                                TrinketSfxPool;                                    // 0x338(0x8)
	bool                                                         TrinketsEnabled;                                   // 0x340(0x1)
	bool                                                         TrinketsShouldBeDisplayed;                         // 0x341(0x1)
	char                                                         pad0x2_X30OJ[0x2];                                 // 0x342(0x2)
	struct FName                                                 Feature;                                           // 0x344(0x8)
	char                                                         pad0x4_BC8GO[0x4];                                 // 0x34c(0x4)
	struct MountTrinketActionRuleParams                          MountTrinketActionRuleParams;                      // 0x350(0x88)
	struct StraightenNudgedTrinketActionRuleParams               StraightenNudgedTrinketActionRuleParams;           // 0x3d8(0x40)
	TArray<class Class*>                                         TrinketCategoriesToDisplayInUI;                    // 0x418(0x10)
	TArray<class Class*>                                         ComponentsAllowedForTrinketVisuals;                // 0x428(0x10)
	TArray<class NudgePolicy*>                                   NudgePolicies;                                     // 0x438(0x10)
	class TrinketLoadoutFinderPolicyBase*                        TrinketLoadoutFinderPolicy;                        // 0x448(0x8)
	TArray<bool>                                                 CachedCanTrinketEverBeNudged;                      // 0x450(0x10)
	TArray<struct MountpointClientState>                         MountpointClientStates;                            // 0x460(0x10)
	float                                                        TickRelevancySquared;                              // 0x470(0x4)
	char                                                         pad0x4_USMH6[0x4];                                 // 0x474(0x4)
	TArray<struct TrinketNudgeProgress>                          NudgingTrinketProgress;                            // 0x478(0x10)
	char                                                         pad0x100_STXU6[0x100];                             // 0x488(0x100)
	TArray<class StaticMeshComponent*>                           TrinketReplacementMeshes;                          // 0x588(0x10)
	char                                                         pad0x8_RWI8B[0x8];                                 // 0x598(0x8)
};


// Size 0x78 (Full Size[0x130] - InheritedSize[0xb8]
class PlayerHeroStatsComponent: public ActorComponent
{
public:
	TArray<struct PlayerHeroStatUnit>                            HeroStats;                                         // 0xb8(0x10)
	TArray<Int64 ServerValues>                                   ServerValues;                                      // 0xc8(0x10)
	char                                                         pad0x58_1VMOJ[0x58];                               // 0xd8(0x58)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestResetShipBuoyancyServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ReplenishableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DockableKeyedInstrumentInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class InteractionPoliciesTestFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0xc8 (Full Size[0x468] - InheritedSize[0x3a0]
class StormService: public Actor
{
public:
	char                                                         pad0x50_HLL55[0x50];                               // 0x3a0(0x50)
	TArray<class Actor*>                                         StormList;                                         // 0x3f0(0x10)
	char                                                         pad0x68_9I0JK[0x68];                               // 0x400(0x68)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GuildInviterInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CharacterSwimmingInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class KnockbackAIAbilityType: public AthenaAIAbilityType
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class SetSpawnProgressStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    TriggerVolume;                                     // 0x80(0x30)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AnimNotify_DockableCutscene: public AnimNotify
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class MeleeAttackLockOnComponentSettings: public DataAsset
{
public:
	class LockOnCameraModifierSettings*                          CameraModifierSettings;                            // 0x28(0x8)
	float                                                        BreakDistance;                                     // 0x30(0x4)
	bool                                                         DelayTargetEvaluationUntilEndOfStrike;             // 0x34(0x1)
	bool                                                         AllowTargetSwitching;                              // 0x35(0x1)
	char                                                         pad0x2_LXV1V[0x2];                                 // 0x36(0x2)
	float                                                        MaxLockOnAngle;                                    // 0x38(0x4)
	float                                                        MaxLockOnDistance;                                 // 0x3c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LiquidLauncherChargeInterface: public Interface
{
public:
};


// Size 0x80 (Full Size[0x420] - InheritedSize[0x3a0]
class InteractableMockActor: public Actor
{
public:
	char                                                         pad0x18_YOGV5[0x18];                               // 0x3a0(0x18)
	class Actor*                                                 ActorThatInteracted;                               // 0x3b8(0x8)
	char                                                         pad0x8_Y149L[0x8];                                 // 0x3c0(0x8)
	TArray<class Class*>                                         CanInteractNotifications;                          // 0x3c8(0x10)
	class CapsuleComponent*                                      PrimitiveComponent;                                // 0x3d8(0x8)
	class InteractableComponent*                                 InteractableComponent;                             // 0x3e0(0x8)
	class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x3e8(0x8)
	char                                                         CurrentInteractionState;                           // 0x3f0(0x1)
	char                                                         pad0x7_IT5YC[0x7];                                 // 0x3f1(0x7)
	TArray<class InteractionPrerequisiteBase*>                   Prerequisites;                                     // 0x3f8(0x10)
	bool                                                         CanSetInteractionState;                            // 0x408(0x1)
	char                                                         pad0x17_4RRWZ[0x17];                               // 0x409(0x17)
};


// Size 0x398 (Full Size[0x450] - InheritedSize[0xb8]
