// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class AudioReportReaction: public Object
{
public:
};


// Size 0x178 (Full Size[0x240] - InheritedSize[0xc8]
class AudioReportingComponent: public ActorComponent
{
public:
	Class PlayerController*                                      CachedOwningController;                            // 0xc8(0x8)
	char                                                         pad0x170_K93C3[0x170];                             // 0xd0(0x170)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class AudioReportingConfig: public DeveloperSettings
{
public:
	Struct StringAssetReference                                  AudioReportingSettings;                            // 0x38(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AudioReportingDebugMenuGenerator: public DebugMenuEntryGenerator
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EventReactionsDataAsset: public DataAsset
{
public:
	TArray<struct Reactions>                                     Reactions;                                         // 0x28(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class AudioReportingSettings: public DataAsset
{
public:
	int                                                          MaxReactionCount;                                  // 0x28(0x4)
	float                                                        AudioVeryCloseThresholdDistance;                   // 0x2c(0x4)
	float                                                        AttenuationFilterScaler;                           // 0x30(0x4)
	char                                                         pad0x4_IIZNY[0x4];                                 // 0x34(0x4)
	TArray<class EventReactionsDataAsset*>                       EventReactionDataAssets;                           // 0x38(0x10)
};


}