// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20
class BP_BuoyantStorageBarrel_LockedToWater_CursedSails_C: public BuoyantStorageContainer
{
public:
	Class SphereComponent*                                       Sphere;                                            // 0x6e8(0x8)
	Class ReplenishableComponent*                                Replenishable;                                     // 0x6f0(0x8)
	Class TelemetrySubjectComponent*                             TelemetrySubject;                                  // 0x6f8(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x700(0x8)
};


// Size 0x0
class BP_fod_EarthwormsFresh_00_a_ItemDesc_C: public ItemDesc
{
public:
};


// Size 0x30
class BP_TaleBook_LegendaryStoryteller_AdditionalPuzzles_C: public VoyageProposalContainer
{
public:
	Class ParticleSystemComponent*                               Portal VFX;                                        // 0x418(0x8)
	Class WwiseEmitterComponent*                                 WwiseEmitter;                                      // 0x420(0x8)
	Class StaticMeshComponent*                                   Portal;                                            // 0x428(0x8)
	Class StaticMeshComponent*                                   shroud;                                            // 0x430(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x438(0x8)
	TArray<class DynamicMaterials*>                              DynamicMaterials;                                  // 0x440(0x10)
};


// Size 0x20
class BP_MA_LS_BuoyantStorageBarrel_LockedToWater_C: public BuoyantStorageContainer
{
public:
	Class SphereComponent*                                       Sphere;                                            // 0x6e8(0x8)
	Class ReplenishableComponent*                                Replenishable;                                     // 0x6f0(0x8)
	Class TelemetrySubjectComponent*                             TelemetrySubject;                                  // 0x6f8(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x700(0x8)
};


// Size 0x20
class BP_BuoyantStorageBarrel_LockedToWater_C: public BuoyantStorageContainer
{
public:
	Class SphereComponent*                                       Sphere;                                            // 0x6e8(0x8)
	Class ReplenishableComponent*                                Replenishable;                                     // 0x6f0(0x8)
	Class TelemetrySubjectComponent*                             TelemetrySubject;                                  // 0x6f8(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x700(0x8)
};


}