#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "BoarWallowFramework_Structs.h"


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class IBoarHideoutInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0xc8] - InheritedSize[0xb8]
class FaunaBoarWallowFinder: public ActorComponent
{
public:
	class BoarWallow*                                            SelectedBoarWallow;                                // 0xb8(0x8)
	bool                                                         IsFaunaBoarWallowFinderFeatureEnabled;             // 0xc0(0x1)
	char                                                         pad0x7_HOTHR[0x7];                                 // 0xc1(0x7)
};


// Size 0xb0 (Full Size[0x450] - InheritedSize[0x3a0]
class BoarWallow: public Actor
{
public:
	char                                                         pad0x18_OQUD6[0x18];                               // 0x3a0(0x18)
	int                                                          NumberOfBoarsInHideout;                            // 0x3b8(0x4)
	int                                                          MaxNumberOfBoarsInHideout;                         // 0x3bc(0x4)
	char                                                         pad0x80_70JB6[0x80];                               // 0x3c0(0x80)
	TArray<class Pawn*>                                          FaunasSubscribedWithThisHideout;                   // 0x440(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BoarWallowServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BoarsAndBoarWallowRandomiserInterface: public Interface
{
public:
};


// Size 0xb0 (Full Size[0x450] - InheritedSize[0x3a0]
class BoarsAndBoarWallowRandomiserService: public Actor
{
public:
	char                                                         pad0x8_64RP9[0x8];                                 // 0x3a0(0x8)
	TArray<struct Name>                                          BoarsAndBoarWallowIslandsMap;                      // 0x3a8(0x10)
	char                                                         pad0x98_ZL4YW[0x98];                               // 0x3b8(0x98)
};


// Size 0x420 (Full Size[0x7c0] - InheritedSize[0x3a0]
class BoarWallowService: public Actor
{
public:
	char                                                         pad0xd0_293EI[0xd0];                               // 0x3a0(0xd0)
	class UClass*                                                BoarWallowAsset;                                   // 0x470(0x8)
	TArray<class Pawn*>                                          FaunasSubscribedWithTheHideoutBeingDestroyed;      // 0x478(0x10)
	char                                                         pad0x338_I7TU7[0x338];                             // 0x488(0x338)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class BoarWallowServiceParams: public DataAsset
{
public:
	class UClass*                                                BoarWallowAssetTemplate;                           // 0x28(0x8)
};


