#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x28
struct BoneCallerImpactIdToSpawner
{
public:
	class UClass*                                                ImpactProjectileId;                                // 0x0(0x8)
	class AIFixedWavesSpawner*                                   ShipSpawner;                                       // 0x8(0x8)
	class AIFixedWavesSpawner*                                   LandSpawner;                                       // 0x10(0x8)
	TArray<struct AttitudeOverrideEntry>                         SpawnedPawnAttitudeOverrides;                      // 0x18(0x10)
};


// Size 0x38
struct EventOnBoneCallerDidKillEvent
{
public:
	class Actor*                                                 KilledCharacter;                                   // 0x0(0x8)
	struct                                                       DamageInstance;                                    // 0x8(0x30)
};


// Size 0x18
struct BoneCallerPawnKillTelemetry
{
public:
	struct FString                                               KilledPawnName;                                    // 0x0(0x10)
	bool                                                         WasSpawnedByBoneCaller;                            // 0x10(0x1)
};


// Size 0x28
struct EventOnBoneCallerExploded
{
public:
	class Actor*                                                 RootInstigator;                                    // 0x0(0x8)
	class Actor*                                                 HitActor;                                          // 0x8(0x8)
	class Object*                                                ImpactProjectileId;                                // 0x20(0x8)
};


// Size 0x20
struct BoneCallerUsageTelemetry
{
public:
	struct                                                       Location;                                          // 0x0(0xc)
	struct FString                                               Region;                                            // 0x10(0x10)
};


// Size 0x20
struct PlayerBoneCallerData
{
public:
	class AIFixedWavesSpawner*                                   Spawner;                                           // 0x0(0x8)
};


