#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x10
struct EventOnBoneCallerAIKilled
{
public:
	class Actor*                                                 KilledCharacter;                                   // 0x0(0x8)
	class Actor*                                                 Killer;                                            // 0x8(0x8)
};


// Size 0x18
struct BoneCallerPawnKillTelemetry
{
public:
	struct FString                                               KilledPawnName;                                    // 0x0(0x10)
	bool                                                         WasSpawnedByBoneCaller;                            // 0x10(0x1)
	char                                                         pad0x7_C2BBE[0x7];                                 // 0x11(0x7)
};


// Size 0x10
struct EventOnBoneCallerSpawned
{
public:
	class Actor*                                                 SpawnedCharacter;                                  // 0x0(0x8)
	struct FName                                                 IslandWhereCharacterSpawned;                       // 0x8(0x8)
};


// Size 0x38
struct EventOnBoneCallerDidKillEvent
{
public:
	class Actor*                                                 KilledCharacter;                                   // 0x0(0x8)
	struct DamageInstance                                        DamageInstance;                                    // 0x8(0x30)
};


// Size 0x20
struct BoneCallerUsageTelemetry
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	char                                                         pad0x4_HS339[0x4];                                 // 0xc(0x4)
	struct FString                                               Region;                                            // 0x10(0x10)
};


// Size 0x28
struct EventOnBoneCallerExploded
{
public:
	class Actor*                                                 RootInstigator;                                    // 0x0(0x8)
	class Actor*                                                 HitActor;                                          // 0x8(0x8)
	char                                                         pad0x10_VM1ES[0x10];                               // 0x10(0x10)
	class Object*                                                BoneCallerSpawnId;                                 // 0x20(0x8)
};


// Size 0x20
struct PlayerBoneCallerData
{
public:
	char                                                         pad0x20_744E8[0x20];                               // 0x0(0x20)
};


// Size 0x10
struct BoneCallerSpawnIdShipSizeOverride
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	class UClass*                                                BoneCallerSpawnIdOverride;                         // 0x8(0x8)
};


// Size 0x28
struct BoneCallerImpactIdToSpawner
{
public:
	class UClass*                                                BoneCallerSpawnId;                                 // 0x0(0x8)
	class AIFixedWavesSpawner*                                   ShipSpawner;                                       // 0x8(0x8)
	class AIFixedWavesSpawner*                                   LandSpawner;                                       // 0x10(0x8)
	TArray<struct AttitudeOverrideEntry>                         SpawnedPawnAttitudeOverrides;                      // 0x18(0x10)
};


