#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x3c (Full Size[0x12c] - InheritedSize[0xf0]
class BP_AnimatedStepsComponent_C: public AnimatedStepsComponent
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0xf0(0x8)
	char                                                         pad0x102_WFWTK[0x102];                             // 0xf8(0x102)
	TArray<float>                                                BoxDelays;                                         // 0xf8(0x10)
	TArray<float>                                                BoxTargetZs;                                       // 0x108(0x10)
	class CurveFloat*                                            AnimCurve;                                         // 0x118(0x8)
	float                                                        MovementTimer;                                     // 0x120(0x4)
	float                                                        AnimationDuration;                                 // 0x124(0x4)
	float                                                        AnimationStartDelay;                               // 0x128(0x4)
};


