// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x100 (Full Size[0x1810] - InheritedSize[0x1710]
class BP_AISmallShipTemplate_C: public Ship
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x1710(0x8)
	Class ShipStorageJettisonComponent*                          None;                                              // 0x1718(0x8)
	Class AIShipItemSpawnComponent*                              None;                                              // 0x1720(0x8)
	Class AIShipItemSpawnComponent*                              None;                                              // 0x1728(0x8)
	Class AIShipItemSpawnComponent*                              None;                                              // 0x1730(0x8)
	Class AIShipItemSpawnComponent*                              None;                                              // 0x1738(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1740(0x8)
	Class AIShipItemSpawnComponent*                              None;                                              // 0x1748(0x8)
	Class AIShipItemSpawnComponent*                              None;                                              // 0x1750(0x8)
	Class WwiseEmitterComponent*                                 None;                                              // 0x1758(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1760(0x8)
	Class AIShipItemSpawnComponent*                              None;                                              // 0x1768(0x8)
	Class AIShipItemSpawnComponent*                              None;                                              // 0x1770(0x8)
	Class AIShipItemSpawnComponent*                              None;                                              // 0x1778(0x8)
	Class AIShipItemSpawnComponent*                              None;                                              // 0x1780(0x8)
	Class AIShipTelemetryComponent*                              None;                                              // 0x1788(0x8)
	Class AIRegionComponent*                                     None;                                              // 0x1790(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1798(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17a0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17a8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17b0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17b8(0x8)
	Class BoxComponent*                                          None;                                              // 0x17c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x17c8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17d0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17d8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17e0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17e8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17f0(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x17f8(0x8)
	Struct AIShipSailData                                        None;                                              // 0x1800(0x10)
};


}