// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x50 (Full Size[0x418] - InheritedSize[0x3c8]
class BP_Adv12_GoldChest_LargeOpen_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x3c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x3f8(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a;                                     // 0x400(0x8)
	Class StaticMeshComponent*                                   GoldPile;                                          // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x410(0x8)
};


}