// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc8 (Full Size[0x6d0] - InheritedSize[0x608]
class BP_AudioBoatSmallHullAmbi_C: public ShipHullAudio
{
public:
	Class TritonComponent*                                       None;                                              // 0x608(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x610(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x618(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x620(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x628(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x630(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x638(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x640(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x648(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x650(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x658(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x660(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x668(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x670(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x678(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x680(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x688(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x690(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x698(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x6a0(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x6a8(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x6b0(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x6b8(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x6c0(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x6c8(0x8)
};


}