// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1b8 (Full Size[0x7f0] - InheritedSize[0x638]
class BP_AudioBoatLargeHullAmbi_C: public ShipHullAudio
{
public:
	Class TritonComponent*                                       Triton;                                            // 0x638(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Wake_Bow;                                // 0x640(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Water_Wash_Front_Right;                  // 0x648(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Water_Wash_Front_Left;                   // 0x650(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Water_Wash_Bow;                          // 0x658(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Water_Wash_Back_Right;                   // 0x660(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Water_Wash_Back_Left;                    // 0x668(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Wake_Stern;                              // 0x670(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_TopDeck_Side_Right;                // 0x678(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_TopDeck_Side_Left;                 // 0x680(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_TopDeck_PitchRoll;                 // 0x688(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_TopDeck_Front_Top;                 // 0x690(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_TopDeck_Front_Right;               // 0x698(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_TopDeck_Back_Left;                 // 0x6a0(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_TopDeck_Bow_Rope;                  // 0x6a8(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_TopDeck_Bow_Bottom;                // 0x6b0(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_TopDeck_Back_Rope;                 // 0x6b8(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_TopDeck_Back_Right;                // 0x6c0(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_TopDeck_Front_Left;                // 0x6c8(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Mast_Mizzen_Base;                  // 0x6d0(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Mast_Mizzen_Sail2;                 // 0x6d8(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Mast_Mizzen_Sail1;                 // 0x6e0(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Mast_Main_Sail1;                   // 0x6e8(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Mast_Main_Sail3;                   // 0x6f0(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Mast_Main_Sail2;                   // 0x6f8(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Mast_Main_Base;                    // 0x700(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Mast_Fore_Base;                    // 0x708(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Mast_Fore_Sail2;                   // 0x710(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Mast_Fore_Sail1;                   // 0x718(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_MapDeck_Pillar_Mid_Right;          // 0x720(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_MapDeck_Pillar_Front_Right;        // 0x728(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_MapDeck_Pillar_Front_Left;         // 0x730(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_MapDeck_Pillar_Back_Right;         // 0x738(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_MapDeck_Pillar_Mid_Left;           // 0x740(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_MapDeck_Mast_Mizzen;               // 0x748(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_MapDeck_Mast_Main;                 // 0x750(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_MapDeck_Mast_Fore;                 // 0x758(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_MapDeck_Pillar_Back_Left;          // 0x760(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Captain_Back_Left;                 // 0x768(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Captain_Lamp;                      // 0x770(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Captain_Front_Right;               // 0x778(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Captain_Front_Left;                // 0x780(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Captain_Cage;                      // 0x788(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_Captain_Back_Right;                // 0x790(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_BrigDeck_Centre;                   // 0x798(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_BrigDeck_Pillar_Front_Right;       // 0x7a0(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_BrigDeck_Pillar_Front_Left;        // 0x7a8(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_BrigDeck_Pillar_Back_Right;        // 0x7b0(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Creak_BrigDeck_Pillar_Back_Left;         // 0x7b8(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_Ambience_BelowDeck;                      // 0x7c0(0x8)
	Class AudioPortalComponent*                                  LargeBoat_AudioPortal_BrigDeckDoor;                // 0x7c8(0x8)
	Class AudioPortalComponent*                                  LargeBoat_AudioPortal_MapDeckStairs;               // 0x7d0(0x8)
	Class AudioPortalComponent*                                  LargeBoat_AudioPortal_MapDeckGrille;               // 0x7d8(0x8)
	Class AudioPortalComponent*                                  LargeBoat_AudioPortal_CaptCab_DeckDoor;            // 0x7e0(0x8)
	Class AudioPortalComponent*                                  LargeBoat_AudioPortal_CaptCab_SideDoor;            // 0x7e8(0x8)
};


}