// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1b8 (Full Size[0x7c0] - InheritedSize[0x608]
class BP_AudioBoatLargeHullAmbi_C: public ShipHullAudio
{
public:
	Class TritonComponent*                                       None;                                              // 0x608(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x610(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x618(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x620(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x628(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x630(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x638(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x640(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x648(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x650(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x658(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x660(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x668(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x670(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x678(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x680(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x688(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x690(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x698(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6a0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6a8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6b0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6b8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6c0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6c8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6d0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6d8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6e0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6e8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6f0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6f8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x700(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x708(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x710(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x718(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x720(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x728(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x730(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x738(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x740(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x748(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x750(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x758(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x760(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x768(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x770(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x778(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x780(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x788(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x790(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x798(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x7a0(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x7a8(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x7b0(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x7b8(0x8)
};


}