// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x98 (Full Size[0x6d0] - InheritedSize[0x638]
class BP_AISmallShip_StandardHull_Damage_C: public None
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x638(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x640(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x648(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x650(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x658(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x660(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x668(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x670(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x678(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x680(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x688(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x690(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x698(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6a0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6a8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6b0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6b8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6c8(0x8)
};


}