// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class BP_AggressiveGhostShip_Portal_C: public AggressiveGhostShipPortal
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x410(0x8)
	Class ParticleSystemComponent*                               Portal VFX;                                        // 0x418(0x8)
	Class WwiseEmitterComponent*                                 WwiseEmitter;                                      // 0x420(0x8)
	Class StaticMeshComponent*                                   Portal;                                            // 0x428(0x8)
	Class StaticMeshComponent*                                   shroud;                                            // 0x430(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x438(0x8)
	TArray<class DynamicMaterials*>                              DynamicMaterials;                                  // 0x440(0x10)
};


// Size 0x8
class BP_AggressiveGhostShipPoolResource_C: public AggressiveGhostShipPoolResource
{
public:
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x448(0x8)
};


}