// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc8
class BP_AudioBoatSmallHullAmbi_C: public ShipHullAudio
{
public:
	Class TritonComponent*                                       Triton;                                            // 0x568(0x8)
	Class ShipAudioEmitterComponent*                             audio_wake_stern;                                  // 0x570(0x8)
	Class ShipAudioEmitterComponent*                             audio_wake_bow;                                    // 0x578(0x8)
	Class ShipAudioEmitterComponent*                             audio_wake_side_L;                                 // 0x580(0x8)
	Class ShipAudioEmitterComponent*                             audio_wake_side_R;                                 // 0x588(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_nest;                                  // 0x590(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_mast;                                  // 0x598(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_FL;                                    // 0x5a0(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_FR;                                    // 0x5a8(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_rope_front;                            // 0x5b0(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_brig_03;                               // 0x5b8(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_brig_02;                               // 0x5c0(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_rope_back;                             // 0x5c8(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_brig_01;                               // 0x5d0(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_cabin_04;                              // 0x5d8(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_cabin_03;                              // 0x5e0(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_cabin_02;                              // 0x5e8(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_cabin_01;                              // 0x5f0(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_smallship_global;                      // 0x5f8(0x8)
	Class AudioPortalComponent*                                  DeckGrille;                                        // 0x600(0x8)
	Class AudioPortalComponent*                                  BrigDeck;                                          // 0x608(0x8)
	Class AudioPortalComponent*                                  CaptainsCabin_Left;                                // 0x610(0x8)
	Class AudioPortalComponent*                                  CaptainsCabin_Right;                               // 0x618(0x8)
	Class AudioPortalComponent*                                  CaptainsCabin_Back;                                // 0x620(0x8)
	Class AudioPortalComponent*                                  TopToCaptainsCabin;                                // 0x628(0x8)
};


}