// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x58 (Full Size[0x678] - InheritedSize[0x620]
class BP_AggressiveGhostShip_Mine_C: public AggressiveGhostShipMine
{
public:
	Class TetherCustomisationComponent*                          TetherCustomisation;                               // 0x620(0x8)
	Class ParticleSystemComponent*                               vfx_barrel_warning_Looping_GHOST_SHIPS;            // 0x628(0x8)
	Class BoxComponent*                                          AttackVolume;                                      // 0x630(0x8)
	Class StaticMeshComponent*                                   GhostShroud;                                       // 0x638(0x8)
	Class RewindComponent*                                       Rewind;                                            // 0x640(0x8)
	Class ExplosiveTriggerRammableComponent*                     ExplosiveTriggerRammable;                          // 0x648(0x8)
	Class FuseComponent*                                         Fuse;                                              // 0x650(0x8)
	Class ExplosiveComponent*                                    Explosive;                                         // 0x658(0x8)
	Class ActorDamageableComponent*                              ActorDamageable;                                   // 0x660(0x8)
	Class HealthComponent*                                       Health;                                            // 0x668(0x8)
	Class ExplosionComponent*                                    Explosion;                                         // 0x670(0x8)
};


}