// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xe0 (Full Size[0x718] - InheritedSize[0x638]
class BP_AudioBoatMediumHullAmbi_C: public ShipHullAudio
{
public:
	Class TritonComponent*                                       None;                                              // 0x638(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x640(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x648(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x650(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x658(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x660(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x668(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x670(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x678(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x680(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x688(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x690(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x698(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6a0(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x6a8(0x8)
	char                                                         pad0x68_P11R6[0x68];                               // 0x6b0(0x68)
};


}