// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x408] - InheritedSize[0x3c8]
class BP_audio_prem_shop_goldensands_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3c8(0x8)
	Class TritonComponent*                                       Triton;                                            // 0x3d0(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Middle;                                // 0x3d8(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Right;                                 // 0x3e0(0x8)
	Class AudioSpaceComponent*                                   AudioSpace_Right;                                  // 0x3e8(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Left;                                  // 0x3f0(0x8)
	Class AudioSpaceComponent*                                   AudioSpace_Left;                                   // 0x3f8(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x400(0x8)
};


}