// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size -0x1 (Full Size[-0x1] - InheritedSize[0x0]
class BP_AllIslands_Adv12_WashedUpCoinsSpawner_C: public MechanismTriggerComponent
{
public:
	char                                                         pad0x428_0G219[0x428];                             // 0x0(0x428)
	Class MechanismTriggerComponent*                             MechanismTriggerComponent;                         // 0x428(0x8)
	bool                                                         ShowSwitchInteractionPrompt;                       // 0x430(0x1)
	char                                                         pad0x7_N3SJ3[0x7];                                 // 0x431(0x7)
	Struct FText                                                 SwitchInteractionPromptText;                       // 0x438(0x38)
	Struct FText                                                 SwitchNameText;                                    // 0x470(0x38)
	TArray<class SwitchMechanismTrigger*>                        SwitchesToSyncTo;                                  // 0x4a8(0x10)
	bool                                                         DisableWhenActivated;                              // 0x4b8(0x1)
	bool                                                         AutoDeactivateAfterActivation;                     // 0x4b9(0x1)
	char                                                         pad0x2_B6UKX[0x2];                                 // 0x4ba(0x2)
	float                                                        TimeAfterActivationBeforeAutoDeactivating;         // 0x4bc(0x4)
	bool                                                         SelectRandomStartPositionOnSpawn;                  // 0x4c0(0x1)
	byte                                                         RandomStartPositionSelectionMode;                  // 0x4c1(0x1)
	char                                                         pad0x2_1U8G0[0x2];                                 // 0x4c2(0x2)
	int                                                          FixedStartPositionIndex;                           // 0x4c4(0x4)
	Class CurveFloat*                                            PositionTransitionCurve;                           // 0x4c8(0x8)
	TArray<struct Positions>                                     Positions;                                         // 0x4d0(0x10)
	Class WwiseObjectPoolWrapper*                                AudioEmitterPool;                                  // 0x4e0(0x8)
	class                                                        MaterialGroup;                                     // 0x4e8(0x8)
	int                                                          CurrentPositionIndex;                              // 0x4f0(0x4)
};


}