// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xe0 (Full Size[0x6e8] - InheritedSize[0x608]
class BP_AudioBoatMediumHullAmbi_C: public ShipHullAudio
{
public:
	Class TritonComponent*                                       Triton;                                            // 0x608(0x8)
	Class ShipAudioEmitterComponent*                             audio_water_laps_FL;                               // 0x610(0x8)
	Class ShipAudioEmitterComponent*                             audio_water_laps_FR;                               // 0x618(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_metal2;                                // 0x620(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_metal;                                 // 0x628(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_window;                                // 0x630(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_cabin_04;                              // 0x638(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_cabin_03;                              // 0x640(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_cabin_02;                              // 0x648(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_cabin_01;                              // 0x650(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_map_01;                                // 0x658(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_map_continuous;                        // 0x660(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_map_02;                                // 0x668(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_deck_back;                             // 0x670(0x8)
	Class AudioPortalComponent*                                  DeckGrille;                                        // 0x678(0x8)
	Class AudioPortalComponent*                                  DeckGrille2;                                       // 0x680(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_mast_rear;                             // 0x688(0x8)
	Class ShipAudioEmitterComponent*                             audio_wake_stern;                                  // 0x690(0x8)
	Class ShipAudioEmitterComponent*                             audio_wake_bow;                                    // 0x698(0x8)
	Class ShipAudioEmitterComponent*                             audio_wake_side_L;                                 // 0x6a0(0x8)
	Class ShipAudioEmitterComponent*                             audio_wake_side_R;                                 // 0x6a8(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_mast_front_nest;                       // 0x6b0(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_mast_front;                            // 0x6b8(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_FL;                                    // 0x6c0(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_FR;                                    // 0x6c8(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_rope_front;                            // 0x6d0(0x8)
	Class ShipAudioEmitterComponent*                             audio_creak_smallship_global;                      // 0x6d8(0x8)
	Class AudioPortalComponent*                                  Deckgrille3;                                       // 0x6e0(0x8)
};


}