// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class BP_AggressiveGhostShip_Portal_C: public AggressiveGhostShipPortal
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x418(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x420(0x8)
	Class WwiseEmitterComponent*                                 None;                                              // 0x428(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x430(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x438(0x8)
	Class SceneComponent*                                        None;                                              // 0x440(0x8)
	TArray<class None*>                                          None;                                              // 0x448(0x10)
};


// Size 0x8
class BP_AggressiveGhostShipPoolResource_C: public AggressiveGhostShipPoolResource
{
public:
	Class SceneComponent*                                        None;                                              // 0x450(0x8)
};


}