#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x70 (Full Size[0x4a0] - InheritedSize[0x430]
class BP_bsp_totd_portal_effects_C: public BP_TotD_PortalController_C
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x430(0x8)
	class PointLightComponent*                                   PointLight;                                        // 0x438(0x8)
	class ParticleSystemComponent*                               vfx_PortalAmbience_02;                             // 0x440(0x8)
	class ParticleSystemComponent*                               vfx_PortalAmbience_01;                             // 0x448(0x8)
	class StaticMeshComponent*                                   vfx_cloud;                                         // 0x450(0x8)
	class StaticMeshComponent*                                   Portal;                                            // 0x458(0x8)
	class StaticMeshComponent*                                   vfx_cloud_depth;                                   // 0x460(0x8)
	class StaticMeshComponent*                                   vfx_big_cloud;                                     // 0x468(0x8)
	class StaticMeshComponent*                                   roundedcube_invertednormals;                       // 0x470(0x8)
	class DecalComponent*                                        crack_decal2;                                      // 0x478(0x8)
	class DecalComponent*                                        crack_decal;                                       // 0x480(0x8)
	class StaticMeshComponent*                                   volume_glow;                                       // 0x488(0x8)
	class PointLightComponent*                                   LightComponent0;                                   // 0x490(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x498(0x8)
};


