// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60 (Full Size[0x838] - InheritedSize[0x7d8]
class BP_Beacon_C: public Beacon
{
public:
	Class PointLightComponent*                                   None;                                              // 0x7d8(0x8)
	Class PointLightComponent*                                   None;                                              // 0x7e0(0x8)
	Class PointLightComponent*                                   None;                                              // 0x7e8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x7f0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x7f8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x800(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x808(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x810(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x818(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x820(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x828(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x830(0x8)
};


}