// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60 (Full Size[0x858] - InheritedSize[0x7f8]
class BP_Beacon_C: public Beacon
{
public:
	Class PointLightComponent*                                   None;                                              // 0x7f8(0x8)
	Class PointLightComponent*                                   None;                                              // 0x800(0x8)
	Class PointLightComponent*                                   None;                                              // 0x808(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x810(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x818(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x820(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x828(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x830(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x838(0x8)
	char                                                         pad0x18_505BS[0x18];                               // 0x840(0x18)
};


}