// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x100 (Full Size[0x548] - InheritedSize[0x448]
class BP_Crest_C: public Crest
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x448(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x450(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x458(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   None;                                              // 0x460(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   None;                                              // 0x468(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   None;                                              // 0x470(0x8)
	Class Material*                                              None;                                              // 0x478(0x8)
	Class Material*                                              None;                                              // 0x480(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x488(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x490(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x498(0x8)
	int                                                          None;                                              // 0x4a0(0x4)
	int                                                          None;                                              // 0x4a4(0x4)
	Class Font*                                                  None;                                              // 0x4a8(0x8)
	Class WwiseObjectPoolWrapper*                                None;                                              // 0x4b0(0x8)
	Struct WwiseEmitterCreationParams                            None;                                              // 0x4b8(0x28)
	float                                                        None;                                              // 0x4e0(0x4)
	char                                                         pad0x4_0AY6C[0x4];                                 // 0x4e4(0x4)
	Struct SlateFontInfo                                         None;                                              // 0x4e8(0x40)
	TArray<class ParticleSystem*>                                None;                                              // 0x528(0x10)
	int                                                          None;                                              // 0x538(0x4)
	Struct FeatureFlag                                           None;                                              // 0x53c(0xc)
};


}