#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x2cc (Full Size[0x3ac] - InheritedSize[0xe0]
class BP_CharacterVFXComponent_C: public CharacterVfxComponent
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0xe0(0x8)
	char                                                         pad0x10c_8Y0P4[0x10c];                             // 0xe8(0x10c)
	struct ObjectMessagingHandle                                 EnterWaterEvent;                                   // 0xe8(0x58)
	struct ObjectMessagingHandle                                 UnderwaterStateChanged;                            // 0x140(0x58)
	class ParticleSystemComponent*                               Splash Emitter;                                    // 0x198(0x8)
	class ParticleSystem*                                        Large Foot Splash;                                 // 0x1a0(0x8)
	class ParticleSystem*                                        Small Foot Splash;                                 // 0x1a8(0x8)
	float                                                        Threshold for run;                                 // 0x1b0(0x4)
	float                                                        Threshold for large foot impact;                   // 0x1b4(0x4)
	struct ObjectMessagingHandle                                 FallingIntoWaterHandle;                            // 0x1b8(0x58)
	class ParticleSystem*                                        Large Falling Splash;                              // 0x210(0x8)
	struct ObjectMessagingHandle                                 PlayerViewUnderWaterHandle;                        // 0x218(0x58)
	struct ObjectMessagingHandle                                 EnterShipEventHandle;                              // 0x270(0x58)
	struct ObjectMessagingHandle                                 ExitShipEventHandle;                               // 0x2c8(0x58)
	struct Vector                                                WindOffsetFromShip;                                // 0x320(0xc)
	bool                                                         DEBUG_WindActive;                                  // 0x32c(0x1)
	char                                                         pad0x3_VHCO9[0x3];                                 // 0x32d(0x3)
	float                                                        DEBUG_WindToggleTimer;                             // 0x330(0x4)
	char                                                         pad0x4_689X0[0x4];                                 // 0x334(0x4)
	struct ObjectMessagingHandle                                 WindDirectionChangedHandle;                        // 0x338(0x58)
	class ParticleSystemComponent*                               vfx_particle_underwater_ambient;                   // 0x390(0x8)
	class ParticleSystemComponent*                               vfx_player_underwater_ambient;                     // 0x398(0x8)
	struct FeatureFlag                                           FeatureName;                                       // 0x3a0(0xc)
};


