#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x68 (Full Size[0x8a8] - InheritedSize[0x840]
class BP_CollectorsChest_Wieldable_C: public CollectorsChestStaticWieldableItem
{
public:
	class MaterialManipulationComponent*                         MaterialManipulation;                              // 0x840(0x8)
	class OpenableItemMaterialAnimationReactionComponent*        OpenableItemMaterialAnimationReaction;             // 0x848(0x8)
	class MaterialAnimatorComponent*                             MaterialAnimator;                                  // 0x850(0x8)
	class BoxComponent*                                          HitVolume;                                         // 0x858(0x8)
	class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x860(0x8)
	class GoldInContainerComponent*                              GoldInContainer;                                   // 0x868(0x8)
	class QuestBookPagesInContainerComponent*                    QuestBookPagesInContainer;                         // 0x870(0x8)
	class CollectorsChestItemSlotInteractable*                   ItemSlotInteractable;                              // 0x878(0x8)
	class CollectorsChestItemSlotInteractable*                   ItemSlotInteractable;                              // 0x880(0x8)
	class CollectorsChestItemSlotInteractable*                   ItemSlotInteractable;                              // 0x888(0x8)
	class PickupableComponent*                                   Pickupable;                                        // 0x890(0x8)
	class UsableWieldableComponent*                              UsableWieldable;                                   // 0x898(0x8)
	class WieldableInteractableComponent*                        WieldableInteractable;                             // 0x8a0(0x8)
};


