// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xf4
class BP_Crest_C: public Crest
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x460(0x8)
	Class ParticleSystemComponent*                               VFX_Back;                                          // 0x468(0x8)
	Class ParticleSystemComponent*                               VFX_Front;                                         // 0x470(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   TextCanvasRenderTarget;                            // 0x478(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   BlurCanvasRenderTarget;                            // 0x480(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   BevelCanvasRenderTarget;                           // 0x488(0x8)
	Class Material*                                              BlurCanvasMaterial;                                // 0x490(0x8)
	Class Material*                                              BevelCanvasMaterial;                               // 0x498(0x8)
	Class MaterialInstanceDynamic*                               DynamicBlurCanvasMaterial;                         // 0x4a0(0x8)
	Class MaterialInstanceDynamic*                               DynamicBevelCanvasMaterial;                        // 0x4a8(0x8)
	Class MaterialInstanceDynamic*                               CrestDynamicMaterial;                              // 0x4b0(0x8)
	int                                                          CanvasWidth;                                       // 0x4b8(0x4)
	int                                                          CanvasHeight;                                      // 0x4bc(0x4)
	Class Font*                                                  Font;                                              // 0x4c0(0x8)
	Class WwiseObjectPoolWrapper*                                NameplatePool;                                     // 0x4c8(0x8)
	Struct WwiseEmitterCreationParams                            EmitterCreationParams;                             // 0x4d0(0x28)
	float                                                        Cooldown;                                          // 0x4f8(0x4)
	Struct SlateFontInfo                                         FontInfo;                                          // 0x500(0x40)
	TArray<class VFXSizeVariants*>                               VFXSizeVariants;                                   // 0x540(0x10)
	int                                                          NameSizeIndex;                                     // 0x550(0x4)
};


}