// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60 (Full Size[0x6c8] - InheritedSize[0x668]
class BP_CaptainsBookcase_01_C: public CaptainsBookcase
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x668(0x8)
	Class StaticMeshComponent*                                   OrderOfSouls_ScrollStack;                          // 0x670(0x8)
	Class StaticMeshComponent*                                   MerchantsAliance_ScrollStack;                      // 0x678(0x8)
	Class StaticMeshComponent*                                   Mercenary_ScrollStack;                             // 0x680(0x8)
	Class StaticMeshComponent*                                   Legendary_ScrollStack;                             // 0x688(0x8)
	Class StaticMeshComponent*                                   GoldHoarder_ScrollStack;                           // 0x690(0x8)
	Class StaticMeshComponent*                                   MergedBookcaseAndDressing;                         // 0x698(0x8)
	class                                                        Company_GH;                                        // 0x6a0(0x8)
	class                                                        Company_MA;                                        // 0x6a8(0x8)
	class                                                        Company_OoS;                                       // 0x6b0(0x8)
	class                                                        Company_Leg;                                       // 0x6b8(0x8)
	class                                                        Company_Merc;                                      // 0x6c0(0x8)
};


}