// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20
class BP_Cabin_Right_LowCabinetDoor_01_C: public ToggleAnimatedMechanismAction
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x570(0x8)
	Class MechanismVFXEmitterComponent*                          VFX_Right_LowCabinetDoor_Dust01;                   // 0x578(0x8)
	Class ChildActorComponent*                                   Trigger;                                           // 0x580(0x8)
	Class StaticMeshComponent*                                   DoorMesh;                                          // 0x588(0x8)
};


// Size 0x20
class BP_Cabin_Left_LowCabinetDoor_01_C: public ToggleAnimatedMechanismAction
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x570(0x8)
	Class MechanismVFXEmitterComponent*                          VFX_Left_LowCabinetDoor_Dust01;                    // 0x578(0x8)
	Class ChildActorComponent*                                   Trigger;                                           // 0x580(0x8)
	Class StaticMeshComponent*                                   DoorMesh;                                          // 0x588(0x8)
};


}