// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60 (Full Size[0x708] - InheritedSize[0x6a8]
class BP_CaptainsBookcase_01_C: public CaptainsBookcase
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x6a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6d8(0x8)
	class                                                        None;                                              // 0x6e0(0x8)
	class                                                        None;                                              // 0x6e8(0x8)
	class                                                        None;                                              // 0x6f0(0x8)
	class                                                        None;                                              // 0x6f8(0x8)
	class                                                        None;                                              // 0x700(0x8)
};


}