// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x420 (Full Size[0x7e8] - InheritedSize[0x3c8]
class BP_CastawayCamp_01_C: public Actor
{
public:
	Class BoxComponent*                                          None;                                              // 0x3c8(0x8)
	Class WorldLocationPopUpComponent*                           None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class DecalComponent*                                        None;                                              // 0x3e8(0x8)
	Class BoxComponent*                                          None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class SpotLightComponent*                                    None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class BoxComponent*                                          None;                                              // 0x410(0x8)
	Class SkeletalMeshComponent*                                 None;                                              // 0x418(0x8)
	Class SkeletalMeshComponent*                                 None;                                              // 0x420(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x430(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x438(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x440(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x448(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x450(0x8)
	Class BeachNPCSpawnFlowLocationComponent*                    None;                                              // 0x458(0x8)
	Class BeachNPCSpawnFlowLocationComponent*                    None;                                              // 0x460(0x8)
	Class BeachNPCSpawnFlowLocationComponent*                    None;                                              // 0x468(0x8)
	Class BeachNPCSpawnFlowLocationComponent*                    None;                                              // 0x470(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x478(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x480(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x488(0x8)
	Class PointLightComponent*                                   None;                                              // 0x490(0x8)
	Class PointLightComponent*                                   None;                                              // 0x498(0x8)
	Class PointLightComponent*                                   None;                                              // 0x4a0(0x8)
	Class PointLightComponent*                                   None;                                              // 0x4a8(0x8)
	Class PointLightComponent*                                   None;                                              // 0x4b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4e0(0x8)
	Class DecalComponent*                                        None;                                              // 0x4e8(0x8)
	Class DecalComponent*                                        None;                                              // 0x4f0(0x8)
	Class DecalComponent*                                        None;                                              // 0x4f8(0x8)
	Class DecalComponent*                                        None;                                              // 0x500(0x8)
	Class DecalComponent*                                        None;                                              // 0x508(0x8)
	Class DecalComponent*                                        None;                                              // 0x510(0x8)
	Class DecalComponent*                                        None;                                              // 0x518(0x8)
	Class DecalComponent*                                        None;                                              // 0x520(0x8)
	Class DecalComponent*                                        None;                                              // 0x528(0x8)
	Class DecalComponent*                                        None;                                              // 0x530(0x8)
	Class DecalComponent*                                        None;                                              // 0x538(0x8)
	Class DecalComponent*                                        None;                                              // 0x540(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x548(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x550(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x558(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x560(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x568(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x570(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x578(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x580(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x588(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x590(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x598(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x5a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x600(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x608(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x610(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x618(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x620(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x628(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x630(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x638(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x640(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x648(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x650(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x658(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x660(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x668(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x670(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x678(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x680(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x688(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x690(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x698(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6a0(0x8)
	Class PointLightComponent*                                   None;                                              // 0x6a8(0x8)
	Class PointLightComponent*                                   None;                                              // 0x6b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x700(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x708(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x710(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x718(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x720(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x728(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x730(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x738(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x740(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x748(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x750(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x758(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x760(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x768(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x770(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x778(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x780(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x788(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x790(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x798(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7d8(0x8)
	Class SceneComponent*                                        None;                                              // 0x7e0(0x8)
};


}