// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x230 (Full Size[0x5f8] - InheritedSize[0x3c8]
class BP_cls_shop_wsp_01_a_C: public Actor
{
public:
	class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3c8(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_mannequin_01_a1;                      // 0x3d0(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_mannequin_01_a;                       // 0x3d8(0x8)
	class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x3e0(0x8)
	class StaticMeshComponent*                                   wsp_cls_shop_dressing_01_b;                        // 0x3e8(0x8)
	class StaticMeshComponent*                                   wsp_cls_shop_dressing_01_a;                        // 0x3f0(0x8)
	class BoxComponent*                                          Collision_01;                                      // 0x3f8(0x8)
	class ParticleSystemComponent*                               vfx_dust_01_air;                                   // 0x400(0x8)
	class SpotLightComponent*                                    SpotLight7;                                        // 0x408(0x8)
	class ChildActorComponent*                                   BP_IslandVanityChest;                              // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMesh24;                                      // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x420(0x8)
	class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x428(0x8)
	class ChildActorComponent*                                   ChildActor2;                                       // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMesh23;                                      // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMesh7;                                       // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMesh6;                                       // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMesh5;                                       // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMesh4;                                       // 0x458(0x8)
	class PointLightComponent*                                   PointLight2;                                       // 0x460(0x8)
	class ChildActorComponent*                                   wsp_light_plate_a;                                 // 0x468(0x8)
	class ChildActorComponent*                                   ChildActor1;                                       // 0x470(0x8)
	class ChildActorComponent*                                   ChildActor;                                        // 0x478(0x8)
	class ChildActorComponent*                                   wsp_bottle_burner;                                 // 0x480(0x8)
	class ChildActorComponent*                                   wsp_light_large_pot;                               // 0x488(0x8)
	class PostProcessComponent*                                  PostProcess;                                       // 0x490(0x8)
	class BoxComponent*                                          Box;                                               // 0x498(0x8)
	class SpotLightComponent*                                    SpotLight6;                                        // 0x4a0(0x8)
	class SpotLightComponent*                                    SpotLight5;                                        // 0x4a8(0x8)
	class SpotLightComponent*                                    SpotLight4;                                        // 0x4b0(0x8)
	class SpotLightComponent*                                    SpotLight3;                                        // 0x4b8(0x8)
	class SpotLightComponent*                                    SpotLight2;                                        // 0x4c0(0x8)
	class SpotLightComponent*                                    SpotLight1;                                        // 0x4c8(0x8)
	class SpotLightComponent*                                    SpotLight;                                         // 0x4d0(0x8)
	class ChildActorComponent*                                   AudioSpace;                                        // 0x4d8(0x8)
	class StaticMeshComponent*                                   wsp_vine_01_b;                                     // 0x4e0(0x8)
	class StaticMeshComponent*                                   wsp_bush_fern_01_a;                                // 0x4e8(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_04_a;                              // 0x4f0(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_02_a;                              // 0x4f8(0x8)
	class StaticMeshComponent*                                   cmn_barrel_debris_03_a;                            // 0x500(0x8)
	class StaticMeshComponent*                                   cmn_barrel_debris_01_a;                            // 0x508(0x8)
	class StaticMeshComponent*                                   cmn_bucket_01_a;                                   // 0x510(0x8)
	class StaticMeshComponent*                                   StaticMesh14;                                      // 0x518(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_hanging_cloth_02_a;                   // 0x520(0x8)
	class StaticMeshComponent*                                   cmn_step_ladder_01_a;                              // 0x528(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_dye_pot_lid_01_b;                      // 0x530(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_dye_pot_lid_01_a;                      // 0x538(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_dye_pot_01_a;                          // 0x540(0x8)
	class StaticMeshComponent*                                   bld_enc_shop_rug_01_a;                             // 0x548(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_dye_pot_01_b;                          // 0x550(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_hanging_rope_01_a;                    // 0x558(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_bird_cage_01_a;                       // 0x560(0x8)
	class StaticMeshComponent*                                   bld_int_large_shelf_03_a;                          // 0x568(0x8)
	class StaticMeshComponent*                                   bld_tvn_animal_rug_01_a;                           // 0x570(0x8)
	class StaticMeshComponent*                                   wsp_vine_01_c;                                     // 0x578(0x8)
	class StaticMeshComponent*                                   wsp_vine_01_d;                                     // 0x580(0x8)
	class StaticMeshComponent*                                   cmn_bookcase_01_a;                                 // 0x588(0x8)
	class StaticMeshComponent*                                   bld_shop_table_01_a;                               // 0x590(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_sign_01_a;                             // 0x598(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_stairs_01_a;                           // 0x5a0(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_door_01_a;                            // 0x5a8(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_window_01_a2;                         // 0x5b0(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_window_01_a1;                         // 0x5b8(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_window_01_a;                          // 0x5c0(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_clothes_lines_01_a;                    // 0x5c8(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_hanging_cloth_01_a;                    // 0x5d0(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_side_roof_01_a;                        // 0x5d8(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_main_roof_01_a;                        // 0x5e0(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_01_a;                                 // 0x5e8(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x5f0(0x8)
};


}