// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x408] - InheritedSize[0x3c8]
class BP_CastawayCamp_AudioLayer_C: public Actor
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3c8(0x8)
	class WwiseEmitterComponent*                                 Flapping;                                          // 0x3d0(0x8)
	class WwiseEmitterComponent*                                 Campfire;                                          // 0x3d8(0x8)
	class WwiseEmitterComponent*                                 CastawayCamp_Audio;                                // 0x3e0(0x8)
	class WwiseEvent*                                            Campfire_Play;                                     // 0x3e8(0x8)
	class WwiseEvent*                                            Campfire_Stop;                                     // 0x3f0(0x8)
	class WwiseEvent*                                            Flapping_Play;                                     // 0x3f8(0x8)
	class WwiseEvent*                                            Flapping_Stop;                                     // 0x400(0x8)
};


}