// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60 (Full Size[0x6c8] - InheritedSize[0x668]
class BP_CaptainsBookcase_01_C: public CaptainsBookcase
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x668(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x670(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x678(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x680(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x688(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x690(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x698(0x8)
	class                                                        None;                                              // 0x6a0(0x8)
	class                                                        None;                                              // 0x6a8(0x8)
	class                                                        None;                                              // 0x6b0(0x8)
	class                                                        None;                                              // 0x6b8(0x8)
	class                                                        None;                                              // 0x6c0(0x8)
};


}