// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0 (Full Size[0x178] - InheritedSize[0xd8]
class BP_Component_Tutorial2019_C: public Tutorial2019ContextualDelegatingComponent
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0xd8(0x8)
	char                                                         pad0x172_LM89Y[0x172];                             // 0xe0(0x172)
	TArray<Assetclass GoldHoarders>                              GoldHoarders;                                      // 0xe0(0x10)
	TArray<struct GoldHoarderLocations>                          GoldHoarderLocations;                              // 0xf0(0x10)
	BlueprintGeneratedClass BP_Prompt_CTPurchaseVoyageSequence_C* GoToVendorPromptObject;                            // 0x100(0x8)
	TArray<Assetclass NPCBlacklist>                              NPCBlacklist;                                      // 0x108(0x10)
	TArray<struct FName>                                         OutpostNames;                                      // 0x118(0x10)
	bool                                                         GoldHoarderOnRepPrerequiste;                       // 0x128(0x1)
	char                                                         pad0x7_6UJU1[0x7];                                 // 0x129(0x7)
	Struct ObjectMessagingHandle                                 Handle_PlayerFinishedSpawning;                     // 0x130(0x48)
};


}