// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1db (Full Size[0x5a3] - InheritedSize[0x3c8]
class BP_CliffGenerator_C: public Actor
{
public:
	Class SplineComponent*                                       None;                                              // 0x3c8(0x8)
	Class SceneComponent*                                        None;                                              // 0x3d0(0x8)
	bool                                                         None;                                              // 0x3d8(0x1)
	char                                                         pad0x7_4AARO[0x7];                                 // 0x3d9(0x7)
	Class StaticMesh*                                            None;                                              // 0x3e0(0x8)
	bool                                                         None;                                              // 0x3e8(0x1)
	char                                                         pad0x7_1AAZV[0x7];                                 // 0x3e9(0x7)
	Class StaticMesh*                                            None;                                              // 0x3f0(0x8)
	TArray<class StaticMesh*>                                    None;                                              // 0x3f8(0x10)
	float                                                        None;                                              // 0x408(0x4)
	bool                                                         None;                                              // 0x40c(0x1)
	char                                                         pad0x3_19WP3[0x3];                                 // 0x40d(0x3)
	int                                                          None;                                              // 0x410(0x4)
	float                                                        None;                                              // 0x414(0x4)
	float                                                        None;                                              // 0x418(0x4)
	int                                                          None;                                              // 0x41c(0x4)
	TArray<struct None>                                          None;                                              // 0x420(0x10)
	bool                                                         None;                                              // 0x430(0x1)
	bool                                                         None;                                              // 0x431(0x1)
	bool                                                         None;                                              // 0x432(0x1)
	char                                                         pad0x1_1FKEF[0x1];                                 // 0x433(0x1)
	Struct RandomStream                                          None;                                              // 0x434(0x8)
	float                                                        None;                                              // 0x43c(0x4)
	int                                                          None;                                              // 0x440(0x4)
	Struct None                                                  None;                                              // 0x444(0x10)
	Struct Vector                                                None;                                              // 0x454(0xc)
	Struct Rotator                                               None;                                              // 0x460(0xc)
	bool                                                         None;                                              // 0x46c(0x1)
	bool                                                         None;                                              // 0x46d(0x1)
	bool                                                         None;                                              // 0x46e(0x1)
	bool                                                         None;                                              // 0x46f(0x1)
	bool                                                         None;                                              // 0x470(0x1)
	bool                                                         None;                                              // 0x471(0x1)
	bool                                                         None;                                              // 0x472(0x1)
	char                                                         pad0x5_DDO6A[0x5];                                 // 0x473(0x5)
	Class SplineComponent*                                       None;                                              // 0x478(0x8)
	float                                                        None;                                              // 0x480(0x4)
	bool                                                         None;                                              // 0x484(0x1)
	bool                                                         None;                                              // 0x485(0x1)
	bool                                                         None;                                              // 0x486(0x1)
	char                                                         pad0x1_AGFH8[0x1];                                 // 0x487(0x1)
	float                                                        None;                                              // 0x488(0x4)
	float                                                        None;                                              // 0x48c(0x4)
	float                                                        None;                                              // 0x490(0x4)
	float                                                        None;                                              // 0x494(0x4)
	bool                                                         None;                                              // 0x498(0x1)
	char                                                         pad0x7_ZQJWM[0x7];                                 // 0x499(0x7)
	Class Landscape*                                             None;                                              // 0x4a0(0x8)
	bool                                                         None;                                              // 0x4a8(0x1)
	char                                                         pad0x3_TVMJM[0x3];                                 // 0x4a9(0x3)
	int                                                          None;                                              // 0x4ac(0x4)
	bool                                                         None;                                              // 0x4b0(0x1)
	char                                                         pad0x7_Z2GCS[0x7];                                 // 0x4b1(0x7)
	Struct FString                                               None;                                              // 0x4b8(0x10)
	TArray<class Actor*>                                         None;                                              // 0x4c8(0x10)
	bool                                                         None;                                              // 0x4d8(0x1)
	char                                                         pad0x3_RR57K[0x3];                                 // 0x4d9(0x3)
	Struct HitResult                                             None;                                              // 0x4dc(0x80)
	char                                                         pad0x4_DWFLY[0x4];                                 // 0x55c(0x4)
	TArray<struct None>                                          None;                                              // 0x560(0x10)
	TArray<class Actor*>                                         None;                                              // 0x570(0x10)
	Struct LinearColor                                           None;                                              // 0x580(0x10)
	Struct LinearColor                                           None;                                              // 0x590(0x10)
	bool                                                         None;                                              // 0x5a0(0x1)
	byte                                                         None;                                              // 0x5a1(0x1)
	bool                                                         None;                                              // 0x5a2(0x1)
};


}