// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x420 (Full Size[0x7e8] - InheritedSize[0x3c8]
class BP_CastawayCamp_01_C: public Actor
{
public:
	Class BoxComponent*                                          RowboatCollision;                                  // 0x3c8(0x8)
	Class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3d0(0x8)
	Class StaticMeshComponent*                                   wsp_cave_rock_small__a;                            // 0x3d8(0x8)
	Class StaticMeshComponent*                                   wsp_cave_rock_large__c;                            // 0x3e0(0x8)
	Class DecalComponent*                                        Decal12;                                           // 0x3e8(0x8)
	Class BoxComponent*                                          NavMesh Blocker;                                   // 0x3f0(0x8)
	Class StaticMeshComponent*                                   mainClothShadowOnly;                               // 0x3f8(0x8)
	Class SpotLightComponent*                                    SpotLight;                                         // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x408(0x8)
	Class BoxComponent*                                          chestCollision;                                    // 0x410(0x8)
	Class SkeletalMeshComponent*                                 shp_chest_com_01_a;                                // 0x418(0x8)
	Class SkeletalMeshComponent*                                 bld_castawaycamp_clothdoor_01_a_skel;              // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x428(0x8)
	Class StaticMeshComponent*                                   gmp_tal_questbook_smp_static_01_a_PLACEHOLDER5;    // 0x430(0x8)
	Class StaticMeshComponent*                                   gmp_tal_questbook_smp_static_01_a_PLACEHOLDER4;    // 0x438(0x8)
	Class StaticMeshComponent*                                   gmp_tal_questbook_smp_static_01_a_PLACEHOLDER3;    // 0x440(0x8)
	Class StaticMeshComponent*                                   gmp_tal_questbook_smp_static_01_a_PLACEHOLDER2;    // 0x448(0x8)
	Class StaticMeshComponent*                                   gmp_tal_questbook_smp_static_01_a_PLACEHOLDER1;    // 0x450(0x8)
	Class BeachNPCSpawnFlowLocationComponent*                    BeachNPCSpawnFlowLocation4;                        // 0x458(0x8)
	Class BeachNPCSpawnFlowLocationComponent*                    BeachNPCSpawnFlowLocation3;                        // 0x460(0x8)
	Class BeachNPCSpawnFlowLocationComponent*                    BeachNPCSpawnFlowLocation2;                        // 0x468(0x8)
	Class BeachNPCSpawnFlowLocationComponent*                    BeachNPCSpawnFlowLocation1;                        // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x478(0x8)
	Class StaticMeshComponent*                                   cmn_looted__box_01_b;                              // 0x480(0x8)
	Class ChildActorComponent*                                   Audio;                                             // 0x488(0x8)
	Class PointLightComponent*                                   PointLight4;                                       // 0x490(0x8)
	Class PointLightComponent*                                   PointLight3;                                       // 0x498(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x4a0(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x4a8(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x4b0(0x8)
	Class StaticMeshComponent*                                   wpn_cutlass_gho_01_a;                              // 0x4b8(0x8)
	Class StaticMeshComponent*                                   skd_pincher_sword_01_a;                            // 0x4c0(0x8)
	Class StaticMeshComponent*                                   gmp_effigy_sunken_pearl_01_a;                      // 0x4c8(0x8)
	Class StaticMeshComponent*                                   gmp_effigy_dark_brethren_01_a;                     // 0x4d0(0x8)
	Class StaticMeshComponent*                                   gmp_effigy_captain_damned_01_a;                    // 0x4d8(0x8)
	Class StaticMeshComponent*                                   gmp_effigy_pirates_life_01_a;                      // 0x4e0(0x8)
	Class DecalComponent*                                        Decal11;                                           // 0x4e8(0x8)
	Class DecalComponent*                                        Decal10;                                           // 0x4f0(0x8)
	Class DecalComponent*                                        Decal9;                                            // 0x4f8(0x8)
	Class DecalComponent*                                        Decal8;                                            // 0x500(0x8)
	Class DecalComponent*                                        Decal7;                                            // 0x508(0x8)
	Class DecalComponent*                                        Decal6;                                            // 0x510(0x8)
	Class DecalComponent*                                        Decal5;                                            // 0x518(0x8)
	Class DecalComponent*                                        Decal4;                                            // 0x520(0x8)
	Class DecalComponent*                                        Decal3;                                            // 0x528(0x8)
	Class DecalComponent*                                        Decal2;                                            // 0x530(0x8)
	Class DecalComponent*                                        Decal1;                                            // 0x538(0x8)
	Class DecalComponent*                                        Decal;                                             // 0x540(0x8)
	Class StaticMeshComponent*                                   shp_wreck_beam_01_b;                               // 0x548(0x8)
	Class StaticMeshComponent*                                   shp_wreck_beam_01_a;                               // 0x550(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x558(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x560(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x568(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x570(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x578(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x580(0x8)
	Class StaticMeshComponent*                                   castawaycamp_hut_01_a;                             // 0x588(0x8)
	Class StaticMeshComponent*                                   gmp_castawayCloth_01_a;                            // 0x590(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0143;                           // 0x598(0x8)
	Class ParticleSystemComponent*                               ParticleSystemComponent02;                         // 0x5a0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0139;                           // 0x5a8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0138;                           // 0x5b0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0137;                           // 0x5b8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0136;                           // 0x5c0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0135;                           // 0x5c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0134;                           // 0x5d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0132;                           // 0x5d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0131;                           // 0x5e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0130;                           // 0x5e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0129;                           // 0x5f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0128;                           // 0x5f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0127;                           // 0x600(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0124;                           // 0x608(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0123;                           // 0x610(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0121;                           // 0x618(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0119;                           // 0x620(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0117;                           // 0x628(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0116;                           // 0x630(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent095;                            // 0x638(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent094;                            // 0x640(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent093;                            // 0x648(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent092;                            // 0x650(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent091;                            // 0x658(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent090;                            // 0x660(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent089;                            // 0x668(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent088;                            // 0x670(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent087;                            // 0x678(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent086;                            // 0x680(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent085;                            // 0x688(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent084;                            // 0x690(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent083;                            // 0x698(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent082;                            // 0x6a0(0x8)
	Class PointLightComponent*                                   LightComponent01;                                  // 0x6a8(0x8)
	Class PointLightComponent*                                   LightComponent0;                                   // 0x6b0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent051;                            // 0x6b8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent050;                            // 0x6c0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent049;                            // 0x6c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent048;                            // 0x6d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent047;                            // 0x6d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent046;                            // 0x6e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent045;                            // 0x6e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent044;                            // 0x6f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent043;                            // 0x6f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent042;                            // 0x700(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent041;                            // 0x708(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent039;                            // 0x710(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent038;                            // 0x718(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent037;                            // 0x720(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent036;                            // 0x728(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent035;                            // 0x730(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent034;                            // 0x738(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent033;                            // 0x740(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent032;                            // 0x748(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent031;                            // 0x750(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent028;                            // 0x758(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent027;                            // 0x760(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent026;                            // 0x768(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent025;                            // 0x770(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent024;                            // 0x778(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent023;                            // 0x780(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0x788(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0x790(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x798(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x7a0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x7a8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x7b0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x7b8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x7c0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x7c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x7d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x7d8(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x7e0(0x8)
};


}