// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xf0 (Full Size[0x4b8] - InheritedSize[0x3c8]
class BP_CoralFortress_WeatherZone_C: public Actor
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3c8(0x8)
	class ExplosionComponent*                                    Explosion;                                         // 0x3d0(0x8)
	class LightningManagerComponent*                             LightningManager;                                  // 0x3d8(0x8)
	class LightningComponent*                                    Lightning;                                         // 0x3e0(0x8)
	class CapsuleComponent*                                      ExclusionTriggerVolume;                            // 0x3e8(0x8)
	class AtmosphericPressureZoneComponent*                      AtmosphericPressureZone;                           // 0x3f0(0x8)
	class BlendedPostProcessingRainZoneComponent*                BlendedPostProcessingRainZone;                     // 0x3f8(0x8)
	class StaticMeshComponent*                                   TopCloudMeshComponent;                             // 0x400(0x8)
	class StaticMeshComponent*                                   RingCloudMeshComponent;                            // 0x408(0x8)
	class StaticMeshComponent*                                   Lightning4;                                        // 0x410(0x8)
	class StaticMeshComponent*                                   Lightning3;                                        // 0x418(0x8)
	class StaticMeshComponent*                                   Lightning2;                                        // 0x420(0x8)
	class StaticMeshComponent*                                   Lightning1;                                        // 0x428(0x8)
	class StaticMeshComponent*                                   OuterRainSheet;                                    // 0x430(0x8)
	class SceneComponent*                                        RainRoot;                                          // 0x438(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x440(0x8)
	float                                                        RainBlend_Blend_1B3587E7420F9A76FB06A6A63DE0B159;  // 0x448(0x4)
	byte                                                         RainBlend__Direction_1B3587E7420F9A76FB06A6A63DE0B159; // 0x44c(0x1)
	char                                                         pad0x3_REFDT[0x3];                                 // 0x44d(0x3)
	class TimelineComponent*                                     RainBlend;                                         // 0x450(0x8)
	TArray<class MaterialInstanceDynamic*>                       RainDynMaterials;                                  // 0x458(0x10)
	float                                                        Opacity;                                           // 0x468(0x4)
	char                                                         pad0x4_LWGUS[0x4];                                 // 0x46c(0x4)
	struct WwiseEmitterCreationParams                            CreationParams;                                    // 0x470(0x28)
	struct WwiseEmitter                                          WwiseEmitter;                                      // 0x498(0x20)
};


}