// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x2cc (Full Size[0x3ac] - InheritedSize[0xe0]
class BP_CharacterVFXComponent_C: public CharacterVfxComponent
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0xe0(0x8)
	char                                                         pad0x145_D8KLP[0x145];                             // 0xe8(0x145)
	Struct ObjectMessagingHandle                                 EnterWaterEvent;                                   // 0xe8(0x58)
	Struct ObjectMessagingHandle                                 UnderwaterStateChanged;                            // 0x140(0x58)
	Class ParticleSystemComponent*                               Splash Emitter;                                    // 0x198(0x8)
	Class ParticleSystem*                                        Large Foot Splash;                                 // 0x1a0(0x8)
	Class ParticleSystem*                                        Small Foot Splash;                                 // 0x1a8(0x8)
	float                                                        Threshold for run;                                 // 0x1b0(0x4)
	float                                                        Threshold for large foot impact;                   // 0x1b4(0x4)
	Struct ObjectMessagingHandle                                 FallingIntoWaterHandle;                            // 0x1b8(0x58)
	Class ParticleSystem*                                        Large Falling Splash;                              // 0x210(0x8)
	Struct ObjectMessagingHandle                                 PlayerViewUnderWaterHandle;                        // 0x218(0x58)
	Struct ObjectMessagingHandle                                 EnterShipEventHandle;                              // 0x270(0x58)
	Struct ObjectMessagingHandle                                 ExitShipEventHandle;                               // 0x2c8(0x58)
	Struct Vector                                                WindOffsetFromShip;                                // 0x320(0xc)
	bool                                                         DEBUG_WindActive;                                  // 0x32c(0x1)
	char                                                         pad0x3_1B2IX[0x3];                                 // 0x32d(0x3)
	float                                                        DEBUG_WindToggleTimer;                             // 0x330(0x4)
	char                                                         pad0x4_07XAN[0x4];                                 // 0x334(0x4)
	Struct ObjectMessagingHandle                                 WindDirectionChangedHandle;                        // 0x338(0x58)
	Class ParticleSystemComponent*                               vfx_particle_underwater_ambient;                   // 0x390(0x8)
	Class ParticleSystemComponent*                               vfx_player_underwater_ambient;                     // 0x398(0x8)
	Struct FeatureFlag                                           FeatureName;                                       // 0x3a0(0xc)
};


}