// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xf0 (Full Size[0x4b8] - InheritedSize[0x3c8]
class BP_CoralFortress_WeatherZone_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3c8(0x8)
	Class ExplosionComponent*                                    None;                                              // 0x3d0(0x8)
	Class LightningManagerComponent*                             None;                                              // 0x3d8(0x8)
	Class LightningComponent*                                    None;                                              // 0x3e0(0x8)
	Class CapsuleComponent*                                      None;                                              // 0x3e8(0x8)
	Class AtmosphericPressureZoneComponent*                      None;                                              // 0x3f0(0x8)
	Class BlendedPostProcessingRainZoneComponent*                None;                                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x420(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x430(0x8)
	Class SceneComponent*                                        None;                                              // 0x438(0x8)
	Class SceneComponent*                                        None;                                              // 0x440(0x8)
	float                                                        None;                                              // 0x448(0x4)
	byte                                                         None;                                              // 0x44c(0x1)
	char                                                         pad0x3_XT5GF[0x3];                                 // 0x44d(0x3)
	Class TimelineComponent*                                     None;                                              // 0x450(0x8)
	TArray<class MaterialInstanceDynamic*>                       None;                                              // 0x458(0x10)
	float                                                        None;                                              // 0x468(0x4)
	char                                                         pad0x4_9HI8I[0x4];                                 // 0x46c(0x4)
	Struct WwiseEmitterCreationParams                            None;                                              // 0x470(0x28)
	Struct WwiseEmitter                                          None;                                              // 0x498(0x20)
};


}