// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x88 (Full Size[0x668] - InheritedSize[0x5e0]
class BP_CustomisableLadder_C: public Ladder
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x5e0(0x8)
	Class InteractableComponent*                                 None;                                              // 0x5e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5f0(0x8)
	Struct None                                                  None;                                              // 0x5f8(0x20)
	TArray<struct None>                                          None;                                              // 0x618(0x10)
	TArray<struct None>                                          None;                                              // 0x628(0x10)
	int                                                          None;                                              // 0x638(0x4)
	char                                                         pad0x4_INN89[0x4];                                 // 0x63c(0x4)
	Class MaterialInterface*                                     None;                                              // 0x640(0x8)
	float                                                        None;                                              // 0x648(0x4)
	Struct Vector                                                None;                                              // 0x64c(0xc)
	Struct Vector                                                None;                                              // 0x658(0xc)
	int                                                          None;                                              // 0x664(0x4)
};


}