#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xd1 (Full Size[0xa59] - InheritedSize[0x988]
class BP_CollectorsChest_Proxy_C: public CollectorsChestItemProxyStatic
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x988(0x8)
	class StaticMeshComponent*                                   WaterOcclusionVolume;                              // 0x990(0x8)
	class MaterialAnimatorComponent*                             MaterialAnimator;                                  // 0x998(0x8)
	class OpenableItemMeshAnimationReactionComponent*            OpenableItemMeshAnimationReaction;                 // 0x9a0(0x8)
	class MeshAnimatorComponent*                                 MeshAnimator;                                      // 0x9a8(0x8)
	class OpenableItemMaterialAnimationReactionComponent*        OpenableItemMaterialAnimationReaction;             // 0x9b0(0x8)
	class GlintComponent*                                        Glint;                                             // 0x9b8(0x8)
	class QuestBookPagesInContainerComponent*                    QuestBookPagesInContainer;                         // 0x9c0(0x8)
	class GoldInContainerComponent*                              GoldInContainer;                                   // 0x9c8(0x8)
	class SceneComponent*                                        Scene;                                             // 0x9d0(0x8)
	class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x9d8(0x8)
	class CollectorsChestItemSlotInteractable*                   ItemSlotInteractable;                              // 0x9e0(0x8)
	class CollectorsChestItemSlotInteractable*                   ItemSlotInteractable;                              // 0x9e8(0x8)
	class CollectorsChestItemSlotInteractable*                   ItemSlotInteractable;                              // 0x9f0(0x8)
	class InteractableComponent*                                 Interactable;                                      // 0x9f8(0x8)
	struct ObjectMessagingHandle                                 OnDroppedHandle;                                   // 0xa00(0x58)
	bool                                                         HideWaterOcclusionVolume;                          // 0xa58(0x1)
};


