// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x88 (Full Size[0x648] - InheritedSize[0x5c0]
class BP_CustomisableSovereignLadder_C: public Ladder
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x5c0(0x8)
	Class InteractableComponent*                                 None;                                              // 0x5c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5d0(0x8)
	Struct None                                                  None;                                              // 0x5d8(0x20)
	TArray<struct None>                                          None;                                              // 0x5f8(0x10)
	TArray<struct None>                                          None;                                              // 0x608(0x10)
	int                                                          None;                                              // 0x618(0x4)
	char                                                         pad0x4_5UYO0[0x4];                                 // 0x61c(0x4)
	Class MaterialInterface*                                     None;                                              // 0x620(0x8)
	float                                                        None;                                              // 0x628(0x4)
	Struct Vector                                                None;                                              // 0x62c(0xc)
	Struct Vector                                                None;                                              // 0x638(0xc)
	int                                                          None;                                              // 0x644(0x4)
};


}