// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x100 (Full Size[0x5d8] - InheritedSize[0x4d8]
class BP_Crest_C: public Crest
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x4d8(0x8)
	class ParticleSystemComponent*                               VFX_Back;                                          // 0x4e0(0x8)
	class ParticleSystemComponent*                               VFX_Front;                                         // 0x4e8(0x8)
	class MaybeCompressedCanvasRenderTarget2D*                   TextCanvasRenderTarget;                            // 0x4f0(0x8)
	class MaybeCompressedCanvasRenderTarget2D*                   BlurCanvasRenderTarget;                            // 0x4f8(0x8)
	class MaybeCompressedCanvasRenderTarget2D*                   BevelCanvasRenderTarget;                           // 0x500(0x8)
	class Material*                                              BlurCanvasMaterial;                                // 0x508(0x8)
	class Material*                                              BevelCanvasMaterial;                               // 0x510(0x8)
	class MaterialInstanceDynamic*                               DynamicBlurCanvasMaterial;                         // 0x518(0x8)
	class MaterialInstanceDynamic*                               DynamicBevelCanvasMaterial;                        // 0x520(0x8)
	class MaterialInstanceDynamic*                               CrestDynamicMaterial;                              // 0x528(0x8)
	int                                                          CanvasWidth;                                       // 0x530(0x4)
	int                                                          CanvasHeight;                                      // 0x534(0x4)
	class Font*                                                  Font;                                              // 0x538(0x8)
	class WwiseObjectPoolWrapper*                                NameplatePool;                                     // 0x540(0x8)
	struct WwiseEmitterCreationParams                            EmitterCreationParams;                             // 0x548(0x28)
	float                                                        Cooldown;                                          // 0x570(0x4)
	char                                                         pad0x4_BHRG0[0x4];                                 // 0x574(0x4)
	struct SlateFontInfo                                         FontInfo;                                          // 0x578(0x40)
	TArray<class ParticleSystem*>                                VFXSizeVariants;                                   // 0x5b8(0x10)
	int                                                          NameSizeIndex;                                     // 0x5c8(0x4)
	struct FeatureFlag                                           FeatureName;                                       // 0x5cc(0xc)
};


}