// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0
class BP_fod_ChickenMeatRaw_00_a_ItemProxy_C: public BP_ProxyIngestible_Retractable_C
{
public:
};


// Size 0x0
class BP_fod_ChickenMeatRawBite1_00_a_ItemDesc_C: public ItemDesc
{
public:
};


// Size 0x0
class BP_fod_ChickenMeatRaw_00_a_Wieldable_C: public BP_StaticWieldableIngestible_C
{
public:
};


// Size 0x18
class BP_fod_ChickenMeatRaw_00_a_ItemInfo_C: public BP_MeatItemInfo_C
{
public:
	Class MaterialManipulationSettingsComponent*                 MaterialManipulationSettings;                      // 0x560(0x8)
	Class LightWeightStatusEffectManagerComponent*               LightweightStatusEffectManager;                    // 0x568(0x8)
	Class CookableComponent*                                     Cookable;                                          // 0x570(0x8)
};


// Size 0x38
class BP_PromptActor_EmissaryRank2_AF_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x400(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x408(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x410(0x8)
	class                                                        Company;                                           // 0x418(0x8)
	int                                                          ExpectedLevel;                                     // 0x420(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x38
class BP_PromptActor_EmissaryRank2_GH_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x400(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x408(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x410(0x8)
	class                                                        Company;                                           // 0x418(0x8)
	int                                                          ExpectedLevel;                                     // 0x420(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x38
class BP_PromptActor_EmissaryRank2_MA_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x400(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x408(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x410(0x8)
	class                                                        Company;                                           // 0x418(0x8)
	int                                                          ExpectedLevel;                                     // 0x420(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x38
class BP_PromptActor_EmissaryRank2_OOS_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x400(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x408(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x410(0x8)
	class                                                        Company;                                           // 0x418(0x8)
	int                                                          ExpectedLevel;                                     // 0x420(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x38
class BP_PromptActor_EmissaryRank2_RB_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x400(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x408(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x410(0x8)
	class                                                        Company;                                           // 0x418(0x8)
	int                                                          ExpectedLevel;                                     // 0x420(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x3c
class BP_PromptActor_EmissaryRank5_AF_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x400(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x408(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x410(0x8)
	class                                                        Company;                                           // 0x418(0x8)
	int                                                          ExpectedLevel;                                     // 0x420(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
	float                                                        InitialDelay;                                      // 0x438(0x4)
};


// Size 0x3c
class BP_PromptActor_EmissaryRank5_GH_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x400(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x408(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x410(0x8)
	class                                                        Company;                                           // 0x418(0x8)
	int                                                          ExpectedLevel;                                     // 0x420(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
	float                                                        InitialDelay;                                      // 0x438(0x4)
};


// Size 0x3c
class BP_PromptActor_EmissaryRank5_MA_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x400(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x408(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x410(0x8)
	class                                                        Company;                                           // 0x418(0x8)
	int                                                          ExpectedLevel;                                     // 0x420(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
	float                                                        InitialDelay;                                      // 0x438(0x4)
};


// Size 0x3c
class BP_PromptActor_EmissaryRank5_OOS_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x400(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x408(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x410(0x8)
	class                                                        Company;                                           // 0x418(0x8)
	int                                                          ExpectedLevel;                                     // 0x420(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
	float                                                        InitialDelay;                                      // 0x438(0x4)
};


// Size 0x3c
class BP_PromptActor_EmissaryRank5_RB_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x400(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x408(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x410(0x8)
	class                                                        Company;                                           // 0x418(0x8)
	int                                                          ExpectedLevel;                                     // 0x420(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
	float                                                        InitialDelay;                                      // 0x438(0x4)
};


// Size 0x10
class BP_CommodityManifestBook_MerchantAlliance_C: public ModalInteractionProxy
{
public:
	Class NPCDialogComponent*                                    NPCDialog;                                         // 0x500(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x508(0x8)
};


// Size 0x18
class BP_IslandStorageBarrel_Outpost_C: public StorageContainer
{
public:
	Class ReplenishableComponent*                                Replenishable;                                     // 0x4b8(0x8)
	Class IslandTelemetrySubjectComponent*                       IslandTelemetrySubject;                            // 0x4c0(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x4c8(0x8)
};


// Size 0x0
class BP_underwear_yellow_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_underwear_red_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_underwear_purple_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_underwear_orange_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_underwear_grey_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_underwear_green_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_underwear_blue_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_underwear_black_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_white_01_under_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_red_05_under_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_red_04_under_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_red_01_under_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_brown_07_under_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_brown_05_under_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_brown_03_under_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_blond_05_under_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_blond_04_under_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_blond_01_under_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_black_03_under_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_black_02_under_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_black_01_under_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_Emote_Dice_D8_Desc_C: public EmoteDesc
{
public:
};


// Size 0x0
class BP_Emote_Dice_D6_Desc_C: public EmoteDesc
{
public:
};


// Size 0x0
class BP_Emote_Dice_D4_Desc_C: public EmoteDesc
{
public:
};


// Size 0x0
class BP_Emote_Dice_D20_Desc_C: public EmoteDesc
{
public:
};


// Size 0x0
class BP_Emote_Dice_D12_Desc_C: public EmoteDesc
{
public:
};


// Size 0x0
class BP_Emote_Dice_D10_Desc_C: public EmoteDesc
{
public:
};


}