// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x124
class BP_CaptainsBookcase_01_C: public CaptainsBookcase
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x670(0x8)
	Class StaticMeshComponent*                                   gmp_key_pirateLegends_03;                          // 0x678(0x8)
	Class StaticMeshComponent*                                   gmp_key_pirateLegends_02;                          // 0x680(0x8)
	Class StaticMeshComponent*                                   gmp_key_pirateLegends_01;                          // 0x688(0x8)
	Class StaticMeshComponent*                                   Indicator_leg;                                     // 0x690(0x8)
	Class StaticMeshComponent*                                   Indicator_leg;                                     // 0x698(0x8)
	Class StaticMeshComponent*                                   Indicator_leg;                                     // 0x6a0(0x8)
	Class StaticMeshComponent*                                   Indicator_mcn;                                     // 0x6a8(0x8)
	Class StaticMeshComponent*                                   Indicator_mcn;                                     // 0x6b0(0x8)
	Class StaticMeshComponent*                                   Indicator_mcn;                                     // 0x6b8(0x8)
	Class StaticMeshComponent*                                   Indicator_oos;                                     // 0x6c0(0x8)
	Class StaticMeshComponent*                                   Indicator_oos;                                     // 0x6c8(0x8)
	Class StaticMeshComponent*                                   Indicator_oos;                                     // 0x6d0(0x8)
	Class StaticMeshComponent*                                   Indicator_mrh;                                     // 0x6d8(0x8)
	Class StaticMeshComponent*                                   Indicator_mrh;                                     // 0x6e0(0x8)
	Class StaticMeshComponent*                                   Indicator_mrh;                                     // 0x6e8(0x8)
	Class StaticMeshComponent*                                   Indicator_gld;                                     // 0x6f0(0x8)
	Class StaticMeshComponent*                                   Indicator_gld;                                     // 0x6f8(0x8)
	Class StaticMeshComponent*                                   Indicator_gld;                                     // 0x700(0x8)
	Class StaticMeshComponent*                                   Plant;                                             // 0x708(0x8)
	Class StaticMeshComponent*                                   coin_02;                                           // 0x710(0x8)
	Class StaticMeshComponent*                                   coin_03;                                           // 0x718(0x8)
	Class StaticMeshComponent*                                   coin_04;                                           // 0x720(0x8)
	Class StaticMeshComponent*                                   bottle;                                            // 0x728(0x8)
	Class StaticMeshComponent*                                   coin_05;                                           // 0x730(0x8)
	Class StaticMeshComponent*                                   coin_06;                                           // 0x738(0x8)
	Class StaticMeshComponent*                                   skull;                                             // 0x740(0x8)
	Class StaticMeshComponent*                                   dagger;                                            // 0x748(0x8)
	Class StaticMeshComponent*                                   coin_01;                                           // 0x750(0x8)
	Class StaticMeshComponent*                                   Bookcase;                                          // 0x758(0x8)
	class                                                        Company_GH;                                        // 0x760(0x8)
	class                                                        Company_MA;                                        // 0x768(0x8)
	class                                                        Company_OoS;                                       // 0x770(0x8)
	class                                                        Company_Leg;                                       // 0x778(0x8)
	class                                                        Company_Merc;                                      // 0x780(0x8)
	float                                                        ThresholdOneScroll;                                // 0x788(0x4)
	float                                                        ThresholdTwoScrolls;                               // 0x78c(0x4)
	float                                                        ThresholdThreeScrolls;                             // 0x790(0x4)
};


}