// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x41 (Full Size[0x831] - InheritedSize[0x7f0]
class BP_DamageZone_C: public DamageZone
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x7f0(0x8)
	struct FName                                                 None;                                              // 0x7f8(0x8)
	Struct None                                                  None;                                              // 0x800(0x10)
	int                                                          None;                                              // 0x810(0x4)
	int                                                          None;                                              // 0x814(0x4)
	TArray<class DecalComponent*>                                None;                                              // 0x818(0x10)
	int                                                          None;                                              // 0x828(0x4)
	int                                                          None;                                              // 0x82c(0x4)
	bool                                                         None;                                              // 0x830(0x1)
};


}