// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x41 (Full Size[0x861] - InheritedSize[0x820]
class BP_DamageZone_C: public DamageZone
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x820(0x8)
	struct FName                                                 None;                                              // 0x828(0x8)
	Struct None                                                  None;                                              // 0x830(0x10)
	int                                                          None;                                              // 0x840(0x4)
	int                                                          None;                                              // 0x844(0x4)
	TArray<class DecalComponent*>                                None;                                              // 0x848(0x10)
	int                                                          None;                                              // 0x858(0x4)
	int                                                          None;                                              // 0x85c(0x4)
	bool                                                         None;                                              // 0x860(0x1)
};


}