// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x39 (Full Size[0x409] - InheritedSize[0x3d0]
class BP_DecalGlow_Reverse_C: public LandmarkReactionActor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3d0(0x8)
	Class SceneComponent*                                        None;                                              // 0x3d8(0x8)
	TArray<class MaterialInstanceDynamic*>                       None;                                              // 0x3e0(0x10)
	float                                                        None;                                              // 0x3f0(0x4)
	char                                                         pad0x4_NW6HL[0x4];                                 // 0x3f4(0x4)
	BlueprintGeneratedClass None*                                None;                                              // 0x3f8(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x400(0x8)
	bool                                                         None;                                              // 0x408(0x1)
};


}