// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x61 (Full Size[0x439] - InheritedSize[0x3d8]
class BP_DynamicDensityFogVolume_C: public FogVolume
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3d8(0x8)
	float                                                        None;                                              // 0x3e0(0x4)
	byte                                                         None;                                              // 0x3e4(0x1)
	char                                                         pad0x3_4W6I0[0x3];                                 // 0x3e5(0x3)
	Class TimelineComponent*                                     None;                                              // 0x3e8(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x3f0(0x8)
	Class CanvasRenderTarget2D*                                  None;                                              // 0x3f8(0x8)
	int                                                          None;                                              // 0x400(0x4)
	int                                                          None;                                              // 0x404(0x4)
	TArray<class Texture2D*>                                     None;                                              // 0x408(0x10)
	int                                                          None;                                              // 0x418(0x4)
	int                                                          None;                                              // 0x41c(0x4)
	bool                                                         None;                                              // 0x420(0x1)
	char                                                         pad0x7_H4B4K[0x7];                                 // 0x421(0x7)
	TArray<struct None>                                          None;                                              // 0x428(0x10)
	bool                                                         None;                                              // 0x438(0x1)
};


}