// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x41
class BP_DamageZone_C: public DamageZone
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x7e0(0x8)
	struct FName                                                 Repair Tag;                                        // 0x7e8(0x8)
	Struct BP_InternalDamageGroup                                RepairGroup;                                       // 0x7f0(0x10)
	int                                                          ExternalHitBufferIndex;                            // 0x800(0x4)
	int                                                          MaxStoredHits;                                     // 0x804(0x4)
	TArray<class Deferred Decals*>                               Deferred Decals;                                   // 0x808(0x10)
	int                                                          ClientUpdateEventCount;                            // 0x818(0x4)
	int                                                          ExternalDecalBufferIndex;                          // 0x81c(0x4)
	bool                                                         HasBeenInitialized;                                // 0x820(0x1)
};


}