// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x41 (Full Size[0x831] - InheritedSize[0x7f0]
class BP_DamageZone_C: public DamageZone
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x7f0(0x8)
	struct FName                                                 Repair Tag;                                        // 0x7f8(0x8)
	Struct BP_InternalDamageGroup                                RepairGroup;                                       // 0x800(0x10)
	int                                                          ExternalHitBufferIndex;                            // 0x810(0x4)
	int                                                          MaxStoredHits;                                     // 0x814(0x4)
	TArray<class DecalComponent*>                                Deferred Decals;                                   // 0x818(0x10)
	int                                                          ClientUpdateEventCount;                            // 0x828(0x4)
	int                                                          ExternalDecalBufferIndex;                          // 0x82c(0x4)
	bool                                                         HasBeenInitialized;                                // 0x830(0x1)
};


}