// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x39 (Full Size[0x409] - InheritedSize[0x3d0]
class BP_DecalGlow_Reverse_C: public LandmarkReactionActor
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3d0(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x3d8(0x8)
	TArray<class MaterialInstanceDynamic*>                       DecalMaterials;                                    // 0x3e0(0x10)
	float                                                        Reveal Duration;                                   // 0x3f0(0x4)
	char                                                         pad0x4_REUFL[0x4];                                 // 0x3f4(0x4)
	blueprintgeneratedclass BP_StepsTrigger_C*                   StepsTriggerActor;                                 // 0x3f8(0x8)
	blueprintgeneratedclass BP_DecalGlow_Longer_C*               StarterActor;                                      // 0x400(0x8)
	bool                                                         CollectedDecalMaterials;                           // 0x408(0x1)
};


}