#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x41 (Full Size[0x8b9] - InheritedSize[0x878]
class BP_DamageZone_C: public DamageZone
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x878(0x8)
	struct FName                                                 Repair Tag;                                        // 0x880(0x8)
	struct BP_InternalDamageGroup                                RepairGroup;                                       // 0x888(0x10)
	int                                                          ExternalHitBufferIndex;                            // 0x898(0x4)
	int                                                          MaxStoredHits;                                     // 0x89c(0x4)
	TArray<class DecalComponent*>                                Deferred Decals;                                   // 0x8a0(0x10)
	int                                                          ClientUpdateEventCount;                            // 0x8b0(0x4)
	int                                                          ExternalDecalBufferIndex;                          // 0x8b4(0x4)
	bool                                                         HasBeenInitialized;                                // 0x8b8(0x1)
};


