// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x78
class BP_EmissaryTable_MerchantAlliance_01_C: public BP_EmissaryTable_01_C
{
public:
	Class PointLightComponent*                                   PointLight1;                                       // 0x640(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x648(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x650(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x658(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x660(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x668(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x670(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x678(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x680(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x688(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               EmissaryShipAffiliationTracker;                    // 0x690(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_03_a;                            // 0x698(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_01_a;                            // 0x6a0(0x8)
	Class StaticMeshComponent*                                   bld_emissary_table_dressing_mrh_01_a;              // 0x6a8(0x8)
	Class StaticMeshComponent*                                   con_cover_page_mrh_01_a;                           // 0x6b0(0x8)
};


}