// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x58 (Full Size[0x6e8] - InheritedSize[0x690]
class BP_EmissaryTable_01_C: public EmissaryVoteInteractionActor
{
public:
	class EmissaryActiveTableVisualiserComponent*                EmissaryActiveTableVisualiser;                     // 0x690(0x8)
	class VoteAudioComponent*                                    VoteAudio;                                         // 0x698(0x8)
	class StaticMeshVoteVisualiserComponent*                     StaticMeshVoteVisualiser;                          // 0x6a0(0x8)
	class InlineVotingInteractionComponent*                      InlineVotingInteraction;                           // 0x6a8(0x8)
	class ActionRulesComponent*                                  ActionRules;                                       // 0x6b0(0x8)
	class StaticMeshComponent*                                   VoteIndicator4;                                    // 0x6b8(0x8)
	class StaticMeshComponent*                                   VoteIndicator3;                                    // 0x6c0(0x8)
	class StaticMeshComponent*                                   VoteIndicator2;                                    // 0x6c8(0x8)
	class StaticMeshComponent*                                   VoteIndicator1;                                    // 0x6d0(0x8)
	class StaticMeshComponent*                                   bld_emissary_table_01_a;                           // 0x6d8(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x6e0(0x8)
};


}