// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x78
class BP_EmissaryTable_Athena_01_C: public BP_EmissaryTable_01_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x638(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x640(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               EmissaryShipAffiliationTracker;                    // 0x648(0x8)
	Class ParticleSystemComponent*                               vfx_candle_01_magic2;                              // 0x650(0x8)
	Class ParticleSystemComponent*                               vfx_candle_01_magic1;                              // 0x658(0x8)
	Class ParticleSystemComponent*                               vfx_candle_01_magic;                               // 0x660(0x8)
	Class StaticMeshComponent*                                   wpn_cutlass_leg_01_a;                              // 0x668(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_d;                                   // 0x670(0x8)
	Class StaticMeshComponent*                                   con_cover_page_leg_01_a;                           // 0x678(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_c;                                   // 0x680(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_a;                                   // 0x688(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_e;                                   // 0x690(0x8)
	Class StaticMeshComponent*                                   cap_desk_model_leg_01_a;                           // 0x698(0x8)
	Class StaticMesh*                                            NewTableMesh;                                      // 0x6a0(0x8)
	Struct FeatureFlag                                           FeatureName;                                       // 0x6a8(0x8)
};


}