// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x58 (Full Size[0x6e0] - InheritedSize[0x688]
class BP_EmissaryTable_01_C: public EmissaryVoteInteractionActor
{
public:
	Class EmissaryActiveTableVisualiserComponent*                EmissaryActiveTableVisualiser;                     // 0x688(0x8)
	Class VoteAudioComponent*                                    VoteAudio;                                         // 0x690(0x8)
	Class StaticMeshVoteVisualiserComponent*                     StaticMeshVoteVisualiser;                          // 0x698(0x8)
	Class InlineVotingInteractionComponent*                      InlineVotingInteraction;                           // 0x6a0(0x8)
	Class ActionRulesComponent*                                  ActionRules;                                       // 0x6a8(0x8)
	Class StaticMeshComponent*                                   VoteIndicator4;                                    // 0x6b0(0x8)
	Class StaticMeshComponent*                                   VoteIndicator3;                                    // 0x6b8(0x8)
	Class StaticMeshComponent*                                   VoteIndicator2;                                    // 0x6c0(0x8)
	Class StaticMeshComponent*                                   VoteIndicator1;                                    // 0x6c8(0x8)
	Class StaticMeshComponent*                                   bld_emissary_table_01_a;                           // 0x6d0(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x6d8(0x8)
};


}