#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xf8 (Full Size[0x7e0] - InheritedSize[0x6e8]
class BP_EmissaryTable_Sov_01_a_C: public BP_EmissaryTable_01_C
{
public:
	class PointLightComponent*                                   PointLight3;                                       // 0x6e8(0x8)
	class PointLightComponent*                                   PointLight2;                                       // 0x6f0(0x8)
	class ParticleSystemComponent*                               ParticleSystem7;                                   // 0x6f8(0x8)
	class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x700(0x8)
	class StaticMeshComponent*                                   cap_desk_model_pol_01_a;                           // 0x708(0x8)
	class StaticMeshComponent*                                   bld_sovereign_sigil_02_a;                          // 0x710(0x8)
	class StaticMeshComponent*                                   StaticMesh6;                                       // 0x718(0x8)
	class StaticMeshComponent*                                   StaticMesh12;                                      // 0x720(0x8)
	class StaticMeshComponent*                                   StaticMesh11;                                      // 0x728(0x8)
	class StaticMeshComponent*                                   StaticMesh10;                                      // 0x730(0x8)
	class StaticMeshComponent*                                   StaticMesh9;                                       // 0x738(0x8)
	class StaticMeshComponent*                                   StaticMesh8;                                       // 0x740(0x8)
	class StaticMeshComponent*                                   StaticMesh7;                                       // 0x748(0x8)
	class StaticMeshComponent*                                   trs_coin_02_a;                                     // 0x750(0x8)
	class StaticMeshComponent*                                   cap_plinth_01_c;                                   // 0x758(0x8)
	class StaticMeshComponent*                                   gmp_tal_wildrose_scroll_01_a;                      // 0x760(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x768(0x8)
	class StaticMeshComponent*                                   cap_cabin_books_aged_01_a_proxy;                   // 0x770(0x8)
	class StaticMeshComponent*                                   cap_inkwell_01_a;                                  // 0x778(0x8)
	class StaticMeshComponent*                                   gmp_parchment_scroll_01_c;                         // 0x780(0x8)
	class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x788(0x8)
	class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x790(0x8)
	class StaticMeshComponent*                                   StaticMesh4;                                       // 0x798(0x8)
	class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x7a0(0x8)
	class StaticMeshComponent*                                   StaticMesh1;                                       // 0x7a8(0x8)
	class StaticMeshComponent*                                   StaticMesh3;                                       // 0x7b0(0x8)
	class StaticMeshComponent*                                   trs_gold_ingot_01_a5;                              // 0x7b8(0x8)
	class StaticMeshComponent*                                   StaticMesh2;                                       // 0x7c0(0x8)
	class StaticMeshComponent*                                   Candlestick;                                       // 0x7c8(0x8)
	class EmissaryShipAffiliationTrackerComponent*               EmissaryShipAffiliationTracker;                    // 0x7d0(0x8)
	class StaticMeshComponent*                                   con_cover_page_gld_01_a;                           // 0x7d8(0x8)
};


