// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x78 (Full Size[0x758] - InheritedSize[0x6e0]
class BP_EmissaryTable_MerchantAlliance_01_C: public BP_EmissaryTable_01_C
{
public:
	Class PointLightComponent*                                   PointLight1;                                       // 0x6e0(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x6e8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x6f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x6f8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x700(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x708(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x710(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x718(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x720(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x728(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               EmissaryShipAffiliationTracker;                    // 0x730(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_03_a;                            // 0x738(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_01_a;                            // 0x740(0x8)
	Class StaticMeshComponent*                                   bld_emissary_table_dressing_mrh_01_a;              // 0x748(0x8)
	Class StaticMeshComponent*                                   con_cover_page_mrh_01_a;                           // 0x750(0x8)
};


}