// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xd0
class BP_EmissaryTable_Reapers_01_C: public BP_EmissaryTable_01_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x638(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x640(0x8)
	Class StaticMeshComponent*                                   shp_gho_candle_01_c1;                              // 0x648(0x8)
	Class StaticMeshComponent*                                   shp_gho_candle_01_e;                               // 0x650(0x8)
	Class StaticMeshComponent*                                   shp_gho_candle_01_b1;                              // 0x658(0x8)
	Class StaticMeshComponent*                                   shp_gho_candle_01_c;                               // 0x660(0x8)
	Class StaticMeshComponent*                                   shp_gho_candle_01_b;                               // 0x668(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x670(0x8)
	Class StaticMeshComponent*                                   bld_reapers_mask_01_a;                             // 0x678(0x8)
	Class StaticMeshComponent*                                   cmp_papers_reaper_02_a;                            // 0x680(0x8)
	Class StaticMeshComponent*                                   cmp_tools_reaper_01_a;                             // 0x688(0x8)
	Class StaticMeshComponent*                                   cmp_goblet_reaper_02_a;                            // 0x690(0x8)
	Class StaticMeshComponent*                                   cmp_papers_reaper_01_a;                            // 0x698(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               EmissaryShipAffiliationTracker;                    // 0x6a0(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x6a8(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x6b0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x6b8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x6c0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x6c8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x6d0(0x8)
	Class ParticleSystemComponent*                               vfx_candle_01_tavern;                              // 0x6d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x6e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x6e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x6f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x6f8(0x8)
	Struct FeatureFlag                                           FeatureName;                                       // 0x700(0x8)
};


}