// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x118 (Full Size[0x7f8] - InheritedSize[0x6e0]
class BP_EmissaryTable_GoldHoarder_01_C: public BP_EmissaryTable_01_C
{
public:
	Class PointLightComponent*                                   PointLight1;                                       // 0x6e0(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x6e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x6f0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x6f8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x700(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x708(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x710(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x718(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               EmissaryShipAffiliationTracker;                    // 0x720(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_a5;                              // 0x728(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a12;                                   // 0x730(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a11;                                   // 0x738(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a10;                                   // 0x740(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a9;                                    // 0x748(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a8;                                    // 0x750(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_c2;                              // 0x758(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a7;                                    // 0x760(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a6;                                    // 0x768(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a5;                                    // 0x770(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a4;                                    // 0x778(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a3;                                    // 0x780(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_c1;                              // 0x788(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a2;                                    // 0x790(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a1;                                    // 0x798(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_a4;                              // 0x7a0(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_a3;                              // 0x7a8(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_a2;                              // 0x7b0(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_a1;                              // 0x7b8(0x8)
	Class StaticMeshComponent*                                   trs_money_sack_medium_01_a;                        // 0x7c0(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_c;                               // 0x7c8(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_b;                               // 0x7d0(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_a;                               // 0x7d8(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a;                                     // 0x7e0(0x8)
	Class StaticMeshComponent*                                   cap_desk_model_gld_01_a;                           // 0x7e8(0x8)
	Class StaticMeshComponent*                                   con_cover_page_gld_01_a;                           // 0x7f0(0x8)
};


}