// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x78 (Full Size[0x6b0] - InheritedSize[0x638]
class BP_EmissaryTable_MerchantAlliance_01_C: public None
{
public:
	Class PointLightComponent*                                   None;                                              // 0x638(0x8)
	Class PointLightComponent*                                   None;                                              // 0x640(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x648(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x650(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x658(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x660(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x668(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x670(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x678(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x680(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               None;                                              // 0x688(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x690(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x698(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6a8(0x8)
};


}