// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x70 (Full Size[0x750] - InheritedSize[0x6e0]
class BP_EmissaryTable_OrderOfSouls_01_C: public BP_EmissaryTable_01_C
{
public:
	Class PointLightComponent*                                   PointLight;                                        // 0x6e0(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               EmissaryShipAffiliationTracker;                    // 0x6e8(0x8)
	Class ParticleSystemComponent*                               vfx_enchanting_open_chest_ambient;                 // 0x6f0(0x8)
	Class StaticMeshComponent*                                   con_cover_page_oos_01_a;                           // 0x6f8(0x8)
	Class StaticMeshComponent*                                   bld_shop_bone_oos_07_a;                            // 0x700(0x8)
	Class StaticMeshComponent*                                   bld_shop_bone_oos_08_a;                            // 0x708(0x8)
	Class StaticMeshComponent*                                   bld_shop_bone_oos_05_a;                            // 0x710(0x8)
	Class StaticMeshComponent*                                   bld_shop_bone_oos_03_a;                            // 0x718(0x8)
	Class StaticMeshComponent*                                   bld_shop_bone_oos_02_a;                            // 0x720(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_03_a1;                             // 0x728(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_02_a;                              // 0x730(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_03_a;                              // 0x738(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_aged_02_a;                         // 0x740(0x8)
	Class StaticMeshComponent*                                   cap_desk_model_oos_01_a;                           // 0x748(0x8)
};


}