// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x118
class BP_EmissaryTable_GoldHoarder_01_C: public BP_EmissaryTable_01_C
{
public:
	Class PointLightComponent*                                   PointLight1;                                       // 0x638(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x640(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x648(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x650(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x658(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x660(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x668(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x670(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               EmissaryShipAffiliationTracker;                    // 0x678(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_a5;                              // 0x680(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a12;                                   // 0x688(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a11;                                   // 0x690(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a10;                                   // 0x698(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a9;                                    // 0x6a0(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a8;                                    // 0x6a8(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_c2;                              // 0x6b0(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a7;                                    // 0x6b8(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a6;                                    // 0x6c0(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a5;                                    // 0x6c8(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a4;                                    // 0x6d0(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a3;                                    // 0x6d8(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_c1;                              // 0x6e0(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a2;                                    // 0x6e8(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a1;                                    // 0x6f0(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_a4;                              // 0x6f8(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_a3;                              // 0x700(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_a2;                              // 0x708(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_a1;                              // 0x710(0x8)
	Class StaticMeshComponent*                                   trs_money_sack_medium_01_a;                        // 0x718(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_c;                               // 0x720(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_b;                               // 0x728(0x8)
	Class StaticMeshComponent*                                   trs_gold_ingot_01_a;                               // 0x730(0x8)
	Class StaticMeshComponent*                                   frt_coin_01_a;                                     // 0x738(0x8)
	Class StaticMeshComponent*                                   cap_desk_model_gld_01_a;                           // 0x740(0x8)
	Class StaticMeshComponent*                                   con_cover_page_gld_01_a;                           // 0x748(0x8)
};


}