// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xf8 (Full Size[0x730] - InheritedSize[0x638]
class BP_EmissaryTable_Sov_01_a_C: public None
{
public:
	Class PointLightComponent*                                   None;                                              // 0x638(0x8)
	Class PointLightComponent*                                   None;                                              // 0x640(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x648(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x650(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x658(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x660(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x668(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x670(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x678(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x680(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x688(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x690(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x698(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6d0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x6d8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x6e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6e8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x6f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x700(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x708(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x710(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x718(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               None;                                              // 0x720(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x728(0x8)
};


}