// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60 (Full Size[0xb50] - InheritedSize[0xaf0]
class BP_EyeOfReach_C: public ProjectileWeapon
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0xaf0(0x8)
	Class StaticMeshComponent*                                   Glint;                                             // 0xaf8(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0xb00(0x8)
	byte                                                         sfx relationship;                                  // 0xb08(0x1)
	char                                                         pad0x7_05Z2B[0x7];                                 // 0xb09(0x7)
	Class MaterialInstanceDynamic*                               DynamicMaterial;                                   // 0xb10(0x8)
	bool                                                         TurningOn;                                         // 0xb18(0x1)
	char                                                         pad0x3_H4RGW[0x3];                                 // 0xb19(0x3)
	float                                                        BlurTime;                                          // 0xb1c(0x4)
	float                                                        BlurInDuration;                                    // 0xb20(0x4)
	float                                                        BlurOutDuration;                                   // 0xb24(0x4)
	Class CurveFloat*                                            BlurCurve;                                         // 0xb28(0x8)
	Class Texture2D*                                             LensNormal;                                        // 0xb30(0x8)
	Class Texture2D*                                             LensMask;                                          // 0xb38(0x8)
	Struct LinearColor                                           LensTint;                                          // 0xb40(0x10)
};


}