// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x120
class BP_FishCreature_C: public Actor
{
public:
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x3d0(0x8)
	byte                                                         CreatureType;                                      // 0x3d8(0x1)
	byte                                                         NumOfCreatures;                                    // 0x3d9(0x1)
	float                                                        BoundsBias;                                        // 0x3dc(0x4)
	Class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x3e0(0x8)
	Class MaterialInstanceDynamic*                               currMaterial;                                      // 0x3e8(0x8)
	TArray<class MaterialInstance*>                              MaterialInstance;                                  // 0x3f0(0x10)
	float                                                        Seed;                                              // 0x400(0x4)
	float                                                        SwimSpeed;                                         // 0x404(0x4)
	float                                                        CirclingSpeed;                                     // 0x408(0x4)
	byte                                                         CirclingDirection;                                 // 0x40c(0x1)
	float                                                        CirclingRadius;                                    // 0x410(0x4)
	float                                                        SwimDeformation;                                   // 0x414(0x4)
	float                                                        mud;                                               // 0x418(0x4)
	float                                                        shoalSpeed;                                        // 0x41c(0x4)
	Struct Vector2D                                              ShoalingSpread;                                    // 0x420(0x8)
	float                                                        ShoalingHeight;                                    // 0x428(0x4)
	float                                                        fishSpeed;                                         // 0x42c(0x4)
	Struct Vector2D                                              FishSpread;                                        // 0x430(0x8)
	float                                                        FishHeight;                                        // 0x438(0x4)
	float                                                        RandomSpread;                                      // 0x43c(0x4)
	float                                                        HueVariance;                                       // 0x440(0x4)
	float                                                        Smoothness;                                        // 0x444(0x4)
	TArray<Assetclass SelectedCreatureType>                      SelectedCreatureType;                              // 0x448(0x10)
	TArray<Assetclass Fish_04>                                   Fish_04;                                           // 0x458(0x10)
	TArray<Assetclass Fish_05>                                   Fish_05;                                           // 0x468(0x10)
	float                                                        Size;                                              // 0x478(0x4)
	float                                                        SizeVariance;                                      // 0x47c(0x4)
	float                                                        SimSpeed;                                          // 0x480(0x4)
	Struct Vector                                                BBox;                                              // 0x484(0xc)
	TArray<Assetclass Fish_07>                                   Fish_07;                                           // 0x490(0x10)
	float                                                        DrawDistance;                                      // 0x4a0(0x4)
	TArray<Assetclass Clown_01>                                  Clown_01;                                          // 0x4a8(0x10)
	float                                                        SizeCompensation;                                  // 0x4b8(0x4)
	TArray<Assetclass Splashtail>                                Splashtail;                                        // 0x4c0(0x10)
	TArray<Assetclass Pondie>                                    Pondie;                                            // 0x4d0(0x10)
	Struct LinearColor                                           FishDistribution;                                  // 0x4e0(0x10)
};


}