// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48 (Full Size[0x640] - InheritedSize[0x5f8]
class BP_FactionOutpostVote_PirateLord_C: public FactionOutpostVoteInteractionActor
{
public:
	Class VoteAudioComponent*                                    None;                                              // 0x5f8(0x8)
	Class StaticMeshVoteVisualiserComponent*                     None;                                              // 0x600(0x8)
	Class InlineVotingInteractionComponent*                      None;                                              // 0x608(0x8)
	Class ActionRulesComponent*                                  None;                                              // 0x610(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x618(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x620(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x628(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x630(0x8)
	Class SceneComponent*                                        None;                                              // 0x638(0x8)
};


}