// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1 (Full Size[0x1] - InheritedSize[0x0]
class BP_FeatureIslandSunkenCollectorsChestSpawner_C: public WarMapMesh
{
public:
	char                                                         pad0x408_V8ZAF[0x408];                             // 0x0(0x408)
	Class StaticMeshComponent*                                   WarMapMesh;                                        // 0x408(0x8)
	Class StaticMeshComponent*                                   WarMapMeshHardMode;                                // 0x410(0x8)
	Class MaterialAnimatorComponent*                             MaterialAnimatorComponent;                         // 0x418(0x8)
	struct FName                                                 OpenScrollMaterialAnimationName;                   // 0x420(0x8)
	struct FName                                                 CloseScrollMaterialAnimationName;                  // 0x428(0x8)
	Struct FText                                                 CloseMapInteractionText;                           // 0x430(0x38)
	class                                                        CloseMapInteractionInput;                          // 0x468(0x8)
	class                                                        CloseMapHoldInteractionInput;                      // 0x470(0x8)
	float                                                        CloseMapHoldDuration;                              // 0x478(0x4)
	char                                                         pad0x4_IHHWT[0x4];                                 // 0x47c(0x4)
	Class WwiseEvent*                                            OpenMapSfx;                                        // 0x480(0x8)
	Class WwiseEvent*                                            CloseMapSfx;                                       // 0x488(0x8)
	Class WwiseObjectPoolWrapper*                                SfxPool;                                           // 0x490(0x8)
	bool                                                         IsWarMapOpen;                                      // 0x498(0x1)
	bool                                                         ShowHardModeVoting;                                // 0x499(0x1)
	bool                                                         ShipCrewHasJoinedFaction;                          // 0x49a(0x1)
	char                                                         pad0x5_9QMD6[0x5];                                 // 0x49b(0x5)
	Class Ship*                                                  ParentShip;                                        // 0x4a0(0x8)
	Struct Guid                                                  ParentShipCrewId;                                  // 0x4a8(0x10)
	Struct FText                                                 CrewFactionDisplayName;                            // 0x4b8(0x38)
};


}