// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc8
class BP_FactionEmissaryTable_Athena_C: public BP_EmissaryTable_01_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x638(0x8)
	Class PointLightComponent*                                   PointLight3;                                       // 0x640(0x8)
	Class StaticMeshComponent*                                   cap_desk_model_fac_shield_athena_01_a;             // 0x648(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x650(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x658(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x660(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x668(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x670(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x678(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x680(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x688(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x690(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x698(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x6a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x6a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x6b0(0x8)
	Class StaticMeshComponent*                                   Hourglass;                                         // 0x6b8(0x8)
	Class StaticMeshComponent*                                   HourglassStand;                                    // 0x6c0(0x8)
	Class StaticMeshComponent*                                   con_cover_page_leg_01_a_02;                        // 0x6c8(0x8)
	Class ChildActorComponent*                                   FactionLeaveVote;                                  // 0x6d0(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               EmissaryShipAffiliationTracker;                    // 0x6d8(0x8)
	Class StaticMeshComponent*                                   con_cover_page_leg_01_a;                           // 0x6e0(0x8)
	Class StaticMeshComponent*                                   cap_desk_model_leg_01_a;                           // 0x6e8(0x8)
	Class StaticMesh*                                            NewTableMesh;                                      // 0x6f0(0x8)
	Class MaterialInstanceDynamic*                               HourglassGlassMaterial;                            // 0x6f8(0x8)
};


}