// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0
class BP_fod_LeechesFresh_00_a_ItemDesc_C: public ItemDesc
{
public:
};


// Size 0x0
class BP_fod_SharkMeatRaw_00_a_ItemProxy_C: public BP_ProxyIngestible_Retractable_C
{
public:
};


// Size 0x0
class BP_fod_SharkMeatRawBite1_00_a_ItemDesc_C: public ItemDesc
{
public:
};


// Size 0x0
class BP_fod_SharkMeatRaw_00_a_Wieldable_C: public BP_StaticWieldableIngestible_C
{
public:
};


// Size 0x18
class BP_fod_SharkMeatRaw_00_a_ItemInfo_C: public BP_MeatItemInfo_C
{
public:
	Class MaterialManipulationSettingsComponent*                 MaterialManipulationSettings;                      // 0x568(0x8)
	Class LightWeightStatusEffectManagerComponent*               LightweightStatusEffectManager;                    // 0x570(0x8)
	Class CookableComponent*                                     Cookable;                                          // 0x578(0x8)
};


// Size 0x0
class BP_fod_SnakeMeatRaw_00_a_ItemProxy_C: public BP_ProxyIngestible_Retractable_C
{
public:
};


// Size 0x0
class BP_fod_SnakeMeatRawBite1_00_a_ItemDesc_C: public ItemDesc
{
public:
};


// Size 0x0
class BP_fod_SnakeMeatRaw_00_a_Wieldable_C: public BP_StaticWieldableIngestible_C
{
public:
};


// Size 0x18
class BP_fod_SnakeMeatRaw_00_a_ItemInfo_C: public BP_MeatItemInfo_C
{
public:
	Class MaterialManipulationSettingsComponent*                 MaterialManipulationSettings;                      // 0x568(0x8)
	Class LightWeightStatusEffectManagerComponent*               LightweightStatusEffectManager;                    // 0x570(0x8)
	Class CookableComponent*                                     Cookable;                                          // 0x578(0x8)
};


// Size 0x0
class BP_fod_SnakeMeatRawBite1_00_a_ItemProxy_C: public BP_ProxyIngestible_Retractable_C
{
public:
};


// Size 0x0
class BP_fod_SnakeMeatRawBite1_00_a_Wieldable_C: public BP_StaticWieldableIngestible_C
{
public:
};


// Size 0x18
class BP_fod_SnakeMeatRawBite1_00_a_ItemInfo_C: public BP_MeatItemInfo_C
{
public:
	Class MaterialManipulationSettingsComponent*                 MaterialManipulationSettings;                      // 0x568(0x8)
	Class LightWeightStatusEffectManagerComponent*               LightweightStatusEffectManager;                    // 0x570(0x8)
	Class CookableComponent*                                     Cookable;                                          // 0x578(0x8)
};


// Size 0x0
class BP_fod_CoconutFresh_00_a_ItemDesc_C: public ItemDesc
{
public:
};


}