// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x120 (Full Size[0x4e8] - InheritedSize[0x3c8]
class BP_FishCreature_C: public Actor
{
public:
	Class SceneComponent*                                        None;                                              // 0x3c8(0x8)
	byte                                                         None;                                              // 0x3d0(0x1)
	byte                                                         None;                                              // 0x3d1(0x1)
	char                                                         pad0x2_ZUNA7[0x2];                                 // 0x3d2(0x2)
	float                                                        None;                                              // 0x3d4(0x4)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x3e0(0x8)
	TArray<class MaterialInstanceDynamic*>                       None;                                              // 0x3e8(0x10)
	float                                                        None;                                              // 0x3f8(0x4)
	float                                                        None;                                              // 0x3fc(0x4)
	float                                                        None;                                              // 0x400(0x4)
	byte                                                         None;                                              // 0x404(0x1)
	char                                                         pad0x3_BUAVI[0x3];                                 // 0x405(0x3)
	float                                                        None;                                              // 0x408(0x4)
	float                                                        None;                                              // 0x40c(0x4)
	float                                                        None;                                              // 0x410(0x4)
	float                                                        None;                                              // 0x414(0x4)
	Struct Vector2D                                              None;                                              // 0x418(0x8)
	float                                                        None;                                              // 0x420(0x4)
	float                                                        None;                                              // 0x424(0x4)
	Struct Vector2D                                              None;                                              // 0x428(0x8)
	float                                                        None;                                              // 0x430(0x4)
	float                                                        None;                                              // 0x434(0x4)
	float                                                        None;                                              // 0x438(0x4)
	float                                                        None;                                              // 0x43c(0x4)
	TArray<Assetclass None>                                      None;                                              // 0x440(0x10)
	TArray<Assetclass None>                                      None;                                              // 0x450(0x10)
	TArray<Assetclass None>                                      None;                                              // 0x460(0x10)
	float                                                        None;                                              // 0x470(0x4)
	float                                                        None;                                              // 0x474(0x4)
	float                                                        None;                                              // 0x478(0x4)
	Struct Vector                                                None;                                              // 0x47c(0xc)
	TArray<Assetclass None>                                      None;                                              // 0x488(0x10)
	float                                                        None;                                              // 0x498(0x4)
	char                                                         pad0x4_EQRFI[0x4];                                 // 0x49c(0x4)
	TArray<Assetclass None>                                      None;                                              // 0x4a0(0x10)
	float                                                        None;                                              // 0x4b0(0x4)
	char                                                         pad0x4_NP9BU[0x4];                                 // 0x4b4(0x4)
	TArray<Assetclass None>                                      None;                                              // 0x4b8(0x10)
	TArray<Assetclass None>                                      None;                                              // 0x4c8(0x10)
	Struct LinearColor                                           None;                                              // 0x4d8(0x10)
};


}