// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x38 (Full Size[0xb28] - InheritedSize[0xaf0]
class BP_FlintlockPistol_C: public ProjectileWeapon
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0xaf0(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0xaf8(0x8)
	byte                                                         sfx relationship;                                  // 0xb00(0x1)
	char                                                         pad0x7_GDZBO[0x7];                                 // 0xb01(0x7)
	Class MaterialInstanceDynamic*                               DynamicMaterial;                                   // 0xb08(0x8)
	Class Object*                                                ThirdPerson_VFX_AI;                                // 0xb10(0x8)
	Class WwiseEvent*                                            Flintlock3rdPersonSFX;                             // 0xb18(0x8)
	Class WwiseEvent*                                            FlintLockFirstPersonSFX;                           // 0xb20(0x8)
};


}