// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class BP_FactionEmissaryTable_Athena_C: public BP_EmissaryTable_01_C
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x638(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x640(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x648(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x650(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               None;                                              // 0x658(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x660(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x668(0x8)
	Class StaticMesh*                                            None;                                              // 0x670(0x8)
};


}