// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x108 (Full Size[0x7e8] - InheritedSize[0x6e0]
class BP_FactionEmissaryTable_Reapers_C: public BP_EmissaryTable_01_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x6e0(0x8)
	Class StaticMeshComponent*                                   cap_desk_model_fac_shield_reaper_01_a;             // 0x6e8(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x6f0(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x6f8(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x700(0x8)
	Class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x708(0x8)
	Class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x710(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x718(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x720(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x728(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x730(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x738(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x740(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x748(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x750(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x758(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x760(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x768(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x770(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x778(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x780(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x788(0x8)
	Class StaticMeshComponent*                                   Hourglass;                                         // 0x790(0x8)
	Class StaticMeshComponent*                                   HourglassStand;                                    // 0x798(0x8)
	Class ChildActorComponent*                                   FactionVote;                                       // 0x7a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x7a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x7b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x7b8(0x8)
	Class StaticMeshComponent*                                   cmp_papers_reaper_02_a;                            // 0x7c0(0x8)
	Class StaticMeshComponent*                                   cmp_papers_reaper_01_a;                            // 0x7c8(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               EmissaryShipAffiliationTracker;                    // 0x7d0(0x8)
	Class StaticMesh*                                            NewTableMesh;                                      // 0x7d8(0x8)
	Class MaterialInstanceDynamic*                               HourglassGlassMaterial;                            // 0x7e0(0x8)
};


}