// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x108
class BP_FactionEmissaryTable_Reapers_C: public BP_EmissaryTable_01_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x638(0x8)
	Class StaticMeshComponent*                                   cap_desk_model_fac_shield_reaper_01_a;             // 0x640(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x648(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x650(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x658(0x8)
	Class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x660(0x8)
	Class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x668(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x670(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x678(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x680(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x688(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x690(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x698(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x6a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x6a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x6b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x6b8(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x6c0(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x6c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x6d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x6d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x6e0(0x8)
	Class StaticMeshComponent*                                   Hourglass;                                         // 0x6e8(0x8)
	Class StaticMeshComponent*                                   HourglassStand;                                    // 0x6f0(0x8)
	Class ChildActorComponent*                                   FactionVote;                                       // 0x6f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x700(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x708(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x710(0x8)
	Class StaticMeshComponent*                                   cmp_papers_reaper_02_a;                            // 0x718(0x8)
	Class StaticMeshComponent*                                   cmp_papers_reaper_01_a;                            // 0x720(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               EmissaryShipAffiliationTracker;                    // 0x728(0x8)
	Class StaticMesh*                                            NewTableMesh;                                      // 0x730(0x8)
	Class MaterialInstanceDynamic*                               HourglassGlassMaterial;                            // 0x738(0x8)
};


}