#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x48 (Full Size[0x640] - InheritedSize[0x5f8]
class BP_FactionOutpostTable_C: public FactionOutpostVoteInteractionActor
{
public:
	class VoteAudioComponent*                                    VoteAudio;                                         // 0x5f8(0x8)
	class StaticMeshVoteVisualiserComponent*                     StaticMeshVoteVisualiser;                          // 0x600(0x8)
	class InlineVotingInteractionComponent*                      InlineVotingInteraction;                           // 0x608(0x8)
	class ActionRulesComponent*                                  ActionRules;                                       // 0x610(0x8)
	class StaticMeshComponent*                                   VoteIndicator4;                                    // 0x618(0x8)
	class StaticMeshComponent*                                   VoteIndicator3;                                    // 0x620(0x8)
	class StaticMeshComponent*                                   VoteIndicator2;                                    // 0x628(0x8)
	class StaticMeshComponent*                                   VoteIndicator1;                                    // 0x630(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x638(0x8)
};


