// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60 (Full Size[0x708] - InheritedSize[0x6a8]
class BP_FeatureIslandWashedUpResourceMerchantCratesSpawner_DVR_C: public NPC
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x6a8(0x8)
	Class NamedNPCComponent*                                     NamedNPC;                                          // 0x6b0(0x8)
	Class CargoRunParticipantComponent*                          CargoRunParticipant;                               // 0x6b8(0x8)
	Class NPCDialogComponent*                                    NPCDialogComponent;                                // 0x6c0(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x6c8(0x8)
	Class CapsuleComponent*                                      SolidHits;                                         // 0x6d0(0x8)
	Struct WwiseEmitter                                          WwiseEmitter;                                      // 0x6d8(0x20)
	Class WwiseEvent*                                            WwiseShipwrightHummingPlay;                        // 0x6f8(0x8)
	Class WwiseEvent*                                            WwiseShipwrightHummingStop;                        // 0x700(0x8)
};


}