// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0 (Full Size[0x560] - InheritedSize[0x4c0]
class BP_FactionHourglass_C: public FactionVoteInteractionActor
{
public:
	Class MaterialManipulationComponent*                         MaterialManipulation;                              // 0x4c0(0x8)
	Class ExplosionComponent*                                    Explosion;                                         // 0x4c8(0x8)
	Class FactionVoteAudioComponent*                             FactionVoteAudio;                                  // 0x4d0(0x8)
	Class FactionInteractionVoteComponent*                       FactionInteractionVote;                            // 0x4d8(0x8)
	Class StaticMeshComponent*                                   HourglassStand;                                    // 0x4e0(0x8)
	Class FactionParticleComponent*                              ParticlesFactionG;                                 // 0x4e8(0x8)
	Class FactionParticleComponent*                              ParticlesFactionB;                                 // 0x4f0(0x8)
	Class FactionFlipMeshComponent*                              FactionFlipMesh;                                   // 0x4f8(0x8)
	Class StaticMeshComponent*                                   FH_VoteIndicator4;                                 // 0x500(0x8)
	Class StaticMeshComponent*                                   PL_VoteIndicator4;                                 // 0x508(0x8)
	Class StaticMeshComponent*                                   FH_VoteIndicator3;                                 // 0x510(0x8)
	Class StaticMeshComponent*                                   PL_VoteIndicator3;                                 // 0x518(0x8)
	Class StaticMeshComponent*                                   FH_VoteIndicator2;                                 // 0x520(0x8)
	Class StaticMeshComponent*                                   PL_VoteIndicator2;                                 // 0x528(0x8)
	Class StaticMeshComponent*                                   FH_VoteIndicator1;                                 // 0x530(0x8)
	Class StaticMeshComponent*                                   PL_VoteIndicator1;                                 // 0x538(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x540(0x8)
	Class EmissaryActiveTableVisualiserComponent*                EmissaryActiveTableVisualiser;                     // 0x548(0x8)
	Class StaticMeshVoteVisualiserComponent*                     StaticMeshVoteVisualiser;                          // 0x550(0x8)
	Class ActionRulesComponent*                                  ActionRules;                                       // 0x558(0x8)
};


}