// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48 (Full Size[0x640] - InheritedSize[0x5f8]
class BP_FactionOutpostTable_C: public FactionOutpostVoteInteractionActor
{
public:
	Class VoteAudioComponent*                                    VoteAudio;                                         // 0x5f8(0x8)
	Class StaticMeshVoteVisualiserComponent*                     StaticMeshVoteVisualiser;                          // 0x600(0x8)
	Class InlineVotingInteractionComponent*                      InlineVotingInteraction;                           // 0x608(0x8)
	Class ActionRulesComponent*                                  ActionRules;                                       // 0x610(0x8)
	Class StaticMeshComponent*                                   VoteIndicator4;                                    // 0x618(0x8)
	Class StaticMeshComponent*                                   VoteIndicator3;                                    // 0x620(0x8)
	Class StaticMeshComponent*                                   VoteIndicator2;                                    // 0x628(0x8)
	Class StaticMeshComponent*                                   VoteIndicator1;                                    // 0x630(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x638(0x8)
};


}