// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc8 (Full Size[0x7a8] - InheritedSize[0x6e0]
class BP_FactionEmissaryTable_Athena_C: public BP_EmissaryTable_01_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x6e0(0x8)
	Class PointLightComponent*                                   PointLight3;                                       // 0x6e8(0x8)
	Class StaticMeshComponent*                                   cap_desk_model_fac_shield_athena_01_a;             // 0x6f0(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x6f8(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x700(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x708(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x710(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x718(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x720(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x728(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x730(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x738(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x740(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x748(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x750(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x758(0x8)
	Class StaticMeshComponent*                                   Hourglass;                                         // 0x760(0x8)
	Class StaticMeshComponent*                                   HourglassStand;                                    // 0x768(0x8)
	Class StaticMeshComponent*                                   con_cover_page_leg_01_a_02;                        // 0x770(0x8)
	Class ChildActorComponent*                                   FactionLeaveVote;                                  // 0x778(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               EmissaryShipAffiliationTracker;                    // 0x780(0x8)
	Class StaticMeshComponent*                                   con_cover_page_leg_01_a;                           // 0x788(0x8)
	Class StaticMeshComponent*                                   cap_desk_model_leg_01_a;                           // 0x790(0x8)
	Class StaticMesh*                                            NewTableMesh;                                      // 0x798(0x8)
	Class MaterialInstanceDynamic*                               HourglassGlassMaterial;                            // 0x7a0(0x8)
};


}