// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size -0x1 (Full Size[-0x1] - InheritedSize[0x0]
class BP_FeatureIslandSunkenStatueSpawner_C: public Mesh
{
public:
	char                                                         pad0x408_2R5JP[0x408];                             // 0x0(0x408)
	Class PrimitiveComponent*                                    Mesh;                                              // 0x408(0x8)
	Class InteractableComponent*                                 InteractionRegion;                                 // 0x430(0x8)
	class                                                        InteractionType;                                   // 0x438(0x8)
	Struct FText                                                 DefaultTooltip;                                    // 0x440(0x38)
	Struct FText                                                 DefaultDisplayName;                                // 0x478(0x38)
	class                                                        NotificationInputId;                               // 0x4b0(0x8)
	byte                                                         DisplayPriority;                                   // 0x4b8(0x1)
};


}