// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size -0x1 (Full Size[-0x1] - InheritedSize[0x0]
class BP_FeatureIslandWashedUpCargoRunsSpawner_C: public CookerComponent
{
public:
	char                                                         pad0x418_CZHFL[0x418];                             // 0x0(0x418)
	Class CookerComponent*                                       CookerComponent;                                   // 0x418(0x8)
	float                                                        HoldToInteractTime;                                // 0x420(0x4)
	char                                                         pad0x4_ORPMJ[0x4];                                 // 0x424(0x4)
	Struct FText                                                 NotWieldingCookableItemTooltip;                    // 0x428(0x38)
	Struct FText                                                 WieldingCookableItemTooltip;                       // 0x460(0x38)
	Struct FText                                                 TakeItemTooltip;                                   // 0x498(0x38)
	Struct FText                                                 CannotTakeItemTooltip;                             // 0x4d0(0x38)
	Struct FText                                                 MixInItemTooltip;                                  // 0x508(0x38)
};


}