// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0 (Full Size[0x560] - InheritedSize[0x4c0]
class BP_FactionHourglass_C: public FactionVoteInteractionActor
{
public:
	Class MaterialManipulationComponent*                         None;                                              // 0x4c0(0x8)
	Class ExplosionComponent*                                    None;                                              // 0x4c8(0x8)
	Class FactionVoteAudioComponent*                             None;                                              // 0x4d0(0x8)
	Class FactionInteractionVoteComponent*                       None;                                              // 0x4d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4e0(0x8)
	Class FactionParticleComponent*                              None;                                              // 0x4e8(0x8)
	Class FactionParticleComponent*                              None;                                              // 0x4f0(0x8)
	Class FactionFlipMeshComponent*                              None;                                              // 0x4f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x500(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x508(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x510(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x518(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x520(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x528(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x530(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x538(0x8)
	Class SceneComponent*                                        None;                                              // 0x540(0x8)
	Class EmissaryActiveTableVisualiserComponent*                None;                                              // 0x548(0x8)
	Class StaticMeshVoteVisualiserComponent*                     None;                                              // 0x550(0x8)
	Class ActionRulesComponent*                                  None;                                              // 0x558(0x8)
};


}