// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size -0x1 (Full Size[-0x1] - InheritedSize[0x0]
class BP_FeatureIslandWashedUpTreasureArtifactsSpawner_C: public StaticMeshComponent
{
public:
	char                                                         pad0x488_K0LG3[0x488];                             // 0x0(0x488)
	Class StaticMeshComponent*                                   BellMeshComponent;                                 // 0x488(0x8)
	Class WwiseEvent*                                            BellRingSFX;                                       // 0x490(0x8)
	Class WwiseEvent*                                            BellRingSfxStorm;                                  // 0x498(0x8)
	Struct FText                                                 BellName;                                          // 0x4a0(0x38)
	float                                                        TimeBetweenTurbulenceChecks;                       // 0x4d8(0x4)
	float                                                        MinIntervalBetweenRingsLowerBound;                 // 0x4dc(0x4)
	float                                                        MinIntervalBetweenRingsUpperBound;                 // 0x4e0(0x4)
	float                                                        MaxIntervalBetweenRingsLowerBound;                 // 0x4e4(0x4)
	float                                                        MaxIntervalBetweenRingsUpperBound;                 // 0x4e8(0x4)
	char                                                         pad0x4_JR6EN[0x4];                                 // 0x4ec(0x4)
	Class WwiseObjectPoolWrapper*                                BellPool;                                          // 0x4f0(0x8)
	Struct Vector                                                EmitterOffset;                                     // 0x4f8(0xc)
	char                                                         pad0x4_9EOXT[0x4];                                 // 0x504(0x4)
	Class MaterialInstanceDynamic*                               BellDynamicMaterial;                               // 0x508(0x8)
	int                                                          BellMaterialIndex;                                 // 0x510(0x4)
};


}