// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x38 (Full Size[0xaa8] - InheritedSize[0xa70]
class BP_FlintlockPistol_C: public ProjectileWeapon
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0xa70(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0xa78(0x8)
	byte                                                         sfx relationship;                                  // 0xa80(0x1)
	char                                                         pad0x7_Y4P8H[0x7];                                 // 0xa81(0x7)
	Class MaterialInstanceDynamic*                               DynamicMaterial;                                   // 0xa88(0x8)
	Class Object*                                                ThirdPerson_VFX_AI;                                // 0xa90(0x8)
	Class WwiseEvent*                                            Flintlock3rdPersonSFX;                             // 0xa98(0x8)
	Class WwiseEvent*                                            FlintLockFirstPersonSFX;                           // 0xaa0(0x8)
};


}