// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x80
class BP_FactionHourglass_C: public FactionVoteInteractionActor
{
public:
	Class FactionVoteAudioComponent*                             FactionVoteAudio;                                  // 0x4c0(0x8)
	Class FactionInteractionVoteComponent*                       FactionInteractionVote;                            // 0x4c8(0x8)
	Class FactionFlipMeshComponent*                              FactionFlipMesh;                                   // 0x4d0(0x8)
	Class StaticMeshComponent*                                   HourglassStand;                                    // 0x4d8(0x8)
	Class StaticMeshComponent*                                   VoteIndicator8;                                    // 0x4e0(0x8)
	Class StaticMeshComponent*                                   VoteIndicator7;                                    // 0x4e8(0x8)
	Class StaticMeshComponent*                                   VoteIndicator6;                                    // 0x4f0(0x8)
	Class StaticMeshComponent*                                   VoteIndicator5;                                    // 0x4f8(0x8)
	Class StaticMeshComponent*                                   VoteIndicator4;                                    // 0x500(0x8)
	Class StaticMeshComponent*                                   VoteIndicator3;                                    // 0x508(0x8)
	Class StaticMeshComponent*                                   VoteIndicator2;                                    // 0x510(0x8)
	Class StaticMeshComponent*                                   VoteIndicator1;                                    // 0x518(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x520(0x8)
	Class EmissaryActiveTableVisualiserComponent*                EmissaryActiveTableVisualiser;                     // 0x528(0x8)
	Class StaticMeshVoteVisualiserComponent*                     StaticMeshVoteVisualiser;                          // 0x530(0x8)
	Class ActionRulesComponent*                                  ActionRules;                                       // 0x538(0x8)
};


}