// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x11d (Full Size[0x53d] - InheritedSize[0x420]
class BP_FlyingCreature_C: public FlyingCreature
{
public:
	Class SceneComponent*                                        None;                                              // 0x420(0x8)
	byte                                                         None;                                              // 0x428(0x1)
	byte                                                         None;                                              // 0x429(0x1)
	char                                                         pad0x2_S9JQD[0x2];                                 // 0x42a(0x2)
	float                                                        None;                                              // 0x42c(0x4)
	Class StaticMeshComponent*                                   None;                                              // 0x430(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x438(0x8)
	TArray<class MaterialInstanceDynamic*>                       None;                                              // 0x440(0x10)
	float                                                        None;                                              // 0x450(0x4)
	float                                                        None;                                              // 0x454(0x4)
	float                                                        None;                                              // 0x458(0x4)
	byte                                                         None;                                              // 0x45c(0x1)
	char                                                         pad0x3_C0NJ6[0x3];                                 // 0x45d(0x3)
	float                                                        None;                                              // 0x460(0x4)
	float                                                        None;                                              // 0x464(0x4)
	float                                                        None;                                              // 0x468(0x4)
	float                                                        None;                                              // 0x46c(0x4)
	Struct Vector2D                                              None;                                              // 0x470(0x8)
	float                                                        None;                                              // 0x478(0x4)
	float                                                        None;                                              // 0x47c(0x4)
	Struct Vector2D                                              None;                                              // 0x480(0x8)
	float                                                        None;                                              // 0x488(0x4)
	float                                                        None;                                              // 0x48c(0x4)
	float                                                        None;                                              // 0x490(0x4)
	float                                                        None;                                              // 0x494(0x4)
	float                                                        None;                                              // 0x498(0x4)
	char                                                         pad0x4_5E4WK[0x4];                                 // 0x49c(0x4)
	TArray<Assetclass None>                                      None;                                              // 0x4a0(0x10)
	TArray<Assetclass None>                                      None;                                              // 0x4b0(0x10)
	float                                                        None;                                              // 0x4c0(0x4)
	float                                                        None;                                              // 0x4c4(0x4)
	float                                                        None;                                              // 0x4c8(0x4)
	Struct Vector                                                None;                                              // 0x4cc(0xc)
	TArray<Assetclass None>                                      None;                                              // 0x4d8(0x10)
	TArray<Assetclass None>                                      None;                                              // 0x4e8(0x10)
	TArray<Assetclass None>                                      None;                                              // 0x4f8(0x10)
	bool                                                         None;                                              // 0x508(0x1)
	char                                                         pad0x3_T4A4T[0x3];                                 // 0x509(0x3)
	float                                                        None;                                              // 0x50c(0x4)
	float                                                        None;                                              // 0x510(0x4)
	float                                                        None;                                              // 0x514(0x4)
	float                                                        None;                                              // 0x518(0x4)
	bool                                                         None;                                              // 0x51c(0x1)
	char                                                         pad0x3_1JWKF[0x3];                                 // 0x51d(0x3)
	Struct Vector                                                None;                                              // 0x520(0xc)
	float                                                        None;                                              // 0x52c(0x4)
	float                                                        None;                                              // 0x530(0x4)
	float                                                        None;                                              // 0x534(0x4)
	float                                                        None;                                              // 0x538(0x4)
	bool                                                         None;                                              // 0x53c(0x1)
};


}