// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0 (Full Size[0x580] - InheritedSize[0x4e0]
class BP_FactionHourglass_C: public FactionVoteInteractionActor
{
public:
	class MaterialManipulationComponent*                         MaterialManipulation;                              // 0x4e0(0x8)
	class ExplosionComponent*                                    Explosion;                                         // 0x4e8(0x8)
	class FactionVoteAudioComponent*                             FactionVoteAudio;                                  // 0x4f0(0x8)
	class FactionInteractionVoteComponent*                       FactionInteractionVote;                            // 0x4f8(0x8)
	class StaticMeshComponent*                                   HourglassStand;                                    // 0x500(0x8)
	class FactionParticleComponent*                              ParticlesFactionG;                                 // 0x508(0x8)
	class FactionParticleComponent*                              ParticlesFactionB;                                 // 0x510(0x8)
	class FactionFlipMeshComponent*                              FactionFlipMesh;                                   // 0x518(0x8)
	class StaticMeshComponent*                                   FH_VoteIndicator4;                                 // 0x520(0x8)
	class StaticMeshComponent*                                   PL_VoteIndicator4;                                 // 0x528(0x8)
	class StaticMeshComponent*                                   FH_VoteIndicator3;                                 // 0x530(0x8)
	class StaticMeshComponent*                                   PL_VoteIndicator3;                                 // 0x538(0x8)
	class StaticMeshComponent*                                   FH_VoteIndicator2;                                 // 0x540(0x8)
	class StaticMeshComponent*                                   PL_VoteIndicator2;                                 // 0x548(0x8)
	class StaticMeshComponent*                                   FH_VoteIndicator1;                                 // 0x550(0x8)
	class StaticMeshComponent*                                   PL_VoteIndicator1;                                 // 0x558(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x560(0x8)
	class EmissaryActiveTableVisualiserComponent*                EmissaryActiveTableVisualiser;                     // 0x568(0x8)
	class StaticMeshVoteVisualiserComponent*                     StaticMeshVoteVisualiser;                          // 0x570(0x8)
	class ActionRulesComponent*                                  ActionRules;                                       // 0x578(0x8)
};


}