#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x108 (Full Size[0x7f0] - InheritedSize[0x6e8]
class BP_FactionEmissaryTable_Reapers_C: public BP_EmissaryTable_01_C
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x6e8(0x8)
	class StaticMeshComponent*                                   cap_desk_model_fac_shield_reaper_01_a;             // 0x6f0(0x8)
	class PointLightComponent*                                   PointLight2;                                       // 0x6f8(0x8)
	class PointLightComponent*                                   PointLight1;                                       // 0x700(0x8)
	class PointLightComponent*                                   PointLight;                                        // 0x708(0x8)
	class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x710(0x8)
	class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x718(0x8)
	class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x720(0x8)
	class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x728(0x8)
	class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x730(0x8)
	class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x738(0x8)
	class ParticleSystemComponent*                               ParticleSystem;                                    // 0x740(0x8)
	class StaticMeshComponent*                                   StaticMesh12;                                      // 0x748(0x8)
	class StaticMeshComponent*                                   StaticMesh11;                                      // 0x750(0x8)
	class StaticMeshComponent*                                   StaticMesh10;                                      // 0x758(0x8)
	class StaticMeshComponent*                                   StaticMesh9;                                       // 0x760(0x8)
	class StaticMeshComponent*                                   StaticMesh8;                                       // 0x768(0x8)
	class StaticMeshComponent*                                   StaticMesh7;                                       // 0x770(0x8)
	class StaticMeshComponent*                                   StaticMesh6;                                       // 0x778(0x8)
	class StaticMeshComponent*                                   StaticMesh5;                                       // 0x780(0x8)
	class StaticMeshComponent*                                   StaticMesh3;                                       // 0x788(0x8)
	class StaticMeshComponent*                                   StaticMesh2;                                       // 0x790(0x8)
	class StaticMeshComponent*                                   Hourglass;                                         // 0x798(0x8)
	class StaticMeshComponent*                                   HourglassStand;                                    // 0x7a0(0x8)
	class ChildActorComponent*                                   FactionVote;                                       // 0x7a8(0x8)
	class StaticMeshComponent*                                   StaticMesh1;                                       // 0x7b0(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x7b8(0x8)
	class StaticMeshComponent*                                   StaticMesh4;                                       // 0x7c0(0x8)
	class StaticMeshComponent*                                   cmp_papers_reaper_02_a;                            // 0x7c8(0x8)
	class StaticMeshComponent*                                   cmp_papers_reaper_01_a;                            // 0x7d0(0x8)
	class EmissaryShipAffiliationTrackerComponent*               EmissaryShipAffiliationTracker;                    // 0x7d8(0x8)
	class StaticMesh*                                            NewTableMesh;                                      // 0x7e0(0x8)
	class MaterialInstanceDynamic*                               HourglassGlassMaterial;                            // 0x7e8(0x8)
};


