// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0 (Full Size[0x0] - InheritedSize[0x0]
class BP_fod_Wrecker_05_MoonBurned_00_a_ItemDesc_C: public None
{
public:
	char                                                         pad0x6d8_ZPN4Q[0x6d8];                             // 0x0(0x6d8)
	Class HarpoonRenderComponent*                                HarpoonRenderComponent;                            // 0x6d8(0x8)
	Class SceneComponent*                                        MovementBase;                                      // 0x6e0(0x8)
	char                                                         pad0x18_8EEG4[0x18];                               // 0x6e8(0x18)
	struct FName                                                 TetherAttachSocketName;                            // 0x700(0x8)
	char                                                         pad0x8_JA7GN[0x8];                                 // 0x708(0x8)
	float                                                        DamageAmount;                                      // 0x710(0x4)
	byte                                                         ProjectileState;                                   // 0x714(0x1)
};


}