// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x120 (Full Size[0x5d0] - InheritedSize[0x4b0]
class BP_GhostShip_TornadoCloud_C: public BP_NonRotatableSignalCloud_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x4b0(0x8)
	Class StaticMeshComponent*                                   TopSwirl;                                          // 0x4b8(0x8)
	Class StaticMeshComponent*                                   Tendril08;                                         // 0x4c0(0x8)
	Class StaticMeshComponent*                                   Tendril07;                                         // 0x4c8(0x8)
	Class StaticMeshComponent*                                   Tendril06;                                         // 0x4d0(0x8)
	Class StaticMeshComponent*                                   Tendril05;                                         // 0x4d8(0x8)
	Class StaticMeshComponent*                                   Tendril04;                                         // 0x4e0(0x8)
	Class StaticMeshComponent*                                   Tendril03;                                         // 0x4e8(0x8)
	Class StaticMeshComponent*                                   Tendril02;                                         // 0x4f0(0x8)
	Class StaticMeshComponent*                                   Tendril01;                                         // 0x4f8(0x8)
	Class StaticMeshComponent*                                   OuterSwirls;                                       // 0x500(0x8)
	Class StaticMeshComponent*                                   TornadoMain;                                       // 0x508(0x8)
	Class StaticMeshComponent*                                   vfx_tornado_top_cloud;                             // 0x510(0x8)
	Class StaticMeshComponent*                                   Cloud;                                             // 0x518(0x8)
	Class StaticMeshComponent*                                   lightning_bolt_03_a;                               // 0x520(0x8)
	Class StaticMeshComponent*                                   lightning_bolt_02_a;                               // 0x528(0x8)
	Class StaticMeshComponent*                                   lightning_bolt_01_a;                               // 0x530(0x8)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0x538(0x10)
	Class MaterialInstanceDynamic*                               MainTornadoMat;                                    // 0x548(0x8)
	Class MaterialInstanceDynamic*                               OuterSwirlsMat;                                    // 0x550(0x8)
	Class MaterialInstanceDynamic*                               TopSwirlMat;                                       // 0x558(0x8)
	Class MaterialInstanceDynamic*                               CloudMat;                                          // 0x560(0x8)
	bool                                                         CachedShowLightning;                               // 0x568(0x1)
	char                                                         pad0x7_OD4FI[0x7];                                 // 0x569(0x7)
	Class CurveFloat*                                            CloudCurve;                                        // 0x570(0x8)
	Class MaterialInstanceDynamic*                               CloseGhostMat;                                     // 0x578(0x8)
	Class MaterialInstanceDynamic*                               GhostMat;                                          // 0x580(0x8)
	Class MaterialInstanceDynamic*                               Tendril_01;                                        // 0x588(0x8)
	Class MaterialInstanceDynamic*                               Tendril_02;                                        // 0x590(0x8)
	Class MaterialInstanceDynamic*                               Tendril_03;                                        // 0x598(0x8)
	Class MaterialInstanceDynamic*                               Tendril_04;                                        // 0x5a0(0x8)
	Class MaterialInstanceDynamic*                               Tendril_05;                                        // 0x5a8(0x8)
	Class MaterialInstanceDynamic*                               Tendril_06;                                        // 0x5b0(0x8)
	Class MaterialInstanceDynamic*                               Tendril_07;                                        // 0x5b8(0x8)
	Class MaterialInstanceDynamic*                               Tendril_08;                                        // 0x5c0(0x8)
	Class MaterialInstanceDynamic*                               CloudMat_Upper;                                    // 0x5c8(0x8)
};


}