// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x50 (Full Size[0x418] - InheritedSize[0x3c8]
class BP_GhostShips_MusicZoneActor_Base_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3c8(0x8)
	Class MusicZoneComponent*                                    PreEngageMusicZone;                                // 0x3d0(0x8)
	Class MusicZoneComponent*                                    EngagedMusicZone;                                  // 0x3d8(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x3e0(0x8)
	float                                                        EngagementTimer;                                   // 0x3e8(0x4)
	float                                                        MusicStopTimer;                                    // 0x3ec(0x4)
	struct FName                                                 EngagementSwitchGroup;                             // 0x3f0(0x8)
	struct FName                                                 EngagementSwitchEngaged;                           // 0x3f8(0x8)
	struct FName                                                 EngagementSwitchNotEngaged;                        // 0x400(0x8)
	struct FName                                                 InitialPlaySwitchGroup;                            // 0x408(0x8)
	struct FName                                                 InitialPlaySwitchInitial;                          // 0x410(0x8)
};


}