// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x120 (Full Size[0x650] - InheritedSize[0x530]
class BP_GhostShip_TornadoCloud_C: public None
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x530(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x538(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x540(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x548(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x550(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x558(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x560(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x568(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x570(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x578(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x580(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x588(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x590(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x598(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5b0(0x8)
	TArray<class MaterialInstanceDynamic*>                       None;                                              // 0x5b8(0x10)
	Class MaterialInstanceDynamic*                               None;                                              // 0x5c8(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x5d0(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x5d8(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x5e0(0x8)
	bool                                                         None;                                              // 0x5e8(0x1)
	char                                                         pad0x7_ZWIAF[0x7];                                 // 0x5e9(0x7)
	Class CurveFloat*                                            None;                                              // 0x5f0(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x5f8(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x600(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x608(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x610(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x618(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x620(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x628(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x630(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x638(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x640(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x648(0x8)
};


}