// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x70 (Full Size[0x438] - InheritedSize[0x3c8]
class BP_ghostship_candle_01_a_movable_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x3c8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x3d8(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_candle_looping_014;                     // 0x3e0(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_candle_looping_013;                     // 0x3e8(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_candle_looping_012;                     // 0x3f0(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_candle_looping_011;                     // 0x3f8(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_candle_looping_01;                      // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x428(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x430(0x8)
};


}