// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xac (Full Size[0x4ac] - InheritedSize[0x400]
class BP_GuildMastPlaque_C: public GuildPlaque
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x400(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   TextCanvasRenderTarget;                            // 0x408(0x8)
	Struct SlateFontInfo                                         Font;                                              // 0x410(0x40)
	Class MaterialInstanceDynamic*                               guildPlaqueMesh_MID;                               // 0x450(0x8)
	Class Material*                                              BevelMaterial;                                     // 0x458(0x8)
	Class MaterialInstanceDynamic*                               bevelMat_MID;                                      // 0x460(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   BevelCanvasRenderTarget;                           // 0x468(0x8)
	int                                                          CanvasWidth;                                       // 0x470(0x4)
	int                                                          CanvasHeight;                                      // 0x474(0x4)
	Class CanvasWorldMapComponent*                               Canvas;                                            // 0x478(0x8)
	TArray<Str guildRank>                                        guildRank;                                         // 0x480(0x10)
	float                                                        bevelIntensity;                                    // 0x490(0x4)
	int                                                          maxRank;                                           // 0x494(0x4)
	Class Texture*                                               guildIconInput;                                    // 0x498(0x8)
	Struct FeatureFlag                                           FeatureToggle;                                     // 0x4a0(0xc)
};


}