// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x460] - InheritedSize[0x420]
class BP_GhostShipRewardMarker_C: public ShortRangeMarker
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x420(0x8)
	Class ParticleSystemComponent*                               vfx_ghostShipRewardMarker;                         // 0x428(0x8)
	Class WwiseEmitterComponent*                                 WwiseEmitter;                                      // 0x430(0x8)
	Class StaticMeshComponent*                                   ghost_c;                                           // 0x438(0x8)
	Class StaticMeshComponent*                                   ghost_b;                                           // 0x440(0x8)
	Class StaticMeshComponent*                                   ghost_a;                                           // 0x448(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x450(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x458(0x8)
};


}