// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0 (Full Size[0x1f8] - InheritedSize[0x138]
class BP_GenericVoyageHintPromptCoordinator_Base_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x4c_RSTZD[0x4c];                               // 0x140(0x4c)
	bool                                                         PromptEvaluated;                                   // 0x140(0x1)
	char                                                         pad0x7_J8Q59[0x7];                                 // 0x141(0x7)
	class                                                        LocalPromptAccessKey;                              // 0x148(0x8)
	Struct ObjectMessagingHandle                                 OnVoyageHintPopupRequestedHandle;                  // 0x150(0x58)
	bool                                                         PopupRequestReceived;                              // 0x1a8(0x1)
	char                                                         pad0x7_NMVBH[0x7];                                 // 0x1a9(0x7)
	Struct RequestContextualVoyageHintPopupEvent                 CachedEvent;                                       // 0x1b0(0x18)
	byte                                                         HintType;                                          // 0x1c8(0x1)
	char                                                         pad0x7_45F0V[0x7];                                 // 0x1c9(0x7)
	Class VoyageTypeTutorialPrioritisedPromptsDataAsset*         CachedPrioritisedPromptsDataAsset;                 // 0x1d0(0x8)
	char                                                         pad0x20_AGMY4[0x20];                               // 0x1d8(0x20)
};


}