// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x110 (Full Size[0x5c0] - InheritedSize[0x4b0]
class BP_GhostShip_TornadoCloud_C: public None
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x4b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x500(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x508(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x510(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x518(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x520(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x528(0x8)
	TArray<class MaterialInstanceDynamic*>                       None;                                              // 0x530(0x10)
	Class MaterialInstanceDynamic*                               None;                                              // 0x540(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x548(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x550(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x558(0x8)
	bool                                                         None;                                              // 0x560(0x1)
	char                                                         pad0x7_6IFT9[0x7];                                 // 0x561(0x7)
	Class CurveFloat*                                            None;                                              // 0x568(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x570(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x578(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x580(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x588(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x590(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x598(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x5a0(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x5a8(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x5b0(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x5b8(0x8)
};


}