// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xac (Full Size[0x4ac] - InheritedSize[0x400]
class BP_GuildMastPlaque_C: public GuildPlaque
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x400(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   None;                                              // 0x408(0x8)
	Struct SlateFontInfo                                         None;                                              // 0x410(0x40)
	Class MaterialInstanceDynamic*                               None;                                              // 0x450(0x8)
	Class Material*                                              None;                                              // 0x458(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x460(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   None;                                              // 0x468(0x8)
	int                                                          None;                                              // 0x470(0x4)
	int                                                          None;                                              // 0x474(0x4)
	Class CanvasWorldMapComponent*                               None;                                              // 0x478(0x8)
	TArray<Str None>                                             None;                                              // 0x480(0x10)
	float                                                        None;                                              // 0x490(0x4)
	int                                                          None;                                              // 0x494(0x4)
	Class Texture*                                               None;                                              // 0x498(0x8)
	Struct FeatureFlag                                           None;                                              // 0x4a0(0xc)
};


}