// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x70 (Full Size[0x438] - InheritedSize[0x3c8]
class BP_ghostship_candle_01_a_movable_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3c8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x3e0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x3e8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x3f0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x3f8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x420(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	Class SceneComponent*                                        None;                                              // 0x430(0x8)
};


}