// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x3b8
class BP_gmp_pl_hf_emplacement_remains_C: public Actor
{
public:
	Class StaticMeshComponent*                                   bld_int_wall_rope_02_a;                            // 0x3c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh33;                                      // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh32;                                      // 0x3d8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem9;                                   // 0x3e0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem8;                                   // 0x3e8(0x8)
	Class PointLightComponent*                                   PointLight6;                                       // 0x3f0(0x8)
	Class PointLightComponent*                                   PointLight5;                                       // 0x3f8(0x8)
	Class StaticMeshComponent*                                   sod_bld_banner_03_a;                               // 0x400(0x8)
	Class DecalComponent*                                        Decal8;                                            // 0x408(0x8)
	Class DecalComponent*                                        Decal7;                                            // 0x410(0x8)
	Class DecalComponent*                                        Decal6;                                            // 0x418(0x8)
	Class DecalComponent*                                        Decal5;                                            // 0x420(0x8)
	Class DecalComponent*                                        Decal4;                                            // 0x428(0x8)
	Class DecalComponent*                                        Decal3;                                            // 0x430(0x8)
	Class DecalComponent*                                        Decal2;                                            // 0x438(0x8)
	Class DecalComponent*                                        Decal1;                                            // 0x440(0x8)
	Class DecalComponent*                                        Decal;                                             // 0x448(0x8)
	Class ParticleSystemComponent*                               ParticleSystem7;                                   // 0x450(0x8)
	Class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x458(0x8)
	Class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x460(0x8)
	Class SkeletalMeshComponent*                                 SkeletalMesh2;                                     // 0x468(0x8)
	Class ParticleSystemComponent*                               vfx_MIST_FORT_03_round_thin;                       // 0x470(0x8)
	Class StaticMeshComponent*                                   shp_gho_hatch_01_a;                                // 0x478(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x480(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x488(0x8)
	Class ParticleSystemComponent*                               vfx_mist_stairs_wide_tavern_of_damned;             // 0x490(0x8)
	Class ParticleSystemComponent*                               vfx_mist_single_hand_taver_of_damned;              // 0x498(0x8)
	Class PointLightComponent*                                   PointLight4;                                       // 0x4a0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x4a8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x4b0(0x8)
	Class PointLightComponent*                                   PointLight3;                                       // 0x4b8(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x4c0(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x4c8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x4d0(0x8)
	Class ParticleSystemComponent*                               vfx_fod_brazier_flame_no_smoke;                    // 0x4d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh31;                                      // 0x4e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh30;                                      // 0x4e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh29;                                      // 0x4f0(0x8)
	Class StaticMeshComponent*                                   shp_gho_lantern_01_a;                              // 0x4f8(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x500(0x8)
	Class StaticMeshComponent*                                   StaticMesh28;                                      // 0x508(0x8)
	Class SkeletalMeshComponent*                                 SkeletalMesh1;                                     // 0x510(0x8)
	Class SkeletalMeshComponent*                                 SkeletalMesh;                                      // 0x518(0x8)
	Class SkeletalMeshComponent*                                 AverageMalePirate_V3_fp;                           // 0x520(0x8)
	Class StaticMeshComponent*                                   StaticMesh37;                                      // 0x528(0x8)
	Class StaticMeshComponent*                                   StaticMesh26;                                      // 0x530(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_large_01_a;                          // 0x538(0x8)
	Class StaticMeshComponent*                                   StaticMesh25;                                      // 0x540(0x8)
	Class StaticMeshComponent*                                   StaticMesh24;                                      // 0x548(0x8)
	Class StaticMeshComponent*                                   StaticMesh23;                                      // 0x550(0x8)
	Class StaticMeshComponent*                                   StaticMesh18;                                      // 0x558(0x8)
	Class StaticMeshComponent*                                   sod_bld_floor_trim_03_a;                           // 0x560(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x568(0x8)
	Class StaticMeshComponent*                                   sod_bld_floor_trim_01_a;                           // 0x570(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x578(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_loose_01_a3;                         // 0x580(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_small_04_a3;                         // 0x588(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_loose_03_a;                          // 0x590(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_loose_02_a;                          // 0x598(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_loose_05_a5;                         // 0x5a0(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_loose_05_a4;                         // 0x5a8(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_small_01_a1;                         // 0x5b0(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_small_04_a2;                         // 0x5b8(0x8)
	Class StaticMeshComponent*                                   StaticMesh27;                                      // 0x5c0(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_large_03_a2;                         // 0x5c8(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_loose_01_a2;                         // 0x5d0(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_loose_05_a2;                         // 0x5d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x5e0(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_small_04_a;                          // 0x5e8(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_large_03_a;                          // 0x5f0(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_loose_01_a;                          // 0x5f8(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_loose_05_a;                          // 0x600(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x608(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x610(0x8)
	Class StaticMeshComponent*                                   sod_bld_support_01_a;                              // 0x618(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x620(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0168;                           // 0x628(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0167;                           // 0x630(0x8)
	Class StaticMeshComponent*                                   sod_bld_brick_loose_05_a3;                         // 0x638(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x640(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x648(0x8)
	Class StaticMeshComponent*                                   sod_bld_chains_01_a;                               // 0x650(0x8)
	Class StaticMeshComponent*                                   sod_bld_bollard_02_a;                              // 0x658(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x660(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x668(0x8)
	Class StaticMeshComponent*                                   act_vendor_banner_01_d;                            // 0x670(0x8)
	Class StaticMeshComponent*                                   rome_vendor_ship_hatchplanks;                      // 0x678(0x8)
	Class StaticMeshComponent*                                   act_vendor_banner_01_a;                            // 0x680(0x8)
	Class StaticMeshComponent*                                   StaticMesh14;                                      // 0x688(0x8)
	Class StaticMeshComponent*                                   StaticMesh13;                                      // 0x690(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_e;                           // 0x698(0x8)
	Class StaticMeshComponent*                                   StaticMesh19;                                      // 0x6a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh15;                                      // 0x6a8(0x8)
	Class StaticMeshComponent*                                   cmn_driftwood_01_a;                                // 0x6b0(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_01_a;                            // 0x6b8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_racks_01_a;                            // 0x6c0(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x6c8(0x8)
	Class StaticMeshComponent*                                   cmn_wrecked_wheelbarrow_01_a;                      // 0x6d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh17;                                      // 0x6d8(0x8)
	Class StaticMeshComponent*                                   sod_cmn_cloth_floor_02_a;                          // 0x6e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh22;                                      // 0x6e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh20;                                      // 0x6f0(0x8)
	Class StaticMeshComponent*                                   cmn_looted__box_02_lid;                            // 0x6f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh21;                                      // 0x700(0x8)
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x708(0x8)
	Class StaticMeshComponent*                                   cmn_looted__box_02_b;                              // 0x710(0x8)
	Class StaticMeshComponent*                                   cmn_man_cage_01_e;                                 // 0x718(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_base_01_a;                             // 0x720(0x8)
	Class StaticMeshComponent*                                   cmn_wood_planks_a;                                 // 0x728(0x8)
	Class StaticMeshComponent*                                   cmn_looted__box_02_a;                              // 0x730(0x8)
	Class StaticMeshComponent*                                   cmn_looted__box_02_d;                              // 0x738(0x8)
	Class StaticMeshComponent*                                   cmn_bird_cage_01_a;                                // 0x740(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_b;                           // 0x748(0x8)
	Class MergedStaticMeshComponent*                             MergedStaticMesh;                                  // 0x750(0x8)
	Class StaticMeshComponent*                                   _Cube;                                             // 0x758(0x8)
	Class StaticMeshComponent*                                   gmp_pl_hf_emplacement_base_wall_a_01_WIP;          // 0x760(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0169;                           // 0x768(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent030;                            // 0x770(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x778(0x8)
};


// Size 0x1b8
class BP_gmp_pl_hf_emplacement_nature_WIP_C: public Actor
{
public:
	Class StaticMeshComponent*                                   wsp_undersea_sm_01_a;                              // 0x3c8(0x8)
	Class StaticMeshComponent*                                   wsp_undersea_md_01_a;                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   sod_rock_xlarge_01_b;                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   sod_rock_xlarge_01_b1;                             // 0x3e0(0x8)
	Class StaticMeshComponent*                                   sod_rock_xlarge_02_c;                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh23;                                      // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x408(0x8)
	Class StaticMeshComponent*                                   sod_cavern_wall_mid_sml_rock_01_c2;                // 0x410(0x8)
	Class StaticMeshComponent*                                   sod_cavern_wall_mid_sml_rock_01_a;                 // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh22;                                      // 0x420(0x8)
	Class StaticMeshComponent*                                   sod_cavern_wall_mid_sml_rock_01_c1;                // 0x428(0x8)
	Class StaticMeshComponent*                                   sod_cavern_wall_mid_sml_rock_01_c;                 // 0x430(0x8)
	Class StaticMeshComponent*                                   sod_cavern_wall_mid_med_rock_01_c3;                // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh21;                                      // 0x440(0x8)
	Class StaticMeshComponent*                                   sod_cavern_wall_mid_sml_rock_01_b;                 // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMesh20;                                      // 0x450(0x8)
	Class StaticMeshComponent*                                   sod_cavern_wall_mid_med_rock_01_c2;                // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMesh19;                                      // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMesh18;                                      // 0x468(0x8)
	Class StaticMeshComponent*                                   sod_cavern_wall_mid_med_rock_01_b;                 // 0x470(0x8)
	Class StaticMeshComponent*                                   sod_cavern_wall_mid_med_rock_01_c;                 // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMesh17;                                      // 0x480(0x8)
	Class StaticMeshComponent*                                   SOD_cavern_wall_mid_rock_03;                       // 0x488(0x8)
	Class StaticMeshComponent*                                   SOD_cave_tun_wall_e;                               // 0x490(0x8)
	Class StaticMeshComponent*                                   SOD_cave_tun_wall_f;                               // 0x498(0x8)
	Class StaticMeshComponent*                                   StaticMesh15;                                      // 0x4a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh14;                                      // 0x4a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh13;                                      // 0x4b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh24;                                      // 0x4b8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0172;                           // 0x4c0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent041;                            // 0x4c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent040;                            // 0x4d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent026;                            // 0x4d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent025;                            // 0x4e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0x4e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent021;                            // 0x4f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent020;                            // 0x4f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0x500(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0x508(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x510(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x518(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x520(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x528(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x530(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x538(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x540(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x548(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x550(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x558(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x560(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x568(0x8)
	Class MergedStaticMeshComponent*                             MergedStaticMesh;                                  // 0x570(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x578(0x8)
};


}