// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0 (Full Size[0x1f8] - InheritedSize[0x138]
class BP_GenericVoyageHintPromptCoordinator_Base_C: public BP_PromptCoordinator_Base_C
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x6f_6QCWS[0x6f];                               // 0x140(0x6f)
	bool                                                         PromptEvaluated;                                   // 0x140(0x1)
	char                                                         pad0x7_AHY06[0x7];                                 // 0x141(0x7)
	class UClass*                                                LocalPromptAccessKey;                              // 0x148(0x8)
	struct ObjectMessagingHandle                                 OnVoyageHintPopupRequestedHandle;                  // 0x150(0x58)
	bool                                                         PopupRequestReceived;                              // 0x1a8(0x1)
	char                                                         pad0x7_S778H[0x7];                                 // 0x1a9(0x7)
	struct RequestContextualVoyageHintPopupEvent                 CachedEvent;                                       // 0x1b0(0x18)
	byte                                                         HintType;                                          // 0x1c8(0x1)
	char                                                         pad0x7_68LGQ[0x7];                                 // 0x1c9(0x7)
	class VoyageTypeTutorialPrioritisedPromptsDataAsset*         CachedPrioritisedPromptsDataAsset;                 // 0x1d0(0x8)
	char                                                         pad0x20_QGJNM[0x20];                               // 0x1d8(0x20)
};


}