// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x120 (Full Size[0x650] - InheritedSize[0x530]
class BP_GhostShip_TornadoCloud_C: public BP_NonRotatableSignalCloud_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x530(0x8)
	Class StaticMeshComponent*                                   TopSwirl;                                          // 0x538(0x8)
	Class StaticMeshComponent*                                   Tendril08;                                         // 0x540(0x8)
	Class StaticMeshComponent*                                   Tendril07;                                         // 0x548(0x8)
	Class StaticMeshComponent*                                   Tendril06;                                         // 0x550(0x8)
	Class StaticMeshComponent*                                   Tendril05;                                         // 0x558(0x8)
	Class StaticMeshComponent*                                   Tendril04;                                         // 0x560(0x8)
	Class StaticMeshComponent*                                   Tendril03;                                         // 0x568(0x8)
	Class StaticMeshComponent*                                   Tendril02;                                         // 0x570(0x8)
	Class StaticMeshComponent*                                   Tendril01;                                         // 0x578(0x8)
	Class StaticMeshComponent*                                   OuterSwirls;                                       // 0x580(0x8)
	Class StaticMeshComponent*                                   TornadoMain;                                       // 0x588(0x8)
	Class StaticMeshComponent*                                   vfx_tornado_top_cloud;                             // 0x590(0x8)
	Class StaticMeshComponent*                                   Cloud;                                             // 0x598(0x8)
	Class StaticMeshComponent*                                   lightning_bolt_03_a;                               // 0x5a0(0x8)
	Class StaticMeshComponent*                                   lightning_bolt_02_a;                               // 0x5a8(0x8)
	Class StaticMeshComponent*                                   lightning_bolt_01_a;                               // 0x5b0(0x8)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0x5b8(0x10)
	Class MaterialInstanceDynamic*                               MainTornadoMat;                                    // 0x5c8(0x8)
	Class MaterialInstanceDynamic*                               OuterSwirlsMat;                                    // 0x5d0(0x8)
	Class MaterialInstanceDynamic*                               TopSwirlMat;                                       // 0x5d8(0x8)
	Class MaterialInstanceDynamic*                               CloudMat;                                          // 0x5e0(0x8)
	bool                                                         CachedShowLightning;                               // 0x5e8(0x1)
	char                                                         pad0x7_ESMQJ[0x7];                                 // 0x5e9(0x7)
	Class CurveFloat*                                            CloudCurve;                                        // 0x5f0(0x8)
	Class MaterialInstanceDynamic*                               CloseGhostMat;                                     // 0x5f8(0x8)
	Class MaterialInstanceDynamic*                               GhostMat;                                          // 0x600(0x8)
	Class MaterialInstanceDynamic*                               Tendril_01;                                        // 0x608(0x8)
	Class MaterialInstanceDynamic*                               Tendril_02;                                        // 0x610(0x8)
	Class MaterialInstanceDynamic*                               Tendril_03;                                        // 0x618(0x8)
	Class MaterialInstanceDynamic*                               Tendril_04;                                        // 0x620(0x8)
	Class MaterialInstanceDynamic*                               Tendril_05;                                        // 0x628(0x8)
	Class MaterialInstanceDynamic*                               Tendril_06;                                        // 0x630(0x8)
	Class MaterialInstanceDynamic*                               Tendril_07;                                        // 0x638(0x8)
	Class MaterialInstanceDynamic*                               Tendril_08;                                        // 0x640(0x8)
	Class MaterialInstanceDynamic*                               CloudMat_Upper;                                    // 0x648(0x8)
};


}