// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48 (Full Size[0x410] - InheritedSize[0x3c8]
class BP_GH_GoldenSands_Sovereign_AudioLayer_C: public Actor
{
public:
	Class TritonComponent*                                       Triton;                                            // 0x3c8(0x8)
	Class AudioPortalComponent*                                  AudioPortal_06;                                    // 0x3d0(0x8)
	Class AudioPortalComponent*                                  AudioPortal_05;                                    // 0x3d8(0x8)
	Class AudioPortalComponent*                                  AudioPortal_04;                                    // 0x3e0(0x8)
	Class AudioPortalComponent*                                  AudioPortal_03;                                    // 0x3e8(0x8)
	Class AudioPortalComponent*                                  AudioPortal_02;                                    // 0x3f0(0x8)
	Class AudioPortalComponent*                                  AudioPortal_01;                                    // 0x3f8(0x8)
	Class AudioSpaceComponent*                                   AudioSpace;                                        // 0x400(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x408(0x8)
};


}