// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60 (Full Size[0x428] - InheritedSize[0x3c8]
class BP_ghost_ship_scene_C: public Actor
{
public:
	struct PointerToUberGraphFrame                               None;                                              // 0x3c8(0x8)
	class WwiseEmitterComponent*                                 None;                                              // 0x3d0(0x8)
	class SceneComponent*                                        None;                                              // 0x3d8(0x8)
	TArray<class MaterialInstanceDynamic*>                       None;                                              // 0x3e0(0x10)
	struct FName                                                 None;                                              // 0x3f0(0x8)
	TArray<class MeshComponent*>                                 None;                                              // 0x3f8(0x10)
	bool                                                         None;                                              // 0x408(0x1)
	char                                                         pad0x7_J0HK7[0x7];                                 // 0x409(0x7)
	TArray<class ParticleSystemComponent*>                       None;                                              // 0x410(0x10)
	float                                                        None;                                              // 0x420(0x4)
	float                                                        None;                                              // 0x424(0x4)
};


}