#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x240 (Full Size[0x738] - InheritedSize[0x4f8]
class BP_GuildMastPlaque_C: public GuildPlaque
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x4f8(0x8)
	struct SlateFontInfo                                         Font;                                              // 0x500(0x40)
	class MaterialInstanceDynamic*                               GuildPlaque_MID;                                   // 0x540(0x8)
	class Material*                                              Bevel_Material;                                    // 0x548(0x8)
	int                                                          TextCanvasWidth;                                   // 0x550(0x4)
	int                                                          TextCanvasHeight;                                  // 0x554(0x4)
	class CanvasWorldMapComponent*                               Canvas;                                            // 0x558(0x8)
	TArray<String>                                               guildRank;                                         // 0x560(0x10)
	float                                                        bevelIntensity;                                    // 0x570(0x4)
	struct FeatureFlag                                           FeatureToggle;                                     // 0x574(0xc)
	class MaterialInstanceDynamic*                               TextBevel_MID;                                     // 0x640(0x8)
	class MaterialInstanceDynamic*                               IconBevel_MID;                                     // 0x648(0x8)
	class MaterialInstanceDynamic*                               RankBevel_MID;                                     // 0x650(0x8)
	class MaybeCompressedCanvasRenderTarget2D*                   RankRenderTarget;                                  // 0x658(0x8)
	class MaybeCompressedCanvasRenderTarget2D*                   TextRenderTarget;                                  // 0x660(0x8)
	int                                                          RankTextWidth;                                     // 0x668(0x4)
	int                                                          RankTextHeight;                                    // 0x66c(0x4)
	class MaybeCompressedCanvasRenderTarget2D*                   BevelTextRenderTarget;                             // 0x670(0x8)
	class MaybeCompressedCanvasRenderTarget2D*                   IconRenderTarget;                                  // 0x678(0x8)
	class MaybeCompressedCanvasRenderTarget2D*                   BevelRankRenderTarget;                             // 0x680(0x8)
	class MaybeCompressedCanvasRenderTarget2D*                   BevelIconRenderTarget;                             // 0x688(0x8)
	struct LinearColor                                           Gold Colour;                                       // 0x690(0x10)
	struct LinearColor                                           Silver Colour;                                     // 0x6a0(0x10)
	struct LinearColor                                           Bronze Colour;                                     // 0x6b0(0x10)
	struct LinearColor                                           TextColour;                                        // 0x6c0(0x10)
	bool                                                         IconColourFollowsMedallion;                        // 0x6d0(0x1)
	char                                                         pad0x7_Y7D7R[0x7];                                 // 0x6d1(0x7)
	char                                                         pad0x60_O6W7Z[0x60];                               // 0x6d8(0x60)
};


