// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size -0x1 (Full Size[-0x1] - InheritedSize[0x0]
class BP_GildedCrown_TallTales_C: public HarpoonRenderComponent
{
public:
	char                                                         pad0x6d8_TI1DJ[0x6d8];                             // 0x0(0x6d8)
	Class HarpoonRenderComponent*                                HarpoonRenderComponent;                            // 0x6d8(0x8)
	Class SceneComponent*                                        MovementBase;                                      // 0x6e0(0x8)
	char                                                         pad0x18_9744G[0x18];                               // 0x6e8(0x18)
	struct FName                                                 TetherAttachSocketName;                            // 0x700(0x8)
	char                                                         pad0x8_SWYD0[0x8];                                 // 0x708(0x8)
	float                                                        DamageAmount;                                      // 0x710(0x4)
	byte                                                         ProjectileState;                                   // 0x714(0x1)
};


}