#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x88 (Full Size[0x6b0] - InheritedSize[0x628]
class BP_HullDamage_C: public HullDamage
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x628(0x8)
	class HitReactionComponent*                                  HitReaction;                                       // 0x630(0x8)
	class BakedDecalComponent*                                   ImpactDecalComponent;                              // 0x638(0x8)
	TArray<class Texture2D*>                                     Persistent Damage Decals;                          // 0x640(0x10)
	class ParticleSystem*                                        Damage VFX;                                        // 0x650(0x8)
	TArray<class MaterialInstance*>                              Deferred Damage Decals;                            // 0x658(0x10)
	float                                                        Deferred Min Size;                                 // 0x668(0x4)
	float                                                        Deferred Max Size;                                 // 0x66c(0x4)
	float                                                        Persistent Min Size;                               // 0x670(0x4)
	float                                                        Persistent Max Size;                               // 0x674(0x4)
	struct RandomStream                                          RandomDecalStream;                                 // 0x678(0x8)
	float                                                        TEST_HitStrength;                                  // 0x680(0x4)
	float                                                        TEST_PenetrationThreshold;                         // 0x684(0x4)
	class Ship*                                                  ParentShip;                                        // 0x688(0x8)
	struct WwiseEmitter                                          CannonballHitEmitter;                              // 0x690(0x20)
};


