// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x218
class bp_halloweenDressing_wld_outpost_1_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x3c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x400(0x8)
	Class StaticMeshComponent*                                   sod_cobweb_03_c;                                   // 0x408(0x8)
	Class StaticMeshComponent*                                   sod_cobweb_03_b1;                                  // 0x410(0x8)
	Class StaticMeshComponent*                                   sod_cobweb_03_b;                                   // 0x418(0x8)
	Class StaticMeshComponent*                                   sod_cobweb_03_a1;                                  // 0x420(0x8)
	Class StaticMeshComponent*                                   sod_cobweb_03_a;                                   // 0x428(0x8)
	Class StaticMeshComponent*                                   sod_cobweb_02_c1;                                  // 0x430(0x8)
	Class StaticMeshComponent*                                   sod_cobweb_02_c;                                   // 0x438(0x8)
	Class StaticMeshComponent*                                   sod_cobweb_02_a;                                   // 0x440(0x8)
	Class StaticMeshComponent*                                   sod_cobweb_01_b1;                                  // 0x448(0x8)
	Class StaticMeshComponent*                                   sod_cobweb_01_b;                                   // 0x450(0x8)
	Class StaticMeshComponent*                                   sod_cobweb_01_a1;                                  // 0x458(0x8)
	Class StaticMeshComponent*                                   sod_cobweb_01_a;                                   // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent045;                            // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent044;                            // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent043;                            // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent042;                            // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent041;                            // 0x488(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent040;                            // 0x490(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent039;                            // 0x498(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent038;                            // 0x4a0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent037;                            // 0x4a8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent036;                            // 0x4b0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent035;                            // 0x4b8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent034;                            // 0x4c0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent033;                            // 0x4c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent032;                            // 0x4d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent031;                            // 0x4d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent030;                            // 0x4e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent029;                            // 0x4e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent028;                            // 0x4f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent027;                            // 0x4f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent026;                            // 0x500(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent025;                            // 0x508(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent024;                            // 0x510(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent023;                            // 0x518(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent046;                            // 0x520(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent021;                            // 0x528(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent020;                            // 0x530(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0x538(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0x540(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x548(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x550(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x558(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x560(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x568(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x570(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x578(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x580(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x588(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x590(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x598(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x5a0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x5a8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x5b0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x5b8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x5c0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0x5c8(0x8)
	Class StaticMeshComponent*                                   Origin;                                            // 0x5d0(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x5d8(0x8)
};


}