// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x88 (Full Size[0x658] - InheritedSize[0x5d0]
class BP_HullDamage_C: public HullDamage
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x5d0(0x8)
	Class HitReactionComponent*                                  None;                                              // 0x5d8(0x8)
	Class BakedDecalComponent*                                   None;                                              // 0x5e0(0x8)
	TArray<class Texture2D*>                                     None;                                              // 0x5e8(0x10)
	Class ParticleSystem*                                        None;                                              // 0x5f8(0x8)
	TArray<class MaterialInstance*>                              None;                                              // 0x600(0x10)
	float                                                        None;                                              // 0x610(0x4)
	float                                                        None;                                              // 0x614(0x4)
	float                                                        None;                                              // 0x618(0x4)
	float                                                        None;                                              // 0x61c(0x4)
	Struct RandomStream                                          None;                                              // 0x620(0x8)
	float                                                        None;                                              // 0x628(0x4)
	float                                                        None;                                              // 0x62c(0x4)
	Class Ship*                                                  None;                                              // 0x630(0x8)
	Struct WwiseEmitter                                          None;                                              // 0x638(0x20)
};


}