// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x88 (Full Size[0x638] - InheritedSize[0x5b0]
class BP_HullDamage_C: public HullDamage
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x5b0(0x8)
	Class HitReactionComponent*                                  None;                                              // 0x5b8(0x8)
	Class BakedDecalComponent*                                   None;                                              // 0x5c0(0x8)
	TArray<class Texture2D*>                                     None;                                              // 0x5c8(0x10)
	Class ParticleSystem*                                        None;                                              // 0x5d8(0x8)
	TArray<class MaterialInstance*>                              None;                                              // 0x5e0(0x10)
	float                                                        None;                                              // 0x5f0(0x4)
	float                                                        None;                                              // 0x5f4(0x4)
	float                                                        None;                                              // 0x5f8(0x4)
	float                                                        None;                                              // 0x5fc(0x4)
	Struct RandomStream                                          None;                                              // 0x600(0x8)
	float                                                        None;                                              // 0x608(0x4)
	float                                                        None;                                              // 0x60c(0x4)
	Class Ship*                                                  None;                                              // 0x610(0x8)
	Struct WwiseEmitter                                          None;                                              // 0x618(0x20)
};


}