// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size -0x1 (Full Size[-0x1] - InheritedSize[0x0]
class BP_HurdyGurdy_C: public WaterInteraction
{
public:
	char                                                         pad0x5a8_AVZ71[0x5a8];                             // 0x0(0x5a8)
	Class WaterInteractionComponent*                             WaterInteractionComponent;                         // 0x5a8(0x8)
	Class BuoyancyComponent*                                     BuoyancyComponent;                                 // 0x5b0(0x8)
	char                                                         pad0x1_UK0OE[0x1];                                 // 0x5b8(0x1)
	byte                                                         CachedProxySurfaceType;                            // 0x5b9(0x1)
	bool                                                         CachedOnTopOfExistingBuriable;                     // 0x5ba(0x1)
	bool                                                         DroppedInDeepWater;                                // 0x5bb(0x1)
	char                                                         pad0x4_TCF8R[0x4];                                 // 0x5bc(0x4)
	Class ItemInfo*                                              ItemInfo;                                          // 0x5c0(0x8)
	char                                                         pad0x5c_Z99GJ[0x5c];                               // 0x5c8(0x5c)
	float                                                        TTLPlayerProximityCutoff;                          // 0x624(0x4)
	float                                                        TTLRecheckPeriod;                                  // 0x628(0x4)
};


}