// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x71 (Full Size[0x779] - InheritedSize[0x708]
class BP_InteractableShipRailingLight_C: public ShipInteractableLight
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x708(0x8)
	Class InteractableComponent*                                 None;                                              // 0x710(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x718(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x720(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x728(0x8)
	struct FName                                                 None;                                              // 0x730(0x8)
	struct FName                                                 None;                                              // 0x738(0x8)
	float                                                        None;                                              // 0x740(0x4)
	float                                                        None;                                              // 0x744(0x4)
	bool                                                         None;                                              // 0x748(0x1)
	char                                                         pad0x7_M8X5T[0x7];                                 // 0x749(0x7)
	Class MaterialInstanceDynamic*                               None;                                              // 0x750(0x8)
	struct FName                                                 None;                                              // 0x758(0x8)
	float                                                        None;                                              // 0x760(0x4)
	float                                                        None;                                              // 0x764(0x4)
	Struct LinearColor                                           None;                                              // 0x768(0x10)
	byte                                                         None;                                              // 0x778(0x1)
};


}