// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68 (Full Size[0x718] - InheritedSize[0x6b0]
class BP_Innkeeper_C: public NPC
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x6b0(0x8)
	Class NamedNPCComponent*                                     None;                                              // 0x6b8(0x8)
	Class CargoRunParticipantComponent*                          None;                                              // 0x6c0(0x8)
	Class CapsuleComponent*                                      None;                                              // 0x6c8(0x8)
	Class NPCDialogComponent*                                    None;                                              // 0x6d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6d8(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       None;                                              // 0x6e0(0x8)
	Class WwiseEvent*                                            None;                                              // 0x6e8(0x8)
	Class WwiseEvent*                                            None;                                              // 0x6f0(0x8)
	Struct WwiseEmitter                                          None;                                              // 0x6f8(0x20)
};


}