#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x58 (Full Size[0x3f8] - InheritedSize[0x3a0]
class BP_ItemPreview_Lighting_C: public Actor
{
public:
	class ExponentialHeightFogComponent*                         ExponentialHeightFog;                              // 0x3a0(0x8)
	class SkyLightComponent*                                     SkyLight;                                          // 0x3a8(0x8)
	class SpotLightComponent*                                    SpotLight2;                                        // 0x3b0(0x8)
	class SpotLightComponent*                                    SpotLight1;                                        // 0x3b8(0x8)
	class SpotLightComponent*                                    SpotLight;                                         // 0x3c0(0x8)
	class PostProcessComponent*                                  PostProcess;                                       // 0x3c8(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x3d0(0x8)
	char                                                         pad0x20_6DY8B[0x20];                               // 0x3d8(0x20)
};


