// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x70 (Full Size[0x740] - InheritedSize[0x6d0]
class BP_Innkeeper_C: public NPC
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x6d0(0x8)
	class CameraComponent*                                       NPCDialogCamera;                                   // 0x6d8(0x8)
	class NamedNPCComponent*                                     NamedNPC;                                          // 0x6e0(0x8)
	class CargoRunParticipantComponent*                          CargoRunParticipant;                               // 0x6e8(0x8)
	class CapsuleComponent*                                      SolidHits;                                         // 0x6f0(0x8)
	class NPCDialogComponent*                                    NPCDialog;                                         // 0x6f8(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x700(0x8)
	class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x708(0x8)
	class WwiseEvent*                                            SFX_IdleLoopPlay;                                  // 0x710(0x8)
	class WwiseEvent*                                            SFX_IdleLoopStop;                                  // 0x718(0x8)
	struct WwiseEmitter                                          InnkeeperEmitter;                                  // 0x720(0x20)
};


}