// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x58 (Full Size[0x420] - InheritedSize[0x3c8]
class BP_ItemPreview_Lighting_C: public Actor
{
public:
	class ExponentialHeightFogComponent*                         ExponentialHeightFog;                              // 0x3c8(0x8)
	class SkyLightComponent*                                     SkyLight;                                          // 0x3d0(0x8)
	class SpotLightComponent*                                    SpotLight2;                                        // 0x3d8(0x8)
	class SpotLightComponent*                                    SpotLight1;                                        // 0x3e0(0x8)
	class SpotLightComponent*                                    SpotLight;                                         // 0x3e8(0x8)
	class PostProcessComponent*                                  PostProcess;                                       // 0x3f0(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x3f8(0x8)
	char                                                         pad0x20_LBFZ7[0x20];                               // 0x400(0x20)
};


}