#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x90 (Full Size[0x610] - InheritedSize[0x580]
class BP_ItemPreview_C: public ItemPreviewActor
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x580(0x8)
	class ArrowComponent*                                        Camera_Dog;                                        // 0x588(0x8)
	class ArrowComponent*                                        Camera_Far;                                        // 0x590(0x8)
	class ArrowComponent*                                        Camera_Mid;                                        // 0x598(0x8)
	class ArrowComponent*                                        Camera_Near;                                       // 0x5a0(0x8)
	class BillboardComponent*                                    IconBillboard;                                     // 0x5a8(0x8)
	class ArrowComponent*                                        Camera_Default;                                    // 0x5b0(0x8)
	class ChildActorComponent*                                   ChildActor;                                        // 0x5b8(0x8)
	class SkeletalMeshComponent*                                 HiddenDftMesh;                                     // 0x5c0(0x8)
	class SkeletalMeshComponent*                                 ItemMesh;                                          // 0x5c8(0x8)
	class CameraComponent*                                       Camera;                                            // 0x5d0(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x5d8(0x8)
	char                                                         pad0x30_K8LH5[0x30];                               // 0x5e0(0x30)
};


