// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x3f50e669 (Full Size[0x3f50e669] - InheritedSize[0x0]
class BP_ItemPreview_C: public None
{
public:
	char                                                         pad0x5a8_2IK7Q[0x5a8];                             // 0x0(0x5a8)
	Struct PointerToUberGraphFrame                               None;                                              // 0x5a8(0x8)
	Class ArrowComponent*                                        None;                                              // 0x5b0(0x8)
	Class ArrowComponent*                                        None;                                              // 0x5b8(0x8)
	Class ArrowComponent*                                        None;                                              // 0x5c0(0x8)
	Class ArrowComponent*                                        None;                                              // 0x5c8(0x8)
	Class BillboardComponent*                                    None;                                              // 0x5d0(0x8)
	Class ArrowComponent*                                        None;                                              // 0x5d8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x5e0(0x8)
	Class SkeletalMeshComponent*                                 None;                                              // 0x5e8(0x8)
	Class SkeletalMeshComponent*                                 None;                                              // 0x5f0(0x8)
	Class CameraComponent*                                       None;                                              // 0x5f8(0x8)
	Class SceneComponent*                                        None;                                              // 0x600(0x8)
	char                                                         pad0x3f50e061_75CC6[0x3f50e061];                   // 0x608(0x3f50e061)
};


}