// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x71 (Full Size[0x779] - InheritedSize[0x708]
class BP_InteractableShipRailingLight_C: public ShipInteractableLight
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x708(0x8)
	class InteractableComponent*                                 Interactable;                                      // 0x710(0x8)
	class StaticMeshComponent*                                   LanternGlow;                                       // 0x718(0x8)
	class StaticMeshComponent*                                   Light;                                             // 0x720(0x8)
	class MaterialInstanceDynamic*                               DynamicGlowMaterial;                               // 0x728(0x8)
	struct FName                                                 GlowBrightnessParameterName;                       // 0x730(0x8)
	struct FName                                                 GlowRandomSeedParameterName;                       // 0x738(0x8)
	float                                                        GlowIntensityOn;                                   // 0x740(0x4)
	float                                                        GlowIntensityOff;                                  // 0x744(0x4)
	bool                                                         UsesGlow;                                          // 0x748(0x1)
	char                                                         pad0x7_Y8ETL[0x7];                                 // 0x749(0x7)
	class MaterialInstanceDynamic*                               DynamicMaterial;                                   // 0x750(0x8)
	struct FName                                                 FlameParameterName;                                // 0x758(0x8)
	float                                                        FlameIntensityOn;                                  // 0x760(0x4)
	float                                                        FlameIntensityOff;                                 // 0x764(0x4)
	struct LinearColor                                           DefaultGlowColour;                                 // 0x768(0x10)
	byte                                                         CurrentFlameOfFateType;                            // 0x778(0x1)
};


}