// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60 (Full Size[0x6f0] - InheritedSize[0x690]
class BP_Innkeeper_C: public NPC
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x690(0x8)
	Class CargoRunParticipantComponent*                          None;                                              // 0x698(0x8)
	Class CapsuleComponent*                                      None;                                              // 0x6a0(0x8)
	Class NPCDialogComponent*                                    None;                                              // 0x6a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6b0(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       None;                                              // 0x6b8(0x8)
	Class WwiseEvent*                                            None;                                              // 0x6c0(0x8)
	Class WwiseEvent*                                            None;                                              // 0x6c8(0x8)
	Struct WwiseEmitter                                          None;                                              // 0x6d0(0x20)
};


}