// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x75 (Full Size[0x74d] - InheritedSize[0x6d8]
class BP_InteractableShipLantern_C: public ShipInteractableLight
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x6d8(0x8)
	Class InteractableComponent*                                 None;                                              // 0x6e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6f8(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x700(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x708(0x8)
	struct FName                                                 None;                                              // 0x710(0x8)
	struct FName                                                 None;                                              // 0x718(0x8)
	struct FName                                                 None;                                              // 0x720(0x8)
	float                                                        None;                                              // 0x728(0x4)
	float                                                        None;                                              // 0x72c(0x4)
	float                                                        None;                                              // 0x730(0x4)
	float                                                        None;                                              // 0x734(0x4)
	bool                                                         None;                                              // 0x738(0x1)
	char                                                         pad0x3_DITQ5[0x3];                                 // 0x739(0x3)
	Struct LinearColor                                           None;                                              // 0x73c(0x10)
	byte                                                         None;                                              // 0x74c(0x1)
};


}