// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x75 (Full Size[0x77d] - InheritedSize[0x708]
class BP_InteractableShipLantern_C: public ShipInteractableLight
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x708(0x8)
	Class InteractableComponent*                                 Interactable;                                      // 0x710(0x8)
	Class StaticMeshComponent*                                   LanternGlow;                                       // 0x718(0x8)
	Class StaticMeshComponent*                                   Lantern;                                           // 0x720(0x8)
	Class StaticMeshComponent*                                   Hook;                                              // 0x728(0x8)
	Class MaterialInstanceDynamic*                               DynamicMaterial;                                   // 0x730(0x8)
	Class MaterialInstanceDynamic*                               DynamicGlowMaterial;                               // 0x738(0x8)
	struct FName                                                 FlameParameterName;                                // 0x740(0x8)
	struct FName                                                 GlowBrightnessParameterName;                       // 0x748(0x8)
	struct FName                                                 GlowRandomSeedParameterName;                       // 0x750(0x8)
	float                                                        FlameIntensityOn;                                  // 0x758(0x4)
	float                                                        FlameIntensityOff;                                 // 0x75c(0x4)
	float                                                        GlowIntensityOn;                                   // 0x760(0x4)
	float                                                        GlowIntensityOff;                                  // 0x764(0x4)
	bool                                                         Uses Glow;                                         // 0x768(0x1)
	char                                                         pad0x3_WX1TL[0x3];                                 // 0x769(0x3)
	Struct LinearColor                                           DefaultGlowColour;                                 // 0x76c(0x10)
	byte                                                         CurrentFlameOFateType;                             // 0x77c(0x1)
};


}