#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x80 (Full Size[0x448] - InheritedSize[0x3c8]
class BP_LargeShipLanterns_C: public Actor
{
public:
	class ChildActorComponent*                                   Railing_BowRightBack;                              // 0x3c8(0x8)
	class ChildActorComponent*                                   Railing_BowLeftBack;                               // 0x3d0(0x8)
	class ChildActorComponent*                                   Railing_Stern;                                     // 0x3d8(0x8)
	class ChildActorComponent*                                   Cabin_Lantern;                                     // 0x3e0(0x8)
	class ChildActorComponent*                                   BrigDeck_StairsRight;                              // 0x3e8(0x8)
	class ChildActorComponent*                                   BrigDeck_StairsLeft;                               // 0x3f0(0x8)
	class ChildActorComponent*                                   BrigDeck_OutsideBrig;                              // 0x3f8(0x8)
	class ChildActorComponent*                                   BrigDeck_InsideBrig;                               // 0x400(0x8)
	class ChildActorComponent*                                   MapDeck_RearStairs;                                // 0x408(0x8)
	class ChildActorComponent*                                   MapDeck_BowRight;                                  // 0x410(0x8)
	class ChildActorComponent*                                   MapDeck_BowLeft;                                   // 0x418(0x8)
	class ChildActorComponent*                                   MapDeck_Galley;                                    // 0x420(0x8)
	class ChildActorComponent*                                   MapDeck_MapTable;                                  // 0x428(0x8)
	class ChildActorComponent*                                   MapDeck_MainStairs;                                // 0x430(0x8)
	class ChildActorComponent*                                   Cabin_Entrance;                                    // 0x438(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x440(0x8)
};


