#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x110 (Full Size[0x7c0] - InheritedSize[0x6b0]
class BP_LargeShip_StandardHull_Damage_C: public BP_HullDamage_C
{
public:
	class StaticMeshComponent*                                   projectile_collision;                              // 0x6b0(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle;                                // 0x6b8(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle;                                // 0x6c0(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle;                                // 0x6c8(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle;                                // 0x6d0(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle;                                // 0x6d8(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle;                                // 0x6e0(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle_09;                             // 0x6e8(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle_08;                             // 0x6f0(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle_07;                             // 0x6f8(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle_06;                             // 0x700(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle_05;                             // 0x708(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle_04;                             // 0x710(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle_03;                             // 0x718(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle_02;                             // 0x720(0x8)
	class ChildActorComponent*                                   Damage_Zone_Middle_01;                             // 0x728(0x8)
	class StaticMeshComponent*                                   largeship_standardhull_upper_01_a;                 // 0x730(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower_09;                              // 0x738(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower_08;                              // 0x740(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower_07;                              // 0x748(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower_06;                              // 0x750(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower;                                 // 0x758(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower;                                 // 0x760(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower;                                 // 0x768(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower;                                 // 0x770(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower;                                 // 0x778(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower;                                 // 0x780(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower;                                 // 0x788(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower_05;                              // 0x790(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower_04;                              // 0x798(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower_03;                              // 0x7a0(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower_02;                              // 0x7a8(0x8)
	class ChildActorComponent*                                   Damage_Zone_Lower_01;                              // 0x7b0(0x8)
	class StaticMeshComponent*                                   largeship_standardhull_lower_01_a;                 // 0x7b8(0x8)
};


