#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x58 (Full Size[0x980] - InheritedSize[0x928]
class BP_LargeShip_QuestTable_C: public VoyageTable
{
public:
	class ChildActorComponent*                                   CancelVoyageSeaOfThievesOnDemand;                  // 0x928(0x8)
	class ChildActorComponent*                                   WarMap;                                            // 0x930(0x8)
	class ChildActorComponent*                                   FactionHourglass;                                  // 0x938(0x8)
	class ChildActorComponent*                                   CancelAdventure;                                   // 0x940(0x8)
	class ChildActorComponent*                                   PlayerBuiredItemsMapBundleInteractionPoint;        // 0x948(0x8)
	class ChildActorComponent*                                   CancelTale;                                        // 0x950(0x8)
	class ChildActorComponent*                                   CancelVoyage;                                      // 0x958(0x8)
	class ChildActorComponent*                                   VoyageSelectionSlot4;                              // 0x960(0x8)
	class ChildActorComponent*                                   VoyageSelectionSlot3;                              // 0x968(0x8)
	class ChildActorComponent*                                   VoyageSelectionSlot2;                              // 0x970(0x8)
	class ChildActorComponent*                                   VoyageSelectionSlot1;                              // 0x978(0x8)
};


