// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x570 (Full Size[0x1df0] - InheritedSize[0x1880]
class BP_LargeShipTemplate_C: public Ship
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x1880(0x8)
	class TeleportLocationComponent*                             TeleportLocation_WakeUp;                           // 0x1888(0x8)
	class ShipRowboatPersistenceComponent*                       ShipRowboatPersistence;                            // 0x1890(0x8)
	class HarpoonItemLocationComponent*                          HarpoonItemLocation1;                              // 0x1898(0x8)
	class HarpoonItemLocationComponent*                          HarpoonItemLocation;                               // 0x18a0(0x8)
	class FactionParticleComponent*                              FactionGBowParticles;                              // 0x18a8(0x8)
	class FactionParticleComponent*                              FactionBBowParticles;                              // 0x18b0(0x8)
	class SplashProbeVFXComponent*                               VFX_SplashProbe_Both_Splashes_Details;             // 0x18b8(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_rectangle_surface_Huge_Bottom; // 0x18c0(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_rectangle_surface_Huge_Top; // 0x18c8(0x8)
	class SplashProbeVFXComponent*                               VFX_SplashProbe_Both_Splashes_Second;              // 0x18d0(0x8)
	class SplashProbeVFXComponent*                               VFX_SplashProbe_OnShip_Splashes;                   // 0x18d8(0x8)
	class SplashProbeVFXComponent*                               VFX_SplashProbe_Offship_Splashes;                  // 0x18e0(0x8)
	class SplashProbeVFXComponent*                               VFX_SplashProbe_Underwater;                        // 0x18e8(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_rectangle_S_Local;         // 0x18f0(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_rectangle_S_Local3;        // 0x18f8(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_rectangle_S_Local2;        // 0x1900(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_cannon_Local8;             // 0x1908(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_cannon_Local6;             // 0x1910(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_cannon_Local7;             // 0x1918(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_cannon_Local5;             // 0x1920(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_cannon_Local2;             // 0x1928(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_cannon_Local4;             // 0x1930(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_cannon_Local3;             // 0x1938(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_captain_Local;             // 0x1940(0x8)
	class ParticleSystemComponent*                               vfx_playerships_bubbles_cannon_Local1;             // 0x1948(0x8)
	class SceneComponent*                                        VFX_Scene;                                         // 0x1950(0x8)
	class ShipFactionCustomisation*                              ShipFactionCustomisation;                          // 0x1958(0x8)
	blueprintgeneratedclass BP_ShipTrinketMountpointManagerComponent_Large_C* ShipTrinketMountpointManagerComponent_Large;       // 0x1960(0x8)
	class ChildActorComponent*                                   CaptainsLog;                                       // 0x1968(0x8)
	class ChildActorComponent*                                   ShipsCrest;                                        // 0x1970(0x8)
	class ChildActorComponent*                                   Rugs;                                              // 0x1978(0x8)
	class ChildActorComponent*                                   Drapes;                                            // 0x1980(0x8)
	class ChildActorComponent*                                   Bed;                                               // 0x1988(0x8)
	class ChildActorComponent*                                   Chandelier;                                        // 0x1990(0x8)
	class ChildActorComponent*                                   Curtains;                                          // 0x1998(0x8)
	class ChildActorComponent*                                   Chair;                                             // 0x19a0(0x8)
	class ChildActorComponent*                                   VoyageTable;                                       // 0x19a8(0x8)
	class ShipStorageJettisonComponent*                          ShipStorageJettison;                               // 0x19b0(0x8)
	class SkeletalMeshComponent*                                 Seagull3;                                          // 0x19b8(0x8)
	class SkeletalMeshComponent*                                 Seagull2;                                          // 0x19c0(0x8)
	class SeagullManagerComponent*                               SeagullManager;                                    // 0x19c8(0x8)
	class SkeletalMeshComponent*                                 Seagull1;                                          // 0x19d0(0x8)
	class StaticMeshComponent*                                   Rat3;                                              // 0x19d8(0x8)
	class StaticMeshComponent*                                   Rat2;                                              // 0x19e0(0x8)
	class StaticMeshComponent*                                   Rat1;                                              // 0x19e8(0x8)
	blueprintgeneratedclass BP_BedComponent_C*                   BP_BedComponent;                                   // 0x19f0(0x8)
	class RatManagerComponent*                                   RatManager;                                        // 0x19f8(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_BottomDeckBarrel;                             // 0x1a00(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_BottomDeckBarrel;                             // 0x1a08(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_BottomDeckBarrel;                             // 0x1a10(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_Cabin_Chest;                                  // 0x1a18(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_Platform_Starboard;                           // 0x1a20(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_Platform_Port;                                // 0x1a28(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_Bannister_Bow;                                // 0x1a30(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_Bannister_Bow;                                // 0x1a38(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_BottomDeckBarrel;                             // 0x1a40(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_MapTable_Cooking;                             // 0x1a48(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_MapTable;                                     // 0x1a50(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_Balcony_Rear_Starboard;                       // 0x1a58(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_Balcony_Rear_Port;                            // 0x1a60(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_Plank_Port;                                   // 0x1a68(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_Hatch;                                        // 0x1a70(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_Plank_Starboard;                              // 0x1a78(0x8)
	blueprintgeneratedclass BP_SeatComponent_C*                  Seat_CaptainsChair;                                // 0x1a80(0x8)
	class AIRegionComponent*                                     AIRegion;                                          // 0x1a88(0x8)
	class NamedPointsComponent*                                  NamedPoints;                                       // 0x1a90(0x8)
	class ChildActorComponent*                                   BP_ShipStorageBarrelTwo6;                          // 0x1a98(0x8)
	class ChildActorComponent*                                   BP_ShipStorageBarrelThree4;                        // 0x1aa0(0x8)
	class ChildActorComponent*                                   BP_ShipStorageBarrelThree3;                        // 0x1aa8(0x8)
	class ChildActorComponent*                                   BP_ShipStorageBarrelTwo5;                          // 0x1ab0(0x8)
	class ChildActorComponent*                                   BP_ShipStorageBarrelTwo4;                          // 0x1ab8(0x8)
	class ChildActorComponent*                                   BP_ShipStorageBarrelTwo3;                          // 0x1ac0(0x8)
	class ChildActorComponent*                                   BP_ShipStorageBarrelTwo2;                          // 0x1ac8(0x8)
	class ChildActorComponent*                                   BP_ShipStorageBarrelTwo1;                          // 0x1ad0(0x8)
	class ChildActorComponent*                                   BP_ShipStorageBarrelTwo;                           // 0x1ad8(0x8)
	class ChildActorComponent*                                   BP_ShipStorageBarrelThree2;                        // 0x1ae0(0x8)
	class ChildActorComponent*                                   BP_ShipStorageBarrelThree1;                        // 0x1ae8(0x8)
	class ChildActorComponent*                                   BP_ShipStorageBarrelThree;                         // 0x1af0(0x8)
	class StaticMeshComponent*                                   shp_galleon_ladder_gap_hits_01_a;                  // 0x1af8(0x8)
	class StaticMeshComponent*                                   shp_flag_hole_01_a;                                // 0x1b00(0x8)
	class ChildActorComponent*                                   BP_EmissaryFlag;                                   // 0x1b08(0x8)
	class EmissaryFlotsamItemSpawnComponent*                     EmissaryFlotsamItemSpawner;                        // 0x1b10(0x8)
	class ChildActorComponent*                                   BP_LargeShip_CageLatch_03_a;                       // 0x1b18(0x8)
	class ChildActorComponent*                                   BP_LargeShip_CageLatch_03_b;                       // 0x1b20(0x8)
	class ChildActorComponent*                                   BP_WaterBarrel;                                    // 0x1b28(0x8)
	class ChildActorComponent*                                   BP_Shroudbreaker;                                  // 0x1b30(0x8)
	class ChildActorComponent*                                   BP_ShipPetChest;                                   // 0x1b38(0x8)
	class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x1b40(0x8)
	class ChildActorComponent*                                   ShipStorageBarrelFood2;                            // 0x1b48(0x8)
	class ChildActorComponent*                                   BP_HarpoonLauncher1;                               // 0x1b50(0x8)
	class ChildActorComponent*                                   BP_HarpoonLauncher;                                // 0x1b58(0x8)
	class ChildActorComponent*                                   RowboatMountpoint;                                 // 0x1b60(0x8)
	class ShipTelemetryComponent*                                ShipTelemetry;                                     // 0x1b68(0x8)
	class ChildActorComponent*                                   BP_ShipVanityChest;                                // 0x1b70(0x8)
	class ChildActorComponent*                                   BP_Bell;                                           // 0x1b78(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_LowestDeck17;                    // 0x1b80(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_LowestDeck16;                    // 0x1b88(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_LowestDeck15;                    // 0x1b90(0x8)
	class ChildActorComponent*                                   BP_WeaponsChest;                                   // 0x1b98(0x8)
	class ChildActorComponent*                                   BP_EquipmentChest;                                 // 0x1ba0(0x8)
	class ChildActorComponent*                                   BP_ClothingChest;                                  // 0x1ba8(0x8)
	class ShipPointParticleComponent*                            VFX_Drips;                                         // 0x1bb0(0x8)
	class BoxComponent*                                          RammingSpurZone;                                   // 0x1bb8(0x8)
	class StaticMeshComponent*                                   shp_shark_hits_01_a;                               // 0x1bc0(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_Cannonball3;                     // 0x1bc8(0x8)
	class ChildActorComponent*                                   BP_AmmoChest;                                      // 0x1bd0(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_Grog;                            // 0x1bd8(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_Food;                            // 0x1be0(0x8)
	class ChildActorComponent*                                   Lanterns;                                          // 0x1be8(0x8)
	class TeleportLocationComponent*                             TeleportLocation11_TopDeck_NearWheel;              // 0x1bf0(0x8)
	class TeleportLocationComponent*                             TeleportLocation_09_BottomDeck_OutsideBrig;        // 0x1bf8(0x8)
	class TeleportLocationComponent*                             TeleportLocation_08_BottomDeck_FacingStairs;       // 0x1c00(0x8)
	class TeleportLocationComponent*                             TeleportLocation_07_MiddleDeck_BackOfShip;         // 0x1c08(0x8)
	class TeleportLocationComponent*                             TeleportLocation_06_MiddleDeck_FrontOfShip;        // 0x1c10(0x8)
	class TeleportLocationComponent*                             TeleportLocation_05_TopDeck_NearCannons;           // 0x1c18(0x8)
	class TeleportLocationComponent*                             TeleportLocation_04_TopDeck_FrontOfShip;           // 0x1c20(0x8)
	class TeleportLocationComponent*                             TeleportLocation_03_TopDeck_BackOfShip;            // 0x1c28(0x8)
	class TeleportLocationComponent*                             TeleportLocation_02_TopDeck_NearLadder;            // 0x1c30(0x8)
	class TeleportLocationComponent*                             TeleportLocation_01_CaptainsCabin;                 // 0x1c38(0x8)
	class RiggingSystemComponent*                                MainRigging;                                       // 0x1c40(0x8)
	class RiggingSystemComponent*                                ControlsRigging;                                   // 0x1c48(0x8)
	class ChildActorComponent*                                   MapTable;                                          // 0x1c50(0x8)
	class ChildActorComponent*                                   ShipsCompass;                                      // 0x1c58(0x8)
	class ChildActorComponent*                                   Figurehead;                                        // 0x1c60(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_LowestDeck13;                    // 0x1c68(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_BottomOfLowestStairs2;           // 0x1c70(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_BottomOfLowestStairs1;           // 0x1c78(0x8)
	class SceneComponent*                                        LowerDeckBarrels;                                  // 0x1c80(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_NearLowerStairs5;                // 0x1c88(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_Cannonball2;                     // 0x1c90(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_Cannonball1;                     // 0x1c98(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_NearLowerStairs6;                // 0x1ca0(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_NearLowerStairs4;                // 0x1ca8(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_NearLowerStairs3;                // 0x1cb0(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_NearLowerStairs2;                // 0x1cb8(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_NearLowerStairs1;                // 0x1cc0(0x8)
	class ChildActorComponent*                                   ShipStorageBarrel_BehindStairs5;                   // 0x1cc8(0x8)
	class ChildActorComponent*                                   CannonRight4;                                      // 0x1cd0(0x8)
	class ChildActorComponent*                                   CannonRight3;                                      // 0x1cd8(0x8)
	class ChildActorComponent*                                   CannonRight2;                                      // 0x1ce0(0x8)
	class ChildActorComponent*                                   CannonRight1;                                      // 0x1ce8(0x8)
	class ChildActorComponent*                                   CannonLeft4;                                       // 0x1cf0(0x8)
	class ChildActorComponent*                                   CannonLeft3;                                       // 0x1cf8(0x8)
	class ChildActorComponent*                                   CannonLeft2;                                       // 0x1d00(0x8)
	class ChildActorComponent*                                   CannonLeft1;                                       // 0x1d08(0x8)
	class ChildActorComponent*                                   LadderStbd;                                        // 0x1d10(0x8)
	class ChildActorComponent*                                   LadderPort;                                        // 0x1d18(0x8)
	class ChildActorComponent*                                   Hull;                                              // 0x1d20(0x8)
	class ChildActorComponent*                                   MastForeSailAngleRight;                            // 0x1d28(0x8)
	class ChildActorComponent*                                   MastForeSailAngleLeft;                             // 0x1d30(0x8)
	class SceneComponent*                                        MiddleDeckBarrels;                                 // 0x1d38(0x8)
	class ChildActorComponent*                                   MastMainSailAngleRight;                            // 0x1d40(0x8)
	class ChildActorComponent*                                   MastMizzenSailAngleRight;                          // 0x1d48(0x8)
	class ChildActorComponent*                                   MastMizzenSailAngleLeft;                           // 0x1d50(0x8)
	class ChildActorComponent*                                   MastForeSailHoistRight;                            // 0x1d58(0x8)
	class ChildActorComponent*                                   MastForeSailHoistLeft;                             // 0x1d60(0x8)
	class ChildActorComponent*                                   MastMizzenSailHoistRight;                          // 0x1d68(0x8)
	class ChildActorComponent*                                   MastMizzenSailHoistLeft;                           // 0x1d70(0x8)
	class ChildActorComponent*                                   MastMainSailHoistRight;                            // 0x1d78(0x8)
	class ChildActorComponent*                                   MastMainSailHoistLeft;                             // 0x1d80(0x8)
	class ChildActorComponent*                                   Capstan;                                           // 0x1d88(0x8)
	class ChildActorComponent*                                   MastFore;                                          // 0x1d90(0x8)
	class ChildActorComponent*                                   MastMain;                                          // 0x1d98(0x8)
	class ChildActorComponent*                                   MastMizzen;                                        // 0x1da0(0x8)
	class ChildActorComponent*                                   Anchor;                                            // 0x1da8(0x8)
	class ChildActorComponent*                                   Rudder;                                            // 0x1db0(0x8)
	class ChildActorComponent*                                   Wheel;                                             // 0x1db8(0x8)
	class ChildActorComponent*                                   AudioBoat;                                         // 0x1dc0(0x8)
	class ChildActorComponent*                                   MastMainSailAngleLeft;                             // 0x1dc8(0x8)
	byte                                                         Timeline_Disable_Secondary__Direction_FB2965C04D191887E0A8AE9EBF5C5978; // 0x1dd0(0x1)
	char                                                         pad0x7_F0G4V[0x7];                                 // 0x1dd1(0x7)
	class TimelineComponent*                                     Timeline_Disable_Secondary;                        // 0x1dd8(0x8)
	byte                                                         Timeline_DisableSplash1__Direction_6B41A1B3430D6C615C4EFEB03700C527; // 0x1de0(0x1)
	char                                                         pad0x7_RLGM4[0x7];                                 // 0x1de1(0x7)
	class TimelineComponent*                                     Timeline_DisableSplash1;                           // 0x1de8(0x8)
};


}