// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x70 (Full Size[0x448] - InheritedSize[0x3d8]
class BP_LargeShip_MapDeck_Dressing_01_a_C: public TrinketReplacementActor
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3d8(0x8)
	Class StaticMeshComponent*                                   fod_rum_01_a;                                      // 0x3e0(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a2;                                  // 0x3e8(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a1;                                  // 0x3f0(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a;                                   // 0x3f8(0x8)
	Class StaticMeshComponent*                                   shp_fry_pan_01_a;                                  // 0x400(0x8)
	Class StaticMeshComponent*                                   fod_rum_01_a1;                                     // 0x408(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b2;                                 // 0x410(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b;                                  // 0x418(0x8)
	Class StaticMeshComponent*                                   ptn_pois_01_a;                                     // 0x420(0x8)
	Class StaticMeshComponent*                                   ptn_cure_01_a2;                                    // 0x428(0x8)
	Class StaticMeshComponent*                                   ptn_cure_01_a;                                     // 0x430(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b1;                                 // 0x438(0x8)
	Class MergedStaticMeshComponent*                             MergedStaticMesh;                                  // 0x440(0x8)
};


}