// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x110 (Full Size[0x768] - InheritedSize[0x658]
class BP_LargeShip_StandardHull_Damage_C: public None
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x658(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x660(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x668(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x670(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x678(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x680(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x688(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x690(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x698(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6a0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6a8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6b0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6b8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6c0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6c8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6d8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6e0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6e8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6f0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6f8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x700(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x708(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x710(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x718(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x720(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x728(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x730(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x738(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x740(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x748(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x750(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x758(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x760(0x8)
};


}