#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x60 (Full Size[0xad0] - InheritedSize[0xa70]
class BP_large_mast_main_C: public BP_Mast_C
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0xa70(0x8)
	class ChildActorComponent*                                   GuildPlaque;                                       // 0xa78(0x8)
	class ChildActorComponent*                                   BP_MastEmissaryFlag;                               // 0xa80(0x8)
	class StaticMeshComponent*                                   shp_flag_pennant_alliance_01_a;                    // 0xa88(0x8)
	class ChildActorComponent*                                   BP_ShipFlagCustomizationChest;                     // 0xa90(0x8)
	class ChildActorComponent*                                   BP_Bell;                                           // 0xa98(0x8)
	class StaticMeshComponent*                                   shp_flag_jolly_roger_01_a;                         // 0xaa0(0x8)
	class ChildActorComponent*                                   Ladder;                                            // 0xaa8(0x8)
	class StaticMeshComponent*                                   WeldedCrowsNestPhysics;                            // 0xab0(0x8)
	class StaticMeshComponent*                                   WeldedMastPhysics;                                 // 0xab8(0x8)
	class StaticMeshComponent*                                   shp_mast_ladder_step_01_a;                         // 0xac0(0x8)
	class StaticMeshComponent*                                   CrowsNest;                                         // 0xac8(0x8)
};


