// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x4e0
class BP_LargeShipTemplate_C: public Ship
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x1690(0x8)
	Class SplashProbeVFXComponent*                               VFX_SplashProbe_Both_Splashes_Details;             // 0x1698(0x8)
	Class ParticleSystemComponent*                               vfx_playerships_bubbles_rectangle_surface_Huge_Bottom; // 0x16a0(0x8)
	Class ParticleSystemComponent*                               vfx_playerships_bubbles_rectangle_surface_Huge_Top; // 0x16a8(0x8)
	Class SplashProbeVFXComponent*                               VFX_SplashProbe_Both_Splashes_Second;              // 0x16b0(0x8)
	Class SplashProbeVFXComponent*                               VFX_SplashProbe_OnShip_Splashes;                   // 0x16b8(0x8)
	Class SplashProbeVFXComponent*                               VFX_SplashProbe_Offship_Splashes;                  // 0x16c0(0x8)
	Class SplashProbeVFXComponent*                               VFX_SplashProbe_Underwater;                        // 0x16c8(0x8)
	Class SceneComponent*                                        VFX_Scene;                                         // 0x16d0(0x8)
	Class ShipFactionCustomisation*                              ShipFactionCustomisation;                          // 0x16d8(0x8)
	BlueprintGeneratedClass BP_ShipTrinketMountpointManagerComponent_Large_C* ShipTrinketMountpointManagerComponent_Large;       // 0x16e0(0x8)
	Class ChildActorComponent*                                   CaptainsLog;                                       // 0x16e8(0x8)
	Class ChildActorComponent*                                   ShipsCrest;                                        // 0x16f0(0x8)
	Class ChildActorComponent*                                   Rugs;                                              // 0x16f8(0x8)
	Class ChildActorComponent*                                   Drapes;                                            // 0x1700(0x8)
	Class ChildActorComponent*                                   Bed;                                               // 0x1708(0x8)
	Class ChildActorComponent*                                   Chandelier;                                        // 0x1710(0x8)
	Class ChildActorComponent*                                   Curtains;                                          // 0x1718(0x8)
	Class ChildActorComponent*                                   Chair;                                             // 0x1720(0x8)
	Class ChildActorComponent*                                   VoyageTable;                                       // 0x1728(0x8)
	Class ShipStorageJettisonComponent*                          ShipStorageJettison;                               // 0x1730(0x8)
	Class SkeletalMeshComponent*                                 Seagull3;                                          // 0x1738(0x8)
	Class SkeletalMeshComponent*                                 Seagull2;                                          // 0x1740(0x8)
	Class SeagullManagerComponent*                               SeagullManager;                                    // 0x1748(0x8)
	Class SkeletalMeshComponent*                                 Seagull1;                                          // 0x1750(0x8)
	Class StaticMeshComponent*                                   Rat3;                                              // 0x1758(0x8)
	Class StaticMeshComponent*                                   Rat2;                                              // 0x1760(0x8)
	Class StaticMeshComponent*                                   Rat1;                                              // 0x1768(0x8)
	BlueprintGeneratedClass BP_BedComponent_C*                   BP_BedComponent;                                   // 0x1770(0x8)
	Class RatManagerComponent*                                   RatManager;                                        // 0x1778(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_BottomDeckBarrel;                             // 0x1780(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_BottomDeckBarrel;                             // 0x1788(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_BottomDeckBarrel;                             // 0x1790(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Cabin_Chest;                                  // 0x1798(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Platform_Starboard;                           // 0x17a0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Platform_Port;                                // 0x17a8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Bannister_Bow;                                // 0x17b0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Bannister_Bow;                                // 0x17b8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_BottomDeckBarrel;                             // 0x17c0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_MapTable_Cooking;                             // 0x17c8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_MapTable;                                     // 0x17d0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Balcony_Rear_Starboard;                       // 0x17d8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Balcony_Rear_Port;                            // 0x17e0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Plank_Port;                                   // 0x17e8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Hatch;                                        // 0x17f0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Plank_Starboard;                              // 0x17f8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_CaptainsChair;                                // 0x1800(0x8)
	Class AIRegionComponent*                                     AIRegion;                                          // 0x1808(0x8)
	Class NamedPointsComponent*                                  NamedPoints;                                       // 0x1810(0x8)
	Class ChildActorComponent*                                   BP_ShipStorageBarrelTwo6;                          // 0x1818(0x8)
	Class ChildActorComponent*                                   BP_ShipStorageBarrelThree4;                        // 0x1820(0x8)
	Class ChildActorComponent*                                   BP_ShipStorageBarrelThree3;                        // 0x1828(0x8)
	Class ChildActorComponent*                                   BP_ShipStorageBarrelTwo5;                          // 0x1830(0x8)
	Class ChildActorComponent*                                   BP_ShipStorageBarrelTwo4;                          // 0x1838(0x8)
	Class ChildActorComponent*                                   BP_ShipStorageBarrelTwo3;                          // 0x1840(0x8)
	Class ChildActorComponent*                                   BP_ShipStorageBarrelTwo2;                          // 0x1848(0x8)
	Class ChildActorComponent*                                   BP_ShipStorageBarrelTwo1;                          // 0x1850(0x8)
	Class ChildActorComponent*                                   BP_ShipStorageBarrelTwo;                           // 0x1858(0x8)
	Class ChildActorComponent*                                   BP_ShipStorageBarrelThree2;                        // 0x1860(0x8)
	Class ChildActorComponent*                                   BP_ShipStorageBarrelThree1;                        // 0x1868(0x8)
	Class ChildActorComponent*                                   BP_ShipStorageBarrelThree;                         // 0x1870(0x8)
	Class StaticMeshComponent*                                   shp_galleon_ladder_gap_hits_01_a;                  // 0x1878(0x8)
	Class StaticMeshComponent*                                   shp_flag_hole_01_a;                                // 0x1880(0x8)
	Class ChildActorComponent*                                   BP_EmissaryFlag;                                   // 0x1888(0x8)
	Class EmissaryFlotsamItemSpawnComponent*                     EmissaryFlotsamItemSpawner;                        // 0x1890(0x8)
	Class ChildActorComponent*                                   BP_LargeShip_CageLatch_03_a;                       // 0x1898(0x8)
	Class ChildActorComponent*                                   BP_LargeShip_CageLatch_03_b;                       // 0x18a0(0x8)
	Class ChildActorComponent*                                   BP_WaterBarrel;                                    // 0x18a8(0x8)
	Class ChildActorComponent*                                   BP_Shroudbreaker;                                  // 0x18b0(0x8)
	Class ChildActorComponent*                                   BP_ShipPetChest;                                   // 0x18b8(0x8)
	Class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x18c0(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrelFood2;                            // 0x18c8(0x8)
	Class ChildActorComponent*                                   BP_HarpoonLauncher1;                               // 0x18d0(0x8)
	Class ChildActorComponent*                                   BP_HarpoonLauncher;                                // 0x18d8(0x8)
	Class ChildActorComponent*                                   RowboatMountpoint;                                 // 0x18e0(0x8)
	Class ShipTelemetryComponent*                                ShipTelemetry;                                     // 0x18e8(0x8)
	Class ChildActorComponent*                                   BP_ShipVanityChest;                                // 0x18f0(0x8)
	Class ChildActorComponent*                                   BP_Bell;                                           // 0x18f8(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowestDeck17;                    // 0x1900(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowestDeck16;                    // 0x1908(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowestDeck15;                    // 0x1910(0x8)
	Class ChildActorComponent*                                   BP_WeaponsChest;                                   // 0x1918(0x8)
	Class ChildActorComponent*                                   BP_EquipmentChest;                                 // 0x1920(0x8)
	Class ChildActorComponent*                                   BP_ClothingChest;                                  // 0x1928(0x8)
	Class ShipPointParticleComponent*                            VFX_Drips;                                         // 0x1930(0x8)
	Class BoxComponent*                                          RammingSpurZone;                                   // 0x1938(0x8)
	Class StaticMeshComponent*                                   shp_shark_hits_01_a;                               // 0x1940(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Cannonball3;                     // 0x1948(0x8)
	Class ChildActorComponent*                                   BP_AmmoChest;                                      // 0x1950(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Grog;                            // 0x1958(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Food;                            // 0x1960(0x8)
	Class ChildActorComponent*                                   Lanterns;                                          // 0x1968(0x8)
	Class TeleportLocationComponent*                             TeleportLocation11_TopDeck_NearWheel;              // 0x1970(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_09_BottomDeck_OutsideBrig;        // 0x1978(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_08_BottomDeck_FacingStairs;       // 0x1980(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_07_MiddleDeck_BackOfShip;         // 0x1988(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_06_MiddleDeck_FrontOfShip;        // 0x1990(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_05_TopDeck_NearCannons;           // 0x1998(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_04_TopDeck_FrontOfShip;           // 0x19a0(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_03_TopDeck_BackOfShip;            // 0x19a8(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_02_TopDeck_NearLadder;            // 0x19b0(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_01_CaptainsCabin;                 // 0x19b8(0x8)
	Class RiggingSystemComponent*                                MainRigging;                                       // 0x19c0(0x8)
	Class RiggingSystemComponent*                                ControlsRigging;                                   // 0x19c8(0x8)
	Class ChildActorComponent*                                   MapTable;                                          // 0x19d0(0x8)
	Class ChildActorComponent*                                   ShipsCompass;                                      // 0x19d8(0x8)
	Class ChildActorComponent*                                   Figurehead;                                        // 0x19e0(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowestDeck13;                    // 0x19e8(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_BottomOfLowestStairs2;           // 0x19f0(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_BottomOfLowestStairs1;           // 0x19f8(0x8)
	Class SceneComponent*                                        LowerDeckBarrels;                                  // 0x1a00(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_NearLowerStairs5;                // 0x1a08(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Cannonball2;                     // 0x1a10(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Cannonball1;                     // 0x1a18(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_NearLowerStairs6;                // 0x1a20(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_NearLowerStairs4;                // 0x1a28(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_NearLowerStairs3;                // 0x1a30(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_NearLowerStairs2;                // 0x1a38(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_NearLowerStairs1;                // 0x1a40(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_BehindStairs5;                   // 0x1a48(0x8)
	Class ChildActorComponent*                                   CannonRight4;                                      // 0x1a50(0x8)
	Class ChildActorComponent*                                   CannonRight3;                                      // 0x1a58(0x8)
	Class ChildActorComponent*                                   CannonRight2;                                      // 0x1a60(0x8)
	Class ChildActorComponent*                                   CannonRight1;                                      // 0x1a68(0x8)
	Class ChildActorComponent*                                   CannonLeft4;                                       // 0x1a70(0x8)
	Class ChildActorComponent*                                   CannonLeft3;                                       // 0x1a78(0x8)
	Class ChildActorComponent*                                   CannonLeft2;                                       // 0x1a80(0x8)
	Class ChildActorComponent*                                   CannonLeft1;                                       // 0x1a88(0x8)
	Class ChildActorComponent*                                   LadderStbd;                                        // 0x1a90(0x8)
	Class ChildActorComponent*                                   LadderPort;                                        // 0x1a98(0x8)
	Class ChildActorComponent*                                   Hull;                                              // 0x1aa0(0x8)
	Class ChildActorComponent*                                   MastForeSailAngleRight;                            // 0x1aa8(0x8)
	Class ChildActorComponent*                                   MastForeSailAngleLeft;                             // 0x1ab0(0x8)
	Class SceneComponent*                                        MiddleDeckBarrels;                                 // 0x1ab8(0x8)
	Class ChildActorComponent*                                   MastMainSailAngleRight;                            // 0x1ac0(0x8)
	Class ChildActorComponent*                                   MastMizzenSailAngleRight;                          // 0x1ac8(0x8)
	Class ChildActorComponent*                                   MastMizzenSailAngleLeft;                           // 0x1ad0(0x8)
	Class ChildActorComponent*                                   MastForeSailHoistRight;                            // 0x1ad8(0x8)
	Class ChildActorComponent*                                   MastForeSailHoistLeft;                             // 0x1ae0(0x8)
	Class ChildActorComponent*                                   MastMizzenSailHoistRight;                          // 0x1ae8(0x8)
	Class ChildActorComponent*                                   MastMizzenSailHoistLeft;                           // 0x1af0(0x8)
	Class ChildActorComponent*                                   MastMainSailHoistRight;                            // 0x1af8(0x8)
	Class ChildActorComponent*                                   MastMainSailHoistLeft;                             // 0x1b00(0x8)
	Class ChildActorComponent*                                   Capstan;                                           // 0x1b08(0x8)
	Class ChildActorComponent*                                   MastFore;                                          // 0x1b10(0x8)
	Class ChildActorComponent*                                   MastMain;                                          // 0x1b18(0x8)
	Class ChildActorComponent*                                   MastMizzen;                                        // 0x1b20(0x8)
	Class ChildActorComponent*                                   Anchor;                                            // 0x1b28(0x8)
	Class ChildActorComponent*                                   Rudder;                                            // 0x1b30(0x8)
	Class ChildActorComponent*                                   Wheel;                                             // 0x1b38(0x8)
	Class ChildActorComponent*                                   AudioBoat;                                         // 0x1b40(0x8)
	Class ChildActorComponent*                                   MastMainSailAngleLeft;                             // 0x1b48(0x8)
	byte                                                         Timeline_Disable_Secondary__Direction_FB2965C04D191887E0A8AE9EBF5C5978; // 0x1b50(0x1)
	Class TimelineComponent*                                     Timeline_Disable_Secondary;                        // 0x1b58(0x8)
	byte                                                         Timeline_DisableSplash1__Direction_6B41A1B3430D6C615C4EFEB03700C527; // 0x1b60(0x1)
	Class TimelineComponent*                                     Timeline_DisableSplash1;                           // 0x1b68(0x8)
};


}