// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68
class BP_LostSands_CannonEmplacement_C: public Actor
{
public:
	Class StaticMeshComponent*                                   cmn_barrel_debris_01_a;                            // 0x3c8(0x8)
	Class ChildActorComponent*                                   BP_Rowboat_Cannon;                                 // 0x3d0(0x8)
	Class StaticMeshComponent*                                   volumetric_sphere;                                 // 0x3d8(0x8)
	Class ParticleSystemComponent*                               vfx_torch_05_Aggresive_L;                          // 0x3e0(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x3e8(0x8)
	Class StaticMeshComponent*                                   sod_cmn_cloth_wall_03_a;                           // 0x3f0(0x8)
	Class StaticMeshComponent*                                   sod_cmn_cloth_roof_02_a;                           // 0x3f8(0x8)
	Class StaticMeshComponent*                                   bld_reaper_flag_02_a;                              // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x408(0x8)
	Class StaticMeshComponent*                                   ske_fort_battlement_01_b;                          // 0x410(0x8)
	Class StaticMeshComponent*                                   bld_drydock_shelter_01_a;                          // 0x418(0x8)
	Class StaticMeshComponent*                                   bld_drydock_shelter_01_b;                          // 0x420(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x428(0x8)
};


}