// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x50 (Full Size[0x918] - InheritedSize[0x8c8]
class BP_LargeShip_QuestTable_C: public VoyageTable
{
public:
	Class ChildActorComponent*                                   WarMap;                                            // 0x8c8(0x8)
	Class ChildActorComponent*                                   FactionHourglass;                                  // 0x8d0(0x8)
	Class ChildActorComponent*                                   CancelAdventure;                                   // 0x8d8(0x8)
	Class ChildActorComponent*                                   PlayerBuiredItemsMapBundleInteractionPoint;        // 0x8e0(0x8)
	Class ChildActorComponent*                                   CancelTale;                                        // 0x8e8(0x8)
	Class ChildActorComponent*                                   CancelVoyage;                                      // 0x8f0(0x8)
	Class ChildActorComponent*                                   VoyageSelectionSlot4;                              // 0x8f8(0x8)
	Class ChildActorComponent*                                   VoyageSelectionSlot3;                              // 0x900(0x8)
	Class ChildActorComponent*                                   VoyageSelectionSlot2;                              // 0x908(0x8)
	Class ChildActorComponent*                                   VoyageSelectionSlot1;                              // 0x910(0x8)
};


}