// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x98 (Full Size[0xa38] - InheritedSize[0x9a0]
class BP_Lantern_C: public Lantern
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x9a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9b0(0x8)
	Class AmbientLightSourceComponent*                           None;                                              // 0x9b8(0x8)
	Class SpotLightComponent*                                    None;                                              // 0x9c0(0x8)
	Class UsableWieldableComponent*                              None;                                              // 0x9c8(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x9d0(0x8)
	float                                                        None;                                              // 0x9d8(0x4)
	char                                                         pad0x4_O2GOC[0x4];                                 // 0x9dc(0x4)
	Class MaterialInstanceDynamic*                               None;                                              // 0x9e0(0x8)
	float                                                        None;                                              // 0x9e8(0x4)
	float                                                        None;                                              // 0x9ec(0x4)
	float                                                        None;                                              // 0x9f0(0x4)
	Struct LinearColor                                           None;                                              // 0x9f4(0x10)
	Struct LinearColor                                           None;                                              // 0xa04(0x10)
	Struct LinearColor                                           None;                                              // 0xa14(0x10)
	char                                                         pad0x4_J5U86[0x4];                                 // 0xa24(0x4)
	TArray<class MaterialInstanceDynamic*>                       None;                                              // 0xa28(0x10)
};


}