// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa8 (Full Size[0x470] - InheritedSize[0x3c8]
class BP_LargeShip_StandardHull_Art_Interior_Captains_Cabin_C: public Actor
{
public:
	class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3c8(0x8)
	class StaticMeshComponent*                                   trs_candlestick_01_a;                              // 0x3d0(0x8)
	class StaticMeshComponent*                                   cmn_candle_01_a;                                   // 0x3d8(0x8)
	class StaticMeshComponent*                                   cap_inkwell_01_a;                                  // 0x3e0(0x8)
	class ChildActorComponent*                                   CaptainsBookcase;                                  // 0x3e8(0x8)
	class ChildActorComponent*                                   BP_LargeShip_CapCabin_Dressing_01_a;               // 0x3f0(0x8)
	class StaticMeshComponent*                                   cap_cabinet_02_b;                                  // 0x3f8(0x8)
	class StaticMeshComponent*                                   cap_cage_01_b;                                     // 0x400(0x8)
	class StaticMeshComponent*                                   cap_cage_01_a;                                     // 0x408(0x8)
	class ParticleSystemComponent*                               vfx_tavern_candle_looping_01_a8;                   // 0x410(0x8)
	class ParticleSystemComponent*                               vfx_tavern_candle_looping_01_a1;                   // 0x418(0x8)
	class StaticMeshComponent*                                   gmp_pl_cabin_cabinet_a_01;                         // 0x420(0x8)
	class StaticMeshComponent*                                   shp_item_shelf_01_a;                               // 0x428(0x8)
	class StaticMeshComponent*                                   cap_cabin_drawer_01_a;                             // 0x430(0x8)
	class StaticMeshComponent*                                   cap_cabin_trunk_01_a;                              // 0x438(0x8)
	class StaticMeshComponent*                                   cap_cabin_trunk_01_a1;                             // 0x440(0x8)
	class MergedStaticMeshComponent*                             MergedStaticMesh_col;                              // 0x448(0x8)
	class StaticMeshComponent*                                   cap_skull_candle_01_a;                             // 0x450(0x8)
	class StaticMeshComponent*                                   cap_cabin_map_rolls_01_a;                          // 0x458(0x8)
	class MergedStaticMeshComponent*                             MergedStaticMesh;                                  // 0x460(0x8)
	class StaticMeshComponent*                                   shp_interior_captains_cabin_01_a;                  // 0x468(0x8)
};


}