// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60
class BP_LargeShip_MapDeck_Dressing_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   fod_rum_01_a1;                                     // 0x3f8(0x8)
	Class StaticMeshComponent*                                   fod_rum_01_a;                                      // 0x400(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a2;                                  // 0x408(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a1;                                  // 0x410(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a;                                   // 0x418(0x8)
	Class StaticMeshComponent*                                   shp_fry_pan_01_a;                                  // 0x420(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b1;                                 // 0x428(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b2;                                 // 0x430(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b;                                  // 0x438(0x8)
	Class StaticMeshComponent*                                   ptn_pois_01_a;                                     // 0x440(0x8)
	Class StaticMeshComponent*                                   ptn_cure_01_a2;                                    // 0x448(0x8)
	Class StaticMeshComponent*                                   ptn_cure_01_a;                                     // 0x450(0x8)
};


// Size 0x18
class BP_LargeShip_CapCabin_Dressing_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   cap_model_01_a;                                    // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cap_shark_jaws_01_a;                               // 0x400(0x8)
	Class StaticMeshComponent*                                   cap_wooden_plaque_01_a;                            // 0x408(0x8)
};


}