// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x98 (Full Size[0x9d8] - InheritedSize[0x940]
class BP_Lantern_C: public Lantern
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x940(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x948(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x950(0x8)
	Class AmbientLightSourceComponent*                           None;                                              // 0x958(0x8)
	Class SpotLightComponent*                                    None;                                              // 0x960(0x8)
	Class UsableWieldableComponent*                              None;                                              // 0x968(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x970(0x8)
	float                                                        None;                                              // 0x978(0x4)
	char                                                         pad0x4_3TNNN[0x4];                                 // 0x97c(0x4)
	Class MaterialInstanceDynamic*                               None;                                              // 0x980(0x8)
	float                                                        None;                                              // 0x988(0x4)
	float                                                        None;                                              // 0x98c(0x4)
	float                                                        None;                                              // 0x990(0x4)
	Struct LinearColor                                           None;                                              // 0x994(0x10)
	Struct LinearColor                                           None;                                              // 0x9a4(0x10)
	Struct LinearColor                                           None;                                              // 0x9b4(0x10)
	char                                                         pad0x4_IG9G9[0x4];                                 // 0x9c4(0x4)
	TArray<class MaterialInstanceDynamic*>                       None;                                              // 0x9c8(0x10)
};


}