// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0
class BP_LargeShip_QuestTable_ShipPartMMC_C: public BP_LargeShip_QuestTable_C
{
public:
};


// Size 0x50
class BP_LargeShip_QuestTable_C: public VoyageTable
{
public:
	Class ChildActorComponent*                                   WarMap;                                            // 0x868(0x8)
	Class ChildActorComponent*                                   FactionHourglass;                                  // 0x870(0x8)
	Class ChildActorComponent*                                   CancelAdventure;                                   // 0x878(0x8)
	Class ChildActorComponent*                                   PlayerBuiredItemsMapBundleInteractionPoint;        // 0x880(0x8)
	Class ChildActorComponent*                                   CancelTale;                                        // 0x888(0x8)
	Class ChildActorComponent*                                   CancelVoyage;                                      // 0x890(0x8)
	Class ChildActorComponent*                                   VoyageSelectionSlot4;                              // 0x898(0x8)
	Class ChildActorComponent*                                   VoyageSelectionSlot3;                              // 0x8a0(0x8)
	Class ChildActorComponent*                                   VoyageSelectionSlot2;                              // 0x8a8(0x8)
	Class ChildActorComponent*                                   VoyageSelectionSlot1;                              // 0x8b0(0x8)
};


}