// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x90
class BP_LiveWireLightning_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3c8(0x8)
	Class BillboardComponent*                                    Billboard;                                         // 0x3d0(0x8)
	Class StaticMeshComponent*                                   RareLightning;                                     // 0x3d8(0x8)
	Class StaticMeshComponent*                                   End;                                               // 0x3e0(0x8)
	Class StaticMeshComponent*                                   Start;                                             // 0x3e8(0x8)
	Class StaticMeshComponent*                                   MainWire;                                          // 0x3f0(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x3f8(0x8)
	float                                                        FadeOutTimeline_GlowAlpha_B427430B41E555CC451F21941C6F0CEF; // 0x400(0x4)
	float                                                        FadeOutTimeline_Alpha_B427430B41E555CC451F21941C6F0CEF; // 0x404(0x4)
	byte                                                         FadeOutTimeline__Direction_B427430B41E555CC451F21941C6F0CEF; // 0x408(0x1)
	Class TimelineComponent*                                     FadeOutTimeline;                                   // 0x410(0x8)
	float                                                        StrikeTimeline_GlowAlpha_DE5F6C9D4CB04708B34889A38E0AF141; // 0x418(0x4)
	float                                                        StrikeTimeline_Alpha_DE5F6C9D4CB04708B34889A38E0AF141; // 0x41c(0x4)
	byte                                                         StrikeTimeline__Direction_DE5F6C9D4CB04708B34889A38E0AF141; // 0x420(0x1)
	Class TimelineComponent*                                     StrikeTimeline;                                    // 0x428(0x8)
	Class MaterialInstanceDynamic*                               LightningMat;                                      // 0x430(0x8)
	Struct Vector                                                TargetVector;                                      // 0x438(0xc)
	Struct Vector                                                StartVector;                                       // 0x444(0xc)
	Class MaterialInstanceDynamic*                               RareLightningMat;                                  // 0x450(0x8)
};


}