// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x310 (Full Size[0x6d8] - InheritedSize[0x3c8]
class BP_LargeShip_StandardHull_Art_Interior_Map_Deck_C: public Actor
{
public:
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3c8(0x8)
	Class ChildActorComponent*                                   BP_CookingPot2;                                    // 0x3d0(0x8)
	Class ChildActorComponent*                                   BP_LargeShip_MapDeck_Dressing_01_a;                // 0x3d8(0x8)
	Class ChildActorComponent*                                   BP_CookingPot;                                     // 0x3e0(0x8)
	Class StaticMeshComponent*                                   shp_cooker_02_a;                                   // 0x3e8(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_worktop_01_a;                          // 0x3f0(0x8)
	Class StaticMeshComponent*                                   shp_inv_zone_01_a;                                 // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cap_cabin_rug_02_a;                                // 0x400(0x8)
	Class StaticMeshComponent*                                   shp_hatch_02_a;                                    // 0x408(0x8)
	Class StaticMeshComponent*                                   shp_mast_hull_01_a_01;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   shp_mast_hull_01_a;                                // 0x418(0x8)
	Class StaticMeshComponent*                                   shp_mast_hull_01_a_02;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_01_a;                           // 0x428(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_01_a_03;                        // 0x430(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_01_a_01;                        // 0x438(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_01_a_02;                        // 0x440(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_01_a_04;                        // 0x448(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_01_a_05;                        // 0x450(0x8)
	Class MergedStaticMeshComponent*                             MergedStaticMesh_col;                              // 0x458(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a19;                         // 0x460(0x8)
	Class StaticMeshComponent*                                   shp_int_map_swing_rope_04_a;                       // 0x468(0x8)
	Class StaticMeshComponent*                                   shp_int_map_swing_rope_02_a;                       // 0x470(0x8)
	Class StaticMeshComponent*                                   shp_int_map_swing_rope_03_a;                       // 0x478(0x8)
	Class StaticMeshComponent*                                   shp_int_map_swing_rope_01_a;                       // 0x480(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_shelf_01_a_01;                         // 0x488(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_extractor_01_a;                        // 0x490(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_b;                             // 0x498(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_b_01;                          // 0x4a0(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_shelf_01_a;                            // 0x4a8(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_shelf_02_a;                            // 0x4b0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_a;                             // 0x4b8(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_a_01;                          // 0x4c0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_a_02;                          // 0x4c8(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_a_03;                          // 0x4d0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_a_04;                          // 0x4d8(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_a_05;                          // 0x4e0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_block_arm_01_a_02;                     // 0x4e8(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_a_07;                          // 0x4f0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_a_08;                          // 0x4f8(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_a_09;                          // 0x500(0x8)
	Class StaticMeshComponent*                                   shp_int_map_block_arm_01_a;                        // 0x508(0x8)
	Class StaticMeshComponent*                                   shp_int_map_block_arm_01_a_01;                     // 0x510(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_a_06;                          // 0x518(0x8)
	Class StaticMeshComponent*                                   shp_int_map_block_arm_01_a_03;                     // 0x520(0x8)
	Class StaticMeshComponent*                                   shp_int_map_block_arm_01_a_04;                     // 0x528(0x8)
	Class StaticMeshComponent*                                   shp_int_map_block_arm_01_a_05;                     // 0x530(0x8)
	Class StaticMeshComponent*                                   shp_int_map_block_arm_01_a_06;                     // 0x538(0x8)
	Class StaticMeshComponent*                                   shp_int_map_block_arm_01_a_07;                     // 0x540(0x8)
	Class StaticMeshComponent*                                   shp_int_map_block_arm_01_a_08;                     // 0x548(0x8)
	Class StaticMeshComponent*                                   shp_int_map_block_arm_01_a_09;                     // 0x550(0x8)
	Class StaticMeshComponent*                                   shp_int_map_block_arm_01_a;                        // 0x558(0x8)
	Class StaticMeshComponent*                                   shp_int_map_floor_beam_01_a;                       // 0x560(0x8)
	Class StaticMeshComponent*                                   shp_int_map_ceiling_beam_01_a_05;                  // 0x568(0x8)
	Class StaticMeshComponent*                                   shp_int_map_floor_beam_01_a_02;                    // 0x570(0x8)
	Class StaticMeshComponent*                                   shp_int_map_floor_beam_01_a_03;                    // 0x578(0x8)
	Class StaticMeshComponent*                                   shp_int_map_floor_beam_01_a_04;                    // 0x580(0x8)
	Class StaticMeshComponent*                                   shp_int_map_ceiling_beam_01_a;                     // 0x588(0x8)
	Class StaticMeshComponent*                                   shp_int_map_ceiling_beam_01_a_01;                  // 0x590(0x8)
	Class StaticMeshComponent*                                   shp_int_map_ceiling_beam_01_a_02;                  // 0x598(0x8)
	Class StaticMeshComponent*                                   shp_int_map_ceiling_beam_01_a_03;                  // 0x5a0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_ceiling_beam_01_a_04;                  // 0x5a8(0x8)
	Class StaticMeshComponent*                                   shp_int_map_floor_beam_01_a_01;                    // 0x5b0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a;                           // 0x5b8(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a_01;                        // 0x5c0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a_02;                        // 0x5c8(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a_03;                        // 0x5d0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a1;                          // 0x5d8(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a2;                          // 0x5e0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_a1;                            // 0x5e8(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a4;                          // 0x5f0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a5;                          // 0x5f8(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a6;                          // 0x600(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a7;                          // 0x608(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a8;                          // 0x610(0x8)
	Class StaticMeshComponent*                                   shp_int_map_ceiling_beam_01_a1;                    // 0x618(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a3;                          // 0x620(0x8)
	Class StaticMeshComponent*                                   shp_int_map_floor_beam_01_a1;                      // 0x628(0x8)
	Class StaticMeshComponent*                                   shp_int_map_hatch_pull_01_a;                       // 0x630(0x8)
	Class StaticMeshComponent*                                   shp_int_map_hatch_pull_01_a1;                      // 0x638(0x8)
	Class StaticMeshComponent*                                   shp_int_map_hatch_pull_01_a2;                      // 0x640(0x8)
	Class StaticMeshComponent*                                   shp_int_map_hatch_pull_01_a3;                      // 0x648(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a9;                          // 0x650(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a10;                         // 0x658(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a18;                         // 0x660(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a12;                         // 0x668(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a13;                         // 0x670(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a14;                         // 0x678(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a15;                         // 0x680(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a16;                         // 0x688(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a17;                         // 0x690(0x8)
	Class StaticMeshComponent*                                   shp_int_map_pillar_02_a11;                         // 0x698(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_a3;                            // 0x6a0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_beam_01_a4;                            // 0x6a8(0x8)
	Class StaticMeshComponent*                                   shp_int_map_ceiling_beam_01_a2;                    // 0x6b0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_floor_beam_01_c;                       // 0x6b8(0x8)
	Class MergedStaticMeshComponent*                             MergedStaticMesh;                                  // 0x6c0(0x8)
	Class StaticMeshComponent*                                   shp_int_map_stairs_01_a;                           // 0x6c8(0x8)
	Class StaticMeshComponent*                                   shp_interior_map_deck_01_a;                        // 0x6d0(0x8)
};


}