// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x2e8
class BP_LargeShip_StandardHull_Art_C: public Actor
{
public:
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3c8(0x8)
	Class StaticMeshComponent*                                   shp_hatch_01_a;                                    // 0x3d0(0x8)
	Class PostProcessComponent*                                  FirePostProcess;                                   // 0x3d8(0x8)
	Class BoxComponent*                                          Fire_PP_Volume;                                    // 0x3e0(0x8)
	Class ChildActorComponent*                                   SideDoor;                                          // 0x3e8(0x8)
	Class ChildActorComponent*                                   FrontDoor;                                         // 0x3f0(0x8)
	Class ChildActorComponent*                                   StaticDoors;                                       // 0x3f8(0x8)
	Class PostProcessComponent*                                  PostProcess2;                                      // 0x400(0x8)
	Class BoxComponent*                                          captains_PP_Volume_window;                         // 0x408(0x8)
	Class StaticMeshComponent*                                   shp_hull_rain_occlusion;                           // 0x410(0x8)
	Class SurfaceWaterComponent*                                 SurfaceWater;                                      // 0x418(0x8)
	Class StaticMeshComponent*                                   shp_captain_cabin_window_glass_ext_01_a_02;        // 0x420(0x8)
	Class StaticMeshComponent*                                   shp_captain_cabin_window_glass_ext_01_a_05;        // 0x428(0x8)
	Class StaticMeshComponent*                                   shp_captain_cabin_window_glass_ext_01_a_04;        // 0x430(0x8)
	Class StaticMeshComponent*                                   shp_captain_cabin_window_glass_ext_01_a_03;        // 0x438(0x8)
	Class StaticMeshComponent*                                   shp_captain_cabin_window_glass_ext_01_a_06;        // 0x440(0x8)
	Class StaticMeshComponent*                                   shp_captains_cabin_window_feature_glass_ext_01_a;  // 0x448(0x8)
	Class MergedStaticMeshComponent*                             Merged_ExteriorGlass;                              // 0x450(0x8)
	Class PostProcessComponent*                                  PostProcess1;                                      // 0x458(0x8)
	Class BoxComponent*                                          Ship_PP_Volume_A;                                  // 0x460(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0x468(0x8)
	Class BoxComponent*                                          Captain_PP_volume;                                 // 0x470(0x8)
	Class StaticMeshComponent*                                   shp_deck_forecastle_steps_01_a;                    // 0x478(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_forecastle_02_a;                    // 0x480(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_forecastle_02_a1;                   // 0x488(0x8)
	Class StaticMeshComponent*                                   shp_hatch_02_a;                                    // 0x490(0x8)
	Class StaticMeshComponent*                                   shp_captain_cabin_window_01_a_02;                  // 0x498(0x8)
	Class StaticMeshComponent*                                   shp_captain_cabin_window_01_a_06;                  // 0x4a0(0x8)
	Class StaticMeshComponent*                                   shp_captain_cabin_window_01_a_03;                  // 0x4a8(0x8)
	Class StaticMeshComponent*                                   shp_captain_cabin_window_01_a_04;                  // 0x4b0(0x8)
	Class StaticMeshComponent*                                   shp_captain_cabin_window_01_a_05;                  // 0x4b8(0x8)
	Class StaticMeshComponent*                                   shp_hull_hatch_01_a_01;                            // 0x4c0(0x8)
	Class StaticMeshComponent*                                   shp_hull_hatch_01_a_03;                            // 0x4c8(0x8)
	Class StaticMeshComponent*                                   shp_hull_hatch_01_a_02;                            // 0x4d0(0x8)
	Class StaticMeshComponent*                                   shp_hull_hatch_01_a_04;                            // 0x4d8(0x8)
	Class StaticMeshComponent*                                   shp_hull_hatch_01_a_05;                            // 0x4e0(0x8)
	Class StaticMeshComponent*                                   shp_hull_hatch_01_a_06;                            // 0x4e8(0x8)
	Class StaticMeshComponent*                                   shp_hull_hatch_01_a_07;                            // 0x4f0(0x8)
	Class StaticMeshComponent*                                   shp_hull_hatch_01_a_08;                            // 0x4f8(0x8)
	Class StaticMeshComponent*                                   shp_hull_hatch_01_a_09;                            // 0x500(0x8)
	Class StaticMeshComponent*                                   shp_hull_hatch_01_a;                               // 0x508(0x8)
	Class StaticMeshComponent*                                   shp_hull_hatch_01_a;                               // 0x510(0x8)
	Class StaticMeshComponent*                                   shp_hull_hatch_01_a;                               // 0x518(0x8)
	Class StaticMeshComponent*                                   shp_hull_shelf_01_a_06;                            // 0x520(0x8)
	Class StaticMeshComponent*                                   shp_hull_shelf_01_a_01;                            // 0x528(0x8)
	Class StaticMeshComponent*                                   shp_hull_shelf_01_a_02;                            // 0x530(0x8)
	Class StaticMeshComponent*                                   shp_hull_shelf_01_a_03;                            // 0x538(0x8)
	Class StaticMeshComponent*                                   shp_hull_shelf_01_a_04;                            // 0x540(0x8)
	Class StaticMeshComponent*                                   shp_hull_shelf_01_a_05;                            // 0x548(0x8)
	Class StaticMeshComponent*                                   shp_captains_cabin_window_feature_01_a;            // 0x550(0x8)
	Class StaticMeshComponent*                                   shp_sterncastle_wheel_balustrade_01_a;             // 0x558(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_long_01_a_01;                       // 0x560(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_long_01_a_02;                       // 0x568(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_long_01_a_03;                       // 0x570(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_long_01_a_04;                       // 0x578(0x8)
	Class StaticMeshComponent*                                   shp_deck_sterncastle_flagpole_01_a;                // 0x580(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_forecastle_curve_01_a_02;           // 0x588(0x8)
	Class StaticMeshComponent*                                   shp_captains_cabin_balcony_bannister_01_a;         // 0x590(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_forecastle_curve_01_a_01;           // 0x598(0x8)
	Class StaticMeshComponent*                                   cmn_driftwood_01_a;                                // 0x5a0(0x8)
	Class StaticMeshComponent*                                   shp_rear_window_01_a;                              // 0x5a8(0x8)
	Class StaticMeshComponent*                                   shp_captain_cabin_side_door_porch_01_a;            // 0x5b0(0x8)
	Class StaticMeshComponent*                                   cmn_driftwood_01_a2;                               // 0x5b8(0x8)
	Class MergedStaticMeshComponent*                             MergedStaticMesh_col;                              // 0x5c0(0x8)
	Class StaticMeshComponent*                                   shp_galleon_harpoon_placement_01_a;                // 0x5c8(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_cap_01_a_01;                        // 0x5d0(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_cap_01_a_02;                        // 0x5d8(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_cap_01_a_03;                        // 0x5e0(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_cap_01_a_04;                        // 0x5e8(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_cap_01_a;                           // 0x5f0(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_cap_01_a;                           // 0x5f8(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_cap_01_a;                           // 0x600(0x8)
	Class StaticMeshComponent*                                   shp_balustrade_cap_01_a;                           // 0x608(0x8)
	Class StaticMeshComponent*                                   shp_hull_rudder_hinge_01_a;                        // 0x610(0x8)
	Class StaticMeshComponent*                                   shp_rope_rigging_rear_01_a;                        // 0x618(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_01_a;                                // 0x620(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_02_a;                                // 0x628(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_04_a_03;                             // 0x630(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_04_a_04;                             // 0x638(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_04_a_05;                             // 0x640(0x8)
	Class StaticMeshComponent*                                   shp_mast_trim_01_a;                                // 0x648(0x8)
	Class StaticMeshComponent*                                   shp_mast_trim_01_a1;                               // 0x650(0x8)
	Class StaticMeshComponent*                                   shp_mast_trim_01_a2;                               // 0x658(0x8)
	Class StaticMeshComponent*                                   shp_capstan_trim_01_a;                             // 0x660(0x8)
	Class MergedStaticMeshComponent*                             MergedStaticMesh;                                  // 0x668(0x8)
	Class StaticMeshComponent*                                   cmn_walk_plank_01_a1;                              // 0x670(0x8)
	Class StaticMeshComponent*                                   cmn_walk_plank_01_a;                               // 0x678(0x8)
	Class ChildActorComponent*                                   Interior_Captains_Cabin;                           // 0x680(0x8)
	Class ChildActorComponent*                                   Interior_Brig_Deck;                                // 0x688(0x8)
	Class ChildActorComponent*                                   Interior_Map_Deck;                                 // 0x690(0x8)
	Class StaticMeshComponent*                                   shp_stern_staircase_01_a_02;                       // 0x698(0x8)
	Class StaticMeshComponent*                                   shp_stern_staircase_01_a_01;                       // 0x6a0(0x8)
	Class StaticMeshComponent*                                   shp_galleon_main_deck_01_a;                        // 0x6a8(0x8)
};


}