// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x408] - InheritedSize[0x3c8]
class BP_MediumShip_StandardHull_Art_C: public Actor
{
public:
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* None;                                              // 0x3c8(0x8)
	Class PostProcessComponent*                                  None;                                              // 0x3d0(0x8)
	Class BoxComponent*                                          None;                                              // 0x3d8(0x8)
	Class PostProcessComponent*                                  None;                                              // 0x3e0(0x8)
	Class BoxComponent*                                          None;                                              // 0x3e8(0x8)
	Class SurfaceWaterComponent*                                 None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
};


}