// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x30
class BP_MerchantCrate_AnyItemCrate_Wieldable_C: public StaticStorageCrateWieldable
{
public:
	Class BoxComponent*                                          HitVolume;                                         // 0x780(0x8)
	Class AddOpenContainerActionRuleComponent*                   AddOpenContainerActionRule;                        // 0x788(0x8)
	Class PickupableComponent*                                   Pickupable;                                        // 0x790(0x8)
	Class UsableWieldableComponent*                              UsableWieldable;                                   // 0x798(0x8)
	Class WieldableInteractableComponent*                        WieldableInteractable;                             // 0x7a0(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x7a8(0x8)
};


// Size 0x18
class BP_MerchantCrate_AnyItemCrate_Proxy_C: public StorageCrateItemProxy
{
public:
	Class AddOpenContainerActionRuleComponent*                   AddOpenContainerActionRule;                        // 0x7a0(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x7a8(0x8)
	Class InteractableComponent*                                 Interactable;                                      // 0x7b0(0x8)
};


}