// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x728] - InheritedSize[0x6e8]
class BP_MerchantShady_C: public CompanyShopkeeper
{
public:
	struct PointerToUberGraphFrame                               None;                                              // 0x6e8(0x8)
	class CapsuleComponent*                                      None;                                              // 0x6f0(0x8)
	class NPCDialogComponent*                                    None;                                              // 0x6f8(0x8)
	class NPCDialogComponent*                                    None;                                              // 0x700(0x8)
	class MerchantCrateProviderComponent*                        None;                                              // 0x708(0x8)
	class SkeletalMeshComponent*                                 None;                                              // 0x710(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x718(0x8)
	class AnimNotifyWwiseEmitterComponent*                       None;                                              // 0x720(0x8)
};


}