// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0 (Full Size[0x6f8] - InheritedSize[0x658]
class BP_MediumShip_StandardHull_Damage_C: public BP_HullDamage_C
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x658(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x660(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x668(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x670(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x678(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x680(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x688(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x690(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x698(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6a0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6a8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6b0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6b8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6c0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6c8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6d0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6d8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6e0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x6e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6f0(0x8)
};


}