// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class BP_MediumShip_StandardHull_Art_C: public Actor
{
public:
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3c8(0x8)
	Class PostProcessComponent*                                  BattleBoundsPostProcess;                           // 0x3d0(0x8)
	Class BoxComponent*                                          BattleBounds_PP_Volume;                            // 0x3d8(0x8)
	Class PostProcessComponent*                                  FirePostProcess;                                   // 0x3e0(0x8)
	Class BoxComponent*                                          Fire_PP_Volume;                                    // 0x3e8(0x8)
	Class SurfaceWaterComponent*                                 SurfaceWater;                                      // 0x3f0(0x8)
	Class StaticMeshComponent*                                   shp_small_rain_occlusion;                          // 0x3f8(0x8)
	Class StaticMeshComponent*                                   shp_galleon_main_deck_01_a;                        // 0x400(0x8)
};


}