// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x55 (Full Size[0x805] - InheritedSize[0x7b0]
class BP_MediumMapTable_C: public MapTable
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x7b0(0x8)
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x7b8(0x8)
	Class BoxComponent*                                          NavBlocker;                                        // 0x7c0(0x8)
	Class ChildActorComponent*                                   ControlPoint;                                      // 0x7c8(0x8)
	Class ChildActorComponent*                                   ControlPoint;                                      // 0x7d0(0x8)
	Class ChildActorComponent*                                   ControlPoint;                                      // 0x7d8(0x8)
	Class ChildActorComponent*                                   ControlPoint;                                      // 0x7e0(0x8)
	Class TextureFeedbackComponent*                              TextureFeedback;                                   // 0x7e8(0x8)
	Class StaticMeshComponent*                                   Cube;                                              // 0x7f0(0x8)
	Class StaticMeshComponent*                                   Map;                                               // 0x7f8(0x8)
	float                                                        ActiveRange;                                       // 0x800(0x4)
	bool                                                         IsActive;                                          // 0x804(0x1)
};


}