// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0 (Full Size[0xa68] - InheritedSize[0x9c8]
class BP_Mast_C: public Mast
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x9c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9d0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x9d8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x9e0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x9e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa00(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa08(0x8)
	TArray<struct None>                                          None;                                              // 0xa10(0x10)
	TArray<class StaticMeshComponent*>                           None;                                              // 0xa20(0x10)
	TArray<class ChildActorComponent*>                           None;                                              // 0xa30(0x10)
	Class MaterialInstance*                                      None;                                              // 0xa40(0x8)
	TArray<class None*>                                          None;                                              // 0xa48(0x10)
	Class DecalComponent*                                        None;                                              // 0xa58(0x8)
	Class DecalComponent*                                        None;                                              // 0xa60(0x8)
};


}