// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x3f8 (Full Size[0x1c38] - InheritedSize[0x1840]
class BP_MediumShipTemplate_C: public Ship
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x1840(0x8)
	Class ShipRowboatPersistenceComponent*                       ShipRowboatPersistence;                            // 0x1848(0x8)
	Class HarpoonItemLocationComponent*                          HarpoonItemLocation1;                              // 0x1850(0x8)
	Class HarpoonItemLocationComponent*                          HarpoonItemLocation;                               // 0x1858(0x8)
	Class FactionParticleComponent*                              FactionGBowParticles;                              // 0x1860(0x8)
	Class FactionParticleComponent*                              FactionBBowParticles;                              // 0x1868(0x8)
	Class SplashProbeVFXComponent*                               VFX_SplashProbe_Both_Splashes_Details;             // 0x1870(0x8)
	Class SplashProbeVFXComponent*                               VFX_SplashProbe_Both_Splashes_Second;              // 0x1878(0x8)
	Class SplashProbeVFXComponent*                               VFX_SplashProbe_OnShip_Splashes;                   // 0x1880(0x8)
	Class SplashProbeVFXComponent*                               VFX_SplashProbe_Offship_Splashes;                  // 0x1888(0x8)
	Class SplashProbeVFXComponent*                               VFX_SplashProbe_Underwater;                        // 0x1890(0x8)
	Class ParticleSystemComponent*                               vfx_playerships_bubbles_rectangle_Local_VS1;       // 0x1898(0x8)
	Class ParticleSystemComponent*                               vfx_playerships_bubbles_cannon_Local4;             // 0x18a0(0x8)
	Class ParticleSystemComponent*                               vfx_playerships_bubbles_cannon_Local3;             // 0x18a8(0x8)
	Class ParticleSystemComponent*                               vfx_playerships_bubbles_cannon_Local2;             // 0x18b0(0x8)
	Class ParticleSystemComponent*                               vfx_playerships_bubbles_cannon_Local1;             // 0x18b8(0x8)
	Class ParticleSystemComponent*                               vfx_playerships_bubbles_rectangle_Local_VS3;       // 0x18c0(0x8)
	Class ParticleSystemComponent*                               vfx_playerships_bubbles_rectangle_Local_VS2;       // 0x18c8(0x8)
	Class ParticleSystemComponent*                               vfx_playerships_bubbles_rectangle_surface_Huge_Bottom; // 0x18d0(0x8)
	Class ParticleSystemComponent*                               vfx_playerships_bubbles_rectangle_surface_Huge_Top; // 0x18d8(0x8)
	Class SceneComponent*                                        VFX_Scene;                                         // 0x18e0(0x8)
	Class ShipFactionCustomisation*                              ShipFactionCustomisation;                          // 0x18e8(0x8)
	BlueprintGeneratedClass BP_ShipTrinketMountpointManagerComponent_Medium_C* ShipTrinketMountpointManagerComponent_Medium;      // 0x18f0(0x8)
	Class ChildActorComponent*                                   CaptainsLog;                                       // 0x18f8(0x8)
	Class ChildActorComponent*                                   ShipsCrest;                                        // 0x1900(0x8)
	Class ChildActorComponent*                                   Rugs;                                              // 0x1908(0x8)
	Class ChildActorComponent*                                   Drapes;                                            // 0x1910(0x8)
	Class ChildActorComponent*                                   Bed;                                               // 0x1918(0x8)
	Class ShipStorageJettisonComponent*                          ShipStorageJettison;                               // 0x1920(0x8)
	Class ChildActorComponent*                                   VoyageTable;                                       // 0x1928(0x8)
	Class StaticMeshComponent*                                   Rat3;                                              // 0x1930(0x8)
	Class StaticMeshComponent*                                   Rat2;                                              // 0x1938(0x8)
	Class StaticMeshComponent*                                   Rat1;                                              // 0x1940(0x8)
	BlueprintGeneratedClass BP_BedComponent_C*                   BP_BedComponent;                                   // 0x1948(0x8)
	Class RatManagerComponent*                                   RatManager;                                        // 0x1950(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Port_Rear;                                    // 0x1958(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Starboard_Rear;                               // 0x1960(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_MapTable;                                     // 0x1968(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_MapTable;                                     // 0x1970(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Barrel_Front;                                 // 0x1978(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Bed_End;                                      // 0x1980(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Starboard_Front;                              // 0x1988(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Port_Front;                                   // 0x1990(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Starboard_Mid;                                // 0x1998(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Port_Mid;                                     // 0x19a0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Starboard_Rear;                               // 0x19a8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Port_Rear;                                    // 0x19b0(0x8)
	Class AIRegionComponent*                                     AIRegion;                                          // 0x19b8(0x8)
	Class NamedPointsComponent*                                  NamedPoints;                                       // 0x19c0(0x8)
	Class StaticMeshComponent*                                   shp_mid_ladder_gap_hits_01_a;                      // 0x19c8(0x8)
	Class StaticMeshComponent*                                   shp_flag_hole_01_a;                                // 0x19d0(0x8)
	Class ChildActorComponent*                                   BP_EmissaryFlag;                                   // 0x19d8(0x8)
	Class EmissaryFlotsamItemSpawnComponent*                     EmissaryFlotsamItemSpawner;                        // 0x19e0(0x8)
	Class ChildActorComponent*                                   BP_LargeShip_CageLatch_03_b;                       // 0x19e8(0x8)
	Class ChildActorComponent*                                   BP_WaterBarrel;                                    // 0x19f0(0x8)
	Class ChildActorComponent*                                   BP_MediumShip_ServingHatch_Left;                   // 0x19f8(0x8)
	Class ChildActorComponent*                                   BP_MediumShip_ServingHatch_Right;                  // 0x1a00(0x8)
	Class ChildActorComponent*                                   BP_Shroudbreaker;                                  // 0x1a08(0x8)
	Class ChildActorComponent*                                   BP_ShipPetChest;                                   // 0x1a10(0x8)
	Class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x1a18(0x8)
	Class ChildActorComponent*                                   BP_HarpoonLauncher1;                               // 0x1a20(0x8)
	Class ChildActorComponent*                                   BP_HarpoonLauncher;                                // 0x1a28(0x8)
	Class ChildActorComponent*                                   RowboatMountpoint;                                 // 0x1a30(0x8)
	Class ShipTelemetryComponent*                                ShipTelemetry;                                     // 0x1a38(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_06;                               // 0x1a40(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_05;                               // 0x1a48(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_04;                               // 0x1a50(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_03;                               // 0x1a58(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_02;                               // 0x1a60(0x8)
	Class ChildActorComponent*                                   StorageBarrel_LowerDeck17;                         // 0x1a68(0x8)
	Class ChildActorComponent*                                   Figurehead;                                        // 0x1a70(0x8)
	Class ChildActorComponent*                                   BP_MediumShip_StandardHull_Art_Interior_Lower_Deck; // 0x1a78(0x8)
	Class ChildActorComponent*                                   StorageBarrel_LowerDeck16;                         // 0x1a80(0x8)
	Class ChildActorComponent*                                   StorageBarrel_LowerDeck15;                         // 0x1a88(0x8)
	Class ChildActorComponent*                                   StorageBarrel_LowerDeck14;                         // 0x1a90(0x8)
	Class ChildActorComponent*                                   StorageBarrel_LowerDeck13;                         // 0x1a98(0x8)
	Class ChildActorComponent*                                   StorageBarrel_LowerDeck11;                         // 0x1aa0(0x8)
	Class ChildActorComponent*                                   StorageBarrel_LowerDeck9;                          // 0x1aa8(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Food2;                           // 0x1ab0(0x8)
	Class ChildActorComponent*                                   StorageBarrel_LowerDeck7;                          // 0x1ab8(0x8)
	Class ChildActorComponent*                                   StorageBarrel_LowerDeck2;                          // 0x1ac0(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Cannonball3;                     // 0x1ac8(0x8)
	Class ChildActorComponent*                                   StorageBarrel_LowerDeck1;                          // 0x1ad0(0x8)
	Class ChildActorComponent*                                   CannonLeft2;                                       // 0x1ad8(0x8)
	Class ChildActorComponent*                                   CannonRight2;                                      // 0x1ae0(0x8)
	Class ChildActorComponent*                                   LadderStbd;                                        // 0x1ae8(0x8)
	Class ChildActorComponent*                                   MastSecondarySailAngleLeft;                        // 0x1af0(0x8)
	Class ChildActorComponent*                                   MastSecondarySailAngleRight;                       // 0x1af8(0x8)
	Class ChildActorComponent*                                   MastSecondarySailHoistRight;                       // 0x1b00(0x8)
	Class ChildActorComponent*                                   MastSecondarySailHoistLeft;                        // 0x1b08(0x8)
	Class RiggingSystemComponent*                                ControlsRigging;                                   // 0x1b10(0x8)
	Class ChildActorComponent*                                   MastSecondary;                                     // 0x1b18(0x8)
	Class ChildActorComponent*                                   BP_ShipVanityChest;                                // 0x1b20(0x8)
	Class ChildActorComponent*                                   Lanterns;                                          // 0x1b28(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Food;                            // 0x1b30(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Cannonball2;                     // 0x1b38(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Cannonball1;                     // 0x1b40(0x8)
	Class ChildActorComponent*                                   BP_EquipmentChest;                                 // 0x1b48(0x8)
	Class ChildActorComponent*                                   BP_ClothingChest;                                  // 0x1b50(0x8)
	Class ChildActorComponent*                                   BP_WeaponsChest;                                   // 0x1b58(0x8)
	Class ChildActorComponent*                                   BP_MediumMapTable;                                 // 0x1b60(0x8)
	Class ChildActorComponent*                                   Capstan;                                           // 0x1b68(0x8)
	Class ChildActorComponent*                                   GrogBarrel;                                        // 0x1b70(0x8)
	Class ChildActorComponent*                                   MastMainSailAngleLeft;                             // 0x1b78(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Wood;                            // 0x1b80(0x8)
	Class BoxComponent*                                          RammingSpurZone;                                   // 0x1b88(0x8)
	Class StaticMeshComponent*                                   shp_shark_hits_01_a;                               // 0x1b90(0x8)
	Class ChildActorComponent*                                   BP_AmmoChest;                                      // 0x1b98(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_01;                               // 0x1ba0(0x8)
	Class RiggingSystemComponent*                                MainRigging;                                       // 0x1ba8(0x8)
	Class ChildActorComponent*                                   ShipsCompass;                                      // 0x1bb0(0x8)
	Class ChildActorComponent*                                   CannonRight1;                                      // 0x1bb8(0x8)
	Class ChildActorComponent*                                   CannonLeft1;                                       // 0x1bc0(0x8)
	Class ChildActorComponent*                                   LadderPort;                                        // 0x1bc8(0x8)
	Class ChildActorComponent*                                   Hull;                                              // 0x1bd0(0x8)
	Class ChildActorComponent*                                   MastMainSailAngleRight;                            // 0x1bd8(0x8)
	Class ChildActorComponent*                                   MastMainSailHoistRight;                            // 0x1be0(0x8)
	Class ChildActorComponent*                                   MastMainSailHoistLeft;                             // 0x1be8(0x8)
	Class ChildActorComponent*                                   MastMain;                                          // 0x1bf0(0x8)
	Class ChildActorComponent*                                   Anchor;                                            // 0x1bf8(0x8)
	Class ChildActorComponent*                                   Rudder;                                            // 0x1c00(0x8)
	Class ChildActorComponent*                                   Wheel;                                             // 0x1c08(0x8)
	Class ChildActorComponent*                                   AudioBoat;                                         // 0x1c10(0x8)
	byte                                                         Timeline_Disable_Secondary__Direction_4D07E5D94B11FB7BFCD31080D1D1A104; // 0x1c18(0x1)
	char                                                         pad0x7_E65HU[0x7];                                 // 0x1c19(0x7)
	Class TimelineComponent*                                     Timeline_Disable_Secondary;                        // 0x1c20(0x8)
	byte                                                         Timeline_DisableSplash__Direction_F1180A934213087B71070ABD22B1621C; // 0x1c28(0x1)
	char                                                         pad0x7_XG4NN[0x7];                                 // 0x1c29(0x7)
	Class TimelineComponent*                                     Timeline_DisableSplash;                            // 0x1c30(0x8)
};


}