// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0 (Full Size[0xa68] - InheritedSize[0x9c8]
class BP_Mast_C: public Mast
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x9c8(0x8)
	Class StaticMeshComponent*                                   MastTopComponent;                                  // 0x9d0(0x8)
	Class ChildActorComponent*                                   TopgallantActor;                                   // 0x9d8(0x8)
	Class ChildActorComponent*                                   MainsailActor;                                     // 0x9e0(0x8)
	Class ChildActorComponent*                                   TopsailActor;                                      // 0x9e8(0x8)
	Class StaticMeshComponent*                                   Main Yard;                                         // 0x9f0(0x8)
	Class StaticMeshComponent*                                   Topgallant Yard;                                   // 0x9f8(0x8)
	Class StaticMeshComponent*                                   Top Yard;                                          // 0xa00(0x8)
	Class StaticMeshComponent*                                   MastBaseComponent;                                 // 0xa08(0x8)
	TArray<struct Sail Parameters>                               Sail Parameters;                                   // 0xa10(0x10)
	TArray<class StaticMeshComponent*>                           Yards;                                             // 0xa20(0x10)
	TArray<class ChildActorComponent*>                           Sails;                                             // 0xa30(0x10)
	Class MaterialInstance*                                      Sail Material;                                     // 0xa40(0x8)
	TArray<class BP_Sail_C*>                                     SailActors;                                        // 0xa48(0x10)
	Class DecalComponent*                                        DamageDecalRight;                                  // 0xa58(0x8)
	Class DecalComponent*                                        DamageDecalLeft;                                   // 0xa60(0x8)
};


}