#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x68 (Full Size[0x750] - InheritedSize[0x6e8]
class BP_Merchant_C: public CompanyShopkeeper
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x6e8(0x8)
	class CameraComponent*                                       CompanyShopCamera;                                 // 0x6f0(0x8)
	class CameraComponent*                                       NPCDialogCamera;                                   // 0x6f8(0x8)
	class CommodityRedemptionComponent*                          CommodityRedemption;                               // 0x700(0x8)
	class EmissaryMaxRankQuestProvider*                          EmissaryMaxRankQuestProvider;                      // 0x708(0x8)
	class CargoRunParticipantComponent*                          CargoRunParticipant;                               // 0x710(0x8)
	class CapsuleComponent*                                      SolidHits;                                         // 0x718(0x8)
	class NPCDialogComponent*                                    NPCDialogSellCrate;                                // 0x720(0x8)
	class NPCDialogComponent*                                    NPCDialog;                                         // 0x728(0x8)
	class MerchantCrateProviderComponent*                        MerchantCrateProvider;                             // 0x730(0x8)
	class SkeletalMeshComponent*                                 cmp_pocket_watch_mrh_01_e;                         // 0x738(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x740(0x8)
	class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x748(0x8)
};


