// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x198 (Full Size[0x7d0] - InheritedSize[0x638]
class BP_MerchantCrate_BaitBox_ItemInfo_C: public ShipHullAudio
{
public:
	Class ShipAudioEmitterComponent*                             None;                                              // 0x638(0x8)
	Class TritonComponent*                                       None;                                              // 0x640(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x648(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x650(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x658(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x660(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x668(0x8)
	char                                                         pad0x160_CH410[0x160];                             // 0x670(0x160)
};


}