// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class BP_MerchantShady_C: public CompanyShopkeeper
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x688(0x8)
	Class CapsuleComponent*                                      None;                                              // 0x690(0x8)
	Class NPCDialogComponent*                                    None;                                              // 0x698(0x8)
	Class NPCDialogComponent*                                    None;                                              // 0x6a0(0x8)
	Class MerchantCrateProviderComponent*                        None;                                              // 0x6a8(0x8)
	Class SkeletalMeshComponent*                                 None;                                              // 0x6b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6b8(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       None;                                              // 0x6c0(0x8)
};


}