// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x58 (Full Size[0x6f0] - InheritedSize[0x698]
class BP_Merchant_C: public CompanyShopkeeper
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x698(0x8)
	Class CommodityRedemptionComponent*                          None;                                              // 0x6a0(0x8)
	Class EmissaryMaxRankQuestProvider*                          None;                                              // 0x6a8(0x8)
	Class CargoRunParticipantComponent*                          None;                                              // 0x6b0(0x8)
	Class CapsuleComponent*                                      None;                                              // 0x6b8(0x8)
	Class NPCDialogComponent*                                    None;                                              // 0x6c0(0x8)
	Class NPCDialogComponent*                                    None;                                              // 0x6c8(0x8)
	Class MerchantCrateProviderComponent*                        None;                                              // 0x6d0(0x8)
	Class SkeletalMeshComponent*                                 None;                                              // 0x6d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6e0(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       None;                                              // 0x6e8(0x8)
};


}