// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0 (Full Size[0xa38] - InheritedSize[0x998]
class BP_Mast_C: public Mast
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x998(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9a0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x9a8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x9b0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x9b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9d8(0x8)
	TArray<struct None>                                          None;                                              // 0x9e0(0x10)
	TArray<class StaticMeshComponent*>                           None;                                              // 0x9f0(0x10)
	TArray<class ChildActorComponent*>                           None;                                              // 0xa00(0x10)
	Class MaterialInstance*                                      None;                                              // 0xa10(0x8)
	TArray<class None*>                                          None;                                              // 0xa18(0x10)
	Class DecalComponent*                                        None;                                              // 0xa28(0x8)
	Class DecalComponent*                                        None;                                              // 0xa30(0x8)
};


}