// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x228 (Full Size[0x5f0] - InheritedSize[0x3c8]
class BP_out_shop_wld_01_a_C: public Actor
{
public:
	class StaticMeshComponent*                                   bld_out_shop_hanging_wood_02_a;                    // 0x3c8(0x8)
	class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3d0(0x8)
	class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x3d8(0x8)
	class StaticMeshComponent*                                   bld_out_shop_rail_01;                              // 0x3e0(0x8)
	class StaticMeshComponent*                                   bld_out_shop_steps_01;                             // 0x3e8(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_03_a;                            // 0x3f0(0x8)
	class StaticMeshComponent*                                   bld_out_shop_front_sign_01_a;                      // 0x3f8(0x8)
	class StaticMeshComponent*                                   shp_anchor_02_a;                                   // 0x400(0x8)
	class ChildActorComponent*                                   BP_OutpostCrate_bld_shop_wood_box_03_a;            // 0x408(0x8)
	class ChildActorComponent*                                   BP_IslandStorage_Barrel_Outpost;                   // 0x410(0x8)
	class ChildActorComponent*                                   BP_IslandStorage_Barrel_Outpost;                   // 0x418(0x8)
	class PointLightComponent*                                   PointLight7;                                       // 0x420(0x8)
	class PointLightComponent*                                   PointLight6;                                       // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMesh17;                                      // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMesh16;                                      // 0x438(0x8)
	class PointLightComponent*                                   PointLight5;                                       // 0x440(0x8)
	class SpotLightComponent*                                    SpotLight3;                                        // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMesh15;                                      // 0x450(0x8)
	class ChildActorComponent*                                   ChildActor;                                        // 0x458(0x8)
	class StaticMeshComponent*                                   StaticMesh14;                                      // 0x460(0x8)
	class SpotLightComponent*                                    SpotLight2;                                        // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMesh13;                                      // 0x470(0x8)
	class PointLightComponent*                                   PointLight4;                                       // 0x478(0x8)
	class PointLightComponent*                                   PointLight3;                                       // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMesh12;                                      // 0x488(0x8)
	class StaticMeshComponent*                                   StaticMesh11;                                      // 0x490(0x8)
	class ParticleSystemComponent*                               ParticleSystem;                                    // 0x498(0x8)
	class PointLightComponent*                                   PointLight1;                                       // 0x4a0(0x8)
	class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x4a8(0x8)
	class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x4b0(0x8)
	class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x4b8(0x8)
	class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x4c0(0x8)
	class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x4c8(0x8)
	class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x4d0(0x8)
	class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x4d8(0x8)
	class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x4e0(0x8)
	class ChildActorComponent*                                   BP_OutpostCrate_bld_shop_wood_box_01_a;            // 0x4e8(0x8)
	class ChildActorComponent*                                   BP_OutpostCrate_bld_shop_wood_box_02_a;            // 0x4f0(0x8)
	class StaticMeshComponent*                                   StaticMesh3;                                       // 0x4f8(0x8)
	class StaticMeshComponent*                                   StaticMesh2;                                       // 0x500(0x8)
	class ParticleSystemComponent*                               vfx_tavern_candle_looping_01;                      // 0x508(0x8)
	class SpotLightComponent*                                    SpotLight1;                                        // 0x510(0x8)
	class PointLightComponent*                                   PointLight;                                        // 0x518(0x8)
	class SpotLightComponent*                                    SpotLight;                                         // 0x520(0x8)
	class StaticMeshComponent*                                   shp_rope_coil_03_a;                                // 0x528(0x8)
	class StaticMeshComponent*                                   bld_out_shop_workbench_01_a;                       // 0x530(0x8)
	class StaticMeshComponent*                                   bld_out_shop_roof_ship_wheel_01_a;                 // 0x538(0x8)
	class StaticMeshComponent*                                   cmn_lantern_01_a;                                  // 0x540(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x548(0x8)
	class StaticMeshComponent*                                   cmn_skeleton_head_boar_01_a;                       // 0x550(0x8)
	class StaticMeshComponent*                                   cmn_skeleton_head_01_a;                            // 0x558(0x8)
	class StaticMeshComponent*                                   bld_out_shop_wilds_details_01_a;                   // 0x560(0x8)
	class StaticMeshComponent*                                   cmn_bucket_01_a1;                                  // 0x568(0x8)
	class StaticMeshComponent*                                   shp_rope_coil_02_a;                                // 0x570(0x8)
	class StaticMeshComponent*                                   shp_int_hook_01_a;                                 // 0x578(0x8)
	class StaticMeshComponent*                                   shp_kitchen_shelf_01_a;                            // 0x580(0x8)
	class StaticMeshComponent*                                   cmn_bucket_01_a;                                   // 0x588(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_03_a1;                           // 0x590(0x8)
	class StaticMeshComponent*                                   shp_rope_coil_05_a;                                // 0x598(0x8)
	class StaticMeshComponent*                                   bld_out_shop_hatch_01_a;                           // 0x5a0(0x8)
	class StaticMeshComponent*                                   bld_out_shop_drapes_rear_01_a;                     // 0x5a8(0x8)
	class StaticMeshComponent*                                   bld_out_shop_hook_bands_01_a;                      // 0x5b0(0x8)
	class StaticMeshComponent*                                   bld_out_shop_plank_netting_01_a;                   // 0x5b8(0x8)
	class StaticMeshComponent*                                   bld_out_shop_barrel_netting_01_a;                  // 0x5c0(0x8)
	class StaticMeshComponent*                                   bld_out_shop_drapes_front_01_a;                    // 0x5c8(0x8)
	class StaticMeshComponent*                                   bld_out_shop_winch_01_a;                           // 0x5d0(0x8)
	class StaticMeshComponent*                                   bld_out_shop_roof_beam_01_a;                       // 0x5d8(0x8)
	class StaticMeshComponent*                                   bld_out_shop_roof_barrels_01_a;                    // 0x5e0(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x5e8(0x8)
};


}