#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x50 (Full Size[0x3f0] - InheritedSize[0x3a0]
class BP_onboarding_intro_tavern_table_frontend_C: public Actor
{
public:
	class ParticleSystemComponent*                               Candle VFX;                                        // 0x3a0(0x8)
	class StaticMeshComponent*                                   Table;                                             // 0x3a8(0x8)
	class StaticMeshComponent*                                   Tankard 2;                                         // 0x3b0(0x8)
	class StaticMeshComponent*                                   Plate 2;                                           // 0x3b8(0x8)
	class StaticMeshComponent*                                   Candle 3;                                          // 0x3c0(0x8)
	class StaticMeshComponent*                                   Candle 2;                                          // 0x3c8(0x8)
	class StaticMeshComponent*                                   Tankard 1;                                         // 0x3d0(0x8)
	class StaticMeshComponent*                                   Plate 1;                                           // 0x3d8(0x8)
	class StaticMeshComponent*                                   Candle 1;                                          // 0x3e0(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x3e8(0x8)
};


