// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x58 (Full Size[0x420] - InheritedSize[0x3c8]
class BP_onboarding_intro_tavern_table_C: public Actor
{
public:
	Class ParticleSystemComponent*                               Candle VFX;                                        // 0x3c8(0x8)
	Class OnboardingIntroLocationComponent*                      OnboardingIntroLocation;                           // 0x3d0(0x8)
	Class StaticMeshComponent*                                   Table;                                             // 0x3d8(0x8)
	Class StaticMeshComponent*                                   Tankard 2;                                         // 0x3e0(0x8)
	Class StaticMeshComponent*                                   Plate 2;                                           // 0x3e8(0x8)
	Class StaticMeshComponent*                                   Candle 3;                                          // 0x3f0(0x8)
	Class StaticMeshComponent*                                   Candle 2;                                          // 0x3f8(0x8)
	Class StaticMeshComponent*                                   Tankard 1;                                         // 0x400(0x8)
	Class StaticMeshComponent*                                   Plate 1;                                           // 0x408(0x8)
	Class StaticMeshComponent*                                   Candle 1;                                          // 0x410(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x418(0x8)
};


}