// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1a8 (Full Size[0x570] - InheritedSize[0x3c8]
class BP_out_shop_bsp_moving_01_a_C: public Actor
{
public:
	Class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3c8(0x8)
	Class BoxComponent*                                          Box;                                               // 0x3d0(0x8)
	Class StaticMeshComponent*                                   tls_lantern_01_e;                                  // 0x3d8(0x8)
	Class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x3e0(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_decking_01;                           // 0x3e8(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_supports_01;                          // 0x3f0(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_steps_01;                             // 0x3f8(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_roof_01;                              // 0x400(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_rail_01;                              // 0x408(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_front_sign_01_a;                      // 0x410(0x8)
	Class StaticMeshComponent*                                   gmp_bar_stor_01_a;                                 // 0x418(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x420(0x8)
	Class ChildActorComponent*                                   BP_OutpostCrate_bld_shop_wood_box_01_a;            // 0x428(0x8)
	Class ChildActorComponent*                                   BP_OutpostCrate_bld_shop_wood_box_02_a;            // 0x430(0x8)
	Class ChildActorComponent*                                   BP_OutpostIslandCrate_bld_shop_wood_box_03_a;      // 0x438(0x8)
	Class ChildActorComponent*                                   BP_OutpostIslandCrate_bld_shop_wood_box_03_a;      // 0x440(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x448(0x8)
	Class SpotLightComponent*                                    SpotLight2;                                        // 0x450(0x8)
	Class ChildActorComponent*                                   ChildActor;                                        // 0x458(0x8)
	Class ChildActorComponent*                                   wsp_bottle_burner;                                 // 0x460(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x468(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x470(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x478(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x480(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x488(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x490(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x498(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x4a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x4a8(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_candle_looping_01;                      // 0x4b0(0x8)
	Class SpotLightComponent*                                    SpotLight1;                                        // 0x4b8(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x4c0(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x4c8(0x8)
	Class SpotLightComponent*                                    SpotLight;                                         // 0x4d0(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_03_a;                                // 0x4d8(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_workbench_01_a;                       // 0x4e0(0x8)
	Class StaticMeshComponent*                                   cmn_lantern_01_a;                                  // 0x4e8(0x8)
	Class StaticMeshComponent*                                   cmn_bucket_01_a1;                                  // 0x4f0(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_02_a;                                // 0x4f8(0x8)
	Class StaticMeshComponent*                                   shp_int_hook_01_a;                                 // 0x500(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_shelf_01_a;                            // 0x508(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_05_a;                                // 0x510(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_hatch_01_a;                           // 0x518(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_drapes_rear_01_a;                     // 0x520(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_hanging_wood_01_a;                    // 0x528(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_hook_bands_01_a;                      // 0x530(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_plank_netting_01_a;                   // 0x538(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_barrel_netting_01_a;                  // 0x540(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_drapes_front_01_a;                    // 0x548(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_winch_01_a;                           // 0x550(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_roof_beam_01_a;                       // 0x558(0x8)
	Class StaticMeshComponent*                                   bld_out_shop_roof_barrels_01_a;                    // 0x560(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x568(0x8)
};


}