// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa5 (Full Size[0x46d] - InheritedSize[0x3c8]
class BP_Placement_Garden_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3c8(0x8)
	Class BillboardComponent*                                    None;                                              // 0x3d0(0x8)
	Class SphereComponent*                                       None;                                              // 0x3d8(0x8)
	Class SceneComponent*                                        None;                                              // 0x3e0(0x8)
	TArray<struct None>                                          None;                                              // 0x3e8(0x10)
	float                                                        None;                                              // 0x3f8(0x4)
	bool                                                         None;                                              // 0x3fc(0x1)
	char                                                         pad0x3_HWUP3[0x3];                                 // 0x3fd(0x3)
	float                                                        None;                                              // 0x400(0x4)
	float                                                        None;                                              // 0x404(0x4)
	int                                                          None;                                              // 0x408(0x4)
	char                                                         pad0x4_WV8S6[0x4];                                 // 0x40c(0x4)
	TArray<class Object*>                                        None;                                              // 0x410(0x10)
	bool                                                         None;                                              // 0x420(0x1)
	char                                                         pad0x7_0GPNW[0x7];                                 // 0x421(0x7)
	TArray<Float None>                                           None;                                              // 0x428(0x10)
	TArray<class InstancedStaticMeshComponent*>                  None;                                              // 0x438(0x10)
	Struct RandomStream                                          None;                                              // 0x448(0x8)
	int                                                          None;                                              // 0x450(0x4)
	char                                                         pad0x4_SJJ8F[0x4];                                 // 0x454(0x4)
	TArray<struct None>                                          None;                                              // 0x458(0x10)
	float                                                        None;                                              // 0x468(0x4)
	bool                                                         None;                                              // 0x46c(0x1)
};


}