// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xda (Full Size[0x1f2] - InheritedSize[0x118]
class BP_Prompt_VisitCompanyShop_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x118(0x8)
	char                                                         pad0x12a_QTL9T[0x12a];                             // 0x120(0x12a)
	Struct ObjectMessagingHandle                                 Handle_TreasureChestSoldPredictedEvent;            // 0x120(0x48)
	Struct PrioritisedPromptWithHandle                           Prompt_VisitCompanyShop;                           // 0x168(0x68)
	class                                                        Company;                                           // 0x1d0(0x8)
	class                                                        AccessKey;                                         // 0x1d8(0x8)
	class                                                        CompanyRankDesc;                                   // 0x1e0(0x8)
	float                                                        PromptDelayUntilDisplay;                           // 0x1e8(0x4)
	float                                                        PromptDisplayDuration;                             // 0x1ec(0x4)
	bool                                                         IsCorrectCompany;                                  // 0x1f0(0x1)
	bool                                                         PromptInfoSet;                                     // 0x1f1(0x1)
};


}