// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xe1 (Full Size[0x219] - InheritedSize[0x138]
class BP_PromptCoordinator_DiceEmote_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0xed_EF09E[0xed];                               // 0x140(0xed)
	class                                                        DiceEmotePromptAccessKey;                          // 0x140(0x8)
	Struct ObjectMessagingHandle                                 EmoteStartedEvent;                                 // 0x148(0x58)
	Struct PrioritisedPromptWithHandle                           Prompt;                                            // 0x1a0(0x68)
	bool                                                         StartedDiceEmote;                                  // 0x208(0x1)
	char                                                         pad0x7_IPQ4C[0x7];                                 // 0x209(0x7)
	Struct ObjectMessagingDispatcherHandle                       CharacterDispatcher;                               // 0x210(0x8)
	bool                                                         HasShown;                                          // 0x218(0x1)
};


}