// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0
class BP_prem_shop_wsp_closed_01_a_C: public Actor
{
public:
	Class BoxComponent*                                          Box;                                               // 0x3c8(0x8)
	Class TritonComponent*                                       Triton;                                            // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x408(0x8)
	Class StaticMeshComponent*                                   bld_prem_shop_plunder_details_01_a;                // 0x410(0x8)
	Class StaticMeshComponent*                                   bld_prem_shop_01_a;                                // 0x418(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_door_frame_01_a1;                     // 0x420(0x8)
	Class StaticMeshComponent*                                   bld_shops_closed_boards_01_a;                      // 0x428(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_roof_beam_01_a;                       // 0x430(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_chimney_01_a;                         // 0x438(0x8)
	Class StaticMeshComponent*                                   bld_pot_gate_01_a;                                 // 0x440(0x8)
	Class StaticMeshComponent*                                   bld_pot_fence_01_a;                                // 0x448(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_window_01_a3;                         // 0x450(0x8)
	Class StaticMeshComponent*                                   bld_pot_hatch_01_a;                                // 0x458(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_door_01_a;                            // 0x460(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_window_01_a2;                         // 0x468(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_window_01_a1;                         // 0x470(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_window_01_a;                          // 0x478(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x480(0x8)
};


}