// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x5b0 (Full Size[0x6e8] - InheritedSize[0x138]
class BP_Prompt_MaidenVoyage_FishingRodTutorial_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x4c_YDFLP[0x4c];                               // 0x140(0x4c)
	bool                                                         State_RodWielded;                                  // 0x140(0x1)
	bool                                                         State_FishBattling;                                // 0x141(0x1)
	bool                                                         State_CastRod;                                     // 0x142(0x1)
	bool                                                         State_CaughtFish;                                  // 0x143(0x1)
	bool                                                         State_DockWithCannon;                              // 0x144(0x1)
	bool                                                         State_BattleFish;                                  // 0x145(0x1)
	bool                                                         State_FishTired;                                   // 0x146(0x1)
	bool                                                         State_ReelingWhileBattling;                        // 0x147(0x1)
	Struct PrioritisedPromptWithHandle                           Prompt_CastRod;                                    // 0x148(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_WaitForBite;                                // 0x1b0(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_BattleFish;                                 // 0x218(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_ReelFish;                                   // 0x280(0x68)
	Struct ObjectMessagingHandle                                 Handle_WieldRod;                                   // 0x2e8(0x58)
	Struct ObjectMessagingHandle                                 Handle_CastRod;                                    // 0x340(0x58)
	Struct ObjectMessagingHandle                                 Handle_FishBite;                                   // 0x398(0x58)
	Struct ObjectMessagingHandle                                 Handle_FishCaught;                                 // 0x3f0(0x58)
	Struct ObjectMessagingHandle                                 Handle_BattleFish;                                 // 0x448(0x58)
	class                                                        RequiredInput;                                     // 0x4a0(0x8)
	class                                                        WieldedItemType;                                   // 0x4a8(0x8)
	class                                                        Sword_WieldedItemType;                             // 0x4b0(0x8)
	Struct PrioritisedPromptWithHandle                           Prompt_SnapLine;                                   // 0x4b8(0x68)
	Struct ObjectMessagingHandle                                 Handle_ReelingWhileBattling;                       // 0x520(0x58)
	Struct ObjectMessagingHandle                                 Handle_StowRod;                                    // 0x578(0x58)
	bool                                                         FishStartedBattling;                               // 0x5d0(0x1)
	char                                                         pad0x7_2IJ33[0x7];                                 // 0x5d1(0x7)
	Struct ObjectMessagingHandle                                 Handle_FishEscaped;                                // 0x5d8(0x58)
	bool                                                         State_Completed;                                   // 0x630(0x1)
	char                                                         pad0x7_TQB8Z[0x7];                                 // 0x631(0x7)
	Struct ObjectMessagingHandle                                 Handle_PlayerDeath;                                // 0x638(0x58)
	Struct ObjectMessagingHandle                                 Handle_DockToObject;                               // 0x690(0x58)
};


}