// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x148 (Full Size[0x280] - InheritedSize[0x138]
class BP_Prompt_RepairShip_SeaOfThievesOnDemand_C: public BP_PromptCoordinator_Base_C
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x6f_CI2VI[0x6f];                               // 0x140(0x6f)
	bool                                                         State_ShipDamaged;                                 // 0x140(0x1)
	char                                                         pad0x7_V3Y38[0x7];                                 // 0x141(0x7)
	struct ObjectMessagingHandle                                 Handle_OnShipDamaged;                              // 0x148(0x58)
	bool                                                         State_Complete;                                    // 0x1a0(0x1)
	char                                                         pad0x7_LG27P[0x7];                                 // 0x1a1(0x7)
	struct PrioritisedPromptWithHandle                           Prompt_RepairShip;                                 // 0x1a8(0x70)
	struct ObjectMessagingHandle                                 Handle_CurrentShipChanged;                         // 0x218(0x58)
	class Ship*                                                  CurrentShip;                                       // 0x270(0x8)
	int                                                          RepairPromptShownCount;                            // 0x278(0x4)
	int                                                          MaxShowCountPerSession;                            // 0x27c(0x4)
};


}