// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x228 (Full Size[0x360] - InheritedSize[0x138]
class BP_Prompt_CosmeticPurchased_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x138(0x8)
	Struct ObjectMessagingHandle                                 None;                                              // 0x140(0x58)
	Struct ObjectMessagingHandle                                 None;                                              // 0x198(0x58)
	Struct ObjectMessagingHandle                                 None;                                              // 0x1f0(0x58)
	Struct PrioritisedPromptWithHandle                           None;                                              // 0x248(0x70)
	Struct PrioritisedPromptWithHandle                           None;                                              // 0x2b8(0x70)
	class                                                        None;                                              // 0x328(0x8)
	TArray<class Class*>                                         None;                                              // 0x330(0x10)
	TArray<Str None>                                             None;                                              // 0x340(0x10)
	float                                                        None;                                              // 0x350(0x4)
	float                                                        None;                                              // 0x354(0x4)
	float                                                        None;                                              // 0x358(0x4)
	bool                                                         None;                                              // 0x35c(0x1)
	bool                                                         None;                                              // 0x35d(0x1)
	bool                                                         None;                                              // 0x35e(0x1)
	bool                                                         None;                                              // 0x35f(0x1)
};


}