#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x24c (Full Size[0x384] - InheritedSize[0x138]
class BP_PromptCoordinator_AIFormEncountered_C: public BP_PromptCoordinator_Base_C
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0xba_PFURC[0xba];                               // 0x140(0xba)
	struct ObjectMessagingHandle                                 HandlePlayerEncounteredAIForm;                     // 0x140(0x58)
	struct PrioritisedPromptWithHandle                           PromptToShow;                                      // 0x198(0x70)
	struct PrioritisedPromptWithHandle                           PlantPrompt;                                       // 0x208(0x70)
	struct PrioritisedPromptWithHandle                           MetalPrompt;                                       // 0x278(0x70)
	struct PrioritisedPromptWithHandle                           ShadowPrompt;                                      // 0x2e8(0x70)
	float                                                        PromptDelay;                                       // 0x358(0x4)
	char                                                         pad0x4_WRKLY[0x4];                                 // 0x35c(0x4)
	class UClass*                                                AccessKeyToUse;                                    // 0x360(0x8)
	class UClass*                                                PlantAccessKey;                                    // 0x368(0x8)
	class UClass*                                                MetalAccessKey;                                    // 0x370(0x8)
	class UClass*                                                ShadowAccessKey;                                   // 0x378(0x8)
	bool                                                         PlantFormEncountered;                              // 0x380(0x1)
	bool                                                         ShadowFormEncountered;                             // 0x381(0x1)
	bool                                                         MetalFormEncountered;                              // 0x382(0x1)
	bool                                                         PromptInProgress;                                  // 0x383(0x1)
};


