// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x131 (Full Size[0x269] - InheritedSize[0x138]
class BP_PromptCoordinator_Hourglass_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x4c_CVHXA[0x4c];                               // 0x140(0x4c)
	Struct ObjectMessagingHandle                                 HandlePlayerApproachesHourglass;                   // 0x140(0x58)
	bool                                                         PlayerInRange;                                     // 0x198(0x1)
	bool                                                         PromptEvaluated;                                   // 0x199(0x1)
	char                                                         pad0x2_BMCHS[0x2];                                 // 0x19a(0x2)
	float                                                        Prompt Delay;                                      // 0x19c(0x4)
	Struct PrioritisedPromptWithHandle                           PromptHourglassTutorial1;                          // 0x1a0(0x68)
	float                                                        PromptDisplayDuration;                             // 0x208(0x4)
	char                                                         pad0x4_V4LM9[0x4];                                 // 0x20c(0x4)
	Struct ObjectMessagingHandle                                 HandleChoseFaction;                                // 0x210(0x58)
	bool                                                         FactionChosen;                                     // 0x268(0x1)
};


}