// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xd1 (Full Size[0x1e9] - InheritedSize[0x118]
class BP_PromptCoordinator_DiceEmote_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x118(0x8)
	char                                                         pad0xfc_15K1F[0xfc];                               // 0x120(0xfc)
	class                                                        DiceEmotePromptAccessKey;                          // 0x120(0x8)
	Struct ObjectMessagingHandle                                 EmoteStartedEvent;                                 // 0x128(0x48)
	Struct PrioritisedPromptWithHandle                           Prompt;                                            // 0x170(0x68)
	bool                                                         StartedDiceEmote;                                  // 0x1d8(0x1)
	char                                                         pad0x7_PRY8Y[0x7];                                 // 0x1d9(0x7)
	Struct ObjectMessagingDispatcherHandle                       CharacterDispatcher;                               // 0x1e0(0x8)
	bool                                                         HasShown;                                          // 0x1e8(0x1)
};


}