// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xdc (Full Size[0x1d9c] - InheritedSize[0x1cc0]
class BP_PlayerPirate_C: public AthenaPlayerCharacter
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x1cc0(0x8)
	Class WorldVelocityTrackerComponent*                         WorldVelocityTracker;                              // 0x1cc8(0x8)
	Class ChainLightningReceiverComponent*                       ChainLightningReceiver;                            // 0x1cd0(0x8)
	Class StatusApplicationMonitorComponent*                     StatusApplicationMonitor;                          // 0x1cd8(0x8)
	Class ReviveComponent*                                       ReviveComponent;                                   // 0x1ce0(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x1ce8(0x8)
	Class VomitComponent*                                        Vomit;                                             // 0x1cf0(0x8)
	Class NoiseMakerComponent*                                   NoiseMaker;                                        // 0x1cf8(0x8)
	Class PlayerNameplateComponent*                              PlayerNameplate;                                   // 0x1d00(0x8)
	Class BodyLightControllerComponent*                          BodyLightController;                               // 0x1d08(0x8)
	Class AmbientLightSourceComponent*                           BodyLight;                                         // 0x1d10(0x8)
	Class AudioSpaceTrackerComponent*                            AudioSpaceTracker;                                 // 0x1d18(0x8)
	Class PlayerAtmosphericsAudioComponent*                      PlayerAtmosphericsAudio;                           // 0x1d20(0x8)
	BlueprintGeneratedClass BP_CharacterVFXComponent_C*          BP_CharacterVFXComponent;                          // 0x1d28(0x8)
	Class WaterInteractionComponent*                             WaterInteraction;                                  // 0x1d30(0x8)
	BlueprintGeneratedClass BP_CharacterAudioComponent_C*        BP_PlayerAudioComponent;                           // 0x1d38(0x8)
	Class CharacterFootImpactComponent*                          CharacterFootImpact;                               // 0x1d40(0x8)
	Class PlayerOceanAudioComponent*                             PlayerOceanAudio;                                  // 0x1d48(0x8)
	float                                                        TattooGlowDuration;                                // 0x1d50(0x4)
	char                                                         pad0x4_DE43B[0x4];                                 // 0x1d54(0x4)
	Class StaticMesh*                                            CurrentStaticMesh;                                 // 0x1d58(0x8)
	Class SkeletalMesh*                                          CurrentSkeletalMesh;                               // 0x1d60(0x8)
	TArray<class SkeletalMesh*>                                  SkeletalMeshArray;                                 // 0x1d68(0x10)
	TArray<class StaticMesh*>                                    StaticMeshArray;                                   // 0x1d78(0x10)
	bool                                                         IsSkeletalMesh;                                    // 0x1d88(0x1)
	char                                                         pad0x3_WBBX3[0x3];                                 // 0x1d89(0x3)
	int                                                          ItemSelectArray;                                   // 0x1d8c(0x4)
	Struct Vector                                                ItemScale;                                         // 0x1d90(0xc)
};


}