// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xb8 (Full Size[0x1f0] - InheritedSize[0x138]
class BP_Prompt_EmissaryKilledAnotherEmissary_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x4c_16YUA[0x4c];                               // 0x140(0x4c)
	Struct ObjectMessagingHandle                                 Handle_EmissaryKilledAnotherEmissary;              // 0x140(0x58)
	struct FName                                                 CompanyName;                                       // 0x198(0x8)
	struct FName                                                 VictimCompanyName;                                 // 0x1a0(0x8)
	bool                                                         SurfacedThisSession;                               // 0x1a8(0x1)
	char                                                         pad0x3_O9FIC[0x3];                                 // 0x1a9(0x3)
	struct FName                                                 ExpectedCompanyName;                               // 0x1ac(0x8)
	char                                                         pad0x4_HJQJD[0x4];                                 // 0x1b4(0x4)
	TArray<struct FName>                                         ExpectedVictimCompanyName;                         // 0x1b8(0x10)
	TArray<struct Prompts>                                       Prompts;                                           // 0x1c8(0x10)
	class                                                        PromptAccessKey;                                   // 0x1d8(0x8)
	int                                                          PromptIndex;                                       // 0x1e0(0x4)
	int                                                          NumberOfPrompts;                                   // 0x1e4(0x4)
	float                                                        InitialDelay;                                      // 0x1e8(0x4)
	float                                                        ShowPromptDuration;                                // 0x1ec(0x4)
};


}