// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xe9 (Full Size[0x221] - InheritedSize[0x138]
class BP_PromptCoordinator_DiceEmote_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x138(0x8)
	class                                                        None;                                              // 0x140(0x8)
	Struct ObjectMessagingHandle                                 None;                                              // 0x148(0x58)
	Struct PrioritisedPromptWithHandle                           None;                                              // 0x1a0(0x70)
	bool                                                         None;                                              // 0x210(0x1)
	char                                                         pad0x7_ZLS2Q[0x7];                                 // 0x211(0x7)
	Struct ObjectMessagingDispatcherHandle                       None;                                              // 0x218(0x8)
	bool                                                         None;                                              // 0x220(0x1)
};


}