// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xe8 (Full Size[0x220] - InheritedSize[0x138]
class BP_Prompt_TunnelOfTheDamned_BootyWillBeLost_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x138(0x8)
	Struct ObjectMessagingHandle                                 None;                                              // 0x140(0x58)
	Struct PrioritisedPromptWithHandle                           None;                                              // 0x198(0x70)
	float                                                        None;                                              // 0x208(0x4)
	bool                                                         None;                                              // 0x20c(0x1)
	bool                                                         None;                                              // 0x20d(0x1)
	char                                                         pad0x2_ASIDK[0x2];                                 // 0x20e(0x2)
	float                                                        None;                                              // 0x210(0x4)
	char                                                         pad0x4_O4GO8[0x4];                                 // 0x214(0x4)
	Class TunnelsOfTheDamnedLootFilterDataAsset*                 None;                                              // 0x218(0x8)
};


}