#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xf1 (Full Size[0x229] - InheritedSize[0x138]
class BP_PromptCoordinator_CargoPickUp_Rum_C: public BP_PromptCoordinator_Base_C
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0xb0_9PSO5[0xb0];                               // 0x140(0xb0)
	struct ObjectMessagingHandle                                 HandleForCargoPickUp;                              // 0x140(0x58)
	bool                                                         PickedUpRum;                                       // 0x198(0x1)
	char                                                         pad0x7_C0P79[0x7];                                 // 0x199(0x7)
	struct PrioritisedPromptWithHandle                           PromptRum;                                         // 0x1a0(0x70)
	bool                                                         Shown;                                             // 0x210(0x1)
	char                                                         pad0x7_5MNRJ[0x7];                                 // 0x211(0x7)
	TArray<struct Name>                                          RumType;                                           // 0x218(0x10)
	bool                                                         Result;                                            // 0x228(0x1)
};


