// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x21a (Full Size[0x352] - InheritedSize[0x138]
class BP_Prompt_ChooseFaction_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x4c_MRSMN[0x4c];                               // 0x140(0x4c)
	Struct ObjectMessagingHandle                                 HandleChoseFaction;                                // 0x140(0x58)
	Struct PrioritisedPromptWithHandle                           PromptPirateLord1;                                 // 0x198(0x68)
	Struct PrioritisedPromptWithHandle                           PromptFlameheart1;                                 // 0x200(0x68)
	Struct PrioritisedPromptWithHandle                           PromptFlameheart2;                                 // 0x268(0x68)
	Struct PrioritisedPromptWithHandle                           PromptPirateLord2;                                 // 0x2d0(0x68)
	float                                                        PromptDelay;                                       // 0x338(0x4)
	float                                                        PromptDisplayDuration;                             // 0x33c(0x4)
	bool                                                         FactionPromptFinished;                             // 0x340(0x1)
	bool                                                         FactionChosen;                                     // 0x341(0x1)
	char                                                         pad0x6_D60XU[0x6];                                 // 0x342(0x6)
	class                                                        CurrentFaction;                                    // 0x348(0x8)
	bool                                                         WarmapOpen;                                        // 0x350(0x1)
	bool                                                         WarMapPromptFinished;                              // 0x351(0x1)
};


}