// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xf1 (Full Size[0x229] - InheritedSize[0x138]
class BP_PromptCoordinator_CargoPickUp_Cloth_C: public BP_PromptCoordinator_Base_C
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x6f_5X161[0x6f];                               // 0x140(0x6f)
	struct ObjectMessagingHandle                                 HandleForCargoPickUp;                              // 0x140(0x58)
	bool                                                         PickedUpCloth;                                     // 0x198(0x1)
	char                                                         pad0x7_VCD39[0x7];                                 // 0x199(0x7)
	struct PrioritisedPromptWithHandle                           PromptCloth;                                       // 0x1a0(0x70)
	bool                                                         Shown;                                             // 0x210(0x1)
	char                                                         pad0x7_9UFEU[0x7];                                 // 0x211(0x7)
	TArray<struct FName>                                         ClothType;                                         // 0x218(0x10)
	bool                                                         Result;                                            // 0x228(0x1)
};


}