// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xe5 (Full Size[0x21d] - InheritedSize[0x138]
class BP_Prompt_GuildEmissary_C: public BP_PromptCoordinator_Base_C
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x150_7G9Y2[0x150];                             // 0x140(0x150)
	struct ObjectMessagingHandle                                 HandleGuildEmissary;                               // 0x140(0x58)
	bool                                                         PromptEvaluated;                                   // 0x198(0x1)
	char                                                         pad0x3_LG45D[0x3];                                 // 0x199(0x3)
	float                                                        PromptDelay;                                       // 0x19c(0x4)
	struct PrioritisedPromptWithHandle                           PromptGuildEmissary;                               // 0x1a0(0x70)
	float                                                        PromptDisplayDuration;                             // 0x210(0x4)
	int                                                          OldGuildLevel;                                     // 0x214(0x4)
	int                                                          CurrentGuildLevel;                                 // 0x218(0x4)
	bool                                                         IsTriggeredSpawned;                                // 0x21c(0x1)
};


}