// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x44
class BP_PlayerPirate_Ghost_C: public AthenaGhostPlayerCharacter
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x1bf0(0x8)
	BlueprintGeneratedClass BP_GhostCharacterAudioComponent_C*   BP_GhostCharacterAudioComponent;                   // 0x1bf8(0x8)
	Class WaterInteractionComponent*                             WaterInteraction;                                  // 0x1c00(0x8)
	Class PlayerNameplateComponent*                              PlayerNameplate;                                   // 0x1c08(0x8)
	Class BodyLightControllerComponent*                          BodyLightController;                               // 0x1c10(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x1c18(0x8)
	Class AmbientLightSourceComponent*                           BodyLight;                                         // 0x1c20(0x8)
	Class CharacterFootImpactComponent*                          CharacterFootImpact;                               // 0x1c28(0x8)
	float                                                        Default Ghost Parameter;                           // 0x1c30(0x4)
};


}