// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xdc
class BP_PlayerPirate_C: public AthenaPlayerCharacter
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x1af0(0x8)
	Class WorldVelocityTrackerComponent*                         WorldVelocityTracker;                              // 0x1af8(0x8)
	Class ChainLightningReceiverComponent*                       ChainLightningReceiver;                            // 0x1b00(0x8)
	Class StatusApplicationMonitorComponent*                     StatusApplicationMonitor;                          // 0x1b08(0x8)
	Class ReviveComponent*                                       ReviveComponent;                                   // 0x1b10(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x1b18(0x8)
	Class VomitComponent*                                        Vomit;                                             // 0x1b20(0x8)
	Class NoiseMakerComponent*                                   NoiseMaker;                                        // 0x1b28(0x8)
	Class PlayerNameplateComponent*                              PlayerNameplate;                                   // 0x1b30(0x8)
	Class BodyLightControllerComponent*                          BodyLightController;                               // 0x1b38(0x8)
	Class AmbientLightSourceComponent*                           BodyLight;                                         // 0x1b40(0x8)
	Class AudioSpaceTrackerComponent*                            AudioSpaceTracker;                                 // 0x1b48(0x8)
	Class PlayerAtmosphericsAudioComponent*                      PlayerAtmosphericsAudio;                           // 0x1b50(0x8)
	BlueprintGeneratedClass BP_CharacterVFXComponent_C*          BP_CharacterVFXComponent;                          // 0x1b58(0x8)
	Class WaterInteractionComponent*                             WaterInteraction;                                  // 0x1b60(0x8)
	BlueprintGeneratedClass BP_CharacterAudioComponent_C*        BP_PlayerAudioComponent;                           // 0x1b68(0x8)
	Class CharacterFootImpactComponent*                          CharacterFootImpact;                               // 0x1b70(0x8)
	Class PlayerOceanAudioComponent*                             PlayerOceanAudio;                                  // 0x1b78(0x8)
	float                                                        TattooGlowDuration;                                // 0x1b80(0x4)
	Class StaticMesh*                                            CurrentStaticMesh;                                 // 0x1b88(0x8)
	Class SkeletalMesh*                                          CurrentSkeletalMesh;                               // 0x1b90(0x8)
	TArray<class SkeletalMeshArray*>                             SkeletalMeshArray;                                 // 0x1b98(0x10)
	TArray<class StaticMeshArray*>                               StaticMeshArray;                                   // 0x1ba8(0x10)
	bool                                                         IsSkeletalMesh;                                    // 0x1bb8(0x1)
	int                                                          ItemSelectArray;                                   // 0x1bbc(0x4)
	Struct Vector                                                ItemScale;                                         // 0x1bc0(0xc)
};


}