// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xdc (Full Size[0x214] - InheritedSize[0x138]
class BP_PromptCoordinator_FindAmmo_C: public BP_PromptCoordinator_Base_C
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x6f_7OXZT[0x6f];                               // 0x140(0x6f)
	struct ObjectMessagingHandle                                 AmmoChangedEventHandle;                            // 0x140(0x58)
	bool                                                         HasAmmoChanged;                                    // 0x198(0x1)
	bool                                                         HasShown;                                          // 0x199(0x1)
	char                                                         pad0x6_5FD6V[0x6];                                 // 0x19a(0x6)
	struct PrioritisedPromptWithHandle                           PromptToShow;                                      // 0x1a0(0x70)
	float                                                        PromptDuration;                                    // 0x210(0x4)
};


}