// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x228 (Full Size[0x360] - InheritedSize[0x138]
class BP_Prompt_CosmeticPurchased_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x117_KI27S[0x117];                             // 0x140(0x117)
	Struct ObjectMessagingHandle                                 Handle_OfferPurchasedEvent;                        // 0x140(0x58)
	Struct ObjectMessagingHandle                                 Handle_ShopClosedEvent;                            // 0x198(0x58)
	Struct ObjectMessagingHandle                                 Handle_PlayerEntitlementUpdatedEvent;              // 0x1f0(0x58)
	Struct PrioritisedPromptWithHandle                           Prompt_CosmeticPurchased;                          // 0x248(0x70)
	Struct PrioritisedPromptWithHandle                           Prompt_VisitCustomizationChest;                    // 0x2b8(0x70)
	class                                                        AccessKey;                                         // 0x328(0x8)
	TArray<class Class*>                                         CategoryTypes;                                     // 0x330(0x10)
	TArray<Str PurchasedEntitlementIds>                          PurchasedEntitlementIds;                           // 0x340(0x10)
	float                                                        DelayUntilPromptDisplays;                          // 0x350(0x4)
	float                                                        DelayBetweenPrompts;                               // 0x354(0x4)
	float                                                        PromptDisplayDuration;                             // 0x358(0x4)
	bool                                                         CosmeticPurchased;                                 // 0x35c(0x1)
	bool                                                         PromptInfoSet;                                     // 0x35d(0x1)
	bool                                                         DisplayingPrompts;                                 // 0x35e(0x1)
	bool                                                         ProcessingPurchase;                                // 0x35f(0x1)
};


}