// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xe8
class BP_PiratePreview_C: public PiratePreviewActor
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x7c0(0x8)
	Class ArrowComponent*                                        Camera_Behind;                                     // 0x7c8(0x8)
	Class ArrowComponent*                                        Camera_SideViewLeft;                               // 0x7d0(0x8)
	Class ArrowComponent*                                        Camera_SideView;                                   // 0x7d8(0x8)
	Class ArrowComponent*                                        Camera_ProfileImage;                               // 0x7e0(0x8)
	Class ArrowComponent*                                        Head_old;                                          // 0x7e8(0x8)
	Class ArrowComponent*                                        Camera_Hat;                                        // 0x7f0(0x8)
	Class ArrowComponent*                                        Camera_Gloves;                                     // 0x7f8(0x8)
	Class ArrowComponent*                                        Camera_Boots;                                      // 0x800(0x8)
	Class ArrowComponent*                                        Camera_PegLeg;                                     // 0x808(0x8)
	Class ArrowComponent*                                        Camera_Hook;                                       // 0x810(0x8)
	Class ArrowComponent*                                        Camera_Glove;                                      // 0x818(0x8)
	Class ArrowComponent*                                        Camera_Torso;                                      // 0x820(0x8)
	Class ArrowComponent*                                        Camera_Mid;                                        // 0x828(0x8)
	Class ArrowComponent*                                        Camera_Legs;                                       // 0x830(0x8)
	Class ArrowComponent*                                        Camera_Feet;                                       // 0x838(0x8)
	Class ArrowComponent*                                        Camera_Head;                                       // 0x840(0x8)
	Class ArrowComponent*                                        Camera_Default;                                    // 0x848(0x8)
	Class ChildActorComponent*                                   ChildActor;                                        // 0x850(0x8)
	Class SkeletalMeshComponent*                                 HiddenDftMesh;                                     // 0x858(0x8)
	Class SkeletalMeshComponent*                                 PirateMesh;                                        // 0x860(0x8)
	Class CameraComponent*                                       Camera;                                            // 0x868(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x870(0x8)
};


}