#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x191 (Full Size[0x619] - InheritedSize[0x488]
class BP_PirateGenerator_LineUp_C: public PosablePirate
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x488(0x8)
	class CapsuleComponent*                                      Capsule;                                           // 0x490(0x8)
	class ParticleSystemComponent*                               GhostParticlesOut;                                 // 0x498(0x8)
	class ParticleSystemComponent*                               GhostParticlesIn;                                  // 0x4a0(0x8)
	class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x4a8(0x8)
	class SkeletalMeshComponent*                                 SkeletalProp;                                      // 0x4b0(0x8)
	class StaticMeshComponent*                                   StaticPropSecondary;                               // 0x4b8(0x8)
	class SkeletalMeshComponent*                                 SkeletalPropSecondary;                             // 0x4c0(0x8)
	class StaticMeshComponent*                                   StaticProp;                                        // 0x4c8(0x8)
	struct FString                                               ForceShape;                                        // 0x4d0(0x10)
	struct BP_LineUp_Animation                                   Animation;                                         // 0x4e0(0xc8)
	animblueprintgeneratedclass BP_Anim_CharacterSelect_C*       CharacterSelectAnimgraph;                          // 0x5a8(0x8)
	float                                                        ZoomTime;                                          // 0x5b0(0x4)
	float                                                        GhostTransitionOutTime;                            // 0x5b4(0x4)
	float                                                        GhostTransitionInTime;                             // 0x5b8(0x4)
	bool                                                         GhostTransitioning;                                // 0x5bc(0x1)
	char                                                         pad0x3_HM36B[0x3];                                 // 0x5bd(0x3)
	int                                                          PoseIndex;                                         // 0x5c0(0x4)
	char                                                         pad0x4_NDD0Y[0x4];                                 // 0x5c4(0x4)
	class AnimationSwitchDataAsset*                              AnimationSwitch;                                   // 0x5c8(0x8)
	class AnimationDataStoreAsset*                               AnimationAsset;                                    // 0x5d0(0x8)
	bool                                                         Initialized;                                       // 0x5d8(0x1)
	char                                                         pad0x7_89VQB[0x7];                                 // 0x5d9(0x7)
	bool                                                         IsHighlighted;                                     // 0x5f0(0x1)
	bool                                                         IsInShipSelect;                                    // 0x5f1(0x1)
	char                                                         pad0x2_KQCZR[0x2];                                 // 0x5f2(0x2)
	float                                                        ShipSelectVariantTimer;                            // 0x5f4(0x4)
	float                                                        ShipSelectVariantTimerMax;                         // 0x5f8(0x4)
	int                                                          ShipSelectAnimCountMax;                            // 0x5fc(0x4)
	int                                                          ShipSelectVariantAnimIndex;                        // 0x600(0x4)
	bool                                                         IsPlayingShipSelectVariant;                        // 0x604(0x1)
	char                                                         pad0x3_HU0BG[0x3];                                 // 0x605(0x3)
	class AnimSequence*                                          ShipSelectAnimToPlay;                              // 0x608(0x8)
	class AnimSequence*                                          ShipSelectPropAnimToPlay;                          // 0x610(0x8)
	bool                                                         ShipSelectAnimStarted;                             // 0x618(0x1)
};


