// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x408] - InheritedSize[0x3c8]
class BP_Placement_HeightDrop_C: public Actor
{
public:
	Class SceneComponent*                                        None;                                              // 0x3c8(0x8)
	bool                                                         None;                                              // 0x3d0(0x1)
	char                                                         pad0x3_Z9VBL[0x3];                                 // 0x3d1(0x3)
	float                                                        None;                                              // 0x3d4(0x4)
	bool                                                         None;                                              // 0x3d8(0x1)
	char                                                         pad0x3_A5U4J[0x3];                                 // 0x3d9(0x3)
	float                                                        None;                                              // 0x3dc(0x4)
	TArray<class SceneComponent*>                                None;                                              // 0x3e0(0x10)
	bool                                                         None;                                              // 0x3f0(0x1)
	bool                                                         None;                                              // 0x3f1(0x1)
	char                                                         pad0x2_J126Z[0x2];                                 // 0x3f2(0x2)
	float                                                        None;                                              // 0x3f4(0x4)
	TArray<class PhysicalMaterial*>                              None;                                              // 0x3f8(0x10)
};


}