// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x140 (Full Size[0x258] - InheritedSize[0x118]
class BP_Prompt_VisitSeapost_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x118(0x8)
	char                                                         pad0x12b_VSFCP[0x12b];                             // 0x120(0x12b)
	Struct ObjectMessagingHandle                                 Handle_EventObjectWielded;                         // 0x120(0x48)
	Struct PrioritisedPromptWithHandle                           Prompt_WieledFishOrMeat;                           // 0x168(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_VisitSeapost;                               // 0x1d0(0x68)
	bool                                                         IsWieldingMeatOrFish;                              // 0x238(0x1)
	char                                                         pad0x3_PS2WR[0x3];                                 // 0x239(0x3)
	float                                                        DisplayDuration;                                   // 0x23c(0x4)
	float                                                        DelayUntilNextPrompt;                              // 0x240(0x4)
	char                                                         pad0x4_SHEMI[0x4];                                 // 0x244(0x4)
	TArray<class Class*>                                         IgnoredFood;                                       // 0x248(0x10)
};


}