// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1a8 (Full Size[0x2e0] - InheritedSize[0x138]
class BP_Prompt_RepairShipHullHole_C: public BP_PromptCoordinator_Base_C
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x6f_MAJW5[0x6f];                               // 0x140(0x6f)
	bool                                                         ShipIsLeaking;                                     // 0x140(0x1)
	char                                                         pad0x7_NBIOK[0x7];                                 // 0x141(0x7)
	struct ObjectMessagingHandle                                 Handle_OnShipDamaged;                              // 0x148(0x58)
	bool                                                         State_Complete;                                    // 0x1a0(0x1)
	char                                                         pad0x7_AQ3ZR[0x7];                                 // 0x1a1(0x7)
	struct ObjectMessagingHandle                                 Handle_CurrentShipChanged;                         // 0x1a8(0x58)
	class Ship*                                                  CurrentShip;                                       // 0x200(0x8)
	int                                                          RepairPromptShownCount;                            // 0x208(0x4)
	int                                                          MaxShowCountPerSession;                            // 0x20c(0x4)
	struct PrioritisedPromptWithHandle                           RepairShipHolePrompt;                              // 0x210(0x70)
	bool                                                         HasIncrementedPromptCounter;                       // 0x280(0x1)
	bool                                                         HasShipTakenDamage;                                // 0x281(0x1)
	char                                                         pad0x6_AYR0K[0x6];                                 // 0x282(0x6)
	struct ObjectMessagingHandle                                 Handle_CurrentShipStartedSinking;                  // 0x288(0x58)
};


}