#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xf8 (Full Size[0x908] - InheritedSize[0x810]
class BP_PiratePreview_C: public PiratePreviewActor
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x810(0x8)
	class ArrowComponent*                                        Camera_PushUpSide;                                 // 0x818(0x8)
	class ArrowComponent*                                        Camera_PushUps;                                    // 0x820(0x8)
	class ArrowComponent*                                        Camera_Behind;                                     // 0x828(0x8)
	class ArrowComponent*                                        Camera_SideViewLeft;                               // 0x830(0x8)
	class ArrowComponent*                                        Camera_SideView;                                   // 0x838(0x8)
	class ArrowComponent*                                        Camera_ProfileImage;                               // 0x840(0x8)
	class ArrowComponent*                                        Head_old;                                          // 0x848(0x8)
	class ArrowComponent*                                        Camera_Hat;                                        // 0x850(0x8)
	class ArrowComponent*                                        Camera_Gloves;                                     // 0x858(0x8)
	class ArrowComponent*                                        Camera_Boots;                                      // 0x860(0x8)
	class ArrowComponent*                                        Camera_PegLeg;                                     // 0x868(0x8)
	class ArrowComponent*                                        Camera_Hook;                                       // 0x870(0x8)
	class ArrowComponent*                                        Camera_Glove;                                      // 0x878(0x8)
	class ArrowComponent*                                        Camera_Torso;                                      // 0x880(0x8)
	class ArrowComponent*                                        Camera_Mid;                                        // 0x888(0x8)
	class ArrowComponent*                                        Camera_Legs;                                       // 0x890(0x8)
	class ArrowComponent*                                        Camera_Feet;                                       // 0x898(0x8)
	class ArrowComponent*                                        Camera_Head;                                       // 0x8a0(0x8)
	class ArrowComponent*                                        Camera_Default;                                    // 0x8a8(0x8)
	class ChildActorComponent*                                   ChildActor;                                        // 0x8b0(0x8)
	class SkeletalMeshComponent*                                 HiddenDftMesh;                                     // 0x8b8(0x8)
	class SkeletalMeshComponent*                                 PirateMesh;                                        // 0x8c0(0x8)
	class CameraComponent*                                       Camera;                                            // 0x8c8(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x8d0(0x8)
	char                                                         pad0x30_7SVN4[0x30];                               // 0x8d8(0x30)
};


