// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x44 (Full Size[0x1e54] - InheritedSize[0x1e10]
class BP_PlayerPirate_Ghost_C: public AthenaGhostPlayerCharacter
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x1e10(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1e18(0x8)
	Class WaterInteractionComponent*                             None;                                              // 0x1e20(0x8)
	Class PlayerNameplateComponent*                              None;                                              // 0x1e28(0x8)
	Class BodyLightControllerComponent*                          None;                                              // 0x1e30(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       None;                                              // 0x1e38(0x8)
	Class AmbientLightSourceComponent*                           None;                                              // 0x1e40(0x8)
	Class CharacterFootImpactComponent*                          None;                                              // 0x1e48(0x8)
	float                                                        None;                                              // 0x1e50(0x4)
};


}