// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x44
class BP_PlayerPirate_Ghost_C: public AthenaGhostPlayerCharacter
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x1bb0(0x8)
	BlueprintGeneratedClass BP_GhostCharacterAudioComponent_C*   BP_GhostCharacterAudioComponent;                   // 0x1bb8(0x8)
	Class WaterInteractionComponent*                             WaterInteraction;                                  // 0x1bc0(0x8)
	Class PlayerNameplateComponent*                              PlayerNameplate;                                   // 0x1bc8(0x8)
	Class BodyLightControllerComponent*                          BodyLightController;                               // 0x1bd0(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x1bd8(0x8)
	Class AmbientLightSourceComponent*                           BodyLight;                                         // 0x1be0(0x8)
	Class CharacterFootImpactComponent*                          CharacterFootImpact;                               // 0x1be8(0x8)
	float                                                        Default Ghost Parameter;                           // 0x1bf0(0x4)
};


}