// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xdc
class BP_PlayerPirate_C: public AthenaPlayerCharacter
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x1c70(0x8)
	Class WorldVelocityTrackerComponent*                         WorldVelocityTracker;                              // 0x1c78(0x8)
	Class ChainLightningReceiverComponent*                       ChainLightningReceiver;                            // 0x1c80(0x8)
	Class StatusApplicationMonitorComponent*                     StatusApplicationMonitor;                          // 0x1c88(0x8)
	Class ReviveComponent*                                       ReviveComponent;                                   // 0x1c90(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x1c98(0x8)
	Class VomitComponent*                                        Vomit;                                             // 0x1ca0(0x8)
	Class NoiseMakerComponent*                                   NoiseMaker;                                        // 0x1ca8(0x8)
	Class PlayerNameplateComponent*                              PlayerNameplate;                                   // 0x1cb0(0x8)
	Class BodyLightControllerComponent*                          BodyLightController;                               // 0x1cb8(0x8)
	Class AmbientLightSourceComponent*                           BodyLight;                                         // 0x1cc0(0x8)
	Class AudioSpaceTrackerComponent*                            AudioSpaceTracker;                                 // 0x1cc8(0x8)
	Class PlayerAtmosphericsAudioComponent*                      PlayerAtmosphericsAudio;                           // 0x1cd0(0x8)
	BlueprintGeneratedClass BP_CharacterVFXComponent_C*          BP_CharacterVFXComponent;                          // 0x1cd8(0x8)
	Class WaterInteractionComponent*                             WaterInteraction;                                  // 0x1ce0(0x8)
	BlueprintGeneratedClass BP_CharacterAudioComponent_C*        BP_PlayerAudioComponent;                           // 0x1ce8(0x8)
	Class CharacterFootImpactComponent*                          CharacterFootImpact;                               // 0x1cf0(0x8)
	Class PlayerOceanAudioComponent*                             PlayerOceanAudio;                                  // 0x1cf8(0x8)
	float                                                        TattooGlowDuration;                                // 0x1d00(0x4)
	Class StaticMesh*                                            CurrentStaticMesh;                                 // 0x1d08(0x8)
	Class SkeletalMesh*                                          CurrentSkeletalMesh;                               // 0x1d10(0x8)
	TArray<class SkeletalMesh*>                                  SkeletalMeshArray;                                 // 0x1d18(0x10)
	TArray<class StaticMesh*>                                    StaticMeshArray;                                   // 0x1d28(0x10)
	bool                                                         IsSkeletalMesh;                                    // 0x1d38(0x1)
	int                                                          ItemSelectArray;                                   // 0x1d3c(0x4)
	Struct Vector                                                ItemScale;                                         // 0x1d40(0xc)
};


}