// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x130
class BP_PromptCoordinator_Hourglass_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x118(0x8)
	Struct ObjectMessagingHandle                                 HandlePlayerApproachesHourglass;                   // 0x120(0x48)
	bool                                                         PlayerInRange;                                     // 0x168(0x1)
	bool                                                         PromptEvaluated;                                   // 0x169(0x1)
	float                                                        Prompt Delay;                                      // 0x16c(0x4)
	Struct PrioritisedPromptWithHandle                           PromptHourglassTutorial1;                          // 0x170(0x68)
	float                                                        PromptDisplayDuration;                             // 0x1d8(0x4)
	Struct PrioritisedPromptWithHandle                           PromptHourglassTutorial2;                          // 0x1e0(0x68)
};


}