#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xe9 (Full Size[0x221] - InheritedSize[0x138]
class BP_PromptCoordinator_DiceEmote_C: public BP_PromptCoordinator_Base_C
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0xb0_Q4PIT[0xb0];                               // 0x140(0xb0)
	class UClass*                                                DiceEmotePromptAccessKey;                          // 0x140(0x8)
	struct ObjectMessagingHandle                                 EmoteStartedEvent;                                 // 0x148(0x58)
	struct PrioritisedPromptWithHandle                           Prompt;                                            // 0x1a0(0x70)
	bool                                                         StartedDiceEmote;                                  // 0x210(0x1)
	char                                                         pad0x7_ZYZ4J[0x7];                                 // 0x211(0x7)
	struct ObjectMessagingDispatcherHandle                       CharacterDispatcher;                               // 0x218(0x8)
	bool                                                         HasShown;                                          // 0x220(0x1)
};


