// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x111 (Full Size[0x229] - InheritedSize[0x118]
class BP_PromptCoordinator_Hourglass_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x118(0x8)
	char                                                         pad0x93_AGCEA[0x93];                               // 0x120(0x93)
	Struct ObjectMessagingHandle                                 HandlePlayerApproachesHourglass;                   // 0x120(0x48)
	bool                                                         PlayerInRange;                                     // 0x168(0x1)
	bool                                                         PromptEvaluated;                                   // 0x169(0x1)
	char                                                         pad0x2_482AO[0x2];                                 // 0x16a(0x2)
	float                                                        Prompt Delay;                                      // 0x16c(0x4)
	Struct PrioritisedPromptWithHandle                           PromptHourglassTutorial1;                          // 0x170(0x68)
	float                                                        PromptDisplayDuration;                             // 0x1d8(0x4)
	char                                                         pad0x4_6RQ8T[0x4];                                 // 0x1dc(0x4)
	Struct ObjectMessagingHandle                                 HandleChoseFaction;                                // 0x1e0(0x48)
	bool                                                         FactionChosen;                                     // 0x228(0x1)
};


}