// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x194 (Full Size[0x2cc] - InheritedSize[0x138]
class BP_Prompt_UseAMermaid_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x4c_A2NZC[0x4c];                               // 0x140(0x4c)
	bool                                                         State_IsThereAMermaid;                             // 0x140(0x1)
	char                                                         pad0x7_2NMV9[0x7];                                 // 0x141(0x7)
	Struct ObjectMessagingHandle                                 Handle_OnMermaidActivatedLocally;                  // 0x148(0x58)
	Struct ObjectMessagingHandle                                 Handle_OnMermaidDeactivatedLocally;                // 0x1a0(0x58)
	Struct ObjectMessagingHandle                                 Handle_OnMermaidUsed;                              // 0x1f8(0x58)
	bool                                                         State_MermaidUsed;                                 // 0x250(0x1)
	char                                                         pad0x7_YUB6C[0x7];                                 // 0x251(0x7)
	Struct PrioritisedPromptWithHandle                           Prompt_UseMermaid;                                 // 0x258(0x68)
	bool                                                         State_ShowPrompt;                                  // 0x2c0(0x1)
	char                                                         pad0x3_3UL6N[0x3];                                 // 0x2c1(0x3)
	float                                                        PromptDisplayDuration;                             // 0x2c4(0x4)
	float                                                        PromptHideDuration;                                // 0x2c8(0x4)
};


}