// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xf0 (Full Size[0x228] - InheritedSize[0x138]
class BP_Prompt_WieldableItemZoom_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x4c_DDWRN[0x4c];                               // 0x140(0x4c)
	class                                                        PromptAccessKey;                                   // 0x140(0x8)
	Struct ObjectMessagingHandle                                 WieldableItemEquipEvent;                           // 0x148(0x58)
	bool                                                         WieldingZoomableWieldable;                         // 0x1a0(0x1)
	bool                                                         StatCompleted;                                     // 0x1a1(0x1)
	char                                                         pad0x6_RJK89[0x6];                                 // 0x1a2(0x6)
	Struct ObjectMessagingDispatcherHandle                       CharacterDispatcher;                               // 0x1a8(0x8)
	bool                                                         HasShown;                                          // 0x1b0(0x1)
	char                                                         pad0x7_1SANR[0x7];                                 // 0x1b1(0x7)
	Struct PrioritisedPromptWithHandle                           Prompt;                                            // 0x1b8(0x68)
	class                                                        ShowForItemCategory;                               // 0x220(0x8)
};


}