// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xdc
class BP_PlayerPirate_C: public AthenaPlayerCharacter
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x1b60(0x8)
	Class WorldVelocityTrackerComponent*                         WorldVelocityTracker;                              // 0x1b68(0x8)
	Class ChainLightningReceiverComponent*                       ChainLightningReceiver;                            // 0x1b70(0x8)
	Class StatusApplicationMonitorComponent*                     StatusApplicationMonitor;                          // 0x1b78(0x8)
	Class ReviveComponent*                                       ReviveComponent;                                   // 0x1b80(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x1b88(0x8)
	Class VomitComponent*                                        Vomit;                                             // 0x1b90(0x8)
	Class NoiseMakerComponent*                                   NoiseMaker;                                        // 0x1b98(0x8)
	Class PlayerNameplateComponent*                              PlayerNameplate;                                   // 0x1ba0(0x8)
	Class BodyLightControllerComponent*                          BodyLightController;                               // 0x1ba8(0x8)
	Class AmbientLightSourceComponent*                           BodyLight;                                         // 0x1bb0(0x8)
	Class AudioSpaceTrackerComponent*                            AudioSpaceTracker;                                 // 0x1bb8(0x8)
	Class PlayerAtmosphericsAudioComponent*                      PlayerAtmosphericsAudio;                           // 0x1bc0(0x8)
	BlueprintGeneratedClass BP_CharacterVFXComponent_C*          BP_CharacterVFXComponent;                          // 0x1bc8(0x8)
	Class WaterInteractionComponent*                             WaterInteraction;                                  // 0x1bd0(0x8)
	BlueprintGeneratedClass BP_CharacterAudioComponent_C*        BP_PlayerAudioComponent;                           // 0x1bd8(0x8)
	Class CharacterFootImpactComponent*                          CharacterFootImpact;                               // 0x1be0(0x8)
	Class PlayerOceanAudioComponent*                             PlayerOceanAudio;                                  // 0x1be8(0x8)
	float                                                        TattooGlowDuration;                                // 0x1bf0(0x4)
	Class StaticMesh*                                            CurrentStaticMesh;                                 // 0x1bf8(0x8)
	Class SkeletalMesh*                                          CurrentSkeletalMesh;                               // 0x1c00(0x8)
	TArray<class SkeletalMesh*>                                  SkeletalMeshArray;                                 // 0x1c08(0x10)
	TArray<class StaticMesh*>                                    StaticMeshArray;                                   // 0x1c18(0x10)
	bool                                                         IsSkeletalMesh;                                    // 0x1c28(0x1)
	int                                                          ItemSelectArray;                                   // 0x1c2c(0x4)
	Struct Vector                                                ItemScale;                                         // 0x1c30(0xc)
};


}