// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x138
class BP_Prompt_WarMap_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x118(0x8)
	Struct ObjectMessagingHandle                                 HandleWarMapStateChanged;                          // 0x120(0x48)
	Struct PrioritisedPromptWithHandle                           PromptFlameheart;                                  // 0x168(0x68)
	Struct PrioritisedPromptWithHandle                           PromptPirateLord;                                  // 0x1d0(0x68)
	float                                                        PromptDelay;                                       // 0x238(0x4)
	float                                                        PromptDisplayDuration;                             // 0x23c(0x4)
	bool                                                         PromptEvaluated;                                   // 0x240(0x1)
	bool                                                         WarMapOpened;                                      // 0x241(0x1)
	Class Company*                                               CurrentFaction;                                    // 0x248(0x8)
};


}