// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xd0 (Full Size[0x1e8] - InheritedSize[0x118]
class BP_Prompt_TunnelOfTheDamned_BootyWillBeLost_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x118(0x8)
	char                                                         pad0x132_3U1HJ[0x132];                             // 0x120(0x132)
	Struct ObjectMessagingHandle                                 Handle_CrewEnteredTunnelOfTheDamnedPortalProximity; // 0x120(0x48)
	Struct PrioritisedPromptWithHandle                           Prompt_BootyWillBeLost;                            // 0x168(0x68)
	float                                                        PromptDisplayDuration;                             // 0x1d0(0x4)
	bool                                                         CrewInRadius;                                      // 0x1d4(0x1)
	bool                                                         PromptOnCooldown;                                  // 0x1d5(0x1)
	char                                                         pad0x2_65TJ6[0x2];                                 // 0x1d6(0x2)
	float                                                        PromptDisplayCooldown;                             // 0x1d8(0x4)
	char                                                         pad0x4_0W4PK[0x4];                                 // 0x1dc(0x4)
	Class TunnelsOfTheDamnedLootFilterDataAsset*                 LootFilterDataAsset;                               // 0x1e0(0x8)
};


}