#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x191 (Full Size[0x5f1] - InheritedSize[0x460]
class BP_PirateGenerator_LineUp_C: public PosablePirate
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x460(0x8)
	class CapsuleComponent*                                      Capsule;                                           // 0x468(0x8)
	class ParticleSystemComponent*                               GhostParticlesOut;                                 // 0x470(0x8)
	class ParticleSystemComponent*                               GhostParticlesIn;                                  // 0x478(0x8)
	class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x480(0x8)
	class SkeletalMeshComponent*                                 SkeletalProp;                                      // 0x488(0x8)
	class StaticMeshComponent*                                   StaticPropSecondary;                               // 0x490(0x8)
	class SkeletalMeshComponent*                                 SkeletalPropSecondary;                             // 0x498(0x8)
	class StaticMeshComponent*                                   StaticProp;                                        // 0x4a0(0x8)
	struct FString                                               ForceShape;                                        // 0x4a8(0x10)
	struct BP_LineUp_Animation                                   Animation;                                         // 0x4b8(0xc8)
	animblueprintgeneratedclass BP_Anim_CharacterSelect_C*       CharacterSelectAnimgraph;                          // 0x580(0x8)
	float                                                        ZoomTime;                                          // 0x588(0x4)
	float                                                        GhostTransitionOutTime;                            // 0x58c(0x4)
	float                                                        GhostTransitionInTime;                             // 0x590(0x4)
	bool                                                         GhostTransitioning;                                // 0x594(0x1)
	char                                                         pad0x3_K01XN[0x3];                                 // 0x595(0x3)
	int                                                          PoseIndex;                                         // 0x598(0x4)
	char                                                         pad0x4_38S7Z[0x4];                                 // 0x59c(0x4)
	class AnimationSwitchDataAsset*                              AnimationSwitch;                                   // 0x5a0(0x8)
	class AnimationDataStoreAsset*                               AnimationAsset;                                    // 0x5a8(0x8)
	bool                                                         Initialized;                                       // 0x5b0(0x1)
	char                                                         pad0x7_4U9GP[0x7];                                 // 0x5b1(0x7)
	bool                                                         IsHighlighted;                                     // 0x5c8(0x1)
	bool                                                         IsInShipSelect;                                    // 0x5c9(0x1)
	char                                                         pad0x2_CT448[0x2];                                 // 0x5ca(0x2)
	float                                                        ShipSelectVariantTimer;                            // 0x5cc(0x4)
	float                                                        ShipSelectVariantTimerMax;                         // 0x5d0(0x4)
	int                                                          ShipSelectAnimCountMax;                            // 0x5d4(0x4)
	int                                                          ShipSelectVariantAnimIndex;                        // 0x5d8(0x4)
	bool                                                         IsPlayingShipSelectVariant;                        // 0x5dc(0x1)
	char                                                         pad0x3_ZM5KT[0x3];                                 // 0x5dd(0x3)
	class AnimSequence*                                          ShipSelectAnimToPlay;                              // 0x5e0(0x8)
	class AnimSequence*                                          ShipSelectPropAnimToPlay;                          // 0x5e8(0x8)
	bool                                                         ShipSelectAnimStarted;                             // 0x5f0(0x1)
};


