// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x182 (Full Size[0x2ba] - InheritedSize[0x138]
class BP_Prompt_Sitting_ThirdPerson_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x4c_WCSP0[0x4c];                               // 0x140(0x4c)
	Struct ObjectMessagingHandle                                 Handle_LocalPlayerEnteredSittingState;             // 0x140(0x58)
	Struct PrioritisedPromptWithHandle                           Prompt_ThirdPerson;                                // 0x198(0x68)
	float                                                        PromptDisplayDuration;                             // 0x200(0x4)
	bool                                                         CrewInRadius;                                      // 0x204(0x1)
	bool                                                         PromptOnCooldown;                                  // 0x205(0x1)
	char                                                         pad0x2_6U7V9[0x2];                                 // 0x206(0x2)
	Struct ObjectMessagingHandle                                 Handle_LocalPlayerExitedSittingState;              // 0x208(0x58)
	Struct ObjectMessagingHandle                                 Handle_LocalPlayerEnteredSittingThirdPersonCameraState; // 0x260(0x58)
	bool                                                         PlayerOnSeat;                                      // 0x2b8(0x1)
	bool                                                         PromptEvaluated;                                   // 0x2b9(0x1)
};


}