#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xf1 (Full Size[0x229] - InheritedSize[0x138]
class BP_PromptCoordinator_CargoPickUp_Plants_C: public BP_PromptCoordinator_Base_C
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0xb0_SHAHW[0xb0];                               // 0x140(0xb0)
	struct ObjectMessagingHandle                                 HandleForCargoPickUp;                              // 0x140(0x58)
	bool                                                         PickedUpPlants;                                    // 0x198(0x1)
	char                                                         pad0x7_0ILSI[0x7];                                 // 0x199(0x7)
	struct PrioritisedPromptWithHandle                           PromptPlants;                                      // 0x1a0(0x70)
	bool                                                         Shown;                                             // 0x210(0x1)
	char                                                         pad0x7_JXSDU[0x7];                                 // 0x211(0x7)
	TArray<struct Name>                                          PlantType;                                         // 0x218(0x10)
	bool                                                         Result;                                            // 0x228(0x1)
};


