// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xdc (Full Size[0x20ac] - InheritedSize[0x1fd0]
class BP_PlayerPirate_C: public AthenaPlayerCharacter
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x1fd0(0x8)
	class WorldVelocityTrackerComponent*                         WorldVelocityTracker;                              // 0x1fd8(0x8)
	class ChainLightningReceiverComponent*                       ChainLightningReceiver;                            // 0x1fe0(0x8)
	class StatusApplicationMonitorComponent*                     StatusApplicationMonitor;                          // 0x1fe8(0x8)
	class ReviveComponent*                                       ReviveComponent;                                   // 0x1ff0(0x8)
	class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x1ff8(0x8)
	class VomitComponent*                                        Vomit;                                             // 0x2000(0x8)
	class NoiseMakerComponent*                                   NoiseMaker;                                        // 0x2008(0x8)
	class PlayerNameplateComponent*                              PlayerNameplate;                                   // 0x2010(0x8)
	class BodyLightControllerComponent*                          BodyLightController;                               // 0x2018(0x8)
	class AmbientLightSourceComponent*                           BodyLight;                                         // 0x2020(0x8)
	class AudioSpaceTrackerComponent*                            AudioSpaceTracker;                                 // 0x2028(0x8)
	class PlayerAtmosphericsAudioComponent*                      PlayerAtmosphericsAudio;                           // 0x2030(0x8)
	blueprintgeneratedclass BP_CharacterVFXComponent_C*          BP_CharacterVFXComponent;                          // 0x2038(0x8)
	class WaterInteractionComponent*                             WaterInteraction;                                  // 0x2040(0x8)
	blueprintgeneratedclass BP_CharacterAudioComponent_C*        BP_PlayerAudioComponent;                           // 0x2048(0x8)
	class CharacterFootImpactComponent*                          CharacterFootImpact;                               // 0x2050(0x8)
	class PlayerOceanAudioComponent*                             PlayerOceanAudio;                                  // 0x2058(0x8)
	float                                                        TattooGlowDuration;                                // 0x2060(0x4)
	char                                                         pad0x4_085CP[0x4];                                 // 0x2064(0x4)
	class StaticMesh*                                            CurrentStaticMesh;                                 // 0x2068(0x8)
	class SkeletalMesh*                                          CurrentSkeletalMesh;                               // 0x2070(0x8)
	TArray<class SkeletalMesh*>                                  SkeletalMeshArray;                                 // 0x2078(0x10)
	TArray<class StaticMesh*>                                    StaticMeshArray;                                   // 0x2088(0x10)
	bool                                                         IsSkeletalMesh;                                    // 0x2098(0x1)
	char                                                         pad0x3_FXW4W[0x3];                                 // 0x2099(0x3)
	int                                                          ItemSelectArray;                                   // 0x209c(0x4)
	struct Vector                                                ItemScale;                                         // 0x20a0(0xc)
};


}