// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x44 (Full Size[0x1e04] - InheritedSize[0x1dc0]
class BP_PlayerPirate_Ghost_C: public AthenaGhostPlayerCharacter
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x1dc0(0x8)
	BlueprintGeneratedClass BP_GhostCharacterAudioComponent_C*   BP_GhostCharacterAudioComponent;                   // 0x1dc8(0x8)
	Class WaterInteractionComponent*                             WaterInteraction;                                  // 0x1dd0(0x8)
	Class PlayerNameplateComponent*                              PlayerNameplate;                                   // 0x1dd8(0x8)
	Class BodyLightControllerComponent*                          BodyLightController;                               // 0x1de0(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x1de8(0x8)
	Class AmbientLightSourceComponent*                           BodyLight;                                         // 0x1df0(0x8)
	Class CharacterFootImpactComponent*                          CharacterFootImpact;                               // 0x1df8(0x8)
	float                                                        Default Ghost Parameter;                           // 0x1e00(0x4)
};


}