// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x140
class BP_Prompt_VisitSeapost_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x118(0x8)
	Struct ObjectMessagingHandle                                 Handle_EventObjectWielded;                         // 0x120(0x48)
	Struct PrioritisedPromptWithHandle                           Prompt_WieledFishOrMeat;                           // 0x168(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_VisitSeapost;                               // 0x1d0(0x68)
	bool                                                         IsWieldingMeatOrFish;                              // 0x238(0x1)
	float                                                        DisplayDuration;                                   // 0x23c(0x4)
	float                                                        DelayUntilNextPrompt;                              // 0x240(0x4)
	TArray<Class IgnoredFood>                                    IgnoredFood;                                       // 0x248(0x10)
};


}