// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x358 (Full Size[0x490] - InheritedSize[0x138]
class BP_PromptCoordinator_BootyStorage_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x4c_0YZFT[0x4c];                               // 0x140(0x4c)
	bool                                                         ShowLootPrompt;                                    // 0x140(0x1)
	bool                                                         ShowMermaidPrompt;                                 // 0x141(0x1)
	bool                                                         HasUsedStatue;                                     // 0x142(0x1)
	bool                                                         HasRetrievedLoot;                                  // 0x143(0x1)
	char                                                         pad0x4_K2Z6E[0x4];                                 // 0x144(0x4)
	Struct PrioritisedPromptWithHandle                           MermaidPrompt;                                     // 0x148(0x68)
	Struct PrioritisedPromptWithHandle                           LootPrompt;                                        // 0x1b0(0x68)
	Struct ObjectMessagingHandle                                 CrewStorageChangedHandle;                          // 0x218(0x58)
	Struct ObjectMessagingHandle                                 CrewStorageFullHandle;                             // 0x270(0x58)
	Struct ObjectMessagingHandle                                 ItemsRetrievedHandle;                              // 0x2c8(0x58)
	Struct ObjectMessagingHandle                                 RetrieveActorHandle;                               // 0x320(0x58)
	Struct ObjectMessagingHandle                                 WieldedEventHandle;                                // 0x378(0x58)
	class                                                        PromptKey;                                         // 0x3d0(0x8)
	Class WieldableItem*                                         CurrentlyWieldedItem;                              // 0x3d8(0x8)
	Struct ObjectMessagingHandle                                 StowedEventHandle;                                 // 0x3e0(0x58)
	Struct ObjectMessagingHandle                                 RetrieveActorDespawnHandle;                        // 0x438(0x58)
};


}