// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x292
class BP_Prompt_MaidenVoyage_RowboatTutorial_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x118(0x8)
	bool                                                         State_SatInRowboat;                                // 0x120(0x1)
	Struct PrioritisedPromptWithHandle                           Prompt_RowTheBoat;                                 // 0x128(0x68)
	Struct ObjectMessagingHandle                                 Handle_UseRowboat;                                 // 0x190(0x48)
	bool                                                         State_LeaveRowboat;                                // 0x1d8(0x1)
	Struct ObjectMessagingHandle                                 Handle_LeaveRowboat;                               // 0x1e0(0x48)
	Struct PrioritisedPromptWithHandle                           Prompt_ReleaseOars;                                // 0x228(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_Brake;                                      // 0x290(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_OneAtATime;                                 // 0x2f8(0x68)
	Struct ObjectMessagingHandle                                 Handle_StrokeEnded;                                // 0x360(0x48)
	bool                                                         State_StrokeCompleted;                             // 0x3a8(0x1)
	bool                                                         State_Completed;                                   // 0x3a9(0x1)
};


}