// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x44 (Full Size[0x20e4] - InheritedSize[0x20a0]
class BP_PlayerPirate_Ghost_C: public AthenaGhostPlayerCharacter
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x20a0(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x20a8(0x8)
	Class WaterInteractionComponent*                             None;                                              // 0x20b0(0x8)
	Class PlayerNameplateComponent*                              None;                                              // 0x20b8(0x8)
	Class BodyLightControllerComponent*                          None;                                              // 0x20c0(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       None;                                              // 0x20c8(0x8)
	Class AmbientLightSourceComponent*                           None;                                              // 0x20d0(0x8)
	Class CharacterFootImpactComponent*                          None;                                              // 0x20d8(0x8)
	float                                                        None;                                              // 0x20e0(0x4)
};


}