// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x35c
class BP_PL_HauntedForts_Emplacement_C: public HauntedFortEmplacement
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x500(0x8)
	Class ChildActorComponent*                                   ControllerRumble;                                  // 0x508(0x8)
	Class AIShipObstacleComponent*                               AIShipObstacle;                                    // 0x510(0x8)
	Class StaticMeshComponent*                                   stone_ladder;                                      // 0x518(0x8)
	Class StaticMeshComponent*                                   stone_ladder;                                      // 0x520(0x8)
	Class StaticMeshComponent*                                   stone_ladder;                                      // 0x528(0x8)
	Class StaticMeshComponent*                                   stone_ladder;                                      // 0x530(0x8)
	Class StaticMeshComponent*                                   stone_ladder;                                      // 0x538(0x8)
	Class StaticMeshComponent*                                   stone_ladder;                                      // 0x540(0x8)
	Class ChildActorComponent*                                   Ladder2;                                           // 0x548(0x8)
	Class ChildActorComponent*                                   Ladder1;                                           // 0x550(0x8)
	Class DetachItemsWhenDestroyedComponent*                     DetachItemsWhenDestroyed;                          // 0x558(0x8)
	Class SceneComponent*                                        ItemSpawn4;                                        // 0x560(0x8)
	Class SceneComponent*                                        ItemSpawn3;                                        // 0x568(0x8)
	Class SceneComponent*                                        ItemSpawn2;                                        // 0x570(0x8)
	Class SceneComponent*                                        ItemSpawn1;                                        // 0x578(0x8)
	Class SceneComponent*                                        ItemSpawns;                                        // 0x580(0x8)
	Class SceneComponent*                                        EmitterAnchor;                                     // 0x588(0x8)
	Class StaticMeshComponent*                                   DestructionMeshOpaque;                             // 0x590(0x8)
	Class SkeletalMeshComponent*                                 DestructionMesh;                                   // 0x598(0x8)
	Class SceneComponent*                                        DestructionMeshes;                                 // 0x5a0(0x8)
	Class ChildActorComponent*                                   EmplacementBase;                                   // 0x5a8(0x8)
	Class StaticMeshComponent*                                   FarAwayLightMesh4;                                 // 0x5b0(0x8)
	Class StaticMeshComponent*                                   FarAwayLightMesh3;                                 // 0x5b8(0x8)
	Class StaticMeshComponent*                                   FarAwayLightMesh2;                                 // 0x5c0(0x8)
	Class StaticMeshComponent*                                   FarAwayLightMesh1;                                 // 0x5c8(0x8)
	Class StaticMeshComponent*                                   FarAwayLightMesh;                                  // 0x5d0(0x8)
	Class StaticMeshComponent*                                   EmplacementLantern2;                               // 0x5d8(0x8)
	Class StaticMeshComponent*                                   EmplacementLantern1;                               // 0x5e0(0x8)
	Class StaticMeshComponent*                                   EmplacementFlag2;                                  // 0x5e8(0x8)
	Class StaticMeshComponent*                                   EmplacementFlag1;                                  // 0x5f0(0x8)
	Class StaticMeshComponent*                                   EmplacementsCloth;                                 // 0x5f8(0x8)
	Class StaticMeshComponent*                                   EmplacementProps;                                  // 0x600(0x8)
	Class SceneComponent*                                        DressingMesh;                                      // 0x608(0x8)
	Class PointLightComponent*                                   PointLight10;                                      // 0x610(0x8)
	Class PointLightComponent*                                   PointLight9;                                       // 0x618(0x8)
	Class SpotLightComponent*                                    SpotLight1;                                        // 0x620(0x8)
	Class SpotLightComponent*                                    SpotLight;                                         // 0x628(0x8)
	Class PointLightComponent*                                   PointLight8;                                       // 0x630(0x8)
	Class PointLightComponent*                                   PointLight7;                                       // 0x638(0x8)
	Class PointLightComponent*                                   PointLight6;                                       // 0x640(0x8)
	Class PointLightComponent*                                   PointLight5;                                       // 0x648(0x8)
	Class PointLightComponent*                                   PointLight4;                                       // 0x650(0x8)
	Class PointLightComponent*                                   PointLight3;                                       // 0x658(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x660(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x668(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x670(0x8)
	Class SceneComponent*                                        Lighting;                                          // 0x678(0x8)
	Class StaticMeshComponent*                                   PrimaryStructureCollision;                         // 0x680(0x8)
	Class StaticMeshComponent*                                   OuterStructureCollision;                           // 0x688(0x8)
	Class SceneComponent*                                        CollisionMesh;                                     // 0x690(0x8)
	Class ParticleSystemComponent*                               ParticleSystem15;                                  // 0x698(0x8)
	Class ParticleSystemComponent*                               ParticleSystem14;                                  // 0x6a0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem13;                                  // 0x6a8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem11;                                  // 0x6b0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem10;                                  // 0x6b8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem9;                                   // 0x6c0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem8;                                   // 0x6c8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem7;                                   // 0x6d0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x6d8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem12;                                  // 0x6e0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x6e8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x6f0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x6f8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x700(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x708(0x8)
	Class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x710(0x8)
	Class SceneComponent*                                        Particles;                                         // 0x718(0x8)
	Class StaticMeshComponent*                                   EmplacementDebris;                                 // 0x720(0x8)
	Class SceneComponent*                                        PrimaryMeshes;                                     // 0x728(0x8)
	Class ChildActorComponent*                                   Cannon5;                                           // 0x730(0x8)
	Class ChildActorComponent*                                   Cannon4;                                           // 0x738(0x8)
	Class ChildActorComponent*                                   Cannon1;                                           // 0x740(0x8)
	Class ChildActorComponent*                                   Cannon3;                                           // 0x748(0x8)
	Class ChildActorComponent*                                   Cannon2;                                           // 0x750(0x8)
	Class SceneComponent*                                        Cannons;                                           // 0x758(0x8)
	Class SafeZoneComponent*                                     SafeZone;                                          // 0x760(0x8)
	Class ChildActorComponent*                                   EmplacementRocks;                                  // 0x768(0x8)
	Class DecalComponent*                                        Decal;                                             // 0x770(0x8)
	Class ChildActorComponent*                                   BP_EmplacementExplosionMechanismAction;            // 0x778(0x8)
	Class AIRegionComponent*                                     AIRegion;                                          // 0x780(0x8)
	Class InstancedNavMeshComponent*                             InstancedNavMesh;                                  // 0x788(0x8)
	Class ChildActorComponent*                                   CalmWater;                                         // 0x790(0x8)
	Class ParticleSystemComponent*                               Mist;                                              // 0x798(0x8)
	Class ShockwaveDamagerComponent*                             ShockwaveDamager;                                  // 0x7a0(0x8)
	Class ChildActorComponent*                                   BP_HauntedForts_CameraShake_EmplacementDestroyed;  // 0x7a8(0x8)
	float                                                        Fade_In_Lights_Fade_4220ABB948F469AC8FB37E890BDECC85; // 0x7b0(0x4)
	byte                                                         Fade_In_Lights__Direction_4220ABB948F469AC8FB37E890BDECC85; // 0x7b4(0x1)
	Class TimelineComponent*                                     Fade In Lights;                                    // 0x7b8(0x8)
	bool                                                         DestroyedState;                                    // 0x7c0(0x1)
	Struct WwiseEmitter                                          Emitter;                                           // 0x7c8(0x20)
	Struct WwiseEmitterCreationParams                            Null Emitter Params;                               // 0x7e8(0x28)
	TArray<class ParticleArray*>                                 ParticleArray;                                     // 0x810(0x10)
	TArray<class CannonArray*>                                   CannonArray;                                       // 0x820(0x10)
	TArray<class LightArray*>                                    LightArray;                                        // 0x830(0x10)
	TArray<class MeshArray*>                                     MeshArray;                                         // 0x840(0x10)
	Class MaterialInstanceDynamic*                               FarLightMat;                                       // 0x850(0x8)
	int                                                          EmplacementInt;                                    // 0x858(0x4)
};


// Size 0x0
class BP_PL_HauntedFort_LadderLong_C: public BP_CustomisableLadder_C
{
public:
};


// Size 0x0
class BP_PL_HauntedFort_Ladder_C: public BP_CustomisableLadder_C
{
public:
};


}