// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x7d4 (Full Size[0x90c] - InheritedSize[0x138]
class BP_Prompt_CTPurchaseVoyageSequence_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0xec_D95JL[0xec];                               // 0x140(0xec)
	float                                                        TriggerVolumeRadius;                               // 0x140(0x4)
	int                                                          InsideGoldHoardersRadius;                          // 0x144(0x4)
	TArray<class OverlapTriggerActor*>                           GoldHoarderOverlapActors;                          // 0x148(0x10)
	TArray<class OverlapTriggerActor*>                           OutpostOverlapActors;                              // 0x158(0x10)
	float                                                        OutpostRadiusReduction;                            // 0x168(0x4)
	char                                                         pad0x4_A7YMU[0x4];                                 // 0x16c(0x4)
	Struct PrioritisedPromptWithHandle                           Prompt_GoToVendors;                                // 0x170(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_GoToGoldhoarders;                           // 0x1d8(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_GoToOrderOfSouls;                           // 0x240(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_GoToMerchantAlliance;                       // 0x2a8(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_ProposeVoyage;                              // 0x310(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_VoteOnVoyage;                               // 0x378(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_BoardShip;                                  // 0x3e0(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_VisitSignpost_GH;                           // 0x448(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_VisitSignpost_MA;                           // 0x4b0(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_VisitSignpost_OOS;                          // 0x518(0x68)
	Struct ObjectMessagingHandle                                 Handle_OfferPurchased;                             // 0x580(0x58)
	Struct ObjectMessagingHandle                                 Handle_VoyageProposalDiscarded;                    // 0x5d8(0x58)
	Struct ObjectMessagingHandle                                 Handle_VoyageProposed;                             // 0x630(0x58)
	Struct ObjectMessagingHandle                                 Handle_VoyageBegun;                                // 0x688(0x58)
	Struct ObjectMessagingHandle                                 Handle_VoyageComplete;                             // 0x6e0(0x58)
	Struct ObjectMessagingHandle                                 Handle_PlayerEnteredShip;                          // 0x738(0x58)
	Struct ObjectMessagingHandle                                 Handle_PlayerExitedShip;                           // 0x790(0x58)
	Struct ObjectMessagingHandle                                 Handle_PlayerWithdrewVoyage;                       // 0x7e8(0x58)
	Struct ObjectMessagingHandle                                 Handle_VoyageCancelled;                            // 0x840(0x58)
	bool                                                         State_InsideOutpostRadius;                         // 0x898(0x1)
	bool                                                         State_InsideGoldhoardersRadius;                    // 0x899(0x1)
	bool                                                         State_InsideOrderOfSouls;                          // 0x89a(0x1)
	bool                                                         State_InsideMerchantAllianceRadius;                // 0x89b(0x1)
	bool                                                         State_OnShip;                                      // 0x89c(0x1)
	bool                                                         State_IsHidden;                                    // 0x89d(0x1)
	bool                                                         State_IsTutorialForceDisabled;                     // 0x89e(0x1)
	bool                                                         State_SeenSignpostPrompt;                          // 0x89f(0x1)
	BlueprintGeneratedClass BP_CT_TutorialProgress_C*            CompanyTutorialProgress;                           // 0x8a0(0x8)
	Struct ObjectMessagingHandle                                 Handle_CompanyRankPurchased;                       // 0x8a8(0x58)
	Struct FeatureFlag                                           FeatureName;                                       // 0x900(0xc)
};


}