// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x139 (Full Size[0x271] - InheritedSize[0x138]
class BP_Prompt_TavernBoard_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x4c_7UHJS[0x4c];                               // 0x140(0x4c)
	Struct ObjectMessagingHandle                                 WieldableItemUseEvent;                             // 0x140(0x58)
	class                                                        TavernBoardPromptAccessKey;                        // 0x198(0x8)
	Struct PrioritisedPromptWithHandle                           Prompt;                                            // 0x1a0(0x68)
	bool                                                         InRangeOfTavernBoard;                              // 0x208(0x1)
	char                                                         pad0x7_FA25G[0x7];                                 // 0x209(0x7)
	Struct ObjectMessagingHandle                                 ApproachedTavernBoardHandle;                       // 0x210(0x58)
	Struct ObjectMessagingDispatcherHandle                       CharacterDispatcher;                               // 0x268(0x8)
	bool                                                         HasShown;                                          // 0x270(0x1)
};


}