// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xb0 (Full Size[0x1e8] - InheritedSize[0x138]
class BP_Prompt_EmissaryEntitlementPurchased_C: public BP_PromptCoordinator_Base_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x138(0x8)
	char                                                         pad0x4c_YP8II[0x4c];                               // 0x140(0x4c)
	Struct ObjectMessagingHandle                                 Handle_EmissaryEntitlementPurchased;               // 0x140(0x58)
	Struct Guid                                                  OfferId;                                           // 0x198(0x10)
	Struct Guid                                                  ExpectedOfferId;                                   // 0x1a8(0x10)
	TArray<struct Prompts>                                       Prompts;                                           // 0x1b8(0x10)
	bool                                                         PromptSurfacedThisSession;                         // 0x1c8(0x1)
	char                                                         pad0x7_1KFWQ[0x7];                                 // 0x1c9(0x7)
	class                                                        PromptAccessKey;                                   // 0x1d0(0x8)
	int                                                          PromptIndex;                                       // 0x1d8(0x4)
	int                                                          NumberOfPrompts;                                   // 0x1dc(0x4)
	float                                                        InitialDelay;                                      // 0x1e0(0x4)
	float                                                        ShowPromptDuration;                                // 0x1e4(0x4)
};


}