// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10
class BP_PromptActor_RepairShip_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_RepairShip_C*              PromptCoordinator;                                 // 0x410(0x8)
};


// Size 0x10
class BP_PromptActor_RepairShipCapstan_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_RepairShipCapstan_C*       PromptCoordinator;                                 // 0x410(0x8)
};


// Size 0x10
class BP_PromptActor_RepairShipMast_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_RepairShipMast_C*          PromptCoordinator;                                 // 0x410(0x8)
};


// Size 0x10
class BP_PromptActor_RepairShipWheel_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_RepairShipWheel_C*         PromptCoordinator;                                 // 0x410(0x8)
};


}