// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1d (Full Size[0x1d] - InheritedSize[0x0]
class BP_ResourceIslandWashedUpResourceMerchantCratesSpawner_C: public None
{
public:
	int                                                          Temp_int_Variable;                                 // 0x0(0x4)
	char                                                         pad0x4_IEA5G[0x4];                                 // 0x4(0x4)
	TArray<class MaterialInterface*>                             CallFunc_GetMaterials_ReturnValue;                 // 0x8(0x10)
	int                                                          CallFunc_Add_IntInt_ReturnValue;                   // 0x18(0x4)
	char                                                         pad0x4_EM3O1[0x4];                                 // 0x1c(0x4)
	Class MaterialInterface*                                     CallFunc_Array_Get_Item;                           // 0x20(0x8)
	Class MaterialInstanceDynamic*                               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x28(0x8)
	int                                                          CallFunc_Array_LastIndex_ReturnValue;              // 0x30(0x4)
	int                                                          CallFunc_Array_Add_ReturnValue;                    // 0x34(0x4)
	bool                                                         CallFunc_LessEqual_IntInt_ReturnValue;             // 0x38(0x1)
};


}