// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size -0x1 (Full Size[-0x1] - InheritedSize[0x0]
class BP_ResourceIslandWashedUpResourcesSpawner_DVR_C: public FixedIntent
{
public:
	char                                                         pad0x540_HLU1V[0x540];                             // 0x0(0x540)
	Class FixedIntentComponent*                                  CurseIntentComponent;                              // 0x540(0x8)
	Class WwiseObjectPoolWrapper*                                ManipulatorAudioPool;                              // 0x548(0x8)
	Struct SocketId                                              MastSocketId;                                      // 0x550(0x20)
	Class SailManipulatorAudioParams*                            AudioParams;                                       // 0x570(0x8)
	Class SceneComponent*                                        MastSocketSceneComponent;                          // 0x578(0x8)
	Struct WwiseEmitter                                          AudioEmitter;                                      // 0x580(0x20)
	char                                                         pad0x200_2GH84[0x200];                             // 0x5a0(0x200)
	Class Mast*                                                  BoundMast;                                         // 0x7a0(0x8)
	Class Mast*                                                  PendingBoundMast;                                  // 0x7a8(0x8)
	bool                                                         Locked;                                            // 0x7b0(0x1)
	char                                                         pad0x7_V2SAJ[0x7];                                 // 0x7b1(0x7)
	Class MobileInstancedStaticMeshComponent*                    TopMeshInstanceComponent;                          // 0x7b8(0x8)
};


}