// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size -0x1 (Full Size[-0x1] - InheritedSize[0x0]
class BP_ResourceIslandSunkenChestsSpawner_C: public WaterOcclusionVolume
{
public:
	char                                                         pad0x4f0_DVAFK[0x4f0];                             // 0x0(0x4f0)
	Class StaticMeshComponent*                                   WaterOcclusionVolume;                              // 0x4f0(0x8)
	Class FlatWaterMeshComponent*                                WaterMeshComponent;                                // 0x4f8(0x8)
	Class FlatWaterPlaneComponent*                               WaterPlaneComponent;                               // 0x500(0x8)
	int                                                          WaterOcclusionVolumeShrinkMaterialId;              // 0x508(0x4)
	struct FName                                                 WaterOcclusionVolumeShrinkPropertyName;            // 0x50c(0x8)
	char                                                         pad0x4_P5P63[0x4];                                 // 0x514(0x4)
	Class CurveFloat*                                            WaterOcclusionZoneReductionCurve;                  // 0x518(0x8)
	float                                                        RippleSizeMin;                                     // 0x520(0x4)
	float                                                        RippleSizeMax;                                     // 0x524(0x4)
	float                                                        RippleHeight;                                      // 0x528(0x4)
	float                                                        SuperheatedWaterCoolingRatePerSecond;              // 0x52c(0x4)
	float                                                        TimeToIgnoreCoolingDueToSuperheating;              // 0x530(0x4)
	char                                                         pad0x4_V2H20[0x4];                                 // 0x534(0x4)
	Struct Status                                                SuperheatedWaterStatusToApply;                     // 0x538(0x18)
	char                                                         pad0x28_BD68E[0x28];                               // 0x550(0x28)
	TArray<class Actor*>                                         OverlappingActors;                                 // 0x578(0x10)
};


}