// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x278 (Full Size[0x640] - InheritedSize[0x3c8]
class BP_sod_bld_wpn_shop_01_a_C: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMesh1;                                       // 0x3c8(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x3d0(0x8)
	class SpotLightComponent*                                    SpotLight1;                                        // 0x3d8(0x8)
	class StaticMeshComponent*                                   sod_bld_sign_03_a;                                 // 0x3e0(0x8)
	class BoxComponent*                                          BoxCollision_03;                                   // 0x3e8(0x8)
	class StaticMeshComponent*                                   cmn_cannon_ball_01_a2;                             // 0x3f0(0x8)
	class StaticMeshComponent*                                   cmn_cannon_ball_01_a1;                             // 0x3f8(0x8)
	class StaticMeshComponent*                                   cmn_cannon_ball_01_a;                              // 0x400(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_anvil_01_a;                           // 0x408(0x8)
	class StaticMeshComponent*                                   sod_bld_wpn_shop_sign_01_a1;                       // 0x410(0x8)
	class StaticMeshComponent*                                   sod_bld_wpn_shop_sign_01_a;                        // 0x418(0x8)
	class BoxComponent*                                          BoxCollision_02;                                   // 0x420(0x8)
	class BoxComponent*                                          BoxCollision_01;                                   // 0x428(0x8)
	class StaticMeshComponent*                                   cmn_rope_04_c;                                     // 0x430(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_01_a;                                 // 0x438(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_06_a;                                 // 0x440(0x8)
	class StaticMeshComponent*                                   shp_int_hook_01_a;                                 // 0x448(0x8)
	class StaticMeshComponent*                                   sod_bld_wpn_shop_dressing_01_b;                    // 0x450(0x8)
	class PointLightComponent*                                   PointLight2;                                       // 0x458(0x8)
	class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x460(0x8)
	class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x468(0x8)
	class StaticMeshComponent*                                   cmn_candle_01_b;                                   // 0x470(0x8)
	class StaticMeshComponent*                                   cmn_candle_01_a;                                   // 0x478(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_02_a;                                 // 0x480(0x8)
	class StaticMeshComponent*                                   gmp_bar_stor_01_a1;                                // 0x488(0x8)
	class StaticMeshComponent*                                   gmp_bar_stor_01_a;                                 // 0x490(0x8)
	class StaticMeshComponent*                                   sod_bld_barrel_netting_01_a;                       // 0x498(0x8)
	class StaticMeshComponent*                                   cmn_dbl_barrel_pistol_03_a;                        // 0x4a0(0x8)
	class StaticMeshComponent*                                   shp_pistol_rack_01_a;                              // 0x4a8(0x8)
	class StaticMeshComponent*                                   cmn_moneybag_01_a1;                                // 0x4b0(0x8)
	class StaticMeshComponent*                                   bld_tvn_metal_chimney_01_b;                        // 0x4b8(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_b;                             // 0x4c0(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_a1;                            // 0x4c8(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_window_01_b2;                         // 0x4d0(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_window_01_a1;                         // 0x4d8(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_window_01_b1;                         // 0x4e0(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_window_01_c2;                         // 0x4e8(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_window_01_b;                          // 0x4f0(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_window_01_c1;                         // 0x4f8(0x8)
	class StaticMeshComponent*                                   sod_bld_floor_02_a1;                               // 0x500(0x8)
	class StaticMeshComponent*                                   sod_bld_floor_02_a;                                // 0x508(0x8)
	class StaticMeshComponent*                                   gmp_bar_stor_three_stack_01_a;                     // 0x510(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_sign_standing_01_a;                   // 0x518(0x8)
	class StaticMeshComponent*                                   sod_bld_wpn_shop_dressing_01_a;                    // 0x520(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_hanging_target_broken_01_a;           // 0x528(0x8)
	class StaticMeshComponent*                                   cmn_moneybag_01_a;                                 // 0x530(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_furnace_01_c;                         // 0x538(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_window_01_c;                          // 0x540(0x8)
	class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x548(0x8)
	class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x550(0x8)
	class SpotLightComponent*                                    SpotLight10;                                       // 0x558(0x8)
	class SpotLightComponent*                                    SpotLight9;                                        // 0x560(0x8)
	class SpotLightComponent*                                    SpotLight8;                                        // 0x568(0x8)
	class ChildActorComponent*                                   BP_IslandWeaponsChest;                             // 0x570(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_a;                             // 0x578(0x8)
	class StaticMeshComponent*                                   StaticMesh2;                                       // 0x580(0x8)
	class PointLightComponent*                                   PointLight5;                                       // 0x588(0x8)
	class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x590(0x8)
	class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x598(0x8)
	class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x5a0(0x8)
	class SpotLightComponent*                                    SpotLight6;                                        // 0x5a8(0x8)
	class StaticMeshComponent*                                   tls_lantern_01_d;                                  // 0x5b0(0x8)
	class PointLightComponent*                                   PointLight4;                                       // 0x5b8(0x8)
	class StaticMeshComponent*                                   StaticMesh33;                                      // 0x5c0(0x8)
	class StaticMeshComponent*                                   StaticMesh32;                                      // 0x5c8(0x8)
	class SpotLightComponent*                                    SpotLight4;                                        // 0x5d0(0x8)
	class SpotLightComponent*                                    SpotLight3;                                        // 0x5d8(0x8)
	class PointLightComponent*                                   PointLight;                                        // 0x5e0(0x8)
	class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x5e8(0x8)
	class SpotLightComponent*                                    SpotLight;                                         // 0x5f0(0x8)
	class ParticleSystemComponent*                               ParticleSystem;                                    // 0x5f8(0x8)
	class StaticMeshComponent*                                   StaticMesh6;                                       // 0x600(0x8)
	class StaticMeshComponent*                                   StaticMesh18;                                      // 0x608(0x8)
	class StaticMeshComponent*                                   StaticMesh13;                                      // 0x610(0x8)
	class StaticMeshComponent*                                   StaticMesh5;                                       // 0x618(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_doorframe_01_a;                       // 0x620(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_window_01_a;                          // 0x628(0x8)
	class StaticMeshComponent*                                   bld_wpn_shop_door_01_a;                            // 0x630(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x638(0x8)
};


}