// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x338 (Full Size[0x790] - InheritedSize[0x458]
class BP_Shroudbreaker_OnShip_C: public ShroudBreakerOnShip
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x458(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x460(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x468(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x470(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x478(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x480(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x488(0x8)
	Class WwiseEmitterComponent*                                 None;                                              // 0x490(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x498(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x4a0(0x8)
	Class MusicZoneComponent*                                    None;                                              // 0x4a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4b0(0x8)
	Struct ObjectMessagingHandle                                 None;                                              // 0x4b8(0x58)
	Struct ObjectMessagingHandle                                 None;                                              // 0x510(0x58)
	Struct ObjectMessagingHandle                                 None;                                              // 0x568(0x58)
	Struct ObjectMessagingHandle                                 None;                                              // 0x5c0(0x58)
	Struct ObjectMessagingHandle                                 None;                                              // 0x618(0x58)
	Class Actor*                                                 None;                                              // 0x670(0x8)
	bool                                                         None;                                              // 0x678(0x1)
	char                                                         pad0x3_T0BML[0x3];                                 // 0x679(0x3)
	float                                                        None;                                              // 0x67c(0x4)
	Class MaterialInstanceDynamic*                               None;                                              // 0x680(0x8)
	float                                                        None;                                              // 0x688(0x4)
	bool                                                         None;                                              // 0x68c(0x1)
	bool                                                         None;                                              // 0x68d(0x1)
	char                                                         pad0x2_EAPH7[0x2];                                 // 0x68e(0x2)
	Struct ObjectMessagingHandle                                 None;                                              // 0x690(0x58)
	Struct ObjectMessagingHandle                                 None;                                              // 0x6e8(0x58)
	TArray<Assetclass None>                                      None;                                              // 0x740(0x10)
	TArray<class ProgressShipSpawnLocation*>                     None;                                              // 0x750(0x10)
	Class MaterialInstanceDynamic*                               None;                                              // 0x760(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x768(0x8)
	int                                                          None;                                              // 0x770(0x4)
	float                                                        None;                                              // 0x774(0x4)
	Class SoundBase*                                             None;                                              // 0x778(0x8)
	Class ShipHullAudio*                                         None;                                              // 0x780(0x8)
	Class WwiseEvent*                                            None;                                              // 0x788(0x8)
};


}