// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x4d0 (Full Size[0x898] - InheritedSize[0x3c8]
class BP_SovereignHut_C: public Actor
{
public:
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_PullyArm;                                     // 0x3c8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_PullyArm;                                     // 0x3d0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_PullyArm;                                     // 0x3d8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Hut;                                          // 0x3e0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Hut;                                          // 0x3e8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Hut;                                          // 0x3f0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_PullyArm;                                     // 0x3f8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Lookout;                                      // 0x400(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Lookout;                                      // 0x408(0x8)
	Class StaticMeshComponent*                                   gmp_fishing_rod_elb_02_a;                          // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh76;                                      // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh75;                                      // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh74;                                      // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh73;                                      // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh72;                                      // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh71;                                      // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMesh52;                                      // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMesh50;                                      // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMesh46;                                      // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMesh44;                                      // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMesh42;                                      // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMesh41;                                      // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMesh40;                                      // 0x488(0x8)
	Class StaticMeshComponent*                                   StaticMesh19;                                      // 0x490(0x8)
	Class StaticMeshComponent*                                   StaticMesh18;                                      // 0x498(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x4a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh14;                                      // 0x4a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x4b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x4b8(0x8)
	Class StaticMeshComponent*                                   shp_int_hook_01_a;                                 // 0x4c0(0x8)
	Class StaticMeshComponent*                                   cmn_man_cage_rope_knot_a;                          // 0x4c8(0x8)
	Class StaticMeshComponent*                                   act_bracket_01_c;                                  // 0x4d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh24;                                      // 0x4d8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem13;                                  // 0x4e0(0x8)
	Class ParticleSystemComponent*                               vfx_dust_motes;                                    // 0x4e8(0x8)
	Class PostProcessComponent*                                  PostProcess1;                                      // 0x4f0(0x8)
	Class CapsuleComponent*                                      Capsule1;                                          // 0x4f8(0x8)
	Class PostProcessComponent*                                  PostProcess2;                                      // 0x500(0x8)
	Class CapsuleComponent*                                      Capsule;                                           // 0x508(0x8)
	Class ChildActorComponent*                                   ChildActor3;                                       // 0x510(0x8)
	Class ChildActorComponent*                                   ChildActor2;                                       // 0x518(0x8)
	Class SpotLightComponent*                                    SpotLight10;                                       // 0x520(0x8)
	Class SpotLightComponent*                                    SpotLight9;                                        // 0x528(0x8)
	Class PointLightComponent*                                   PointLight9;                                       // 0x530(0x8)
	Class SpotLightComponent*                                    SpotLight8;                                        // 0x538(0x8)
	Class ParticleSystemComponent*                               ParticleSystem12;                                  // 0x540(0x8)
	Class ParticleSystemComponent*                               ParticleSystem11;                                  // 0x548(0x8)
	Class SpotLightComponent*                                    SpotLight;                                         // 0x550(0x8)
	Class StaticMeshComponent*                                   StaticMesh23;                                      // 0x558(0x8)
	Class StaticMeshComponent*                                   bld_par_lantern_01_a;                              // 0x560(0x8)
	Class ChildActorComponent*                                   ChildActor1;                                       // 0x568(0x8)
	Class ChildActorComponent*                                   ChildActor;                                        // 0x570(0x8)
	Class ParticleSystemComponent*                               ParticleSystem10;                                  // 0x578(0x8)
	Class ParticleSystemComponent*                               ParticleSystem9;                                   // 0x580(0x8)
	Class ParticleSystemComponent*                               ParticleSystem8;                                   // 0x588(0x8)
	Class ParticleSystemComponent*                               ParticleSystem7;                                   // 0x590(0x8)
	Class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x598(0x8)
	Class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x5a0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x5a8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x5b0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x5b8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x5c0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x5c8(0x8)
	Class ParticleSystemComponent*                               vfx_candle_01_flickering_tavern;                   // 0x5d0(0x8)
	Class ChildActorComponent*                                   BP_Candle_Light_01_a;                              // 0x5d8(0x8)
	Class PointLightComponent*                                   PointLight8;                                       // 0x5e0(0x8)
	Class PointLightComponent*                                   PointLight7;                                       // 0x5e8(0x8)
	Class PointLightComponent*                                   PointLight6;                                       // 0x5f0(0x8)
	Class PointLightComponent*                                   PointLight5;                                       // 0x5f8(0x8)
	Class PointLightComponent*                                   PointLight4;                                       // 0x600(0x8)
	Class PointLightComponent*                                   PointLight3;                                       // 0x608(0x8)
	Class StaticMeshComponent*                                   StaticMesh70;                                      // 0x610(0x8)
	Class StaticMeshComponent*                                   StaticMesh69;                                      // 0x618(0x8)
	Class StaticMeshComponent*                                   StaticMesh61;                                      // 0x620(0x8)
	Class StaticMeshComponent*                                   StaticMesh60;                                      // 0x628(0x8)
	Class StaticMeshComponent*                                   StaticMesh59;                                      // 0x630(0x8)
	Class StaticMeshComponent*                                   StaticMesh58;                                      // 0x638(0x8)
	Class StaticMeshComponent*                                   StaticMesh51;                                      // 0x640(0x8)
	Class StaticMeshComponent*                                   StaticMesh45;                                      // 0x648(0x8)
	Class StaticMeshComponent*                                   StaticMesh43;                                      // 0x650(0x8)
	Class StaticMeshComponent*                                   StaticMesh34;                                      // 0x658(0x8)
	Class StaticMeshComponent*                                   StaticMesh21;                                      // 0x660(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_a;                                   // 0x668(0x8)
	Class StaticMeshComponent*                                   StaticMesh31;                                      // 0x670(0x8)
	Class StaticMeshComponent*                                   StaticMesh28;                                      // 0x678(0x8)
	Class StaticMeshComponent*                                   trs_candlestick_02_a;                              // 0x680(0x8)
	Class StaticMeshComponent*                                   trs_candlestick_03_a1;                             // 0x688(0x8)
	Class StaticMeshComponent*                                   trs_candlestick_03_a;                              // 0x690(0x8)
	Class StaticMeshComponent*                                   volumetric_sphere;                                 // 0x698(0x8)
	Class SpotLightComponent*                                    SpotLight7;                                        // 0x6a0(0x8)
	Class SpotLightComponent*                                    SpotLight6;                                        // 0x6a8(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x6b0(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x6b8(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x6c0(0x8)
	Class SpotLightComponent*                                    SpotLight4;                                        // 0x6c8(0x8)
	Class SpotLightComponent*                                    SpotLight3;                                        // 0x6d0(0x8)
	Class SpotLightComponent*                                    SpotLight2;                                        // 0x6d8(0x8)
	Class SpotLightComponent*                                    SpotLight1;                                        // 0x6e0(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0x6e8(0x8)
	Class BoxComponent*                                          Box;                                               // 0x6f0(0x8)
	Class StaticMeshComponent*                                   cap_candle_chandelier_candle_flames_01_a;          // 0x6f8(0x8)
	Class StaticMeshComponent*                                   bld_sovereign_cloth_02_a;                          // 0x700(0x8)
	Class StaticMeshComponent*                                   bld_sovereign_cloth_01_a;                          // 0x708(0x8)
	Class StaticMeshComponent*                                   bld_sovereign_hut_ropes_01_a;                      // 0x710(0x8)
	Class StaticMeshComponent*                                   StaticMesh68;                                      // 0x718(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x720(0x8)
	Class StaticMeshComponent*                                   bld_sovereign_hut_mechanism_01_a;                  // 0x728(0x8)
	Class StaticMeshComponent*                                   bld_sovereign_hut_Base_01_a;                       // 0x730(0x8)
	Class StaticMeshComponent*                                   StaticMesh67;                                      // 0x738(0x8)
	Class StaticMeshComponent*                                   StaticMesh65;                                      // 0x740(0x8)
	Class StaticMeshComponent*                                   StaticMesh66;                                      // 0x748(0x8)
	Class StaticMeshComponent*                                   StaticMesh64;                                      // 0x750(0x8)
	Class StaticMeshComponent*                                   StaticMesh63;                                      // 0x758(0x8)
	Class StaticMeshComponent*                                   bld_jetty_support_c;                               // 0x760(0x8)
	Class StaticMeshComponent*                                   StaticMesh22;                                      // 0x768(0x8)
	Class StaticMeshComponent*                                   bld_sovereign_hut_crest_01_a;                      // 0x770(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x778(0x8)
	Class StaticMeshComponent*                                   StaticMesh62;                                      // 0x780(0x8)
	Class CompanyRegionComponent*                                CompanyRegion;                                     // 0x788(0x8)
	Class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x790(0x8)
	Class StaticMeshComponent*                                   StaticMesh57;                                      // 0x798(0x8)
	Class StaticMeshComponent*                                   StaticMesh56;                                      // 0x7a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh55;                                      // 0x7a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh54;                                      // 0x7b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh53;                                      // 0x7b8(0x8)
	Class StaticMeshComponent*                                   StaticMesh49;                                      // 0x7c0(0x8)
	Class StaticMeshComponent*                                   StaticMesh48;                                      // 0x7c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh47;                                      // 0x7d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh39;                                      // 0x7d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh38;                                      // 0x7e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh37;                                      // 0x7e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh36;                                      // 0x7f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh35;                                      // 0x7f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh33;                                      // 0x800(0x8)
	Class StaticMeshComponent*                                   StaticMesh32;                                      // 0x808(0x8)
	Class StaticMeshComponent*                                   StaticMesh30;                                      // 0x810(0x8)
	Class StaticMeshComponent*                                   StaticMesh29;                                      // 0x818(0x8)
	Class StaticMeshComponent*                                   StaticMesh27;                                      // 0x820(0x8)
	Class StaticMeshComponent*                                   StaticMesh26;                                      // 0x828(0x8)
	Class StaticMeshComponent*                                   StaticMesh25;                                      // 0x830(0x8)
	Class StaticMeshComponent*                                   StaticMesh20;                                      // 0x838(0x8)
	Class StaticMeshComponent*                                   StaticMesh17;                                      // 0x840(0x8)
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x848(0x8)
	Class StaticMeshComponent*                                   StaticMesh15;                                      // 0x850(0x8)
	Class StaticMeshComponent*                                   StaticMesh13;                                      // 0x858(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x860(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x868(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x870(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x878(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x880(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x888(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x890(0x8)
};


}