#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x108 (Full Size[0x4d0] - InheritedSize[0x3c8]
class BP_shop_gld_01_a_C: public Actor
{
public:
	class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3c8(0x8)
	class CompanyRegionComponent*                                CompanyRegion;                                     // 0x3d0(0x8)
	class SpotLightComponent*                                    SpotLight5;                                        // 0x3d8(0x8)
	class SpotLightComponent*                                    SpotLight4;                                        // 0x3e0(0x8)
	class PointLightComponent*                                   PointLight4;                                       // 0x3e8(0x8)
	class SpotLightComponent*                                    SpotLight3;                                        // 0x3f0(0x8)
	class SpotLightComponent*                                    SpotLight2;                                        // 0x3f8(0x8)
	class SpotLightComponent*                                    SpotLight1;                                        // 0x400(0x8)
	class SpotLightComponent*                                    SpotLight;                                         // 0x408(0x8)
	class PointLightComponent*                                   PointLight3;                                       // 0x410(0x8)
	class PointLightComponent*                                   PointLight2;                                       // 0x418(0x8)
	class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x420(0x8)
	class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x428(0x8)
	class ParticleSystemComponent*                               ParticleSystem;                                    // 0x430(0x8)
	class ParticleSystemComponent*                               vfx_torch_02_weak;                                 // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMesh1;                                       // 0x440(0x8)
	class StaticMeshComponent*                                   wsp_light_source_plate_a;                          // 0x448(0x8)
	class StaticMeshComponent*                                   wsp_light_source_pot_a1;                           // 0x450(0x8)
	class StaticMeshComponent*                                   wsp_light_source_pot_a;                            // 0x458(0x8)
	class PointLightComponent*                                   PointLight1;                                       // 0x460(0x8)
	class PointLightComponent*                                   PointLight;                                        // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x470(0x8)
	class StaticMeshComponent*                                   tls_wld_orb_light_c;                               // 0x478(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_a;                             // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x488(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x490(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x498(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x4a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x4a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x4b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x4b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x4c0(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x4c8(0x8)
};


