// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x98 (Full Size[0x548] - InheritedSize[0x4b0]
class BP_StepsTrigger_C: public TavernStepsTrigger
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x4b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4b8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x4c0(0x8)
	Class DecalComponent*                                        None;                                              // 0x4c8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x4d0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x4d8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x4e0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x4e8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x4f0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x4f8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x500(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x508(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x510(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x518(0x8)
	Class BoxComponent*                                          None;                                              // 0x520(0x8)
	Class BoxComponent*                                          None;                                              // 0x528(0x8)
	Class BoxComponent*                                          None;                                              // 0x530(0x8)
	Class BoxComponent*                                          None;                                              // 0x538(0x8)
	Class PoseableSkeletalMeshComponent*                         None;                                              // 0x540(0x8)
};


}