// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x408] - InheritedSize[0x3c8]
class BP_Sea_Fort_WindowGlows_C: public SeaFortDistantLights
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class SceneComponent*                                        None;                                              // 0x3e0(0x8)
	float                                                        None;                                              // 0x3e8(0x4)
	byte                                                         None;                                              // 0x3ec(0x1)
	char                                                         pad0x3_SCYNT[0x3];                                 // 0x3ed(0x3)
	Class TimelineComponent*                                     None;                                              // 0x3f0(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x3f8(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x400(0x8)
};


}