// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size -0x1 (Full Size[-0x1] - InheritedSize[0x0]
class BP_ShadyEquipmentShop_C: public OffTopSplineComponent
{
public:
	char                                                         pad0x448_J1KIB[0x448];                             // 0x0(0x448)
	Class SplineComponent*                                       OffTopSplineComponent;                             // 0x448(0x8)
	float                                                        MaxDistFromLadderTopToClassifyAsTopDocking;        // 0x450(0x4)
	Struct Vector                                                InteractOffset;                                    // 0x454(0xc)
	Struct LadderDefinition                                      LadderDefinition;                                  // 0x460(0x1c)
	char                                                         pad0x4_NCHK1[0x4];                                 // 0x47c(0x4)
	Class PhysicalMaterial*                                      LadderPhysicsMaterial;                             // 0x480(0x8)
	Class PhrasesRadialDataAsset*                                Phrases;                                           // 0x488(0x8)
	float                                                        RepeatExecutionThreshold;                          // 0x490(0x4)
};


}