#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x98 (Full Size[0x548] - InheritedSize[0x4b0]
class BP_StepsTrigger_C: public TavernStepsTrigger
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x4b0(0x8)
	class StaticMeshComponent*                                   bld_tavern_entrance_steps_lightshafts_01_a;        // 0x4b8(0x8)
	class ParticleSystemComponent*                               vfx_tavern_stairs_symbol_glow;                     // 0x4c0(0x8)
	class DecalComponent*                                        Decal;                                             // 0x4c8(0x8)
	class ParticleSystemComponent*                               vfx_tavern_stairs_glow;                            // 0x4d0(0x8)
	class ParticleSystemComponent*                               vfx_tavern_stairs_falling_dust_under_ground;       // 0x4d8(0x8)
	class ParticleSystemComponent*                               vfx_tavern_stairs_falling_dust2;                   // 0x4e0(0x8)
	class ParticleSystemComponent*                               vfx_tavern_stairs_falling_dust1;                   // 0x4e8(0x8)
	class ParticleSystemComponent*                               vfx_tavern_stairs_impact3;                         // 0x4f0(0x8)
	class ParticleSystemComponent*                               vfx_tavern_stairs_impact2;                         // 0x4f8(0x8)
	class ParticleSystemComponent*                               vfx_tavern_stairs_impact1;                         // 0x500(0x8)
	class ParticleSystemComponent*                               vfx_tavern_stairs_impact;                          // 0x508(0x8)
	class ParticleSystemComponent*                               vfx_tavern_stairs_falling_dust;                    // 0x510(0x8)
	blueprintgeneratedclass BP_AnimatedStepsComponent_C*         AnimatedStepsComponent;                            // 0x518(0x8)
	class BoxComponent*                                          Box1;                                              // 0x520(0x8)
	class BoxComponent*                                          Box3;                                              // 0x528(0x8)
	class BoxComponent*                                          Box2;                                              // 0x530(0x8)
	class BoxComponent*                                          Box0;                                              // 0x538(0x8)
	class PoseableSkeletalMeshComponent*                         StepsMesh;                                         // 0x540(0x8)
};


