// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0xa30] - InheritedSize[0x9f0]
class BP_SirenTrident_Wieldable_C: public DoubleActionItemWithAmmo
{
public:
	Class AimSensitivityComponent*                               AimSensitivity;                                    // 0x9f0(0x8)
	Class AmmoEffectsComponent*                                  AmmoEffects;                                       // 0x9f8(0x8)
	Class StaticStashedMeshMemoryConstraintComponent*            StaticStashedMeshMemoryConstraint;                 // 0xa00(0x8)
	Class AmmoTransferComponent*                                 AmmoTransfer;                                      // 0xa08(0x8)
	Class ItemActionComponent*                                   AimDownSightAction;                                // 0xa10(0x8)
	Class SirenTridentShotActionComponent*                       SirenTridentShotAction;                            // 0xa18(0x8)
	Class LaunchableAttachPointComponent*                        LaunchableAttachPoint;                             // 0xa20(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0xa28(0x8)
};


}