// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x50 (Full Size[0x940] - InheritedSize[0x8f0]
class BP_SmallShip_QuestTable_C: public VoyageTable
{
public:
	Class ChildActorComponent*                                   None;                                              // 0x8f0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x8f8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x900(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x908(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x910(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x918(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x920(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x928(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x930(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x938(0x8)
};


}