// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x200 (Full Size[0x5c8] - InheritedSize[0x3c8]
class BP_sod_bld_cls_shop_01_a_C: public Actor
{
public:
	class StaticMeshComponent*                                   bld_cls_shop_door_01_b;                            // 0x3c8(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_window_01_b2;                         // 0x3d0(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_window_01_b1;                         // 0x3d8(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_window_01_b;                          // 0x3e0(0x8)
	class StaticMeshComponent*                                   cmn_cloth_09_a;                                    // 0x3e8(0x8)
	class StaticMeshComponent*                                   sod_bld_cls_shop_sign_01_a1;                       // 0x3f0(0x8)
	class StaticMeshComponent*                                   sod_bld_cls_shop_sign_01_a;                        // 0x3f8(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_doorframe_01_a1;                      // 0x400(0x8)
	class BoxComponent*                                          BoxCollision_04;                                   // 0x408(0x8)
	class BoxComponent*                                          BoxCollision_03;                                   // 0x410(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_doorframe_01_a;                       // 0x418(0x8)
	class StaticMeshComponent*                                   gmp_bar_stor_01_a;                                 // 0x420(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_b;                             // 0x428(0x8)
	class StaticMeshComponent*                                   sod_bld_cls_shop_dressing_01_b;                    // 0x430(0x8)
	class StaticMeshComponent*                                   sod_bld_floor_02_a1;                               // 0x438(0x8)
	class StaticMeshComponent*                                   sod_bld_floor_02_a;                                // 0x440(0x8)
	class StaticMeshComponent*                                   sod_bld_beam_01_a;                                 // 0x448(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a1;                                // 0x450(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a;                                 // 0x458(0x8)
	class StaticMeshComponent*                                   sod_bld_fence_03_a2;                               // 0x460(0x8)
	class StaticMeshComponent*                                   sod_bld_fence_03_a1;                               // 0x468(0x8)
	class StaticMeshComponent*                                   sod_bld_fence_03_a;                                // 0x470(0x8)
	class StaticMeshComponent*                                   sod_bld_fence_02_a;                                // 0x478(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_sign_standing_01_a;                    // 0x480(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_sign_01_a;                             // 0x488(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_dye_pot_lid_01_a;                      // 0x490(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_dye_pot_01_c1;                         // 0x498(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_dye_pot_01_a;                          // 0x4a0(0x8)
	class StaticMeshComponent*                                   sod_bld_cls_shop_dressing_01_a;                    // 0x4a8(0x8)
	class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x4b0(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_mannequin_01_a1;                      // 0x4b8(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_mannequin_01_a;                       // 0x4c0(0x8)
	class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x4c8(0x8)
	class BoxComponent*                                          BoxCollision_02;                                   // 0x4d0(0x8)
	class BoxComponent*                                          BoxCollision_01;                                   // 0x4d8(0x8)
	class StaticMeshComponent*                                   bsp_cls_shop_dressing_01_a;                        // 0x4e0(0x8)
	class SpotLightComponent*                                    SpotLight8;                                        // 0x4e8(0x8)
	class SpotLightComponent*                                    SpotLight7;                                        // 0x4f0(0x8)
	class ChildActorComponent*                                   BP_IslandVanityChest;                              // 0x4f8(0x8)
	class StaticMeshComponent*                                   bld_int_stool_02_a;                                // 0x500(0x8)
	class ChildActorComponent*                                   BP_IslandClothingChest;                            // 0x508(0x8)
	class ChildActorComponent*                                   ChildActor1;                                       // 0x510(0x8)
	class ChildActorComponent*                                   ChildActor;                                        // 0x518(0x8)
	class ChildActorComponent*                                   wsp_bottle_burner;                                 // 0x520(0x8)
	class SpotLightComponent*                                    SpotLight6;                                        // 0x528(0x8)
	class SpotLightComponent*                                    SpotLight3;                                        // 0x530(0x8)
	class SpotLightComponent*                                    SpotLight1;                                        // 0x538(0x8)
	class SpotLightComponent*                                    SpotLight;                                         // 0x540(0x8)
	class PointLightComponent*                                   PointLight;                                        // 0x548(0x8)
	class StaticMeshComponent*                                   cmn_moneybag_01_a;                                 // 0x550(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_hanging_cloth_03_a;                   // 0x558(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_02_a;                              // 0x560(0x8)
	class StaticMeshComponent*                                   bld_enc_shop_rug_01_a;                             // 0x568(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_hanging_cloth_02_a;                   // 0x570(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_dye_pot_lid_01_c;                      // 0x578(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_dye_pot_lid_01_b;                      // 0x580(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_dye_pot_01_c;                          // 0x588(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_dye_pot_01_b;                          // 0x590(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_01_a;                              // 0x598(0x8)
	class StaticMeshComponent*                                   bld_shop_rug_01_a;                                 // 0x5a0(0x8)
	class StaticMeshComponent*                                   bld_shop_table_01_a;                               // 0x5a8(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_door_01_a;                            // 0x5b0(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_window_01_a2;                         // 0x5b8(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x5c0(0x8)
};


}