// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1008 (Full Size[0x13d0] - InheritedSize[0x3c8]
class BP_sod_bld_sov_shell_01_a_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class BoxComponent*                                          None;                                              // 0x3d8(0x8)
	Class BoxComponent*                                          None;                                              // 0x3e0(0x8)
	Class BoxComponent*                                          None;                                              // 0x3e8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class CompanyRegionComponent*                                None;                                              // 0x400(0x8)
	Class WorldLocationPopUpComponent*                           None;                                              // 0x408(0x8)
	Class BoxComponent*                                          None;                                              // 0x410(0x8)
	Class BoxComponent*                                          None;                                              // 0x418(0x8)
	Class BoxComponent*                                          None;                                              // 0x420(0x8)
	Class BoxComponent*                                          None;                                              // 0x428(0x8)
	Class BoxComponent*                                          None;                                              // 0x430(0x8)
	Class BoxComponent*                                          None;                                              // 0x438(0x8)
	Class BoxComponent*                                          None;                                              // 0x440(0x8)
	Class BoxComponent*                                          None;                                              // 0x448(0x8)
	Class BoxComponent*                                          None;                                              // 0x450(0x8)
	Class BoxComponent*                                          None;                                              // 0x458(0x8)
	Class BoxComponent*                                          None;                                              // 0x460(0x8)
	Class BoxComponent*                                          None;                                              // 0x468(0x8)
	Class BoxComponent*                                          None;                                              // 0x470(0x8)
	Class BoxComponent*                                          None;                                              // 0x478(0x8)
	Class BoxComponent*                                          None;                                              // 0x480(0x8)
	Class BoxComponent*                                          None;                                              // 0x488(0x8)
	Class BoxComponent*                                          None;                                              // 0x490(0x8)
	Class BoxComponent*                                          None;                                              // 0x498(0x8)
	Class BoxComponent*                                          None;                                              // 0x4a0(0x8)
	Class BoxComponent*                                          None;                                              // 0x4a8(0x8)
	Class BoxComponent*                                          None;                                              // 0x4b0(0x8)
	Class BoxComponent*                                          None;                                              // 0x4b8(0x8)
	Class BoxComponent*                                          None;                                              // 0x4c0(0x8)
	Class BoxComponent*                                          None;                                              // 0x4c8(0x8)
	Class BoxComponent*                                          None;                                              // 0x4d0(0x8)
	Class BoxComponent*                                          None;                                              // 0x4d8(0x8)
	Class BoxComponent*                                          None;                                              // 0x4e0(0x8)
	Class BoxComponent*                                          None;                                              // 0x4e8(0x8)
	Class BoxComponent*                                          None;                                              // 0x4f0(0x8)
	Class BoxComponent*                                          None;                                              // 0x4f8(0x8)
	Class BoxComponent*                                          None;                                              // 0x500(0x8)
	Class BoxComponent*                                          None;                                              // 0x508(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x510(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x518(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x520(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x528(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x530(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x538(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x540(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x548(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x550(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x558(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x560(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x568(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x570(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x578(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x580(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x588(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x590(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x598(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x600(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x608(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x610(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x618(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x620(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x628(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x630(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x638(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x640(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x648(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x650(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x658(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x660(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x668(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x670(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x678(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x680(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x688(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x690(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x698(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x700(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x708(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x710(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x718(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x720(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x728(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x730(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x738(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x740(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x748(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x750(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x758(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x760(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x768(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x770(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x778(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x780(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x788(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x790(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x798(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x800(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x808(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x810(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x818(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x820(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x828(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x830(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x838(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x840(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x848(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x850(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x858(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x860(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x868(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x870(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x878(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x880(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x888(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x890(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x898(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x900(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x908(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x910(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x918(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x920(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x928(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x930(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x938(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x940(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x948(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x950(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x958(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x960(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x968(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x970(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x978(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x980(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x988(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x990(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x998(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa00(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa08(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa10(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa18(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa20(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa28(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa30(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa38(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa40(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa48(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa50(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa58(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa60(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa68(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa70(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa78(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa80(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa88(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa90(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa98(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xaa0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xaa8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xab0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xab8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xac0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xac8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xad0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xad8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xae0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xae8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xaf0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xaf8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb00(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb08(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb10(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb18(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb20(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb28(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb30(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb38(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb40(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb48(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb50(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb58(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb60(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb68(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb70(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb78(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb80(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb88(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb90(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xb98(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xba0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xba8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xbb0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xbb8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xbc0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xbc8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xbd0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xbd8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xbe0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xbe8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xbf0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xbf8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc00(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc08(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc10(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc18(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc20(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc28(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc30(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc38(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc40(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc48(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc50(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc58(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc60(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc68(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc70(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc78(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc80(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc88(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc90(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc98(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xca0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xca8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xcb0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xcb8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xcc0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xcc8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xcd0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xcd8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xce0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xce8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xcf0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xcf8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd00(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd08(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd10(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd18(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd20(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd28(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd30(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd38(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd40(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd48(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd50(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd58(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd60(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd68(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd70(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd78(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd80(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd88(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd90(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xd98(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xda0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xda8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xdb0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xdb8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xdc0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xdc8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xdd0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xdd8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xde0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xde8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xdf0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xdf8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe00(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe08(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe10(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe18(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe20(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe28(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe30(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe38(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe40(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe48(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe50(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe58(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe60(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe68(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe70(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe78(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe80(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe88(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe90(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xe98(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xea0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xea8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xeb0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xeb8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xec0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xec8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xed0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xed8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xee0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xee8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xef0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xef8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf00(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf08(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf10(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf18(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf20(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf28(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf30(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf38(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf40(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf48(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf50(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf58(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf60(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf68(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf70(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf78(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf80(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf88(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf90(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xf98(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xfa0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xfa8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xfb0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xfb8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xfc0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xfc8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xfd0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xfd8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xfe0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xfe8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xff0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xff8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1000(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1008(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1010(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1018(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1020(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1028(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1030(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1038(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1040(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1048(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1050(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1058(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1060(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1068(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1070(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1078(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1080(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1088(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1090(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1098(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x10a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x10a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x10b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x10b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x10c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x10c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x10d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x10d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x10e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x10e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x10f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x10f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1100(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1108(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1110(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1118(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1120(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1128(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1130(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1138(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1140(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1148(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1150(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1158(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1160(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1168(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1170(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1178(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1180(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1188(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1190(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1198(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x11a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x11a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x11b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x11b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x11c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x11c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x11d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x11d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x11e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x11e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x11f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x11f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1200(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1208(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1210(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1218(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1220(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1228(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1230(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1238(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1240(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1248(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1250(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1258(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1260(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1268(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1270(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1278(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1280(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1288(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1290(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1298(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x12a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x12a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x12b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x12b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x12c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x12c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x12d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x12d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x12e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x12e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x12f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x12f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1300(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1308(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1310(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1318(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1320(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1328(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1330(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1338(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1340(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1348(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1350(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1358(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1360(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1368(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1370(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1378(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1380(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1388(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1390(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1398(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x13a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x13a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x13b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x13b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x13c0(0x8)
	Class SceneComponent*                                        None;                                              // 0x13c8(0x8)
};


}