#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x120 (Full Size[0x4c0] - InheritedSize[0x3a0]
class BP_sod_bld_tvn_ngs_upperfloor_dressing_01_a_frontend_C: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent0199;                           // 0x3a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0198;                           // 0x3a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0197;                           // 0x3b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0195;                           // 0x3b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0194;                           // 0x3c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0189;                           // 0x3c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0183;                           // 0x3d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0172;                           // 0x3d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0171;                           // 0x3e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0169;                           // 0x3e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0137;                           // 0x3f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0136;                           // 0x3f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0130;                           // 0x400(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0129;                           // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0128;                           // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0127;                           // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0126;                           // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0125;                           // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0124;                           // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0123;                           // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0122;                           // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0121;                           // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent094;                            // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent047;                            // 0x458(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent034;                            // 0x460(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent032;                            // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent029;                            // 0x470(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent026;                            // 0x478(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent025;                            // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0x488(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent021;                            // 0x490(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x498(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x4a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x4a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x4b0(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x4b8(0x8)
};


