// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x408] - InheritedSize[0x3c8]
class BP_SmallShip_StandardHull_Art_Interior_Lower_Deck_C: public Actor
{
public:
	class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3c8(0x8)
	class ChildActorComponent*                                   BP_CookingPot2;                                    // 0x3d0(0x8)
	class ChildActorComponent*                                   BP_CookingPot;                                     // 0x3d8(0x8)
	class StaticMeshComponent*                                   shp_kitchen_extractor_01_a;                        // 0x3e0(0x8)
	class StaticMeshComponent*                                   shp_cooker_02_a;                                   // 0x3e8(0x8)
	class StaticMeshComponent*                                   shp_small_lower_deck_rope_01_a;                    // 0x3f0(0x8)
	class StaticMeshComponent*                                   shp_small_lower_deck_01_a;                         // 0x3f8(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x400(0x8)
};


}