// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x130 (Full Size[0x4f8] - InheritedSize[0x3c8]
class BP_shop_mrh_moving_01_a_C: public Actor
{
public:
	Class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3c8(0x8)
	Class ChildActorComponent*                                   CommodityManifestBook;                             // 0x3d0(0x8)
	Class StaticMeshComponent*                                   bld_prem_shop_plinth_01_b;                         // 0x3d8(0x8)
	Class ParticleSystemComponent*                               vfx_candle_01_tavern_02;                           // 0x3e0(0x8)
	Class ParticleSystemComponent*                               vfx_candle_01_flickering_tavern_small_02;          // 0x3e8(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_b;                                   // 0x3f0(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_d_02;                                // 0x3f8(0x8)
	Class PointLightComponent*                                   PointLight3;                                       // 0x400(0x8)
	Class ParticleSystemComponent*                               vfx_candle_01_tavern1;                             // 0x408(0x8)
	Class ParticleSystemComponent*                               vfx_candle_01_flickering_tavern_small;             // 0x410(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_c;                                   // 0x418(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_d;                                   // 0x420(0x8)
	Class StaticMeshComponent*                                   cmp_ships_manifest_mrh_01_e;                       // 0x428(0x8)
	Class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x430(0x8)
	Class StaticMeshComponent*                                   bld_shop_mrh_01_b;                                 // 0x438(0x8)
	Class StaticMeshComponent*                                   bld_shop_mrh_01_f;                                 // 0x440(0x8)
	Class StaticMeshComponent*                                   bld_shop_mrh_01_e;                                 // 0x448(0x8)
	Class StaticMeshComponent*                                   bld_shop_mrh_01_d;                                 // 0x450(0x8)
	Class StaticMeshComponent*                                   bld_shop_mrh_01_c;                                 // 0x458(0x8)
	Class SpotLightComponent*                                    SpotLight4;                                        // 0x460(0x8)
	Class SpotLightComponent*                                    SpotLight3;                                        // 0x468(0x8)
	Class CompanyRegionComponent*                                CompanyRegion;                                     // 0x470(0x8)
	Class SpotLightComponent*                                    SpotLight2;                                        // 0x478(0x8)
	Class SpotLightComponent*                                    SpotLight1;                                        // 0x480(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x488(0x8)
	Class ChildActorComponent*                                   ChildActor;                                        // 0x490(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x498(0x8)
	Class ChildActorComponent*                                   bp_light_volume_sphere_orange_a;                   // 0x4a0(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x4a8(0x8)
	Class ChildActorComponent*                                   tls_wld_Orb_light_a;                               // 0x4b0(0x8)
	Class SpotLightComponent*                                    SpotLight;                                         // 0x4b8(0x8)
	Class ParticleSystemComponent*                               vfx_candle_01_tavern;                              // 0x4c0(0x8)
	Class StaticMeshComponent*                                   bld_shop_globe_mrh_01_a;                           // 0x4c8(0x8)
	Class StaticMeshComponent*                                   bld_par_lantern_01_a;                              // 0x4d0(0x8)
	Class StaticMeshComponent*                                   bld_shop_blackboard_mch_01_a;                      // 0x4d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x4e0(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_03_a;                            // 0x4e8(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x4f0(0x8)
};


}