// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x620 (Full Size[0x9e8] - InheritedSize[0x3c8]
class BP_sod_bld_gld_enc_shop_int_dressing_02_a_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class BoxComponent*                                          None;                                              // 0x3e0(0x8)
	Class BoxComponent*                                          None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x420(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x430(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x438(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x440(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x448(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x450(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x458(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x460(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x468(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x470(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x478(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x480(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x488(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x490(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x498(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x500(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x508(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x510(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x518(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x520(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x528(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x530(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x538(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x540(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x548(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x550(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x558(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x560(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x568(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x570(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x578(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x580(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x588(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x590(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x598(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x5f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x600(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x608(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x610(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x618(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x620(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x628(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x630(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x638(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x640(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x648(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x650(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x658(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x660(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x668(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x670(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x678(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x680(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x688(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x690(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x698(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x700(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x708(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x710(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x718(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x720(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x728(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x730(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x738(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x740(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x748(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x750(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x758(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x760(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x768(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x770(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x778(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x780(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x788(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x790(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x798(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x800(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x808(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x810(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x818(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x820(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x828(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x830(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x838(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x840(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x848(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x850(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x858(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x860(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x868(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x870(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x878(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x880(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x888(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x890(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x898(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x8f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x900(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x908(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x910(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x918(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x920(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x928(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x930(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x938(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x940(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x948(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x950(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x958(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x960(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x968(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x970(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x978(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x980(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x988(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x990(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x998(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x9d8(0x8)
	Class SceneComponent*                                        None;                                              // 0x9e0(0x8)
};


}