// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x310
class BP_SmallShipTemplate_C: public Ship
{
public:
	Class TeleportLocationComponent*                             TeleportLocation;                                  // 0x16a0(0x8)
	Class TeleportLocationComponent*                             TeleportLocation;                                  // 0x16a8(0x8)
	Class TeleportLocationComponent*                             TeleportLocation;                                  // 0x16b0(0x8)
	Class TeleportLocationComponent*                             TeleportLocation;                                  // 0x16b8(0x8)
	Class TeleportLocationComponent*                             TeleportLocation;                                  // 0x16c0(0x8)
	Class TeleportLocationComponent*                             TeleportLocation;                                  // 0x16c8(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_09;                               // 0x16d0(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_08;                               // 0x16d8(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_07;                               // 0x16e0(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_06;                               // 0x16e8(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_05;                               // 0x16f0(0x8)
	BlueprintGeneratedClass BP_ShipTrinketMountpointManagerComponent_Small_C* ShipTrinketMountpointManagerComponent_Small;       // 0x16f8(0x8)
	Class ChildActorComponent*                                   CaptainsLog;                                       // 0x1700(0x8)
	Class ChildActorComponent*                                   ShipsCrest;                                        // 0x1708(0x8)
	Class ChildActorComponent*                                   Rugs;                                              // 0x1710(0x8)
	Class ChildActorComponent*                                   Drapes;                                            // 0x1718(0x8)
	Class ChildActorComponent*                                   Bed;                                               // 0x1720(0x8)
	Class ShipStorageJettisonComponent*                          ShipStorageJettison;                               // 0x1728(0x8)
	Class ChildActorComponent*                                   VoyageTable;                                       // 0x1730(0x8)
	BlueprintGeneratedClass BP_BedComponent_C*                   BP_BedComponent;                                   // 0x1738(0x8)
	Class StaticMeshComponent*                                   Rat3;                                              // 0x1740(0x8)
	Class StaticMeshComponent*                                   Rat2;                                              // 0x1748(0x8)
	Class StaticMeshComponent*                                   Rat1;                                              // 0x1750(0x8)
	Class RatManagerComponent*                                   RatManager;                                        // 0x1758(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_MapTable;                                     // 0x1760(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_MapTable;                                     // 0x1768(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Barrel_Top;                                   // 0x1770(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Front_Starboard;                              // 0x1778(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Front_Port;                                   // 0x1780(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Side_Starboard;                               // 0x1788(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Side_Port;                                    // 0x1790(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Bottom_Barrel;                                // 0x1798(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Bottom_Port;                                  // 0x17a0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Bottom_Starboard;                             // 0x17a8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Top_Rear;                                     // 0x17b0(0x8)
	Class ArrowComponent*                                        Arrow;                                             // 0x17b8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Top_Rear;                                     // 0x17c0(0x8)
	Class AIRegionComponent*                                     AIRegion;                                          // 0x17c8(0x8)
	Class NamedPointsComponent*                                  NamedPoints;                                       // 0x17d0(0x8)
	Class StaticMeshComponent*                                   shp_small_ladder_gap_hits_01_a;                    // 0x17d8(0x8)
	Class StaticMeshComponent*                                   shp_flag_hole_01_a;                                // 0x17e0(0x8)
	Class ChildActorComponent*                                   BP_EmissaryFlag;                                   // 0x17e8(0x8)
	Class EmissaryFlotsamItemSpawnComponent*                     EmissaryFlotsamItemSpawner;                        // 0x17f0(0x8)
	Class ChildActorComponent*                                   BP_LargeShip_CageLatch_03_b;                       // 0x17f8(0x8)
	Class ChildActorComponent*                                   BP_SmallShip_WindowHatchRight;                     // 0x1800(0x8)
	Class ChildActorComponent*                                   BP_SmallShip_WindowHatchLeft;                      // 0x1808(0x8)
	Class ChildActorComponent*                                   BP_WaterBarrel;                                    // 0x1810(0x8)
	Class ChildActorComponent*                                   BP_Shroudbreaker;                                  // 0x1818(0x8)
	Class ChildActorComponent*                                   BP_ShipPetChest;                                   // 0x1820(0x8)
	Class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x1828(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Food;                            // 0x1830(0x8)
	Class ChildActorComponent*                                   BP_HarpoonLauncher1;                               // 0x1838(0x8)
	Class ChildActorComponent*                                   BP_HarpoonLauncher;                                // 0x1840(0x8)
	Class ChildActorComponent*                                   RowboatMountpoint;                                 // 0x1848(0x8)
	Class ShipTelemetryComponent*                                ShipTelemetry;                                     // 0x1850(0x8)
	Class RiggingSystemComponent*                                ControlsRigging;                                   // 0x1858(0x8)
	Class ChildActorComponent*                                   BP_ShipVanityChest;                                // 0x1860(0x8)
	Class ChildActorComponent*                                   BP_SmallShipLadder_02;                             // 0x1868(0x8)
	Class ChildActorComponent*                                   Lanterns;                                          // 0x1870(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck10;                     // 0x1878(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck8;                      // 0x1880(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck7;                      // 0x1888(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Food;                            // 0x1890(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Cannonball2;                     // 0x1898(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Cannonball1;                     // 0x18a0(0x8)
	Class ChildActorComponent*                                   BP_EquipmentChest;                                 // 0x18a8(0x8)
	Class ChildActorComponent*                                   BP_ClothingChest;                                  // 0x18b0(0x8)
	Class ChildActorComponent*                                   BP_WeaponsChest;                                   // 0x18b8(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck3;                      // 0x18c0(0x8)
	Class ChildActorComponent*                                   BP_SmallMapTable;                                  // 0x18c8(0x8)
	Class ChildActorComponent*                                   Capstan;                                           // 0x18d0(0x8)
	Class ChildActorComponent*                                   GrogBarrel;                                        // 0x18d8(0x8)
	Class ChildActorComponent*                                   MastMainSailAngleLeft;                             // 0x18e0(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck1;                      // 0x18e8(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck11;                     // 0x18f0(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Wood;                            // 0x18f8(0x8)
	Class BoxComponent*                                          RammingSpurZone;                                   // 0x1900(0x8)
	Class StaticMeshComponent*                                   shp_shark_hits_01_a;                               // 0x1908(0x8)
	Class ChildActorComponent*                                   BP_AmmoChest;                                      // 0x1910(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_04;                               // 0x1918(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_03;                               // 0x1920(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_02;                               // 0x1928(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_01;                               // 0x1930(0x8)
	Class RiggingSystemComponent*                                MainRigging;                                       // 0x1938(0x8)
	Class ChildActorComponent*                                   ShipsCompass;                                      // 0x1940(0x8)
	Class ChildActorComponent*                                   Figurehead;                                        // 0x1948(0x8)
	Class ChildActorComponent*                                   CannonRight1;                                      // 0x1950(0x8)
	Class ChildActorComponent*                                   CannonLeft1;                                       // 0x1958(0x8)
	Class ChildActorComponent*                                   LadderStbd;                                        // 0x1960(0x8)
	Class ChildActorComponent*                                   Hull;                                              // 0x1968(0x8)
	Class ChildActorComponent*                                   MastMainSailAngleRight;                            // 0x1970(0x8)
	Class ChildActorComponent*                                   MastMainSailHoistRight;                            // 0x1978(0x8)
	Class ChildActorComponent*                                   MastMainSailHoistLeft;                             // 0x1980(0x8)
	Class ChildActorComponent*                                   MastMain;                                          // 0x1988(0x8)
	Class ChildActorComponent*                                   Anchor;                                            // 0x1990(0x8)
	Class ChildActorComponent*                                   Rudder;                                            // 0x1998(0x8)
	Class ChildActorComponent*                                   Wheel;                                             // 0x19a0(0x8)
	Class ChildActorComponent*                                   AudioBoat;                                         // 0x19a8(0x8)
};


}