// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x70 (Full Size[0xad8] - InheritedSize[0xa68]
class BP_SmallShip_Mast_C: public None
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0xa68(0x8)
	Class ChildActorComponent*                                   None;                                              // 0xa70(0x8)
	Class ChildActorComponent*                                   None;                                              // 0xa78(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa80(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa88(0x8)
	Class ChildActorComponent*                                   None;                                              // 0xa90(0x8)
	Class ChildActorComponent*                                   None;                                              // 0xa98(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xaa0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xaa8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xab0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xab8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0xac0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0xac8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xad0(0x8)
};


}