// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x3c0 (Full Size[0x1ad0] - InheritedSize[0x1710]
class BP_SmallShipTemplate_C: public Ship
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x1710(0x8)
	Class HarpoonItemLocationComponent*                          None;                                              // 0x1718(0x8)
	Class HarpoonItemLocationComponent*                          None;                                              // 0x1720(0x8)
	Class FactionParticleComponent*                              None;                                              // 0x1728(0x8)
	Class FactionParticleComponent*                              None;                                              // 0x1730(0x8)
	Class SplashProbeVFXComponent*                               None;                                              // 0x1738(0x8)
	Class SplashProbeVFXComponent*                               None;                                              // 0x1740(0x8)
	Class SplashProbeVFXComponent*                               None;                                              // 0x1748(0x8)
	Class SplashProbeVFXComponent*                               None;                                              // 0x1750(0x8)
	Class SplashProbeVFXComponent*                               None;                                              // 0x1758(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x1760(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x1768(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x1770(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x1778(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x1780(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x1788(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x1790(0x8)
	Class SceneComponent*                                        None;                                              // 0x1798(0x8)
	Class ShipFactionCustomisation*                              None;                                              // 0x17a0(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x17a8(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x17b0(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x17b8(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x17c0(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x17c8(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x17d0(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x17d8(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x17e0(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x17e8(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x17f0(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x17f8(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1800(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1808(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1810(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1818(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1820(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1828(0x8)
	Class ShipStorageJettisonComponent*                          None;                                              // 0x1830(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1838(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1840(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1848(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1850(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1858(0x8)
	Class RatManagerComponent*                                   None;                                              // 0x1860(0x8)
	None *                                                       None;                                              // 0x1868(0x8)
	None *                                                       None;                                              // 0x1870(0x8)
	None *                                                       None;                                              // 0x1878(0x8)
	None *                                                       None;                                              // 0x1880(0x8)
	None *                                                       None;                                              // 0x1888(0x8)
	None *                                                       None;                                              // 0x1890(0x8)
	None *                                                       None;                                              // 0x1898(0x8)
	None *                                                       None;                                              // 0x18a0(0x8)
	None *                                                       None;                                              // 0x18a8(0x8)
	None *                                                       None;                                              // 0x18b0(0x8)
	None *                                                       None;                                              // 0x18b8(0x8)
	Class ArrowComponent*                                        None;                                              // 0x18c0(0x8)
	None *                                                       None;                                              // 0x18c8(0x8)
	Class AIRegionComponent*                                     None;                                              // 0x18d0(0x8)
	Class NamedPointsComponent*                                  None;                                              // 0x18d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x18e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x18e8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x18f0(0x8)
	Class EmissaryFlotsamItemSpawnComponent*                     None;                                              // 0x18f8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1900(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1908(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1910(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1918(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1920(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1928(0x8)
	Class PetHangoutSpotComponent*                               None;                                              // 0x1930(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1938(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1940(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1948(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1950(0x8)
	Class ShipTelemetryComponent*                                None;                                              // 0x1958(0x8)
	Class RiggingSystemComponent*                                None;                                              // 0x1960(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1968(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1970(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1978(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1980(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1988(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1990(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1998(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19a0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19a8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19b0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19b8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19c0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19c8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19d0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19d8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19e0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19e8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19f0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19f8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a00(0x8)
	Class BoxComponent*                                          None;                                              // 0x1a08(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1a10(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a18(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1a20(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1a28(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1a30(0x8)
	Class RiggingSystemComponent*                                None;                                              // 0x1a38(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a40(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a48(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a50(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a58(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a60(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a68(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a70(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a78(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a80(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a88(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a90(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a98(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1aa0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1aa8(0x8)
	byte                                                         None;                                              // 0x1ab0(0x1)
	char                                                         pad0x7_5GPM6[0x7];                                 // 0x1ab1(0x7)
	Class TimelineComponent*                                     None;                                              // 0x1ab8(0x8)
	byte                                                         None;                                              // 0x1ac0(0x1)
	char                                                         pad0x7_SM7OG[0x7];                                 // 0x1ac1(0x7)
	Class TimelineComponent*                                     None;                                              // 0x1ac8(0x8)
};


}