// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x9c0] - InheritedSize[0x980]
class BP_SirenTrident_Wieldable_C: public DoubleActionItemWithAmmo
{
public:
	Class AimSensitivityComponent*                               AimSensitivity;                                    // 0x980(0x8)
	Class AmmoEffectsComponent*                                  AmmoEffects;                                       // 0x988(0x8)
	Class StaticStashedMeshMemoryConstraintComponent*            StaticStashedMeshMemoryConstraint;                 // 0x990(0x8)
	Class AmmoTransferComponent*                                 AmmoTransfer;                                      // 0x998(0x8)
	Class ItemActionComponent*                                   AimDownSightAction;                                // 0x9a0(0x8)
	Class SirenTridentShotActionComponent*                       SirenTridentShotAction;                            // 0x9a8(0x8)
	Class LaunchableAttachPointComponent*                        LaunchableAttachPoint;                             // 0x9b0(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0x9b8(0x8)
};


}