// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x78 (Full Size[0x440] - InheritedSize[0x3c8]
class BP_sod_bld_trn_shop_ext_01_a_C: public Actor
{
public:
	class ChildActorComponent*                                   AudioSpace;                                        // 0x3c8(0x8)
	class StaticMeshComponent*                                   Rainblocker;                                       // 0x3d0(0x8)
	class StaticMeshComponent*                                   Rainblocker;                                       // 0x3d8(0x8)
	class StaticMeshComponent*                                   RainBlocker_09;                                    // 0x3e0(0x8)
	class StaticMeshComponent*                                   RainBlocker_08;                                    // 0x3e8(0x8)
	class StaticMeshComponent*                                   RainBlocker_07;                                    // 0x3f0(0x8)
	class StaticMeshComponent*                                   RainBlocker_06;                                    // 0x3f8(0x8)
	class StaticMeshComponent*                                   RainBlocker_05;                                    // 0x400(0x8)
	class StaticMeshComponent*                                   RainBlocker_04;                                    // 0x408(0x8)
	class StaticMeshComponent*                                   RainBlocker_03;                                    // 0x410(0x8)
	class StaticMeshComponent*                                   RainBlocker_02;                                    // 0x418(0x8)
	class StaticMeshComponent*                                   RainBlocker_01;                                    // 0x420(0x8)
	class StaticMeshComponent*                                   sod_bld_trn_shop_01_a;                             // 0x428(0x8)
	class StaticMeshComponent*                                   sod_bld_trn_shop_shell_01_a;                       // 0x430(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x438(0x8)
};


}