// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1d8 (Full Size[0x5a0] - InheritedSize[0x3c8]
class BP_ShroudedDeep_MerrickShip_Rocks_C: public Actor
{
public:
	class StaticMeshComponent*                                   None;                                              // 0x3c8(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x420(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x430(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x438(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x440(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x448(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x450(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x458(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x460(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x468(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x470(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x478(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x480(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x488(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x490(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x498(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x4a0(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x4a8(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x4b0(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x4b8(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x4c0(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x4c8(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x4d0(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x4d8(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x4e0(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x4e8(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x4f0(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x4f8(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x500(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x508(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x510(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x518(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x520(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x528(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x530(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x538(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x540(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x548(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x550(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x558(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x560(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x568(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x570(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x578(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x580(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x588(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x590(0x8)
	class SceneComponent*                                        None;                                              // 0x598(0x8)
};


}