// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xe40 (Full Size[0x1328] - InheritedSize[0x4e8]
class BP_Shipwreck_01_a_MA_LostShipments_C: public CustomShipwreck
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x4e8(0x8)
	Class ChildActorComponent*                                   Audio;                                             // 0x4f0(0x8)
	Class ItemSpawnComponent*                                    MerchantCrewSpawner;                               // 0x4f8(0x8)
	Class ItemSpawnComponent*                                    Rank5_GunpowderBarrels;                            // 0x500(0x8)
	Class ItemSpawnComponent*                                    Rank5_Crates;                                      // 0x508(0x8)
	Class ItemSpawnComponent*                                    Rank5_Commodities;                                 // 0x510(0x8)
	Class ItemSpawnComponent*                                    Rank5_Commodities_guaranteed;                      // 0x518(0x8)
	Class ItemSpawnComponent*                                    Rank6&7_GunpowderBarrels;                          // 0x520(0x8)
	Class ItemSpawnComponent*                                    Rank6&7_Crates;                                    // 0x528(0x8)
	Class ItemSpawnComponent*                                    Rank6&7_Commodities;                               // 0x530(0x8)
	Class ItemSpawnComponent*                                    Rank6&7_Commodities_guaranteed;                    // 0x538(0x8)
	Class ItemSpawnComponent*                                    Rank8&9_GunpowderBarrels;                          // 0x540(0x8)
	Class ItemSpawnComponent*                                    Rank8&9_Crates;                                    // 0x548(0x8)
	Class ItemSpawnComponent*                                    Rank8&9_Commodities;                               // 0x550(0x8)
	Class ItemSpawnComponent*                                    Rank8&9_Commodities_guaranteed;                    // 0x558(0x8)
	Class ItemSpawnComponent*                                    Rank10_GunpowderBarrels;                           // 0x560(0x8)
	Class ItemSpawnComponent*                                    Rank10_Crates;                                     // 0x568(0x8)
	Class ItemSpawnComponent*                                    Rank10_Commodities;                                // 0x570(0x8)
	Class ItemSpawnComponent*                                    Rank10_Commodities_guaranteed;                     // 0x578(0x8)
	Class ChildActorComponent*                                   CabinDoor;                                         // 0x580(0x8)
	Class StaticMeshComponent*                                   shp_shipwreck_galleon_merchant_01_a;               // 0x588(0x8)
	BlueprintGeneratedClass BP_MA_LostShipments_PlaceholderKeyLocation_C* BP_MA_LostShipments_PlaceholderKeyLocation;        // 0x590(0x8)
	Class MerchantCaptainSpawnComponent*                         MerchantCaptainSpawner;                            // 0x598(0x8)
	Class ItemSpawnComponent*                                    Spawner_GunpowderBarrels;                          // 0x5a0(0x8)
	Class ItemSpawnComponent*                                    Spawner_Crates;                                    // 0x5a8(0x8)
	Class ChildActorComponent*                                   Barnacles;                                         // 0x5b0(0x8)
	Class ItemSpawnComponent*                                    Spawner_MerchantCommodities;                       // 0x5b8(0x8)
	Class StaticMeshComponent*                                   shp_wreck_simple_hits_01_a;                        // 0x5c0(0x8)
	Class StaticMeshComponent*                                   shp_interior_map_deck_01_a;                        // 0x5c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh178;                                     // 0x5d0(0x8)
	Class StaticMeshComponent*                                   shp_interior_captains_cabin_01_a;                  // 0x5d8(0x8)
	Class StaticMeshComponent*                                   shp_int_map_stairs_01_a;                           // 0x5e0(0x8)
	Class StaticMeshComponent*                                   shp_deck_forecastle_steps_01_a;                    // 0x5e8(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_04_a2;                           // 0x5f0(0x8)
	Class StaticMeshComponent*                                   shp_stern_staircase_01_a;                          // 0x5f8(0x8)
	Class StaticMeshComponent*                                   shp_stern_staircase_01_a1;                         // 0x600(0x8)
	Class StaticMeshComponent*                                   shp_wheel_01_a;                                    // 0x608(0x8)
	Class StaticMeshComponent*                                   shp_interior_brig_deck_01_a;                       // 0x610(0x8)
	Class StaticMeshComponent*                                   cap_book_stand_01_a;                               // 0x618(0x8)
	Class StaticMeshComponent*                                   cap_bunk_01_a;                                     // 0x620(0x8)
	Class StaticMeshComponent*                                   cap_shark_jaws_01_a;                               // 0x628(0x8)
	Class StaticMeshComponent*                                   cap_wooden_plaque_01_a;                            // 0x630(0x8)
	Class StaticMeshComponent*                                   bld_tvn_table_01_a;                                // 0x638(0x8)
	Class StaticMeshComponent*                                   bld_int_large_shelf_02_a;                          // 0x640(0x8)
	Class StaticMeshComponent*                                   bld_tvn_rug_01_a;                                  // 0x648(0x8)
	Class StaticMeshComponent*                                   bld_int_small_shelves_03_a;                        // 0x650(0x8)
	Class StaticMeshComponent*                                   StaticMesh155;                                     // 0x658(0x8)
	Class StaticMeshComponent*                                   StaticMesh157;                                     // 0x660(0x8)
	Class StaticMeshComponent*                                   StaticMesh158;                                     // 0x668(0x8)
	Class StaticMeshComponent*                                   StaticMesh159;                                     // 0x670(0x8)
	Class StaticMeshComponent*                                   cmn_walk_plank_01_a1;                              // 0x678(0x8)
	Class StaticMeshComponent*                                   StaticMesh160;                                     // 0x680(0x8)
	Class StaticMeshComponent*                                   StaticMesh161;                                     // 0x688(0x8)
	Class StaticMeshComponent*                                   StaticMesh162;                                     // 0x690(0x8)
	Class StaticMeshComponent*                                   shp_shipwreck_sail_controls_block_fixed_01_a;      // 0x698(0x8)
	Class StaticMeshComponent*                                   shp_shipwreck_sail_controls_cleat_01_a1;           // 0x6a0(0x8)
	Class StaticMeshComponent*                                   cmn_walk_plank_01_a;                               // 0x6a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh168;                                     // 0x6b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh167;                                     // 0x6b8(0x8)
	Class StaticMeshComponent*                                   StaticMesh166;                                     // 0x6c0(0x8)
	Class StaticMeshComponent*                                   StaticMesh165;                                     // 0x6c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh164;                                     // 0x6d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh163;                                     // 0x6d8(0x8)
	Class StaticMeshComponent*                                   shp_shipwreck_sail_controls_cleat_01_a;            // 0x6e0(0x8)
	Class StaticMeshComponent*                                   cap_shipwreck_curtain_rail_01_a;                   // 0x6e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh17shp_shipwreck_hull_ladder_01_a15;      // 0x6f0(0x8)
	Class StaticMeshComponent*                                   shp_shipwreck_hull_ladder_01_a;                    // 0x6f8(0x8)
	Class StaticMeshComponent*                                   cap_cabinet_01_a;                                  // 0x700(0x8)
	Class StaticMeshComponent*                                   StaticMesh19;                                      // 0x708(0x8)
	Class StaticMeshComponent*                                   StaticMesh38;                                      // 0x710(0x8)
	Class StaticMeshComponent*                                   StaticMesh27;                                      // 0x718(0x8)
	Class StaticMeshComponent*                                   StaticMesh28;                                      // 0x720(0x8)
	Class StaticMeshComponent*                                   StaticMesh29;                                      // 0x728(0x8)
	Class StaticMeshComponent*                                   StaticMesh31;                                      // 0x730(0x8)
	Class StaticMeshComponent*                                   StaticMesh32;                                      // 0x738(0x8)
	Class StaticMeshComponent*                                   StaticMesh33;                                      // 0x740(0x8)
	Class StaticMeshComponent*                                   StaticMesh34;                                      // 0x748(0x8)
	Class StaticMeshComponent*                                   StaticMesh35;                                      // 0x750(0x8)
	Class StaticMeshComponent*                                   StaticMesh36;                                      // 0x758(0x8)
	Class StaticMeshComponent*                                   StaticMesh63;                                      // 0x760(0x8)
	Class StaticMeshComponent*                                   StaticMesh44;                                      // 0x768(0x8)
	Class StaticMeshComponent*                                   StaticMesh39;                                      // 0x770(0x8)
	Class StaticMeshComponent*                                   StaticMesh42;                                      // 0x778(0x8)
	Class StaticMeshComponent*                                   StaticMesh43;                                      // 0x780(0x8)
	Class StaticMeshComponent*                                   StaticMesh45;                                      // 0x788(0x8)
	Class StaticMeshComponent*                                   StaticMesh23;                                      // 0x790(0x8)
	Class StaticMeshComponent*                                   StaticMesh46;                                      // 0x798(0x8)
	Class StaticMeshComponent*                                   StaticMesh47;                                      // 0x7a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh61;                                      // 0x7a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh37;                                      // 0x7b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh64;                                      // 0x7b8(0x8)
	Class StaticMeshComponent*                                   StaticMesh65;                                      // 0x7c0(0x8)
	Class StaticMeshComponent*                                   StaticMesh30;                                      // 0x7c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh24;                                      // 0x7d0(0x8)
	Class StaticMeshComponent*                                   cabin_window_feature_glass_ext;                    // 0x7d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh41;                                      // 0x7e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh59;                                      // 0x7e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh58;                                      // 0x7f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh57;                                      // 0x7f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh56;                                      // 0x800(0x8)
	Class StaticMeshComponent*                                   StaticMesh55;                                      // 0x808(0x8)
	Class StaticMeshComponent*                                   StaticMesh60;                                      // 0x810(0x8)
	Class StaticMeshComponent*                                   StaticMesh22;                                      // 0x818(0x8)
	Class StaticMeshComponent*                                   StaticMesh21;                                      // 0x820(0x8)
	Class StaticMeshComponent*                                   StaticMesh20;                                      // 0x828(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x830(0x8)
	Class StaticMeshComponent*                                   StaticMesh18;                                      // 0x838(0x8)
	Class StaticMeshComponent*                                   StaticMesh17;                                      // 0x840(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x848(0x8)
	Class StaticMeshComponent*                                   StaticMesh15;                                      // 0x850(0x8)
	Class StaticMeshComponent*                                   StaticMesh14;                                      // 0x858(0x8)
	Class StaticMeshComponent*                                   StaticMesh13;                                      // 0x860(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x868(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x870(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x878(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x880(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x888(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x890(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x898(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x8a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x8a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh51;                                      // 0x8b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh49;                                      // 0x8b8(0x8)
	Class StaticMeshComponent*                                   StaticMesh52;                                      // 0x8c0(0x8)
	Class StaticMeshComponent*                                   StaticMesh50;                                      // 0x8c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh53;                                      // 0x8d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh54;                                      // 0x8d8(0x8)
	Class StaticMeshComponent*                                   cmn_capstan_01__rope_a;                            // 0x8e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x8e8(0x8)
	Class StaticMeshComponent*                                   cmn_capstan_01__release_a;                         // 0x8f0(0x8)
	Class StaticMeshComponent*                                   cmn_capstan_01__arm_a;                             // 0x8f8(0x8)
	Class StaticMeshComponent*                                   cmn_capstan_01__arm_a3;                            // 0x900(0x8)
	Class StaticMeshComponent*                                   cmn_capstan_01__arm_a2;                            // 0x908(0x8)
	Class StaticMeshComponent*                                   cmn_capstan_01__body_a;                            // 0x910(0x8)
	Class StaticMeshComponent*                                   StaticMesh25;                                      // 0x918(0x8)
	Class StaticMeshComponent*                                   StaticMesh180;                                     // 0x920(0x8)
	Class StaticMeshComponent*                                   StaticMesh179;                                     // 0x928(0x8)
	Class StaticMeshComponent*                                   StaticMesh182;                                     // 0x930(0x8)
	Class StaticMeshComponent*                                   StaticMesh181;                                     // 0x938(0x8)
	Class StaticMeshComponent*                                   shp_shipwreck_mast_ladder_01_a;                    // 0x940(0x8)
	Class StaticMeshComponent*                                   shp_mast_01_a1;                                    // 0x948(0x8)
	Class StaticMeshComponent*                                   shp_mast_01_a;                                     // 0x950(0x8)
	Class StaticMeshComponent*                                   shp_crows_nest_01_a;                               // 0x958(0x8)
	Class StaticMeshComponent*                                   shp_mast_crossbeam_top_01_a;                       // 0x960(0x8)
	Class StaticMeshComponent*                                   shp_mast_crossbeam_mid_01_a1;                      // 0x968(0x8)
	Class StaticMeshComponent*                                   StaticMesh175;                                     // 0x970(0x8)
	Class StaticMeshComponent*                                   StaticMesh176;                                     // 0x978(0x8)
	Class StaticMeshComponent*                                   shp_hull_rudder_01_a;                              // 0x980(0x8)
	Class StaticMeshComponent*                                   shp_galleon_upper_hull_01_a;                       // 0x988(0x8)
	Class StaticMeshComponent*                                   shp_shipwreck_galleon_main_deck_01_a;              // 0x990(0x8)
	Class StaticMeshComponent*                                   fig_blank_01_a;                                    // 0x998(0x8)
	Class StaticMeshComponent*                                   shp_galleon_lower_hull_01_a;                       // 0x9a0(0x8)
	Class MergedStaticMeshComponent*                             exterior_ship;                                     // 0x9a8(0x8)
	Class StaticMeshComponent*                                   shp_int_brig_stairs_01_a;                          // 0x9b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh81;                                      // 0x9b8(0x8)
	Class StaticMeshComponent*                                   vfx_debris_metal_03__nail;                         // 0x9c0(0x8)
	Class StaticMeshComponent*                                   shp_map_tab_01_a;                                  // 0x9c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh156;                                     // 0x9d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh153;                                     // 0x9d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh152;                                     // 0x9e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x9e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x9f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh154;                                     // 0x9f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh169;                                     // 0xa00(0x8)
	Class StaticMeshComponent*                                   StaticMesh170;                                     // 0xa08(0x8)
	Class StaticMeshComponent*                                   StaticMesh171;                                     // 0xa10(0x8)
	Class StaticMeshComponent*                                   StaticMesh172;                                     // 0xa18(0x8)
	Class SkeletalMeshComponent*                                 shp_cooker_01_a;                                   // 0xa20(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_shelf_01_a;                            // 0xa28(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_shelf_02_a;                            // 0xa30(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_worktop_01_a;                          // 0xa38(0x8)
	Class StaticMeshComponent*                                   StaticMesh174;                                     // 0xa40(0x8)
	Class StaticMeshComponent*                                   StaticMesh173;                                     // 0xa48(0x8)
	Class StaticMeshComponent*                                   shp_shipwreck_barrel_ropes_01_a;                   // 0xa50(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_03_a;                            // 0xa58(0x8)
	Class StaticMeshComponent*                                   StaticMesh177;                                     // 0xa60(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_01_a1;                           // 0xa68(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_04_a1;                           // 0xa70(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_04_a;                            // 0xa78(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_01_a;                            // 0xa80(0x8)
	Class StaticMeshComponent*                                   Barrel;                                            // 0xa88(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_01_a2;                           // 0xa90(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_03_a1;                           // 0xa98(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_04_a3;                           // 0xaa0(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_01_a3;                           // 0xaa8(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_04_a4;                           // 0xab0(0x8)
	Class StaticMeshComponent*                                   Barrel;                                            // 0xab8(0x8)
	Class StaticMeshComponent*                                   StaticMesh128;                                     // 0xac0(0x8)
	Class StaticMeshComponent*                                   StaticMesh127;                                     // 0xac8(0x8)
	Class StaticMeshComponent*                                   StaticMesh126;                                     // 0xad0(0x8)
	Class StaticMeshComponent*                                   StaticMesh125;                                     // 0xad8(0x8)
	Class StaticMeshComponent*                                   StaticMesh129;                                     // 0xae0(0x8)
	Class StaticMeshComponent*                                   StaticMesh123;                                     // 0xae8(0x8)
	Class StaticMeshComponent*                                   StaticMesh122;                                     // 0xaf0(0x8)
	Class StaticMeshComponent*                                   StaticMesh121;                                     // 0xaf8(0x8)
	Class StaticMeshComponent*                                   StaticMesh124;                                     // 0xb00(0x8)
	Class StaticMeshComponent*                                   StaticMesh67;                                      // 0xb08(0x8)
	Class StaticMeshComponent*                                   StaticMesh69;                                      // 0xb10(0x8)
	Class StaticMeshComponent*                                   StaticMesh68;                                      // 0xb18(0x8)
	Class StaticMeshComponent*                                   StaticMesh97;                                      // 0xb20(0x8)
	Class StaticMeshComponent*                                   StaticMesh96;                                      // 0xb28(0x8)
	Class StaticMeshComponent*                                   StaticMesh95;                                      // 0xb30(0x8)
	Class StaticMeshComponent*                                   StaticMesh94;                                      // 0xb38(0x8)
	Class StaticMeshComponent*                                   StaticMesh93;                                      // 0xb40(0x8)
	Class StaticMeshComponent*                                   StaticMesh92;                                      // 0xb48(0x8)
	Class StaticMeshComponent*                                   StaticMesh91;                                      // 0xb50(0x8)
	Class StaticMeshComponent*                                   StaticMesh90;                                      // 0xb58(0x8)
	Class StaticMeshComponent*                                   StaticMesh89;                                      // 0xb60(0x8)
	Class StaticMeshComponent*                                   StaticMesh88;                                      // 0xb68(0x8)
	Class StaticMeshComponent*                                   StaticMesh87;                                      // 0xb70(0x8)
	Class StaticMeshComponent*                                   StaticMesh86;                                      // 0xb78(0x8)
	Class StaticMeshComponent*                                   StaticMesh85;                                      // 0xb80(0x8)
	Class StaticMeshComponent*                                   StaticMesh98;                                      // 0xb88(0x8)
	Class StaticMeshComponent*                                   StaticMesh83;                                      // 0xb90(0x8)
	Class StaticMeshComponent*                                   StaticMesh82;                                      // 0xb98(0x8)
	Class StaticMeshComponent*                                   StaticMesh80;                                      // 0xba0(0x8)
	Class StaticMeshComponent*                                   StaticMesh79;                                      // 0xba8(0x8)
	Class StaticMeshComponent*                                   StaticMesh78;                                      // 0xbb0(0x8)
	Class StaticMeshComponent*                                   StaticMesh77;                                      // 0xbb8(0x8)
	Class StaticMeshComponent*                                   StaticMesh76;                                      // 0xbc0(0x8)
	Class StaticMeshComponent*                                   StaticMesh75;                                      // 0xbc8(0x8)
	Class StaticMeshComponent*                                   StaticMesh74;                                      // 0xbd0(0x8)
	Class StaticMeshComponent*                                   StaticMesh73;                                      // 0xbd8(0x8)
	Class StaticMeshComponent*                                   StaticMesh72;                                      // 0xbe0(0x8)
	Class StaticMeshComponent*                                   StaticMesh71;                                      // 0xbe8(0x8)
	Class StaticMeshComponent*                                   StaticMesh70;                                      // 0xbf0(0x8)
	Class StaticMeshComponent*                                   StaticMesh84;                                      // 0xbf8(0x8)
	Class StaticMeshComponent*                                   StaticMesh149;                                     // 0xc00(0x8)
	Class StaticMeshComponent*                                   StaticMesh148;                                     // 0xc08(0x8)
	Class StaticMeshComponent*                                   StaticMesh147;                                     // 0xc10(0x8)
	Class StaticMeshComponent*                                   StaticMesh140;                                     // 0xc18(0x8)
	Class StaticMeshComponent*                                   StaticMesh151;                                     // 0xc20(0x8)
	Class StaticMeshComponent*                                   StaticMesh144;                                     // 0xc28(0x8)
	Class StaticMeshComponent*                                   StaticMesh143;                                     // 0xc30(0x8)
	Class StaticMeshComponent*                                   StaticMesh142;                                     // 0xc38(0x8)
	Class StaticMeshComponent*                                   StaticMesh141;                                     // 0xc40(0x8)
	Class StaticMeshComponent*                                   StaticMesh146;                                     // 0xc48(0x8)
	Class StaticMeshComponent*                                   StaticMesh145;                                     // 0xc50(0x8)
	Class StaticMeshComponent*                                   StaticMesh139;                                     // 0xc58(0x8)
	Class StaticMeshComponent*                                   StaticMesh138;                                     // 0xc60(0x8)
	Class StaticMeshComponent*                                   StaticMesh137;                                     // 0xc68(0x8)
	Class StaticMeshComponent*                                   StaticMesh136;                                     // 0xc70(0x8)
	Class StaticMeshComponent*                                   StaticMesh135;                                     // 0xc78(0x8)
	Class StaticMeshComponent*                                   StaticMesh134;                                     // 0xc80(0x8)
	Class StaticMeshComponent*                                   StaticMesh133;                                     // 0xc88(0x8)
	Class StaticMeshComponent*                                   StaticMesh132;                                     // 0xc90(0x8)
	Class StaticMeshComponent*                                   StaticMesh131;                                     // 0xc98(0x8)
	Class StaticMeshComponent*                                   StaticMesh130;                                     // 0xca0(0x8)
	Class StaticMeshComponent*                                   StaticMesh150;                                     // 0xca8(0x8)
	Class StaticMeshComponent*                                   StaticMesh119;                                     // 0xcb0(0x8)
	Class StaticMeshComponent*                                   StaticMesh118;                                     // 0xcb8(0x8)
	Class StaticMeshComponent*                                   StaticMesh117;                                     // 0xcc0(0x8)
	Class StaticMeshComponent*                                   StaticMesh116;                                     // 0xcc8(0x8)
	Class StaticMeshComponent*                                   StaticMesh115;                                     // 0xcd0(0x8)
	Class StaticMeshComponent*                                   StaticMesh114;                                     // 0xcd8(0x8)
	Class StaticMeshComponent*                                   StaticMesh113;                                     // 0xce0(0x8)
	Class StaticMeshComponent*                                   StaticMesh112;                                     // 0xce8(0x8)
	Class StaticMeshComponent*                                   StaticMesh111;                                     // 0xcf0(0x8)
	Class StaticMeshComponent*                                   StaticMesh110;                                     // 0xcf8(0x8)
	Class StaticMeshComponent*                                   StaticMesh109;                                     // 0xd00(0x8)
	Class StaticMeshComponent*                                   StaticMesh108;                                     // 0xd08(0x8)
	Class StaticMeshComponent*                                   StaticMesh107;                                     // 0xd10(0x8)
	Class StaticMeshComponent*                                   StaticMesh106;                                     // 0xd18(0x8)
	Class StaticMeshComponent*                                   StaticMesh105;                                     // 0xd20(0x8)
	Class StaticMeshComponent*                                   StaticMesh104;                                     // 0xd28(0x8)
	Class StaticMeshComponent*                                   StaticMesh103;                                     // 0xd30(0x8)
	Class StaticMeshComponent*                                   StaticMesh102;                                     // 0xd38(0x8)
	Class StaticMeshComponent*                                   StaticMesh101;                                     // 0xd40(0x8)
	Class StaticMeshComponent*                                   StaticMesh100;                                     // 0xd48(0x8)
	Class StaticMeshComponent*                                   StaticMesh99;                                      // 0xd50(0x8)
	Class StaticMeshComponent*                                   StaticMesh120;                                     // 0xd58(0x8)
	Class MergedStaticMeshComponent*                             interior_pieces_ship;                              // 0xd60(0x8)
	Class StaticMeshComponent*                                   shp_shark_hits_01_a;                               // 0xd68(0x8)
	Class StaticMeshComponent*                                   shp_wreck_rain_occlusion;                          // 0xd70(0x8)
	Class DecalComponent*                                        Decal86;                                           // 0xd78(0x8)
	Class DecalComponent*                                        Decal85;                                           // 0xd80(0x8)
	Class DecalComponent*                                        Decal84;                                           // 0xd88(0x8)
	Class DecalComponent*                                        Decal83;                                           // 0xd90(0x8)
	Class DecalComponent*                                        Decal82;                                           // 0xd98(0x8)
	Class DecalComponent*                                        Decal81;                                           // 0xda0(0x8)
	Class DecalComponent*                                        Decal80;                                           // 0xda8(0x8)
	Class DecalComponent*                                        Decal79;                                           // 0xdb0(0x8)
	Class DecalComponent*                                        Decal78;                                           // 0xdb8(0x8)
	Class DecalComponent*                                        Decal77;                                           // 0xdc0(0x8)
	Class DecalComponent*                                        Decal76;                                           // 0xdc8(0x8)
	Class DecalComponent*                                        Decal75;                                           // 0xdd0(0x8)
	Class DecalComponent*                                        Decal74;                                           // 0xdd8(0x8)
	Class DecalComponent*                                        Decal73;                                           // 0xde0(0x8)
	Class DecalComponent*                                        Decal72;                                           // 0xde8(0x8)
	Class DecalComponent*                                        Decal71;                                           // 0xdf0(0x8)
	Class DecalComponent*                                        Decal70;                                           // 0xdf8(0x8)
	Class DecalComponent*                                        Decal69;                                           // 0xe00(0x8)
	Class DecalComponent*                                        Decal68;                                           // 0xe08(0x8)
	Class DecalComponent*                                        Decal67;                                           // 0xe10(0x8)
	Class DecalComponent*                                        Decal66;                                           // 0xe18(0x8)
	Class DecalComponent*                                        Decal65;                                           // 0xe20(0x8)
	Class DecalComponent*                                        Decal64;                                           // 0xe28(0x8)
	Class DecalComponent*                                        Decal63;                                           // 0xe30(0x8)
	Class DecalComponent*                                        Decal62;                                           // 0xe38(0x8)
	Class DecalComponent*                                        Decal61;                                           // 0xe40(0x8)
	Class DecalComponent*                                        Decal60;                                           // 0xe48(0x8)
	Class DecalComponent*                                        Decal59;                                           // 0xe50(0x8)
	Class DecalComponent*                                        Decal58;                                           // 0xe58(0x8)
	Class DecalComponent*                                        Decal57;                                           // 0xe60(0x8)
	Class DecalComponent*                                        Decal56;                                           // 0xe68(0x8)
	Class DecalComponent*                                        Decal55;                                           // 0xe70(0x8)
	Class DecalComponent*                                        Decal54;                                           // 0xe78(0x8)
	Class DecalComponent*                                        Decal53;                                           // 0xe80(0x8)
	Class DecalComponent*                                        Decal52;                                           // 0xe88(0x8)
	Class DecalComponent*                                        Decal51;                                           // 0xe90(0x8)
	Class DecalComponent*                                        Decal50;                                           // 0xe98(0x8)
	Class DecalComponent*                                        Decal49;                                           // 0xea0(0x8)
	Class DecalComponent*                                        Decal48;                                           // 0xea8(0x8)
	Class DecalComponent*                                        Decal47;                                           // 0xeb0(0x8)
	Class DecalComponent*                                        Decal46;                                           // 0xeb8(0x8)
	Class DecalComponent*                                        Decal45;                                           // 0xec0(0x8)
	Class DecalComponent*                                        Decal44;                                           // 0xec8(0x8)
	Class DecalComponent*                                        Decal43;                                           // 0xed0(0x8)
	Class DecalComponent*                                        Decal42;                                           // 0xed8(0x8)
	Class DecalComponent*                                        Decal41;                                           // 0xee0(0x8)
	Class DecalComponent*                                        Decal40;                                           // 0xee8(0x8)
	Class DecalComponent*                                        Decal39;                                           // 0xef0(0x8)
	Class DecalComponent*                                        Decal38;                                           // 0xef8(0x8)
	Class DecalComponent*                                        Decal37;                                           // 0xf00(0x8)
	Class DecalComponent*                                        Decal36;                                           // 0xf08(0x8)
	Class DecalComponent*                                        Decal35;                                           // 0xf10(0x8)
	Class DecalComponent*                                        Decal34;                                           // 0xf18(0x8)
	Class DecalComponent*                                        Decal33;                                           // 0xf20(0x8)
	Class DecalComponent*                                        Decal32;                                           // 0xf28(0x8)
	Class DecalComponent*                                        Decal31;                                           // 0xf30(0x8)
	Class DecalComponent*                                        Decal30;                                           // 0xf38(0x8)
	Class DecalComponent*                                        Decal29;                                           // 0xf40(0x8)
	Class DecalComponent*                                        Decal28;                                           // 0xf48(0x8)
	Class DecalComponent*                                        Decal27;                                           // 0xf50(0x8)
	Class DecalComponent*                                        Decal26;                                           // 0xf58(0x8)
	Class DecalComponent*                                        Decal25;                                           // 0xf60(0x8)
	Class DecalComponent*                                        Decal24;                                           // 0xf68(0x8)
	Class DecalComponent*                                        Decal23;                                           // 0xf70(0x8)
	Class DecalComponent*                                        Decal22;                                           // 0xf78(0x8)
	Class DecalComponent*                                        Decal21;                                           // 0xf80(0x8)
	Class DecalComponent*                                        Decal20;                                           // 0xf88(0x8)
	Class DecalComponent*                                        Decal19;                                           // 0xf90(0x8)
	Class DecalComponent*                                        Decal18;                                           // 0xf98(0x8)
	Class DecalComponent*                                        Decal17;                                           // 0xfa0(0x8)
	Class DecalComponent*                                        Decal16;                                           // 0xfa8(0x8)
	Class DecalComponent*                                        Decal15;                                           // 0xfb0(0x8)
	Class DecalComponent*                                        Decal14;                                           // 0xfb8(0x8)
	Class DecalComponent*                                        Decal13;                                           // 0xfc0(0x8)
	Class DecalComponent*                                        Decal12;                                           // 0xfc8(0x8)
	Class DecalComponent*                                        Decal11;                                           // 0xfd0(0x8)
	Class DecalComponent*                                        Decal10;                                           // 0xfd8(0x8)
	Class DecalComponent*                                        Decal9;                                            // 0xfe0(0x8)
	Class DecalComponent*                                        Decal8;                                            // 0xfe8(0x8)
	Class DecalComponent*                                        Decal7;                                            // 0xff0(0x8)
	Class DecalComponent*                                        Decal6;                                            // 0xff8(0x8)
	Class DecalComponent*                                        Decal5;                                            // 0x1000(0x8)
	Class DecalComponent*                                        Decal4;                                            // 0x1008(0x8)
	Class DecalComponent*                                        Decal3;                                            // 0x1010(0x8)
	Class DecalComponent*                                        Decal2;                                            // 0x1018(0x8)
	Class DecalComponent*                                        Decal1;                                            // 0x1020(0x8)
	Class DecalComponent*                                        Decal;                                             // 0x1028(0x8)
	Class ParticleSystemComponent*                               ParticleSystem30;                                  // 0x1030(0x8)
	Class ParticleSystemComponent*                               ParticleSystem28;                                  // 0x1038(0x8)
	Class ParticleSystemComponent*                               ParticleSystem27;                                  // 0x1040(0x8)
	Class ParticleSystemComponent*                               ParticleSystem26;                                  // 0x1048(0x8)
	Class ParticleSystemComponent*                               ParticleSystem25;                                  // 0x1050(0x8)
	Class ParticleSystemComponent*                               ParticleSystem24;                                  // 0x1058(0x8)
	Class ParticleSystemComponent*                               ParticleSystem23;                                  // 0x1060(0x8)
	Class ParticleSystemComponent*                               ParticleSystem21;                                  // 0x1068(0x8)
	Class ParticleSystemComponent*                               ParticleSystem20;                                  // 0x1070(0x8)
	Class ParticleSystemComponent*                               ParticleSystem18;                                  // 0x1078(0x8)
	Class ParticleSystemComponent*                               ParticleSystem17;                                  // 0x1080(0x8)
	Class ParticleSystemComponent*                               ParticleSystem16;                                  // 0x1088(0x8)
	Class ParticleSystemComponent*                               ParticleSystem15;                                  // 0x1090(0x8)
	Class ParticleSystemComponent*                               ParticleSystem14;                                  // 0x1098(0x8)
	Class ParticleSystemComponent*                               ParticleSystem13;                                  // 0x10a0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem11;                                  // 0x10a8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem10;                                  // 0x10b0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem9;                                   // 0x10b8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem7;                                   // 0x10c0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x10c8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x10d0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x10d8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x10e0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x10e8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x10f0(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x10f8(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x1100(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x1108(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x1110(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x1118(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x1120(0x8)
	Class ChildActorComponent*                                   barrel_09;                                         // 0x1128(0x8)
	Class ChildActorComponent*                                   barrel_06;                                         // 0x1130(0x8)
	Class ChildActorComponent*                                   barrel_05;                                         // 0x1138(0x8)
	Class ChildActorComponent*                                   barrel_04;                                         // 0x1140(0x8)
	Class ChildActorComponent*                                   barrel_03;                                         // 0x1148(0x8)
	Class ChildActorComponent*                                   barrel_02;                                         // 0x1150(0x8)
	Class ChildActorComponent*                                   barrel_01;                                         // 0x1158(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x1160(0x8)
	Class ChildActorComponent*                                   ChildActor15;                                      // 0x1168(0x8)
	Class DecalComponent*                                        Decal87;                                           // 0x1170(0x8)
	Class ChildActorComponent*                                   ChildActor40;                                      // 0x1178(0x8)
	Class ChildActorComponent*                                   ChildActor27;                                      // 0x1180(0x8)
	Class ChildActorComponent*                                   ChildActor26;                                      // 0x1188(0x8)
	Class ChildActorComponent*                                   ChildActor25;                                      // 0x1190(0x8)
	Class ChildActorComponent*                                   ChildActor20;                                      // 0x1198(0x8)
	Class ChildActorComponent*                                   ChildActor56;                                      // 0x11a0(0x8)
	Class ChildActorComponent*                                   ChildActor42;                                      // 0x11a8(0x8)
	Class ChildActorComponent*                                   ChildActor55;                                      // 0x11b0(0x8)
	Class ChildActorComponent*                                   ChildActor54;                                      // 0x11b8(0x8)
	Class ChildActorComponent*                                   ChildActor39;                                      // 0x11c0(0x8)
	Class ChildActorComponent*                                   ChildActor53;                                      // 0x11c8(0x8)
	Class ChildActorComponent*                                   ChildActor52;                                      // 0x11d0(0x8)
	Class ChildActorComponent*                                   ChildActor51;                                      // 0x11d8(0x8)
	Class ChildActorComponent*                                   ChildActor50;                                      // 0x11e0(0x8)
	Class ChildActorComponent*                                   ChildActor49;                                      // 0x11e8(0x8)
	Class ChildActorComponent*                                   ChildActor45;                                      // 0x11f0(0x8)
	Class ChildActorComponent*                                   ChildActor48;                                      // 0x11f8(0x8)
	Class ChildActorComponent*                                   ChildActor47;                                      // 0x1200(0x8)
	Class ChildActorComponent*                                   ChildActor46;                                      // 0x1208(0x8)
	Class ChildActorComponent*                                   ChildActor44;                                      // 0x1210(0x8)
	Class ChildActorComponent*                                   ChildActor43;                                      // 0x1218(0x8)
	Class ChildActorComponent*                                   bp_light_volume_underwater_a1;                     // 0x1220(0x8)
	Class ChildActorComponent*                                   ChildActor41;                                      // 0x1228(0x8)
	Class ChildActorComponent*                                   bp_light_volume_sphere_orange_a;                   // 0x1230(0x8)
	Class ChildActorComponent*                                   ChildActor38;                                      // 0x1238(0x8)
	Class ChildActorComponent*                                   ChildActor37;                                      // 0x1240(0x8)
	Class ChildActorComponent*                                   ChildActor36;                                      // 0x1248(0x8)
	Class ChildActorComponent*                                   ChildActor34;                                      // 0x1250(0x8)
	Class ChildActorComponent*                                   ChildActor29;                                      // 0x1258(0x8)
	Class ChildActorComponent*                                   ChildActor24;                                      // 0x1260(0x8)
	Class ChildActorComponent*                                   ChildActor23;                                      // 0x1268(0x8)
	Class ChildActorComponent*                                   ChildActor22;                                      // 0x1270(0x8)
	Class ChildActorComponent*                                   ChildActor19;                                      // 0x1278(0x8)
	Class ChildActorComponent*                                   ChildActor17;                                      // 0x1280(0x8)
	Class ChildActorComponent*                                   ChildActor14;                                      // 0x1288(0x8)
	Class ChildActorComponent*                                   ChildActor13;                                      // 0x1290(0x8)
	Class ChildActorComponent*                                   bp_light_volume_underwater_a;                      // 0x1298(0x8)
	BlueprintGeneratedClass BP_ShipwreckBananaSpawner_C*         BP_ShipwreckBananaSpawnerBottomDeck;               // 0x12a0(0x8)
	BlueprintGeneratedClass BP_ShipwreckBananaSpawner_C*         BP_ShipwreckBananaSpawnerTopDeck;                  // 0x12a8(0x8)
	BlueprintGeneratedClass BP_ShipwreckWoodSpawner_C*           BP_ShipwreckWoodSpawnerBottomDeck;                 // 0x12b0(0x8)
	BlueprintGeneratedClass BP_ShipwreckWoodSpawner_C*           BP_ShipwreckWoodSpawnerMiddleDeck;                 // 0x12b8(0x8)
	Class ChildActorComponent*                                   BP_ShipwreckStorageBarrel_Grog;                    // 0x12c0(0x8)
	Class ChildActorComponent*                                   barrel_07;                                         // 0x12c8(0x8)
	Class ChildActorComponent*                                   barrel_08;                                         // 0x12d0(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x12d8(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x12e0(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x12e8(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x12f0(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x12f8(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x1300(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x1308(0x8)
	Class ChildActorComponent*                                   Barrel;                                            // 0x1310(0x8)
	float                                                        SeagulHeight;                                      // 0x1318(0x4)
	char                                                         pad0x4_HRLC1[0x4];                                 // 0x131c(0x4)
	BlueprintGeneratedClass BP_Seagull01_8POI_C*                 Seagulls;                                          // 0x1320(0x8)
};


}