// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class BP_ShipwreckHull_Audio_A_C: public ShipwreckHullAudio
{
public:
	Class ShipwreckAudioEmitterComponent*                        None;                                              // 0x3e0(0x8)
	Class ShipwreckAudioEmitterComponent*                        None;                                              // 0x3e8(0x8)
	Class ShipwreckAudioEmitterComponent*                        None;                                              // 0x3f0(0x8)
	Class ShipwreckAudioEmitterComponent*                        None;                                              // 0x3f8(0x8)
	Class ShipwreckAudioEmitterComponent*                        None;                                              // 0x400(0x8)
	Class ShipwreckAudioEmitterComponent*                        None;                                              // 0x408(0x8)
	Class ShipwreckAudioEmitterComponent*                        None;                                              // 0x410(0x8)
	Class ShipwreckAudioEmitterComponent*                        None;                                              // 0x418(0x8)
};


}