// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x408] - InheritedSize[0x3c8]
class BP_SmallShipLanterns_C: public Actor
{
public:
	class ChildActorComponent*                                   Railing_Wheel;                                     // 0x3c8(0x8)
	class ChildActorComponent*                                   BottomDeckFront;                                   // 0x3d0(0x8)
	class ChildActorComponent*                                   BottomDeckBrig;                                    // 0x3d8(0x8)
	class ChildActorComponent*                                   CabinMapTable;                                     // 0x3e0(0x8)
	class ChildActorComponent*                                   Railing_BowRightFront;                             // 0x3e8(0x8)
	class ChildActorComponent*                                   Railing_BowLeftFront;                              // 0x3f0(0x8)
	class ChildActorComponent*                                   CabinQuestTable;                                   // 0x3f8(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x400(0x8)
};


}