#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xa60 (Full Size[0xe00] - InheritedSize[0x3a0]
class BP_sod_bld_tvn_ngs_shell_01_a_frontend_C: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMesh30;                                      // 0x3a0(0x8)
	class StaticMeshComponent*                                   sod_bld_door_06_a;                                 // 0x3a8(0x8)
	class StaticMeshComponent*                                   sod_bld_wall_06_b;                                 // 0x3b0(0x8)
	class StaticMeshComponent*                                   StaticMesh23;                                      // 0x3b8(0x8)
	class StaticMeshComponent*                                   StaticMesh22;                                      // 0x3c0(0x8)
	class StaticMeshComponent*                                   sod_bld_ngstavern_upper_ceiling_01_a;              // 0x3c8(0x8)
	class StaticMeshComponent*                                   StaticMesh10;                                      // 0x3d0(0x8)
	class StaticMeshComponent*                                   StaticMesh9;                                       // 0x3d8(0x8)
	class StaticMeshComponent*                                   Shadowcaster2;                                     // 0x3e0(0x8)
	class StaticMeshComponent*                                   ShadowCaster;                                      // 0x3e8(0x8)
	class StaticMeshComponent*                                   StaticMesh8;                                       // 0x3f0(0x8)
	class StaticMeshComponent*                                   StaticMesh7;                                       // 0x3f8(0x8)
	class StaticMeshComponent*                                   StaticMesh6;                                       // 0x400(0x8)
	class StaticMeshComponent*                                   sod_bld_floor_trim_03_a;                           // 0x408(0x8)
	class StaticMeshComponent*                                   sod_bld_floor_trim_04_a1;                          // 0x410(0x8)
	class StaticMeshComponent*                                   sod_bld_floor_trim_04_a;                           // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMesh5;                                       // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMesh4;                                       // 0x428(0x8)
	class StaticMeshComponent*                                   sod_bld_floor_trim_02_a;                           // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMesh3;                                       // 0x438(0x8)
	class StaticMeshComponent*                                   sod_bld_floor_trim_01_a;                           // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0809;                           // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0808;                           // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0807;                           // 0x458(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0806;                           // 0x460(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0805;                           // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0804;                           // 0x470(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0803;                           // 0x478(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0802;                           // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0799;                           // 0x488(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0794;                           // 0x490(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0793;                           // 0x498(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0792;                           // 0x4a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0791;                           // 0x4a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0790;                           // 0x4b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0764;                           // 0x4b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0763;                           // 0x4c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0762;                           // 0x4c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0761;                           // 0x4d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0760;                           // 0x4d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0759;                           // 0x4e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0758;                           // 0x4e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0757;                           // 0x4f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0756;                           // 0x4f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0755;                           // 0x500(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0754;                           // 0x508(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0753;                           // 0x510(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0752;                           // 0x518(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0748;                           // 0x520(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0747;                           // 0x528(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0736;                           // 0x530(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0732;                           // 0x538(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0731;                           // 0x540(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0730;                           // 0x548(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0726;                           // 0x550(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0725;                           // 0x558(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0724;                           // 0x560(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0716;                           // 0x568(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0715;                           // 0x570(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0712;                           // 0x578(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0711;                           // 0x580(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0710;                           // 0x588(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0709;                           // 0x590(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0708;                           // 0x598(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0700;                           // 0x5a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0699;                           // 0x5a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0698;                           // 0x5b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0697;                           // 0x5b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0688;                           // 0x5c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0684;                           // 0x5c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0674;                           // 0x5d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0652;                           // 0x5d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0651;                           // 0x5e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0649;                           // 0x5e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0648;                           // 0x5f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0647;                           // 0x5f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0646;                           // 0x600(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0644;                           // 0x608(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0637;                           // 0x610(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0634;                           // 0x618(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0633;                           // 0x620(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0632;                           // 0x628(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0631;                           // 0x630(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0630;                           // 0x638(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0629;                           // 0x640(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0628;                           // 0x648(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0627;                           // 0x650(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0626;                           // 0x658(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0625;                           // 0x660(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0624;                           // 0x668(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0623;                           // 0x670(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0621;                           // 0x678(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0620;                           // 0x680(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0619;                           // 0x688(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0618;                           // 0x690(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0617;                           // 0x698(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0616;                           // 0x6a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0615;                           // 0x6a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0614;                           // 0x6b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0613;                           // 0x6b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0612;                           // 0x6c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0611;                           // 0x6c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0610;                           // 0x6d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0608;                           // 0x6d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0607;                           // 0x6e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0606;                           // 0x6e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0554;                           // 0x6f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0553;                           // 0x6f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0551;                           // 0x700(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0550;                           // 0x708(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0549;                           // 0x710(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0545;                           // 0x718(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0523;                           // 0x720(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0522;                           // 0x728(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0520;                           // 0x730(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0519;                           // 0x738(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0518;                           // 0x740(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0517;                           // 0x748(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0516;                           // 0x750(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0515;                           // 0x758(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0514;                           // 0x760(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0513;                           // 0x768(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0512;                           // 0x770(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0511;                           // 0x778(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0506;                           // 0x780(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0505;                           // 0x788(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0504;                           // 0x790(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0503;                           // 0x798(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0495;                           // 0x7a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0494;                           // 0x7a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0493;                           // 0x7b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0492;                           // 0x7b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0491;                           // 0x7c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0490;                           // 0x7c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0489;                           // 0x7d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0487;                           // 0x7d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0486;                           // 0x7e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0485;                           // 0x7e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0472;                           // 0x7f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0470;                           // 0x7f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0469;                           // 0x800(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0459;                           // 0x808(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0454;                           // 0x810(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0452;                           // 0x818(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0449;                           // 0x820(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0444;                           // 0x828(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0438;                           // 0x830(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0427;                           // 0x838(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0425;                           // 0x840(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0421;                           // 0x848(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0419;                           // 0x850(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0416;                           // 0x858(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0415;                           // 0x860(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0414;                           // 0x868(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0413;                           // 0x870(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0412;                           // 0x878(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0411;                           // 0x880(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0407;                           // 0x888(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0408;                           // 0x890(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0406;                           // 0x898(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0405;                           // 0x8a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0376;                           // 0x8a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0375;                           // 0x8b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0372;                           // 0x8b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0369;                           // 0x8c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0367;                           // 0x8c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0366;                           // 0x8d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0365;                           // 0x8d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0364;                           // 0x8e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0363;                           // 0x8e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0362;                           // 0x8f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0361;                           // 0x8f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0360;                           // 0x900(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0359;                           // 0x908(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0358;                           // 0x910(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0357;                           // 0x918(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0356;                           // 0x920(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0355;                           // 0x928(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0353;                           // 0x930(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0351;                           // 0x938(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0350;                           // 0x940(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0349;                           // 0x948(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0348;                           // 0x950(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0347;                           // 0x958(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0346;                           // 0x960(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0345;                           // 0x968(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0344;                           // 0x970(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0343;                           // 0x978(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0342;                           // 0x980(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0341;                           // 0x988(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0340;                           // 0x990(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0337;                           // 0x998(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0336;                           // 0x9a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0335;                           // 0x9a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0331;                           // 0x9b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0329;                           // 0x9b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0328;                           // 0x9c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0327;                           // 0x9c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0326;                           // 0x9d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0325;                           // 0x9d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0324;                           // 0x9e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0323;                           // 0x9e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0322;                           // 0x9f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0321;                           // 0x9f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0320;                           // 0xa00(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0319;                           // 0xa08(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0318;                           // 0xa10(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0317;                           // 0xa18(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0316;                           // 0xa20(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0315;                           // 0xa28(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0314;                           // 0xa30(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0313;                           // 0xa38(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0312;                           // 0xa40(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0311;                           // 0xa48(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0309;                           // 0xa50(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0308;                           // 0xa58(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0307;                           // 0xa60(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0306;                           // 0xa68(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0305;                           // 0xa70(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0304;                           // 0xa78(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0303;                           // 0xa80(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0302;                           // 0xa88(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0301;                           // 0xa90(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0300;                           // 0xa98(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0299;                           // 0xaa0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0298;                           // 0xaa8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0297;                           // 0xab0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0296;                           // 0xab8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0295;                           // 0xac0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0294;                           // 0xac8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0293;                           // 0xad0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0292;                           // 0xad8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0291;                           // 0xae0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0290;                           // 0xae8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0289;                           // 0xaf0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0268;                           // 0xaf8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0267;                           // 0xb00(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0266;                           // 0xb08(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0265;                           // 0xb10(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0264;                           // 0xb18(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0263;                           // 0xb20(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0262;                           // 0xb28(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0261;                           // 0xb30(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0259;                           // 0xb38(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0258;                           // 0xb40(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0257;                           // 0xb48(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0256;                           // 0xb50(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0255;                           // 0xb58(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0254;                           // 0xb60(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0253;                           // 0xb68(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0252;                           // 0xb70(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0251;                           // 0xb78(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0250;                           // 0xb80(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0249;                           // 0xb88(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0248;                           // 0xb90(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0247;                           // 0xb98(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0246;                           // 0xba0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0245;                           // 0xba8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0244;                           // 0xbb0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0243;                           // 0xbb8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0242;                           // 0xbc0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0241;                           // 0xbc8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0240;                           // 0xbd0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0239;                           // 0xbd8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0238;                           // 0xbe0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0237;                           // 0xbe8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0236;                           // 0xbf0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0235;                           // 0xbf8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0234;                           // 0xc00(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0233;                           // 0xc08(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0232;                           // 0xc10(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0205;                           // 0xc18(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0204;                           // 0xc20(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0203;                           // 0xc28(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0190;                           // 0xc30(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0189;                           // 0xc38(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent099;                            // 0xc40(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent098;                            // 0xc48(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent097;                            // 0xc50(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent059;                            // 0xc58(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent058;                            // 0xc60(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent057;                            // 0xc68(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent054;                            // 0xc70(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent053;                            // 0xc78(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent052;                            // 0xc80(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent051;                            // 0xc88(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent050;                            // 0xc90(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent049;                            // 0xc98(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent048;                            // 0xca0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent047;                            // 0xca8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent046;                            // 0xcb0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent045;                            // 0xcb8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent044;                            // 0xcc0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent043;                            // 0xcc8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent042;                            // 0xcd0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent041;                            // 0xcd8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent040;                            // 0xce0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent039;                            // 0xce8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent038;                            // 0xcf0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent037;                            // 0xcf8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent036;                            // 0xd00(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent035;                            // 0xd08(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent034;                            // 0xd10(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent033;                            // 0xd18(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent032;                            // 0xd20(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent031;                            // 0xd28(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent030;                            // 0xd30(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent029;                            // 0xd38(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent028;                            // 0xd40(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent027;                            // 0xd48(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent026;                            // 0xd50(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent025;                            // 0xd58(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent024;                            // 0xd60(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent023;                            // 0xd68(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0xd70(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent021;                            // 0xd78(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent020;                            // 0xd80(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0xd88(0x8)
	class DecalComponent*                                        NewDecalComponent;                                 // 0xd90(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0xd98(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0xda0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0xda8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0xdb0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0xdb8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0xdc0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0xdc8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0xdd0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0xdd8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0xde0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0xde8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0xdf0(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0xdf8(0x8)
};


