// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x368 (Full Size[0x730] - InheritedSize[0x3c8]
class BP_sod_bld_gld_enc_shop_int_dressing_01_a_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x3c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x3d0(0x8)
	Class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3d8(0x8)
	Class BoxComponent*                                          Box9;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   Cylinder;                                          // 0x3e8(0x8)
	Class BoxComponent*                                          Box8;                                              // 0x3f0(0x8)
	Class BoxComponent*                                          Box7;                                              // 0x3f8(0x8)
	Class BoxComponent*                                          Box6;                                              // 0x400(0x8)
	Class BoxComponent*                                          Box5;                                              // 0x408(0x8)
	Class BoxComponent*                                          Box4;                                              // 0x410(0x8)
	Class BoxComponent*                                          Box3;                                              // 0x418(0x8)
	Class BoxComponent*                                          Box2;                                              // 0x420(0x8)
	Class BoxComponent*                                          Box1;                                              // 0x428(0x8)
	Class BoxComponent*                                          Box;                                               // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent094;                            // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent093;                            // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent092;                            // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent091;                            // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent090;                            // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent089;                            // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent088;                            // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent087;                            // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent086;                            // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent085;                            // 0x480(0x8)
	Class DecalComponent*                                        NewDecalComponent;                                 // 0x488(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent084;                            // 0x490(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent083;                            // 0x498(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent082;                            // 0x4a0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent081;                            // 0x4a8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent080;                            // 0x4b0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent079;                            // 0x4b8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent078;                            // 0x4c0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent077;                            // 0x4c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent076;                            // 0x4d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent075;                            // 0x4d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent074;                            // 0x4e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent073;                            // 0x4e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent072;                            // 0x4f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent071;                            // 0x4f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent070;                            // 0x500(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent069;                            // 0x508(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent068;                            // 0x510(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent067;                            // 0x518(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent066;                            // 0x520(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent065;                            // 0x528(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent064;                            // 0x530(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent063;                            // 0x538(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent062;                            // 0x540(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent061;                            // 0x548(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent060;                            // 0x550(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent059;                            // 0x558(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent058;                            // 0x560(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent057;                            // 0x568(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent056;                            // 0x570(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent055;                            // 0x578(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent054;                            // 0x580(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent053;                            // 0x588(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent052;                            // 0x590(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent051;                            // 0x598(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent050;                            // 0x5a0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent049;                            // 0x5a8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent048;                            // 0x5b0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent047;                            // 0x5b8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent046;                            // 0x5c0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent045;                            // 0x5c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent044;                            // 0x5d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent043;                            // 0x5d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent042;                            // 0x5e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent041;                            // 0x5e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent040;                            // 0x5f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent039;                            // 0x5f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent038;                            // 0x600(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent037;                            // 0x608(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent036;                            // 0x610(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent035;                            // 0x618(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent034;                            // 0x620(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent033;                            // 0x628(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent032;                            // 0x630(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent031;                            // 0x638(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent030;                            // 0x640(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent028;                            // 0x648(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent027;                            // 0x650(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent026;                            // 0x658(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent025;                            // 0x660(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent024;                            // 0x668(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent023;                            // 0x670(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0x678(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent021;                            // 0x680(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent020;                            // 0x688(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0x690(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x698(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x6a0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x6a8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x6b0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x6b8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x6c0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x6c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x6d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x6d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x6e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x6e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x6f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x6f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x700(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x708(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x710(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x718(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x720(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x728(0x8)
};


}