// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x618 (Full Size[0x9e0] - InheritedSize[0x3c8]
class BP_sod_bld_gld_enc_shop_int_dressing_02_a_C: public Actor
{
public:
	class SkeletalMeshComponent*                                 trs_tre_che_02_b;                                  // 0x3c8(0x8)
	class StaticMeshComponent*                                   StaticMesh2;                                       // 0x3d0(0x8)
	class StaticMeshComponent*                                   StaticMesh1;                                       // 0x3d8(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x3e0(0x8)
	class BoxComponent*                                          Box1;                                              // 0x3e8(0x8)
	class BoxComponent*                                          Box;                                               // 0x3f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0196;                           // 0x3f8(0x8)
	class ParticleSystemComponent*                               ParticleSystemComponent0;                          // 0x400(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0194;                           // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0193;                           // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0192;                           // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0191;                           // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0190;                           // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0189;                           // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0188;                           // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0187;                           // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0186;                           // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0185;                           // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0184;                           // 0x458(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0183;                           // 0x460(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0182;                           // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0181;                           // 0x470(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0180;                           // 0x478(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0178;                           // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0177;                           // 0x488(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0176;                           // 0x490(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0175;                           // 0x498(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0174;                           // 0x4a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0173;                           // 0x4a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0172;                           // 0x4b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0171;                           // 0x4b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0170;                           // 0x4c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0169;                           // 0x4c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0168;                           // 0x4d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0167;                           // 0x4d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0166;                           // 0x4e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0165;                           // 0x4e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0164;                           // 0x4f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0163;                           // 0x4f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0162;                           // 0x500(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0161;                           // 0x508(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0160;                           // 0x510(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0159;                           // 0x518(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0158;                           // 0x520(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0157;                           // 0x528(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0156;                           // 0x530(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0155;                           // 0x538(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0154;                           // 0x540(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0153;                           // 0x548(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0152;                           // 0x550(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0151;                           // 0x558(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0150;                           // 0x560(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0149;                           // 0x568(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0148;                           // 0x570(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0147;                           // 0x578(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0146;                           // 0x580(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0145;                           // 0x588(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0144;                           // 0x590(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0143;                           // 0x598(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0142;                           // 0x5a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0141;                           // 0x5a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0140;                           // 0x5b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0139;                           // 0x5b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0138;                           // 0x5c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0137;                           // 0x5c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0136;                           // 0x5d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0133;                           // 0x5d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0132;                           // 0x5e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0131;                           // 0x5e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0129;                           // 0x5f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0128;                           // 0x5f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0126;                           // 0x600(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0125;                           // 0x608(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0124;                           // 0x610(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0123;                           // 0x618(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0122;                           // 0x620(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0121;                           // 0x628(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0120;                           // 0x630(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0119;                           // 0x638(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0118;                           // 0x640(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0117;                           // 0x648(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0116;                           // 0x650(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0115;                           // 0x658(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0114;                           // 0x660(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0113;                           // 0x668(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0112;                           // 0x670(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0111;                           // 0x678(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0110;                           // 0x680(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0109;                           // 0x688(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0108;                           // 0x690(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0107;                           // 0x698(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0106;                           // 0x6a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0105;                           // 0x6a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0104;                           // 0x6b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0103;                           // 0x6b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0102;                           // 0x6c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent098;                            // 0x6c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent097;                            // 0x6d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent096;                            // 0x6d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent095;                            // 0x6e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent094;                            // 0x6e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent093;                            // 0x6f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent092;                            // 0x6f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent091;                            // 0x700(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent090;                            // 0x708(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent089;                            // 0x710(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent088;                            // 0x718(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent087;                            // 0x720(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent086;                            // 0x728(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent085;                            // 0x730(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent084;                            // 0x738(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent083;                            // 0x740(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent082;                            // 0x748(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent081;                            // 0x750(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent080;                            // 0x758(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent079;                            // 0x760(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent078;                            // 0x768(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent077;                            // 0x770(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent076;                            // 0x778(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent075;                            // 0x780(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent074;                            // 0x788(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent073;                            // 0x790(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent072;                            // 0x798(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent071;                            // 0x7a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent070;                            // 0x7a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent069;                            // 0x7b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent068;                            // 0x7b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent067;                            // 0x7c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent066;                            // 0x7c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent065;                            // 0x7d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent064;                            // 0x7d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent063;                            // 0x7e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent062;                            // 0x7e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent061;                            // 0x7f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent060;                            // 0x7f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent058;                            // 0x800(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent057;                            // 0x808(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent056;                            // 0x810(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent055;                            // 0x818(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent054;                            // 0x820(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent053;                            // 0x828(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent052;                            // 0x830(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent051;                            // 0x838(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent050;                            // 0x840(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent049;                            // 0x848(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent048;                            // 0x850(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent047;                            // 0x858(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent046;                            // 0x860(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent045;                            // 0x868(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent044;                            // 0x870(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent043;                            // 0x878(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent042;                            // 0x880(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent041;                            // 0x888(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent040;                            // 0x890(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent039;                            // 0x898(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent038;                            // 0x8a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent037;                            // 0x8a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent036;                            // 0x8b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent035;                            // 0x8b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent034;                            // 0x8c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent033;                            // 0x8c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent032;                            // 0x8d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent031;                            // 0x8d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent030;                            // 0x8e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent029;                            // 0x8e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent028;                            // 0x8f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent027;                            // 0x8f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent026;                            // 0x900(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent025;                            // 0x908(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent024;                            // 0x910(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent023;                            // 0x918(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0x920(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent021;                            // 0x928(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent020;                            // 0x930(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0x938(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0x940(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x948(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x950(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x958(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x960(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x968(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x970(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x978(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x980(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x988(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x990(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x998(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x9a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x9a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x9b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x9b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x9c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x9c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x9d0(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x9d8(0x8)
};


}