// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xd8 (Full Size[0x4a0] - InheritedSize[0x3c8]
class BP_SmallShip_StandardHull_Art_C: public Actor
{
public:
	class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3c8(0x8)
	class ChildActorComponent*                                   CaptainsBookshelf_Trinkets;                        // 0x3d0(0x8)
	class ChildActorComponent*                                   CaptainsBookshelf;                                 // 0x3d8(0x8)
	class PostProcessComponent*                                  BattleBoundsPostProcess;                           // 0x3e0(0x8)
	class BoxComponent*                                          BattleBounds_PP_Volume;                            // 0x3e8(0x8)
	class StaticMeshComponent*                                   cap_inkwell_01_a;                                  // 0x3f0(0x8)
	class ChildActorComponent*                                   CaptainsBookcase;                                  // 0x3f8(0x8)
	class StaticMeshComponent*                                   shp_item_shelf_01_a1;                              // 0x400(0x8)
	class PostProcessComponent*                                  FirePostProcess;                                   // 0x408(0x8)
	class BoxComponent*                                          Fire_PP_Volume;                                    // 0x410(0x8)
	class StaticMeshComponent*                                   cap_cage_03_c;                                     // 0x418(0x8)
	class StaticMeshComponent*                                   shp_item_shelf_01_a;                               // 0x420(0x8)
	class SurfaceWaterComponent*                                 SurfaceWater;                                      // 0x428(0x8)
	class StaticMeshComponent*                                   shp_small_rain_occlusion;                          // 0x430(0x8)
	class StaticMeshComponent*                                   shp_small_canopy_01_a1;                            // 0x438(0x8)
	class StaticMeshComponent*                                   shp_small_hatch_01_a;                              // 0x440(0x8)
	class PostProcessComponent*                                  PostProcess2;                                      // 0x448(0x8)
	class BoxComponent*                                          Below_Deck;                                        // 0x450(0x8)
	class PostProcessComponent*                                  PostProcess1;                                      // 0x458(0x8)
	class BoxComponent*                                          Map_Deck_B;                                        // 0x460(0x8)
	class PostProcessComponent*                                  PostProcess;                                       // 0x468(0x8)
	class BoxComponent*                                          Map_Deck;                                          // 0x470(0x8)
	class StaticMeshComponent*                                   shp_small_hull_rope_01_a;                          // 0x478(0x8)
	class MergedStaticMeshComponent*                             MergedStaticMesh;                                  // 0x480(0x8)
	class ChildActorComponent*                                   BP_SmallShip_StandardHull_Art_Interior_Lower_Deck; // 0x488(0x8)
	class StaticMeshComponent*                                   shp_small_stairs_01_a;                             // 0x490(0x8)
	class StaticMeshComponent*                                   shp_small_main_deck_01_a;                          // 0x498(0x8)
};


}