// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x2c8 (Full Size[0x720] - InheritedSize[0x458]
class BP_Shroudbreaker_OnShip_C: public ShroudBreakerOnShip
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x458(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x460(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x468(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x470(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x478(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x480(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x488(0x8)
	Class WwiseEmitterComponent*                                 None;                                              // 0x490(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x498(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x4a0(0x8)
	Class MusicZoneComponent*                                    None;                                              // 0x4a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4b0(0x8)
	Struct ObjectMessagingHandle                                 None;                                              // 0x4b8(0x48)
	Struct ObjectMessagingHandle                                 None;                                              // 0x500(0x48)
	Struct ObjectMessagingHandle                                 None;                                              // 0x548(0x48)
	Struct ObjectMessagingHandle                                 None;                                              // 0x590(0x48)
	Struct ObjectMessagingHandle                                 None;                                              // 0x5d8(0x48)
	Class Actor*                                                 None;                                              // 0x620(0x8)
	bool                                                         None;                                              // 0x628(0x1)
	char                                                         pad0x3_SRK0S[0x3];                                 // 0x629(0x3)
	float                                                        None;                                              // 0x62c(0x4)
	Class MaterialInstanceDynamic*                               None;                                              // 0x630(0x8)
	float                                                        None;                                              // 0x638(0x4)
	bool                                                         None;                                              // 0x63c(0x1)
	bool                                                         None;                                              // 0x63d(0x1)
	char                                                         pad0x2_MY0Q6[0x2];                                 // 0x63e(0x2)
	Struct ObjectMessagingHandle                                 None;                                              // 0x640(0x48)
	Struct ObjectMessagingHandle                                 None;                                              // 0x688(0x48)
	TArray<Assetclass None>                                      None;                                              // 0x6d0(0x10)
	TArray<class ProgressShipSpawnLocation*>                     None;                                              // 0x6e0(0x10)
	Class MaterialInstanceDynamic*                               None;                                              // 0x6f0(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x6f8(0x8)
	int                                                          None;                                              // 0x700(0x4)
	float                                                        None;                                              // 0x704(0x4)
	Class SoundBase*                                             None;                                              // 0x708(0x8)
	Class ShipHullAudio*                                         None;                                              // 0x710(0x8)
	Class WwiseEvent*                                            None;                                              // 0x718(0x8)
};


}