#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x68 (Full Size[0x738] - InheritedSize[0x6d0]
class BP_Shipwright_C: public NPC
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x6d0(0x8)
	class CameraComponent*                                       NPCDialogCamera;                                   // 0x6d8(0x8)
	class NamedNPCComponent*                                     NamedNPC;                                          // 0x6e0(0x8)
	class CargoRunParticipantComponent*                          CargoRunParticipant;                               // 0x6e8(0x8)
	class NPCDialogComponent*                                    NPCDialogComponent;                                // 0x6f0(0x8)
	class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x6f8(0x8)
	class CapsuleComponent*                                      SolidHits;                                         // 0x700(0x8)
	struct WwiseEmitter                                          WwiseEmitter;                                      // 0x708(0x20)
	class WwiseEvent*                                            WwiseShipwrightHummingPlay;                        // 0x728(0x8)
	class WwiseEvent*                                            WwiseShipwrightHummingStop;                        // 0x730(0x8)
};


