// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x80 (Full Size[0x448] - InheritedSize[0x3c8]
class BP_SovereignHut_Table_C: public Actor
{
public:
	Class PointLightComponent*                                   PointLight;                                        // 0x3c8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x3d0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x3d8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x3e0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x3e8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x3f0(0x8)
	Class StaticMeshComponent*                                   Candle5;                                           // 0x3f8(0x8)
	Class StaticMeshComponent*                                   Candle4;                                           // 0x400(0x8)
	Class StaticMeshComponent*                                   Candle3;                                           // 0x408(0x8)
	Class StaticMeshComponent*                                   Candle2;                                           // 0x410(0x8)
	Class StaticMeshComponent*                                   Candle1;                                           // 0x418(0x8)
	Class StaticMeshComponent*                                   Candlestick;                                       // 0x420(0x8)
	Class StaticMeshComponent*                                   Inkwell;                                           // 0x428(0x8)
	Class StaticMeshComponent*                                   Ship Model;                                        // 0x430(0x8)
	Class StaticMeshComponent*                                   Table;                                             // 0x438(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x440(0x8)
};


}