#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x900 (Full Size[0xca0] - InheritedSize[0x3a0]
class BP_sod_bld_tvn_ngs_groundfloor_dressing_01_a_frontend_C: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMesh9;                                       // 0x3a0(0x8)
	class ChildActorComponent*                                   BP_onboarding_intro_tavern_table_frontend;         // 0x3a8(0x8)
	class StaticMeshComponent*                                   StaticMesh8;                                       // 0x3b0(0x8)
	class StaticMeshComponent*                                   sod_bld_barrel_netting_01_a;                       // 0x3b8(0x8)
	class SkeletalMeshComponent*                                 gmp_musicbox_01_a;                                 // 0x3c0(0x8)
	class StaticMeshComponent*                                   cmn_bolt_01_a;                                     // 0x3c8(0x8)
	class StaticMeshComponent*                                   StaticMesh7;                                       // 0x3d0(0x8)
	class StaticMeshComponent*                                   StaticMesh6;                                       // 0x3d8(0x8)
	class StaticMeshComponent*                                   StaticMesh5;                                       // 0x3e0(0x8)
	class StaticMeshComponent*                                   StaticMesh4;                                       // 0x3e8(0x8)
	class StaticMeshComponent*                                   StaticMesh3;                                       // 0x3f0(0x8)
	class StaticMeshComponent*                                   cmn_shovel_02_a;                                   // 0x3f8(0x8)
	class StaticMeshComponent*                                   cmn_hat_01_a;                                      // 0x400(0x8)
	class StaticMeshComponent*                                   cmn_hook_10_a;                                     // 0x408(0x8)
	class StaticMeshComponent*                                   cmn_hat_18_a;                                      // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMesh2;                                       // 0x418(0x8)
	class StaticMeshComponent*                                   cmn_hat_05_a;                                      // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMesh1;                                       // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0322;                           // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0321;                           // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0320;                           // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0318;                           // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0317;                           // 0x458(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0316;                           // 0x460(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0315;                           // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0312;                           // 0x470(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0310;                           // 0x478(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0308;                           // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0307;                           // 0x488(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0305;                           // 0x490(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0304;                           // 0x498(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0303;                           // 0x4a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0302;                           // 0x4a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0301;                           // 0x4b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0300;                           // 0x4b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0299;                           // 0x4c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0298;                           // 0x4c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0297;                           // 0x4d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0296;                           // 0x4d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0294;                           // 0x4e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0293;                           // 0x4e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0289;                           // 0x4f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0288;                           // 0x4f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0285;                           // 0x500(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0284;                           // 0x508(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0282;                           // 0x510(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0281;                           // 0x518(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0280;                           // 0x520(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0279;                           // 0x528(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0278;                           // 0x530(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0277;                           // 0x538(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0276;                           // 0x540(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0275;                           // 0x548(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0274;                           // 0x550(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0273;                           // 0x558(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0272;                           // 0x560(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0271;                           // 0x568(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0270;                           // 0x570(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0269;                           // 0x578(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0267;                           // 0x580(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0266;                           // 0x588(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0265;                           // 0x590(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0264;                           // 0x598(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0263;                           // 0x5a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0262;                           // 0x5a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0261;                           // 0x5b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0260;                           // 0x5b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0259;                           // 0x5c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0258;                           // 0x5c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0256;                           // 0x5d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0255;                           // 0x5d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0254;                           // 0x5e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0253;                           // 0x5e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0252;                           // 0x5f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0251;                           // 0x5f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0250;                           // 0x600(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0249;                           // 0x608(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0248;                           // 0x610(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0245;                           // 0x618(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0243;                           // 0x620(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0242;                           // 0x628(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0241;                           // 0x630(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0240;                           // 0x638(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0239;                           // 0x640(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0238;                           // 0x648(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0237;                           // 0x650(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0235;                           // 0x658(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0234;                           // 0x660(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0233;                           // 0x668(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0232;                           // 0x670(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0231;                           // 0x678(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0230;                           // 0x680(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0226;                           // 0x688(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0225;                           // 0x690(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0224;                           // 0x698(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0215;                           // 0x6a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0214;                           // 0x6a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0213;                           // 0x6b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0212;                           // 0x6b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0210;                           // 0x6c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0209;                           // 0x6c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0208;                           // 0x6d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0207;                           // 0x6d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0206;                           // 0x6e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0205;                           // 0x6e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0204;                           // 0x6f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0203;                           // 0x6f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0202;                           // 0x700(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0201;                           // 0x708(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0200;                           // 0x710(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0199;                           // 0x718(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0198;                           // 0x720(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0196;                           // 0x728(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0195;                           // 0x730(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0194;                           // 0x738(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0193;                           // 0x740(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0192;                           // 0x748(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0191;                           // 0x750(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0190;                           // 0x758(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0189;                           // 0x760(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0188;                           // 0x768(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0187;                           // 0x770(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0186;                           // 0x778(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0185;                           // 0x780(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0184;                           // 0x788(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0183;                           // 0x790(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0182;                           // 0x798(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0181;                           // 0x7a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0180;                           // 0x7a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0179;                           // 0x7b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0178;                           // 0x7b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0177;                           // 0x7c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0176;                           // 0x7c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0175;                           // 0x7d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0174;                           // 0x7d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0173;                           // 0x7e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0172;                           // 0x7e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0171;                           // 0x7f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0170;                           // 0x7f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0169;                           // 0x800(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0168;                           // 0x808(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0167;                           // 0x810(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0166;                           // 0x818(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0165;                           // 0x820(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0164;                           // 0x828(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0163;                           // 0x830(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0162;                           // 0x838(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0161;                           // 0x840(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0160;                           // 0x848(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0159;                           // 0x850(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0158;                           // 0x858(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0156;                           // 0x860(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0155;                           // 0x868(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0154;                           // 0x870(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0153;                           // 0x878(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0152;                           // 0x880(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0151;                           // 0x888(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0150;                           // 0x890(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0149;                           // 0x898(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0147;                           // 0x8a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0146;                           // 0x8a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0143;                           // 0x8b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0141;                           // 0x8b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0140;                           // 0x8c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0139;                           // 0x8c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0138;                           // 0x8d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0137;                           // 0x8d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0136;                           // 0x8e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0135;                           // 0x8e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0134;                           // 0x8f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0133;                           // 0x8f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0132;                           // 0x900(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0131;                           // 0x908(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0130;                           // 0x910(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0128;                           // 0x918(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0127;                           // 0x920(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0126;                           // 0x928(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0125;                           // 0x930(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0124;                           // 0x938(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0123;                           // 0x940(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0122;                           // 0x948(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0120;                           // 0x950(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0118;                           // 0x958(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0117;                           // 0x960(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0116;                           // 0x968(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0115;                           // 0x970(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0113;                           // 0x978(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0112;                           // 0x980(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0111;                           // 0x988(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0110;                           // 0x990(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0109;                           // 0x998(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0108;                           // 0x9a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0107;                           // 0x9a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0106;                           // 0x9b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0105;                           // 0x9b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0104;                           // 0x9c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0102;                           // 0x9c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0101;                           // 0x9d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0100;                           // 0x9d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent099;                            // 0x9e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent098;                            // 0x9e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent097;                            // 0x9f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent095;                            // 0x9f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent094;                            // 0xa00(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent093;                            // 0xa08(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent092;                            // 0xa10(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent091;                            // 0xa18(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent089;                            // 0xa20(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent088;                            // 0xa28(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent087;                            // 0xa30(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent086;                            // 0xa38(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent085;                            // 0xa40(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent084;                            // 0xa48(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent083;                            // 0xa50(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent082;                            // 0xa58(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent081;                            // 0xa60(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent080;                            // 0xa68(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent079;                            // 0xa70(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent078;                            // 0xa78(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent077;                            // 0xa80(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent076;                            // 0xa88(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent075;                            // 0xa90(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent074;                            // 0xa98(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent073;                            // 0xaa0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent072;                            // 0xaa8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent071;                            // 0xab0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent070;                            // 0xab8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent069;                            // 0xac0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent068;                            // 0xac8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent066;                            // 0xad0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent065;                            // 0xad8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent064;                            // 0xae0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent062;                            // 0xae8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent061;                            // 0xaf0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent060;                            // 0xaf8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent059;                            // 0xb00(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent058;                            // 0xb08(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent057;                            // 0xb10(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent056;                            // 0xb18(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent054;                            // 0xb20(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent053;                            // 0xb28(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent051;                            // 0xb30(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent050;                            // 0xb38(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent049;                            // 0xb40(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent048;                            // 0xb48(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent047;                            // 0xb50(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent046;                            // 0xb58(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent045;                            // 0xb60(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent044;                            // 0xb68(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent043;                            // 0xb70(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent042;                            // 0xb78(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent041;                            // 0xb80(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent039;                            // 0xb88(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent038;                            // 0xb90(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent037;                            // 0xb98(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent034;                            // 0xba0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent033;                            // 0xba8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent032;                            // 0xbb0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent031;                            // 0xbb8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent030;                            // 0xbc0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent029;                            // 0xbc8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent028;                            // 0xbd0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent027;                            // 0xbd8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent026;                            // 0xbe0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent025;                            // 0xbe8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent024;                            // 0xbf0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent023;                            // 0xbf8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0xc00(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent021;                            // 0xc08(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent020;                            // 0xc10(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0xc18(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0xc20(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0xc28(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0xc30(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0xc38(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0xc40(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0xc48(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0xc50(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0xc58(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0xc60(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0xc68(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0xc70(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0xc78(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0xc80(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0xc88(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0xc90(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0xc98(0x8)
};


