#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x1d8 (Full Size[0x5a0] - InheritedSize[0x3c8]
class BP_shop_oos_01_a_C: public Actor
{
public:
	class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3c8(0x8)
	class StaticMeshComponent*                                   wsp_Oos_shop_dressing_01_a;                        // 0x3d0(0x8)
	class BoxComponent*                                          Collision_01;                                      // 0x3d8(0x8)
	class PointLightComponent*                                   PointLight2;                                       // 0x3e0(0x8)
	class ParticleSystemComponent*                               vfx_candle_01_magic_blue2;                         // 0x3e8(0x8)
	class ParticleSystemComponent*                               vfx_candle_01_magic_blue1;                         // 0x3f0(0x8)
	class StaticMeshComponent*                                   cmn_candle_01_e;                                   // 0x3f8(0x8)
	class StaticMeshComponent*                                   bld_shop_bone_oos_04_a;                            // 0x400(0x8)
	class StaticMeshComponent*                                   cmn_skeleton_head_chicken_01_a;                    // 0x408(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_a5;                            // 0x410(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_a4;                            // 0x418(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_a3;                            // 0x420(0x8)
	class ChildActorComponent*                                   MagicBox;                                          // 0x428(0x8)
	class StaticMeshComponent*                                   bld_int_small_sideboard_01_a;                      // 0x430(0x8)
	class StaticMeshComponent*                                   bld_flag_post_oos_01_a;                            // 0x438(0x8)
	class ParticleSystemComponent*                               vfx_mist_furnace_pirate_hideout;                   // 0x440(0x8)
	class ParticleSystemComponent*                               vfx_dust_01_air;                                   // 0x448(0x8)
	class ParticleSystemComponent*                               vfx_candle_01_smoke_tavern1;                       // 0x450(0x8)
	class ParticleSystemComponent*                               vfx_candle_01_magic_blue;                          // 0x458(0x8)
	class StaticMeshComponent*                                   bld_shop_bone_oos_02_a2;                           // 0x460(0x8)
	class StaticMeshComponent*                                   bld_shop_bone_oos_05_a1;                           // 0x468(0x8)
	class StaticMeshComponent*                                   bld_shop_bone_oos_08_a;                            // 0x470(0x8)
	class StaticMeshComponent*                                   StaticMesh5;                                       // 0x478(0x8)
	class StaticMeshComponent*                                   bld_shop_table_cloth_oos_01_a;                     // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMesh4;                                       // 0x488(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_a2;                            // 0x490(0x8)
	class StaticMeshComponent*                                   StaticMesh3;                                       // 0x498(0x8)
	class StaticMeshComponent*                                   bld_shop_cloth_walls_oos_01_a;                     // 0x4a0(0x8)
	class SpotLightComponent*                                    SpotLight6;                                        // 0x4a8(0x8)
	class SpotLightComponent*                                    SpotLight5;                                        // 0x4b0(0x8)
	class SpotLightComponent*                                    SpotLight4;                                        // 0x4b8(0x8)
	class SpotLightComponent*                                    SpotLight3;                                        // 0x4c0(0x8)
	class SpotLightComponent*                                    SpotLight2;                                        // 0x4c8(0x8)
	class PostProcessComponent*                                  PostProcess;                                       // 0x4d0(0x8)
	class BoxComponent*                                          Box;                                               // 0x4d8(0x8)
	class SpotLightComponent*                                    SpotLight1;                                        // 0x4e0(0x8)
	class ChildActorComponent*                                   ChildActor1;                                       // 0x4e8(0x8)
	class ChildActorComponent*                                   ChildActor;                                        // 0x4f0(0x8)
	class SpotLightComponent*                                    SpotLight;                                         // 0x4f8(0x8)
	class PointLightComponent*                                   PointLight5;                                       // 0x500(0x8)
	class ChildActorComponent*                                   wsp_light_large_pot;                               // 0x508(0x8)
	class ParticleSystemComponent*                               vfx_magic_fire_pot;                                // 0x510(0x8)
	class PointLightComponent*                                   PointLight1;                                       // 0x518(0x8)
	class PointLightComponent*                                   PointLight;                                        // 0x520(0x8)
	class CompanyRegionComponent*                                CompanyRegion;                                     // 0x528(0x8)
	class StaticMeshComponent*                                   bld_shop_entrance_oos_01_a;                        // 0x530(0x8)
	class StaticMeshComponent*                                   bld_shop_pillar_symbols_oos_01_a;                  // 0x538(0x8)
	class StaticMeshComponent*                                   bld_enc_shop_kettle_01_a;                          // 0x540(0x8)
	class StaticMeshComponent*                                   bld_int_stool_01_a;                                // 0x548(0x8)
	class StaticMeshComponent*                                   bld_enc_shop_burner_pot_01_a;                      // 0x550(0x8)
	class StaticMeshComponent*                                   cmn_barrel_salvage_01_d;                           // 0x558(0x8)
	class StaticMeshComponent*                                   cap_skull_candle_01_a;                             // 0x560(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_a1;                            // 0x568(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_a;                             // 0x570(0x8)
	class StaticMeshComponent*                                   bld_shop_curtain_oos_01_a;                         // 0x578(0x8)
	class StaticMeshComponent*                                   bld_shop_table_oos_01_a;                           // 0x580(0x8)
	class StaticMeshComponent*                                   bld_shop_skull_crate_oos_01_a;                     // 0x588(0x8)
	class StaticMeshComponent*                                   bld_shop_skull_barrel_oos_01_a;                    // 0x590(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x598(0x8)
};


