// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x218 (Full Size[0x5e0] - InheritedSize[0x3c8]
class BP_sod_bld_trn_shop_01_a_C: public Actor
{
public:
	class StaticMeshComponent*                                   tls_lantern_01_e;                                  // 0x3c8(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_window_01_b3;                         // 0x3d0(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_window_01_a2;                         // 0x3d8(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_window_01_b2;                         // 0x3e0(0x8)
	class StaticMeshComponent*                                   cmn_bottle_01_a;                                   // 0x3e8(0x8)
	class StaticMeshComponent*                                   cmn_moneybag_01_a;                                 // 0x3f0(0x8)
	class StaticMeshComponent*                                   tls_shovel_03_a;                                   // 0x3f8(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_a2;                            // 0x400(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_a1;                            // 0x408(0x8)
	class StaticMeshComponent*                                   sod_bld_trn_shop_sign_01_a1;                       // 0x410(0x8)
	class StaticMeshComponent*                                   sod_bld_trn_shop_sign_01_a;                        // 0x418(0x8)
	class BoxComponent*                                          BoxCollision_03;                                   // 0x420(0x8)
	class BoxComponent*                                          BoxCollision_02;                                   // 0x428(0x8)
	class BoxComponent*                                          BoxCollision_01;                                   // 0x430(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_b;                             // 0x438(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_a;                             // 0x440(0x8)
	class StaticMeshComponent*                                   gmp_bar_stor_01_a1;                                // 0x448(0x8)
	class StaticMeshComponent*                                   gmp_bar_stor_01_a;                                 // 0x450(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_sign_01_a;                            // 0x458(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_doorframe_01_a;                       // 0x460(0x8)
	class StaticMeshComponent*                                   sod_bld_trn_shop_dressing_01_b;                    // 0x468(0x8)
	class StaticMeshComponent*                                   sod_bld_trn_shop_dressing_01_a;                    // 0x470(0x8)
	class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x478(0x8)
	class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x480(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_hanging_sign_01_a;                    // 0x488(0x8)
	class SpotLightComponent*                                    SpotLight3;                                        // 0x490(0x8)
	class SpotLightComponent*                                    SpotLight2;                                        // 0x498(0x8)
	class ChildActorComponent*                                   BP_MusicBox;                                       // 0x4a0(0x8)
	class ChildActorComponent*                                   BP_IslandEquipmentChest;                           // 0x4a8(0x8)
	class SpotLightComponent*                                    SpotLight1;                                        // 0x4b0(0x8)
	class StaticMeshComponent*                                   StaticMesh17;                                      // 0x4b8(0x8)
	class StaticMeshComponent*                                   StaticMesh15;                                      // 0x4c0(0x8)
	class SpotLightComponent*                                    SpotLight;                                         // 0x4c8(0x8)
	class PointLightComponent*                                   PointLight3;                                       // 0x4d0(0x8)
	class PointLightComponent*                                   PointLight2;                                       // 0x4d8(0x8)
	class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x4e0(0x8)
	class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x4e8(0x8)
	class StaticMeshComponent*                                   StaticMesh33;                                      // 0x4f0(0x8)
	class StaticMeshComponent*                                   StaticMesh32;                                      // 0x4f8(0x8)
	class StaticMeshComponent*                                   StaticMesh31;                                      // 0x500(0x8)
	class StaticMeshComponent*                                   cmn_rope_04_c;                                     // 0x508(0x8)
	class StaticMeshComponent*                                   StaticMesh30;                                      // 0x510(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a;                                 // 0x518(0x8)
	class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x520(0x8)
	class ParticleSystemComponent*                               ParticleSystem;                                    // 0x528(0x8)
	class StaticMeshComponent*                                   StaticMesh4;                                       // 0x530(0x8)
	class StaticMeshComponent*                                   cmn_lantern_01_a;                                  // 0x538(0x8)
	class PointLightComponent*                                   PointLight1;                                       // 0x540(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_03_a;                              // 0x548(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_hanging_glass_balls_01_a;             // 0x550(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_interior_cloth_01_a;                  // 0x558(0x8)
	class StaticMeshComponent*                                   StaticMesh11;                                      // 0x560(0x8)
	class StaticMeshComponent*                                   StaticMesh8;                                       // 0x568(0x8)
	class StaticMeshComponent*                                   StaticMesh6;                                       // 0x570(0x8)
	class StaticMeshComponent*                                   cmn_oar_01_a;                                      // 0x578(0x8)
	class StaticMeshComponent*                                   cmn_wheel_01_a;                                    // 0x580(0x8)
	class StaticMeshComponent*                                   shp_kitchen_shelf_02_a;                            // 0x588(0x8)
	class StaticMeshComponent*                                   cmn_looted_box_01_a;                               // 0x590(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_03_a1;                           // 0x598(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_03_a;                            // 0x5a0(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x5a8(0x8)
	class StaticMeshComponent*                                   Rug;                                               // 0x5b0(0x8)
	class StaticMeshComponent*                                   Barrel;                                            // 0x5b8(0x8)
	class StaticMeshComponent*                                   bld_shop_table_01_a;                               // 0x5c0(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_window_01_a;                          // 0x5c8(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_door_01_a;                            // 0x5d0(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x5d8(0x8)
};


}