// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x3c8 (Full Size[0x1c58] - InheritedSize[0x1890]
class BP_SmallShipTemplate_C: public Ship
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x1890(0x8)
	Class ShipRowboatPersistenceComponent*                       None;                                              // 0x1898(0x8)
	Class HarpoonItemLocationComponent*                          None;                                              // 0x18a0(0x8)
	Class HarpoonItemLocationComponent*                          None;                                              // 0x18a8(0x8)
	Class FactionParticleComponent*                              None;                                              // 0x18b0(0x8)
	Class FactionParticleComponent*                              None;                                              // 0x18b8(0x8)
	Class SplashProbeVFXComponent*                               None;                                              // 0x18c0(0x8)
	Class SplashProbeVFXComponent*                               None;                                              // 0x18c8(0x8)
	Class SplashProbeVFXComponent*                               None;                                              // 0x18d0(0x8)
	Class SplashProbeVFXComponent*                               None;                                              // 0x18d8(0x8)
	Class SplashProbeVFXComponent*                               None;                                              // 0x18e0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x18e8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x18f0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x18f8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x1900(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x1908(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x1910(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x1918(0x8)
	Class SceneComponent*                                        None;                                              // 0x1920(0x8)
	Class ShipFactionCustomisation*                              None;                                              // 0x1928(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1930(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1938(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1940(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1948(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1950(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1958(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1960(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1968(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1970(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1978(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1980(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1988(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1990(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1998(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19a0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19a8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19b0(0x8)
	Class ShipStorageJettisonComponent*                          None;                                              // 0x19b8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x19c0(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x19c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x19d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x19d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x19e0(0x8)
	Class RatManagerComponent*                                   None;                                              // 0x19e8(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x19f0(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x19f8(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1a00(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1a08(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1a10(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1a18(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1a20(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1a28(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1a30(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1a38(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1a40(0x8)
	Class ArrowComponent*                                        None;                                              // 0x1a48(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1a50(0x8)
	Class AIRegionComponent*                                     None;                                              // 0x1a58(0x8)
	Class NamedPointsComponent*                                  None;                                              // 0x1a60(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1a68(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1a70(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a78(0x8)
	Class EmissaryFlotsamItemSpawnComponent*                     None;                                              // 0x1a80(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a88(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a90(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1a98(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1aa0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1aa8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1ab0(0x8)
	Class PetHangoutSpotComponent*                               None;                                              // 0x1ab8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1ac0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1ac8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1ad0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1ad8(0x8)
	Class ShipTelemetryComponent*                                None;                                              // 0x1ae0(0x8)
	Class RiggingSystemComponent*                                None;                                              // 0x1ae8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1af0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1af8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b00(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b08(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b10(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b18(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b20(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b28(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b30(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b38(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b40(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b48(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b50(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b58(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b60(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b68(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b70(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b78(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b80(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1b88(0x8)
	Class BoxComponent*                                          None;                                              // 0x1b90(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1b98(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1ba0(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1ba8(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1bb0(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1bb8(0x8)
	Class RiggingSystemComponent*                                None;                                              // 0x1bc0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1bc8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1bd0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1bd8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1be0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1be8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1bf0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1bf8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1c00(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1c08(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1c10(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1c18(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1c20(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1c28(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1c30(0x8)
	byte                                                         None;                                              // 0x1c38(0x1)
	char                                                         pad0x7_3BNK5[0x7];                                 // 0x1c39(0x7)
	Class TimelineComponent*                                     None;                                              // 0x1c40(0x8)
	byte                                                         None;                                              // 0x1c48(0x1)
	char                                                         pad0x7_OBGVS[0x7];                                 // 0x1c49(0x7)
	Class TimelineComponent*                                     None;                                              // 0x1c50(0x8)
};


}