// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x9d0 (Full Size[0xd98] - InheritedSize[0x3c8]
class BP_sod_bld_prem_shop_01_a_C: public Actor
{
public:
	class ActionRulesComponent*                                  ActionRules3;                                      // 0x3c8(0x8)
	class InteractableComponent*                                 Interactable;                                      // 0x3d0(0x8)
	class InteractableComponent*                                 InteractableRegion2;                               // 0x3d8(0x8)
	class ActionRulesComponent*                                  ActionRules2;                                      // 0x3e0(0x8)
	class InteractableComponent*                                 InteractableRegion1;                               // 0x3e8(0x8)
	class ActionRulesComponent*                                  ActionRules1;                                      // 0x3f0(0x8)
	class InteractableComponent*                                 InteractableRegion;                                // 0x3f8(0x8)
	class ActionRulesComponent*                                  ActionRules;                                       // 0x400(0x8)
	class StaticMeshComponent*                                   StaticMesh2;                                       // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMesh1;                                       // 0x410(0x8)
	class ChildActorComponent*                                   BP_IslandEquipmentChest;                           // 0x418(0x8)
	class BoxComponent*                                          BoxCollision_09;                                   // 0x420(0x8)
	class ChildActorComponent*                                   BP_IslandVanityChest;                              // 0x428(0x8)
	class SpotLightComponent*                                    SpotLight11;                                       // 0x430(0x8)
	class SpotLightComponent*                                    SpotLight10;                                       // 0x438(0x8)
	class PointLightComponent*                                   PointLight11;                                      // 0x440(0x8)
	class PointLightComponent*                                   PointLight10;                                      // 0x448(0x8)
	class SpotLightComponent*                                    SpotLight2;                                        // 0x450(0x8)
	class PointLightComponent*                                   PointLight5;                                       // 0x458(0x8)
	class SpotLightComponent*                                    SpotLight9;                                        // 0x460(0x8)
	class PointLightComponent*                                   PointLight;                                        // 0x468(0x8)
	class SpotLightComponent*                                    SpotLight8;                                        // 0x470(0x8)
	class PointLightComponent*                                   PointLight7;                                       // 0x478(0x8)
	class SpotLightComponent*                                    SpotLight7;                                        // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x488(0x8)
	class SpotLightComponent*                                    SpotLight6;                                        // 0x490(0x8)
	class SpotLightComponent*                                    SpotLight5;                                        // 0x498(0x8)
	class BoxComponent*                                          BoxCollision_08;                                   // 0x4a0(0x8)
	class BoxComponent*                                          BoxCollision_07;                                   // 0x4a8(0x8)
	class BoxComponent*                                          BoxCollision_06;                                   // 0x4b0(0x8)
	class BoxComponent*                                          BoxCollision_05;                                   // 0x4b8(0x8)
	class BoxComponent*                                          BoxCollision_04;                                   // 0x4c0(0x8)
	class BoxComponent*                                          BoxCollision_03;                                   // 0x4c8(0x8)
	class BoxComponent*                                          BoxCollision_02;                                   // 0x4d0(0x8)
	class BoxComponent*                                          BoxCollision_01;                                   // 0x4d8(0x8)
	class StaticMeshComponent*                                   Rainblocker;                                       // 0x4e0(0x8)
	class StaticMeshComponent*                                   Rainblocker;                                       // 0x4e8(0x8)
	class StaticMeshComponent*                                   RainBlocker_09;                                    // 0x4f0(0x8)
	class StaticMeshComponent*                                   RainBlocker_08;                                    // 0x4f8(0x8)
	class StaticMeshComponent*                                   RainBlocker_07;                                    // 0x500(0x8)
	class StaticMeshComponent*                                   RainBlocker_06;                                    // 0x508(0x8)
	class StaticMeshComponent*                                   RainBlocker_05;                                    // 0x510(0x8)
	class StaticMeshComponent*                                   RainBlocker_04;                                    // 0x518(0x8)
	class StaticMeshComponent*                                   RainBlocker_03;                                    // 0x520(0x8)
	class StaticMeshComponent*                                   RainBlocker_02;                                    // 0x528(0x8)
	class StaticMeshComponent*                                   RainBlocker_01;                                    // 0x530(0x8)
	class PostProcessComponent*                                  PostProcess5;                                      // 0x538(0x8)
	class BoxComponent*                                          PostProcess_06;                                    // 0x540(0x8)
	class PostProcessComponent*                                  PostProcess4;                                      // 0x548(0x8)
	class BoxComponent*                                          PostProcess_05;                                    // 0x550(0x8)
	class PostProcessComponent*                                  PostProcess3;                                      // 0x558(0x8)
	class BoxComponent*                                          PostProcess_04;                                    // 0x560(0x8)
	class PostProcessComponent*                                  PostProcess2;                                      // 0x568(0x8)
	class BoxComponent*                                          PostProcess_03;                                    // 0x570(0x8)
	class PostProcessComponent*                                  PostProcess1;                                      // 0x578(0x8)
	class BoxComponent*                                          PostProcess_02;                                    // 0x580(0x8)
	class PostProcessComponent*                                  PostProcess;                                       // 0x588(0x8)
	class BoxComponent*                                          PostProcess_01;                                    // 0x590(0x8)
	class StaticMeshComponent*                                   sod_bld_prem_shop_shell_01_a;                      // 0x598(0x8)
	class StaticMeshComponent*                                   sod_bld_prem_shop_01_a;                            // 0x5a0(0x8)
	class ChildActorComponent*                                   cmn_candle_group_03_02;                            // 0x5a8(0x8)
	class ChildActorComponent*                                   cmn_candle_group_02_02;                            // 0x5b0(0x8)
	class ChildActorComponent*                                   cmn_candle_group_03;                               // 0x5b8(0x8)
	class ChildActorComponent*                                   cmn_candle_group_02;                               // 0x5c0(0x8)
	class ChildActorComponent*                                   cmn_candle_group_01_03;                            // 0x5c8(0x8)
	class ChildActorComponent*                                   cmn_candle_group_01_02;                            // 0x5d0(0x8)
	class ChildActorComponent*                                   cmn_candle_group_01;                               // 0x5d8(0x8)
	class ChildActorComponent*                                   BP_IslandPetChest;                                 // 0x5e0(0x8)
	class ChildActorComponent*                                   BP_IslandClothingChest;                            // 0x5e8(0x8)
	class ChildActorComponent*                                   BP_IslandWeaponsChest;                             // 0x5f0(0x8)
	class StaticMeshComponent*                                   sod_bld_prem_shop_details_01_a;                    // 0x5f8(0x8)
	class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x600(0x8)
	class StaticMeshComponent*                                   cap_cabin_books_aged_03_a1;                        // 0x608(0x8)
	class StaticMeshComponent*                                   cap_cabin_books_02_a3;                             // 0x610(0x8)
	class StaticMeshComponent*                                   bld_shop_wind_chime_prm_01_b2;                     // 0x618(0x8)
	class PointLightComponent*                                   PointLight9;                                       // 0x620(0x8)
	class StaticMeshComponent*                                   gmp_prm_reroll_01_a;                               // 0x628(0x8)
	class StaticMeshComponent*                                   bld_prem_shop_plinth_01_a;                         // 0x630(0x8)
	class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x638(0x8)
	class CompanyRegionComponent*                                CompanyRegion;                                     // 0x640(0x8)
	class StaticMeshComponent*                                   cap_skull_candle_01_a;                             // 0x648(0x8)
	class StaticMeshComponent*                                   cap_cabin_books_03_a3;                             // 0x650(0x8)
	class StaticMeshComponent*                                   cap_cabin_books_02_a2;                             // 0x658(0x8)
	class StaticMeshComponent*                                   cap_model_smp_01_a;                                // 0x660(0x8)
	class StaticMeshComponent*                                   cap_cabin_books_03_a2;                             // 0x668(0x8)
	class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x670(0x8)
	class StaticMeshComponent*                                   cmn_candle_01_c1;                                  // 0x678(0x8)
	class StaticMeshComponent*                                   cmn_driftwood_03_a;                                // 0x680(0x8)
	class StaticMeshComponent*                                   ptn_cure_01_d2;                                    // 0x688(0x8)
	class StaticMeshComponent*                                   cmn_mannequin_parrot_01_a1;                        // 0x690(0x8)
	class StaticMeshComponent*                                   bld_int_small_sideboard_01_a;                      // 0x698(0x8)
	class StaticMeshComponent*                                   cmn_bottle_01_a;                                   // 0x6a0(0x8)
	class StaticMeshComponent*                                   cmn_moneybag_ancient_01_a1;                        // 0x6a8(0x8)
	class StaticMeshComponent*                                   cmn_moneybag_ancient_01_a;                         // 0x6b0(0x8)
	class StaticMeshComponent*                                   cmn_beacon_wood_01_b4;                             // 0x6b8(0x8)
	class StaticMeshComponent*                                   cmn_beacon_wood_01_b3;                             // 0x6c0(0x8)
	class StaticMeshComponent*                                   bld_shop_bird_ladder_prm_01_c;                     // 0x6c8(0x8)
	class StaticMeshComponent*                                   shp_small_mast_bell_support_01_a;                  // 0x6d0(0x8)
	class StaticMeshComponent*                                   cmn_banana_bunch_01_a;                             // 0x6d8(0x8)
	class StaticMeshComponent*                                   cmn_petCollar_01_a4;                               // 0x6e0(0x8)
	class StaticMeshComponent*                                   bld_shop_bird_ladder_prm_01_a;                     // 0x6e8(0x8)
	class StaticMeshComponent*                                   cmn_petCollar_01_a3;                               // 0x6f0(0x8)
	class StaticMeshComponent*                                   cmn_petCollar_01_a2;                               // 0x6f8(0x8)
	class StaticMeshComponent*                                   bld_int_wall_coat_rack_03_a2;                      // 0x700(0x8)
	class StaticMeshComponent*                                   bld_int_wall_coat_rack_03_a1;                      // 0x708(0x8)
	class StaticMeshComponent*                                   cmn_banana_sack_medium_01_a2;                      // 0x710(0x8)
	class StaticMeshComponent*                                   cmn_banana_sack_medium_01_a1;                      // 0x718(0x8)
	class StaticMeshComponent*                                   gmp_bar_stor_01_a4;                                // 0x720(0x8)
	class StaticMeshComponent*                                   cmn_petCollar_01_a1;                               // 0x728(0x8)
	class StaticMeshComponent*                                   cmn_moneybag_01_a3;                                // 0x730(0x8)
	class StaticMeshComponent*                                   cmn_bird_cage_01_a1;                               // 0x738(0x8)
	class StaticMeshComponent*                                   ptn_cure_01_d1;                                    // 0x740(0x8)
	class StaticMeshComponent*                                   bld_shop_cabin_curtain_03_a;                       // 0x748(0x8)
	class StaticMeshComponent*                                   cmn_petCollar_01_a;                                // 0x750(0x8)
	class SpotLightComponent*                                    SpotLight4;                                        // 0x758(0x8)
	class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x760(0x8)
	class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x768(0x8)
	class ParticleSystemComponent*                               ParticleSystem;                                    // 0x770(0x8)
	class StaticMeshComponent*                                   bld_cls_shp_dye_pot_01_a;                          // 0x778(0x8)
	class StaticMeshComponent*                                   cmn_candle_01_b;                                   // 0x780(0x8)
	class ChildActorComponent*                                   AudioSpace;                                        // 0x788(0x8)
	class StaticMeshComponent*                                   bld_tvn_post_01_d3;                                // 0x790(0x8)
	class StaticMeshComponent*                                   cmn_candle_01_c;                                   // 0x798(0x8)
	class StaticMeshComponent*                                   cmn_clay_vase_02_a;                                // 0x7a0(0x8)
	class StaticMeshComponent*                                   bld_prem_shop_table_bsp_01_a;                      // 0x7a8(0x8)
	class StaticMeshComponent*                                   cmn_animal_cage_01_a1;                             // 0x7b0(0x8)
	class StaticMeshComponent*                                   cmn_candle_01_e;                                   // 0x7b8(0x8)
	class StaticMeshComponent*                                   gmp_bar_stor_01_a3;                                // 0x7c0(0x8)
	class StaticMeshComponent*                                   cap_cabin_trunk_cloth_01_a;                        // 0x7c8(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_03_a2;                           // 0x7d0(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_02_a;                            // 0x7d8(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_03_a1;                           // 0x7e0(0x8)
	class StaticMeshComponent*                                   cap_cabin_books_aged_03_a;                         // 0x7e8(0x8)
	class StaticMeshComponent*                                   cap_cabin_books_02_a1;                             // 0x7f0(0x8)
	class StaticMeshComponent*                                   cap_cabin_books_03_a1;                             // 0x7f8(0x8)
	class StaticMeshComponent*                                   cmn_moneybag_01_a2;                                // 0x800(0x8)
	class StaticMeshComponent*                                   cmn_clay_vase_01_b;                                // 0x808(0x8)
	class StaticMeshComponent*                                   bld_enc_shop_pin_board_01_a;                       // 0x810(0x8)
	class StaticMeshComponent*                                   bld_int_large_sideboard_03_a;                      // 0x818(0x8)
	class StaticMeshComponent*                                   cmn_clay_pot_01_a;                                 // 0x820(0x8)
	class StaticMeshComponent*                                   cap_cabin_map_rolls_01_a;                          // 0x828(0x8)
	class StaticMeshComponent*                                   bld_tvn_animal_rug_01_a1;                          // 0x830(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_bird_cage_01_a;                       // 0x838(0x8)
	class StaticMeshComponent*                                   bld_pot_hatch_01_a;                                // 0x840(0x8)
	class PointLightComponent*                                   PointLight8;                                       // 0x848(0x8)
	class PointLightComponent*                                   PointLight6;                                       // 0x850(0x8)
	class SpotLightComponent*                                    SpotLight3;                                        // 0x858(0x8)
	class SpotLightComponent*                                    SpotLight1;                                        // 0x860(0x8)
	class PointLightComponent*                                   PointLight4;                                       // 0x868(0x8)
	class SpotLightComponent*                                    SpotLight;                                         // 0x870(0x8)
	class PointLightComponent*                                   PointLight3;                                       // 0x878(0x8)
	class PointLightComponent*                                   PointLight2;                                       // 0x880(0x8)
	class PointLightComponent*                                   PointLight1;                                       // 0x888(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_01_a3;                           // 0x890(0x8)
	class StaticMeshComponent*                                   trinket_plant_06_a;                                // 0x898(0x8)
	class StaticMeshComponent*                                   trinket_plant_04_a;                                // 0x8a0(0x8)
	class StaticMeshComponent*                                   trinket_bookstack_02_a;                            // 0x8a8(0x8)
	class StaticMeshComponent*                                   tls_lantern_01_d2;                                 // 0x8b0(0x8)
	class StaticMeshComponent*                                   tls_lantern_01_e2;                                 // 0x8b8(0x8)
	class StaticMeshComponent*                                   tls_lantern_01_e1;                                 // 0x8c0(0x8)
	class StaticMeshComponent*                                   tls_lantern_01_e;                                  // 0x8c8(0x8)
	class StaticMeshComponent*                                   tls_lantern_01_d1;                                 // 0x8d0(0x8)
	class StaticMeshComponent*                                   tls_lantern_01_d;                                  // 0x8d8(0x8)
	class StaticMeshComponent*                                   sod_bld_prem_shop_details_02_a;                    // 0x8e0(0x8)
	class StaticMeshComponent*                                   sod_bld_corbel_04_a4;                              // 0x8e8(0x8)
	class StaticMeshComponent*                                   sod_bld_corbel_04_a3;                              // 0x8f0(0x8)
	class StaticMeshComponent*                                   sod_bld_corbel_04_a2;                              // 0x8f8(0x8)
	class StaticMeshComponent*                                   sod_bld_corbel_04_a1;                              // 0x900(0x8)
	class StaticMeshComponent*                                   sod_bld_corbel_04_a;                               // 0x908(0x8)
	class StaticMeshComponent*                                   shp_sword_rack_01_a;                               // 0x910(0x8)
	class StaticMeshComponent*                                   shp_rifle_rack_01_a;                               // 0x918(0x8)
	class StaticMeshComponent*                                   shp_int_hook_01_a3;                                // 0x920(0x8)
	class StaticMeshComponent*                                   shp_int_hook_01_a2;                                // 0x928(0x8)
	class StaticMeshComponent*                                   shp_int_hook_01_a1;                                // 0x930(0x8)
	class StaticMeshComponent*                                   shp_int_hook_01_a;                                 // 0x938(0x8)
	class StaticMeshComponent*                                   ptn_cure_01_d;                                     // 0x940(0x8)
	class StaticMeshComponent*                                   gmp_extendable_ladder_01_a__steps_05;              // 0x948(0x8)
	class StaticMeshComponent*                                   gmp_bar_stor_01_a1;                                // 0x950(0x8)
	class StaticMeshComponent*                                   gmp_bar_stor_01_a;                                 // 0x958(0x8)
	class StaticMeshComponent*                                   cmn_step_ladder_01_a;                              // 0x960(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_01_a3;                                // 0x968(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_01_a2;                                // 0x970(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_06_a;                                 // 0x978(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_01_a1;                                // 0x980(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_01_a;                                 // 0x988(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a10;                               // 0x990(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a9;                                // 0x998(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a8;                                // 0x9a0(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a7;                                // 0x9a8(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a6;                                // 0x9b0(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a5;                                // 0x9b8(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a4;                                // 0x9c0(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a3;                                // 0x9c8(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a2;                                // 0x9d0(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a1;                                // 0x9d8(0x8)
	class StaticMeshComponent*                                   cmn_rope_end_05_a;                                 // 0x9e0(0x8)
	class StaticMeshComponent*                                   cmn_rope_04_c4;                                    // 0x9e8(0x8)
	class StaticMeshComponent*                                   cmn_rope_04_c3;                                    // 0x9f0(0x8)
	class StaticMeshComponent*                                   cmn_rope_04_c2;                                    // 0x9f8(0x8)
	class StaticMeshComponent*                                   cmn_rope_04_c1;                                    // 0xa00(0x8)
	class StaticMeshComponent*                                   cmn_rope_04_c;                                     // 0xa08(0x8)
	class StaticMeshComponent*                                   cmn_rope_04_b;                                     // 0xa10(0x8)
	class StaticMeshComponent*                                   cmn_rope_01_a;                                     // 0xa18(0x8)
	class StaticMeshComponent*                                   cmn_nut_sack_medium_01_a1;                         // 0xa20(0x8)
	class StaticMeshComponent*                                   cmn_nut_sack_medium_01_a;                          // 0xa28(0x8)
	class StaticMeshComponent*                                   cmn_moneybag_01_a1;                                // 0xa30(0x8)
	class StaticMeshComponent*                                   cmn_moneybag_01_a;                                 // 0xa38(0x8)
	class StaticMeshComponent*                                   cmn_mannequin_parrot_01_a;                         // 0xa40(0x8)
	class StaticMeshComponent*                                   cmn_man_cage_rope_knot_a7;                         // 0xa48(0x8)
	class StaticMeshComponent*                                   cmn_man_cage_rope_knot_a6;                         // 0xa50(0x8)
	class StaticMeshComponent*                                   cmn_man_cage_rope_knot_a5;                         // 0xa58(0x8)
	class StaticMeshComponent*                                   cmn_man_cage_rope_knot_a4;                         // 0xa60(0x8)
	class StaticMeshComponent*                                   cmn_man_cage_rope_knot_a3;                         // 0xa68(0x8)
	class StaticMeshComponent*                                   cmn_man_cage_rope_knot_a2;                         // 0xa70(0x8)
	class StaticMeshComponent*                                   cmn_man_cage_rope_knot_a1;                         // 0xa78(0x8)
	class StaticMeshComponent*                                   cmn_man_cage_rope_knot_a;                          // 0xa80(0x8)
	class StaticMeshComponent*                                   cmn_hook_02_a;                                     // 0xa88(0x8)
	class StaticMeshComponent*                                   cmn_hook_01_a1;                                    // 0xa90(0x8)
	class StaticMeshComponent*                                   cmn_hook_01_a;                                     // 0xa98(0x8)
	class StaticMeshComponent*                                   cmn_hat_19_a;                                      // 0xaa0(0x8)
	class StaticMeshComponent*                                   cmn_hat_01_a;                                      // 0xaa8(0x8)
	class StaticMeshComponent*                                   cmn_bird_cage_01_a;                                // 0xab0(0x8)
	class StaticMeshComponent*                                   cmn_beacon_wood_01_b2;                             // 0xab8(0x8)
	class StaticMeshComponent*                                   cmn_beacon_wood_01_b1;                             // 0xac0(0x8)
	class StaticMeshComponent*                                   cmn_beacon_wood_01_b;                              // 0xac8(0x8)
	class StaticMeshComponent*                                   cmn_barrel_salvage_01_e2;                          // 0xad0(0x8)
	class StaticMeshComponent*                                   cmn_barrel_salvage_01_e;                           // 0xad8(0x8)
	class StaticMeshComponent*                                   cmn_banana_sack_medium_01_a;                       // 0xae0(0x8)
	class StaticMeshComponent*                                   cmn_animal_cage_01_a;                              // 0xae8(0x8)
	class StaticMeshComponent*                                   cap_mirror_01_a;                                   // 0xaf0(0x8)
	class StaticMeshComponent*                                   cap_curtain_smp_01_a;                              // 0xaf8(0x8)
	class StaticMeshComponent*                                   cap_cage_02_a;                                     // 0xb00(0x8)
	class StaticMeshComponent*                                   cap_cage_01_b;                                     // 0xb08(0x8)
	class StaticMeshComponent*                                   cap_cage_01_a;                                     // 0xb10(0x8)
	class StaticMeshComponent*                                   bld_shop_rug_01_a3;                                // 0xb18(0x8)
	class StaticMeshComponent*                                   cap_cabinet_02_a;                                  // 0xb20(0x8)
	class StaticMeshComponent*                                   cap_cabin_books_03_a;                              // 0xb28(0x8)
	class StaticMeshComponent*                                   cap_cabin_books_02_a;                              // 0xb30(0x8)
	class StaticMeshComponent*                                   cap_cabin_books_01_a;                              // 0xb38(0x8)
	class StaticMeshComponent*                                   bld_shop_rug_01_a2;                                // 0xb40(0x8)
	class StaticMeshComponent*                                   bld_shop_rug_01_a1;                                // 0xb48(0x8)
	class StaticMeshComponent*                                   bld_shop_rug_01_a;                                 // 0xb50(0x8)
	class StaticMeshComponent*                                   bld_tvn_post_01_d2;                                // 0xb58(0x8)
	class StaticMeshComponent*                                   bld_tvn_post_01_d1;                                // 0xb60(0x8)
	class StaticMeshComponent*                                   bld_tvn_post_01_d;                                 // 0xb68(0x8)
	class StaticMeshComponent*                                   bld_tvn_animal_rug_01_a;                           // 0xb70(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_hanging_glass_balls_01_a;             // 0xb78(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_03_a;                            // 0xb80(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_01_a2;                           // 0xb88(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_01_a1;                           // 0xb90(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_01_a;                            // 0xb98(0x8)
	class StaticMeshComponent*                                   bld_shop_wind_chime_prm_01_b1;                     // 0xba0(0x8)
	class StaticMeshComponent*                                   bld_shop_wind_chime_prm_01_b;                      // 0xba8(0x8)
	class StaticMeshComponent*                                   bld_shop_wind_chime_prm_01_a;                      // 0xbb0(0x8)
	class StaticMeshComponent*                                   bld_shop_sign_ancient_01_b2;                       // 0xbb8(0x8)
	class StaticMeshComponent*                                   bld_shop_sign_ancient_01_b1;                       // 0xbc0(0x8)
	class StaticMeshComponent*                                   bld_shop_sign_ancient_01_b;                        // 0xbc8(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_04_a;                              // 0xbd0(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_02_a2;                             // 0xbd8(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_02_a1;                             // 0xbe0(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_02_a;                              // 0xbe8(0x8)
	class StaticMeshComponent*                                   bld_shop_cloth_ancient_01_a2;                      // 0xbf0(0x8)
	class StaticMeshComponent*                                   bld_shop_cloth_ancient_01_a1;                      // 0xbf8(0x8)
	class StaticMeshComponent*                                   bld_shop_cloth_ancient_01_a;                       // 0xc00(0x8)
	class StaticMeshComponent*                                   bld_shop_bird_ladder_prm_01_b1;                    // 0xc08(0x8)
	class StaticMeshComponent*                                   bld_shop_bird_ladder_prm_01_b;                     // 0xc10(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_window_01_a6;                         // 0xc18(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_window_01_a5;                         // 0xc20(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_window_01_a4;                         // 0xc28(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_window_01_a3;                         // 0xc30(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_window_01_a2;                         // 0xc38(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_window_01_a1;                         // 0xc40(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_window_01_a;                          // 0xc48(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_door_frame_02_b;                      // 0xc50(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_door_frame_02_a;                      // 0xc58(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_door_frame_01_a3;                     // 0xc60(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_door_frame_01_a2;                     // 0xc68(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_door_frame_01_a1;                     // 0xc70(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_door_frame_01_a;                      // 0xc78(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_door_01_a5;                           // 0xc80(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_door_01_a4;                           // 0xc88(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_door_01_a3;                           // 0xc90(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_door_01_a2;                           // 0xc98(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_door_01_a1;                           // 0xca0(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_door_01_a;                            // 0xca8(0x8)
	class StaticMeshComponent*                                   bld_pot_shop_chimney_01_b;                         // 0xcb0(0x8)
	class StaticMeshComponent*                                   bld_int_wall_coat_rack_03_a;                       // 0xcb8(0x8)
	class StaticMeshComponent*                                   bld_int_wall_coat_rack_01_a;                       // 0xcc0(0x8)
	class StaticMeshComponent*                                   bld_int_stool_01_a1;                               // 0xcc8(0x8)
	class StaticMeshComponent*                                   bld_int_stool_01_a;                                // 0xcd0(0x8)
	class StaticMeshComponent*                                   bld_int_large_shelves_01_a;                        // 0xcd8(0x8)
	class StaticMeshComponent*                                   bld_int_small_shelf_02_a;                          // 0xce0(0x8)
	class StaticMeshComponent*                                   bld_int_four_shelves_01_a;                         // 0xce8(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_mannequin_01_a4;                      // 0xcf0(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_mannequin_05_a1;                      // 0xcf8(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_mannequin_05_a;                       // 0xd00(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_mannequin_04_a;                       // 0xd08(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_mannequin_02_a;                       // 0xd10(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_mannequin_01_a;                       // 0xd18(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_head_stand_01_a3;                     // 0xd20(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_head_stand_01_a2;                     // 0xd28(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_head_stand_01_a1;                     // 0xd30(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_head_stand_01_a;                      // 0xd38(0x8)
	class SpotLightComponent*                                    LightComponent09;                                  // 0xd40(0x8)
	class SpotLightComponent*                                    LightComponent08;                                  // 0xd48(0x8)
	class SpotLightComponent*                                    LightComponent07;                                  // 0xd50(0x8)
	class SpotLightComponent*                                    LightComponent06;                                  // 0xd58(0x8)
	class SpotLightComponent*                                    LightComponent05;                                  // 0xd60(0x8)
	class PointLightComponent*                                   LightComponent04;                                  // 0xd68(0x8)
	class PointLightComponent*                                   LightComponent03;                                  // 0xd70(0x8)
	class PointLightComponent*                                   LightComponent02;                                  // 0xd78(0x8)
	class PointLightComponent*                                   LightComponent01;                                  // 0xd80(0x8)
	class PointLightComponent*                                   LightComponent0;                                   // 0xd88(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0xd90(0x8)
};


}