// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xd0 (Full Size[0x498] - InheritedSize[0x3c8]
class BP_sod_bld_tvn_ngs_fancypiratecode_01_a_C: public Actor
{
public:
	class ParticleSystemComponent*                               ParticleSystemComponent02;                         // 0x3c8(0x8)
	class ParticleSystemComponent*                               ParticleSystemComponent01;                         // 0x3d0(0x8)
	class ParticleSystemComponent*                               ParticleSystemComponent0;                          // 0x3d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x3e0(0x8)
	class SpotLightComponent*                                    LightComponent02;                                  // 0x3e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x3f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x3f8(0x8)
	class PointLightComponent*                                   LightComponent01;                                  // 0x400(0x8)
	class PointLightComponent*                                   LightComponent0;                                   // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x440(0x8)
	class DecalComponent*                                        NewDecalComponent;                                 // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x458(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x460(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x470(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x478(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x488(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x490(0x8)
};


}