// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x50 (Full Size[0x8c8] - InheritedSize[0x878]
class BP_SmallShip_QuestTable_C: public VoyageTable
{
public:
	Class ChildActorComponent*                                   None;                                              // 0x878(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x880(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x888(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x890(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x898(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x8a0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x8a8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x8b0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x8b8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x8c0(0x8)
};


}