// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x34 (Full Size[0x3fc] - InheritedSize[0x3c8]
class BP_ship_surface_wet_decal_C: public ShipResurfaceWetnessActor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3c8(0x8)
	Class DecalComponent*                                        None;                                              // 0x3d0(0x8)
	Class DecalComponent*                                        None;                                              // 0x3d8(0x8)
	Class SceneComponent*                                        None;                                              // 0x3e0(0x8)
	float                                                        None;                                              // 0x3e8(0x4)
	char                                                         pad0x4_HMUD3[0x4];                                 // 0x3ec(0x4)
	Class MaterialInstanceDynamic*                               None;                                              // 0x3f0(0x8)
	Struct TimerHandle                                           None;                                              // 0x3f8(0x4)
};


}