// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68
class BP_SmallShip_Mast_C: public None
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0xa38(0x8)
	Class ChildActorComponent*                                   None;                                              // 0xa40(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa48(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa50(0x8)
	Class ChildActorComponent*                                   None;                                              // 0xa58(0x8)
	Class ChildActorComponent*                                   None;                                              // 0xa60(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa68(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa70(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa78(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa80(0x8)
	Class ChildActorComponent*                                   None;                                              // 0xa88(0x8)
	Class ChildActorComponent*                                   None;                                              // 0xa90(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xa98(0x8)
};


}