// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x55
class BP_SmallMapTable_C: public MapTable
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x790(0x8)
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentCom* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x798(0x8)
	Class BoxComponent*                                          NavBlocker;                                        // 0x7a0(0x8)
	Class ChildActorComponent*                                   ControlPoint;                                      // 0x7a8(0x8)
	Class ChildActorComponent*                                   ControlPoint;                                      // 0x7b0(0x8)
	Class ChildActorComponent*                                   ControlPoint;                                      // 0x7b8(0x8)
	Class ChildActorComponent*                                   ControlPoint;                                      // 0x7c0(0x8)
	Class TextureFeedbackComponent*                              TextureFeedback;                                   // 0x7c8(0x8)
	Class StaticMeshComponent*                                   Cube;                                              // 0x7d0(0x8)
	Class StaticMeshComponent*                                   Map;                                               // 0x7d8(0x8)
	float                                                        ActiveRange;                                       // 0x7e0(0x4)
	bool                                                         IsActive;                                          // 0x7e4(0x1)
};


}