// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1f8 (Full Size[0x5c0] - InheritedSize[0x3c8]
class BP_sod_bld_out_ext_dressing_01_a_C: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMesh1;                                       // 0x3c8(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x3d0(0x8)
	class BoxComponent*                                          Box4;                                              // 0x3d8(0x8)
	class BoxComponent*                                          Box3;                                              // 0x3e0(0x8)
	class BoxComponent*                                          Box2;                                              // 0x3e8(0x8)
	class BoxComponent*                                          Box1;                                              // 0x3f0(0x8)
	class BoxComponent*                                          Box;                                               // 0x3f8(0x8)
	class DecalComponent*                                        NewDecalComponent;                                 // 0x400(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent054;                            // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent053;                            // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent052;                            // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent051;                            // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent050;                            // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent049;                            // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent048;                            // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent047;                            // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent046;                            // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent045;                            // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent044;                            // 0x458(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent043;                            // 0x460(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent041;                            // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent040;                            // 0x470(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent039;                            // 0x478(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent038;                            // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent037;                            // 0x488(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent036;                            // 0x490(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent035;                            // 0x498(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent034;                            // 0x4a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent033;                            // 0x4a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent032;                            // 0x4b0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent031;                            // 0x4b8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent030;                            // 0x4c0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent029;                            // 0x4c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent028;                            // 0x4d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent027;                            // 0x4d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent026;                            // 0x4e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent025;                            // 0x4e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent024;                            // 0x4f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent023;                            // 0x4f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0x500(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent021;                            // 0x508(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent020;                            // 0x510(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0x518(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0x520(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x528(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x530(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x538(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x540(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x548(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x550(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x558(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x560(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x568(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x570(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x578(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x580(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x588(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x590(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x598(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x5a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x5a8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x5b0(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x5b8(0x8)
};


}