// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60
class BP_Shipwright_C: public NPC
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x680(0x8)
	Class NamedNPCComponent*                                     NamedNPC;                                          // 0x688(0x8)
	Class CargoRunParticipantComponent*                          CargoRunParticipant;                               // 0x690(0x8)
	Class NPCDialogComponent*                                    NPCDialogComponent;                                // 0x698(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x6a0(0x8)
	Class CapsuleComponent*                                      SolidHits;                                         // 0x6a8(0x8)
	Struct WwiseEmitter                                          WwiseEmitter;                                      // 0x6b0(0x20)
	Class WwiseEvent*                                            WwiseShipwrightHummingPlay;                        // 0x6d0(0x8)
	Class WwiseEvent*                                            WwiseShipwrightHummingStop;                        // 0x6d8(0x8)
};


}