// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20 (Full Size[0xc50] - InheritedSize[0xc30]
class BP_SoveriegnHarpoonLauncher_2_C: public HarpoonLauncher
{
public:
	Class HarpoonItemLocationComponent*                          None;                                              // 0xc30(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc38(0x8)
	Class CapsuleComponent*                                      None;                                              // 0xc40(0x8)
	Class CapsuleComponent*                                      None;                                              // 0xc48(0x8)
};


// Size 0x20 (Full Size[0xc50] - InheritedSize[0xc30]
class BP_SoveriegnHarpoonLauncher_C: public HarpoonLauncher
{
public:
	Class HarpoonItemLocationComponent*                          None;                                              // 0xc30(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xc38(0x8)
	Class CapsuleComponent*                                      None;                                              // 0xc40(0x8)
	Class CapsuleComponent*                                      None;                                              // 0xc48(0x8)
};


}