// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x34 (Full Size[0x3fc] - InheritedSize[0x3c8]
class BP_ship_surface_wet_decal_C: public ShipResurfaceWetnessActor
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3c8(0x8)
	class DecalComponent*                                        WetDecalStarboard;                                 // 0x3d0(0x8)
	class DecalComponent*                                        WetDecalPort;                                      // 0x3d8(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x3e0(0x8)
	float                                                        WetEffectDuration;                                 // 0x3e8(0x4)
	char                                                         pad0x4_IXVHT[0x4];                                 // 0x3ec(0x4)
	class MaterialInstanceDynamic*                               WetDynamicMaterial;                                // 0x3f0(0x8)
	struct TimerHandle                                           WetTimerHandle;                                    // 0x3f8(0x4)
};


}