// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20 (Full Size[0xcd0] - InheritedSize[0xcb0]
class BP_SoveriegnHarpoonLauncher_2_C: public HarpoonLauncher
{
public:
	Class HarpoonItemLocationComponent*                          None;                                              // 0xcb0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xcb8(0x8)
	Class CapsuleComponent*                                      None;                                              // 0xcc0(0x8)
	Class CapsuleComponent*                                      None;                                              // 0xcc8(0x8)
};


// Size 0x20 (Full Size[0xcd0] - InheritedSize[0xcb0]
class BP_SoveriegnHarpoonLauncher_C: public HarpoonLauncher
{
public:
	Class HarpoonItemLocationComponent*                          None;                                              // 0xcb0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0xcb8(0x8)
	Class CapsuleComponent*                                      None;                                              // 0xcc0(0x8)
	Class CapsuleComponent*                                      None;                                              // 0xcc8(0x8)
};


}