// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x49 (Full Size[0x4b9] - InheritedSize[0x470]
class BP_SKD_ShrineShimmer_C: public ShimmerActor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x470(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x478(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x480(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x488(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x490(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x498(0x8)
	Class SceneComponent*                                        None;                                              // 0x4a0(0x8)
	float                                                        None;                                              // 0x4a8(0x4)
	byte                                                         None;                                              // 0x4ac(0x1)
	char                                                         pad0x3_BUVUM[0x3];                                 // 0x4ad(0x3)
	Class TimelineComponent*                                     None;                                              // 0x4b0(0x8)
	bool                                                         None;                                              // 0x4b8(0x1)
};


}