// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x750
class BP_tavern_BSP_01_b_C: public Actor
{
public:
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Bannister_Outside;                            // 0x3c8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Bannister_Outside;                            // 0x3d0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Bannister_Outside;                            // 0x3d8(0x8)
	Class ChildActorComponent*                                   TavernTrinketMountpoints;                          // 0x3e0(0x8)
	Class SpotLightComponent*                                    SpotLight9;                                        // 0x3e8(0x8)
	Class StaticMeshComponent*                                   Stool_IntroTable;                                  // 0x3f0(0x8)
	Class StaticMeshComponent*                                   Stool_IntroTable;                                  // 0x3f8(0x8)
	Class StaticMeshComponent*                                   Stool_IntroTable;                                  // 0x400(0x8)
	Class StaticMeshComponent*                                   tls_lantern_01_e;                                  // 0x408(0x8)
	Class SpotLightComponent*                                    SpotLight8;                                        // 0x410(0x8)
	Class BoxComponent*                                          NavMeshBlocker8;                                   // 0x418(0x8)
	Class SpotLightComponent*                                    SpotLight7;                                        // 0x420(0x8)
	Class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x428(0x8)
	Class StaticMeshComponent*                                   RainBlockerUnderground;                            // 0x430(0x8)
	Class BoxComponent*                                          NavMeshBlocker7;                                   // 0x438(0x8)
	Class BoxComponent*                                          NavMeshBlocker6;                                   // 0x440(0x8)
	Class BoxComponent*                                          NavMesh Blocker5;                                  // 0x448(0x8)
	Class BoxComponent*                                          NavMesh Blocker4;                                  // 0x450(0x8)
	Class BoxComponent*                                          NavMesh Blocker3;                                  // 0x458(0x8)
	Class BoxComponent*                                          NavMesh Blocker2;                                  // 0x460(0x8)
	Class BoxComponent*                                          NavMesh Blocker;                                   // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x470(0x8)
	Class BoxComponent*                                          Roof_collison;                                     // 0x478(0x8)
	Class ChildActorComponent*                                   Onboarding Intro Table;                            // 0x480(0x8)
	Class SpotLightComponent*                                    SpotLight6;                                        // 0x488(0x8)
	Class SpotLightComponent*                                    SpotLight5;                                        // 0x490(0x8)
	Class StaticMeshComponent*                                   bld_tvn_entrance_01_a;                             // 0x498(0x8)
	Class ChildActorComponent*                                   BP_MusicBox;                                       // 0x4a0(0x8)
	Class ChildActorComponent*                                   BP_Island_Bell;                                    // 0x4a8(0x8)
	Class StaticMeshComponent*                                   cmn_wooden_crate_01_b;                             // 0x4b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x4b8(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x4c0(0x8)
	Class ChildActorComponent*                                   BP_OutpostCrate_cmn_wooden_crate_01_a;             // 0x4c8(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x4d0(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x4d8(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x4e0(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x4e8(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x4f0(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x4f8(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x500(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x508(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x510(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x518(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost;                    // 0x520(0x8)
	Class StaticMeshComponent*                                   Rain_Blocker;                                      // 0x528(0x8)
	Class StaticMeshComponent*                                   cmn_wheel_01_a__cmn_wheel_01_a;                    // 0x530(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x538(0x8)
	Class SpotLightComponent*                                    SpotLight2;                                        // 0x540(0x8)
	Class SpotLightComponent*                                    SpotLight;                                         // 0x548(0x8)
	Class PointLightComponent*                                   PointLight10;                                      // 0x550(0x8)
	Class PointLightComponent*                                   PointLight9;                                       // 0x558(0x8)
	Class PointLightComponent*                                   PointLight3;                                       // 0x560(0x8)
	Class ChildActorComponent*                                   ChildActor8;                                       // 0x568(0x8)
	Class ChildActorComponent*                                   ChildActor7;                                       // 0x570(0x8)
	Class ChildActorComponent*                                   ChildActor5;                                       // 0x578(0x8)
	Class ChildActorComponent*                                   ChildActor4;                                       // 0x580(0x8)
	Class ChildActorComponent*                                   ChildActor3;                                       // 0x588(0x8)
	Class ChildActorComponent*                                   ChildActor2;                                       // 0x590(0x8)
	Class ChildActorComponent*                                   ChildActor1;                                       // 0x598(0x8)
	Class ChildActorComponent*                                   ChildActor;                                        // 0x5a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh58;                                      // 0x5a8(0x8)
	Class StaticMeshComponent*                                   shp_int_hook_01_a;                                 // 0x5b0(0x8)
	Class StaticMeshComponent*                                   shp_fry_pan_01_a1;                                 // 0x5b8(0x8)
	Class StaticMeshComponent*                                   cmn_animal_cage_01_a;                              // 0x5c0(0x8)
	Class StaticMeshComponent*                                   cmn_pirate_grave_01_c;                             // 0x5c8(0x8)
	Class StaticMeshComponent*                                   cmn_pirate_grave_01_a;                             // 0x5d0(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a;                                   // 0x5d8(0x8)
	Class PointLightComponent*                                   PointLight12;                                      // 0x5e0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem12;                                  // 0x5e8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem8;                                   // 0x5f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh49;                                      // 0x5f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh48;                                      // 0x600(0x8)
	Class StaticMeshComponent*                                   StaticMesh47;                                      // 0x608(0x8)
	Class PointLightComponent*                                   PointLight5;                                       // 0x610(0x8)
	Class StaticMeshComponent*                                   StaticMesh46;                                      // 0x618(0x8)
	Class StaticMeshComponent*                                   StaticMesh45;                                      // 0x620(0x8)
	Class StaticMeshComponent*                                   StaticMesh42;                                      // 0x628(0x8)
	Class StaticMeshComponent*                                   StaticMesh41;                                      // 0x630(0x8)
	Class StaticMeshComponent*                                   StaticMesh40;                                      // 0x638(0x8)
	Class StaticMeshComponent*                                   StaticMesh39;                                      // 0x640(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_03_a;                              // 0x648(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_01_a;                              // 0x650(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_aged_01_a;                         // 0x658(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_02_a;                              // 0x660(0x8)
	Class StaticMeshComponent*                                   StaticMesh35;                                      // 0x668(0x8)
	Class StaticMeshComponent*                                   StaticMesh34;                                      // 0x670(0x8)
	Class StaticMeshComponent*                                   StaticMesh32;                                      // 0x678(0x8)
	Class StaticMeshComponent*                                   StaticMesh22;                                      // 0x680(0x8)
	Class StaticMeshComponent*                                   StaticMesh20;                                      // 0x688(0x8)
	Class StaticMeshComponent*                                   StaticMesh19;                                      // 0x690(0x8)
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x698(0x8)
	Class StaticMeshComponent*                                   StaticMesh15;                                      // 0x6a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh14;                                      // 0x6a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x6b0(0x8)
	Class StaticMeshComponent*                                   cap_book_stand_01_a;                               // 0x6b8(0x8)
	Class StaticMeshComponent*                                   shp_rifle_rack_01_a;                               // 0x6c0(0x8)
	Class StaticMeshComponent*                                   shp_pistol_rack_01_a;                              // 0x6c8(0x8)
	Class ChildActorComponent*                                   bp_lantern_hook_01_a2;                             // 0x6d0(0x8)
	Class ChildActorComponent*                                   bp_lantern_hook_01_a;                              // 0x6d8(0x8)
	Class PointLightComponent*                                   PointLight11;                                      // 0x6e0(0x8)
	Class SpotLightComponent*                                    SpotLight4;                                        // 0x6e8(0x8)
	Class SpotLightComponent*                                    SpotLight3;                                        // 0x6f0(0x8)
	Class SpotLightComponent*                                    SpotLight1;                                        // 0x6f8(0x8)
	Class PointLightComponent*                                   PointLight8;                                       // 0x700(0x8)
	Class PointLightComponent*                                   PointLight7;                                       // 0x708(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x710(0x8)
	Class ChildActorComponent*                                   BP_Tavern_B_AudioLayer;                            // 0x718(0x8)
	Class PostProcessComponent*                                  Post_Interior;                                     // 0x720(0x8)
	Class BoxComponent*                                          PostProcess;                                       // 0x728(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x730(0x8)
	Class PointLightComponent*                                   PointLight6;                                       // 0x738(0x8)
	Class PointLightComponent*                                   PointLight4;                                       // 0x740(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x748(0x8)
	Class ParticleSystemComponent*                               vfx_fireplace_tavern;                              // 0x750(0x8)
	Class StaticMeshComponent*                                   cap_skull_candle_01_a;                             // 0x758(0x8)
	Class StaticMeshComponent*                                   StaticMesh54;                                      // 0x760(0x8)
	Class StaticMeshComponent*                                   StaticMesh50;                                      // 0x768(0x8)
	Class StaticMeshComponent*                                   StaticMesh44;                                      // 0x770(0x8)
	Class StaticMeshComponent*                                   StaticMesh43;                                      // 0x778(0x8)
	Class StaticMeshComponent*                                   gmp_mess_bot_01_a;                                 // 0x780(0x8)
	Class StaticMeshComponent*                                   StaticMesh38;                                      // 0x788(0x8)
	Class StaticMeshComponent*                                   fod_rum_01_a;                                      // 0x790(0x8)
	Class StaticMeshComponent*                                   StaticMesh36;                                      // 0x798(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_02_a;                                // 0x7a0(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_03_a;                                // 0x7a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh31;                                      // 0x7b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh30;                                      // 0x7b8(0x8)
	Class StaticMeshComponent*                                   StaticMesh29;                                      // 0x7c0(0x8)
	Class StaticMeshComponent*                                   StaticMesh27;                                      // 0x7c8(0x8)
	Class StaticMeshComponent*                                   shp_fry_pan_01_a;                                  // 0x7d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh23;                                      // 0x7d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh21;                                      // 0x7e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x7e8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem10;                                  // 0x7f0(0x8)
	Class StaticMeshComponent*                                   cmn_step_ladder_01_a;                              // 0x7f8(0x8)
	Class StaticMeshComponent*                                   cmn_rowboat_oar_01_a;                              // 0x800(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_table_01_a;                            // 0x808(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x810(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_shelf_02_a;                            // 0x818(0x8)
	Class StaticMeshComponent*                                   cmn_wheel_01_a;                                    // 0x820(0x8)
	Class SpotLightComponent*                                    Light_fire;                                        // 0x828(0x8)
	Class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x830(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x838(0x8)
	Class PointLightComponent*                                   light_candle;                                      // 0x840(0x8)
	Class StaticMeshComponent*                                   candle;                                            // 0x848(0x8)
	Class SpotLightComponent*                                    light_ceiling;                                     // 0x850(0x8)
	Class SpotLightComponent*                                    light_ceiling;                                     // 0x858(0x8)
	Class PointLightComponent*                                   light_candle;                                      // 0x860(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x868(0x8)
	Class PointLightComponent*                                   light_candle;                                      // 0x870(0x8)
	Class PointLightComponent*                                   light_candle;                                      // 0x878(0x8)
	Class PointLightComponent*                                   light_candle;                                      // 0x880(0x8)
	Class ParticleSystemComponent*                               ParticleSystem9;                                   // 0x888(0x8)
	Class ParticleSystemComponent*                               ParticleSystem7;                                   // 0x890(0x8)
	Class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x898(0x8)
	Class PointLightComponent*                                   Light_lantern;                                     // 0x8a0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x8a8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x8b0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x8b8(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_torch_looping_03;                       // 0x8c0(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_torch_looping_02;                       // 0x8c8(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_torch_looping_01;                       // 0x8d0(0x8)
	Class StaticMeshComponent*                                   bld_tavern_tile_beams_01_a;                        // 0x8d8(0x8)
	Class StaticMeshComponent*                                   bld_tavern_porch_01_a;                             // 0x8e0(0x8)
	Class StaticMeshComponent*                                   bld_tavern_floor_01_a;                             // 0x8e8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bench_01_a2;                               // 0x8f0(0x8)
	Class StaticMeshComponent*                                   cmn_rug_01_a1;                                     // 0x8f8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_interior_stairs_01_a;                      // 0x900(0x8)
	Class StaticMeshComponent*                                   bld_tvn_drapes_01_a;                               // 0x908(0x8)
	Class StaticMeshComponent*                                   bld_tvn_chimney_awning_01_a;                       // 0x910(0x8)
	Class StaticMeshComponent*                                   bld_tvn_wood_details_01_b;                         // 0x918(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_c;                                   // 0x920(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_d;                                   // 0x928(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_e;                                   // 0x930(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_b_02;                       // 0x938(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_a;                          // 0x940(0x8)
	Class StaticMeshComponent*                                   bld_tvn_beam_sail_cloth_01_b;                      // 0x948(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_arches_01_a;                           // 0x950(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_top_01_a;                              // 0x958(0x8)
	Class StaticMeshComponent*                                   bld_tvn_chandelier_01_a;                           // 0x960(0x8)
	Class StaticMeshComponent*                                   bld_tvn_ceiling_rose_01_a;                         // 0x968(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_b;                          // 0x970(0x8)
	Class StaticMeshComponent*                                   bld_tvn_roof_window_01_a;                          // 0x978(0x8)
	Class StaticMeshComponent*                                   bld_tvn_veranda_01_a;                              // 0x980(0x8)
	Class StaticMeshComponent*                                   bld_tvn_stone_chimney_top_01_a;                    // 0x988(0x8)
	Class StaticMeshComponent*                                   bld_tvn_stone_chimney_base_01_a;                   // 0x990(0x8)
	Class StaticMeshComponent*                                   bld_tvn_sign_pole_01_a;                            // 0x998(0x8)
	Class StaticMeshComponent*                                   bld_tvn_roof_window_01_a;                          // 0x9a0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_metal_chimney_01_a;                        // 0x9a8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_exterior_stairs_01_a;                      // 0x9b0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_chandelier_01_a;                           // 0x9b8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_ceiling_rose_01_a;                         // 0x9c0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_racks_01_a;                            // 0x9c8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_base_01_a;                             // 0x9d0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_b;                          // 0x9d8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_a;                          // 0x9e0(0x8)
	Class StaticMeshComponent*                                   bld_tavern_roof_01_a;                              // 0x9e8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_rug_01_a2;                                 // 0x9f0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_rug_01_a1;                                 // 0x9f8(0x8)
	Class StaticMeshComponent*                                   cmn_stool_01_a3;                                   // 0xa00(0x8)
	Class StaticMeshComponent*                                   cmn_stool_01_a1;                                   // 0xa08(0x8)
	Class StaticMeshComponent*                                   bld_tvn_post_01_c1;                                // 0xa10(0x8)
	Class StaticMeshComponent*                                   bld_tvn_post_01_c;                                 // 0xa18(0x8)
	Class StaticMeshComponent*                                   bld_tvn_post_01_b;                                 // 0xa20(0x8)
	Class StaticMeshComponent*                                   bld_tvn_rug_01_a;                                  // 0xa28(0x8)
	Class StaticMeshComponent*                                   bld_tvn_animal_rug_01_a;                           // 0xa30(0x8)
	Class StaticMeshComponent*                                   cmn_stool_01_a;                                    // 0xa38(0x8)
	Class StaticMeshComponent*                                   bld_tvn_beam_sail_cloth_01_a;                      // 0xa40(0x8)
	Class StaticMeshComponent*                                   bld_tvn_post_01_a;                                 // 0xa48(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bench_01_a1;                               // 0xa50(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bench_01_a;                                // 0xa58(0x8)
	Class StaticMeshComponent*                                   bld_tvn_low_arch_01_a;                             // 0xa60(0x8)
	Class StaticMeshComponent*                                   bld_tvn_entrance_boat_01_a;                        // 0xa68(0x8)
	Class StaticMeshComponent*                                   bld_tvn_round_table_01_a;                          // 0xa70(0x8)
	Class StaticMeshComponent*                                   bld_tvn_table_01_a;                                // 0xa78(0x8)
	Class StaticMeshComponent*                                   bld_tvn_exterior_door_01_a2;                       // 0xa80(0x8)
	Class StaticMeshComponent*                                   bld_tvn_wood_holder_01_a;                          // 0xa88(0x8)
	Class StaticMeshComponent*                                   bld_tvn_fireplace_grate_01_a;                      // 0xa90(0x8)
	Class StaticMeshComponent*                                   bld_tvn_exterior_door_01_a1;                       // 0xa98(0x8)
	Class StaticMeshComponent*                                   bld_tvn_exterior_door_01_a;                        // 0xaa0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_window_01_b5;                              // 0xaa8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_window_01_b4;                              // 0xab0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_window_01_b3;                              // 0xab8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_window_01_a1;                              // 0xac0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_window_01_b2;                              // 0xac8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_window_01_b1;                              // 0xad0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_window_01_b;                               // 0xad8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_window_01_c;                               // 0xae0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_window_01_a;                               // 0xae8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_fireplace_rail_01_a;                       // 0xaf0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_fireplace_plinth_01_a;                     // 0xaf8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_fireplace_surround_01_a;                   // 0xb00(0x8)
	Class StaticMeshComponent*                                   bld_tavern_01_a;                                   // 0xb08(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0xb10(0x8)
};


}