#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x48 (Full Size[0x3e8] - InheritedSize[0x3a0]
class BP_Tavern_B_AudioLayer_C: public Actor
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3a0(0x8)
	char                                                         pad0x6d2678d8_U7OZE[0x6d2678d8];                   // 0x3a8(0x6d2678d8)
	class TritonComponent*                                       Triton;                                            // 0x3a8(0x8)
	class WwiseEmitterComponent*                                 Fire;                                              // 0x3b0(0x8)
	class AudioSpaceComponent*                                   Tavern_AudioSpace_EdgeSection;                     // 0x3b8(0x8)
	class AudioSpaceComponent*                                   Tavern_AudioSpace_LargeSection;                    // 0x3c0(0x8)
	class AudioPortalComponent*                                  Tavern_AudioPortal;                                // 0x3c8(0x8)
	class SceneComponent*                                        Scene;                                             // 0x3d0(0x8)
	class WwiseEvent*                                            TavernFire_Play;                                   // 0x3d8(0x8)
	class WwiseEvent*                                            TavernFire_Stop;                                   // 0x3e0(0x8)
};


