// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x200 (Full Size[0x5c8] - InheritedSize[0x3c8]
class BP_trn_shop_bsp_01_a_C: public Actor
{
public:
	Class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3c8(0x8)
	Class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x3d0(0x8)
	Class StaticMeshComponent*                                   bsp_trn_shop_dressing_01_b;                        // 0x3d8(0x8)
	Class StaticMeshComponent*                                   bsp_trn_shop_dressing_01_a;                        // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh38;                                      // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh37;                                      // 0x3f0(0x8)
	Class StaticMeshComponent*                                   bld_trn_shop_hanging_sign_01_a;                    // 0x3f8(0x8)
	Class SpotLightComponent*                                    SpotLight3;                                        // 0x400(0x8)
	Class SpotLightComponent*                                    SpotLight2;                                        // 0x408(0x8)
	Class ChildActorComponent*                                   BP_MusicBox;                                       // 0x410(0x8)
	Class ChildActorComponent*                                   BP_IslandEquipmentChest;                           // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh36;                                      // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh35;                                      // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh34;                                      // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh29;                                      // 0x438(0x8)
	Class SpotLightComponent*                                    SpotLight1;                                        // 0x440(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0x448(0x8)
	Class BoxComponent*                                          Box;                                               // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMesh17;                                      // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMesh15;                                      // 0x460(0x8)
	Class SpotLightComponent*                                    SpotLight;                                         // 0x468(0x8)
	Class PointLightComponent*                                   PointLight3;                                       // 0x470(0x8)
	Class ChildActorComponent*                                   ChildActor2;                                       // 0x478(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x480(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x488(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x490(0x8)
	Class StaticMeshComponent*                                   StaticMesh33;                                      // 0x498(0x8)
	Class StaticMeshComponent*                                   StaticMesh32;                                      // 0x4a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh31;                                      // 0x4a8(0x8)
	Class StaticMeshComponent*                                   cmn_rope_04_c;                                     // 0x4b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh30;                                      // 0x4b8(0x8)
	Class StaticMeshComponent*                                   cmn_rope_end_05_a;                                 // 0x4c0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x4c8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x4d0(0x8)
	Class ChildActorComponent*                                   ChildActor1;                                       // 0x4d8(0x8)
	Class ChildActorComponent*                                   ChildActor;                                        // 0x4e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x4e8(0x8)
	Class StaticMeshComponent*                                   cmn_lantern_01_a;                                  // 0x4f0(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x4f8(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x500(0x8)
	Class StaticMeshComponent*                                   bld_shop_drapes_03_a;                              // 0x508(0x8)
	Class StaticMeshComponent*                                   bld_trn_shop_hanging_glass_balls_01_a;             // 0x510(0x8)
	Class StaticMeshComponent*                                   bld_trn_shop_interior_cloth_01_a;                  // 0x518(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x520(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x528(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x530(0x8)
	Class StaticMeshComponent*                                   cmn_oar_01_a;                                      // 0x538(0x8)
	Class StaticMeshComponent*                                   cmn_wheel_01_a;                                    // 0x540(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_shelf_02_a;                            // 0x548(0x8)
	Class StaticMeshComponent*                                   cmn_looted_box_01_a;                               // 0x550(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_03_a1;                           // 0x558(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_03_a;                            // 0x560(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x568(0x8)
	Class StaticMeshComponent*                                   Rug;                                               // 0x570(0x8)
	Class StaticMeshComponent*                                   Barrel;                                            // 0x578(0x8)
	Class StaticMeshComponent*                                   bld_shop_table_01_a;                               // 0x580(0x8)
	Class ChildActorComponent*                                   AudioSpace;                                        // 0x588(0x8)
	Class StaticMeshComponent*                                   bld_trn_roof_beam_01_a;                            // 0x590(0x8)
	Class StaticMeshComponent*                                   bld_trn_shop_window_01_b2;                         // 0x598(0x8)
	Class StaticMeshComponent*                                   bld_trn_shop_window_01_b1;                         // 0x5a0(0x8)
	Class StaticMeshComponent*                                   bld_trn_shop_window_01_b;                          // 0x5a8(0x8)
	Class StaticMeshComponent*                                   bld_trn_shop_door_01_a;                            // 0x5b0(0x8)
	Class StaticMeshComponent*                                   bld_trn_shop_01_a;                                 // 0x5b8(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x5c0(0x8)
};


}