// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x45 (Full Size[0x40d] - InheritedSize[0x3c8]
class BP_TreasuryWaveMusic_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3c8(0x8)
	Class MusicZoneComponent*                                    None;                                              // 0x3d0(0x8)
	struct FName                                                 None;                                              // 0x3d8(0x8)
	struct FName                                                 None;                                              // 0x3e0(0x8)
	struct FName                                                 None;                                              // 0x3e8(0x8)
	bool                                                         None;                                              // 0x3f0(0x1)
	bool                                                         None;                                              // 0x3f1(0x1)
	bool                                                         None;                                              // 0x3f2(0x1)
	char                                                         pad0x1_AZC1R[0x1];                                 // 0x3f3(0x1)
	struct FName                                                 None;                                              // 0x3f4(0x8)
	struct FName                                                 None;                                              // 0x3fc(0x8)
	struct FName                                                 None;                                              // 0x404(0x8)
	bool                                                         None;                                              // 0x40c(0x1)
};


}