#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x58 (Full Size[0x3f8] - InheritedSize[0x3a0]
class BP_tavern_frontend_01_a_C: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x3a0(0x8)
	class StaticMeshComponent*                                   trs_chest_coins_03_a;                              // 0x3a8(0x8)
	class StaticMeshComponent*                                   trs_chest_01_c_vc;                                 // 0x3b0(0x8)
	class StaticMeshComponent*                                   trs_chest_01_b_vc;                                 // 0x3b8(0x8)
	class StaticMeshComponent*                                   trs_chest_01_d_vc;                                 // 0x3c0(0x8)
	class StaticMeshComponent*                                   trs_chest_01_a_vc;                                 // 0x3c8(0x8)
	class StaticMeshComponent*                                   shp_rope_coil_03_a3;                               // 0x3d0(0x8)
	class StaticMeshComponent*                                   cmn_stool_01_a4;                                   // 0x3d8(0x8)
	class StaticMeshComponent*                                   shp_rope_coil_03_a;                                // 0x3e0(0x8)
	class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x3e8(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x3f0(0x8)
};


