// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xb8 (Full Size[0x480] - InheritedSize[0x3c8]
class BP_Tavern_GoldenSands_AudioLayer_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3c8(0x8)
	Class AudioPortalComponent*                                  AudioPortal_UpstairsHut;                           // 0x3d0(0x8)
	Class AudioSpaceComponent*                                   AudioSpace_UpstairsHut;                            // 0x3d8(0x8)
	Class AudioSpaceComponent*                                   AudioSpace_Basement;                               // 0x3e0(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Stairs;                                // 0x3e8(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Window_08;                             // 0x3f0(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Window_07;                             // 0x3f8(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Window_06;                             // 0x400(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Window_05;                             // 0x408(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Window_04;                             // 0x410(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Window_03;                             // 0x418(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Window_02;                             // 0x420(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Window_01;                             // 0x428(0x8)
	Class AudioSpaceComponent*                                   AudioSpace_MainDoor;                               // 0x430(0x8)
	Class AudioSpaceComponent*                                   AudioSpace_Stage;                                  // 0x438(0x8)
	Class TritonComponent*                                       Triton;                                            // 0x440(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Hideout;                               // 0x448(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Door_C;                                // 0x450(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Door_D;                                // 0x458(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Door_B;                                // 0x460(0x8)
	Class AudioPortalComponent*                                  AudioPortal_Door_A;                                // 0x468(0x8)
	Class AudioSpaceComponent*                                   AudioSpace_MainBuilding;                           // 0x470(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x478(0x8)
};


}