// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x38
class BP_TaleBook_SunkenCrystal_C: public VoyageProposalContainer
{
public:
	Class ArrowComponent*                                        Arrow;                                             // 0x780(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x788(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x790(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x798(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7a0(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7a8(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7b0(0x8)
};


// Size 0x38
class BP_TaleBook_LordsOfTheSea_C: public VoyageProposalContainer
{
public:
	Class ArrowComponent*                                        Arrow;                                             // 0x780(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x788(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x790(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x798(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7a0(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7a8(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7b0(0x8)
};


// Size 0x38
class BP_TaleBook_DarkBrethren_C: public VoyageProposalContainer
{
public:
	Class ArrowComponent*                                        Arrow;                                             // 0x780(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x788(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x790(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x798(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7a0(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7a8(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7b0(0x8)
};


// Size 0x38
class BP_TaleBook_CaptainsOfTheDamned_C: public VoyageProposalContainer
{
public:
	Class ArrowComponent*                                        Arrow;                                             // 0x780(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x788(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x790(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x798(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7a0(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7a8(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7b0(0x8)
};


// Size 0x38
class BP_TaleBook_APiratesLife_C: public VoyageProposalContainer
{
public:
	Class ArrowComponent*                                        Arrow;                                             // 0x780(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x788(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x790(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x798(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7a0(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7a8(0x8)
	Class ChildActorComponent*                                   TaleSelectionSlot;                                 // 0x7b0(0x8)
};


}