// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x2e0 (Full Size[0x6a8] - InheritedSize[0x3c8]
class BP_trn_shop_wld_01_a_C: public Actor
{
public:
	class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3c8(0x8)
	class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x3d0(0x8)
	class StaticMeshComponent*                                   wld_trn_shop_dressing_01_b;                        // 0x3d8(0x8)
	class StaticMeshComponent*                                   wld_trn_shop_dressing_01_a;                        // 0x3e0(0x8)
	class StaticMeshComponent*                                   StaticMesh29;                                      // 0x3e8(0x8)
	class StaticMeshComponent*                                   StaticMesh24;                                      // 0x3f0(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_hanging_sign_01_a;                    // 0x3f8(0x8)
	class SpotLightComponent*                                    SpotLight3;                                        // 0x400(0x8)
	class SpotLightComponent*                                    SpotLight2;                                        // 0x408(0x8)
	class ChildActorComponent*                                   BP_MusicBox;                                       // 0x410(0x8)
	class ChildActorComponent*                                   BP_IslandEquipmentChest;                           // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMesh28;                                      // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMesh27;                                      // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMesh26;                                      // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMesh25;                                      // 0x438(0x8)
	class PointLightComponent*                                   PointLight1;                                       // 0x440(0x8)
	class ChildActorComponent*                                   ChildActor2;                                       // 0x448(0x8)
	class ChildActorComponent*                                   ChildActor1;                                       // 0x450(0x8)
	class SpotLightComponent*                                    SpotLight1;                                        // 0x458(0x8)
	class SpotLightComponent*                                    SpotLight;                                         // 0x460(0x8)
	class PointLightComponent*                                   PointLight9;                                       // 0x468(0x8)
	class PointLightComponent*                                   PointLight8;                                       // 0x470(0x8)
	class PointLightComponent*                                   PointLight7;                                       // 0x478(0x8)
	class PointLightComponent*                                   PointLight6;                                       // 0x480(0x8)
	class PointLightComponent*                                   PointLight5;                                       // 0x488(0x8)
	class PointLightComponent*                                   PointLight4;                                       // 0x490(0x8)
	class ParticleSystemComponent*                               ParticleSystem20;                                  // 0x498(0x8)
	class ParticleSystemComponent*                               ParticleSystem19;                                  // 0x4a0(0x8)
	class ParticleSystemComponent*                               ParticleSystem18;                                  // 0x4a8(0x8)
	class ParticleSystemComponent*                               ParticleSystem17;                                  // 0x4b0(0x8)
	class ParticleSystemComponent*                               ParticleSystem16;                                  // 0x4b8(0x8)
	class ParticleSystemComponent*                               ParticleSystem15;                                  // 0x4c0(0x8)
	class ParticleSystemComponent*                               ParticleSystem14;                                  // 0x4c8(0x8)
	class ParticleSystemComponent*                               ParticleSystem13;                                  // 0x4d0(0x8)
	class ParticleSystemComponent*                               ParticleSystem12;                                  // 0x4d8(0x8)
	class ParticleSystemComponent*                               ParticleSystem11;                                  // 0x4e0(0x8)
	class ParticleSystemComponent*                               ParticleSystem10;                                  // 0x4e8(0x8)
	class ParticleSystemComponent*                               ParticleSystem9;                                   // 0x4f0(0x8)
	class ParticleSystemComponent*                               ParticleSystem8;                                   // 0x4f8(0x8)
	class ParticleSystemComponent*                               ParticleSystem7;                                   // 0x500(0x8)
	class PointLightComponent*                                   PointLight3;                                       // 0x508(0x8)
	class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x510(0x8)
	class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x518(0x8)
	class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x520(0x8)
	class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x528(0x8)
	class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x530(0x8)
	class PointLightComponent*                                   PointLight2;                                       // 0x538(0x8)
	class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x540(0x8)
	class ParticleSystemComponent*                               ParticleSystem;                                    // 0x548(0x8)
	class PointLightComponent*                                   PointLight;                                        // 0x550(0x8)
	class ChildActorComponent*                                   ChildActor;                                        // 0x558(0x8)
	class StaticMeshComponent*                                   StaticMesh23;                                      // 0x560(0x8)
	class StaticMeshComponent*                                   StaticMesh22;                                      // 0x568(0x8)
	class StaticMeshComponent*                                   StaticMesh31;                                      // 0x570(0x8)
	class ChildActorComponent*                                   AudioSpace;                                        // 0x578(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_03_a;                              // 0x580(0x8)
	class StaticMeshComponent*                                   cmn_oar_01_a;                                      // 0x588(0x8)
	class StaticMeshComponent*                                   StaticMesh19;                                      // 0x590(0x8)
	class StaticMeshComponent*                                   StaticMesh18;                                      // 0x598(0x8)
	class StaticMeshComponent*                                   StaticMesh14;                                      // 0x5a0(0x8)
	class StaticMeshComponent*                                   StaticMesh13;                                      // 0x5a8(0x8)
	class StaticMeshComponent*                                   StaticMesh12;                                      // 0x5b0(0x8)
	class StaticMeshComponent*                                   StaticMesh11;                                      // 0x5b8(0x8)
	class StaticMeshComponent*                                   StaticMesh10;                                      // 0x5c0(0x8)
	class StaticMeshComponent*                                   StaticMesh9;                                       // 0x5c8(0x8)
	class StaticMeshComponent*                                   StaticMesh8;                                       // 0x5d0(0x8)
	class StaticMeshComponent*                                   StaticMesh7;                                       // 0x5d8(0x8)
	class StaticMeshComponent*                                   StaticMesh6;                                       // 0x5e0(0x8)
	class StaticMeshComponent*                                   StaticMesh5;                                       // 0x5e8(0x8)
	class StaticMeshComponent*                                   StaticMesh4;                                       // 0x5f0(0x8)
	class StaticMeshComponent*                                   cmn_candle_01_c;                                   // 0x5f8(0x8)
	class StaticMeshComponent*                                   cmn_candle_01_a;                                   // 0x600(0x8)
	class StaticMeshComponent*                                   StaticMesh3;                                       // 0x608(0x8)
	class StaticMeshComponent*                                   cap_skull_candle_01_a;                             // 0x610(0x8)
	class StaticMeshComponent*                                   cmn_candle_01_d;                                   // 0x618(0x8)
	class StaticMeshComponent*                                   cmn_candle_01_e;                                   // 0x620(0x8)
	class StaticMeshComponent*                                   shp_kra_skin_rug_01_a;                             // 0x628(0x8)
	class StaticMeshComponent*                                   shp_kra_wheel_01_a;                                // 0x630(0x8)
	class StaticMeshComponent*                                   shp_kitchen_shelf_02_a;                            // 0x638(0x8)
	class StaticMeshComponent*                                   StaticMesh1;                                       // 0x640(0x8)
	class StaticMeshComponent*                                   gmp_bar_hide_01_a1;                                // 0x648(0x8)
	class StaticMeshComponent*                                   bld_shop_table_01_a;                               // 0x650(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_01_a;                              // 0x658(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x660(0x8)
	class StaticMeshComponent*                                   cmn_skeleton_head_boar_01_a;                       // 0x668(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_wilds_details_01_a;                   // 0x670(0x8)
	class StaticMeshComponent*                                   bld_trn_roof_beam_01_a;                            // 0x678(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_window_01_b1;                         // 0x680(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_window_01_b;                          // 0x688(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_door_01_a;                            // 0x690(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_01_a;                                 // 0x698(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x6a0(0x8)
};


}