// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x280 (Full Size[0x648] - InheritedSize[0x3c8]
class BP_trn_shop_wsp_01_a_C: public Actor
{
public:
	class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3c8(0x8)
	class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x3d0(0x8)
	class StaticMeshComponent*                                   wsp_trn_shop_dressing_01_b;                        // 0x3d8(0x8)
	class StaticMeshComponent*                                   wsp_trn_shop_dressing_01_a;                        // 0x3e0(0x8)
	class StaticMeshComponent*                                   StaticMesh35;                                      // 0x3e8(0x8)
	class StaticMeshComponent*                                   StaticMesh34;                                      // 0x3f0(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_hanging_sign_01_a;                    // 0x3f8(0x8)
	class SpotLightComponent*                                    SpotLight3;                                        // 0x400(0x8)
	class ChildActorComponent*                                   BP_MusicBox;                                       // 0x408(0x8)
	class ChildActorComponent*                                   BP_IslandEquipmentChest;                           // 0x410(0x8)
	class ChildActorComponent*                                   wsp_bottle_burner;                                 // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMesh33;                                      // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMesh32;                                      // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMesh31;                                      // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMesh30;                                      // 0x438(0x8)
	class SpotLightComponent*                                    SpotLight2;                                        // 0x440(0x8)
	class PointLightComponent*                                   PointLight4;                                       // 0x448(0x8)
	class PointLightComponent*                                   PointLight;                                        // 0x450(0x8)
	class SpotLightComponent*                                    SpotLight1;                                        // 0x458(0x8)
	class PostProcessComponent*                                  PostProcess;                                       // 0x460(0x8)
	class BoxComponent*                                          Box;                                               // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMesh29;                                      // 0x470(0x8)
	class StaticMeshComponent*                                   StaticMesh28;                                      // 0x478(0x8)
	class StaticMeshComponent*                                   StaticMesh27;                                      // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMesh26;                                      // 0x488(0x8)
	class StaticMeshComponent*                                   StaticMesh25;                                      // 0x490(0x8)
	class StaticMeshComponent*                                   StaticMesh24;                                      // 0x498(0x8)
	class StaticMeshComponent*                                   StaticMesh7;                                       // 0x4a0(0x8)
	class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x4a8(0x8)
	class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x4b0(0x8)
	class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x4b8(0x8)
	class ParticleSystemComponent*                               ParticleSystem;                                    // 0x4c0(0x8)
	class PointLightComponent*                                   PointLight3;                                       // 0x4c8(0x8)
	class PointLightComponent*                                   PointLight2;                                       // 0x4d0(0x8)
	class PointLightComponent*                                   PointLight1;                                       // 0x4d8(0x8)
	class SpotLightComponent*                                    SpotLight;                                         // 0x4e0(0x8)
	class StaticMeshComponent*                                   cmn_wheel_01_a__cmn_wheel_01_a;                    // 0x4e8(0x8)
	class StaticMeshComponent*                                   StaticMesh4;                                       // 0x4f0(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x4f8(0x8)
	class ChildActorComponent*                                   AudioSpace;                                        // 0x500(0x8)
	class StaticMeshComponent*                                   wsp_vine_02_g;                                     // 0x508(0x8)
	class StaticMeshComponent*                                   wsp_vine_01_a;                                     // 0x510(0x8)
	class StaticMeshComponent*                                   wsp_vine_01_b;                                     // 0x518(0x8)
	class StaticMeshComponent*                                   wsp_vine_01_d;                                     // 0x520(0x8)
	class StaticMeshComponent*                                   wsp_vine_02_d;                                     // 0x528(0x8)
	class StaticMeshComponent*                                   wsp_plant_ball_01_a;                               // 0x530(0x8)
	class StaticMeshComponent*                                   wsp_bush_08_c;                                     // 0x538(0x8)
	class StaticMeshComponent*                                   StaticMesh8;                                       // 0x540(0x8)
	class StaticMeshComponent*                                   tls_shovel_01_a;                                   // 0x548(0x8)
	class StaticMeshComponent*                                   bld_cls_shop_hanging_cloth_03_a;                   // 0x550(0x8)
	class StaticMeshComponent*                                   bld_out_shop_roof_ship_wheel_01_a;                 // 0x558(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_03_a;                              // 0x560(0x8)
	class StaticMeshComponent*                                   cmn_oar_01_a;                                      // 0x568(0x8)
	class StaticMeshComponent*                                   cap_cabin_curtain_03_a;                            // 0x570(0x8)
	class StaticMeshComponent*                                   cap_cabinet_01_a;                                  // 0x578(0x8)
	class StaticMeshComponent*                                   bld_tvn_animal_rug_01_a;                           // 0x580(0x8)
	class SkeletalMeshComponent*                                 msc_voice_box_01_a;                                // 0x588(0x8)
	class StaticMeshComponent*                                   StaticMesh5;                                       // 0x590(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_03_a1;                           // 0x598(0x8)
	class StaticMeshComponent*                                   bld_shop_wood_box_01_a;                            // 0x5a0(0x8)
	class StaticMeshComponent*                                   cmn_rowboat_oar_01_a;                              // 0x5a8(0x8)
	class StaticMeshComponent*                                   bld_int_small_shelf_01_a;                          // 0x5b0(0x8)
	class StaticMeshComponent*                                   bld_int_small_shelves_03_a;                        // 0x5b8(0x8)
	class StaticMeshComponent*                                   bld_int_small_sideboard_01_a;                      // 0x5c0(0x8)
	class StaticMeshComponent*                                   StaticMesh2;                                       // 0x5c8(0x8)
	class StaticMeshComponent*                                   cmn_lantern_01_a;                                  // 0x5d0(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_04_a;                              // 0x5d8(0x8)
	class StaticMeshComponent*                                   bld_shop_drapes_02_a;                              // 0x5e0(0x8)
	class StaticMeshComponent*                                   cmn_looted_box_01_a;                               // 0x5e8(0x8)
	class StaticMeshComponent*                                   cmn_wooden_crate_01_a;                             // 0x5f0(0x8)
	class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x5f8(0x8)
	class StaticMeshComponent*                                   shp_kitchen_shelf_02_a;                            // 0x600(0x8)
	class StaticMeshComponent*                                   bld_shop_table_01_a;                               // 0x608(0x8)
	class StaticMeshComponent*                                   bld_trn_roof_beam_01_a;                            // 0x610(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_window_01_b2;                         // 0x618(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_window_01_b1;                         // 0x620(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_window_01_b;                          // 0x628(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_door_01_a;                            // 0x630(0x8)
	class StaticMeshComponent*                                   bld_trn_shop_01_a;                                 // 0x638(0x8)
	class SceneComponent*                                        DefaultSceneRoot;                                  // 0x640(0x8)
};


}