// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48 (Full Size[0x5a0] - InheritedSize[0x558]
class BP_TavernBoard_C: public TavernBoard
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x558(0x8)
	class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x560(0x8)
	class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x568(0x8)
	class ParticleSystemComponent*                               ParticleSystem;                                    // 0x570(0x8)
	class PointLightComponent*                                   PointLight1;                                       // 0x578(0x8)
	class PointLightComponent*                                   PointLight;                                        // 0x580(0x8)
	class StaticMeshComponent*                                   bld_jetty_support_b;                               // 0x588(0x8)
	class StaticMeshComponent*                                   gmp_messageboard_01_a;                             // 0x590(0x8)
	class PlayerGeneratedMapsContainerComponent*                 PlayerGeneratedMapsContainer;                      // 0x598(0x8)
};


}