// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x50 (Full Size[0x540] - InheritedSize[0x4f0]
class BP_VotableTaleProposal_C: public VotableObjectView
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x4f0(0x8)
	Class StaticMeshComponent*                                   Token 1;                                           // 0x4f8(0x8)
	Class StaticMeshComponent*                                   Token 4;                                           // 0x500(0x8)
	Class StaticMeshComponent*                                   Token 3;                                           // 0x508(0x8)
	Class StaticMeshComponent*                                   Token 2;                                           // 0x510(0x8)
	TArray<class StaticMeshComponent*>                           Tokens;                                            // 0x518(0x10)
	Class StaticMesh*                                            Token Asset;                                       // 0x528(0x8)
	int                                                          VoteCount;                                         // 0x530(0x4)
	float                                                        Show Token Animation Time;                         // 0x534(0x4)
	Class MaterialInterface*                                     Token Material;                                    // 0x538(0x8)
};


}