// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x50 (Full Size[0x540] - InheritedSize[0x4f0]
class BP_VotableTaleProposal_C: public VotableObjectView
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x4f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x500(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x508(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x510(0x8)
	TArray<class StaticMeshComponent*>                           None;                                              // 0x518(0x10)
	Class StaticMesh*                                            None;                                              // 0x528(0x8)
	char                                                         pad0x20_J8IV8[0x20];                               // 0x52e(0x20)
};


}