// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x650] - InheritedSize[0x610]
class BP_WarMapVoteSingle_C: public WarMapVoteInteractionActor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x610(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x618(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x620(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x628(0x8)
	Class VoteAudioComponent*                                    None;                                              // 0x630(0x8)
	Class WarMapInteractionVoteComponent*                        None;                                              // 0x638(0x8)
	Class StaticMeshVoteVisualiserComponent*                     None;                                              // 0x640(0x8)
	Class ActionRulesComponent*                                  None;                                              // 0x648(0x8)
};


}