// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x141 (Full Size[0xbe1] - InheritedSize[0xaa0]
class BP_Wheel_C: public Wheel
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0xaa0(0x8)
	Class SphereComponent*                                       None;                                              // 0xaa8(0x8)
	Class InteractableComponent*                                 None;                                              // 0xab0(0x8)
	Struct ObjectMessagingHandle                                 None;                                              // 0xab8(0x58)
	Struct ObjectMessagingHandle                                 None;                                              // 0xb10(0x58)
	Struct ObjectMessagingHandle                                 None;                                              // 0xb68(0x58)
	Struct WwiseEmitter                                          None;                                              // 0xbc0(0x20)
	bool                                                         None;                                              // 0xbe0(0x1)
};


}