// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x34 (Full Size[0x47c] - InheritedSize[0x448]
class BP_WaterVolume_Optimized_C: public WaterVolume
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x448(0x8)
	Class StaticMeshComponent*                                   WaterPlaneActivatationVolume;                      // 0x450(0x8)
	Class FlatWaterPlaneComponent*                               FlatWaterPlane;                                    // 0x458(0x8)
	Class FlatWaterMeshComponent*                                FlatWaterMesh;                                     // 0x460(0x8)
	Class SceneComponent*                                        Root;                                              // 0x468(0x8)
	bool                                                         SunLit;                                            // 0x470(0x1)
	char                                                         pad0x3_BKW5C[0x3];                                 // 0x471(0x3)
	struct FName                                                 RippleGeneratorTag;                                // 0x474(0x8)
};


}