#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x40 (Full Size[0x688] - InheritedSize[0x648]
class BP_WarMapVoteSingle_C: public WarMapVoteInteractionActor
{
public:
	class StaticMeshComponent*                                   VoteIndicator4;                                    // 0x648(0x8)
	class StaticMeshComponent*                                   VoteIndicator3;                                    // 0x650(0x8)
	class StaticMeshComponent*                                   VoteIndicator2;                                    // 0x658(0x8)
	class StaticMeshComponent*                                   VoteIndicator1;                                    // 0x660(0x8)
	class VoteAudioComponent*                                    VoteAudio;                                         // 0x668(0x8)
	class WarMapInteractionVoteComponent*                        WarMapInteractionVote;                             // 0x670(0x8)
	class StaticMeshVoteVisualiserComponent*                     StaticMeshVoteVisualiser;                          // 0x678(0x8)
	class ActionRulesComponent*                                  ActionRules;                                       // 0x680(0x8)
};


