// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x111 (Full Size[0xb41] - InheritedSize[0xa30]
class BP_Wheel_C: public Wheel
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0xa30(0x8)
	Class SphereComponent*                                       None;                                              // 0xa38(0x8)
	Class InteractableComponent*                                 None;                                              // 0xa40(0x8)
	Struct ObjectMessagingHandle                                 None;                                              // 0xa48(0x48)
	Struct ObjectMessagingHandle                                 None;                                              // 0xa90(0x48)
	Struct ObjectMessagingHandle                                 None;                                              // 0xad8(0x48)
	Struct WwiseEmitter                                          None;                                              // 0xb20(0x20)
	bool                                                         None;                                              // 0xb40(0x1)
};


}