// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48
class BP_WarMapVoteInteraction_C: public WarMapVoteInteractionActor
{
public:
	Class VoteAudioComponent*                                    VoteAudio;                                         // 0x4a8(0x8)
	Class WarMapInteractionVoteComponent*                        WarMapInteractionVote;                             // 0x4b0(0x8)
	Class StaticMeshVoteVisualiserComponent*                     StaticMeshVoteVisualiser;                          // 0x4b8(0x8)
	Class ActionRulesComponent*                                  ActionRules;                                       // 0x4c0(0x8)
	Class StaticMeshComponent*                                   VoteIndicator4;                                    // 0x4c8(0x8)
	Class StaticMeshComponent*                                   VoteIndicator3;                                    // 0x4d0(0x8)
	Class StaticMeshComponent*                                   VoteIndicator2;                                    // 0x4d8(0x8)
	Class StaticMeshComponent*                                   VoteIndicator1;                                    // 0x4e0(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x4e8(0x8)
};


}