// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x680] - InheritedSize[0x640]
class BP_WarMapVoteSingle_C: public WarMapVoteInteractionActor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x640(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x648(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x650(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x658(0x8)
	Class VoteAudioComponent*                                    None;                                              // 0x660(0x8)
	Class WarMapInteractionVoteComponent*                        None;                                              // 0x668(0x8)
	Class StaticMeshVoteVisualiserComponent*                     None;                                              // 0x670(0x8)
	Class ActionRulesComponent*                                  None;                                              // 0x678(0x8)
};


}