// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x220
class BP_wpn_shop_bsp_01_a_C: public Actor
{
public:
	Class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3c8(0x8)
	Class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x3d0(0x8)
	Class StaticMeshComponent*                                   bsp_wpn_shop_dressing_01_c;                        // 0x3d8(0x8)
	Class StaticMeshComponent*                                   bsp_wpn_shop_dressing_01_b;                        // 0x3e0(0x8)
	Class StaticMeshComponent*                                   bsp_wpn_shop_dressing_01_a;                        // 0x3e8(0x8)
	Class SpotLightComponent*                                    SpotLight10;                                       // 0x3f0(0x8)
	Class SpotLightComponent*                                    SpotLight9;                                        // 0x3f8(0x8)
	Class SpotLightComponent*                                    SpotLight8;                                        // 0x400(0x8)
	Class ChildActorComponent*                                   BP_IslandWeaponsChest;                             // 0x408(0x8)
	Class StaticMeshComponent*                                   cmn_wooden_crate_01_a;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh27;                                      // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh26;                                      // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh25;                                      // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh24;                                      // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh21;                                      // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMesh20;                                      // 0x448(0x8)
	Class PointLightComponent*                                   PointLight5;                                       // 0x450(0x8)
	Class ChildActorComponent*                                   ChildActor1;                                       // 0x458(0x8)
	Class ChildActorComponent*                                   ChildActor;                                        // 0x460(0x8)
	Class SpotLightComponent*                                    SpotLight7;                                        // 0x468(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x470(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x478(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x480(0x8)
	Class SpotLightComponent*                                    SpotLight6;                                        // 0x488(0x8)
	Class StaticMeshComponent*                                   tls_lantern_01_d;                                  // 0x490(0x8)
	Class SpotLightComponent*                                    SpotLight5;                                        // 0x498(0x8)
	Class PointLightComponent*                                   PointLight4;                                       // 0x4a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh33;                                      // 0x4a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh32;                                      // 0x4b0(0x8)
	Class SpotLightComponent*                                    SpotLight4;                                        // 0x4b8(0x8)
	Class PointLightComponent*                                   PointLight3;                                       // 0x4c0(0x8)
	Class SpotLightComponent*                                    SpotLight3;                                        // 0x4c8(0x8)
	Class SpotLightComponent*                                    SpotLight2;                                        // 0x4d0(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x4d8(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x4e0(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0x4e8(0x8)
	Class BoxComponent*                                          Box;                                               // 0x4f0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x4f8(0x8)
	Class SpotLightComponent*                                    SpotLight;                                         // 0x500(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x508(0x8)
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x510(0x8)
	Class StaticMeshComponent*                                   wpn_heavy_sword_02_a;                              // 0x518(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x520(0x8)
	Class ChildActorComponent*                                   AudioSpace;                                        // 0x528(0x8)
	Class StaticMeshComponent*                                   StaticMesh22;                                      // 0x530(0x8)
	Class StaticMeshComponent*                                   StaticMesh18;                                      // 0x538(0x8)
	Class StaticMeshComponent*                                   StaticMesh13;                                      // 0x540(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x548(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x550(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_pillars_01_b;                         // 0x558(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_doorframe_01_a;                       // 0x560(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_01_a;                                 // 0x568(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_hanging_target_01_a;                  // 0x570(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_window_01_b;                          // 0x578(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_window_01_a;                          // 0x580(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_window_01_c2;                         // 0x588(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_window_01_c;                          // 0x590(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_lantern_01_b;                         // 0x598(0x8)
	Class StaticMeshComponent*                                   bld_wpn_roof_beam_01_a;                            // 0x5a0(0x8)
	Class StaticMeshComponent*                                   bld_shop_small_balcony_01_a;                       // 0x5a8(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_window_01_c1;                         // 0x5b0(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_window_01_b1;                         // 0x5b8(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_window_01_a1;                         // 0x5c0(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_sign_01_a;                            // 0x5c8(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_pillars_01_a;                         // 0x5d0(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_door_01_a;                            // 0x5d8(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x5e0(0x8)
};


}