// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x111
class BP_Wheel_C: public Wheel
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0xa08(0x8)
	Class SphereComponent*                                       ProjectileCollision;                               // 0xa10(0x8)
	Class InteractableComponent*                                 Interactable;                                      // 0xa18(0x8)
	Struct ObjectMessagingHandle                                 Wheel Centered;                                    // 0xa20(0x48)
	Struct ObjectMessagingHandle                                 Wheel Movement Started;                            // 0xa68(0x48)
	Struct ObjectMessagingHandle                                 Wheel Movement Stopped;                            // 0xab0(0x48)
	Struct WwiseEmitter                                          AudioEmitter;                                      // 0xaf8(0x20)
	bool                                                         ShipWheelTurning;                                  // 0xb18(0x1)
};


}