// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x70
class BP_wsp_totd_portal_effects_C: public BP_TotD_PortalController_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x430(0x8)
	Class ParticleSystemComponent*                               vfx_PortalAmbience_02;                             // 0x438(0x8)
	Class ParticleSystemComponent*                               vfx_PortalAmbience_01;                             // 0x440(0x8)
	Class PointLightComponent*                                   TipLight;                                          // 0x448(0x8)
	Class StaticMeshComponent*                                   vfx_cloud;                                         // 0x450(0x8)
	Class StaticMeshComponent*                                   Portal;                                            // 0x458(0x8)
	Class StaticMeshComponent*                                   vfx_cloud_depth;                                   // 0x460(0x8)
	Class StaticMeshComponent*                                   vfx_big_cloud;                                     // 0x468(0x8)
	Class StaticMeshComponent*                                   roundedcube_invertednormals;                       // 0x470(0x8)
	Class DecalComponent*                                        crack_decal2;                                      // 0x478(0x8)
	Class DecalComponent*                                        crack_decal;                                       // 0x480(0x8)
	Class StaticMeshComponent*                                   volume_glow;                                       // 0x488(0x8)
	Class PointLightComponent*                                   LightComponent0;                                   // 0x490(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x498(0x8)
};


}