// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48
class BP_xmas_tavern_dressing_C: public Actor
{
public:
	Class ChildActorComponent*                                   None;                                              // 0x3c8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x3d0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
	Class SceneComponent*                                        None;                                              // 0x408(0x8)
};


}