// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x140
class BP_xmas_WLD_Outpost_1_Dressing_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x420(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x430(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x438(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x440(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x448(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x450(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x458(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x460(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x468(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x470(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x478(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x480(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x488(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x490(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x498(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4c0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4c8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4f8(0x8)
	Class SceneComponent*                                        None;                                              // 0x500(0x8)
};


}