// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68 (Full Size[0x470] - InheritedSize[0x408]
class bsp_plm_cluster_03_b_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   wsp_bush_03_a;                                     // 0x408(0x8)
	class StaticMeshComponent*                                   wsp_rock_pebbles_d;                                // 0x410(0x8)
	class StaticMeshComponent*                                   wsp_rock_pebbles_c;                                // 0x418(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_02_b;                                // 0x420(0x8)
	class StaticMeshComponent*                                   wsp_rock_xtra_small_e;                             // 0x428(0x8)
	class StaticMeshComponent*                                   wsp_bush_01_a_02;                                  // 0x430(0x8)
	class StaticMeshComponent*                                   wsp_rock_xtra_small_a_01;                          // 0x438(0x8)
	class StaticMeshComponent*                                   wsp_rock_cliff_j_01;                               // 0x440(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_02_a_02;                             // 0x448(0x8)
	class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x450(0x8)
	class StaticMeshComponent*                                   wsp_tre_palm_02_a_01;                              // 0x458(0x8)
	class StaticMeshComponent*                                   wsp_bush_01_a_01;                                  // 0x460(0x8)
	class SceneComponent*                                        Scene;                                             // 0x468(0x8)
};


}