// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class bsp_flower_cluster_03_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_pebbles_h_01;                             // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_a_01;                          // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock|_pebbles_g_01;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_f_01;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_flower_06_b_01;                                // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_flower_05_b_01;                                // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_flower_01_a_01;                                // 0x438(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x440(0x8)
};


// Size 0x38
class bsp_flower_cluster_03_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_flower_04_b_01;                                // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_flower_04_a_01;                                // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_a_01;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_b_01;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_c_01;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_b_01;                          // 0x430(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x438(0x8)
};


// Size 0x20
class bsp_flower_cluster_02_h_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x418(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x420(0x8)
};


// Size 0x20
class bsp_flower_cluster_02_g_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x418(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x420(0x8)
};


// Size 0x20
class bsp_flower_cluster_02_f_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x418(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x420(0x8)
};


// Size 0x58
class bsp_flower_cluster_01_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__b;                            // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__e;                               // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__b;                               // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__d;                               // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__c;                               // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__d;                            // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c;                            // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x450(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x458(0x8)
};


}