// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x80
class bsp_plm_cluster_03_e_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_03_a2;                                    // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a1;                                    // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a;                                     // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent029;                            // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x450(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x480(0x8)
};


}