// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48
class bsp_sea_rock_cluster_g_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x3c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x400(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x408(0x8)
};


// Size 0x30
class bsp_sea_rock_cluster_f_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x3c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x3e8(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x3f0(0x8)
};


// Size 0x40
class bsp_sea_rock_cluster_e_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x3c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x3f8(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x400(0x8)
};


// Size 0x50
class bsp_sea_rock_cluster_d_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x3c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x408(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x410(0x8)
};


// Size 0x68
class bsp_sea_rock_cluster_c_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x3c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x420(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x428(0x8)
};


// Size 0x48
class bsp_sea_rock_cluster_b_C: public Actor
{
public:
	Class StaticMeshComponent*                                   bsp_rock_cliff_01_j;                               // 0x3c8(0x8)
	Class StaticMeshComponent*                                   bsp_rock_cliff_01_k;                               // 0x3d0(0x8)
	Class StaticMeshComponent*                                   bsp_rock_cliff_01_h;                               // 0x3d8(0x8)
	Class StaticMeshComponent*                                   bsp_rock_cliff_01_b;                               // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x400(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x408(0x8)
};


// Size 0x40
class bsp_sea_rock_cluster_a_C: public Actor
{
public:
	Class StaticMeshComponent*                                   bsp_rock_cliff_01_g;                               // 0x3c8(0x8)
	Class StaticMeshComponent*                                   bsp_rock_cliff_01_e;                               // 0x3d0(0x8)
	Class StaticMeshComponent*                                   bsp_sea_rocks_e;                                   // 0x3d8(0x8)
	Class StaticMeshComponent*                                   bsp_rock_cliff_01_i;                               // 0x3e0(0x8)
	Class StaticMeshComponent*                                   bsp_sea_rocks_a;                                   // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x3f8(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x400(0x8)
};


}