// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x58
class bsp_bch_rocks_02_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   bsp_rock_cliff_01_j;                               // 0x408(0x8)
	Class StaticMeshComponent*                                   bsp_rock_medium_01_d;                              // 0x410(0x8)
	Class StaticMeshComponent*                                   bsp_rock_medium_01_b;                              // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c10;                          // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__e4;                           // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__e2;                           // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c6;                           // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c5;                           // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c9;                           // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c8;                           // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__e3;                           // 0x458(0x8)
};


}