// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x50 (Full Size[0x458] - InheritedSize[0x408]
class bsp_tr_cluster_03_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_01_a3;                                    // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a2;                                    // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a9;                                    // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a8;                                    // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a7;                                    // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_a;                                // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_b2;                               // 0x438(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_b;                                // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a4;                                    // 0x450(0x8)
};


}