// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x78
class bsp_beach_rocks_01_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_cliff_o_01;                               // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_e_01;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_d_01;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_b_01;                          // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_h_01;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_a_01;                          // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_d_02;                          // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_rock_cliff_m_01;                               // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_d_01;                          // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_e_01;                          // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_b_01;                             // 0x458(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_c_01;                             // 0x460(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_a_01;                             // 0x468(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_f_01;                             // 0x470(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_g_01;                             // 0x478(0x8)
};


}