#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x48 (Full Size[0x410] - InheritedSize[0x3c8]
class bsp_sea_rock_cluster_b_C: public Actor
{
public:
	class StaticMeshComponent*                                   bsp_rock_cliff_01_j;                               // 0x3c8(0x8)
	class StaticMeshComponent*                                   bsp_rock_cliff_01_k;                               // 0x3d0(0x8)
	class StaticMeshComponent*                                   bsp_rock_cliff_01_h;                               // 0x3d8(0x8)
	class StaticMeshComponent*                                   bsp_rock_cliff_01_b;                               // 0x3e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x3e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x3f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x3f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x400(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x408(0x8)
};


