// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x50
class bsp_palm_cluster_02_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__b;                            // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__e;                            // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__d;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_b;                                // 0x420(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_a;                                // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a;                                     // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_a;                                     // 0x448(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x450(0x8)
};


}