// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x408] - InheritedSize[0x3c8]
class bsp_sea_rock_cluster_e_C: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x3c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x3d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x3d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x3e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x3e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x3f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x3f8(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x400(0x8)
};


}