// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x78 (Full Size[0x480] - InheritedSize[0x408]
class bsp_beach_rocks_01_b_C: public None
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x420(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x430(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x438(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x440(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x448(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x450(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x458(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x460(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x468(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x470(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x478(0x8)
};


}