// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x418] - InheritedSize[0x3d8]
class bsp_bottle_light_stand_a_C: public StaticMeshActor
{
public:
	Class PointLightComponent*                                   None;                                              // 0x3d8(0x8)
	Class PointLightComponent*                                   None;                                              // 0x3e0(0x8)
	Class PointLightComponent*                                   None;                                              // 0x3e8(0x8)
	Class PointLightComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
};


}