// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x78 (Full Size[0x480] - InheritedSize[0x408]
class bsp_palm_cluster_01_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_03_a_03;                                  // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_h;                                // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_g;                                // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_d;                                // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_e;                                // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_a_01;                             // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_b;                                // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_e;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a_02;                                  // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_a_01;                          // 0x450(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x458(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_a_02;                             // 0x460(0x8)
	Class StaticMeshComponent*                                   wsp_tre_palm_02_a_01;                              // 0x468(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a_01;                                  // 0x470(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x478(0x8)
};


}