// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48 (Full Size[0x450] - InheritedSize[0x408]
class bsp_palm_cluster_02_a_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_b;                                     // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_b2;                                    // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_b3;                                    // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_a;                                // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_b2;                               // 0x430(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_b;                                // 0x440(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x448(0x8)
};


}