// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x58 (Full Size[0x460] - InheritedSize[0x408]
class bsp_bch_rocks_05_b_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   bsp_rock_cliff_01_j;                               // 0x408(0x8)
	class StaticMeshComponent*                                   bsp_rock_medium_01_d1;                             // 0x410(0x8)
	class StaticMeshComponent*                                   bsp_rock_medium_01_d;                              // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMesh16;                                      // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMesh14;                                      // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMesh6;                                       // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMesh11;                                      // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMesh10;                                      // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMesh8;                                       // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMesh7;                                       // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMesh12;                                      // 0x458(0x8)
};


}