// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68 (Full Size[0x470] - InheritedSize[0x408]
class bsp_palm_cluster_02_b_C: public BP_Placement_HeightDrop_C
{
public:
	class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x408(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_01_d;                                // 0x410(0x8)
	class StaticMeshComponent*                                   wsp_rock_pebbles__e;                               // 0x418(0x8)
	class StaticMeshComponent*                                   wsp_rock_pebbles__d;                               // 0x420(0x8)
	class StaticMeshComponent*                                   wsp_rock_pebbles__g;                               // 0x428(0x8)
	class StaticMeshComponent*                                   wsp_rock_pebbles__h;                               // 0x430(0x8)
	class StaticMeshComponent*                                   wsp_rock_xtra_small__c;                            // 0x438(0x8)
	class StaticMeshComponent*                                   wsp_rock_xtra_small__b;                            // 0x440(0x8)
	class StaticMeshComponent*                                   wsp_rock_xtra_small__a;                            // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMesh1;                                       // 0x450(0x8)
	class StaticMeshComponent*                                   wsp_bush_03_a;                                     // 0x458(0x8)
	class StaticMeshComponent*                                   wsp_bush_06_a;                                     // 0x460(0x8)
	class SceneComponent*                                        Scene;                                             // 0x468(0x8)
};


}