// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60 (Full Size[0x468] - InheritedSize[0x408]
class bsp_beach_rocks_07_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   bsp_rock_small_01_d;                               // 0x408(0x8)
	Class StaticMeshComponent*                                   bsp_rock_medium_01_e;                              // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_a_02;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_c_02;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_e_01;                          // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_a_01;                          // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_d_02;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_e_02;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_b_02;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_e_01;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_d_01;                          // 0x458(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_f_02;                             // 0x460(0x8)
};


}