// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x408] - InheritedSize[0x3c8]
class bsp_sea_rock_cluster_a_C: public Actor
{
public:
	Class StaticMeshComponent*                                   bsp_rock_cliff_01_g;                               // 0x3c8(0x8)
	Class StaticMeshComponent*                                   bsp_rock_cliff_01_e;                               // 0x3d0(0x8)
	Class StaticMeshComponent*                                   bsp_sea_rocks_e;                                   // 0x3d8(0x8)
	Class StaticMeshComponent*                                   bsp_rock_cliff_01_i;                               // 0x3e0(0x8)
	Class StaticMeshComponent*                                   bsp_sea_rocks_a;                                   // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x3f8(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x400(0x8)
};


}