// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x88 (Full Size[0x490] - InheritedSize[0x408]
class bsp_flower_cluster_02_a_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__a;                               // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__h;                               // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__g;                               // 0x458(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__b;                            // 0x460(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c;                            // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x480(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x488(0x8)
};


}