// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class bsp_flower_cluster_03_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_pebbles_h_01;                             // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_a_01;                          // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock|_pebbles_g_01;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_f_01;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_flower_06_b_01;                                // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_flower_05_b_01;                                // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_flower_01_a_01;                                // 0x438(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x440(0x8)
};


}