// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68
class bsp_plm_cluster_03_d_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_pebbles__e;                               // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__f;                               // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__h;                               // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__g;                               // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__b;                               // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__a;                               // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x448(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x460(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x468(0x8)
};


}