// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ChecklistActionData: public Object
{
public:
	int                                                          NumRequiredActions;                                // 0x28(0x4)
	byte                                                         ActionType;                                        // 0x2c(0x1)
	char                                                         pad0x3_GJA0Z[0x3];                                 // 0x2d(0x3)
};


// Size 0x20 (Full Size[0x50] - InheritedSize[0x30]
class DeliverBootyChecklistActionData: public ChecklistActionData
{
public:
	TArray<Assetclass TargetBootyTypes>                          TargetBootyTypes;                                  // 0x30(0x10)
	TArray<class Class*>                                         TargetCompanies;                                   // 0x40(0x10)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class KillActorChecklistActionData: public ChecklistActionData
{
public:
	TArray<class Class*>                                         TargetAIClasses;                                   // 0x30(0x10)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class NamedChecklistEventActionData: public ChecklistActionData
{
public:
	struct FName                                                 Event;                                             // 0x30(0x8)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class NPCInteractionChecklistActionData: public ChecklistActionData
{
public:
	TArray<struct TargetNPCIds>                                  TargetNPCIds;                                      // 0x30(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ChecklistItemsDataAsset: public DataAsset
{
public:
	TArray<struct ChecklistItems>                                ChecklistItems;                                    // 0x28(0x10)
};


// Size 0x150 (Full Size[0x940] - InheritedSize[0x7f0]
class ChecklistMap: public TreasureMap
{
public:
	int                                                          CanvasWidth;                                       // 0x7e8(0x4)
	int                                                          CanvasHeight;                                      // 0x7ec(0x4)
	Class Font*                                                  Font;                                              // 0x7f0(0x8)
	float                                                        FontScale;                                         // 0x7f8(0x4)
	float                                                        FontLineSpacingScale;                              // 0x7fc(0x4)
	char                                                         pad0x8_GZJ8W[0x8];                                 // 0x800(0x8)
	Class ChecklistMapLayout*                                    ChecklistMapLayout;                                // 0x808(0x8)
	Struct ChecklistMapContents                                  Contents;                                          // 0x810(0xe8)
	char                                                         pad0x48_NNDWF[0x48];                               // 0x8f8(0x48)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ChecklistMapCollectionInterface: public Interface
{
public:
};


// Size 0x78 (Full Size[0x140] - InheritedSize[0xc8]
class ChecklistMapCompletionComponent: public ActorComponent
{
public:
	Class ChecklistActionData*                                   ActionData;                                        // 0xc8(0x8)
	char                                                         pad0x70_1ZLBH[0x70];                               // 0xd0(0x70)
};


// Size 0x20 (Full Size[0x58] - InheritedSize[0x38]
class ChecklistMapSettings: public DeveloperSettings
{
public:
	Struct StringAssetReference                                  ChecklistMapItemDescClass;                         // 0x38(0x10)
	TArray<struct FName>                                         ChecklistEvents;                                   // 0x48(0x10)
};


}