#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x10
struct ChecklistBootyDeliveredEvent
{
public:
	class Actor*                                                 Seller;                                            // 0x0(0x8)
	class Actor*                                                 BuyingNPC;                                         // 0x8(0x8)
};


// Size 0x8
struct ChecklistCompletionEvent
{
public:
	class ChecklistActionData*                                   ActionData;                                        // 0x0(0x8)
};


// Size 0x28
struct ChecklistItemCompletedTelemetryEvent
{
public:
	struct Guid                                                  ChecklistMapId;                                    // 0x0(0x10)
	char                                                         ReceivedActionType;                                // 0x10(0x1)
	struct FString                                               ActionDescryption;                                 // 0x18(0x10)
};


// Size 0x50
struct ChecklistMapItemData
{
public:
	struct TreasureMapTextDesc                                   Description;                                       // 0x0(0x48)
	bool                                                         IsComplete;                                        // 0x48(0x1)
};


// Size 0x50
struct ChecklistItem
{
public:
	struct FText                                                 Description;                                       // 0x0(0x38)
	int                                                          NumRequiredActionCompletions;                      // 0x38(0x4)
	TArray<class ChecklistActionData*>                           ActionData;                                        // 0x40(0x10)
};


// Size 0xe8
struct ChecklistMapContents
{
public:
	struct TreasureMapTextDesc                                   Title;                                             // 0x0(0x48)
	struct TreasureMapTextDesc                                   Description;                                       // 0x48(0x48)
	TArray<struct ChecklistMapItemData>                          ChecklistItems;                                    // 0x90(0x10)
	struct TreasureMapTextDesc                                   Afternote;                                         // 0xa0(0x48)
};


