// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x90 (Full Size[0x498] - InheritedSize[0x408]
class cmn_looted__box_bottles_01_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x458(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x460(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x470(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x478(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x488(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x490(0x8)
};


}