#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "CoherentUIGTPlugin_Structs.h"


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class CoherentUIGTJSPayload: public Object
{
public:
	struct FString                                               EventName;                                         // 0x28(0x10)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class CoherentUIGTSettings: public Object
{
public:
	bool                                                         EnableLiveReload;                                  // 0x28(0x1)
	int                                                          InspectorPort;                                     // 0x2c(0x4)
	int                                                          WebdriverPort;                                     // 0x30(0x4)
	bool                                                         EnableWebSecurity;                                 // 0x34(0x1)
	bool                                                         EnableLocalization;                                // 0x35(0x1)
	bool                                                         RunAsynchronous;                                   // 0x36(0x1)
	bool                                                         bRecursivelyBindUStructs;                          // 0x37(0x1)
	bool                                                         LoadSystemFonts;                                   // 0x38(0x1)
	bool                                                         AllowPerformanceWarningsInEditor;                  // 0x39(0x1)
	bool                                                         ShowWarningsOnScreen;                              // 0x3a(0x1)
	char                                                         LogSeverity;                                       // 0x3b(0x1)
	bool                                                         bPaintToBackBuffer;                                // 0x3c(0x1)
	bool                                                         bRespectTitleSafeZone;                             // 0x3d(0x1)
	bool                                                         bRespectLetterboxing;                              // 0x3e(0x1)
	struct FString                                               HUDMaterialName;                                   // 0x40(0x10)
	struct FString                                               CoUIResourcesRoot;                                 // 0x50(0x10)
	bool                                                         TickWhileGameIsPaused;                             // 0x60(0x1)
	char                                                         MSAA;                                              // 0x61(0x1)
};


// Size 0x98 (Full Size[0x558] - InheritedSize[0x4c0]
class CoherentUIGTGameHUD: public HUD
{
public:
	class CoherentUIGTHUD*                                       CoherentUIGTHUD;                                   // 0x4c0(0x8)
};


// Size 0x2a0 (Full Size[0x3d8] - InheritedSize[0x138]
class CoherentUIGTWidget: public Widget
{
public:
	class Actor*                                                 Owner;                                             // 0x158(0x8)
	multicastinlinedelegate                                      ReadyForBindings;                                  // 0x160(0x10)
	multicastinlinedelegate                                      BindingsReleased;                                  // 0x170(0x10)
	multicastinlinedelegate                                      FinishLoad;                                        // 0x180(0x10)
	multicastinlinedelegate                                      FailLoad;                                          // 0x190(0x10)
	multicastinlinedelegate                                      StartLoading;                                      // 0x1a0(0x10)
	multicastinlinedelegate                                      NavigateTo;                                        // 0x1b0(0x10)
	multicastinlinedelegate                                      JavaScriptEvent;                                   // 0x1c0(0x10)
	multicastinlinedelegate                                      UIGTScriptingReady;                                // 0x1d0(0x10)
	char                                                         Filter;                                            // 0x1f8(0x1)
	bool                                                         bReceiveInput;                                     // 0x1f9(0x1)
	bool                                                         bReceiveInputWhenTransparent;                      // 0x1fa(0x1)
	bool                                                         bGammaCorrectedMaterial;                           // 0x1fb(0x1)
	bool                                                         AllowPerformanceWarnings;                          // 0x1fc(0x1)
	float                                                        ExecuteJSTimersThresholdMs;                        // 0x200(0x4)
	float                                                        UpdateStylesAndLayoutThresholdMs;                  // 0x204(0x4)
	float                                                        RecordRenderingCommandsThresholdMs;                // 0x208(0x4)
	float                                                        PaintWarningThresholdMs;                           // 0x20c(0x4)
	int                                                          LayersCountThreshold;                              // 0x210(0x4)
	int                                                          LayerWidthThreshold;                               // 0x214(0x4)
	int                                                          LayerHeightThreshold;                              // 0x218(0x4)
	bool                                                         bEnableAdditionalDefaultStyles;                    // 0x21c(0x1)
	struct FString                                               URL;                                               // 0x3c0(0x10)
	float                                                        ClickThroughAlphaThreshold;                        // 0x3d0(0x4)
	bool                                                         Transparent;                                       // 0x3d4(0x1)
};


// Size 0x248 (Full Size[0x310] - InheritedSize[0xc8]
class CoherentUIGTBaseComponent: public ActorComponent
{
public:
	multicastinlinedelegate                                      ReadyForBindings;                                  // 0xc8(0x10)
	multicastinlinedelegate                                      BindingsReleased;                                  // 0xd8(0x10)
	multicastinlinedelegate                                      FinishLoad;                                        // 0xe8(0x10)
	multicastinlinedelegate                                      FailLoad;                                          // 0xf8(0x10)
	multicastinlinedelegate                                      StartLoading;                                      // 0x108(0x10)
	multicastinlinedelegate                                      NavigateTo;                                        // 0x118(0x10)
	multicastinlinedelegate                                      JavaScriptEvent;                                   // 0x128(0x10)
	multicastinlinedelegate                                      UIGTScriptingReady;                                // 0x138(0x10)
	delegate                                                     LiveViewSizeRequested;                             // 0x148(0x10)
	class TextureRenderTarget2D*                                 Texture;                                           // 0x170(0x8)
	char                                                         Filter;                                            // 0x178(0x1)
	bool                                                         bReceiveInput;                                     // 0x179(0x1)
	bool                                                         bReceiveInputWhenTransparent;                      // 0x17a(0x1)
	bool                                                         AllowPerformanceWarnings;                          // 0x17b(0x1)
	float                                                        ExecuteJSTimersThresholdMs;                        // 0x17c(0x4)
	float                                                        UpdateStylesAndLayoutThresholdMs;                  // 0x180(0x4)
	float                                                        RecordRenderingCommandsThresholdMs;                // 0x184(0x4)
	float                                                        PaintWarningThresholdMs;                           // 0x188(0x4)
	int                                                          LayersCountThreshold;                              // 0x18c(0x4)
	int                                                          LayerWidthThreshold;                               // 0x190(0x4)
	int                                                          LayerHeightThreshold;                              // 0x194(0x4)
	bool                                                         bEnableAdditionalDefaultStyles;                    // 0x198(0x1)
	bool                                                         bDelayedUpdate;                                    // 0x199(0x1)
};


// Size 0x30 (Full Size[0xf8] - InheritedSize[0xc8]
class CoherentUIGTLiveView: public ActorComponent
{
public:
	struct FString                                               LinkName;                                          // 0xc8(0x10)
	class TextureRenderTarget2D*                                 Texture;                                           // 0xd8(0x8)
};


// Size 0x60 (Full Size[0x428] - InheritedSize[0x3c8]
class CoherentUIGTInputActor: public Actor
{
public:
	multicastinlinedelegate                                      OnCoherentUIGTInputActorMouseButtonDown;           // 0x3c8(0x10)
	multicastinlinedelegate                                      OnCoherentUIGTInputActorMouseButtonUp;             // 0x3d8(0x10)
	multicastinlinedelegate                                      OnCoherentUIGTInputActorKeyDown;                   // 0x3e8(0x10)
	multicastinlinedelegate                                      OnCoherentUIGTInputActorKeyUp;                     // 0x3f8(0x10)
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class CoherentUIGTJSEvent: public Object
{
public:
	TArray<class Struct*>                                        StructTypes;                                       // 0xa8(0x10)
};


// Size 0x38 (Full Size[0x348] - InheritedSize[0x310]
class CoherentUIGTComponent: public CoherentUIGTBaseComponent
{
public:
	struct FString                                               URL;                                               // 0x310(0x10)
	int                                                          Width;                                             // 0x320(0x4)
	int                                                          Height;                                            // 0x324(0x4)
	bool                                                         ManualTexture;                                     // 0x328(0x1)
	float                                                        ClickThroughAlphaThreshold;                        // 0x32c(0x4)
	bool                                                         Transparent;                                       // 0x330(0x1)
};


// Size 0x28 (Full Size[0x338] - InheritedSize[0x310]
class CoherentUIGTHUD: public CoherentUIGTBaseComponent
{
public:
	struct StringAssetReference                                  HUDMaterialName;                                   // 0x310(0x10)
	class Material*                                              HUDMaterial;                                       // 0x320(0x8)
	class MaterialInstanceDynamic*                               HUDMaterialInstance;                               // 0x328(0x8)
};


