// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class CommodityTokenEntitlementDesc: public EntitlementDesc
{
public:
	struct FName                                                 NPCToRedeemAt;                                     // 0xc8(0x8)
	class                                                        ItemToRedeemFor;                                   // 0xd0(0x8)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class CommodityDemandFrameworkEditorSettings: public DeveloperSettings
{
public:
	Struct StringAssetReference                                  CommodityDataFileLocation;                         // 0x38(0x10)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class CommodityDemandFrameworkSettings: public DeveloperSettings
{
public:
	float                                                        DemandRefreshFrequencyInSeconds;                   // 0x38(0x4)
	struct FName                                                 DemandCollectionId;                                // 0x3c(0x8)
	int                                                          CommodityPurchaseLockoutInGameDays;                // 0x44(0x4)
	int                                                          InGameHourWhenCommoditiesRestock;                  // 0x48(0x4)
	char                                                         pad0x4_47J3N[0x4];                                 // 0x4c(0x4)
	Struct GameTime                                              CommodityRedemptionTimeOutPeriodInDays;            // 0x50(0x8)
	Struct StringAssetReference                                  NPCListAsset;                                      // 0x58(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CommodityDemandServiceInterface: public Interface
{
public:
};


// Size 0x40 (Full Size[0x408] - InheritedSize[0x3c8]
class CommodityDemandService: public Actor
{
public:
	char                                                         pad0x20_P1FUV[0x20];                               // 0x3c8(0x20)
	Struct ActiveNPCDemands                                      ActiveCommodityDemands;                            // 0x3e8(0x20)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CommodityDemandStorageInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CommodityDemandStorageProviderInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class CommodityEntitlementRedemptionAsset: public DataAsset
{
public:
	TArray<struct CommoditiesForRedemption>                      CommoditiesForRedemption;                          // 0x28(0x10)
};


// Size 0x10 (Full Size[0x130] - InheritedSize[0x120]
class CommodityItemDesc: public BootyItemDesc
{
public:
	Struct CommoditySelectionType                                CommodityType;                                     // 0x120(0x8)
	byte                                                         CommodityDemand;                                   // 0x128(0x1)
	char                                                         pad0x7_W2F4Y[0x7];                                 // 0x129(0x7)
};


// Size 0x80 (Full Size[0x148] - InheritedSize[0xc8]
class CommodityPurchaseTrackingComponent: public ActorComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CommodityRedemptionInterface: public Interface
{
public:
};


// Size 0xc8 (Full Size[0x190] - InheritedSize[0xc8]
class CommodityRedemptionComponent: public ActorComponent
{
public:
	char                                                         pad0x8_ZO64Y[0x8];                                 // 0xc8(0x8)
	Struct FText                                                 RedeemTooltipText;                                 // 0xd0(0x38)
	char                                                         pad0x78_2L3T8[0x78];                               // 0x108(0x78)
	TArray<class Actor*>                                         PendingRedemptions;                                // 0x180(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CommoditySourceInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0xe0] - InheritedSize[0xc8]
class CommoditySourceComponent: public ActorComponent
{
public:
	char                                                         pad0x8_9EPEA[0x8];                                 // 0xc8(0x8)
	struct FName                                                 NPCIdentifier;                                     // 0xd0(0x8)
	struct FName                                                 IslandIdentifier;                                  // 0xd8(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class CommodityTypeDataAsset: public DataAsset
{
public:
	TArray<struct CommodityEntries>                              CommodityEntries;                                  // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CrateFillerInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class CrateFillerComponent: public ActorComponent
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class DeliverableCommodityRequirement: public DeliverableRequirementBase
{
public:
};


// Size 0x20 (Full Size[0x50] - InheritedSize[0x30]
class IsWieldedCommodityItemInDemandStatCondition: public TargetedStatCondition
{
public:
	byte                                                         CommodityDemand;                                   // 0x30(0x1)
	char                                                         pad0x1f_6YLLJ[0x1f];                               // 0x31(0x1f)
};


// Size 0x18 (Full Size[0xe0] - InheritedSize[0xc8]
class SpecificItemsCrateFillerComponent: public ActorComponent
{
public:
	char                                                         pad0x8_8T8XI[0x8];                                 // 0xc8(0x8)
	TArray<struct ItemsToFillCrateWith>                          ItemsToFillCrateWith;                              // 0xd0(0x10)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class WasWieldedCommodityItemBoughtAtDemandStatCondition: public TargetedStatCondition
{
public:
	byte                                                         CommodityDemand;                                   // 0x30(0x1)
	char                                                         pad0x7_M6KHX[0x7];                                 // 0x31(0x7)
};


}