// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x8
struct CommoditySelectionType
{
public:
	struct FName                                                 CommodityType;                                     // 0x0(0x8)
};


// Size 0x20
struct ActiveNPCDemands
{
public:
	TArray<UInt32 NPCIdHashes>                                   NPCIdHashes;                                       // 0x0(0x10)
	TArray<struct NPCDemands>                                    NPCDemands;                                        // 0x10(0x10)
};


// Size 0x20
struct ActiveCommodityDemands
{
public:
	TArray<UInt32 CommodityIdHashes>                             CommodityIdHashes;                                 // 0x0(0x10)
	TArray<Byte CommodityDemands>                                CommodityDemands;                                  // 0x10(0x10)
};


// Size 0x10
struct MerchantSovereignHandInNameInformation
{
public:
	struct FName                                                 MerchantNPCName;                                   // 0x0(0x8)
	struct FName                                                 SovereignNPCName;                                  // 0x8(0x8)
};


// Size 0x10
struct CommodityDescWithRedeemId
{
public:
	Struct CommoditySelectionType                                RedeemId;                                          // 0x0(0x8)
	class                                                        RedeemItemDesc;                                    // 0x8(0x8)
};


// Size 0x18
struct EntitlementToRedeemItems
{
public:
	class                                                        RequiredEntitlement;                               // 0x0(0x8)
	TArray<struct RedeemItems>                                   RedeemItems;                                       // 0x8(0x10)
};


// Size 0x28
struct CommoditySourceMetaWrapper
{
public:
	struct FName                                                 NPCIdentifier;                                     // 0x18(0x8)
	struct FName                                                 IslandIdentifier;                                  // 0x20(0x8)
};


// Size 0x10
struct CommodityTypeDataEntry
{
public:
	struct FName                                                 CommodityType;                                     // 0x0(0x8)
	struct FName                                                 DisplayName;                                       // 0x8(0x8)
};


// Size 0x18
struct EventCommodityCrateRedeemed
{
public:
};


// Size 0x10
struct CommodityRedemptionTrackingModel
{
public:
	byte                                                         NPCName;                                           // 0x2(0x1)
	char                                                         pad0x5_WQREU[0x5];                                 // 0x3(0x5)
};


// Size 0x20
struct CommodityTrackingModel
{
public:
	Struct Guid                                                  ItemOfferId;                                       // 0x0(0x10)
	byte                                                         NPCName;                                           // 0x10(0x1)
	char                                                         pad0x7_VWOJA[0x7];                                 // 0x11(0x7)
};


// Size 0x40
struct TrackCommodityPurchaseOnServerRpc
{
public:
	Class Object*                                                CommodityDemandStorageObject;                      // 0x10(0x8)
	struct FName                                                 NPCName;                                           // 0x18(0x8)
	Struct Guid                                                  ItemOfferId;                                       // 0x20(0x10)
	Struct FString                                               ItemClientId;                                      // 0x30(0x10)
};


}