// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1
struct OnCompetitiveVoyageMainVoyageStopped
{
public:
	char                                                         pad0x1_3344L[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct OnCompetitiveVoyageMainVoyageStarted
{
public:
	char                                                         pad0x1_5CUOR[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct OnCompetitiveVoyageOptOutVotePassed
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x48
struct CompetitiveVoyageItemData
{
public:
	char                                                         pad0x8_BFNOO[0x8];                                 // 0x0(0x8)
	struct Guid                                                  FirstHoldingCrewId;                                // 0x8(0x10)
	struct Guid                                                  PreviousHoldingCrewId;                             // 0x18(0x10)
	struct Guid                                                  CurrentHoldingCrewId;                              // 0x28(0x10)
	int                                                          NumTimesSwappedHands;                              // 0x38(0x4)
	char                                                         pad0xc_5BULV[0xc];                                 // 0x3c(0xc)
};


// Size 0x1c
struct CompetitiveVoyagesRespawnPOIData
{
public:
	float                                                        MinPreferredDistanceFromPOI;                       // 0x0(0x4)
	float                                                        MaxPreferredDistanceFromPOI;                       // 0x4(0x4)
	float                                                        MinBonusForPreferredDistance;                      // 0x8(0x4)
	float                                                        MaxBonusForPreferredDistance;                      // 0xc(0x4)
	float                                                        ScorePenaltyForEachMeterAwayFromVoyageItem;        // 0x10(0x4)
	float                                                        ResourceOrFeatureMultiplier;                       // 0x14(0x4)
	float                                                        OutpostMultiplier;                                 // 0x18(0x4)
};


// Size 0x68
struct CompetitiveVoyagesRespawnConfig
{
public:
	float                                                        ScorePenaltyForEachMeterAwayFromShipwreck;         // 0x0(0x4)
	float                                                        MinRespawnLocDistanceFromSunkShip;                 // 0x4(0x4)
	float                                                        MinScorePenaltyForEnemyShipProximity;              // 0x8(0x4)
	float                                                        MaxScorePenaltyForEnemyShipProximity;              // 0xc(0x4)
	float                                                        MinDistanceFromEnemyShipToApplyPenalty;            // 0x10(0x4)
	float                                                        MaxDistanceFromEnemyShipToApplyPenalty;            // 0x14(0x4)
	bool                                                         GenerateRespawnVisualizationImages;                // 0x18(0x1)
	char                                                         pad0x3_0M5KW[0x3];                                 // 0x19(0x3)
	int                                                          NumDebugGenerations;                               // 0x1c(0x4)
	struct CompetitiveVoyagesRespawnPOIData                      TreasureHuntPOIData;                               // 0x20(0x1c)
	struct CompetitiveVoyagesRespawnPOIData                      HandInPOIData;                                     // 0x3c(0x1c)
	struct Vector2D                                              MapMin;                                            // 0x58(0x8)
	struct Vector2D                                              MapMax;                                            // 0x60(0x8)
};


// Size 0x38
struct CompetitiveVoyagesRespawnDebugMapData
{
public:
	char                                                         pad0x38_6QLF2[0x38];                               // 0x0(0x38)
};


// Size 0x14
struct CompetitiveVoyagesRespawnSpawnScoreData
{
public:
	char                                                         pad0x14_SWWMV[0x14];                               // 0x0(0x14)
};


// Size 0xc
struct ShipSpeedCurseModifyingValues
{
public:
	float                                                        SloopSpeedCurseModifier;                           // 0x0(0x4)
	float                                                        BrigantineSpeedCurseModifier;                      // 0x4(0x4)
	float                                                        GalleonSpeedCurseModifier;                         // 0x8(0x4)
};


// Size 0x18
struct PhasedMarkerItem
{
public:
	char                                                         pad0x18_QB2LQ[0x18];                               // 0x0(0x18)
};


}