#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x8
struct ConditionBase
{
public:
	char                                                         pad0x8_FN3BK[0x8];                                 // 0x0(0x8)
};


// Size 0x8
struct ConditionContextPayloadBase
{
public:
	char                                                         pad0x8_L88Z3[0x8];                                 // 0x0(0x8)
};


// Size 0x10
struct WorldObjectConditionContextPayload
{
public:
	char                                                         pad0x8_C5D96[0x8];                                 // 0x0(0x8)
	class World*                                                 WorldObject;                                       // 0x8(0x8)
};


// Size 0x18
struct IsFeatureEnabledCondition
{
public:
	char                                                         pad0x8_LG85O[0x8];                                 // 0x0(0x8)
	struct FeatureFlag                                           Feature;                                           // 0x8(0xc)
	char                                                         pad0x4_6X7W1[0x4];                                 // 0x14(0x4)
};


// Size 0x30
struct IsGameOnSpecificPlayModeVariantCondition
{
public:
	char                                                         pad0x28_PXZT5[0x28];                               // 0x0(0x28)
	char                                                         TargetMode;                                        // 0x28(0x1)
	char                                                         pad0x7_J3KG9[0x7];                                 // 0x29(0x7)
};


// Size 0x20
struct ConditionContextPayloadSelectorInstance
{
public:
	char                                                         pad0x20_GNU6Z[0x20];                               // 0x0(0x20)
};


// Size 0x10
struct ConditionFromAsset
{
public:
	char                                                         pad0x8_U7WG3[0x8];                                 // 0x0(0x8)
	class ConditionRootAsset*                                    ConditionAsset;                                    // 0x8(0x8)
};


// Size 0x18
struct ConditionContextPayloadComponentOwnerSelector
{
public:
	char                                                         pad0x18_XVKAM[0x18];                               // 0x0(0x18)
};


// Size 0x10
struct ConditionContextPayloadTarget
{
public:
	class ScriptStruct*                                          PayloadStruct;                                     // 0x0(0x8)
	struct FName                                                 PayloadMember;                                     // 0x8(0x8)
};


// Size 0x18
struct ConditionContextPayloadObjectSelector
{
public:
	char                                                         pad0x18_BBS7S[0x18];                               // 0x0(0x18)
};


// Size 0x38
struct IsObjectOfTypeCondition
{
public:
	char                                                         pad0x28_NQU0C[0x28];                               // 0x0(0x28)
	TArray<Class>                                                TargetObjectClasses;                               // 0x28(0x10)
};


// Size 0x10
struct TargetConditionContextPayload
{
public:
	char                                                         pad0x8_KZNJ2[0x8];                                 // 0x0(0x8)
	class Actor*                                                 Target;                                            // 0x8(0x8)
};


// Size 0x20
struct ConditionInstance
{
public:
	char                                                         pad0x20_H3WJZ[0x20];                               // 0x0(0x20)
};


// Size 0x10
struct InstigatorConditionContextPayload
{
public:
	char                                                         pad0x8_BLGXN[0x8];                                 // 0x0(0x8)
	class Actor*                                                 Instigator;                                        // 0x8(0x8)
};


// Size 0x30
struct IsGameOnSpecificPlayModeCondition
{
public:
	char                                                         pad0x28_7T0BB[0x28];                               // 0x0(0x28)
	char                                                         TargetMode;                                        // 0x28(0x1)
	char                                                         pad0x7_KKMEP[0x7];                                 // 0x29(0x7)
};


// Size 0x48
struct IsSpecifiedActorCondition
{
public:
	char                                                         pad0x8_MORUZ[0x8];                                 // 0x0(0x8)
	struct ConditionContextPayloadSelectorInstance               SpecifyingActorPayloadSelector;                    // 0x8(0x20)
	struct ConditionContextPayloadSelectorInstance               TargetActorPayloadSelector;                        // 0x28(0x20)
};


// Size 0x28
struct TargetedPayloadConditionBase
{
public:
	char                                                         pad0x8_KXQEA[0x8];                                 // 0x0(0x8)
	struct ConditionContextPayloadSelectorInstance               PayloadSelector;                                   // 0x8(0x20)
};


// Size 0x18
struct AndCondition
{
public:
	char                                                         pad0x8_4DMQQ[0x8];                                 // 0x0(0x8)
	TArray<struct ConditionInstance>                             Conditions;                                        // 0x8(0x10)
};


// Size 0x18
struct OrCondition
{
public:
	char                                                         pad0x8_KIFQT[0x8];                                 // 0x0(0x8)
	TArray<struct ConditionInstance>                             Conditions;                                        // 0x8(0x10)
};


// Size 0x18
struct ConditionContextPayloadSelectorBase
{
public:
	char                                                         pad0x8_FTJFS[0x8];                                 // 0x0(0x8)
	struct ConditionContextPayloadTarget                         PayloadTarget;                                     // 0x8(0x10)
};


// Size 0x28
struct NotCondition
{
public:
	char                                                         pad0x8_I1QC2[0x8];                                 // 0x0(0x8)
	struct ConditionInstance                                     Condition;                                         // 0x8(0x20)
};


