#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x10
struct ConditionFromAsset
{
public:
	class ConditionRootAsset*                                    ConditionAsset;                                    // 0x8(0x8)
};


// Size 0x18
struct ConditionContextPayloadSelectorBase
{
public:
	struct                                                       PayloadTarget;                                     // 0x8(0x10)
};


// Size 0x10
struct WorldObjectConditionContextPayload
{
public:
	class World*                                                 WorldObject;                                       // 0x8(0x8)
};


// Size 0x10
struct ConditionContextPayloadTarget
{
public:
	class ScriptStruct*                                          PayloadStruct;                                     // 0x0(0x8)
	struct FName                                                 PayloadMember;                                     // 0x8(0x8)
};


// Size 0x10
struct TargetConditionContextPayload
{
public:
	class Actor*                                                 Target;                                            // 0x8(0x8)
};


// Size 0x30
struct IsGameOnSpecificPlayModeCondition
{
public:
	char                                                         TargetMode;                                        // 0x28(0x1)
};


// Size 0x48
struct IsSpecifiedActorCondition
{
public:
	struct                                                       SpecifyingActorPayloadSelector;                    // 0x8(0x20)
	struct                                                       TargetActorPayloadSelector;                        // 0x28(0x20)
};


// Size 0x18
struct AndCondition
{
public:
	TArray<struct ConditionInstance>                             Conditions;                                        // 0x8(0x10)
};


// Size 0x28
struct TargetedPayloadConditionBase
{
public:
	struct                                                       PayloadSelector;                                   // 0x8(0x20)
};


// Size 0x30
struct IsGameOnSpecificPlayModeVariantCondition
{
public:
	char                                                         TargetMode;                                        // 0x28(0x1)
};


// Size 0x28
struct NotCondition
{
public:
	struct                                                       Condition;                                         // 0x8(0x20)
};


// Size 0x18
struct IsFeatureEnabledCondition
{
public:
	struct                                                       Feature;                                           // 0x8(0xc)
};


// Size 0x18
struct OrCondition
{
public:
	TArray<struct ConditionInstance>                             Conditions;                                        // 0x8(0x10)
};


// Size 0x10
struct InstigatorConditionContextPayload
{
public:
	class Actor*                                                 Instigator;                                        // 0x8(0x8)
};


// Size 0x38
struct IsObjectOfTypeCondition
{
public:
	TArray<Class>                                                TargetObjectClasses;                               // 0x28(0x10)
};


