#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x30
struct IsGameOnSpecificPlayModeCondition
{
public:
	char                                                         pad0x28_Z6CPS[0x28];                               // 0x0(0x28)
	char                                                         TargetMode;                                        // 0x28(0x1)
	char                                                         pad0x7_FJ7CE[0x7];                                 // 0x29(0x7)
};


// Size 0x8
struct ConditionBase
{
public:
	char                                                         pad0x8_1LH81[0x8];                                 // 0x0(0x8)
};


// Size 0x10
struct WorldObjectConditionContextPayload
{
public:
	char                                                         pad0x8_R2B3Q[0x8];                                 // 0x0(0x8)
	class World*                                                 WorldObject;                                       // 0x8(0x8)
};


// Size 0x10
struct InstigatorConditionContextPayload
{
public:
	char                                                         pad0x8_SSENQ[0x8];                                 // 0x0(0x8)
	class Actor*                                                 Instigator;                                        // 0x8(0x8)
};


// Size 0x10
struct ConditionFromAsset
{
public:
	char                                                         pad0x8_LRAE9[0x8];                                 // 0x0(0x8)
	class ConditionRootAsset*                                    ConditionAsset;                                    // 0x8(0x8)
};


// Size 0x18
struct IsFeatureEnabledCondition
{
public:
	char                                                         pad0x8_S3C8Z[0x8];                                 // 0x0(0x8)
	struct FeatureFlag                                           Feature;                                           // 0x8(0xc)
	char                                                         pad0x4_UU3ZX[0x4];                                 // 0x14(0x4)
};


// Size 0x8
struct ConditionContextPayloadBase
{
public:
	char                                                         pad0x8_GWBCO[0x8];                                 // 0x0(0x8)
};


// Size 0x18
struct ConditionContextPayloadComponentOwnerSelector
{
public:
	char                                                         pad0x18_H5YMM[0x18];                               // 0x0(0x18)
};


// Size 0x20
struct ConditionContextPayloadSelectorInstance
{
public:
	char                                                         pad0x20_GKL09[0x20];                               // 0x0(0x20)
};


// Size 0x30
struct IsGameOnSpecificPlayModeVariantCondition
{
public:
	char                                                         pad0x28_D42RR[0x28];                               // 0x0(0x28)
	char                                                         TargetMode;                                        // 0x28(0x1)
	char                                                         pad0x7_FY842[0x7];                                 // 0x29(0x7)
};


// Size 0x20
struct ConditionInstance
{
public:
	char                                                         pad0x20_7Q3N4[0x20];                               // 0x0(0x20)
};


// Size 0x10
struct TargetConditionContextPayload
{
public:
	char                                                         pad0x8_3X2W0[0x8];                                 // 0x0(0x8)
	class Actor*                                                 Target;                                            // 0x8(0x8)
};


// Size 0x38
struct IsObjectOfTypeCondition
{
public:
	char                                                         pad0x28_9CD8U[0x28];                               // 0x0(0x28)
	TArray<Class>                                                TargetObjectClasses;                               // 0x28(0x10)
};


// Size 0x10
struct ConditionContextPayloadTarget
{
public:
	class ScriptStruct*                                          PayloadStruct;                                     // 0x0(0x8)
	struct FName                                                 PayloadMember;                                     // 0x8(0x8)
};


// Size 0x18
struct ConditionContextPayloadObjectSelector
{
public:
	char                                                         pad0x18_WAJ5Q[0x18];                               // 0x0(0x18)
};


// Size 0x48
struct IsSpecifiedActorCondition
{
public:
	char                                                         pad0x8_119H6[0x8];                                 // 0x0(0x8)
	struct ConditionContextPayloadSelectorInstance               SpecifyingActorPayloadSelector;                    // 0x8(0x20)
	struct ConditionContextPayloadSelectorInstance               TargetActorPayloadSelector;                        // 0x28(0x20)
};


// Size 0x28
struct NotCondition
{
public:
	char                                                         pad0x8_9O81N[0x8];                                 // 0x0(0x8)
	struct ConditionInstance                                     Condition;                                         // 0x8(0x20)
};


// Size 0x28
struct TargetedPayloadConditionBase
{
public:
	char                                                         pad0x8_NS037[0x8];                                 // 0x0(0x8)
	struct ConditionContextPayloadSelectorInstance               PayloadSelector;                                   // 0x8(0x20)
};


// Size 0x18
struct ConditionContextPayloadSelectorBase
{
public:
	char                                                         pad0x8_D1NR5[0x8];                                 // 0x0(0x8)
	struct ConditionContextPayloadTarget                         PayloadTarget;                                     // 0x8(0x10)
};


// Size 0x18
struct OrCondition
{
public:
	char                                                         pad0x8_DP96L[0x8];                                 // 0x0(0x8)
	TArray<struct ConditionInstance>                             Conditions;                                        // 0x8(0x10)
};


// Size 0x18
struct AndCondition
{
public:
	char                                                         pad0x8_ODE81[0x8];                                 // 0x0(0x8)
	TArray<struct ConditionInstance>                             Conditions;                                        // 0x8(0x10)
};


