#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x18
struct IsFeatureEnabledCondition
{
public:
	char                                                         pad0x8_IYKH2[0x8];                                 // 0x0(0x8)
	struct FeatureFlag                                           Feature;                                           // 0x8(0xc)
	char                                                         pad0x4_TD1NR[0x4];                                 // 0x14(0x4)
};


// Size 0x10
struct ConditionFromAsset
{
public:
	char                                                         pad0x8_UQ9OC[0x8];                                 // 0x0(0x8)
	class ConditionRootAsset*                                    ConditionAsset;                                    // 0x8(0x8)
};


// Size 0x8
struct ConditionBase
{
public:
	char                                                         pad0x8_U531W[0x8];                                 // 0x0(0x8)
};


// Size 0x10
struct WorldObjectConditionContextPayload
{
public:
	char                                                         pad0x8_5QKVD[0x8];                                 // 0x0(0x8)
	class World*                                                 WorldObject;                                       // 0x8(0x8)
};


// Size 0x20
struct ConditionInstance
{
public:
	char                                                         pad0x20_DU8J6[0x20];                               // 0x0(0x20)
};


// Size 0x30
struct IsGameOnSpecificPlayModeVariantCondition
{
public:
	char                                                         pad0x28_NJJN4[0x28];                               // 0x0(0x28)
	char                                                         TargetMode;                                        // 0x28(0x1)
	char                                                         pad0x7_V3ROQ[0x7];                                 // 0x29(0x7)
};


// Size 0x18
struct ConditionContextPayloadObjectSelector
{
public:
	char                                                         pad0x18_JRQWK[0x18];                               // 0x0(0x18)
};


// Size 0x30
struct IsGameOnSpecificPlayModeCondition
{
public:
	char                                                         pad0x28_XI26Q[0x28];                               // 0x0(0x28)
	char                                                         TargetMode;                                        // 0x28(0x1)
	char                                                         pad0x7_0F550[0x7];                                 // 0x29(0x7)
};


// Size 0x8
struct ConditionContextPayloadBase
{
public:
	char                                                         pad0x8_RP4PG[0x8];                                 // 0x0(0x8)
};


// Size 0x10
struct TargetConditionContextPayload
{
public:
	char                                                         pad0x8_GS3JC[0x8];                                 // 0x0(0x8)
	class Actor*                                                 Target;                                            // 0x8(0x8)
};


// Size 0x10
struct InstigatorConditionContextPayload
{
public:
	char                                                         pad0x8_JQT6K[0x8];                                 // 0x0(0x8)
	class Actor*                                                 Instigator;                                        // 0x8(0x8)
};


// Size 0x38
struct IsObjectOfTypeCondition
{
public:
	char                                                         pad0x28_7XU7U[0x28];                               // 0x0(0x28)
	TArray<Class>                                                TargetObjectClasses;                               // 0x28(0x10)
};


// Size 0x18
struct ConditionContextPayloadComponentOwnerSelector
{
public:
	char                                                         pad0x18_G5W1P[0x18];                               // 0x0(0x18)
};


// Size 0x10
struct ConditionContextPayloadTarget
{
public:
	class ScriptStruct*                                          PayloadStruct;                                     // 0x0(0x8)
	struct FName                                                 PayloadMember;                                     // 0x8(0x8)
};


// Size 0x20
struct ConditionContextPayloadSelectorInstance
{
public:
	char                                                         pad0x20_WSNYF[0x20];                               // 0x0(0x20)
};


// Size 0x48
struct IsSpecifiedActorCondition
{
public:
	char                                                         pad0x8_OQZFM[0x8];                                 // 0x0(0x8)
	struct ConditionContextPayloadSelectorInstance               SpecifyingActorPayloadSelector;                    // 0x8(0x20)
	struct ConditionContextPayloadSelectorInstance               TargetActorPayloadSelector;                        // 0x28(0x20)
};


// Size 0x18
struct AndCondition
{
public:
	char                                                         pad0x8_W318Q[0x8];                                 // 0x0(0x8)
	TArray<struct ConditionInstance>                             Conditions;                                        // 0x8(0x10)
};


// Size 0x28
struct NotCondition
{
public:
	char                                                         pad0x8_M8U7R[0x8];                                 // 0x0(0x8)
	struct ConditionInstance                                     Condition;                                         // 0x8(0x20)
};


// Size 0x18
struct OrCondition
{
public:
	char                                                         pad0x8_NQ8CR[0x8];                                 // 0x0(0x8)
	TArray<struct ConditionInstance>                             Conditions;                                        // 0x8(0x10)
};


// Size 0x28
struct TargetedPayloadConditionBase
{
public:
	char                                                         pad0x8_LOQE0[0x8];                                 // 0x0(0x8)
	struct ConditionContextPayloadSelectorInstance               PayloadSelector;                                   // 0x8(0x20)
};


// Size 0x18
struct ConditionContextPayloadSelectorBase
{
public:
	char                                                         pad0x8_76C6N[0x8];                                 // 0x0(0x8)
	struct ConditionContextPayloadTarget                         PayloadTarget;                                     // 0x8(0x10)
};


