// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0
struct ContestMatchmakingServerRequestModel
{
public:
	Struct Guid                                                  ServerId;                                          // 0x0(0x10)
	Struct FString                                               ServerAddress;                                     // 0x10(0x10)
	Struct FString                                               VmId;                                              // 0x20(0x10)
	Struct FString                                               PrivateServerId;                                   // 0x30(0x10)
	Struct FString                                               ServerLocation;                                    // 0x40(0x10)
	TArray<Str PlayModeTags>                                     PlayModeTags;                                      // 0x58(0x10)
	TArray<Str PlayModeStates>                                   PlayModeStates;                                    // 0x68(0x10)
	TArray<Struct ServerCrewModel>                               Crews;                                             // 0x78(0x10)
	byte                                                         MatchmakingRequestReason;                          // 0x88(0x1)
	Struct Guid                                                  RequestCorrelationId;                              // 0x8c(0x10)
};


// Size 0x80
struct ServerCrewModel
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	Struct UniqueNetIdRepl                                       UserId;                                            // 0x10(0x18)
	Struct Guid                                                  ServerId;                                          // 0x28(0x10)
	int                                                          SessionType;                                       // 0x38(0x4)
	TArray<Struct Vector2D>                                      Positions;                                         // 0x40(0x10)
	TArray<UInt32 Resources>                                     Resources;                                         // 0x50(0x10)
	byte                                                         PvPFaction;                                        // 0x60(0x1)
	int                                                          PvPSkillLevel;                                     // 0x64(0x4)
	Struct Guid                                                  RivalCrewId;                                       // 0x68(0x10)
	byte                                                         MatchmakingRequestReason;                          // 0x78(0x1)
};


// Size 0x78
struct ServerCrewResponseModel
{
public:
	TArray<Struct ServerCrewModel>                               Crews;                                             // 0x0(0x10)
	Struct Timespan                                              RetryAfter;                                        // 0x60(0x8)
	Struct Timespan                                              MigrationThreshold;                                // 0x68(0x8)
	Struct Timespan                                              ExpireAfter;                                       // 0x70(0x8)
};


// Size 0x50
struct OptionalPlayModeModel
{
public:
};


// Size 0xd0
struct ServerCrewRequestModel
{
public:
	Struct Guid                                                  ServerId;                                          // 0x0(0x10)
	Struct FString                                               VmId;                                              // 0x10(0x10)
	Struct FString                                               PrivateServerId;                                   // 0x20(0x10)
	Struct FString                                               ServerLocation;                                    // 0x30(0x10)
	TArray<Str PlayModeTags>                                     PlayModeTags;                                      // 0x48(0x10)
	Struct FString                                               PlayModeState;                                     // 0x58(0x10)
	int                                                          CrewCount;                                         // 0x68(0x4)
	int                                                          CrewCountBucket;                                   // 0x6c(0x4)
	int                                                          CrewMin;                                           // 0x70(0x4)
	int                                                          CrewMax;                                           // 0x74(0x4)
	TArray<Int CrewSessionTypes>                                 CrewSessionTypes;                                  // 0x78(0x10)
	TArray<Struct ExistingServerCrewModel>                       Crews;                                             // 0x88(0x10)
	Struct Timespan                                              Uptime;                                            // 0x98(0x8)
	Struct ServerContendedModel                                  Contended;                                         // 0xa0(0x30)
};


// Size 0x30
struct ServerContendedModel
{
public:
	TArray<Struct Vector2D>                                      Positions;                                         // 0x0(0x10)
	TArray<Struct ServerRegionModel>                             Regions;                                           // 0x10(0x10)
	TArray<UInt32 Resources>                                     Resources;                                         // 0x20(0x10)
};


// Size 0xc
struct ServerRegionModel
{
public:
	Struct Vector2D                                              Position;                                          // 0x0(0x8)
	float                                                        Radius;                                            // 0x8(0x4)
};


// Size 0x28
struct ExistingServerCrewModel
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	int                                                          SessionType;                                       // 0x10(0x4)
	byte                                                         AlignedFaction;                                    // 0x14(0x1)
	int                                                          PvPSkillLevel;                                     // 0x18(0x4)
	Struct Timespan                                              TimeInMatchmaking;                                 // 0x20(0x8)
};


// Size 0x10
struct ContestMatchmakingFactionMapEntry
{
public:
	class                                                        GameFaction;                                       // 0x0(0x8)
	byte                                                         MatchmakingFaction;                                // 0x8(0x1)
};


}