#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x30
struct CookStartTelemetryEvent
{
public:
	struct FString                                               ItemName;                                          // 0x0(0x10)
	char                                                         CookState;                                         // 0x10(0x1)
	struct                                                       Location;                                          // 0x14(0xc)
	struct                                                       CookId;                                            // 0x20(0x10)
};


// Size 0x30
struct CookEndTelemetryEvent
{
public:
	struct FString                                               ItemName;                                          // 0x0(0x10)
	char                                                         CookState;                                         // 0x10(0x1)
	struct                                                       Location;                                          // 0x14(0xc)
	struct                                                       CookId;                                            // 0x20(0x10)
};


// Size 0x8
struct OnRemovedItemFromCookingPot
{
public:
	class Actor*                                                 Interactor;                                        // 0x0(0x8)
};


// Size 0x68
struct CookingClientRepresentation
{
public:
	bool                                                         Cooking;                                           // 0x0(0x1)
	bool                                                         HasItem;                                           // 0x1(0x1)
	class ItemInfo*                                              CurrentlyCookingItem;                              // 0x8(0x8)
	struct FText                                                 CurrentCookingItemDisplayName;                     // 0x10(0x38)
	class UClass*                                                CurrentCookingItemCategory;                        // 0x48(0x8)
	char                                                         SmokeFeedbackLevel;                                // 0x50(0x1)
	float                                                        VisibleCookedExtent;                               // 0x54(0x4)
	float                                                        CurrentItemPlacementAngle;                         // 0x58(0x4)
	struct FName                                                 CurrentCookableTypeName;                           // 0x5c(0x8)
};


// Size 0x10
struct CookerSmokeFeedbackEntry
{
public:
	char                                                         FeedbackLevel;                                     // 0x0(0x1)
	class ParticleSystem*                                        SmokeVFX;                                          // 0x8(0x8)
};


// Size 0x10
struct OnPlacedItemInCookingPot
{
public:
	class Actor*                                                 Interactor;                                        // 0x0(0x8)
	class ItemInfo*                                              ItemToCook;                                        // 0x8(0x8)
};


// Size 0x8
struct CookableComponentSmokeFeedbackTimingEntry
{
public:
	float                                                        StateDuration;                                     // 0x0(0x4)
	char                                                         StateFeedbackLevel;                                // 0x4(0x1)
};


