#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

struct Function;
class Class;


template<class T>
class TArray {
public:
	T& operator[](int i) const { return Data[i]; };
	T* Data;
	int32_t Count;
	int32_t Max;
};

struct NameEntry {
	uint32_t Index;
	uint32_t pad;
	NameEntry* HashNext;
	char AnsiName[1024];
};

struct Name
{
	int ComparisonIndex = 0;
	int Number = 0;
};

struct Text
{
	char pad0x28_5W9Yzz[0x28];
};

struct Object {
	void* Vtable; // 0x0
	int ObjectFlags; // 0x8
	int InternalIndex; // 0xC
	struct Class* ObjectClass; // 0x10
	struct Name Name; // 0x18
	Object* Outer; // 0x20

	std::string const GetShortName();
	std::string const GetName();
	//std::string const GetInGameName();
	std::string const GetFullName();
	bool IsA(Class* cmp);
};

struct String : public TArray<wchar_t>
{
	String() = default;

	explicit String(const wchar_t* other)
	{
		Max = Count = *other ? std::wcslen(other) + 1 : 0;

		if (Count)
		{
			Data = const_cast<wchar_t*>(other);
		}
	};

	inline bool IsValid() const
	{
		return Data != nullptr;
	}

	inline const wchar_t* cw_str() const
	{
		return Data;
	}

	inline const char* c_str() const
	{
		return (const char*)Data;
	}

	std::string ToString() const
	{
		size_t length = std::wcslen(Data);
		std::string str(length, '\0');
		std::use_facet<std::ctype<wchar_t>>(std::locale()).narrow(Data, Data + length, '?', &str[0]);

		return str;
	}

	std::wstring ToWString() const
	{
		std::wstring str(Data);
		return str;
	}
};



struct Field : Object {
	struct Object* Next;
};

struct Property : Field {
	int ArrayDim;
	int ElementSize;
	int64_t PropertyFlag;
	char pad00c0[0xc];
	int Offset;
	Property* NextRef;
	char pad00x18[0x18];
};

struct Struct : Field {
	struct Struct* SuperField;
	struct Field* Children;
	int PropertySize;
	int MinAlignment;
	char pad0040[0x40];
};

struct Function : Struct {
	int FunctionFlags;
	int16_t RepOffset;
	int16_t NumParams;
	int16_t ParamsSize;
	int16_t ReturnValueOffset;
	int16_t RPCid;
	int16_t RPCResponseID;
	Property* FirstPropertyToInt;
	Function* EventsGraphFunction;
	int EventGraphCallOffset;
	char pad0004[0x4];
	void* Func;
	char pad0008[0x8];
};

struct Class : Struct {

};

static Class* FindClass(const std::string name) {
	return FindObject<Class>(name);
}

#include "CoreUObject_Structs.h"


// Size 0x0 (Full Size[0x0] - InheritedSize[0x0]
class Default__Class
{
public:
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class BoolProperty: public Property
{
public:
	char                                                         pad0x8_0LVUZ[0x8];                                 // 0x70(0x8)
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class DelegateProperty: public Property
{
public:
	char                                                         pad0x8_QGBK2[0x8];                                 // 0x70(0x8)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class TextBuffer: public Object
{
public:
	char                                                         pad0x28_M8L10[0x28];                               // 0x28(0x28)
};


// Size 0x28 (Full Size[0x58] - InheritedSize[0x30]
class Enum: public Field
{
public:
	char                                                         pad0x28_4IGLM[0x28];                               // 0x30(0x28)
};


// Size 0x150 (Full Size[0x208] - InheritedSize[0xb8]
class LinkerPlaceholderFunction: public Function
{
public:
	char                                                         pad0x150_QB228[0x150];                             // 0xb8(0x150)
};


// Size 0x150 (Full Size[0x310] - InheritedSize[0x1c0]
class LinkerPlaceholderClass: public Class
{
public:
	char                                                         pad0x150_6QMSQ[0x150];                             // 0x1c0(0x150)
};


// Size 0x0 (Full Size[0xb8] - InheritedSize[0xb8]
class DelegateFunction: public Function
{
public:
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class MulticastDelegateProperty: public Property
{
public:
	char                                                         pad0x8_EMJ0O[0x8];                                 // 0x70(0x8)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MapProperty: public Property
{
public:
	char                                                         pad0x38_EFYV4[0x38];                               // 0x70(0x38)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class NumericProperty: public Property
{
public:
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class GCObjectReferencer: public Object
{
public:
	char                                                         pad0x38_YGN2S[0x38];                               // 0x28(0x38)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class MetaData: public Object
{
public:
	char                                                         pad0x50_UPPVZ[0x50];                               // 0x28(0x50)
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class InterfaceProperty: public Property
{
public:
	char                                                         pad0x8_8PX9D[0x8];                                 // 0x70(0x8)
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class StructProperty: public Property
{
public:
	char                                                         pad0x8_3DA10[0x8];                                 // 0x70(0x8)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class TextProperty: public Property
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface: public Object
{
public:
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class ArrayProperty: public Property
{
public:
	char                                                         pad0x8_H401J[0x8];                                 // 0x70(0x8)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class StrProperty: public Property
{
public:
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class Package: public Object
{
public:
	char                                                         pad0x58_WV3YZ[0x58];                               // 0x28(0x58)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class PackageMap: public Object
{
public:
	char                                                         pad0x28_VXRT1[0x28];                               // 0x28(0x28)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class NameProperty: public Property
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ObjectRedirector: public Object
{
public:
	char                                                         pad0x8_1LL7Y[0x8];                                 // 0x28(0x8)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class LinkerPlaceholderExportObject: public Object
{
public:
	char                                                         pad0x60_YKJUR[0x60];                               // 0x28(0x60)
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class ObjectPropertyBase: public Property
{
public:
	char                                                         pad0x8_2VKV6[0x8];                                 // 0x70(0x8)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class ScriptStruct: public Struct
{
public:
	char                                                         pad0x10_P0AS0[0x10];                               // 0x88(0x10)
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class ByteProperty: public NumericProperty
{
public:
	char                                                         pad0x8_61H7A[0x8];                                 // 0x70(0x8)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class UInt16Property: public NumericProperty
{
public:
};


// Size 0x0 (Full Size[0x78] - InheritedSize[0x78]
class AssetObjectProperty: public ObjectPropertyBase
{
public:
};


// Size 0x0 (Full Size[0x78] - InheritedSize[0x78]
class WeakObjectProperty: public ObjectPropertyBase
{
public:
};


// Size 0x0 (Full Size[0x78] - InheritedSize[0x78]
class LazyObjectProperty: public ObjectPropertyBase
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class Int16Property: public NumericProperty
{
public:
};


// Size 0x0 (Full Size[0x78] - InheritedSize[0x78]
class MulticastInlineDelegateProperty: public MulticastDelegateProperty
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class Int64Property: public NumericProperty
{
public:
};


// Size 0x10 (Full Size[0xc8] - InheritedSize[0xb8]
class SparseDelegateFunction: public DelegateFunction
{
public:
	char                                                         pad0x10_04PMW[0x10];                               // 0xb8(0x10)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class UInt64Property: public NumericProperty
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class DoubleProperty: public NumericProperty
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class UInt32Property: public NumericProperty
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class FloatProperty: public NumericProperty
{
public:
};


// Size 0x0 (Full Size[0x78] - InheritedSize[0x78]
class ObjectProperty: public ObjectPropertyBase
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class IntProperty: public NumericProperty
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class Int8Property: public NumericProperty
{
public:
};


// Size 0x8 (Full Size[0x80] - InheritedSize[0x78]
class AssetClassProperty: public AssetObjectProperty
{
public:
	char                                                         pad0x8_9AJ2L[0x8];                                 // 0x78(0x8)
};


// Size 0x8 (Full Size[0x80] - InheritedSize[0x78]
class ClassProperty: public ObjectProperty
{
public:
	char                                                         pad0x8_IZTC9[0x8];                                 // 0x78(0x8)
};


