#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "CrouchingFramework_Structs.h"


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class CrouchDataAsset: public DataAsset
{
public:
	float                                                        EnterCrouchResetTime;                              // 0x28(0x4)
	float                                                        PostCrouchResetTime;                               // 0x2c(0x4)
	float                                                        PostCrouchStealthModeResetTime;                    // 0x30(0x4)
	float                                                        CrouchCancelAfterFallingTime;                      // 0x34(0x4)
	float                                                        ProjectileCapsuleZModifierWhenCrouching;           // 0x38(0x4)
	struct Vector                                                KnockbackModifierForCrouchingPlayers;              // 0x3c(0xc)
	float                                                        CrouchDistanceThresholdToSendStat;                 // 0x48(0x4)
	float                                                        NearbyPlayersRangeToSendStat;                      // 0x4c(0x4)
	float                                                        TimeToBeNearbyPlayersToSendStat;                   // 0x50(0x4)
	char                                                         pad0x4_XR5XW[0x4];                                 // 0x54(0x4)
	class MaterialInterface*                                     CrouchVignette;                                    // 0x58(0x8)
	float                                                        MaxAnimValue;                                      // 0x60(0x4)
	float                                                        BlurStrength;                                      // 0x64(0x4)
	float                                                        VignetteStrength;                                  // 0x68(0x4)
	float                                                        VignetteSpeedModifier;                             // 0x6c(0x4)
	class WwiseEvent*                                            CrouchStartEvent;                                  // 0x70(0x8)
	class WwiseEvent*                                            CrouchEndEvent;                                    // 0x78(0x8)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class IsTargetCrouchingStatCondition: public TargetedStatCondition
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class CrouchedDistanceConditionalStatsTrigger: public ConditionalStatsTriggerType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CrouchActionStateId: public ActionStateId
{
public:
};


