// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x18
struct CustomServerEvent
{
public:
	char                                                         pad0x8_RCJG7[0x8];                                 // 0x0(0x8)
	struct FName                                                 EventID;                                           // 0x8(0x8)
	struct DateTime                                              ServerTimeUTC;                                     // 0x10(0x8)
};


// Size 0x28
struct OnRelaodAmmoCustomServerEvent
{
public:
	char                                                         pad0x20_7WLMW[0x20];                               // 0x0(0x20)
	int                                                          AvailableAmmoToAdd;                                // 0x20(0x4)
	int                                                          CurrentAmmoAfterReload;                            // 0x24(0x4)
};


// Size 0x20
struct EntityCustomServerEvent
{
public:
	char                                                         pad0x18_8T8PX[0x18];                               // 0x0(0x18)
	int                                                          EntityNetId;                                       // 0x18(0x4)
	char                                                         pad0x4_9WOGY[0x4];                                 // 0x1c(0x4)
};


// Size 0x28
struct OnItemPlacedInChestCustomServerEvent
{
public:
	char                                                         pad0x20_P6B7S[0x20];                               // 0x0(0x20)
	int                                                          ChestId;                                           // 0x20(0x4)
	int                                                          ItemId;                                            // 0x24(0x4)
};


// Size 0x38
struct OnCannonBallHitShipCustomServerEvent
{
public:
	char                                                         pad0x20_0AA1J[0x20];                               // 0x0(0x20)
	struct FString                                               CannonBallType;                                    // 0x20(0x10)
	int                                                          ShipId;                                            // 0x30(0x4)
	char                                                         pad0x4_EG2ZB[0x4];                                 // 0x34(0x4)
};


// Size 0x28
struct PlayerCharacterEnteredShipCustomServerEvent
{
public:
	char                                                         pad0x20_BCDLY[0x20];                               // 0x0(0x20)
	int                                                          UserId;                                            // 0x20(0x4)
	int                                                          ShipId;                                            // 0x24(0x4)
};


// Size 0x20
struct FortKeyUsedCustomServerEvent
{
public:
	char                                                         pad0x20_NMAUK[0x20];                               // 0x0(0x20)
};


// Size 0x60
struct TreasureSoldCustomServerEvent
{
public:
	char                                                         pad0x20_BUR7I[0x20];                               // 0x0(0x20)
	struct FString                                               CrewId;                                            // 0x20(0x10)
	struct FString                                               TreasureType;                                      // 0x30(0x10)
	struct FString                                               VendorId;                                          // 0x40(0x10)
	struct FString                                               CompanyId;                                         // 0x50(0x10)
};


// Size 0x20
struct TreasurePickedUpCustomServerEvent
{
public:
	char                                                         pad0x20_S2OMI[0x20];                               // 0x0(0x20)
};


// Size 0x30
struct TreasureFoundCustomServerEvent
{
public:
	char                                                         pad0x20_H2Z4P[0x20];                               // 0x0(0x20)
	struct FString                                               TreasureType;                                      // 0x20(0x10)
};


// Size 0x40
struct TreasureDroppedCustomServerEvent
{
public:
	char                                                         pad0x20_I4GUZ[0x20];                               // 0x0(0x20)
	struct FString                                               TreasureType;                                      // 0x20(0x10)
	struct Vector                                                Position;                                          // 0x30(0xc)
	char                                                         pad0x4_1N8S9[0x4];                                 // 0x3c(0x4)
};


// Size 0x28
struct TinySharkDespawnCustomServerEvent
{
public:
	char                                                         pad0x20_NEPRP[0x20];                               // 0x0(0x20)
	byte                                                         Reason;                                            // 0x20(0x1)
	char                                                         pad0x7_7Z5QA[0x7];                                 // 0x21(0x7)
};


// Size 0x28
struct KrakenDespawnCustomServerEvent
{
public:
	char                                                         pad0x20_MRI0Q[0x20];                               // 0x0(0x20)
	byte                                                         Reason;                                            // 0x20(0x1)
	char                                                         pad0x7_1EUTE[0x7];                                 // 0x21(0x7)
};


// Size 0x20
struct KrakenTentacleDestroyedCustomServerEvent
{
public:
	char                                                         pad0x20_KGND1[0x20];                               // 0x0(0x20)
};


// Size 0x30
struct CookStartCustomServerEvent
{
public:
	char                                                         pad0x20_CZHD8[0x20];                               // 0x0(0x20)
	struct FString                                               FoodType;                                          // 0x20(0x10)
};


// Size 0x40
struct CookEndCustomServerEvent
{
public:
	char                                                         pad0x20_OTZA8[0x20];                               // 0x0(0x20)
	struct FString                                               FoodType;                                          // 0x20(0x10)
	struct FString                                               CookedState;                                       // 0x30(0x10)
};


// Size 0x30
struct ShipSpawnedCustomServerEvent
{
public:
	char                                                         pad0x20_N1VM4[0x20];                               // 0x0(0x20)
	struct FString                                               ShipType;                                          // 0x20(0x10)
};


// Size 0x28
struct ShipRepairCustomServerEvent
{
public:
	char                                                         pad0x20_COKSJ[0x20];                               // 0x0(0x20)
	int                                                          UserId;                                            // 0x20(0x4)
	int                                                          ShipId;                                            // 0x24(0x4)
};


// Size 0x20
struct ShipOnFireEndCustomServerEvent
{
public:
	char                                                         pad0x20_8VE8O[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct ShipMastCollapseStateCustomServerEvent
{
public:
	char                                                         pad0x20_1LF1R[0x20];                               // 0x0(0x20)
	int                                                          ShipId;                                            // 0x20(0x4)
	int                                                          MastId;                                            // 0x24(0x4)
};


// Size 0x20
struct ShipDestroyedCustomServerEvent
{
public:
	char                                                         pad0x20_5NNFK[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct ShipDamagedCustomServerEvent
{
public:
	char                                                         pad0x20_ZO9XC[0x20];                               // 0x0(0x20)
	int                                                          Damage;                                            // 0x20(0x4)
	char                                                         pad0x4_HYYHA[0x4];                                 // 0x24(0x4)
};


// Size 0x20
struct ProjectileWeaponFiredCustomServerEvent
{
public:
	char                                                         pad0x20_ARKE2[0x20];                               // 0x0(0x20)
};


// Size 0x38
struct ProjectileHitCustomServerEvent
{
public:
	char                                                         pad0x20_X85X9[0x20];                               // 0x0(0x20)
	struct FString                                               ProjectileType;                                    // 0x20(0x10)
	int                                                          RecipientId;                                       // 0x30(0x4)
	char                                                         pad0x4_VMO8T[0x4];                                 // 0x34(0x4)
};


// Size 0x30
struct PlayerStatusEffectActivatedCustomServerEvent
{
public:
	char                                                         pad0x20_2MOBW[0x20];                               // 0x0(0x20)
	struct FString                                               Effect;                                            // 0x20(0x10)
};


// Size 0x30
struct PlayerStatusEffectDeactivatedCustomServerEvent
{
public:
	char                                                         pad0x20_0ANOE[0x20];                               // 0x0(0x20)
	struct FString                                               Effect;                                            // 0x20(0x10)
};


// Size 0x28
struct PlayerSpawnCustomServerEvent
{
public:
	char                                                         pad0x20_K2M1F[0x20];                               // 0x0(0x20)
	int                                                          PlayerStateId;                                     // 0x20(0x4)
	byte                                                         CharacterType;                                     // 0x24(0x1)
	char                                                         pad0x3_MD302[0x3];                                 // 0x25(0x3)
};


// Size 0x30
struct PlayerSetFootLocationCustomServerEvent
{
public:
	char                                                         pad0x20_69101[0x20];                               // 0x0(0x20)
	struct FString                                               IslandName;                                        // 0x20(0x10)
};


// Size 0x28
struct PlayerRevivalCustomServerEvent
{
public:
	char                                                         pad0x28_1DQZI[0x28];                               // 0x0(0x28)
};


// Size 0x20
struct PlayerRadialChatCustomServerEvent
{
public:
	char                                                         pad0x20_83DWD[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct PlayerLeftGhostShipCustomServerEvent
{
public:
	char                                                         pad0x20_26XC5[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct PlayerKillAICustomServerEvent
{
public:
	char                                                         pad0x20_P0I8B[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct PlayerItemUsageStartCustomServerEvent
{
public:
	char                                                         pad0x20_283GI[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct PlayerItemUsageEndCustomServerEvent
{
public:
	char                                                         pad0x20_CWLUK[0x20];                               // 0x0(0x20)
};


// Size 0x30
struct PlayerItemRetrievalFromContainerCustomServerEvent
{
public:
	char                                                         pad0x20_ABLXU[0x20];                               // 0x0(0x20)
	struct FString                                               RetrievedItemName;                                 // 0x20(0x10)
};


// Size 0x20
struct PlayerItemEquipCustomServerEvent
{
public:
	char                                                         pad0x20_KNKAR[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct PlayerItemAddToContainerCustomServerEvent
{
public:
	char                                                         pad0x20_0GBWS[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct PlayerInReviveableStateCustomServerEvent
{
public:
	char                                                         pad0x20_45NNI[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct PlayerHeartbeatCustomServerEvent
{
public:
	char                                                         pad0x20_TT3E7[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct PlayerHealthChangeCustomServerEvent
{
public:
	char                                                         pad0x20_Z2BNU[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct PlayerGameFishingStartedCustomServerEvent
{
public:
	char                                                         pad0x20_AH8UW[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct PlayerEncounterStartCustomServerEvent
{
public:
	char                                                         pad0x20_CO450[0x20];                               // 0x0(0x20)
	byte                                                         EncounterType;                                     // 0x20(0x1)
	char                                                         pad0x7_SWVJD[0x7];                                 // 0x21(0x7)
};


// Size 0x28
struct PlayerEncounterEndCustomServerEvent
{
public:
	char                                                         pad0x20_BME3K[0x20];                               // 0x0(0x20)
	byte                                                         EncounterType;                                     // 0x20(0x1)
	char                                                         pad0x7_HCDP1[0x7];                                 // 0x21(0x7)
};


// Size 0x30
struct PlayerEmoteEndCustomServerEvent
{
public:
	char                                                         pad0x20_I0KBF[0x20];                               // 0x0(0x20)
	struct FString                                               Emote;                                             // 0x20(0x10)
};


// Size 0x30
struct PlayerEmoteStartCustomServerEvent
{
public:
	char                                                         pad0x20_CT5KZ[0x20];                               // 0x0(0x20)
	struct FString                                               Emote;                                             // 0x20(0x10)
};


// Size 0x28
struct PlayerDeathCustomServerEvent
{
public:
	char                                                         pad0x20_P0E62[0x20];                               // 0x0(0x20)
	int                                                          KillerID;                                          // 0x20(0x4)
	char                                                         pad0x4_2WHAA[0x4];                                 // 0x24(0x4)
};


// Size 0x28
struct PlayerChangedShipLoadoutCustomServerEvent
{
public:
	char                                                         pad0x20_1R4AQ[0x20];                               // 0x0(0x20)
	int                                                          ShipId;                                            // 0x20(0x4)
	char                                                         pad0x4_KZSMR[0x4];                                 // 0x24(0x4)
};


// Size 0x20
struct PlayerChangedLoadoutCustomServerEvent
{
public:
	char                                                         pad0x20_HPE6S[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct PlayerCapstanUsageStartCustomServerEvent
{
public:
	char                                                         pad0x20_O8EYS[0x20];                               // 0x0(0x20)
	int                                                          ShipId;                                            // 0x20(0x4)
	char                                                         pad0x4_3YAO3[0x4];                                 // 0x24(0x4)
};


// Size 0x28
struct PlayerCapstanUsageEndCustomServerEvent
{
public:
	char                                                         pad0x20_6KQEU[0x20];                               // 0x0(0x20)
	int                                                          ShipId;                                            // 0x20(0x4)
	int                                                          CapstanState;                                      // 0x24(0x4)
};


// Size 0x20
struct PlayerBucketScoopCustomServerEvent
{
public:
	char                                                         pad0x20_96GV2[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct PlayerBucketEmptyCustomServerEvent
{
public:
	char                                                         pad0x20_E5OVM[0x20];                               // 0x0(0x20)
	bool                                                         AtWielder;                                         // 0x20(0x1)
	char                                                         pad0x7_KZ5GJ[0x7];                                 // 0x21(0x7)
};


// Size 0x28
struct PlayerActionCannonCustomServerEvent
{
public:
	char                                                         pad0x20_C2NI1[0x20];                               // 0x0(0x20)
	int                                                          ShipId;                                            // 0x20(0x4)
	char                                                         pad0x4_JW9TZ[0x4];                                 // 0x24(0x4)
};


// Size 0x30
struct PlayerActionCustomServerEvent
{
public:
	char                                                         pad0x20_06W4W[0x20];                               // 0x0(0x20)
	struct FString                                               Action;                                            // 0x20(0x10)
};


// Size 0x20
struct MermaidUsedCustomServerEvent
{
public:
	char                                                         pad0x20_JGWJ8[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct MeleeWeaponAttackCustomServerEvent
{
public:
	char                                                         pad0x20_JCJ5C[0x20];                               // 0x0(0x20)
	int                                                          Type;                                              // 0x20(0x4)
	char                                                         pad0x4_6A30Q[0x4];                                 // 0x24(0x4)
};


// Size 0x28
struct CustomTriggerOverlapEndCustomServerEvent
{
public:
	char                                                         pad0x20_5VF7A[0x20];                               // 0x0(0x20)
	int                                                          OtherNetId;                                        // 0x20(0x4)
	char                                                         pad0x4_L8NYO[0x4];                                 // 0x24(0x4)
};


// Size 0x28
struct CustomTriggerOverlapBeginCustomServerEvent
{
public:
	char                                                         pad0x20_A8A8Z[0x20];                               // 0x0(0x20)
	int                                                          OtherNetId;                                        // 0x20(0x4)
	char                                                         pad0x4_IU19M[0x4];                                 // 0x24(0x4)
};


// Size 0x30
struct AISpawnCustomServerEvent
{
public:
	char                                                         pad0x20_FOFLK[0x20];                               // 0x0(0x20)
	struct FString                                               AIType;                                            // 0x20(0x10)
};


// Size 0x20
struct AIShipSpawnCustomServerEvent
{
public:
	char                                                         pad0x20_75D13[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct AIShipDespawnCustomServerEvent
{
public:
	char                                                         pad0x20_GYHGQ[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct AIShipDamagedCustomServerEvent
{
public:
	char                                                         pad0x20_FGXNT[0x20];                               // 0x0(0x20)
	float                                                        AIShipWaterLevel;                                  // 0x20(0x4)
	char                                                         pad0x4_DCI04[0x4];                                 // 0x24(0x4)
};


// Size 0x20
struct OnCannonballLoadedOnCannonCustomServerEvent
{
public:
	char                                                         pad0x20_ILA1X[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct OnPlayerFiredFromCannonCustomServerEvent
{
public:
	char                                                         pad0x20_W5YR8[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct OnEnemyDeathCustomServerEvent
{
public:
	char                                                         pad0x20_HOC47[0x20];                               // 0x0(0x20)
	int                                                          KillerPlayerID;                                    // 0x20(0x4)
	char                                                         pad0x4_MMP9W[0x4];                                 // 0x24(0x4)
};


// Size 0x30
struct OnPlayerDigCustomServerEvent
{
public:
	char                                                         pad0x20_8BSRJ[0x20];                               // 0x0(0x20)
	struct Vector                                                Location;                                          // 0x20(0xc)
	char                                                         pad0x4_QT9TI[0x4];                                 // 0x2c(0x4)
};


// Size 0x30
struct OnPlayerStartsNPCInteractionCustomServerEvent
{
public:
	char                                                         pad0x20_A3O53[0x20];                               // 0x0(0x20)
	struct FString                                               NPCName;                                           // 0x20(0x10)
};


// Size 0x20
struct OnPlayerJoinsMapTableCustomServerEvent
{
public:
	char                                                         pad0x20_UL9CV[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct OnHarpoonShotHitCustomServerEvent
{
public:
	char                                                         pad0x20_5BY26[0x20];                               // 0x0(0x20)
	int                                                          ActorTetheredTo;                                   // 0x20(0x4)
	char                                                         pad0x4_Y3DA8[0x4];                                 // 0x24(0x4)
};


// Size 0x28
struct OnHarpoonShotShotCustomServerEvent
{
public:
	char                                                         pad0x20_H4L5L[0x20];                               // 0x0(0x20)
	int                                                          HarpoonId;                                         // 0x20(0x4)
	char                                                         pad0x4_JRT0E[0x4];                                 // 0x24(0x4)
};


// Size 0x20
struct OnPlayerInsideCannonCustomServerEvent
{
public:
	char                                                         pad0x20_YTEX8[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct OnPlayerAteCustomServerEvent
{
public:
	char                                                         pad0x20_2C312[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct ShipSinkingCustomServerEvent
{
public:
	char                                                         pad0x20_JM3DH[0x20];                               // 0x0(0x20)
};


// Size 0x30
struct HoleFixedForShipCustomServerEvent
{
public:
	char                                                         pad0x20_GCOYZ[0x20];                               // 0x0(0x20)
	float                                                        RepairPercentage;                                  // 0x20(0x4)
	int                                                          RepairingActor;                                    // 0x24(0x4)
	bool                                                         RepairCompleted;                                   // 0x28(0x1)
	char                                                         pad0x7_9ENP9[0x7];                                 // 0x29(0x7)
};


// Size 0x28
struct MermaidSpawnedCustomServerEvent
{
public:
	char                                                         pad0x18_HME3C[0x18];                               // 0x0(0x18)
	struct Vector                                                Position;                                          // 0x18(0xc)
	int                                                          PlayerId;                                          // 0x24(0x4)
};


// Size 0x18
struct GlobalCustomServerEvent
{
public:
	char                                                         pad0x18_9GZ36[0x18];                               // 0x0(0x18)
};


// Size 0x18
struct PlayerLookingAtMapCustomServerEvent
{
public:
	char                                                         pad0x18_J2DU1[0x18];                               // 0x0(0x18)
};


// Size 0x30
struct OnQuestStartedCustomServerEvent
{
public:
	char                                                         pad0x18_4OE7I[0x18];                               // 0x0(0x18)
	byte                                                         QuestType;                                         // 0x18(0x1)
	char                                                         pad0x3_6OCEV[0x3];                                 // 0x19(0x3)
	struct Guid                                                  CrewId;                                            // 0x1c(0x10)
	char                                                         pad0x4_DHRQ2[0x4];                                 // 0x2c(0x4)
};


// Size 0x50
struct OnVoyageStartedCustomServerEvent
{
public:
	char                                                         pad0x18_KZS1N[0x18];                               // 0x0(0x18)
	struct FString                                               CompanyDisplayName;                                // 0x18(0x10)
	int                                                          Rank;                                              // 0x28(0x4)
	char                                                         pad0x4_EZ6QG[0x4];                                 // 0x2c(0x4)
	struct FString                                               Title;                                             // 0x30(0x10)
	struct Guid                                                  CrewId;                                            // 0x40(0x10)
};


// Size 0x28
struct OnVoyageCancelledCustomServerEvent
{
public:
	char                                                         pad0x18_3OTF0[0x18];                               // 0x0(0x18)
	struct FString                                               AssociatedCrew;                                    // 0x18(0x10)
};


// Size 0x40
struct OnVoyageAcceptedCustomServerEvent
{
public:
	char                                                         pad0x18_BS2VA[0x18];                               // 0x0(0x18)
	struct FString                                               CompanyDisplayName;                                // 0x18(0x10)
	int                                                          Rank;                                              // 0x28(0x4)
	char                                                         pad0x4_YO5TW[0x4];                                 // 0x2c(0x4)
	struct FString                                               Title;                                             // 0x30(0x10)
};


// Size 0x18
struct OnQuestAcceptedCustomServerEvent
{
public:
	char                                                         pad0x18_YF5UV[0x18];                               // 0x0(0x18)
};


// Size 0x20
struct WatercraftDespawnCustomServerEvent
{
public:
	char                                                         pad0x18_MKJ7R[0x18];                               // 0x0(0x18)
	int                                                          WatercraftId;                                      // 0x18(0x4)
	char                                                         pad0x4_QI8KL[0x4];                                 // 0x1c(0x4)
};


// Size 0x18
struct TreasureSpawnedCustomServerEvent
{
public:
	char                                                         pad0x18_2HSD1[0x18];                               // 0x0(0x18)
};


// Size 0x38
struct KrakenSpawnCustomServerEvent
{
public:
	char                                                         pad0x18_DWMEN[0x18];                               // 0x0(0x18)
	struct Vector                                                SpawnLocation;                                     // 0x18(0xc)
	int                                                          TrackedShipId;                                     // 0x24(0x4)
	int                                                          KrakenId;                                          // 0x28(0x4)
	int                                                          NumberOfTentacles;                                 // 0x2c(0x4)
	int                                                          NumberOfKilledTentaclesToDismissKraken;            // 0x30(0x4)
	char                                                         pad0x4_03CYP[0x4];                                 // 0x34(0x4)
};


// Size 0x20
struct WatercraftSpawnCustomServerEvent
{
public:
	char                                                         pad0x18_X2I3E[0x18];                               // 0x0(0x18)
	int                                                          EntityNetId;                                       // 0x18(0x4)
	char                                                         pad0x4_3GQ62[0x4];                                 // 0x1c(0x4)
};


// Size 0x20
struct ActorSpawnCustomServerEvent
{
public:
	char                                                         pad0x18_SVI70[0x18];                               // 0x0(0x18)
	int                                                          EntityNetId;                                       // 0x18(0x4)
	char                                                         pad0x4_YEEVO[0x4];                                 // 0x1c(0x4)
};


// Size 0x30
struct ItemSpawnCustomServerEvent
{
public:
	char                                                         pad0x18_LZED7[0x18];                               // 0x0(0x18)
	int                                                          EntityNetId;                                       // 0x18(0x4)
	char                                                         pad0x4_U0XYR[0x4];                                 // 0x1c(0x4)
	struct FString                                               ItemType;                                          // 0x20(0x10)
};


// Size 0x28
struct FortWaveCompletedCustomServerEvent
{
public:
	char                                                         pad0x18_2KM8M[0x18];                               // 0x0(0x18)
	struct FString                                               InCrewId;                                          // 0x18(0x10)
};


// Size 0x28
struct CrewSessionLeaveCustomServerEvent
{
public:
	char                                                         pad0x18_8ZQ4C[0x18];                               // 0x0(0x18)
	struct FString                                               CrewId;                                            // 0x18(0x10)
};


// Size 0x30
struct CrewPlayerLeftCustomServerEvent
{
public:
	char                                                         pad0x18_JWVK6[0x18];                               // 0x0(0x18)
	struct FString                                               CrewId;                                            // 0x18(0x10)
	int                                                          PlayerId;                                          // 0x28(0x4)
	char                                                         pad0x4_KI3BL[0x4];                                 // 0x2c(0x4)
};


// Size 0x30
struct TinySharkSpawnCustomServerEvent
{
public:
	char                                                         pad0x18_M14EG[0x18];                               // 0x0(0x18)
	int                                                          TinySharkId;                                       // 0x18(0x4)
	struct Vector                                                SpawnLocation;                                     // 0x1c(0xc)
	int                                                          TrackedShipId;                                     // 0x28(0x4)
	char                                                         pad0x4_Y5VQL[0x4];                                 // 0x2c(0x4)
};


}