// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x18
struct CustomServerEvent
{
public:
	struct FName                                                 EventID;                                           // 0x8(0x8)
	Struct DateTime                                              ServerTimeUTC;                                     // 0x10(0x8)
};


// Size 0x28
struct OnRelaodAmmoCustomServerEvent
{
public:
	int                                                          AvailableAmmoToAdd;                                // 0x20(0x4)
	int                                                          CurrentAmmoAfterReload;                            // 0x24(0x4)
};


// Size 0x20
struct EntityCustomServerEvent
{
public:
	int                                                          EntityNetId;                                       // 0x18(0x4)
};


// Size 0x28
struct OnItemPlacedInChestCustomServerEvent
{
public:
	int                                                          ChestId;                                           // 0x20(0x4)
	int                                                          ItemId;                                            // 0x24(0x4)
};


// Size 0x38
struct OnCannonBallHitShipCustomServerEvent
{
public:
	Struct FString                                               CannonBallType;                                    // 0x20(0x10)
	int                                                          ShipId;                                            // 0x30(0x4)
};


// Size 0x28
struct PlayerCharacterEnteredShipCustomServerEvent
{
public:
	int                                                          UserId;                                            // 0x20(0x4)
	int                                                          ShipId;                                            // 0x24(0x4)
};


// Size 0x20
struct FortKeyUsedCustomServerEvent
{
public:
};


// Size 0x60
struct TreasureSoldCustomServerEvent
{
public:
	Struct FString                                               CrewId;                                            // 0x20(0x10)
	Struct FString                                               TreasureType;                                      // 0x30(0x10)
	Struct FString                                               VendorId;                                          // 0x40(0x10)
	Struct FString                                               CompanyId;                                         // 0x50(0x10)
};


// Size 0x20
struct TreasurePickedUpCustomServerEvent
{
public:
};


// Size 0x30
struct TreasureFoundCustomServerEvent
{
public:
	Struct FString                                               TreasureType;                                      // 0x20(0x10)
};


// Size 0x40
struct TreasureDroppedCustomServerEvent
{
public:
	Struct FString                                               TreasureType;                                      // 0x20(0x10)
	Struct Vector                                                Position;                                          // 0x30(0xc)
};


// Size 0x28
struct TinySharkDespawnCustomServerEvent
{
public:
	byte                                                         Reason;                                            // 0x20(0x1)
};


// Size 0x28
struct KrakenDespawnCustomServerEvent
{
public:
	byte                                                         Reason;                                            // 0x20(0x1)
};


// Size 0x20
struct KrakenTentacleDestroyedCustomServerEvent
{
public:
};


// Size 0x30
struct CookStartCustomServerEvent
{
public:
	Struct FString                                               FoodType;                                          // 0x20(0x10)
};


// Size 0x40
struct CookEndCustomServerEvent
{
public:
	Struct FString                                               FoodType;                                          // 0x20(0x10)
	Struct FString                                               CookedState;                                       // 0x30(0x10)
};


// Size 0x30
struct ShipSpawnedCustomServerEvent
{
public:
	Struct FString                                               ShipType;                                          // 0x20(0x10)
};


// Size 0x28
struct ShipRepairCustomServerEvent
{
public:
	int                                                          UserId;                                            // 0x20(0x4)
	int                                                          ShipId;                                            // 0x24(0x4)
};


// Size 0x20
struct ShipOnFireEndCustomServerEvent
{
public:
};


// Size 0x28
struct ShipMastCollapseStateCustomServerEvent
{
public:
	int                                                          ShipId;                                            // 0x20(0x4)
	int                                                          MastId;                                            // 0x24(0x4)
};


// Size 0x20
struct ShipDestroyedCustomServerEvent
{
public:
};


// Size 0x28
struct ShipDamagedCustomServerEvent
{
public:
	int                                                          Damage;                                            // 0x20(0x4)
};


// Size 0x20
struct ProjectileWeaponFiredCustomServerEvent
{
public:
};


// Size 0x38
struct ProjectileHitCustomServerEvent
{
public:
	Struct FString                                               ProjectileType;                                    // 0x20(0x10)
	int                                                          RecipientId;                                       // 0x30(0x4)
};


// Size 0x30
struct PlayerStatusEffectActivatedCustomServerEvent
{
public:
	Struct FString                                               Effect;                                            // 0x20(0x10)
};


// Size 0x30
struct PlayerStatusEffectDeactivatedCustomServerEvent
{
public:
	Struct FString                                               Effect;                                            // 0x20(0x10)
};


// Size 0x28
struct PlayerSpawnCustomServerEvent
{
public:
	int                                                          PlayerStateId;                                     // 0x20(0x4)
	byte                                                         CharacterType;                                     // 0x24(0x1)
};


// Size 0x30
struct PlayerSetFootLocationCustomServerEvent
{
public:
	Struct FString                                               IslandName;                                        // 0x20(0x10)
};


// Size 0x28
struct PlayerRevivalCustomServerEvent
{
public:
};


// Size 0x20
struct PlayerRadialChatCustomServerEvent
{
public:
};


// Size 0x20
struct PlayerLeftGhostShipCustomServerEvent
{
public:
};


// Size 0x20
struct PlayerKillAICustomServerEvent
{
public:
};


// Size 0x20
struct PlayerItemUsageStartCustomServerEvent
{
public:
};


// Size 0x20
struct PlayerItemUsageEndCustomServerEvent
{
public:
};


// Size 0x30
struct PlayerItemRetrievalFromContainerCustomServerEvent
{
public:
	Struct FString                                               RetrievedItemName;                                 // 0x20(0x10)
};


// Size 0x20
struct PlayerItemEquipCustomServerEvent
{
public:
};


// Size 0x20
struct PlayerItemAddToContainerCustomServerEvent
{
public:
};


// Size 0x20
struct PlayerInReviveableStateCustomServerEvent
{
public:
};


// Size 0x20
struct PlayerHeartbeatCustomServerEvent
{
public:
};


// Size 0x20
struct PlayerHealthChangeCustomServerEvent
{
public:
};


// Size 0x20
struct PlayerGameFishingStartedCustomServerEvent
{
public:
};


// Size 0x28
struct PlayerEncounterStartCustomServerEvent
{
public:
	byte                                                         EncounterType;                                     // 0x20(0x1)
};


// Size 0x28
struct PlayerEncounterEndCustomServerEvent
{
public:
	byte                                                         EncounterType;                                     // 0x20(0x1)
};


// Size 0x30
struct PlayerEmoteEndCustomServerEvent
{
public:
	Struct FString                                               Emote;                                             // 0x20(0x10)
};


// Size 0x30
struct PlayerEmoteStartCustomServerEvent
{
public:
	Struct FString                                               Emote;                                             // 0x20(0x10)
};


// Size 0x28
struct PlayerDeathCustomServerEvent
{
public:
	int                                                          KillerID;                                          // 0x20(0x4)
};


// Size 0x28
struct PlayerChangedShipLoadoutCustomServerEvent
{
public:
	int                                                          ShipId;                                            // 0x20(0x4)
};


// Size 0x20
struct PlayerChangedLoadoutCustomServerEvent
{
public:
};


// Size 0x28
struct PlayerCapstanUsageStartCustomServerEvent
{
public:
	int                                                          ShipId;                                            // 0x20(0x4)
};


// Size 0x28
struct PlayerCapstanUsageEndCustomServerEvent
{
public:
	int                                                          ShipId;                                            // 0x20(0x4)
	int                                                          CapstanState;                                      // 0x24(0x4)
};


// Size 0x20
struct PlayerBucketScoopCustomServerEvent
{
public:
};


// Size 0x28
struct PlayerBucketEmptyCustomServerEvent
{
public:
	bool                                                         AtWielder;                                         // 0x20(0x1)
};


// Size 0x28
struct PlayerActionCannonCustomServerEvent
{
public:
	int                                                          ShipId;                                            // 0x20(0x4)
};


// Size 0x30
struct PlayerActionCustomServerEvent
{
public:
	Struct FString                                               Action;                                            // 0x20(0x10)
};


// Size 0x20
struct MermaidUsedCustomServerEvent
{
public:
};


// Size 0x28
struct MeleeWeaponAttackCustomServerEvent
{
public:
	int                                                          Type;                                              // 0x20(0x4)
};


// Size 0x28
struct CustomTriggerOverlapEndCustomServerEvent
{
public:
	int                                                          OtherNetId;                                        // 0x20(0x4)
};


// Size 0x28
struct CustomTriggerOverlapBeginCustomServerEvent
{
public:
	int                                                          OtherNetId;                                        // 0x20(0x4)
};


// Size 0x30
struct AISpawnCustomServerEvent
{
public:
	Struct FString                                               AIType;                                            // 0x20(0x10)
};


// Size 0x20
struct AIShipSpawnCustomServerEvent
{
public:
};


// Size 0x20
struct AIShipDespawnCustomServerEvent
{
public:
};


// Size 0x28
struct AIShipDamagedCustomServerEvent
{
public:
	float                                                        AIShipWaterLevel;                                  // 0x20(0x4)
};


// Size 0x20
struct OnCannonballLoadedOnCannonCustomServerEvent
{
public:
};


// Size 0x20
struct OnPlayerFiredFromCannonCustomServerEvent
{
public:
};


// Size 0x28
struct OnEnemyDeathCustomServerEvent
{
public:
	int                                                          KillerPlayerID;                                    // 0x20(0x4)
};


// Size 0x30
struct OnPlayerDigCustomServerEvent
{
public:
	Struct Vector                                                Location;                                          // 0x20(0xc)
};


// Size 0x30
struct OnPlayerStartsNPCInteractionCustomServerEvent
{
public:
	Struct FString                                               NPCName;                                           // 0x20(0x10)
};


// Size 0x20
struct OnPlayerJoinsMapTableCustomServerEvent
{
public:
};


// Size 0x28
struct OnHarpoonShotHitCustomServerEvent
{
public:
	int                                                          ActorTetheredTo;                                   // 0x20(0x4)
};


// Size 0x28
struct OnHarpoonShotShotCustomServerEvent
{
public:
	int                                                          HarpoonId;                                         // 0x20(0x4)
};


// Size 0x20
struct OnPlayerInsideCannonCustomServerEvent
{
public:
};


// Size 0x20
struct OnPlayerAteCustomServerEvent
{
public:
};


// Size 0x20
struct ShipSinkingCustomServerEvent
{
public:
};


// Size 0x30
struct HoleFixedForShipCustomServerEvent
{
public:
	float                                                        RepairPercentage;                                  // 0x20(0x4)
	int                                                          RepairingActor;                                    // 0x24(0x4)
	bool                                                         RepairCompleted;                                   // 0x28(0x1)
};


// Size 0x28
struct MermaidSpawnedCustomServerEvent
{
public:
	Struct Vector                                                Position;                                          // 0x18(0xc)
	int                                                          PlayerId;                                          // 0x24(0x4)
};


// Size 0x18
struct GlobalCustomServerEvent
{
public:
};


// Size 0x18
struct PlayerLookingAtMapCustomServerEvent
{
public:
};


// Size 0x30
struct OnQuestStartedCustomServerEvent
{
public:
	byte                                                         QuestType;                                         // 0x18(0x1)
	char                                                         pad0x3_NYSWH[0x3];                                 // 0x19(0x3)
	Struct Guid                                                  CrewId;                                            // 0x1c(0x10)
};


// Size 0x50
struct OnVoyageStartedCustomServerEvent
{
public:
	Struct FString                                               CompanyDisplayName;                                // 0x18(0x10)
	int                                                          Rank;                                              // 0x28(0x4)
	char                                                         pad0x4_68281[0x4];                                 // 0x2c(0x4)
	Struct FString                                               Title;                                             // 0x30(0x10)
	Struct Guid                                                  CrewId;                                            // 0x40(0x10)
};


// Size 0x28
struct OnVoyageCancelledCustomServerEvent
{
public:
	Struct FString                                               AssociatedCrew;                                    // 0x18(0x10)
};


// Size 0x40
struct OnVoyageAcceptedCustomServerEvent
{
public:
	Struct FString                                               CompanyDisplayName;                                // 0x18(0x10)
	int                                                          Rank;                                              // 0x28(0x4)
	char                                                         pad0x4_9OQ4B[0x4];                                 // 0x2c(0x4)
	Struct FString                                               Title;                                             // 0x30(0x10)
};


// Size 0x18
struct OnQuestAcceptedCustomServerEvent
{
public:
};


// Size 0x20
struct WatercraftDespawnCustomServerEvent
{
public:
	int                                                          WatercraftId;                                      // 0x18(0x4)
};


// Size 0x18
struct TreasureSpawnedCustomServerEvent
{
public:
};


// Size 0x38
struct KrakenSpawnCustomServerEvent
{
public:
	Struct Vector                                                SpawnLocation;                                     // 0x18(0xc)
	int                                                          TrackedShipId;                                     // 0x24(0x4)
	int                                                          KrakenId;                                          // 0x28(0x4)
	int                                                          NumberOfTentacles;                                 // 0x2c(0x4)
	int                                                          NumberOfKilledTentaclesToDismissKraken;            // 0x30(0x4)
};


// Size 0x20
struct WatercraftSpawnCustomServerEvent
{
public:
	int                                                          EntityNetId;                                       // 0x18(0x4)
};


// Size 0x20
struct ActorSpawnCustomServerEvent
{
public:
	int                                                          EntityNetId;                                       // 0x18(0x4)
};


// Size 0x30
struct ItemSpawnCustomServerEvent
{
public:
	int                                                          EntityNetId;                                       // 0x18(0x4)
	char                                                         pad0x4_P2BAL[0x4];                                 // 0x1c(0x4)
	Struct FString                                               ItemType;                                          // 0x20(0x10)
};


// Size 0x28
struct FortWaveCompletedCustomServerEvent
{
public:
	Struct FString                                               InCrewId;                                          // 0x18(0x10)
};


// Size 0x28
struct CrewSessionLeaveCustomServerEvent
{
public:
	Struct FString                                               CrewId;                                            // 0x18(0x10)
};


// Size 0x30
struct CrewPlayerLeftCustomServerEvent
{
public:
	Struct FString                                               CrewId;                                            // 0x18(0x10)
	int                                                          PlayerId;                                          // 0x28(0x4)
};


// Size 0x30
struct TinySharkSpawnCustomServerEvent
{
public:
	int                                                          TinySharkId;                                       // 0x18(0x4)
	Struct Vector                                                SpawnLocation;                                     // 0x1c(0xc)
	int                                                          TrackedShipId;                                     // 0x28(0x4)
};


}