#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x1
struct CustomSeasRequestExitLobbyEvent
{
public:
	char                                                         pad0x1_4ICF8[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct CustomSeasSessionCodeRequestToGame
{
public:
	char                                                         pad0x1_6OJYJ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct CustomSeasOpenSessionToUI
{
public:
	char                                                         SessionType;                                       // 0x0(0x1)
};


// Size 0x10
struct CustomSeasHostUpdateSessionLaunchStateToGame
{
public:
	struct FString                                               NewState;                                          // 0x0(0x10)
};


// Size 0x1
struct CustomSeasSessionStartGameRequestToGame
{
public:
	char                                                         pad0x1_ULUVE[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct CustomSeasSessionDetailsRequestToGame
{
public:
	char                                                         pad0x1_YHQ03[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct CustomSeasRoleChangeToUI
{
public:
	struct FString                                               NewRole;                                           // 0x0(0x10)
};


// Size 0x10
struct CustomSeasSessionCodeUpdateToUI
{
public:
	struct FString                                               Code;                                              // 0x0(0x10)
};


// Size 0x1
struct CustomSeasSubscriptionStateRequestToGame
{
public:
	char                                                         pad0x1_DDEJA[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct CustomSeasSubscriptionStateUpdateToUI
{
public:
	struct FString                                               Status;                                            // 0x0(0x10)
	struct FString                                               SubscribedSince;                                   // 0x10(0x10)
};


// Size 0x50
struct CustomSeasSessionRosterPlayerInformation
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct FString                                               Gamertag;                                          // 0x10(0x10)
	struct FString                                               Role;                                              // 0x20(0x10)
	char                                                         Platform;                                          // 0x30(0x1)
	char                                                         pad0x7_U7YO7[0x7];                                 // 0x31(0x7)
	struct FString                                               ShipId;                                            // 0x38(0x10)
	bool                                                         IsSubscribed;                                      // 0x48(0x1)
	char                                                         pad0x7_RCS2G[0x7];                                 // 0x49(0x7)
};


// Size 0x10
struct CustomSeasSessionLaunchStateUpdateToUI
{
public:
	struct FString                                               NewState;                                          // 0x0(0x10)
};


// Size 0x1
struct CustomSeasRequestStartSessionEvent
{
public:
	char                                                         pad0x1_MY5HR[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct CustomSeasCreateSessionRequestToGame
{
public:
	struct FString                                               SessionType;                                       // 0x0(0x10)
	TArray<String>                                               Activities;                                        // 0x10(0x10)
	struct FString                                               SessionVisibility;                                 // 0x20(0x10)
};


// Size 0x1
struct CustomSeasExitSessionToGame
{
public:
	char                                                         pad0x1_EONHT[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct CustomSeasRequestCustomGameCreateLobbyEvent
{
public:
	char                                                         SessionType;                                       // 0x0(0x1)
};


// Size 0x48
struct CustomSeasSessionRosterShipInformation
{
public:
	struct FString                                               ShipId;                                            // 0x0(0x10)
	struct FString                                               ShipName;                                          // 0x10(0x10)
	struct FString                                               ShipIconUrl;                                       // 0x20(0x10)
	struct FString                                               ShipType;                                          // 0x30(0x10)
	bool                                                         IsDamaged;                                         // 0x40(0x1)
	char                                                         pad0x7_OJ65D[0x7];                                 // 0x41(0x7)
};


// Size 0x30
struct CustomSeasUISessionDetailsInformation
{
public:
	struct FString                                               PrimaryTag;                                        // 0x0(0x10)
	bool                                                         IsRarePreset;                                      // 0x10(0x1)
	char                                                         pad0x7_N6K6H[0x7];                                 // 0x11(0x7)
	TArray<String>                                               Activities;                                        // 0x18(0x10)
	bool                                                         PreferController;                                  // 0x28(0x1)
	bool                                                         ScoreboardsEnabled;                                // 0x29(0x1)
	char                                                         pad0x6_AQ78Q[0x6];                                 // 0x2a(0x6)
};


// Size 0x1
struct CustomSeasSessionRosterRequestToGame
{
public:
	char                                                         pad0x1_SUWA0[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct CustomSeasSessionDetailsUpdateToUI
{
public:
	struct CustomSeasUISessionDetailsInformation                 Details;                                           // 0x0(0x30)
};


// Size 0x20
struct CustomSeasSessionRosterUIInfo
{
public:
	TArray<struct CustomSeasSessionRosterPlayerInformation>      Players;                                           // 0x0(0x10)
	TArray<struct CustomSeasSessionRosterShipInformation>        Ships;                                             // 0x10(0x10)
};


// Size 0x20
struct CustomSeasSessionRosterUpdateToUI
{
public:
	struct CustomSeasSessionRosterUIInfo                         Roster;                                            // 0x0(0x20)
};


