#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class CustomMapData: public DataAsset
{
public:
	class UClass*                                                CustomMapItemDescClass;                            // 0x28(0x8)
	class Font*                                                  Font;                                              // 0x30(0x8)
	TArray<class CustomMapDataTypeBase*>                         MapDisplayItemList;                                // 0x38(0x10)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class CustomMapSettings: public DeveloperSettings
{
public:
	class UClass*                                                CustomMapItemDescClass;                            // 0x38(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class CustomMapDisplayObjectBase: public Object
{
public:
	struct                                                       Guid;                                              // 0x28(0x10)
};


// Size 0x30 (Full Size[0x8d0] - InheritedSize[0x8a0]
class CustomMap: public RenderToTextureMapBase
{
public:
	class Font*                                                  Font;                                              // 0x8a0(0x8)
	TArray<class CustomMapDisplayObjectBase*>                    DisplayItems;                                      // 0x8a8(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class CustomMapDataTypeBase: public Object
{
public:
	struct                                                       Guid;                                              // 0x28(0x10)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class CustomMapDisplayObjectPositional: public CustomMapDisplayObjectBase
{
public:
	struct                                                       Position;                                          // 0x38(0x8)
	float                                                        Orientation;                                       // 0x40(0x4)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class CustomMapDataTypePositional: public CustomMapDataTypeBase
{
public:
	struct                                                       Position;                                          // 0x38(0x8)
	float                                                        Orientation;                                       // 0x40(0x4)
};


// Size 0x48 (Full Size[0x90] - InheritedSize[0x48]
class CustomMapDataTypeText: public CustomMapDataTypePositional
{
public:
	struct FText                                                 Text;                                              // 0x48(0x38)
	float                                                        FontScale;                                         // 0x80(0x4)
	bool                                                         StrikeThrough;                                     // 0x84(0x1)
	float                                                        StrikethroughThickness;                            // 0x88(0x4)
};


// Size 0x90 (Full Size[0xd8] - InheritedSize[0x48]
class CustomMapDisplayObjectText: public CustomMapDisplayObjectPositional
{
public:
	struct FText                                                 Text;                                              // 0x48(0x38)
	float                                                        FontScale;                                         // 0x80(0x4)
	bool                                                         StrikeThrough;                                     // 0x84(0x1)
	float                                                        StrikethroughThickness;                            // 0x88(0x4)
};


