#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x28
struct OnHarpoonShotHitCustomServerEvent
{
public:
	char                                                         pad0x20_6Z4TS[0x20];                               // 0x0(0x20)
	int                                                          ActorTetheredTo;                                   // 0x20(0x4)
	char                                                         pad0x4_LDZJM[0x4];                                 // 0x24(0x4)
};


// Size 0x38
struct OnCannonBallHitShipCustomServerEvent
{
public:
	char                                                         pad0x20_FAZ18[0x20];                               // 0x0(0x20)
	struct FString                                               CannonBallType;                                    // 0x20(0x10)
	int                                                          ShipId;                                            // 0x30(0x4)
	char                                                         pad0x4_GMBHX[0x4];                                 // 0x34(0x4)
};


// Size 0x20
struct PlayerBucketScoopCustomServerEvent
{
public:
	char                                                         pad0x20_VJSA3[0x20];                               // 0x0(0x20)
};


// Size 0x18
struct PlayerLookingAtMapCustomServerEvent
{
public:
	char                                                         pad0x18_H6ONJ[0x18];                               // 0x0(0x18)
};


// Size 0x50
struct OnVoyageStartedCustomServerEvent
{
public:
	char                                                         pad0x18_PR804[0x18];                               // 0x0(0x18)
	struct FString                                               CompanyDisplayName;                                // 0x18(0x10)
	int                                                          Rank;                                              // 0x28(0x4)
	char                                                         pad0x4_C5KB8[0x4];                                 // 0x2c(0x4)
	struct FString                                               Title;                                             // 0x30(0x10)
	struct Guid                                                  CrewId;                                            // 0x40(0x10)
};


// Size 0x30
struct PlayerActionCustomServerEvent
{
public:
	char                                                         pad0x20_J7ZWI[0x20];                               // 0x0(0x20)
	struct FString                                               Action;                                            // 0x20(0x10)
};


// Size 0x28
struct PlayerEncounterEndCustomServerEvent
{
public:
	char                                                         pad0x20_Q40IA[0x20];                               // 0x0(0x20)
	char                                                         EncounterType;                                     // 0x20(0x1)
	char                                                         pad0x7_3ARPW[0x7];                                 // 0x21(0x7)
};


// Size 0x30
struct CookStartCustomServerEvent
{
public:
	char                                                         pad0x20_1O3EF[0x20];                               // 0x0(0x20)
	struct FString                                               FoodType;                                          // 0x20(0x10)
};


// Size 0x20
struct PlayerRadialChatCustomServerEvent
{
public:
	char                                                         pad0x20_ME6B5[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct PlayerChangedLoadoutCustomServerEvent
{
public:
	char                                                         pad0x20_4Q74F[0x20];                               // 0x0(0x20)
};


// Size 0x30
struct PlayerStatusEffectActivatedCustomServerEvent
{
public:
	char                                                         pad0x20_XX3AA[0x20];                               // 0x0(0x20)
	struct FString                                               Effect;                                            // 0x20(0x10)
};


// Size 0x28
struct CustomTriggerOverlapBeginCustomServerEvent
{
public:
	char                                                         pad0x20_S1YKV[0x20];                               // 0x0(0x20)
	int                                                          OtherNetId;                                        // 0x20(0x4)
	char                                                         pad0x4_WZMJD[0x4];                                 // 0x24(0x4)
};


// Size 0x38
struct KrakenSpawnCustomServerEvent
{
public:
	char                                                         pad0x18_JWA54[0x18];                               // 0x0(0x18)
	struct Vector                                                SpawnLocation;                                     // 0x18(0xc)
	int                                                          TrackedShipId;                                     // 0x24(0x4)
	int                                                          KrakenId;                                          // 0x28(0x4)
	int                                                          NumberOfTentacles;                                 // 0x2c(0x4)
	int                                                          NumberOfKilledTentaclesToDismissKraken;            // 0x30(0x4)
	char                                                         pad0x4_7138U[0x4];                                 // 0x34(0x4)
};


// Size 0x28
struct PlayerCharacterEnteredShipCustomServerEvent
{
public:
	char                                                         pad0x20_H7KIT[0x20];                               // 0x0(0x20)
	int                                                          UserId;                                            // 0x20(0x4)
	int                                                          ShipId;                                            // 0x24(0x4)
};


// Size 0x20
struct ShipSinkingCustomServerEvent
{
public:
	char                                                         pad0x20_M4IOZ[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct PlayerItemAddToContainerCustomServerEvent
{
public:
	char                                                         pad0x20_AAQFY[0x20];                               // 0x0(0x20)
};


// Size 0x40
struct TreasureDroppedCustomServerEvent
{
public:
	char                                                         pad0x20_KWOIO[0x20];                               // 0x0(0x20)
	struct FString                                               TreasureType;                                      // 0x20(0x10)
	struct Vector                                                Position;                                          // 0x30(0xc)
	char                                                         pad0x4_U26XV[0x4];                                 // 0x3c(0x4)
};


// Size 0x30
struct OnPlayerDigCustomServerEvent
{
public:
	char                                                         pad0x20_WHIAS[0x20];                               // 0x0(0x20)
	struct Vector                                                Location;                                          // 0x20(0xc)
	char                                                         pad0x4_VYYFU[0x4];                                 // 0x2c(0x4)
};


// Size 0x30
struct TreasureFoundCustomServerEvent
{
public:
	char                                                         pad0x20_2Q4BY[0x20];                               // 0x0(0x20)
	struct FString                                               TreasureType;                                      // 0x20(0x10)
};


// Size 0x20
struct ProjectileWeaponFiredCustomServerEvent
{
public:
	char                                                         pad0x20_POLE1[0x20];                               // 0x0(0x20)
};


// Size 0x30
struct PlayerEmoteEndCustomServerEvent
{
public:
	char                                                         pad0x20_EZ6X5[0x20];                               // 0x0(0x20)
	struct FString                                               Emote;                                             // 0x20(0x10)
};


// Size 0x18
struct OnQuestAcceptedCustomServerEvent
{
public:
	char                                                         pad0x18_QQXN1[0x18];                               // 0x0(0x18)
};


// Size 0x28
struct OnRelaodAmmoCustomServerEvent
{
public:
	char                                                         pad0x20_KWMVW[0x20];                               // 0x0(0x20)
	int                                                          AvailableAmmoToAdd;                                // 0x20(0x4)
	int                                                          CurrentAmmoAfterReload;                            // 0x24(0x4)
};


// Size 0x20
struct EntityCustomServerEvent
{
public:
	char                                                         pad0x18_S9BS1[0x18];                               // 0x0(0x18)
	int                                                          EntityNetId;                                       // 0x18(0x4)
	char                                                         pad0x4_970UZ[0x4];                                 // 0x1c(0x4)
};


// Size 0x30
struct HoleFixedForShipCustomServerEvent
{
public:
	char                                                         pad0x20_T1XAY[0x20];                               // 0x0(0x20)
	float                                                        RepairPercentage;                                  // 0x20(0x4)
	int                                                          RepairingActor;                                    // 0x24(0x4)
	bool                                                         RepairCompleted;                                   // 0x28(0x1)
	char                                                         pad0x7_L0ECZ[0x7];                                 // 0x29(0x7)
};


// Size 0x20
struct OnPlayerFiredFromCannonCustomServerEvent
{
public:
	char                                                         pad0x20_7GNLF[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct PlayerCapstanUsageStartCustomServerEvent
{
public:
	char                                                         pad0x20_USEH0[0x20];                               // 0x0(0x20)
	int                                                          ShipId;                                            // 0x20(0x4)
	char                                                         pad0x4_8OOWD[0x4];                                 // 0x24(0x4)
};


// Size 0x30
struct AISpawnCustomServerEvent
{
public:
	char                                                         pad0x20_TGDKR[0x20];                               // 0x0(0x20)
	struct FString                                               AIType;                                            // 0x20(0x10)
};


// Size 0x28
struct ShipRepairCustomServerEvent
{
public:
	char                                                         pad0x20_IJU5W[0x20];                               // 0x0(0x20)
	int                                                          UserId;                                            // 0x20(0x4)
	int                                                          ShipId;                                            // 0x24(0x4)
};


// Size 0x28
struct MeleeWeaponAttackCustomServerEvent
{
public:
	char                                                         pad0x20_FPBFP[0x20];                               // 0x0(0x20)
	int                                                          Type;                                              // 0x20(0x4)
	char                                                         pad0x4_NNYXP[0x4];                                 // 0x24(0x4)
};


// Size 0x28
struct CustomTriggerOverlapEndCustomServerEvent
{
public:
	char                                                         pad0x20_KN6EV[0x20];                               // 0x0(0x20)
	int                                                          OtherNetId;                                        // 0x20(0x4)
	char                                                         pad0x4_QKQTB[0x4];                                 // 0x24(0x4)
};


// Size 0x20
struct AIShipDespawnCustomServerEvent
{
public:
	char                                                         pad0x20_UJCLZ[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct PlayerSpawnCustomServerEvent
{
public:
	char                                                         pad0x20_3E66X[0x20];                               // 0x0(0x20)
	int                                                          PlayerStateId;                                     // 0x20(0x4)
	char                                                         CharacterType;                                     // 0x24(0x1)
	char                                                         pad0x3_ETT8Q[0x3];                                 // 0x25(0x3)
};


// Size 0x20
struct PlayerItemUsageStartCustomServerEvent
{
public:
	char                                                         pad0x20_NAY5V[0x20];                               // 0x0(0x20)
};


// Size 0x18
struct GlobalCustomServerEvent
{
public:
	char                                                         pad0x18_47SBH[0x18];                               // 0x0(0x18)
};


// Size 0x20
struct TreasurePickedUpCustomServerEvent
{
public:
	char                                                         pad0x20_2QI38[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct PlayerHealthChangeCustomServerEvent
{
public:
	char                                                         pad0x20_2O2EE[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct PlayerEncounterStartCustomServerEvent
{
public:
	char                                                         pad0x20_9IOLU[0x20];                               // 0x0(0x20)
	char                                                         EncounterType;                                     // 0x20(0x1)
	char                                                         pad0x7_60O0F[0x7];                                 // 0x21(0x7)
};


// Size 0x30
struct PlayerItemRetrievalFromContainerCustomServerEvent
{
public:
	char                                                         pad0x20_TEDGB[0x20];                               // 0x0(0x20)
	struct FString                                               RetrievedItemName;                                 // 0x20(0x10)
};


// Size 0x28
struct PlayerActionCannonCustomServerEvent
{
public:
	char                                                         pad0x20_KDTEI[0x20];                               // 0x0(0x20)
	int                                                          ShipId;                                            // 0x20(0x4)
	char                                                         pad0x4_TDVAM[0x4];                                 // 0x24(0x4)
};


// Size 0x38
struct ProjectileHitCustomServerEvent
{
public:
	char                                                         pad0x20_NBF38[0x20];                               // 0x0(0x20)
	struct FString                                               ProjectileType;                                    // 0x20(0x10)
	int                                                          RecipientId;                                       // 0x30(0x4)
	char                                                         pad0x4_PTQ35[0x4];                                 // 0x34(0x4)
};


// Size 0x20
struct PlayerGameFishingStartedCustomServerEvent
{
public:
	char                                                         pad0x20_LN174[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct PlayerBucketEmptyCustomServerEvent
{
public:
	char                                                         pad0x20_BEC17[0x20];                               // 0x0(0x20)
	bool                                                         AtWielder;                                         // 0x20(0x1)
	char                                                         pad0x7_QK1SP[0x7];                                 // 0x21(0x7)
};


// Size 0x20
struct KrakenTentacleDestroyedCustomServerEvent
{
public:
	char                                                         pad0x20_O4WU4[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct WatercraftDespawnCustomServerEvent
{
public:
	char                                                         pad0x18_004P9[0x18];                               // 0x0(0x18)
	int                                                          WatercraftId;                                      // 0x18(0x4)
	char                                                         pad0x4_FH5BN[0x4];                                 // 0x1c(0x4)
};


// Size 0x20
struct PlayerHeartbeatCustomServerEvent
{
public:
	char                                                         pad0x20_VY3LT[0x20];                               // 0x0(0x20)
};


// Size 0x18
struct CustomServerEvent
{
public:
	char                                                         pad0x8_A4FIU[0x8];                                 // 0x0(0x8)
	struct FName                                                 EventId;                                           // 0x8(0x8)
	struct DateTime                                              ServerTimeUTC;                                     // 0x10(0x8)
};


// Size 0x18
struct TreasureSpawnedCustomServerEvent
{
public:
	char                                                         pad0x18_GN3XR[0x18];                               // 0x0(0x18)
};


// Size 0x20
struct WatercraftSpawnCustomServerEvent
{
public:
	char                                                         pad0x18_WU7L6[0x18];                               // 0x0(0x18)
	int                                                          EntityNetId;                                       // 0x18(0x4)
	char                                                         pad0x4_BQSIV[0x4];                                 // 0x1c(0x4)
};


// Size 0x20
struct MermaidUsedCustomServerEvent
{
public:
	char                                                         pad0x20_XTQBV[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct OnPlayerJoinsMapTableCustomServerEvent
{
public:
	char                                                         pad0x20_NAAJK[0x20];                               // 0x0(0x20)
};


// Size 0x30
struct OnPlayerStartsNPCInteractionCustomServerEvent
{
public:
	char                                                         pad0x20_IBJZN[0x20];                               // 0x0(0x20)
	struct FString                                               NPCName;                                           // 0x20(0x10)
};


// Size 0x20
struct FortKeyUsedCustomServerEvent
{
public:
	char                                                         pad0x20_067BX[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct CrewSessionLeaveCustomServerEvent
{
public:
	char                                                         pad0x18_I3IVJ[0x18];                               // 0x0(0x18)
	struct FString                                               CrewId;                                            // 0x18(0x10)
};


// Size 0x28
struct OnHarpoonShotShotCustomServerEvent
{
public:
	char                                                         pad0x20_4ABTB[0x20];                               // 0x0(0x20)
	int                                                          HarpoonId;                                         // 0x20(0x4)
	char                                                         pad0x4_B2OYS[0x4];                                 // 0x24(0x4)
};


// Size 0x30
struct PlayerStatusEffectDeactivatedCustomServerEvent
{
public:
	char                                                         pad0x20_PDRUT[0x20];                               // 0x0(0x20)
	struct FString                                               Effect;                                            // 0x20(0x10)
};


// Size 0x60
struct TreasureSoldCustomServerEvent
{
public:
	char                                                         pad0x20_5MEQ9[0x20];                               // 0x0(0x20)
	struct FString                                               CrewId;                                            // 0x20(0x10)
	struct FString                                               TreasureType;                                      // 0x30(0x10)
	struct FString                                               VendorId;                                          // 0x40(0x10)
	struct FString                                               CompanyId;                                         // 0x50(0x10)
};


// Size 0x20
struct AIShipSpawnCustomServerEvent
{
public:
	char                                                         pad0x20_ANDT6[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct PlayerChangedShipLoadoutCustomServerEvent
{
public:
	char                                                         pad0x20_TPPTC[0x20];                               // 0x0(0x20)
	int                                                          ShipId;                                            // 0x20(0x4)
	char                                                         pad0x4_9JM3Z[0x4];                                 // 0x24(0x4)
};


// Size 0x28
struct TinySharkDespawnCustomServerEvent
{
public:
	char                                                         pad0x20_VJPCS[0x20];                               // 0x0(0x20)
	char                                                         Reason;                                            // 0x20(0x1)
	char                                                         pad0x7_BUL81[0x7];                                 // 0x21(0x7)
};


// Size 0x30
struct TinySharkSpawnCustomServerEvent
{
public:
	char                                                         pad0x18_TR6TV[0x18];                               // 0x0(0x18)
	int                                                          TinySharkId;                                       // 0x18(0x4)
	struct Vector                                                SpawnLocation;                                     // 0x1c(0xc)
	int                                                          TrackedShipId;                                     // 0x28(0x4)
	char                                                         pad0x4_5K2KL[0x4];                                 // 0x2c(0x4)
};


// Size 0x20
struct ShipOnFireEndCustomServerEvent
{
public:
	char                                                         pad0x20_ELLSP[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct PlayerDeathCustomServerEvent
{
public:
	char                                                         pad0x20_D5JWP[0x20];                               // 0x0(0x20)
	int                                                          KillerID;                                          // 0x20(0x4)
	char                                                         pad0x4_Q9CZD[0x4];                                 // 0x24(0x4)
};


// Size 0x30
struct ItemSpawnCustomServerEvent
{
public:
	char                                                         pad0x18_FLWSB[0x18];                               // 0x0(0x18)
	int                                                          EntityNetId;                                       // 0x18(0x4)
	char                                                         pad0x4_IUOFW[0x4];                                 // 0x1c(0x4)
	struct FString                                               ItemType;                                          // 0x20(0x10)
};


// Size 0x20
struct PlayerItemEquipCustomServerEvent
{
public:
	char                                                         pad0x20_BWGCH[0x20];                               // 0x0(0x20)
};


// Size 0x30
struct ShipSpawnedCustomServerEvent
{
public:
	char                                                         pad0x20_Q9PX1[0x20];                               // 0x0(0x20)
	struct FString                                               ShipType;                                          // 0x20(0x10)
};


// Size 0x28
struct OnItemPlacedInChestCustomServerEvent
{
public:
	char                                                         pad0x20_9FJ0G[0x20];                               // 0x0(0x20)
	int                                                          ChestId;                                           // 0x20(0x4)
	int                                                          ItemId;                                            // 0x24(0x4)
};


// Size 0x20
struct PlayerInReviveableStateCustomServerEvent
{
public:
	char                                                         pad0x20_EABFQ[0x20];                               // 0x0(0x20)
};


// Size 0x30
struct PlayerSetFootLocationCustomServerEvent
{
public:
	char                                                         pad0x20_L0IEF[0x20];                               // 0x0(0x20)
	struct FString                                               IslandName;                                        // 0x20(0x10)
};


// Size 0x20
struct ActorSpawnCustomServerEvent
{
public:
	char                                                         pad0x18_41B6P[0x18];                               // 0x0(0x18)
	int                                                          EntityNetId;                                       // 0x18(0x4)
	char                                                         pad0x4_5HLNV[0x4];                                 // 0x1c(0x4)
};


// Size 0x30
struct PlayerEmoteStartCustomServerEvent
{
public:
	char                                                         pad0x20_JJL9J[0x20];                               // 0x0(0x20)
	struct FString                                               Emote;                                             // 0x20(0x10)
};


// Size 0x20
struct PlayerItemUsageEndCustomServerEvent
{
public:
	char                                                         pad0x20_A8D94[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct ShipDamagedCustomServerEvent
{
public:
	char                                                         pad0x20_7IX6O[0x20];                               // 0x0(0x20)
	int                                                          Damage;                                            // 0x20(0x4)
	char                                                         pad0x4_RYX9B[0x4];                                 // 0x24(0x4)
};


// Size 0x20
struct OnPlayerAteCustomServerEvent
{
public:
	char                                                         pad0x20_GUDTO[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct OnCannonballLoadedOnCannonCustomServerEvent
{
public:
	char                                                         pad0x20_GYLFV[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct MermaidSpawnedCustomServerEvent
{
public:
	char                                                         pad0x18_XNUBI[0x18];                               // 0x0(0x18)
	struct Vector                                                Position;                                          // 0x18(0xc)
	int                                                          PlayerId;                                          // 0x24(0x4)
};


// Size 0x28
struct FortWaveCompletedCustomServerEvent
{
public:
	char                                                         pad0x18_ILANO[0x18];                               // 0x0(0x18)
	struct FString                                               InCrewId;                                          // 0x18(0x10)
};


// Size 0x30
struct CrewPlayerLeftCustomServerEvent
{
public:
	char                                                         pad0x18_YKSDJ[0x18];                               // 0x0(0x18)
	struct FString                                               CrewId;                                            // 0x18(0x10)
	int                                                          PlayerId;                                          // 0x28(0x4)
	char                                                         pad0x4_NB8OM[0x4];                                 // 0x2c(0x4)
};


// Size 0x28
struct PlayerRevivalCustomServerEvent
{
public:
	char                                                         pad0x28_PRDTP[0x28];                               // 0x0(0x28)
};


// Size 0x30
struct OnQuestStartedCustomServerEvent
{
public:
	char                                                         pad0x18_7E2AS[0x18];                               // 0x0(0x18)
	char                                                         QuestType;                                         // 0x18(0x1)
	char                                                         pad0x3_KFUKQ[0x3];                                 // 0x19(0x3)
	struct Guid                                                  CrewId;                                            // 0x1c(0x10)
	char                                                         pad0x4_UHHPP[0x4];                                 // 0x2c(0x4)
};


// Size 0x20
struct PlayerKillAICustomServerEvent
{
public:
	char                                                         pad0x20_X2V0X[0x20];                               // 0x0(0x20)
};


// Size 0x20
struct OnPlayerInsideCannonCustomServerEvent
{
public:
	char                                                         pad0x20_BT2FK[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct OnEnemyDeathCustomServerEvent
{
public:
	char                                                         pad0x20_M3YI7[0x20];                               // 0x0(0x20)
	int                                                          KillerPlayerID;                                    // 0x20(0x4)
	char                                                         pad0x4_4MQU6[0x4];                                 // 0x24(0x4)
};


// Size 0x40
struct CookEndCustomServerEvent
{
public:
	char                                                         pad0x20_VXL99[0x20];                               // 0x0(0x20)
	struct FString                                               FoodType;                                          // 0x20(0x10)
	struct FString                                               CookedState;                                       // 0x30(0x10)
};


// Size 0x40
struct OnVoyageAcceptedCustomServerEvent
{
public:
	char                                                         pad0x18_FWNUY[0x18];                               // 0x0(0x18)
	struct FString                                               CompanyDisplayName;                                // 0x18(0x10)
	int                                                          Rank;                                              // 0x28(0x4)
	char                                                         pad0x4_GD9FO[0x4];                                 // 0x2c(0x4)
	struct FString                                               Title;                                             // 0x30(0x10)
};


// Size 0x20
struct PlayerLeftGhostShipCustomServerEvent
{
public:
	char                                                         pad0x20_U02F8[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct KrakenDespawnCustomServerEvent
{
public:
	char                                                         pad0x20_DADDL[0x20];                               // 0x0(0x20)
	char                                                         Reason;                                            // 0x20(0x1)
	char                                                         pad0x7_F4QWD[0x7];                                 // 0x21(0x7)
};


// Size 0x28
struct ShipMastCollapseStateCustomServerEvent
{
public:
	char                                                         pad0x20_Z0RRN[0x20];                               // 0x0(0x20)
	int                                                          ShipId;                                            // 0x20(0x4)
	int                                                          MastId;                                            // 0x24(0x4)
};


// Size 0x28
struct PlayerCapstanUsageEndCustomServerEvent
{
public:
	char                                                         pad0x20_ZKR32[0x20];                               // 0x0(0x20)
	int                                                          ShipId;                                            // 0x20(0x4)
	int                                                          CapstanState;                                      // 0x24(0x4)
};


// Size 0x28
struct OnVoyageCancelledCustomServerEvent
{
public:
	char                                                         pad0x18_W43XU[0x18];                               // 0x0(0x18)
	struct FString                                               AssociatedCrew;                                    // 0x18(0x10)
};


// Size 0x20
struct ShipDestroyedCustomServerEvent
{
public:
	char                                                         pad0x20_OGY3S[0x20];                               // 0x0(0x20)
};


// Size 0x28
struct AIShipDamagedCustomServerEvent
{
public:
	char                                                         pad0x20_IN2Z4[0x20];                               // 0x0(0x20)
	float                                                        AIShipWaterLevel;                                  // 0x20(0x4)
	char                                                         pad0x4_M126T[0x4];                                 // 0x24(0x4)
};


