// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10
class CustomMapDisplayObjectBase: public Object
{
public:
	Struct Guid                                                  Guid;                                              // 0x28(0x10)
};


// Size 0x30
class CustomMap: public RenderToTextureMapBase
{
public:
	Class Font*                                                  Font;                                              // 0x838(0x8)
	TArray<class DisplayItems*>                                  DisplayItems;                                      // 0x840(0x10)
};


// Size 0x0
class CustomMapCollectionInterface: public Interface
{
public:
};


// Size 0x10
class CustomMapDataTypeBase: public Object
{
public:
	Struct Guid                                                  Guid;                                              // 0x28(0x10)
};


// Size 0x20
class CustomMapData: public DataAsset
{
public:
	class                                                        CustomMapItemDescClass;                            // 0x28(0x8)
	Class Font*                                                  Font;                                              // 0x30(0x8)
	TArray<class MapDisplayItemList*>                            MapDisplayItemList;                                // 0x38(0x10)
};


// Size 0x10
class CustomMapDataTypePositional: public CustomMapDataTypeBase
{
public:
	Struct Vector2D                                              Position;                                          // 0x38(0x8)
	float                                                        Orientation;                                       // 0x40(0x4)
};


// Size 0x10
class CustomMapDisplayObjectPositional: public CustomMapDisplayObjectBase
{
public:
	Struct Vector2D                                              Position;                                          // 0x38(0x8)
	float                                                        Orientation;                                       // 0x40(0x4)
};


// Size 0x90
class CustomMapDisplayObjectText: public CustomMapDisplayObjectPositional
{
public:
	Struct FText                                                 Text;                                              // 0x48(0x38)
	float                                                        FontScale;                                         // 0x80(0x4)
	bool                                                         StrikeThrough;                                     // 0x84(0x1)
	float                                                        StrikethroughThickness;                            // 0x88(0x4)
};


// Size 0x48
class CustomMapDataTypeText: public CustomMapDataTypePositional
{
public:
	Struct FText                                                 Text;                                              // 0x48(0x38)
	float                                                        FontScale;                                         // 0x80(0x4)
	bool                                                         StrikeThrough;                                     // 0x84(0x1)
	float                                                        StrikethroughThickness;                            // 0x88(0x4)
};


// Size 0x8
class CustomMapSettings: public DeveloperSettings
{
public:
	class                                                        CustomMapItemDescClass;                            // 0x38(0x8)
};


}