#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Damagers_Structs.h"


// Size 0x58 (Full Size[0x120] - InheritedSize[0xc8]
class RadialDamagerComponent: public ActorComponent
{
public:
	float                                                        DamageIntervalSeconds;                             // 0xc8(0x4)
	float                                                        DamagePerSecondAtCentre;                           // 0xcc(0x4)
	float                                                        DamagePerSecondAtMaxRadius;                        // 0xd0(0x4)
	float                                                        DamageRadius;                                      // 0xd4(0x4)
	char                                                         pad0x8_QGE7V[0x8];                                 // 0xd8(0x8)
	class UClass*                                                DamagerType;                                       // 0xe0(0x8)
	char                                                         HealthChangedReason;                               // 0xe8(0x1)
	char                                                         pad0x3_00R4Z[0x3];                                 // 0xe9(0x3)
	struct Vector                                                LocalOffset;                                       // 0xec(0xc)
	char                                                         pad0x28_75MTW[0x28];                               // 0xf8(0x28)
};


// Size 0x158 (Full Size[0x220] - InheritedSize[0xc8]
class ShipDamagerComponent: public ActorComponent
{
public:
	char                                                         pad0x8_0XGTB[0x8];                                 // 0xc8(0x8)
	class PrimitiveComponent*                                    Shape;                                             // 0xd0(0x8)
	TArray<class Interface*>                                     ShipHulls;                                         // 0xd8(0x10)
	TArray<class Interface*>                                     WatercraftHealthInterfaces;                        // 0xe8(0x10)
	struct StrainDamage                                          ShipStrainDamage;                                  // 0xf8(0x28)
	struct WeightedProbabilityRangeOfRanges                      TimeBetweenWatercraftDamage;                       // 0x120(0x30)
	float                                                        WatercraftDamage;                                  // 0x150(0x4)
	bool                                                         StartDamagingOnBeginPlay;                          // 0x154(0x1)
	char                                                         pad0xcb_UJKYN[0xcb];                               // 0x155(0xcb)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShockwaveDamagerInterface: public Interface
{
public:
};


// Size 0x108 (Full Size[0x1d0] - InheritedSize[0xc8]
class ShockwaveDamagerComponent: public ActorComponent
{
public:
	char                                                         pad0x8_RH8CA[0x8];                                 // 0xc8(0x8)
	float                                                        ExpansionDuration;                                 // 0xd0(0x4)
	float                                                        EndRadiusInMetres;                                 // 0xd4(0x4)
	bool                                                         ApplyImpulseToShips;                               // 0xd8(0x1)
	char                                                         pad0x7_6A8QH[0x7];                                 // 0xd9(0x7)
	struct WeightedProbabilityRangeOfRanges                      ForceToApplyToShip;                                // 0xe0(0x30)
	bool                                                         ApplyDamageToShips;                                // 0x110(0x1)
	char                                                         pad0x7_JKXX8[0x7];                                 // 0x111(0x7)
	TArray<struct ShockwaveDamagerShipDamage>                    ShipDamageLevels;                                  // 0x118(0x10)
	class UClass*                                                DamagerType;                                       // 0x128(0x8)
	bool                                                         ApplyImpulseToGhostShips;                          // 0x130(0x1)
	char                                                         pad0x3_OET4W[0x3];                                 // 0x131(0x3)
	float                                                        GhostShipImpulseDuration;                          // 0x134(0x4)
	float                                                        GhostShipImpulseMaxDeflectionAngle;                // 0x138(0x4)
	bool                                                         DestroyHostileGhostShips;                          // 0x13c(0x1)
	char                                                         pad0x3_H0HGG[0x3];                                 // 0x13d(0x3)
	float                                                        NearbyEncounterDistanceInMetres;                   // 0x140(0x4)
	char                                                         pad0x4_T53V1[0x4];                                 // 0x144(0x4)
	TArray<uintptr_t>                                            ProcessedShips;                                    // 0x168(0x10)
	TArray<uintptr_t>                                            ProcessedGhostShips;                               // 0x178(0x10)
	char                                                         pad0x48_C08Q1[0x48];                               // 0x188(0x48)
};


