#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x38
struct DebugMenuDataAssetEntry
{
public:
	struct FString                                               MenuPath;                                          // 0x0(0x10)
	struct FString                                               DisplayName;                                       // 0x10(0x10)
	struct FString                                               ConsoleCommand;                                    // 0x20(0x10)
	bool                                                         CloseMenuWhenExecuted;                             // 0x30(0x1)
	bool                                                         AvailableInShippingBuilds;                         // 0x31(0x1)
	bool                                                         AddToCommonlyUsedMenu;                             // 0x32(0x1)
	char                                                         pad0x5_HM0EU[0x5];                                 // 0x33(0x5)
};


// Size 0x20
struct DebugMenuUserItem
{
public:
	struct FString                                               path;                                              // 0x0(0x10)
	struct FString                                               Command;                                           // 0x10(0x10)
};


// Size 0x40
struct DebugMenuButtonShortcut
{
public:
	struct FString                                               DisplayName;                                       // 0x0(0x10)
	struct FString                                               ConsoleCommand;                                    // 0x10(0x10)
	TArray<struct Key>                                           Buttons;                                           // 0x20(0x10)
	float                                                        RequiredHoldTime;                                  // 0x30(0x4)
	bool                                                         AvailableInShippingBuilds;                         // 0x34(0x1)
	char                                                         pad0xb_ACR7Y[0xb];                                 // 0x35(0xb)
};


// Size 0x1
struct DebugErrorHappeningEvent
{
public:
	char                                                         pad0x1_NQOOJ[0x1];                                 // 0x0(0x1)
};


// Size 0x1c
struct PageResultConfig
{
public:
	int                                                          NumResults;                                        // 0x0(0x4)
	int                                                          NumPages;                                          // 0x4(0x4)
	int                                                          StartIndex;                                        // 0x8(0x4)
	int                                                          EndIndex;                                          // 0xc(0x4)
	int                                                          NumOnPage;                                         // 0x10(0x4)
	bool                                                         HasNext;                                           // 0x14(0x1)
	bool                                                         HasPrevious;                                       // 0x15(0x1)
	char                                                         pad0x2_UKNQE[0x2];                                 // 0x16(0x2)
	int                                                          TotalEntries;                                      // 0x18(0x4)
};


// Size 0x20
struct DebugMenuOptionExecutedEvent
{
public:
	struct FString                                               DebugMenuItemName;                                 // 0x0(0x10)
	struct FString                                               ConsoleCommand;                                    // 0x10(0x10)
};


