#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xa8
struct UndeployActionRuleVerbiage
{
public:
	struct FText                                                 PlayerIsDockedVerbiage;                            // 0x0(0x38)
	struct FText                                                 OverheatedVerbiage;                                // 0x38(0x38)
	struct FText                                                 CanUndeployVerbiage;                               // 0x70(0x38)
};


// Size 0x20
struct FailedDeploymentTelemetryEvent
{
public:
	struct Guid                                                  DeployableID;                                      // 0x0(0x10)
	struct Vector                                                Location;                                          // 0x14(0xc)
};


// Size 0x268
struct DeployActionRuleVerbiage
{
public:
	struct FText                                                 ObstructedVerbiage;                                // 0x0(0x38)
	struct FText                                                 InExclusionZoneVerbiage;                           // 0x38(0x38)
	struct FText                                                 NearAnotherDeployableVerbiage;                     // 0x70(0x38)
	struct FText                                                 SubmergedInWaterVerbiage;                          // 0xa8(0x38)
	struct FText                                                 NotInAcceptanceAngleVerbiage;                      // 0xe0(0x38)
	struct FText                                                 InvalidShipRegionVerbiage;                         // 0x118(0x38)
	struct FText                                                 DroppedNearAnotherControllableVerbiage;            // 0x150(0x38)
	struct FText                                                 FailedDeploymentVerbiage;                          // 0x188(0x38)
	struct FText                                                 ProxyPlacementNotLevelVerbiage;                    // 0x1c0(0x38)
	struct FText                                                 NoFloorUnderProxyForCharacterVerbiage;             // 0x1f8(0x38)
	struct FText                                                 CanDeployVerbiage;                                 // 0x230(0x38)
};


// Size 0x1c
struct UndeployableDeployedTelemetryEvent
{
public:
	struct Guid                                                  DeployableID;                                      // 0x0(0x10)
	struct Vector                                                Location;                                          // 0x10(0xc)
};


// Size 0x1c
struct DeployableDeployedTelemetryEvent
{
public:
	struct Guid                                                  DeployableID;                                      // 0x0(0x10)
	struct Vector                                                Location;                                          // 0x10(0xc)
};


