#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x180 (Full Size[0x548] - InheritedSize[0x3c8]
class dvr_sea_volcano_a_C: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMesh26;                                      // 0x3c8(0x8)
	class StaticMeshComponent*                                   StaticMesh25;                                      // 0x3d0(0x8)
	class StaticMeshComponent*                                   StaticMesh24;                                      // 0x3d8(0x8)
	class StaticMeshComponent*                                   StaticMesh23;                                      // 0x3e0(0x8)
	class StaticMeshComponent*                                   StaticMesh22;                                      // 0x3e8(0x8)
	class StaticMeshComponent*                                   StaticMesh21;                                      // 0x3f0(0x8)
	class StaticMeshComponent*                                   StaticMesh20;                                      // 0x3f8(0x8)
	class StaticMeshComponent*                                   StaticMesh19;                                      // 0x400(0x8)
	class StaticMeshComponent*                                   StaticMesh18;                                      // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMesh17;                                      // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMesh16;                                      // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMesh15;                                      // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMesh14;                                      // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMesh13;                                      // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMesh12;                                      // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMesh11;                                      // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMesh10;                                      // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMesh9;                                       // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMesh8;                                       // 0x458(0x8)
	class StaticMeshComponent*                                   StaticMesh7;                                       // 0x460(0x8)
	class StaticMeshComponent*                                   StaticMesh6;                                       // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMesh5;                                       // 0x470(0x8)
	class StaticMeshComponent*                                   dvr_lv_crystal_large_01_b;                         // 0x478(0x8)
	class StaticMeshComponent*                                   StaticMesh4;                                       // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMesh3;                                       // 0x488(0x8)
	class StaticMeshComponent*                                   StaticMesh2;                                       // 0x490(0x8)
	class StaticMeshComponent*                                   StaticMesh1;                                       // 0x498(0x8)
	class StaticMeshComponent*                                   dvr_rock_xlarge_02_a;                              // 0x4a0(0x8)
	class StaticMeshComponent*                                   dvr_rock_xlarge_04_a;                              // 0x4a8(0x8)
	class StaticMeshComponent*                                   dvr_lv_rock_xlarge_04_a1;                          // 0x4b0(0x8)
	class StaticMeshComponent*                                   dvr_lv_rock_xlarge_04_a;                           // 0x4b8(0x8)
	class StaticMeshComponent*                                   dvr_lv_sea_rocks_d;                                // 0x4c0(0x8)
	class StaticMeshComponent*                                   dvr_lv_rock_xlarge_02_c;                           // 0x4c8(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x4d0(0x8)
	class StaticMeshComponent*                                   dvr_lv_rock_xlarge_05_b;                           // 0x4d8(0x8)
	class StaticMeshComponent*                                   wld_rock_xlarge_05_b;                              // 0x4e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x4e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x4f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x4f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x500(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x508(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x510(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x518(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x520(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x528(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x530(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x538(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x540(0x8)
};


