// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1c0 (Full Size[0x588] - InheritedSize[0x3c8]
class dvr_sea_Volcano_b_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMesh32;                                      // 0x3c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh31;                                      // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh30;                                      // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh29;                                      // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh28;                                      // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh27;                                      // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh26;                                      // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh25;                                      // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMesh24;                                      // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMesh23;                                      // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh22;                                      // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh21;                                      // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh20;                                      // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh19;                                      // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh18;                                      // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh17;                                      // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMesh15;                                      // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMesh14;                                      // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMesh13;                                      // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x488(0x8)
	Class StaticMeshComponent*                                   dvr_lv_crystal_large_01_b;                         // 0x490(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x498(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x4a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x4a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x4b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x4b8(0x8)
	Class StaticMeshComponent*                                   dvr_rock_xlarge_04_b;                              // 0x4c0(0x8)
	Class StaticMeshComponent*                                   dvr_lv_rock_xlarge_06_a;                           // 0x4c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x4d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x4d8(0x8)
	Class StaticMeshComponent*                                   dvr_rock_xlarge_04_a1;                             // 0x4e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x4e8(0x8)
	Class StaticMeshComponent*                                   dvr_rock_xlarge_04_a;                              // 0x4f0(0x8)
	Class StaticMeshComponent*                                   dvr_lv_rock_xlarge_03_a;                           // 0x4f8(0x8)
	Class StaticMeshComponent*                                   dvr_lv_rock_xlarge_08_b;                           // 0x500(0x8)
	Class StaticMeshComponent*                                   dvr_lv_rock_xlarge_04_b;                           // 0x508(0x8)
	Class StaticMeshComponent*                                   dvr_lv_rock_xlarge_05_b;                           // 0x510(0x8)
	Class StaticMeshComponent*                                   dvr_lv_rock_xlarge_02_c;                           // 0x518(0x8)
	Class StaticMeshComponent*                                   dvr_lv_sea_rocks_c1;                               // 0x520(0x8)
	Class StaticMeshComponent*                                   dvr_lv_sea_rocks_e1;                               // 0x528(0x8)
	Class StaticMeshComponent*                                   dvr_lv_sea_rocks_f;                                // 0x530(0x8)
	Class StaticMeshComponent*                                   dvr_lv_sea_rocks_e;                                // 0x538(0x8)
	Class StaticMeshComponent*                                   dvr_lv_sea_rocks_c;                                // 0x540(0x8)
	Class StaticMeshComponent*                                   dvr_lv_sea_rocks_d;                                // 0x548(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x550(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x558(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x560(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x568(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x570(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x578(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x580(0x8)
};


}