// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x30
class BP_PromptActor_EmissaryEncounteredAIShip_AF_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredAIShip_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredAIShip_GH_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredAIShip_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredAIShip_MA_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredAIShip_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredAIShip_OOS_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredAIShip_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredAIShip_RB_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredAIShip_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredKraken_AF_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredKraken_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredKraken_GH_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredKraken_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredKraken_MA_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredKraken_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredKraken_OOS_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredKraken_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredKraken_RB_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredKraken_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredSkellyFort_AF_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredSkellyFort_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredSkellyFort_GH_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredSkellyFort_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredSkellyFort_MA_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredSkellyFort_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredSkellyFort_OOS_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredSkellyFort_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryEncounteredSkellyFort_RB_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEncounteredSkellyFort_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


}