// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20
struct EmissaryFlagMeshReferences
{
public:
	Struct StringAssetReference                                  BackOfShipEmissaryFlagMeshAssetReference;          // 0x0(0x10)
	Struct StringAssetReference                                  MastEmissaryFlagMeshAssetReference;                // 0x10(0x10)
};


// Size 0x28
struct ParticleVisualisation
{
public:
	Struct ActorComponentSelector                                TargetParticles;                                   // 0x0(0x10)
	float                                                        Delay;                                             // 0x10(0x4)
	float                                                        DelayAfterPutOutParticles;                         // 0x14(0x4)
	Class ParticleSystem*                                        PutOutParticles;                                   // 0x18(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x20(0x8)
};


// Size 0x28
struct LightVisualisation
{
public:
	Struct ActorComponentSelector                                TargetLight;                                       // 0x0(0x10)
	float                                                        TransitionTime;                                    // 0x10(0x4)
	float                                                        ActiveValue;                                       // 0x14(0x4)
	float                                                        InactiveValue;                                     // 0x18(0x4)
	char                                                         pad0x4_VU7BX[0x4];                                 // 0x1c(0x4)
	Class LightComponent*                                        Light;                                             // 0x20(0x8)
};


// Size 0x30
struct MaterialVisualisation
{
public:
	Struct ActorComponentSelector                                TargetMesh;                                        // 0x0(0x10)
	float                                                        TransitionTime;                                    // 0x10(0x4)
	int                                                          MaterialIndex;                                     // 0x14(0x4)
	struct FName                                                 ParameterName;                                     // 0x18(0x8)
	float                                                        ActiveValue;                                       // 0x20(0x4)
	float                                                        InactiveValue;                                     // 0x24(0x4)
	Class MaterialInstanceDynamic*                               DynamicMaterial;                                   // 0x28(0x8)
};


// Size 0x88
struct EmissaryLevelEntry
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	TArray<struct CompanyLevelData>                              CompanyLevelData;                                  // 0x8(0x10)
	Class DataAsset*                                             MaxRankPopUpToastData;                             // 0x18(0x8)
	Class DataAsset*                                             EmissaryJoinedPopUpToastData;                      // 0x20(0x8)
	Class DataAsset*                                             EmissarySunkPopUpToastData;                        // 0x28(0x8)
	Struct EmissaryCompanyCosmetics                              CompanyCosmetics;                                  // 0x30(0x20)
	Struct PlayerStat                                            TimeSpentAtMaxRankStat;                            // 0x50(0x4)
	char                                                         pad0x4_BOYLJ[0x4];                                 // 0x54(0x4)
	TArray<struct StatsToFireOnFullEmissaryClothing>             StatsToFireOnFullEmissaryClothing;                 // 0x58(0x10)
	TArray<struct StatsToFireOnFullEmissaryShipCustomizations>   StatsToFireOnFullEmissaryShipCustomizations;       // 0x68(0x10)
	TArray<struct StatsToFireOnFullShipCustomizationsAndClothing> StatsToFireOnFullShipCustomizationsAndClothing;    // 0x78(0x10)
};


// Size 0x20
struct EmissaryCompanyCosmetics
{
public:
	TArray<class Class*>                                         CompanyCostumeCosmetics;                           // 0x0(0x10)
	TArray<class Class*>                                         CompanyShipCosmetics;                              // 0x10(0x10)
};


// Size 0xd8
struct EmissaryLevelData
{
public:
	int                                                          LevelTarget;                                       // 0x0(0x4)
	char                                                         pad0x4_5UDU4[0x4];                                 // 0x4(0x4)
	Struct EmissaryFlagMeshReferences                            EmissaryFlagMeshAssetReferences;                   // 0x8(0x20)
	Class EmissaryColourSwatchSettingsAsset*                     CustomisedFlagSettings;                            // 0x68(0x8)
	Struct RewardId                                              EmissaryDeactivationReward;                        // 0x70(0x8)
	TArray<struct StatsToFireOnEmissaryLevelReached>             StatsToFireOnEmissaryLevelReached;                 // 0x78(0x10)
	TArray<struct StatsToFireOnEmissaryLevelReachedGuildOnly>    StatsToFireOnEmissaryLevelReachedGuildOnly;        // 0x88(0x10)
	TArray<struct StatsToFireOnEmissaryDeactivated>              StatsToFireOnEmissaryDeactivated;                  // 0x98(0x10)
	TArray<struct StatsToFireOnEmissaryDeactivatedGuildOnly>     StatsToFireOnEmissaryDeactivatedGuildOnly;         // 0xa8(0x10)
	Struct StringAssetReference                                  TreasureSoldNotificationFlag;                      // 0xb8(0x10)
	Struct StringAssetReference                                  EmissaryFlagTextureReference;                      // 0xc8(0x10)
};


// Size 0x60
struct EmissaryColourSwatchInformation
{
public:
	Struct FString                                               ColourSwatchIdentifier;                            // 0x0(0x10)
	Struct EmissaryFlagMeshReferences                            EmissaryFlagMeshAssetReferences;                   // 0x10(0x20)
	Struct StringAssetReference                                  EmissaryFlagTextureReference;                      // 0x50(0x10)
};


// Size 0x8
struct EmissaryPointBoostMultipliers
{
public:
	float                                                        PlayerWearningCompanyCostume;                      // 0x0(0x4)
	float                                                        CrewShipFullyEquippedWithCompanyCosmetics;         // 0x4(0x4)
};


// Size 0x4
struct EmissaryLevelStatusStatInfo
{
public:
	Struct PlayerStat                                            StatToFire;                                        // 0x0(0x4)
};


// Size 0x8
struct EmissaryPointsBoostCriteria
{
public:
};


// Size 0x18
struct TrackedPlayerKillEntry
{
public:
	Struct FString                                               KilledPlayer;                                      // 0x0(0x10)
	int                                                          KillCount;                                         // 0x10(0x4)
	float                                                        KillTime;                                          // 0x14(0x4)
};


// Size 0x28
struct EmissaryCompanyCampaignSettings
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	TArray<struct KillPlayers>                                   KillPlayers;                                       // 0x8(0x10)
	TArray<struct GameEvents>                                    GameEvents;                                        // 0x18(0x10)
};


// Size 0x18
struct EmissaryCompanyCampaignGameEvent
{
public:
	class                                                        EventType;                                         // 0x0(0x8)
	TArray<struct Scales>                                        Scales;                                            // 0x8(0x10)
};


// Size 0xc
struct EmissaryCompanyCampaignScale
{
public:
	struct FName                                                 Campaign;                                          // 0x0(0x8)
	float                                                        Scale;                                             // 0x8(0x4)
};


// Size 0x18
struct EmissaryCompanyCampaignKillPlayer
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	TArray<struct Scales>                                        Scales;                                            // 0x8(0x10)
};


// Size 0x90
struct EmissaryRewardEntry
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	Struct EmissaryActionRewardData                              ActionRewardData;                                  // 0x8(0x88)
};


// Size 0x88
struct EmissaryActionRewardData
{
public:
	TArray<struct OwnershipChangedRewards>                       OwnershipChangedRewards;                           // 0x0(0x10)
	TArray<struct PlacedOnShipRewards>                           PlacedOnShipRewards;                               // 0x10(0x10)
	Struct EmissaryKillPlayerReward                              KillPlayerReward;                                  // 0x20(0x28)
	TArray<struct GameEventsRewards>                             GameEventsRewards;                                 // 0x48(0x10)
	TArray<struct HandinRewards>                                 HandinRewards;                                     // 0x58(0x10)
	TArray<struct CompanyActionRewards>                          CompanyActionRewards;                              // 0x68(0x10)
	TArray<struct FactionActionRewards>                          FactionActionRewards;                              // 0x78(0x10)
};


// Size 0x8
struct EmissaryFactionActionReward
{
public:
	byte                                                         FactionActionType;                                 // 0x0(0x1)
	char                                                         pad0x3_MKNC4[0x3];                                 // 0x1(0x3)
	float                                                        Amount;                                            // 0x4(0x4)
};


// Size 0x8
struct EmissaryCompanyActionReward
{
public:
	byte                                                         CompanyActionType;                                 // 0x0(0x1)
	char                                                         pad0x3_4PN13[0x3];                                 // 0x1(0x3)
	float                                                        Amount;                                            // 0x4(0x4)
};


// Size 0x8
struct EmissaryEventAward
{
public:
	bool                                                         FirstTimeOnly;                                     // 0x0(0x1)
	bool                                                         NotOriginalOwner;                                  // 0x1(0x1)
	byte                                                         ItemQualityRequirement;                            // 0x2(0x1)
	char                                                         pad0x1_TSMX4[0x1];                                 // 0x3(0x1)
	int                                                          EmissaryLevelIncrease;                             // 0x4(0x4)
};


// Size 0x10
struct EmissaryGameEventsReward
{
public:
	class                                                        FinishedEventType;                                 // 0x0(0x8)
	float                                                        Amount;                                            // 0x8(0x4)
};


// Size 0x28
struct EmissaryKillPlayerReward
{
public:
	int                                                          EmissaryLevelIncrease;                             // 0x0(0x4)
	char                                                         pad0x4_1FOAI[0x4];                                 // 0x4(0x4)
	TArray<struct EmissaryLevelKillCountScaleFactors>            EmissaryLevelKillCountScaleFactors;                // 0x8(0x10)
	TArray<class Class*>                                         ValidEmissariesToKill;                             // 0x18(0x10)
};


// Size 0x8
struct EmissaryKillScaleFactor
{
public:
	int                                                          KillCount;                                         // 0x0(0x4)
	float                                                        ScaleFactor;                                       // 0x4(0x4)
};


// Size 0x8
struct EmissaryVoteRemovedEvent
{
public:
	struct FName                                                 Company;                                           // 0x0(0x8)
};


// Size 0x8
struct EmissaryVoteAddedEvent
{
public:
	struct FName                                                 Company;                                           // 0x0(0x8)
};


// Size 0x20
struct CrewMemberVotes
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	TArray<struct CompanyVotes>                                  CompanyVotes;                                      // 0x10(0x10)
};


// Size 0x18
struct PerCompanyVotes
{
public:
	TArray<class PlayerState*>                                   MemberVotes;                                       // 0x0(0x10)
	struct FName                                                 CompanyIdentifier;                                 // 0x10(0x8)
};


// Size 0x4
struct ChaliceStatuePhaseUpdate
{
public:
	int                                                          NewLevel;                                          // 0x0(0x4)
};


// Size 0x18
struct EmissaryEncounteredSkellyFortNetworkEvent
{
public:
	struct FName                                                 CompanyName;                                       // 0x10(0x8)
};


// Size 0x8
struct EmissaryEncounteredAIShipEvent
{
public:
	struct FName                                                 CompanyName;                                       // 0x0(0x8)
};


// Size 0x8
struct EmissaryEncounteredTinySharkEvent
{
public:
	struct FName                                                 CompanyName;                                       // 0x0(0x8)
};


// Size 0x8
struct EmissaryEncounteredKrakenEvent
{
public:
	struct FName                                                 CompanyName;                                       // 0x0(0x8)
};


// Size 0x10
struct EmissaryEntitlementPurchasedEvent
{
public:
	Struct Guid                                                  OfferId;                                           // 0x0(0x10)
};


// Size 0xc
struct EmissaryLevelRankChange
{
public:
	int                                                          NewLevel;                                          // 0x0(0x4)
	struct FName                                                 CompanyName;                                       // 0x4(0x8)
};


// Size 0x8
struct EmissaryActivated
{
public:
	struct FName                                                 CompanyName;                                       // 0x0(0x8)
};


// Size 0x20
struct EmissaryKilledAnotherEmissaryNetworkEvent
{
public:
	struct FName                                                 CompanyName;                                       // 0x10(0x8)
	struct FName                                                 VictimCompanyName;                                 // 0x18(0x8)
};


// Size 0x18
struct EmissarySoldLootNetworkEvent
{
public:
	struct FName                                                 CompanyName;                                       // 0x10(0x8)
};


// Size 0x18
struct EmissaryStoleLootNetworkEvent
{
public:
	struct FName                                                 CompanyName;                                       // 0x10(0x8)
};


// Size 0x18
struct EmissaryDiscoveredCargoRunCrateNetworkEvent
{
public:
	struct FName                                                 CompanyName;                                       // 0x10(0x8)
};


// Size 0x18
struct EmissaryDiscoveredLootNetworkEvent
{
public:
	struct FName                                                 CompanyName;                                       // 0x10(0x8)
};


// Size 0x18
struct EmissarySecuredLootOnShipNetworkEvent
{
public:
	struct FName                                                 CompanyName;                                       // 0x10(0x8)
};


// Size 0x18
struct EmissaryJoinedNetworkEvent
{
public:
	Class DataAsset*                                             PopUpDesc;                                         // 0x10(0x8)
};


// Size 0x20
struct EmissarySunkNetworkEvent
{
public:
	Class DataAsset*                                             PopUpDesc;                                         // 0x10(0x8)
	struct FName                                                 CompanyName;                                       // 0x18(0x8)
};


// Size 0x18
struct EmissaryMaxLevelReachedNetworkEvent
{
public:
	Class DataAsset*                                             PopUpDesc;                                         // 0x10(0x8)
};


// Size 0x10
struct EmissaryDeactivatedNetworkEvent
{
public:
};


// Size 0xc
struct EmissaryStateUpdateEvent
{
public:
	float                                                        CurrentRepTotal;                                   // 0x0(0x4)
	struct FName                                                 CompanyId;                                         // 0x4(0x8)
};


// Size 0x20
struct EmissaryProgressUpdatedNetworkEvent
{
public:
	float                                                        OldRepTotal;                                       // 0x10(0x4)
	float                                                        NewRepTotal;                                       // 0x14(0x4)
	struct FName                                                 CompanyId;                                         // 0x18(0x8)
};


// Size 0x14
struct EmissaryLevelProgressUpdatedEvent
{
public:
	float                                                        LevelProgress;                                     // 0x0(0x4)
	Struct Guid                                                  AssociatedCrew;                                    // 0x4(0x10)
};


// Size 0x1
struct ActivateEmissaryMaxRankQuestForSession
{
public:
};


// Size 0x30
struct UpdateEmissaryValueForCompany
{
public:
	Struct Guid                                                  SessionId;                                         // 0x0(0x10)
	struct FName                                                 Company;                                           // 0x10(0x8)
	Struct Guid                                                  AssociatedCrew;                                    // 0x18(0x10)
	byte                                                         RewardType;                                        // 0x28(0x1)
	char                                                         pad0x3_RBZ12[0x3];                                 // 0x29(0x3)
	int                                                          UpdateAmount;                                      // 0x2c(0x4)
};


// Size 0x28
struct ReactivateEmissaryForMigratedCrew
{
public:
	Struct Guid                                                  SessionId;                                         // 0x0(0x10)
	struct FName                                                 Company;                                           // 0x10(0x8)
	Struct Guid                                                  AssociatedCrew;                                    // 0x18(0x10)
};


// Size 0x40
struct DeactivateEmissaryForCrew
{
public:
	Struct Guid                                                  SessionId;                                         // 0x0(0x10)
	Struct Guid                                                  GuildId;                                           // 0x10(0x10)
	struct FName                                                 Company;                                           // 0x20(0x8)
	Struct Guid                                                  AssociatedCrew;                                    // 0x28(0x10)
	byte                                                         EmissaryDeactivateReason;                          // 0x38(0x1)
	char                                                         pad0x3_UBG5Z[0x3];                                 // 0x39(0x3)
	int                                                          EmissaryTotal;                                     // 0x3c(0x4)
};


// Size 0x28
struct ActivateEmissaryForCrew
{
public:
	Struct Guid                                                  SessionId;                                         // 0x0(0x10)
	struct FName                                                 Company;                                           // 0x10(0x8)
	Struct Guid                                                  AssociatedCrew;                                    // 0x18(0x10)
};


// Size 0x1c
struct EmissaryLevelChanged
{
public:
	int                                                          NewLevel;                                          // 0x0(0x4)
	Struct Guid                                                  AssociatedCrew;                                    // 0x4(0x10)
	struct FName                                                 CompanyName;                                       // 0x14(0x8)
};


// Size 0x1
struct EmissaryLevelResetProgress
{
public:
};


// Size 0x1
struct PlayerRemovedFromEmissaryCrew
{
public:
};


// Size 0x10
struct PlayerAddedToEmissaryCrew
{
public:
	int                                                          EmissaryLevel;                                     // 0x0(0x4)
	float                                                        EmissaryLevelProgress;                             // 0x4(0x4)
	struct FName                                                 EmissaryCompany;                                   // 0x8(0x8)
};


// Size 0x2c
struct EmissaryRoleplayActionTelemetryEvent
{
public:
	Struct Guid                                                  EmissarySessionId;                                 // 0x0(0x10)
	struct FName                                                 EmissaryCompany;                                   // 0x10(0x8)
	int                                                          EmissaryRank;                                      // 0x18(0x4)
	byte                                                         ActionName;                                        // 0x1c(0x1)
	char                                                         pad0x3_U2D1K[0x3];                                 // 0x1d(0x3)
	int                                                          PointsRewarded;                                    // 0x20(0x4)
	int                                                          PointsAccumulated;                                 // 0x24(0x4)
	int                                                          PointsRequiredToNextRank;                          // 0x28(0x4)
};


// Size 0x1c
struct EmissarySessionEndTelemetryEvent
{
public:
	Struct Guid                                                  EmissarySessionId;                                 // 0x0(0x10)
	struct FName                                                 EmissaryCompany;                                   // 0x10(0x8)
	byte                                                         DisbandedReason;                                   // 0x18(0x1)
};


// Size 0x1c
struct EmissarySessionStartTelemetryEvent
{
public:
	Struct Guid                                                  EmissarySessionId;                                 // 0x0(0x10)
	struct FName                                                 EmissaryCompany;                                   // 0x10(0x8)
	int                                                          EmisarriesOnServerCount;                           // 0x18(0x4)
};


// Size 0x28
struct VoteAddedNetworkEvent
{
public:
	struct FName                                                 CompanyId;                                         // 0x10(0x8)
	Struct Guid                                                  CrewId;                                            // 0x18(0x10)
};


// Size 0x28
struct VoteRemovedNetworkEvent
{
public:
	struct FName                                                 CompanyId;                                         // 0x10(0x8)
	Struct Guid                                                  CrewId;                                            // 0x18(0x10)
};


}