#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "EmotingFramework_Structs.h"


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EmotePropRandomObjectData: public EmotePropData
{
public:
	TArray<struct EmotePropRandomObjectInfo>                     PossibleObjects;                                   // 0x28(0x10)
};


// Size 0x150 (Full Size[0x518] - InheritedSize[0x3c8]
class EmoteCard: public Actor
{
public:
	class MaterialInstanceDynamic*                               DynamicCardSelectionMaterialInstance;              // 0x3d0(0x8)
	class StaticMeshComponent*                                   MeshComponent;                                     // 0x3d8(0x8)
	struct FName                                                 RandomCardParameterName;                           // 0x3e0(0x8)
	struct                                                       RandomCardParameterRange;                          // 0x3e8(0x10)
};


// Size 0x140 (Full Size[0x508] - InheritedSize[0x3c8]
class EmoteRandomObject: public Actor
{
public:
	class StaticMeshComponent*                                   MeshComponent;                                     // 0x3d0(0x8)
	class MaterialInstanceDynamic*                               DynamicMaterialInstance;                           // 0x3d8(0x8)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class EmoteSettings: public DeveloperSettings
{
public:
	int                                                          NumPages;                                          // 0x38(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class EmotePropDiceData: public EmotePropData
{
public:
	char                                                         DiceType;                                          // 0x28(0x1)
	int                                                          Outcome;                                           // 0x2c(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EmoteIdListingAsset: public DataAsset
{
public:
	TArray<struct Name>                                          EmoteIds;                                          // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EmoteRandomFromListAsset: public DataAsset
{
public:
	TArray<struct EmoteData>                                     EmoteDataList;                                     // 0x28(0x10)
};


