// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EmoteCameraInterface: public Interface
{
public:
};


// Size 0x140 (Full Size[0x508] - InheritedSize[0x3c8]
class EmoteCard: public Actor
{
public:
	char                                                         pad0x8_78JZR[0x8];                                 // 0x3c8(0x8)
	Class MaterialInstanceDynamic*                               DynamicCardSelectionMaterialInstance;              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   MeshComponent;                                     // 0x3d8(0x8)
	struct FName                                                 RandomCardParameterName;                           // 0x3e0(0x8)
	Struct Int32Range                                            RandomCardParameterRange;                          // 0x3e8(0x10)
	char                                                         pad0x130_DTK1P[0x130];                             // 0x3f6(0x130)
};


// Size 0x118 (Full Size[0x4e0] - InheritedSize[0x3c8]
class EmoteCoin: public Actor
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EmotePropData: public DataAsset
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EmoteRandomFromListAsset: public DataAsset
{
public:
	TArray<struct EmoteDataList>                                 EmoteDataList;                                     // 0x28(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class EmotePropDiceData: public EmotePropData
{
public:
	byte                                                         DiceType;                                          // 0x28(0x1)
	char                                                         pad0x9_89U53[0x9];                                 // 0x27(0x9)
};


// Size 0x120 (Full Size[0x4e8] - InheritedSize[0x3c8]
class EmoteDice: public Actor
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EmoteIdListingAsset: public DataAsset
{
public:
	TArray<struct FName>                                         EmoteIds;                                          // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EmotePropRandomObjectData: public EmotePropData
{
public:
	TArray<struct PossibleObjects>                               PossibleObjects;                                   // 0x28(0x10)
};


// Size 0x130 (Full Size[0x4f8] - InheritedSize[0x3c8]
class EmoteRandomObject: public Actor
{
public:
	char                                                         pad0x8_VOQ6W[0x8];                                 // 0x3c8(0x8)
	Class StaticMeshComponent*                                   MeshComponent;                                     // 0x3d0(0x8)
	Class MaterialInstanceDynamic*                               DynamicMaterialInstance;                           // 0x3d8(0x8)
	char                                                         pad0x128_EF0T8[0x128];                             // 0x3de(0x128)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class EmoteSettings: public DeveloperSettings
{
public:
	int                                                          NumPages;                                          // 0x38(0x4)
	char                                                         pad0xc_54DGE[0xc];                                 // 0x3a(0xc)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class EmoteZoomInAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class EmoteZoomMouseAnalogInputId: public AnalogInputId
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class EmoteZoomOutAnalogInputId: public AnalogInputId
{
public:
};


}