#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x14
struct EmoteDiceOutcomeTelemetryEvent
{
public:
	int                                                          MaxLimit;                                          // 0x0(0x4)
	int                                                          RollNumber;                                        // 0x4(0x4)
	struct Vector                                                OrientationUsed;                                   // 0x8(0xc)
};


// Size 0x1
struct WalkableEmotePlayerMovementEnabledEvent
{
public:
	char                                                         pad0x1_DCL60[0x1];                                 // 0x0(0x1)
};


// Size 0x3
struct DisguiseTypeData
{
public:
	char                                                         Type;                                              // 0x0(0x1)
	char                                                         Identifier;                                        // 0x1(0x1)
	bool                                                         HasPlayedIntoAnim;                                 // 0x2(0x1)
};


// Size 0x1
struct WalkableEmoteDisguiseIdentifierSet
{
public:
	char                                                         pad0x1_KFTP4[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventDisguiseInteractedWith
{
public:
	char                                                         pad0x8_GSOGT[0x8];                                 // 0x0(0x8)
};


// Size 0x10
struct WalkableEmoteMovementStopEvent
{
public:
	class WwiseEvent*                                            StopMovementEvent;                                 // 0x0(0x8)
	class WwiseEvent*                                            PutDownEvent;                                      // 0x8(0x8)
};


// Size 0x30
struct EmotePropRandomObjectInfo
{
public:
	class StaticMesh*                                            Mesh;                                              // 0x0(0x8)
	TArray<struct Transform>                                     PossibleTransforms;                                // 0x8(0x10)
	struct FName                                                 RandomParameterName;                               // 0x18(0x8)
	struct Int32Range                                            RandomParameterRange;                              // 0x20(0x10)
};


// Size 0x14
struct EventWalkableEmoteCompleted
{
public:
	struct FName                                                 WalkableEmoteName;                                 // 0x0(0x8)
	char                                                         WalkableEmoteType;                                 // 0xc(0x1)
	char                                                         DisguiseIdentifier;                                // 0xd(0x1)
	char                                                         pad0x2_TK1GC[0x2];                                 // 0xe(0x2)
	float                                                        DistanceTravelled;                                 // 0x10(0x4)
};


// Size 0x1
struct EventDisableLookAtEmoteCamera
{
public:
	char                                                         pad0x1_06BX6[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct WalkableEmoteMovementStartEvent
{
public:
	class WwiseEvent*                                            Event;                                             // 0x0(0x8)
};


// Size 0x4
struct WalkableEmoteDisguiseTypeSet
{
public:
	char                                                         pad0x4_GEMFH[0x4];                                 // 0x0(0x4)
};


// Size 0x1
struct WalkableEmoteToastEvent
{
public:
	bool                                                         IsInWalkableEmote;                                 // 0x0(0x1)
};


// Size 0xc
struct EventEmoteEndRequested
{
public:
	struct FName                                                 EmoteIdentifier;                                   // 0x0(0x8)
	bool                                                         EndForcedEmote;                                    // 0x8(0x1)
	char                                                         pad0x3_8W1FN[0x3];                                 // 0x9(0x3)
};


// Size 0x50
struct EmotePropRandomObjectResult
{
public:
	class StaticMesh*                                            Mesh;                                              // 0x0(0x8)
	bool                                                         HasTransformValue;                                 // 0x8(0x1)
	char                                                         pad0x7_XL6VM[0x7];                                 // 0x9(0x7)
	struct Transform                                             Transform;                                         // 0x10(0x30)
	struct FName                                                 TextureParameterName;                              // 0x40(0x8)
	int                                                          TextureParameterValue;                             // 0x48(0x4)
	char                                                         pad0x4_5TV99[0x4];                                 // 0x4c(0x4)
};


// Size 0x8
struct EventEnableLookAtEmoteCamera
{
public:
	char                                                         pad0x8_DTW3Z[0x8];                                 // 0x0(0x8)
};


// Size 0x1
struct EventEndEmoteAnimation
{
public:
	char                                                         pad0x1_RWTWZ[0x1];                                 // 0x0(0x1)
};


// Size 0x58
struct EmoteInteractionTooltipInstance
{
public:
	char                                                         InteractionTooltipType;                            // 0x0(0x1)
	char                                                         pad0x7_073MS[0x7];                                 // 0x1(0x7)
	struct FText                                                 DisplayString;                                     // 0x8(0x38)
	TArray<struct Text>                                          DisplayStringArgs;                                 // 0x40(0x10)
	bool                                                         IsProgressBar;                                     // 0x50(0x1)
	char                                                         pad0x7_D4UZP[0x7];                                 // 0x51(0x7)
};


// Size 0x1
struct EventEmotePreviewStarted
{
public:
	char                                                         pad0x1_Y1ISJ[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EmoteId
{
public:
	struct FName                                                 EmoteId;                                           // 0x0(0x8)
};


// Size 0x60
struct EmoteRandomObjectOutcomeTelemetryEvent
{
public:
	struct FString                                               MeshName;                                          // 0x0(0x10)
	struct Transform                                             Transform;                                         // 0x10(0x30)
	struct FString                                               TextureParameterName;                              // 0x40(0x10)
	int                                                          TextureParameterValue;                             // 0x50(0x4)
	char                                                         pad0xc_PG1FH[0xc];                                 // 0x54(0xc)
};


// Size 0xc
struct EventEmoteCompleted
{
public:
	struct FName                                                 EmoteName;                                         // 0x0(0x8)
	char                                                         pad0x4_8Y2UU[0x4];                                 // 0x8(0x4)
};


// Size 0xb0
struct EmoteInteractionTooltipData
{
public:
	struct EmoteInteractionTooltipInstance                       Tooltip;                                           // 0x0(0x58)
	struct EmoteInteractionTooltipInstance                       GreyedOut;                                         // 0x58(0x58)
};


// Size 0xc8
struct EmoteData
{
public:
	struct EmoteId                                               EmoteId;                                           // 0x0(0x8)
	struct FText                                                 EmoteDisplayName;                                  // 0x8(0x38)
	struct FText                                                 AudioDescription;                                  // 0x40(0x38)
	float                                                        DelayBeforeAllowingExit;                           // 0x78(0x4)
	float                                                        VerticalOffsetFactorWhenZoomed;                    // 0x7c(0x4)
	bool                                                         HideNameplate;                                     // 0x80(0x1)
	bool                                                         ShouldHideNameplateAlsoHideFromAI;                 // 0x81(0x1)
	char                                                         pad0x2_XR7E7[0x2];                                 // 0x82(0x2)
	float                                                        DurationUntilPlayerHiddenFromAI;                   // 0x84(0x4)
	class EmotePropData*                                         EmotePropDataAsset;                                // 0x88(0x8)
	bool                                                         CanPlayInSuccession;                               // 0x90(0x1)
	bool                                                         ShowDescriptionInTextChat;                         // 0x91(0x1)
	char                                                         pad0x6_SWQCO[0x6];                                 // 0x92(0x6)
	class AthenaSpringArmComponentParams*                        CustomSpringArmParamsAsset;                        // 0x98(0x8)
	bool                                                         OverrideInteractableBoxData;                       // 0xa0(0x1)
	char                                                         pad0x3_O5IQU[0x3];                                 // 0xa1(0x3)
	struct Vector                                                BoxExtent;                                         // 0xa4(0xc)
	struct Vector                                                BoxOrigin;                                         // 0xb0(0xc)
	struct Rotator                                               BoxRotation;                                       // 0xbc(0xc)
};


// Size 0x128
struct WalkableEmoteData
{
public:
	char                                                         pad0xc8_5O932[0xc8];                               // 0x0(0xc8)
	char                                                         WalkableEmoteType;                                 // 0xc8(0x1)
	char                                                         DisguiseIdentifier;                                // 0xc9(0x1)
	char                                                         pad0x2_68UAA[0x2];                                 // 0xca(0x2)
	float                                                        TimeBeforeMovementEnabled;                         // 0xcc(0x4)
	bool                                                         ShouldCollideWithPlayers;                          // 0xd0(0x1)
	char                                                         pad0x7_S3XIQ[0x7];                                 // 0xd1(0x7)
	TArray<struct EmoteInteractionTooltipData>                   EmotePrimaryInteractionTooltipData;                // 0xd8(0x10)
	TArray<struct EmoteInteractionTooltipData>                   EmoteSecondaryInteractionTooltipData;              // 0xe8(0x10)
	struct Vector                                                InteractionPromptOffset;                           // 0xf8(0xc)
	float                                                        MeshScaleOverride;                                 // 0x104(0x4)
	float                                                        MovementRotationRate;                              // 0x108(0x4)
	float                                                        DistanceThresholdToSendStat;                       // 0x10c(0x4)
	class WwiseEvent*                                            MovementStartEvent;                                // 0x110(0x8)
	class WwiseEvent*                                            MovementStopEvent;                                 // 0x118(0x8)
	class WwiseEvent*                                            MovementPutDownEvent;                              // 0x120(0x8)
};


// Size 0xc8
struct EventEmoteStarted
{
public:
	struct EmoteData                                             EmoteData;                                         // 0x0(0xc8)
};


// Size 0xd8
struct EventEmoteRequested
{
public:
	struct EmoteData                                             EmoteData;                                         // 0x0(0xc8)
	struct FName                                                 ForcedEmoteIdentifier;                             // 0xc8(0x8)
	bool                                                         ForcedEmote;                                       // 0xd0(0x1)
	char                                                         pad0x7_PQH46[0x7];                                 // 0xd1(0x7)
};


// Size 0xc8
struct EventEmoteSwapped
{
public:
	struct EmoteData                                             EmoteData;                                         // 0x0(0xc8)
};


// Size 0x128
struct EventWalkableEmoteStarted
{
public:
	struct WalkableEmoteData                                     WalkableEmoteData;                                 // 0x0(0x128)
};


// Size 0x128
struct EventWalkableEmoteRequested
{
public:
	struct WalkableEmoteData                                     WalkableEmoteData;                                 // 0x0(0x128)
};


