// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0
struct EmoteData
{
public:
	Struct EmoteId                                               EmoteId;                                           // 0x0(0x8)
	Struct FText                                                 EmoteDisplayName;                                  // 0x8(0x38)
	Struct FText                                                 AudioDescription;                                  // 0x40(0x38)
	float                                                        DelayBeforeAllowingExit;                           // 0x78(0x4)
	float                                                        VerticalOffsetFactorWhenZoomed;                    // 0x7c(0x4)
	bool                                                         HideNameplate;                                     // 0x80(0x1)
	char                                                         pad0x7_RIP1D[0x7];                                 // 0x81(0x7)
	Class EmotePropData*                                         EmotePropDataAsset;                                // 0x88(0x8)
	bool                                                         CanPlayInSuccession;                               // 0x90(0x1)
	bool                                                         ShowDescriptionInTextChat;                         // 0x91(0x1)
	char                                                         pad0x6_WXW4H[0x6];                                 // 0x92(0x6)
	Class AthenaSpringArmComponentParams*                        CustomSpringArmParamsAsset;                        // 0x98(0x8)
};


// Size 0x8
struct EmoteId
{
public:
	struct FName                                                 EmoteId;                                           // 0x0(0x8)
};


// Size 0x50
struct EmotePropRandomObjectResult
{
public:
	Class StaticMesh*                                            Mesh;                                              // 0x0(0x8)
	bool                                                         HasTransformValue;                                 // 0x8(0x1)
	char                                                         pad0x7_R66UW[0x7];                                 // 0x9(0x7)
	Struct Transform                                             Transform;                                         // 0x10(0x30)
	struct FName                                                 TextureParameterName;                              // 0x40(0x8)
	int                                                          TextureParameterValue;                             // 0x48(0x4)
};


// Size 0x30
struct EmotePropRandomObjectInfo
{
public:
	Class StaticMesh*                                            Mesh;                                              // 0x0(0x8)
	TArray<struct PossibleTransforms>                            PossibleTransforms;                                // 0x8(0x10)
	struct FName                                                 RandomParameterName;                               // 0x18(0x8)
	Struct Int32Range                                            RandomParameterRange;                              // 0x20(0x10)
};


// Size 0xc
struct EventEmoteEndRequested
{
public:
	struct FName                                                 EmoteIdentifier;                                   // 0x0(0x8)
	bool                                                         EndForcedEmote;                                    // 0x8(0x1)
};


// Size 0x1
struct EventEndEmoteAnimation
{
public:
};


// Size 0xa0
struct EventEmoteSwapped
{
public:
	Struct EmoteData                                             EmoteData;                                         // 0x0(0xa0)
};


// Size 0xc
struct EventEmoteCompleted
{
public:
	struct FName                                                 EmoteName;                                         // 0x0(0x8)
};


// Size 0xa0
struct EventEmoteStarted
{
public:
	Struct EmoteData                                             EmoteData;                                         // 0x0(0xa0)
};


// Size 0xb0
struct EventEmoteRequested
{
public:
	Struct EmoteData                                             EmoteData;                                         // 0x0(0xa0)
	struct FName                                                 ForcedEmoteIdentifier;                             // 0xa0(0x8)
	bool                                                         ForcedEmote;                                       // 0xa8(0x1)
};


// Size 0x1
struct EventDisableLookAtEmoteCamera
{
public:
};


// Size 0x8
struct EventEnableLookAtEmoteCamera
{
public:
};


// Size 0x14
struct EmoteDiceOutcomeTelemetryEvent
{
public:
	int                                                          MaxLimit;                                          // 0x0(0x4)
	int                                                          RollNumber;                                        // 0x4(0x4)
	Struct Vector                                                OrientationUsed;                                   // 0x8(0xc)
};


// Size 0x60
struct EmoteRandomObjectOutcomeTelemetryEvent
{
public:
	Struct FString                                               MeshName;                                          // 0x0(0x10)
	Struct Transform                                             Transform;                                         // 0x10(0x30)
	Struct FString                                               TextureParameterName;                              // 0x40(0x10)
	int                                                          TextureParameterValue;                             // 0x50(0x4)
};


}