// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class EnemyAIOnShipEncounterDesc: public DataAsset
{
public:
	Class AIFixedWavesSpawner*                                   SpawnerCrewSize1;                                  // 0x28(0x8)
	Class AIFixedWavesSpawner*                                   SpawnerCrewSize2;                                  // 0x30(0x8)
	Class AIFixedWavesSpawner*                                   SpawnerCrewSize3;                                  // 0x38(0x8)
	Class AIFixedWavesSpawner*                                   SpawnerCrewSize4;                                  // 0x40(0x8)
	float                                                        MigrationPreventionRadius;                         // 0x48(0x4)
	char                                                         pad0xc_HJJUP[0xc];                                 // 0x4a(0xc)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnemyAIOnShipServiceInterface: public Interface
{
public:
};


// Size 0xa8 (Full Size[0x470] - InheritedSize[0x3c8]
class EnemyAIOnShipService: public Actor
{
public:
	char                                                         pad0x20_UJKHD[0x20];                               // 0x3c8(0x20)
	Class EnemyAIOnShipServiceDataAsset*                         Params;                                            // 0x3e8(0x8)
	TArray<Struct EnemyAIOnShipActiveEncounters>                 ReplicatedEncounters;                              // 0x3f0(0x10)
	char                                                         pad0x90_T8CJ4[0x90];                               // 0x3fe(0x90)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class EnemyAIOnShipServiceDataAsset: public DataAsset
{
public:
	Class EnemyAIOnShipEncounterDesc*                            OceanCrawlersOnShipEncounterParams;                // 0x28(0x8)
};


}