// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x28
struct DistributionLookupTable
{
public:
	byte                                                         Op;                                                // 0x0(0x1)
	byte                                                         EntryCount;                                        // 0x1(0x1)
	byte                                                         EntryStride;                                       // 0x2(0x1)
	byte                                                         SubEntryStride;                                    // 0x3(0x1)
	float                                                        TimeScale;                                         // 0x4(0x4)
	float                                                        TimeBias;                                          // 0x8(0x4)
	char                                                         pad0x4_2FTF1[0x4];                                 // 0xc(0x4)
	TArray<Float Values>                                         Values;                                            // 0x10(0x10)
	byte                                                         LockFlag;                                          // 0x20(0x1)
	char                                                         pad0x7_6MTK1[0x7];                                 // 0x21(0x7)
};


// Size 0x28
struct RawDistribution
{
public:
	struct DistributionLookupTable                               Table;                                             // 0x0(0x28)
};


// Size 0x28
struct FloatDistribution
{
public:
	struct DistributionLookupTable                               Table;                                             // 0x0(0x28)
};


// Size 0x28
struct VectorDistribution
{
public:
	struct DistributionLookupTable                               Table;                                             // 0x0(0x28)
};


// Size 0x28
struct Vector4Distribution
{
public:
	struct DistributionLookupTable                               Table;                                             // 0x0(0x28)
};


// Size 0x38
struct ExpressionInput
{
public:
	class MaterialExpression*                                    Expression;                                        // 0x0(0x8)
	int                                                          OutputIndex;                                       // 0x8(0x4)
	char                                                         pad0x4_RD5WA[0x4];                                 // 0xc(0x4)
	struct FString                                               InputName;                                         // 0x10(0x10)
	int                                                          Mask;                                              // 0x20(0x4)
	int                                                          MaskR;                                             // 0x24(0x4)
	int                                                          MaskG;                                             // 0x28(0x4)
	int                                                          MaskB;                                             // 0x2c(0x4)
	int                                                          MaskA;                                             // 0x30(0x4)
	int                                                          GCC64_Padding;                                     // 0x34(0x4)
};


// Size 0x38
struct MaterialAttributesInput
{
public:
	char                                                         pad0x38_9S8CZ[0x38];                               // 0x0(0x38)
};


// Size 0x28
struct ExpressionOutput
{
public:
	struct FString                                               OutputName;                                        // 0x0(0x10)
	int                                                          Mask;                                              // 0x10(0x4)
	int                                                          MaskR;                                             // 0x14(0x4)
	int                                                          MaskG;                                             // 0x18(0x4)
	int                                                          MaskB;                                             // 0x1c(0x4)
	int                                                          MaskA;                                             // 0x20(0x4)
	char                                                         pad0x4_QD0WI[0x4];                                 // 0x24(0x4)
};


// Size 0x38
struct MaterialInput
{
public:
	class MaterialExpression*                                    Expression;                                        // 0x0(0x8)
	int                                                          OutputIndex;                                       // 0x8(0x4)
	char                                                         pad0x4_2XBJ4[0x4];                                 // 0xc(0x4)
	struct FString                                               InputName;                                         // 0x10(0x10)
	int                                                          Mask;                                              // 0x20(0x4)
	int                                                          MaskR;                                             // 0x24(0x4)
	int                                                          MaskG;                                             // 0x28(0x4)
	int                                                          MaskB;                                             // 0x2c(0x4)
	int                                                          MaskA;                                             // 0x30(0x4)
	int                                                          GCC64_Padding;                                     // 0x34(0x4)
};


// Size 0x40
struct ColorMaterialInput
{
public:
	char                                                         pad0x38_5ZAWU[0x38];                               // 0x0(0x38)
	bool                                                         UseConstant;                                       // 0x38(0x1)
	char                                                         pad0x3_HLYCT[0x3];                                 // 0x39(0x3)
	struct Color                                                 Constant;                                          // 0x3c(0x4)
};


// Size 0x40
struct ScalarMaterialInput
{
public:
	char                                                         pad0x38_GXH6C[0x38];                               // 0x0(0x38)
	bool                                                         UseConstant;                                       // 0x38(0x1)
	char                                                         pad0x3_3SPBH[0x3];                                 // 0x39(0x3)
	float                                                        Constant;                                          // 0x3c(0x4)
};


// Size 0x48
struct VectorMaterialInput
{
public:
	char                                                         pad0x38_47RSH[0x38];                               // 0x0(0x38)
	bool                                                         UseConstant;                                       // 0x38(0x1)
	char                                                         pad0x3_D6S6T[0x3];                                 // 0x39(0x3)
	struct Vector                                                Constant;                                          // 0x3c(0xc)
};


// Size 0x48
struct Vector2MaterialInput
{
public:
	char                                                         pad0x38_1UTTR[0x38];                               // 0x0(0x38)
	bool                                                         UseConstant;                                       // 0x38(0x1)
	char                                                         pad0x3_ANDQ4[0x3];                                 // 0x39(0x3)
	float                                                        ConstantX;                                         // 0x3c(0x4)
	float                                                        ConstantY;                                         // 0x40(0x4)
	char                                                         pad0x4_21W2R[0x4];                                 // 0x44(0x4)
};


// Size 0x80
struct HitResult
{
public:
	bool                                                         bBlockingHit;                                      // 0x0(0x1)
	bool                                                         bStartPenetrating;                                 // 0x0(0x1)
	char                                                         pad0x3_FDQXR[0x3];                                 // 0x1(0x3)
	float                                                        Time;                                              // 0x4(0x4)
	float                                                        Distance;                                          // 0x8(0x4)
	struct Vector_NetQuantize                                    Location;                                          // 0xc(0xc)
	struct Vector_NetQuantize                                    ImpactPoint;                                       // 0x18(0xc)
	struct Vector_NetQuantizeNormal                              Normal;                                            // 0x24(0xc)
	struct Vector_NetQuantizeNormal                              ImpactNormal;                                      // 0x30(0xc)
	struct Vector_NetQuantize                                    TraceStart;                                        // 0x3c(0xc)
	struct Vector_NetQuantize                                    TraceEnd;                                          // 0x48(0xc)
	float                                                        PenetrationDepth;                                  // 0x54(0x4)
	int                                                          Item;                                              // 0x58(0x4)
	struct FName                                                 BoneName;                                          // 0x74(0x8)
	int                                                          FaceIndex;                                         // 0x7c(0x4)
};


// Size 0xc
struct Vector_NetQuantize
{
public:
	char                                                         pad0xc_WP43L[0xc];                                 // 0x0(0xc)
};


// Size 0xc
struct Vector_NetQuantizeNormal
{
public:
	char                                                         pad0xc_I6KS5[0xc];                                 // 0x0(0xc)
};


// Size 0x8
struct ActorPtr
{
public:
	class Actor*                                                 Actor;                                             // 0x0(0x8)
};


// Size 0x48
struct RepAttachment
{
public:
	class Actor*                                                 AttachParent;                                      // 0x0(0x8)
	struct Vector_NetQuantize100                                 LocationOffset;                                    // 0x8(0xc)
	struct Vector_NetQuantize100                                 RelativeScale3D;                                   // 0x14(0xc)
	struct Rotator                                               RotationOffset;                                    // 0x20(0xc)
	struct FName                                                 AttachSocket;                                      // 0x2c(0x8)
	char                                                         pad0x4_1H7ZQ[0x4];                                 // 0x34(0x4)
	class SceneComponent*                                        AttachComponent;                                   // 0x38(0x8)
	char                                                         pad0x8_JKP80[0x8];                                 // 0x40(0x8)
};


// Size 0xc
struct Vector_NetQuantize100
{
public:
	char                                                         pad0xc_80UL1[0xc];                                 // 0x0(0xc)
};


// Size 0x38
struct RepMovement
{
public:
	struct Vector                                                LinearVelocity;                                    // 0x0(0xc)
	struct Vector                                                AngularVelocity;                                   // 0xc(0xc)
	struct Vector                                                Location;                                          // 0x18(0xc)
	struct Rotator                                               Rotation;                                          // 0x24(0xc)
	bool                                                         bSimulatedPhysicSleep;                             // 0x30(0x1)
	bool                                                         bRepPhysics;                                       // 0x30(0x1)
	byte                                                         LocationQuantizationLevel;                         // 0x31(0x1)
	byte                                                         VelocityQuantizationLevel;                         // 0x32(0x1)
	byte                                                         RotationQuantizationLevel;                         // 0x33(0x1)
	char                                                         pad0x4_UVOG1[0x4];                                 // 0x34(0x4)
};


// Size 0x50
struct ActorTickFunction
{
public:
	char                                                         pad0x50_PJ63T[0x50];                               // 0x0(0x50)
};


// Size 0x48
struct TickFunction
{
public:
	char                                                         pad0x30_JYGZN[0x30];                               // 0x0(0x30)
	byte                                                         TickGroup;                                         // 0x30(0x1)
	char                                                         pad0x1_HX5J0[0x1];                                 // 0x31(0x1)
	bool                                                         bTickEvenWhenPaused;                               // 0x32(0x1)
	bool                                                         bCanEverTick;                                      // 0x32(0x1)
	bool                                                         bStartWithTickEnabled;                             // 0x32(0x1)
	bool                                                         bAllowTickOnDedicatedServer;                       // 0x32(0x1)
	char                                                         pad0xd_UCFRD[0xd];                                 // 0x33(0xd)
	float                                                        TickInterval;                                      // 0x40(0x4)
	char                                                         pad0x4_OG7H9[0x4];                                 // 0x44(0x4)
};


// Size 0x20
struct SimpleMemberReference
{
public:
	class Object*                                                MemberParent;                                      // 0x0(0x8)
	struct FName                                                 MemberName;                                        // 0x8(0x8)
	struct Guid                                                  MemberGuid;                                        // 0x10(0x10)
};


// Size 0x50
struct ActorComponentTickFunction
{
public:
	char                                                         pad0x50_NEQDI[0x50];                               // 0x0(0x50)
};


// Size 0x40
struct SubtitleCue
{
public:
	struct FText                                                 Text;                                              // 0x0(0x38)
	float                                                        Time;                                              // 0x38(0x4)
	char                                                         pad0x4_C137W[0x4];                                 // 0x3c(0x4)
};


// Size 0x1c
struct InterpControlPoint
{
public:
	struct Vector                                                PositionControlPoint;                              // 0x0(0xc)
	bool                                                         bPositionIsRelative;                               // 0xc(0x1)
	char                                                         pad0xf_SQ1MJ[0xf];                                 // 0xd(0xf)
};


// Size 0x38
struct PlatformInterfaceDelegateResult
{
public:
	bool                                                         bSuccessful;                                       // 0x0(0x1)
	char                                                         pad0x7_4BK2R[0x7];                                 // 0x1(0x7)
	struct PlatformInterfaceData                                 Data;                                              // 0x8(0x30)
};


// Size 0x30
struct PlatformInterfaceData
{
public:
	struct FName                                                 DataName;                                          // 0x0(0x8)
	byte                                                         Type;                                              // 0x8(0x1)
	char                                                         pad0x3_1M052[0x3];                                 // 0x9(0x3)
	int                                                          IntValue;                                          // 0xc(0x4)
	float                                                        FloatValue;                                        // 0x10(0x4)
	char                                                         pad0x4_PBL3H[0x4];                                 // 0x14(0x4)
	struct FString                                               StringValue;                                       // 0x18(0x10)
	class Object*                                                ObjectValue;                                       // 0x28(0x8)
};


// Size 0x20
struct DebugFloatHistory
{
public:
	TArray<Float Samples>                                        Samples;                                           // 0x0(0x10)
	float                                                        MaxSamples;                                        // 0x10(0x4)
	float                                                        MinValue;                                          // 0x14(0x4)
	float                                                        MaxValue;                                          // 0x18(0x4)
	bool                                                         bAutoAdjustMinMax;                                 // 0x1c(0x1)
	char                                                         pad0x3_KX1II[0x3];                                 // 0x1d(0x3)
};


// Size 0x18
struct LatentActionInfo
{
public:
	int                                                          Linkage;                                           // 0x0(0x4)
	int                                                          UUID;                                              // 0x4(0x4)
	struct FName                                                 ExecutionFunction;                                 // 0x8(0x8)
	class Object*                                                CallbackTarget;                                    // 0x10(0x8)
};


// Size 0x4
struct TimerHandle
{
public:
	char                                                         pad0x4_KU9GR[0x4];                                 // 0x0(0x4)
};


// Size 0x8
struct CollisionProfileName
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
};


// Size 0x4
struct GenericStruct
{
public:
	int                                                          Data;                                              // 0x0(0x4)
};


// Size 0x8
struct FastArraySerializerItem
{
public:
	int                                                          ReplicationID;                                     // 0x0(0x4)
	int                                                          ReplicationKey;                                    // 0x4(0x4)
};


// Size 0xa8
struct FastArraySerializer
{
public:
	char                                                         pad0xa8_4IIV6[0xa8];                               // 0x0(0xa8)
};


// Size 0x84
struct OverlapInfo
{
public:
	char                                                         pad0x84_S6RN4[0x84];                               // 0x0(0x84)
};


// Size 0x8
struct WalkableSlopeOverride
{
public:
	byte                                                         WalkableSlopeBehavior;                             // 0x0(0x1)
	char                                                         pad0x3_CGOZD[0x3];                                 // 0x1(0x3)
	float                                                        WalkableSlopeAngle;                                // 0x4(0x4)
};


// Size 0x50
struct PrimitiveComponentPostPhysicsTickFunction
{
public:
	char                                                         pad0x50_B1K61[0x50];                               // 0x0(0x50)
};


// Size 0x180
struct BodyInstance
{
public:
	char                                                         pad0x4_W2I11[0x4];                                 // 0x0(0x4)
	struct Vector                                                Scale3D;                                           // 0x4(0xc)
	char                                                         pad0x4_DMLJB[0x4];                                 // 0x10(0x4)
	struct FName                                                 CollisionProfileName;                              // 0x14(0x8)
	char                                                         pad0x4_UHY1G[0x4];                                 // 0x1c(0x4)
	struct CollisionResponse                                     CollisionResponses;                                // 0x20(0x30)
	bool                                                         bUseCCD;                                           // 0x50(0x1)
	bool                                                         bNotifyRigidBodyCollision;                         // 0x50(0x1)
	bool                                                         bSimulatePhysics;                                  // 0x50(0x1)
	bool                                                         bOverrideMass;                                     // 0x50(0x1)
	bool                                                         bOverrideMassProperties;                           // 0x50(0x1)
	bool                                                         bEnableGravity;                                    // 0x50(0x1)
	bool                                                         bAutoWeld;                                         // 0x50(0x1)
	bool                                                         bStartAwake;                                       // 0x51(0x1)
	bool                                                         bGenerateWakeEvents;                               // 0x51(0x1)
	bool                                                         bUpdateMassWhenScaleChanges;                       // 0x51(0x1)
	bool                                                         bLockTranslation;                                  // 0x51(0x1)
	bool                                                         bLockRotation;                                     // 0x51(0x1)
	bool                                                         bLockXTranslation;                                 // 0x51(0x1)
	bool                                                         bLockYTranslation;                                 // 0x51(0x1)
	bool                                                         bLockZTranslation;                                 // 0x51(0x1)
	bool                                                         bLockXRotation;                                    // 0x52(0x1)
	bool                                                         bLockYRotation;                                    // 0x52(0x1)
	bool                                                         bLockZRotation;                                    // 0x52(0x1)
	bool                                                         bOverrideMaxAngularVelocity;                       // 0x52(0x1)
	bool                                                         bUseAsyncScene;                                    // 0x52(0x1)
	bool                                                         bOverrideMaxDepenetrationVelocity;                 // 0x52(0x1)
	bool                                                         bOverrideWalkableSlopeOnInstance;                  // 0x52(0x1)
	char                                                         pad0x1_UZB9G[0x1];                                 // 0x53(0x1)
	float                                                        MaxDepenetrationVelocity;                          // 0x54(0x4)
	float                                                        MassInKg;                                          // 0x58(0x4)
	struct MassPropertiesOverride                                MassPropertiesOverride;                            // 0x5c(0x24)
	float                                                        LinearDamping;                                     // 0x80(0x4)
	float                                                        AngularDamping;                                    // 0x84(0x4)
	struct Vector                                                COMNudge;                                          // 0x88(0xc)
	float                                                        MassScale;                                         // 0x94(0x4)
	char                                                         pad0x10_0NTSY[0x10];                               // 0x98(0x10)
	struct WalkableSlopeOverride                                 WalkableSlopeOverride;                             // 0xa8(0x8)
	class PhysicalMaterial*                                      PhysMaterialOverride;                              // 0xb0(0x8)
	float                                                        MaxAngularVelocity;                                // 0xb8(0x4)
	float                                                        CustomSleepThresholdMultiplier;                    // 0xbc(0x4)
	float                                                        PhysicsBlendWeight;                                // 0xc0(0x4)
	int                                                          PositionSolverIterationCount;                      // 0xc4(0x4)
	byte                                                         DominanceGroup;                                    // 0xc8(0x1)
	char                                                         pad0x37_POCVM[0x37];                               // 0xc9(0x37)
	int                                                          VelocitySolverIterationCount;                      // 0x110(0x4)
	char                                                         pad0x68_TYKVR[0x68];                               // 0x114(0x68)
	byte                                                         SleepFamily;                                       // 0x17c(0x1)
	byte                                                         DOFMode;                                           // 0x17d(0x1)
	byte                                                         CollisionEnabled;                                  // 0x17e(0x1)
	byte                                                         ObjectType;                                        // 0x17f(0x1)
};


// Size 0x24
struct MassPropertiesOverride
{
public:
	struct Vector                                                InertiaTensorOverride;                             // 0x0(0xc)
	struct Vector                                                COMTranslationOverride;                            // 0xc(0xc)
	struct Rotator                                               COMRotatorOverride;                                // 0x18(0xc)
};


// Size 0x30
struct CollisionResponse
{
public:
	struct CollisionResponseContainer                            ResponseToChannels;                                // 0x0(0x20)
	TArray<struct ResponseChannel>                               ResponseArray;                                     // 0x20(0x10)
};


// Size 0xc
struct ResponseChannel
{
public:
	struct FName                                                 Channel;                                           // 0x0(0x8)
	byte                                                         Response;                                          // 0x8(0x1)
	char                                                         pad0x3_SBVE9[0x3];                                 // 0x9(0x3)
};


// Size 0x20
struct CollisionResponseContainer
{
public:
	byte                                                         WorldStatic;                                       // 0x0(0x1)
	byte                                                         WorldDynamic;                                      // 0x1(0x1)
	byte                                                         Pawn;                                              // 0x2(0x1)
	byte                                                         Visibility;                                        // 0x3(0x1)
	byte                                                         Camera;                                            // 0x4(0x1)
	byte                                                         PhysicsBody;                                       // 0x5(0x1)
	byte                                                         Vehicle;                                           // 0x6(0x1)
	byte                                                         Destructible;                                      // 0x7(0x1)
	byte                                                         EngineTraceChannel1;                               // 0x8(0x1)
	byte                                                         EngineTraceChannel2;                               // 0x9(0x1)
	byte                                                         EngineTraceChannel3;                               // 0xa(0x1)
	byte                                                         EngineTraceChannel4;                               // 0xb(0x1)
	byte                                                         EngineTraceChannel5;                               // 0xc(0x1)
	byte                                                         EngineTraceChannel6;                               // 0xd(0x1)
	byte                                                         GameTraceChannel1;                                 // 0xe(0x1)
	byte                                                         GameTraceChannel2;                                 // 0xf(0x1)
	byte                                                         GameTraceChannel3;                                 // 0x10(0x1)
	byte                                                         GameTraceChannel4;                                 // 0x11(0x1)
	byte                                                         GameTraceChannel5;                                 // 0x12(0x1)
	byte                                                         GameTraceChannel6;                                 // 0x13(0x1)
	byte                                                         GameTraceChannel7;                                 // 0x14(0x1)
	byte                                                         GameTraceChannel8;                                 // 0x15(0x1)
	byte                                                         GameTraceChannel9;                                 // 0x16(0x1)
	byte                                                         GameTraceChannel10;                                // 0x17(0x1)
	byte                                                         GameTraceChannel11;                                // 0x18(0x1)
	byte                                                         GameTraceChannel12;                                // 0x19(0x1)
	byte                                                         GameTraceChannel13;                                // 0x1a(0x1)
	byte                                                         GameTraceChannel14;                                // 0x1b(0x1)
	byte                                                         GameTraceChannel15;                                // 0x1c(0x1)
	byte                                                         GameTraceChannel16;                                // 0x1d(0x1)
	byte                                                         GameTraceChannel17;                                // 0x1e(0x1)
	byte                                                         GameTraceChannel18;                                // 0x1f(0x1)
};


// Size 0x10
struct CustomPrimitiveData
{
public:
	TArray<Float Data>                                           Data;                                              // 0x0(0x10)
};


// Size 0x80
struct RuntimeFloatCurve
{
public:
	struct RichCurve                                             EditorCurveData;                                   // 0x0(0x78)
	class CurveFloat*                                            ExternalCurve;                                     // 0x78(0x8)
};


// Size 0x78
struct RichCurve
{
public:
	char                                                         pad0x58_QX6OZ[0x58];                               // 0x0(0x58)
	byte                                                         PreInfinityExtrap;                                 // 0x58(0x1)
	byte                                                         PostInfinityExtrap;                                // 0x59(0x1)
	char                                                         pad0x6_MEVGZ[0x6];                                 // 0x5a(0x6)
	TArray<struct RichCurveKey>                                  Keys;                                              // 0x60(0x10)
	float                                                        DefaultValue;                                      // 0x70(0x4)
	char                                                         pad0x4_3E1YV[0x4];                                 // 0x74(0x4)
};


// Size 0x58
struct IndexedCurve
{
public:
	char                                                         pad0x8_IGGML[0x8];                                 // 0x0(0x8)
	struct KeyHandleMap                                          KeyHandlesToIndices;                               // 0x8(0x50)
};


// Size 0x50
struct KeyHandleMap
{
public:
	char                                                         pad0x50_M54VQ[0x50];                               // 0x0(0x50)
};


// Size 0x1c
struct RichCurveKey
{
public:
	byte                                                         InterpMode;                                        // 0x0(0x1)
	byte                                                         TangentMode;                                       // 0x1(0x1)
	byte                                                         TangentWeightMode;                                 // 0x2(0x1)
	char                                                         pad0x1_AFO3O[0x1];                                 // 0x3(0x1)
	float                                                        Time;                                              // 0x4(0x4)
	float                                                        Value;                                             // 0x8(0x4)
	float                                                        ArriveTangent;                                     // 0xc(0x4)
	float                                                        ArriveTangentWeight;                               // 0x10(0x4)
	float                                                        LeaveTangent;                                      // 0x14(0x4)
	float                                                        LeaveTangentWeight;                                // 0x18(0x4)
};


// Size 0xc
struct FeatureFlag
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	bool                                                         InverseToggle;                                     // 0x8(0x1)
	char                                                         pad0x3_SGSUB[0x3];                                 // 0x9(0x3)
};


// Size 0x14
struct NetActorPtr
{
public:
	struct NetObjectPtr                                          ObjectPtr;                                         // 0x0(0x14)
};


// Size 0x14
struct NetObjectPtr
{
public:
	char                                                         pad0x14_2OGM1[0x14];                               // 0x0(0x14)
};


// Size 0x20
struct PacketDiscardStats
{
public:
	int                                                          DiscardCounts;                                     // 0x0(0x4)
	char                                                         pad0x18_NOP21[0x18];                               // 0x4(0x18)
	int                                                          BytesDiscarded;                                    // 0x1c(0x4)
};


// Size 0x18
struct UniqueNetIdRepl
{
public:
	char                                                         pad0x18_X6DT8[0x18];                               // 0x0(0x18)
};


// Size 0xc0
struct RainPostProcessSettings
{
public:
	bool                                                         bOverride_RainParticleTexture;                     // 0x0(0x1)
	bool                                                         bOverride_RainMeshTexture;                         // 0x0(0x1)
	bool                                                         bOverride_RainIntensity;                           // 0x0(0x1)
	bool                                                         bOverride_RainParticleAlpha;                       // 0x0(0x1)
	bool                                                         bOverride_RainCloseParticleAlphaReductionMultiplier; // 0x0(0x1)
	bool                                                         bOverride_RainCloseParticleAlphaDistance;          // 0x0(0x1)
	bool                                                         bOverride_RainParticleDensity;                     // 0x0(0x1)
	bool                                                         bOverride_RainParticleSpeed;                       // 0x0(0x1)
	bool                                                         bOverride_RainParticleWindVelocity;                // 0x1(0x1)
	bool                                                         bOverride_RainParticleWidth;                       // 0x1(0x1)
	bool                                                         bOverride_RainParticleLength;                      // 0x1(0x1)
	bool                                                         bOverride_RainMeshScale;                           // 0x1(0x1)
	bool                                                         bOverride_RainMeshTextureScroll;                   // 0x1(0x1)
	bool                                                         bOverride_RainMeshTextureTiling;                   // 0x1(0x1)
	bool                                                         bOverride_RainMeshAlpha;                           // 0x1(0x1)
	bool                                                         bOverride_RainMeshRowDivision;                     // 0x1(0x1)
	bool                                                         bOverride_RainMeshColumnDivision;                  // 0x2(0x1)
	bool                                                         bOverride_RainMeshBrightness;                      // 0x2(0x1)
	bool                                                         bOverride_RainBrightness;                          // 0x2(0x1)
	bool                                                         bOverride_RainTint;                                // 0x2(0x1)
	bool                                                         bOverride_RainMeshEndRadiusScale;                  // 0x2(0x1)
	bool                                                         bOverride_RainMeshEndAlphaFade;                    // 0x2(0x1)
	bool                                                         bOverride_RainMeshFadeDistance;                    // 0x2(0x1)
	bool                                                         bOverride_RainAnimationFrameTime;                  // 0x2(0x1)
	bool                                                         bOverride_RainSplashesPerSecond;                   // 0x3(0x1)
	bool                                                         bOverride_RainSplashesPerSquareMetre;              // 0x3(0x1)
	bool                                                         bOverride_RainSplashesMaxPlacementAngle;           // 0x3(0x1)
	bool                                                         bOverride_RainSplashData;                          // 0x3(0x1)
	bool                                                         bOverride_RainSplashesMaxDistance1;                // 0x3(0x1)
	bool                                                         bOverride_RainSplashData2;                         // 0x3(0x1)
	bool                                                         bOverride_RainSplashesMaxDistance2;                // 0x3(0x1)
	char                                                         pad0x4_U6G9I[0x4];                                 // 0x4(0x4)
	class Texture*                                               RainParticleTexture;                               // 0x8(0x8)
	class Texture*                                               RainMeshTexture;                                   // 0x10(0x8)
	float                                                        RainIntensity;                                     // 0x18(0x4)
	float                                                        RainParticleAlpha;                                 // 0x1c(0x4)
	float                                                        RainCloseParticleAlphaReductionMultiplier;         // 0x20(0x4)
	float                                                        RainCloseParticleAlphaDistance;                    // 0x24(0x4)
	float                                                        RainParticleDensity;                               // 0x28(0x4)
	float                                                        RainParticleSpeed;                                 // 0x2c(0x4)
	struct Vector                                                RainParticleWindVelocity;                          // 0x30(0xc)
	float                                                        RainParticleWidth;                                 // 0x3c(0x4)
	float                                                        RainParticleLength;                                // 0x40(0x4)
	struct Vector                                                RainMeshScale;                                     // 0x44(0xc)
	struct Vector2D                                              RainMeshTextureScroll;                             // 0x50(0x8)
	struct Vector2D                                              RainMeshTextureTiling;                             // 0x58(0x8)
	float                                                        RainMeshAlpha;                                     // 0x60(0x4)
	int                                                          RainMeshRowDivision;                               // 0x64(0x4)
	int                                                          RainMeshColumnDivision;                            // 0x68(0x4)
	float                                                        RainMeshEndRadiusScale;                            // 0x6c(0x4)
	float                                                        RainMeshEndAlphaFade;                              // 0x70(0x4)
	float                                                        RainMeshFadeDistance;                              // 0x74(0x4)
	float                                                        RainMeshBrightness;                                // 0x78(0x4)
	float                                                        RainBrightness;                                    // 0x7c(0x4)
	struct LinearColor                                           RainTint;                                          // 0x80(0x10)
	float                                                        RainAnimationFrameTime;                            // 0x90(0x4)
	int                                                          RainSplashesPerSecond;                             // 0x94(0x4)
	float                                                        RainSplashesPerSquareMetre;                        // 0x98(0x4)
	float                                                        RainSplashesMaxPlacementAngle;                     // 0x9c(0x4)
	class ParticleComputeShaderData*                             RainSplashData;                                    // 0xa0(0x8)
	float                                                        RainSplashesMaxDistance1;                          // 0xa8(0x4)
	char                                                         pad0x4_DWN5Q[0x4];                                 // 0xac(0x4)
	class ParticleComputeShaderData*                             RainSplashData2;                                   // 0xb0(0x8)
	float                                                        RainSplashesMaxDistance2;                          // 0xb8(0x4)
	char                                                         pad0x4_UQIRF[0x4];                                 // 0xbc(0x4)
};


// Size 0x170
struct RuntimeVectorCurve
{
public:
	struct RichCurve                                             FloatCurves;                                       // 0x0(0x78)
	char                                                         pad0xf0_FPVZT[0xf0];                               // 0x78(0xf0)
	class CurveVector*                                           ExternalCurve;                                     // 0x168(0x8)
};


// Size 0x1
struct TableRowBase
{
public:
	char                                                         pad0x1_QDUCZ[0x1];                                 // 0x0(0x1)
};


// Size 0x14
struct NetSubObjectPtr
{
public:
	struct NetObjectPtr                                          SubObject;                                         // 0x0(0x14)
};


// Size 0x38
struct SerializeNewActorFailureContext
{
public:
	struct FString                                               Description;                                       // 0x0(0x10)
	TArray<struct NetGuidResolveStackEntry>                      ActorGuidResolveStack;                             // 0x10(0x10)
	TArray<struct NetGuidResolveStackEntry>                      ArchetypeGuidResolveStack;                         // 0x20(0x10)
	bool                                                         IsCloseBunch;                                      // 0x30(0x1)
	char                                                         pad0x7_CG7V1[0x7];                                 // 0x31(0x7)
};


// Size 0x40
struct NetGuidResolveStackEntry
{
public:
	char                                                         pad0x8_27O1J[0x8];                                 // 0x0(0x8)
	struct FString                                               ObjectPath;                                        // 0x8(0x10)
	struct FString                                               path;                                              // 0x18(0x10)
	struct FString                                               AdditionalDetails;                                 // 0x28(0x10)
	byte                                                         Result;                                            // 0x38(0x1)
	char                                                         pad0x7_573NE[0x7];                                 // 0x39(0x7)
};


// Size 0x30
struct AnimNode_Base
{
public:
	char                                                         pad0x8_9UKSE[0x8];                                 // 0x0(0x8)
	struct ExposedValueHandler                                   EvaluateGraphExposedInputs;                        // 0x8(0x28)
};


// Size 0x28
struct ExposedValueHandler
{
public:
	struct FName                                                 BoundFunction;                                     // 0x0(0x8)
	TArray<struct ExposedValueCopyRecord>                        CopyRecords;                                       // 0x8(0x10)
	char                                                         pad0x10_Z8WHT[0x10];                               // 0x18(0x10)
};


// Size 0x70
struct ExposedValueCopyRecord
{
public:
	class Property*                                              SourceProperty;                                    // 0x0(0x8)
	struct FName                                                 SourcePropertyName;                                // 0x8(0x8)
	TArray<struct FName>                                         SourceSubPropertyNames;                            // 0x10(0x10)
	int                                                          SourceArrayIndex;                                  // 0x20(0x4)
	char                                                         pad0x4_413KX[0x4];                                 // 0x24(0x4)
	class Property*                                              DestProperty;                                      // 0x28(0x8)
	int                                                          DestArrayIndex;                                    // 0x30(0x4)
	int                                                          Size;                                              // 0x34(0x4)
	byte                                                         PostCopyOperation;                                 // 0x38(0x1)
	char                                                         pad0x7_71R28[0x7];                                 // 0x39(0x7)
	class BoolProperty*                                          CachedBoolSourceProperty;                          // 0x40(0x8)
	class BoolProperty*                                          CachedBoolDestProperty;                            // 0x48(0x8)
	char                                                         pad0x20_TOLZ7[0x20];                               // 0x50(0x20)
};


// Size 0x8
struct InputScaleBias
{
public:
	float                                                        Scale;                                             // 0x0(0x4)
	float                                                        Bias;                                              // 0x4(0x4)
};


// Size 0x18
struct ComponentSpacePoseLink
{
public:
	char                                                         pad0x18_WEVIJ[0x18];                               // 0x0(0x18)
};


// Size 0x18
struct PoseLinkBase
{
public:
	int                                                          LinkID;                                            // 0x0(0x4)
	char                                                         pad0x14_A15II[0x14];                               // 0x4(0x14)
};


// Size 0xc
struct BoneReference
{
public:
	struct FName                                                 BoneName;                                          // 0x0(0x8)
	char                                                         pad0x4_WJ39M[0x4];                                 // 0x8(0x4)
};


// Size 0x70
struct IntegralCurve
{
public:
	char                                                         pad0x58_2TIEV[0x58];                               // 0x0(0x58)
	TArray<struct IntegralKey>                                   Keys;                                              // 0x58(0x10)
	int                                                          DefaultValue;                                      // 0x68(0x4)
	bool                                                         bUseDefaultValueBeforeFirstKey;                    // 0x6c(0x1)
	char                                                         pad0x3_E1O8E[0x3];                                 // 0x6d(0x3)
};


// Size 0x8
struct IntegralKey
{
public:
	float                                                        Time;                                              // 0x0(0x4)
	int                                                          Value;                                             // 0x4(0x4)
};


// Size 0x78
struct StringCurve
{
public:
	char                                                         pad0x58_O9EBU[0x58];                               // 0x0(0x58)
	struct FString                                               DefaultValue;                                      // 0x58(0x10)
	TArray<struct StringCurveKey>                                Keys;                                              // 0x68(0x10)
};


// Size 0x18
struct StringCurveKey
{
public:
	float                                                        Time;                                              // 0x0(0x4)
	char                                                         pad0x4_6D0TX[0x4];                                 // 0x4(0x4)
	struct FString                                               Value;                                             // 0x8(0x10)
};


// Size 0x10
struct DirectoryPath
{
public:
	struct FString                                               path;                                              // 0x0(0x10)
};


// Size 0x50
struct EdGraphPinType
{
public:
	struct FString                                               PinCategory;                                       // 0x0(0x10)
	struct FString                                               PinSubCategory;                                    // 0x10(0x10)
	struct SimpleMemberReference                                 PinSubCategoryMemberReference;                     // 0x28(0x20)
	bool                                                         bIsArray;                                          // 0x48(0x1)
	bool                                                         bIsReference;                                      // 0x49(0x1)
	bool                                                         bIsConst;                                          // 0x4a(0x1)
	bool                                                         bIsWeakPointer;                                    // 0x4b(0x1)
	char                                                         pad0x4_3IMTP[0x4];                                 // 0x4c(0x4)
};


// Size 0x8
struct ExposureSettings
{
public:
	int                                                          LogOffset;                                         // 0x0(0x4)
	bool                                                         bFixed;                                            // 0x4(0x1)
	char                                                         pad0x3_Y9EIL[0x3];                                 // 0x5(0x3)
};


// Size 0x70
struct URL
{
public:
	struct FString                                               Protocol;                                          // 0x0(0x10)
	struct FString                                               Host;                                              // 0x10(0x10)
	int                                                          Port;                                              // 0x20(0x4)
	char                                                         pad0x4_FPHBI[0x4];                                 // 0x24(0x4)
	struct FString                                               Map;                                               // 0x28(0x10)
	struct FString                                               RedirectURL;                                       // 0x38(0x10)
	TArray<Str Op>                                               Op;                                                // 0x48(0x10)
	struct FString                                               Portal;                                            // 0x58(0x10)
	int                                                          Valid;                                             // 0x68(0x4)
	char                                                         pad0x4_81BNN[0x4];                                 // 0x6c(0x4)
};


// Size 0x10
struct TickPrerequisite
{
public:
	char                                                         pad0x10_QPDQ1[0x10];                               // 0x0(0x10)
};


// Size 0x4
struct Float_NetQuantized
{
public:
	char                                                         pad0x4_PEJWW[0x4];                                 // 0x0(0x4)
};


// Size 0xc
struct Vector_NetQuantize10
{
public:
	char                                                         pad0xc_U7OT3[0xc];                                 // 0x0(0xc)
};


// Size 0x50
struct SimplygonRemeshingSettings
{
public:
	bool                                                         bActive;                                           // 0x0(0x1)
	char                                                         pad0x3_T9GPJ[0x3];                                 // 0x1(0x3)
	int                                                          ScreenSize;                                        // 0x4(0x4)
	bool                                                         bRecalculateNormals;                               // 0x8(0x1)
	char                                                         pad0x3_10UO5[0x3];                                 // 0x9(0x3)
	float                                                        HardAngleThreshold;                                // 0xc(0x4)
	int                                                          MergeDistance;                                     // 0x10(0x4)
	bool                                                         bUseClippingPlane;                                 // 0x14(0x1)
	char                                                         pad0x3_4E49B[0x3];                                 // 0x15(0x3)
	float                                                        ClippingLevel;                                     // 0x18(0x4)
	int                                                          AxisIndex;                                         // 0x1c(0x4)
	bool                                                         bPlaneNegativeHalfspace;                           // 0x20(0x1)
	bool                                                         bUseMassiveLOD;                                    // 0x21(0x1)
	bool                                                         bUseAggregateLOD;                                  // 0x22(0x1)
	char                                                         pad0x5_TBWJE[0x5];                                 // 0x23(0x5)
	struct SimplygonMaterialLODSettings                          MaterialLODSettings;                               // 0x28(0x28)
};


// Size 0x28
struct SimplygonMaterialLODSettings
{
public:
	bool                                                         bActive;                                           // 0x0(0x1)
	byte                                                         MaterialLODType;                                   // 0x1(0x1)
	bool                                                         bUseAutomaticSizes;                                // 0x2(0x1)
	byte                                                         TextureWidth;                                      // 0x3(0x1)
	byte                                                         TextureHeight;                                     // 0x4(0x1)
	byte                                                         SamplingQuality;                                   // 0x5(0x1)
	char                                                         pad0x2_WQQGN[0x2];                                 // 0x6(0x2)
	int                                                          GutterSpace;                                       // 0x8(0x4)
	byte                                                         TextureStrech;                                     // 0xc(0x1)
	bool                                                         bReuseExistingCharts;                              // 0xd(0x1)
	char                                                         pad0x2_25PVF[0x2];                                 // 0xe(0x2)
	TArray<struct SimplygonChannelCastingSettings>               ChannelsToCast;                                    // 0x10(0x10)
	bool                                                         bBakeVertexData;                                   // 0x20(0x1)
	bool                                                         bBakeActorData;                                    // 0x21(0x1)
	bool                                                         bAllowMultiMaterial;                               // 0x22(0x1)
	bool                                                         bPreferTwoSideMaterials;                           // 0x23(0x1)
	char                                                         pad0x4_HON0L[0x4];                                 // 0x24(0x4)
};


// Size 0x10
struct SimplygonChannelCastingSettings
{
public:
	byte                                                         MaterialChannel;                                   // 0x0(0x1)
	byte                                                         Caster;                                            // 0x1(0x1)
	bool                                                         bActive;                                           // 0x2(0x1)
	byte                                                         ColorChannels;                                     // 0x3(0x1)
	int                                                          BitsPerChannel;                                    // 0x4(0x4)
	bool                                                         bUseSRGB;                                          // 0x8(0x1)
	bool                                                         bBakeVertexColors;                                 // 0x9(0x1)
	bool                                                         bFlipBackfacingNormals;                            // 0xa(0x1)
	bool                                                         bUseTangentSpaceNormals;                           // 0xb(0x1)
	bool                                                         bFlipGreenChannel;                                 // 0xc(0x1)
	char                                                         pad0x3_SW4NZ[0x3];                                 // 0xd(0x3)
};


// Size 0x60
struct CanvasUVTri
{
public:
	struct Vector2D                                              V0_Pos;                                            // 0x0(0x8)
	struct Vector2D                                              V0_UV;                                             // 0x8(0x8)
	struct LinearColor                                           V0_Color;                                          // 0x10(0x10)
	struct Vector2D                                              V1_Pos;                                            // 0x20(0x8)
	struct Vector2D                                              V1_UV;                                             // 0x28(0x8)
	struct LinearColor                                           V1_Color;                                          // 0x30(0x10)
	struct Vector2D                                              V2_Pos;                                            // 0x40(0x8)
	struct Vector2D                                              V2_UV;                                             // 0x48(0x8)
	struct LinearColor                                           V2_Color;                                          // 0x50(0x10)
};


// Size 0x28
struct FontRenderInfo
{
public:
	bool                                                         bClipText;                                         // 0x0(0x1)
	bool                                                         bEnableShadow;                                     // 0x0(0x1)
	char                                                         pad0x3_813RF[0x3];                                 // 0x1(0x3)
	struct DepthFieldGlowInfo                                    GlowInfo;                                          // 0x4(0x24)
};


// Size 0x24
struct DepthFieldGlowInfo
{
public:
	bool                                                         bEnableGlow;                                       // 0x0(0x1)
	char                                                         pad0x3_555FP[0x3];                                 // 0x1(0x3)
	struct LinearColor                                           GlowColor;                                         // 0x4(0x10)
	struct Vector2D                                              GlowOuterRadius;                                   // 0x14(0x8)
	struct Vector2D                                              GlowInnerRadius;                                   // 0x1c(0x8)
};


// Size 0x10
struct Redirector
{
public:
	struct FName                                                 OldName;                                           // 0x0(0x8)
	struct FName                                                 NewName;                                           // 0x8(0x8)
};


// Size 0x10
struct FilePath
{
public:
	struct FString                                               FilePath;                                          // 0x0(0x10)
};


// Size 0x18
struct ComponentReference
{
public:
	class Actor*                                                 OtherActor;                                        // 0x0(0x8)
	struct FName                                                 ComponentProperty;                                 // 0x8(0x8)
	char                                                         pad0x8_80XKH[0x8];                                 // 0x10(0x8)
};


// Size 0x8
struct ConstrainComponentPropName
{
public:
	struct FName                                                 ComponentName;                                     // 0x0(0x8)
};


// Size 0x40
struct RadialDamageEvent
{
public:
	char                                                         pad0x10_MQLXO[0x10];                               // 0x0(0x10)
	struct RadialDamageParams                                    Params;                                            // 0x10(0x14)
	struct Vector                                                Origin;                                            // 0x24(0xc)
	TArray<struct HitResult>                                     ComponentHits;                                     // 0x30(0x10)
};


// Size 0x10
struct DamageEvent
{
public:
	char                                                         pad0x8_WS9TP[0x8];                                 // 0x0(0x8)
	class UClass*                                                DamageTypeClass;                                   // 0x8(0x8)
};


// Size 0x14
struct RadialDamageParams
{
public:
	float                                                        BaseDamage;                                        // 0x0(0x4)
	float                                                        MinimumDamage;                                     // 0x4(0x4)
	float                                                        InnerRadius;                                       // 0x8(0x4)
	float                                                        OuterRadius;                                       // 0xc(0x4)
	float                                                        DamageFalloff;                                     // 0x10(0x4)
};


// Size 0xa0
struct PointDamageEvent
{
public:
	char                                                         pad0x10_8NUQQ[0x10];                               // 0x0(0x10)
	float                                                        Damage;                                            // 0x10(0x4)
	struct Vector_NetQuantizeNormal                              ShotDirection;                                     // 0x14(0xc)
	struct HitResult                                             HitInfo;                                           // 0x20(0x80)
};


// Size 0x1
struct CollisionMergingSettings
{
public:
	char                                                         pad0x1_3G0UD[0x1];                                 // 0x0(0x1)
};


// Size 0x50
struct MeshMergingSettings
{
public:
	bool                                                         bGenerateLightMapUV;                               // 0x0(0x1)
	char                                                         pad0x3_ZMQDN[0x3];                                 // 0x1(0x3)
	int                                                          TargetLightMapUVChannel;                           // 0x4(0x4)
	int                                                          TargetLightMapResolution;                          // 0x8(0x4)
	bool                                                         bImportVertexColors;                               // 0xc(0x1)
	bool                                                         bPivotPointAtZero;                                 // 0xd(0x1)
	bool                                                         bMergePhysicsData;                                 // 0xe(0x1)
	bool                                                         bMergeMaterials;                                   // 0xf(0x1)
	bool                                                         bExportNormalMap;                                  // 0x10(0x1)
	bool                                                         bExportMetallicMap;                                // 0x11(0x1)
	bool                                                         bExportRoughnessMap;                               // 0x12(0x1)
	bool                                                         bExportSpecularMap;                                // 0x13(0x1)
	int                                                          MergedMaterialAtlasResolution;                     // 0x14(0x4)
	bool                                                         bEnableCollisionMerging;                           // 0x18(0x1)
	bool                                                         bUseRelativeTransform;                             // 0x19(0x1)
	bool                                                         bMergeRelativeToFirstComponent;                    // 0x1a(0x1)
	bool                                                         bDuplicateLODs;                                    // 0x1b(0x1)
	char                                                         pad0x4_GW756[0x4];                                 // 0x1c(0x4)
	TArray<Float LODScreenSizes>                                 LODScreenSizes;                                    // 0x20(0x10)
	int                                                          LODForCollision;                                   // 0x30(0x4)
	char                                                         pad0x4_NE1US[0x4];                                 // 0x34(0x4)
	TArray<Float LODReductionPercentTriangles>                   LODReductionPercentTriangles;                      // 0x38(0x10)
	int                                                          MaxNumberOfLODs;                                   // 0x48(0x4)
	char                                                         pad0x4_HN1Q7[0x4];                                 // 0x4c(0x4)
};


// Size 0x70
struct MeshProxySettings
{
public:
	int                                                          ScreenSize;                                        // 0x0(0x4)
	struct MaterialSimplificationSettings                        Material;                                          // 0x4(0x44)
	int                                                          TextureWidth;                                      // 0x48(0x4)
	int                                                          TextureHeight;                                     // 0x4c(0x4)
	bool                                                         bExportNormalMap;                                  // 0x50(0x1)
	bool                                                         bExportMetallicMap;                                // 0x51(0x1)
	bool                                                         bExportRoughnessMap;                               // 0x52(0x1)
	bool                                                         bExportSpecularMap;                                // 0x53(0x1)
	bool                                                         bRecalculateNormals;                               // 0x54(0x1)
	char                                                         pad0x3_GYWWJ[0x3];                                 // 0x55(0x3)
	float                                                        HardAngleThreshold;                                // 0x58(0x4)
	int                                                          MergeDistance;                                     // 0x5c(0x4)
	bool                                                         bUseClippingPlane;                                 // 0x60(0x1)
	char                                                         pad0x3_USF2V[0x3];                                 // 0x61(0x3)
	float                                                        ClippingLevel;                                     // 0x64(0x4)
	int                                                          AxisIndex;                                         // 0x68(0x4)
	bool                                                         bPlaneNegativeHalfspace;                           // 0x6c(0x1)
	char                                                         pad0x3_EHQK6[0x3];                                 // 0x6d(0x3)
};


// Size 0x44
struct MaterialSimplificationSettings
{
public:
	struct IntPoint                                              BaseColorMapSize;                                  // 0x0(0x8)
	bool                                                         bNormalMap;                                        // 0x8(0x1)
	char                                                         pad0x3_67MX3[0x3];                                 // 0x9(0x3)
	struct IntPoint                                              NormalMapSize;                                     // 0xc(0x8)
	float                                                        MetallicConstant;                                  // 0x14(0x4)
	bool                                                         bMetallicMap;                                      // 0x18(0x1)
	char                                                         pad0x3_ZJR8J[0x3];                                 // 0x19(0x3)
	struct IntPoint                                              MetallicMapSize;                                   // 0x1c(0x8)
	float                                                        RoughnessConstant;                                 // 0x24(0x4)
	bool                                                         bRoughnessMap;                                     // 0x28(0x1)
	char                                                         pad0x3_ZS04T[0x3];                                 // 0x29(0x3)
	struct IntPoint                                              RoughnessMapSize;                                  // 0x2c(0x8)
	float                                                        SpecularConstant;                                  // 0x34(0x4)
	bool                                                         bSpecularMap;                                      // 0x38(0x1)
	char                                                         pad0x3_TYQAK[0x3];                                 // 0x39(0x3)
	struct IntPoint                                              SpecularMapSize;                                   // 0x3c(0x8)
};


// Size 0x40
struct MeshBuildSettings
{
public:
	bool                                                         bUseMikkTSpace;                                    // 0x0(0x1)
	bool                                                         bRecomputeNormals;                                 // 0x1(0x1)
	bool                                                         bRecomputeTangents;                                // 0x2(0x1)
	bool                                                         bRemoveDegenerates;                                // 0x3(0x1)
	bool                                                         bBuildAdjacencyBuffer;                             // 0x4(0x1)
	bool                                                         bUseFullPrecisionUVs;                              // 0x5(0x1)
	bool                                                         bGenerateLightmapUVs;                              // 0x6(0x1)
	char                                                         pad0x1_0FPUW[0x1];                                 // 0x7(0x1)
	struct PresortedBillboardsParams                             PresortedBillboardsParams;                         // 0x8(0x8)
	int                                                          MinLightmapResolution;                             // 0x10(0x4)
	int                                                          SrcLightmapIndex;                                  // 0x14(0x4)
	int                                                          DstLightmapIndex;                                  // 0x18(0x4)
	float                                                        BuildScale;                                        // 0x1c(0x4)
	struct Vector                                                BuildScale3D;                                      // 0x20(0xc)
	float                                                        DistanceFieldResolutionScale;                      // 0x2c(0x4)
	bool                                                         bGenerateDistanceFieldAsIfTwoSided;                // 0x30(0x1)
	char                                                         pad0x7_G0MUL[0x7];                                 // 0x31(0x7)
	class StaticMesh*                                            DistanceFieldReplacementMesh;                      // 0x38(0x8)
};


// Size 0x8
struct PresortedBillboardsParams
{
public:
	byte                                                         Mode;                                              // 0x0(0x1)
	char                                                         pad0x3_IXHRY[0x3];                                 // 0x1(0x3)
	int                                                          NumDirections;                                     // 0x4(0x4)
};


// Size 0x58
struct MeshReductionSettings
{
public:
	float                                                        PercentTriangles;                                  // 0x0(0x4)
	float                                                        MaxDeviation;                                      // 0x4(0x4)
	float                                                        WeldingThreshold;                                  // 0x8(0x4)
	float                                                        HardAngleThreshold;                                // 0xc(0x4)
	byte                                                         SilhouetteImportance;                              // 0x10(0x1)
	byte                                                         TextureImportance;                                 // 0x11(0x1)
	byte                                                         ShadingImportance;                                 // 0x12(0x1)
	bool                                                         bActive;                                           // 0x13(0x1)
	bool                                                         bRecalculateNormals;                               // 0x14(0x1)
	char                                                         pad0x3_18W9F[0x3];                                 // 0x15(0x3)
	int                                                          BaseLODModel;                                      // 0x18(0x4)
	bool                                                         bGenerateUniqueLightmapUVs;                        // 0x1c(0x1)
	bool                                                         bKeepSymmetry;                                     // 0x1d(0x1)
	bool                                                         bVisibilityAided;                                  // 0x1e(0x1)
	bool                                                         bCullOccluded;                                     // 0x1f(0x1)
	byte                                                         VisibilityAggressiveness;                          // 0x20(0x1)
	char                                                         pad0x7_Z0U61[0x7];                                 // 0x21(0x7)
	struct SimplygonMaterialLODSettings                          MaterialLODSettings;                               // 0x28(0x28)
	byte                                                         VertexColorImportance;                             // 0x50(0x1)
	bool                                                         bForceRebuild;                                     // 0x51(0x1)
	char                                                         pad0x6_O1VCJ[0x6];                                 // 0x52(0x6)
};


// Size 0x1c
struct POV
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	struct Rotator                                               Rotation;                                          // 0xc(0xc)
	float                                                        FOV;                                               // 0x18(0x4)
};


// Size 0x38
struct AnimUpdateRateParameters
{
public:
	char                                                         pad0x4_VY01H[0x4];                                 // 0x0(0x4)
	int                                                          UpdateRate;                                        // 0x4(0x4)
	int                                                          EvaluationRate;                                    // 0x8(0x4)
	bool                                                         bInterpolateSkippedFrames;                         // 0xc(0x1)
	bool                                                         bSkipUpdate;                                       // 0xd(0x1)
	bool                                                         bSkipEvaluation;                                   // 0xe(0x1)
	char                                                         pad0x1_V9XBZ[0x1];                                 // 0xf(0x1)
	float                                                        TickedPoseOffestTime;                              // 0x10(0x4)
	float                                                        AdditionalTime;                                    // 0x14(0x4)
	char                                                         pad0x4_0X2U9[0x4];                                 // 0x18(0x4)
	int                                                          BaseNonRenderedUpdateRate;                         // 0x1c(0x4)
	char                                                         pad0x8_PJ5SB[0x8];                                 // 0x20(0x8)
	TArray<Float BaseVisibleDistanceFactorThesholds>             BaseVisibleDistanceFactorThesholds;                // 0x28(0x10)
};


// Size 0xc
struct AnimSlotDesc
{
public:
	struct FName                                                 SlotName;                                          // 0x0(0x8)
	int                                                          NumChannels;                                       // 0x8(0x4)
};


// Size 0x18
struct AnimSlotInfo
{
public:
	struct FName                                                 SlotName;                                          // 0x0(0x8)
	TArray<Float ChannelWeights>                                 ChannelWeights;                                    // 0x8(0x10)
};


// Size 0x10
struct MTDResult
{
public:
	struct Vector                                                Direction;                                         // 0x0(0xc)
	float                                                        Distance;                                          // 0xc(0x4)
};


// Size 0x18
struct OverlapResult
{
public:
	char                                                         pad0x14_ZU40I[0x14];                               // 0x0(0x14)
	bool                                                         bBlockingHit;                                      // 0x14(0x1)
	char                                                         pad0x3_8EEO6[0x3];                                 // 0x15(0x3)
};


// Size 0x18
struct PrimitiveMaterialRef
{
public:
	class PrimitiveComponent*                                    Primitive;                                         // 0x0(0x8)
	class DecalComponent*                                        Decal;                                             // 0x8(0x8)
	int                                                          ElementIndex;                                      // 0x10(0x4)
	char                                                         pad0x4_EOFUE[0x4];                                 // 0x14(0x4)
};


// Size 0x4
struct SwarmDebugOptions
{
public:
	bool                                                         bDistributionEnabled;                              // 0x0(0x1)
	bool                                                         bForceContentExport;                               // 0x0(0x1)
	bool                                                         bInitialized;                                      // 0x0(0x1)
	char                                                         pad0x3_A4RAK[0x3];                                 // 0x1(0x3)
};


// Size 0x10
struct LightmassDebugOptions
{
public:
	bool                                                         bDebugMode;                                        // 0x0(0x1)
	bool                                                         bStatsEnabled;                                     // 0x0(0x1)
	bool                                                         bGatherBSPSurfacesAcrossComponents;                // 0x0(0x1)
	char                                                         pad0x3_I8PYL[0x3];                                 // 0x1(0x3)
	float                                                        CoplanarTolerance;                                 // 0x4(0x4)
	bool                                                         bUseImmediateImport;                               // 0x8(0x1)
	bool                                                         bImmediateProcessMappings;                         // 0x8(0x1)
	bool                                                         bSortMappings;                                     // 0x8(0x1)
	bool                                                         bDumpBinaryFiles;                                  // 0x8(0x1)
	bool                                                         bDebugMaterials;                                   // 0x8(0x1)
	bool                                                         bPadMappings;                                      // 0x8(0x1)
	bool                                                         bDebugPaddings;                                    // 0x8(0x1)
	bool                                                         bOnlyCalcDebugTexelMappings;                       // 0x8(0x1)
	bool                                                         bUseRandomColors;                                  // 0x9(0x1)
	bool                                                         bColorBordersGreen;                                // 0x9(0x1)
	bool                                                         bColorByExecutionTime;                             // 0x9(0x1)
	char                                                         pad0x2_B6IGM[0x2];                                 // 0xa(0x2)
	float                                                        ExecutionTimeDivisor;                              // 0xc(0x4)
};


// Size 0x18
struct LightmassPrimitiveSettings
{
public:
	bool                                                         bUseTwoSidedLighting;                              // 0x0(0x1)
	bool                                                         bShadowIndirectOnly;                               // 0x0(0x1)
	bool                                                         bUseEmissiveForStaticLighting;                     // 0x0(0x1)
	bool                                                         bUseVertexNormalForHemisphereGather;               // 0x0(0x1)
	char                                                         pad0x3_OMQ70[0x3];                                 // 0x1(0x3)
	float                                                        EmissiveLightFalloffExponent;                      // 0x4(0x4)
	float                                                        EmissiveLightExplicitInfluenceRadius;              // 0x8(0x4)
	float                                                        EmissiveBoost;                                     // 0xc(0x4)
	float                                                        DiffuseBoost;                                      // 0x10(0x4)
	float                                                        FullyOccludedSamplesFraction;                      // 0x14(0x4)
};


// Size 0x10
struct LightmassDirectionalLightSettings
{
public:
	char                                                         pad0xc_JN22O[0xc];                                 // 0x0(0xc)
	float                                                        LightSourceAngle;                                  // 0xc(0x4)
};


// Size 0xc
struct LightmassLightSettings
{
public:
	float                                                        IndirectLightingSaturation;                        // 0x0(0x4)
	float                                                        ShadowExponent;                                    // 0x4(0x4)
	bool                                                         bUseAreaShadowsForStationaryLight;                 // 0x8(0x1)
	char                                                         pad0x3_HWPDD[0x3];                                 // 0x9(0x3)
};


// Size 0xc
struct LightmassPointLightSettings
{
public:
	char                                                         pad0xc_UAI5Q[0xc];                                 // 0x0(0xc)
};


// Size 0x28
struct LocalizedSubtitle
{
public:
	struct FString                                               LanguageExt;                                       // 0x0(0x10)
	TArray<struct SubtitleCue>                                   Subtitles;                                         // 0x10(0x10)
	bool                                                         bMature;                                           // 0x20(0x1)
	bool                                                         bManualWordWrap;                                   // 0x20(0x1)
	bool                                                         bSingleLine;                                       // 0x20(0x1)
	char                                                         pad0x7_X8WIA[0x7];                                 // 0x21(0x7)
};


// Size 0x38
struct BasedPosition
{
public:
	class Actor*                                                 Base;                                              // 0x0(0x8)
	struct Vector                                                Position;                                          // 0x8(0xc)
	struct Vector                                                CachedBaseLocation;                                // 0x14(0xc)
	struct Rotator                                               CachedBaseRotation;                                // 0x20(0xc)
	struct Vector                                                CachedTransPosition;                               // 0x2c(0xc)
};


// Size 0x10
struct FractureEffect
{
public:
	class ParticleSystem*                                        ParticleSystem;                                    // 0x0(0x8)
	class SoundBase*                                             Sound;                                             // 0x8(0x8)
};


// Size 0x28
struct CollisionImpactData
{
public:
	TArray<struct RigidBodyContactInfo>                          ContactInfos;                                      // 0x0(0x10)
	struct Vector                                                TotalNormalImpulse;                                // 0x10(0xc)
	struct Vector                                                TotalFrictionImpulse;                              // 0x1c(0xc)
};


// Size 0x30
struct RigidBodyContactInfo
{
public:
	struct Vector                                                ContactPosition;                                   // 0x0(0xc)
	struct Vector                                                ContactNormal;                                     // 0xc(0xc)
	float                                                        ContactPenetration;                                // 0x18(0x4)
	char                                                         pad0x4_5L5SS[0x4];                                 // 0x1c(0x4)
	class PhysicalMaterial*                                      PhysMaterial;                                      // 0x20(0x8)
	char                                                         pad0x8_BUKMG[0x8];                                 // 0x28(0x8)
};


// Size 0x1c
struct RigidBodyErrorCorrection
{
public:
	float                                                        LinearDeltaThresholdSq;                            // 0x0(0x4)
	float                                                        LinearInterpAlpha;                                 // 0x4(0x4)
	float                                                        LinearRecipFixTime;                                // 0x8(0x4)
	float                                                        AngularDeltaThreshold;                             // 0xc(0x4)
	float                                                        AngularInterpAlpha;                                // 0x10(0x4)
	float                                                        AngularRecipFixTime;                               // 0x14(0x4)
	float                                                        BodySpeedThresholdSq;                              // 0x18(0x4)
};


// Size 0x40
struct RigidBodyState
{
public:
	struct Vector_NetQuantize100                                 Position;                                          // 0x0(0xc)
	char                                                         pad0x4_SRWH9[0x4];                                 // 0xc(0x4)
	struct Quat                                                  Quaternion;                                        // 0x10(0x10)
	struct Vector_NetQuantize100                                 LinVel;                                            // 0x20(0xc)
	struct Vector_NetQuantize100                                 AngVel;                                            // 0x2c(0xc)
	byte                                                         Flags;                                             // 0x38(0x1)
	char                                                         pad0x7_QJZLJ[0x7];                                 // 0x39(0x7)
};


// Size 0x18
struct EditedDocumentInfo
{
public:
	class Object*                                                EditedObject;                                      // 0x0(0x8)
	struct Vector2D                                              SavedViewOffset;                                   // 0x8(0x8)
	float                                                        SavedZoomAmount;                                   // 0x10(0x4)
	char                                                         pad0x4_7NL6T[0x4];                                 // 0x14(0x4)
};


// Size 0x18
struct BPInterfaceDescription
{
public:
	class UClass*                                                Interface;                                         // 0x0(0x8)
	TArray<class EdGraph*>                                       Graphs;                                            // 0x8(0x10)
};


// Size 0xe0
struct BPVariableDescription
{
public:
	struct FName                                                 VarName;                                           // 0x0(0x8)
	struct Guid                                                  VarGuid;                                           // 0x8(0x10)
	struct EdGraphPinType                                        VarType;                                           // 0x18(0x50)
	struct FString                                               FriendlyName;                                      // 0x68(0x10)
	struct FText                                                 Category;                                          // 0x78(0x38)
	struct FName                                                 RepNotifyFunc;                                     // 0xb8(0x8)
	TArray<struct BPVariableMetaDataEntry>                       MetaDataArray;                                     // 0xc0(0x10)
	struct FString                                               DefaultValue;                                      // 0xd0(0x10)
};


// Size 0x18
struct BPVariableMetaDataEntry
{
public:
	struct FName                                                 DataKey;                                           // 0x0(0x8)
	struct FString                                               DataValue;                                         // 0x8(0x10)
};


// Size 0x38
struct MemberReference
{
public:
	class Object*                                                MemberParent;                                      // 0x0(0x8)
	struct FString                                               MemberScope;                                       // 0x8(0x10)
	struct FName                                                 MemberName;                                        // 0x18(0x8)
	struct Guid                                                  MemberGuid;                                        // 0x20(0x10)
	bool                                                         bSelfContext;                                      // 0x30(0x1)
	bool                                                         bWasDeprecated;                                    // 0x31(0x1)
	char                                                         pad0x6_ILQWJ[0x6];                                 // 0x32(0x6)
};


// Size 0x10
struct AutomaticInstancingMeshComponentArray
{
public:
	TArray<class InstancedStaticMeshComponent*>                  Array;                                             // 0x0(0x10)
};


// Size 0xf0
struct LatentActionManager
{
public:
	char                                                         pad0xf0_5027Y[0xf0];                               // 0x0(0xf0)
};


// Size 0x50
struct EndClothSimulationFunction
{
public:
	char                                                         pad0x50_3F18S[0x50];                               // 0x0(0x50)
};


// Size 0x50
struct StartClothSimulationFunction
{
public:
	char                                                         pad0x50_S21HC[0x50];                               // 0x0(0x50)
};


// Size 0x50
struct EndPhysicsTickFunction
{
public:
	char                                                         pad0x50_ZTV9S[0x50];                               // 0x0(0x50)
};


// Size 0x50
struct StartPhysicsTickFunction
{
public:
	char                                                         pad0x50_6SLVP[0x50];                               // 0x0(0x50)
};


// Size 0x20
struct LevelViewportInfo
{
public:
	struct Vector                                                CamPosition;                                       // 0x0(0xc)
	struct Rotator                                               CamRotation;                                       // 0xc(0xc)
	float                                                        CamOrthoZoom;                                      // 0x18(0x4)
	bool                                                         CamUpdated;                                        // 0x1c(0x1)
	char                                                         pad0x3_YJKWY[0x3];                                 // 0x1d(0x3)
};


// Size 0xac
struct LevelSimplificationDetails
{
public:
	bool                                                         bCreatePackagePerAsset;                            // 0x0(0x1)
	char                                                         pad0x3_SW9KI[0x3];                                 // 0x1(0x3)
	float                                                        ProxyPixelSize;                                    // 0x4(0x4)
	struct MaterialSimplificationSettings                        StaticMeshMaterial;                                // 0x8(0x44)
	bool                                                         bOverrideLandscapeExportLOD;                       // 0x4c(0x1)
	char                                                         pad0x3_RHMYW[0x3];                                 // 0x4d(0x3)
	int                                                          LandscapeExportLOD;                                // 0x50(0x4)
	struct MaterialSimplificationSettings                        LandscapeMaterial;                                 // 0x54(0x44)
	bool                                                         bRemoveDownwardFacingTriangles;                    // 0x98(0x1)
	char                                                         pad0x3_MNYNC[0x3];                                 // 0x99(0x3)
	float                                                        CullAngleThreshold;                                // 0x9c(0x4)
	bool                                                         bBakeFoliageToLandscape;                           // 0xa0(0x1)
	bool                                                         bBakeGrassToLandscape;                             // 0xa1(0x1)
	bool                                                         bGenerateMeshNormalMap;                            // 0xa2(0x1)
	bool                                                         bGenerateMeshMetallicMap;                          // 0xa3(0x1)
	bool                                                         bGenerateMeshRoughnessMap;                         // 0xa4(0x1)
	bool                                                         bGenerateMeshSpecularMap;                          // 0xa5(0x1)
	bool                                                         bGenerateLandscapeNormalMap;                       // 0xa6(0x1)
	bool                                                         bGenerateLandscapeMetallicMap;                     // 0xa7(0x1)
	bool                                                         bGenerateLandscapeRoughnessMap;                    // 0xa8(0x1)
	bool                                                         bGenerateLandscapeSpecularMap;                     // 0xa9(0x1)
	char                                                         pad0x2_5LBNM[0x2];                                 // 0xaa(0x2)
};


// Size 0x28
struct DynamicTextureInstance
{
public:
	char                                                         pad0x18_HIFQP[0x18];                               // 0x0(0x18)
	class Texture2D*                                             Texture;                                           // 0x18(0x8)
	bool                                                         bAttached;                                         // 0x20(0x1)
	char                                                         pad0x3_NKTM0[0x3];                                 // 0x21(0x3)
	float                                                        OriginalRadius;                                    // 0x24(0x4)
};


// Size 0x14
struct StreamableTextureInstance
{
public:
	char                                                         pad0x14_SQ614[0x14];                               // 0x0(0x14)
};


// Size 0xc
struct GeomSelection
{
public:
	int                                                          Type;                                              // 0x0(0x4)
	int                                                          Index;                                             // 0x4(0x4)
	int                                                          SelectionIndex;                                    // 0x8(0x4)
};


// Size 0x24
struct InteriorSettings
{
public:
	bool                                                         bIsWorldSettings;                                  // 0x0(0x1)
	char                                                         pad0x3_6DZVW[0x3];                                 // 0x1(0x3)
	float                                                        ExteriorVolume;                                    // 0x4(0x4)
	float                                                        ExteriorTime;                                      // 0x8(0x4)
	float                                                        ExteriorLPF;                                       // 0xc(0x4)
	float                                                        ExteriorLPFTime;                                   // 0x10(0x4)
	float                                                        InteriorVolume;                                    // 0x14(0x4)
	float                                                        InteriorTime;                                      // 0x18(0x4)
	float                                                        InteriorLPF;                                       // 0x1c(0x4)
	float                                                        InteriorLPFTime;                                   // 0x20(0x4)
};


// Size 0x18
struct ReverbSettings
{
public:
	bool                                                         bApplyReverb;                                      // 0x0(0x1)
	char                                                         pad0x3_MGJQ6[0x3];                                 // 0x1(0x3)
	byte                                                         ReverbType;                                        // 0x4(0x1)
	char                                                         pad0x3_KWPI8[0x3];                                 // 0x5(0x3)
	class ReverbEffect*                                          ReverbEffect;                                      // 0x8(0x8)
	float                                                        Volume;                                            // 0x10(0x4)
	float                                                        FadeTime;                                          // 0x14(0x4)
};


// Size 0x8
struct CullDistanceSizePair
{
public:
	float                                                        Size;                                              // 0x0(0x4)
	float                                                        CullDistance;                                      // 0x4(0x4)
};


// Size 0x58
struct NavDataConfig
{
public:
	char                                                         pad0x30_CGZKN[0x30];                               // 0x0(0x30)
	struct Color                                                 Color;                                             // 0x30(0x4)
	struct Vector                                                DefaultQueryExtent;                                // 0x34(0xc)
	class UClass*                                                NavigationDataClass;                               // 0x40(0x8)
	struct StringClassReference                                  NavigationDataClassName;                           // 0x48(0x10)
};


// Size 0x30
struct NavAgentProperties
{
public:
	char                                                         pad0x4_T9Z2S[0x4];                                 // 0x0(0x4)
	struct FName                                                 Name;                                              // 0x4(0x8)
	float                                                        AgentRadius;                                       // 0xc(0x4)
	float                                                        AgentHeight;                                       // 0x10(0x4)
	float                                                        AgentStepHeight;                                   // 0x14(0x4)
	float                                                        NavWalkingSearchHeightScale;                       // 0x18(0x4)
	float                                                        NavWalkingSearchRadiusScale;                       // 0x1c(0x4)
	float                                                        NavWalkingSearchRadiusScaleOffMesh;                // 0x20(0x4)
	float                                                        AgentMaxSlope;                                     // 0x24(0x4)
	float                                                        MinRegionArea;                                     // 0x28(0x4)
	char                                                         pad0x4_5RUT8[0x4];                                 // 0x2c(0x4)
};


// Size 0x4
struct MovementProperties
{
public:
	bool                                                         bCanCrouch;                                        // 0x0(0x1)
	bool                                                         bCanJump;                                          // 0x0(0x1)
	bool                                                         bCanWalk;                                          // 0x0(0x1)
	bool                                                         bCanSwim;                                          // 0x0(0x1)
	bool                                                         bCanFly;                                           // 0x0(0x1)
	char                                                         pad0x3_ESRCF[0x3];                                 // 0x1(0x3)
};


// Size 0x4
struct NavAgentSelector
{
public:
	bool                                                         bSupportsAgent0;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent1;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent2;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent3;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent4;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent5;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent6;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent7;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent8;                                   // 0x1(0x1)
	bool                                                         bSupportsAgent9;                                   // 0x1(0x1)
	bool                                                         bSupportsAgent10;                                  // 0x1(0x1)
	bool                                                         bSupportsAgent11;                                  // 0x1(0x1)
	bool                                                         bSupportsAgent12;                                  // 0x1(0x1)
	bool                                                         bSupportsAgent13;                                  // 0x1(0x1)
	bool                                                         bSupportsAgent14;                                  // 0x1(0x1)
	bool                                                         bSupportsAgent15;                                  // 0x1(0x1)
	char                                                         pad0x2_QMJFW[0x2];                                 // 0x2(0x2)
};


// Size 0x18
struct PlayerAmbientLightOverrideSettings
{
public:
	bool                                                         OverrideBodyLightAmbience;                         // 0x0(0x1)
	char                                                         pad0x3_6BGFZ[0x3];                                 // 0x1(0x3)
	float                                                        BodyLightAmbienceLightFactor;                      // 0x4(0x4)
	float                                                        BodyLightAmbienceBlendWithDefault;                 // 0x8(0x4)
	bool                                                         OverrideLanternAmbience;                           // 0xc(0x1)
	char                                                         pad0x3_V9FT4[0x3];                                 // 0xd(0x3)
	float                                                        LanternAmbienceLightFactor;                        // 0x10(0x4)
	float                                                        LanternAmbienceBlendWithDefault;                   // 0x14(0x4)
};


// Size 0x540
struct PostProcessSettings
{
public:
	bool                                                         bOverride_WhiteTemp;                               // 0x0(0x1)
	bool                                                         bOverride_WhiteTint;                               // 0x0(0x1)
	bool                                                         bOverride_ColorSaturation;                         // 0x0(0x1)
	bool                                                         bOverride_ColorContrast;                           // 0x0(0x1)
	bool                                                         bOverride_ColorGamma;                              // 0x0(0x1)
	bool                                                         bOverride_ColorGain;                               // 0x0(0x1)
	bool                                                         bOverride_ColorOffset;                             // 0x0(0x1)
	bool                                                         bOverride_FilmWhitePoint;                          // 0x0(0x1)
	bool                                                         bOverride_FilmSaturation;                          // 0x1(0x1)
	bool                                                         bOverride_FilmChannelMixerRed;                     // 0x1(0x1)
	bool                                                         bOverride_FilmChannelMixerGreen;                   // 0x1(0x1)
	bool                                                         bOverride_FilmChannelMixerBlue;                    // 0x1(0x1)
	bool                                                         bOverride_FilmContrast;                            // 0x1(0x1)
	bool                                                         bOverride_FilmDynamicRange;                        // 0x1(0x1)
	bool                                                         bOverride_FilmHealAmount;                          // 0x1(0x1)
	bool                                                         bOverride_FilmToeAmount;                           // 0x1(0x1)
	bool                                                         bOverride_FilmShadowTint;                          // 0x2(0x1)
	bool                                                         bOverride_FilmShadowTintBlend;                     // 0x2(0x1)
	bool                                                         bOverride_FilmShadowTintAmount;                    // 0x2(0x1)
	bool                                                         bOverride_FilmSlope;                               // 0x2(0x1)
	bool                                                         bOverride_FilmToe;                                 // 0x2(0x1)
	bool                                                         bOverride_FilmShoulder;                            // 0x2(0x1)
	bool                                                         bOverride_FilmBlackClip;                           // 0x2(0x1)
	bool                                                         bOverride_FilmWhiteClip;                           // 0x2(0x1)
	bool                                                         bOverride_SceneColorTint;                          // 0x3(0x1)
	bool                                                         bOverride_SceneFringeIntensity;                    // 0x3(0x1)
	bool                                                         bOverride_SceneFringeSaturation;                   // 0x3(0x1)
	bool                                                         bOverride_AmbientCubemapTint;                      // 0x3(0x1)
	bool                                                         bOverride_AmbientCubemapIntensity;                 // 0x3(0x1)
	bool                                                         bOverride_BloomIntensity;                          // 0x3(0x1)
	bool                                                         bOverride_BloomThreshold;                          // 0x3(0x1)
	bool                                                         bOverride_Bloom1Tint;                              // 0x3(0x1)
	bool                                                         bOverride_Bloom1Size;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom2Size;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom2Tint;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom3Tint;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom3Size;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom4Tint;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom4Size;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom5Tint;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom5Size;                              // 0x5(0x1)
	bool                                                         bOverride_Bloom6Tint;                              // 0x5(0x1)
	bool                                                         bOverride_Bloom6Size;                              // 0x5(0x1)
	bool                                                         bOverride_BloomSizeScale;                          // 0x5(0x1)
	bool                                                         bOverride_BloomDirtMaskIntensity;                  // 0x5(0x1)
	bool                                                         bOverride_BloomDirtMaskTint;                       // 0x5(0x1)
	bool                                                         bOverride_BloomDirtMask;                           // 0x5(0x1)
	bool                                                         bOverride_AutoExposureLowPercent;                  // 0x5(0x1)
	bool                                                         bOverride_AutoExposureHighPercent;                 // 0x6(0x1)
	bool                                                         bOverride_AutoExposureMinBrightness;               // 0x6(0x1)
	bool                                                         bOverride_AutoExposureMaxBrightness;               // 0x6(0x1)
	bool                                                         bOverride_AutoExposureSpeedUp;                     // 0x6(0x1)
	bool                                                         bOverride_AutoExposureSpeedDown;                   // 0x6(0x1)
	bool                                                         bOverride_AutoExposureBias;                        // 0x6(0x1)
	bool                                                         bOverride_HistogramLogMin;                         // 0x6(0x1)
	bool                                                         bOverride_HistogramLogMax;                         // 0x6(0x1)
	bool                                                         bOverride_LensFlareIntensity;                      // 0x7(0x1)
	bool                                                         bOverride_LensFlareTint;                           // 0x7(0x1)
	bool                                                         bOverride_LensFlareTints;                          // 0x7(0x1)
	bool                                                         bOverride_LensFlareBokehSize;                      // 0x7(0x1)
	bool                                                         bOverride_LensFlareBokehShape;                     // 0x7(0x1)
	bool                                                         bOverride_LensFlareThreshold;                      // 0x7(0x1)
	bool                                                         bOverride_VignetteIntensity;                       // 0x7(0x1)
	bool                                                         bOverride_GrainIntensity;                          // 0x7(0x1)
	bool                                                         bOverride_GrainJitter;                             // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionIntensity;               // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionStaticFraction;          // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionRadius;                  // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionFadeDistance;            // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionFadeRadius;              // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionDistance;                // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionRadiusInWS;              // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionPower;                   // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionBias;                    // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionQuality;                 // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionMipBlend;                // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionMipScale;                // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionMipThreshold;            // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiIntensity;           // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiPower;               // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiRadius;              // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiBlurTolerance;       // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiUpsampleTolerance;   // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiNoiseFilterTolerance; // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiRejectionFalloff;    // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiBias;                // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiMaxDepthDownsample;  // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiUseNormals;          // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiCombineBeforeBlur;   // 0xb(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiCombineWithMultiply; // 0xb(0x1)
	bool                                                         bOverride_MinOverdrawCount;                        // 0xb(0x1)
	bool                                                         bOverride_MaxOverdrawCount;                        // 0xb(0x1)
	bool                                                         bOverride_MinOverdrawColour;                       // 0xb(0x1)
	bool                                                         bOverride_MaxOverdrawColour;                       // 0xb(0x1)
	bool                                                         bOverride_LPVIntensity;                            // 0xb(0x1)
	bool                                                         bOverride_LPVDirectionalOcclusionIntensity;        // 0xb(0x1)
	bool                                                         bOverride_LPVDirectionalOcclusionRadius;           // 0xc(0x1)
	bool                                                         bOverride_LPVDiffuseOcclusionExponent;             // 0xc(0x1)
	bool                                                         bOverride_LPVSpecularOcclusionExponent;            // 0xc(0x1)
	bool                                                         bOverride_LPVDiffuseOcclusionIntensity;            // 0xc(0x1)
	bool                                                         bOverride_LPVSpecularOcclusionIntensity;           // 0xc(0x1)
	bool                                                         bOverride_LPVSize;                                 // 0xc(0x1)
	bool                                                         bOverride_LPVSecondaryOcclusionIntensity;          // 0xc(0x1)
	bool                                                         bOverride_LPVSecondaryBounceIntensity;             // 0xc(0x1)
	bool                                                         bOverride_LPVGeometryVolumeBias;                   // 0xd(0x1)
	bool                                                         bOverride_LPVVplInjectionBias;                     // 0xd(0x1)
	bool                                                         bOverride_LPVEmissiveInjectionIntensity;           // 0xd(0x1)
	bool                                                         bOverride_LPVWorldRef;                             // 0xd(0x1)
	bool                                                         bOverride_IndirectLightingColor;                   // 0xd(0x1)
	bool                                                         bOverride_IndirectLightingIntensity;               // 0xd(0x1)
	bool                                                         bOverride_ColorGradingIntensity;                   // 0xd(0x1)
	bool                                                         bOverride_ColorGradingLUT;                         // 0xd(0x1)
	bool                                                         bOverride_DepthOfFieldFocalDistance;               // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldFstop;                       // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldDepthBlurRadius;             // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldDepthBlurAmount;             // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldFocalRegion;                 // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldNearTransitionRegion;        // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldFarTransitionRegion;         // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldScale;                       // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldMaxBokehSize;                // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldNearBlurSize;                // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldFarBlurSize;                 // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldMethod;                      // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldBokehShape;                  // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldOcclusion;                   // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldColorThreshold;              // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldSizeThreshold;               // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldSkyFocusDistance;            // 0x10(0x1)
	bool                                                         bOverride_MotionBlurAmount;                        // 0x10(0x1)
	bool                                                         bOverride_MotionBlurMax;                           // 0x10(0x1)
	bool                                                         bOverride_MotionBlurPerObjectSize;                 // 0x10(0x1)
	bool                                                         bOverride_ScreenPercentage;                        // 0x10(0x1)
	bool                                                         bOverride_AntiAliasingMethod;                      // 0x10(0x1)
	bool                                                         bOverride_ScreenSpaceReflectionIntensity;          // 0x10(0x1)
	bool                                                         bOverride_ScreenSpaceReflectionQuality;            // 0x10(0x1)
	bool                                                         bOverride_ScreenSpaceReflectionMaxRoughness;       // 0x11(0x1)
	bool                                                         bOverride_ScreenSpaceReflectionRoughnessScale;     // 0x11(0x1)
	bool                                                         bOverride_SkyLightIntensityScale;                  // 0x11(0x1)
	bool                                                         bOverride_SkyLightIntensityScaleForMinSpec;        // 0x11(0x1)
	bool                                                         bOverride_SkyLightIntensityScaleInteriorInfluence; // 0x11(0x1)
	bool                                                         bOverride_GlobalReflectionTint;                    // 0x11(0x1)
	bool                                                         bOverride_InsideAmbientColourForParticlesInfluence; // 0x11(0x1)
	bool                                                         bOverride_InsideAmbientColourForParticles;         // 0x11(0x1)
	bool                                                         bUseThisVolumeForLPVSettings;                      // 0x12(0x1)
	bool                                                         bOverride_GaussianBlur;                            // 0x12(0x1)
	bool                                                         bOverride_DisableShadowMapMethod;                  // 0x12(0x1)
	bool                                                         bOverride_UseVolumeFogScale;                       // 0x12(0x1)
	bool                                                         bOverride_VolumeFogScale;                          // 0x12(0x1)
	char                                                         pad0x1_YL866[0x1];                                 // 0x13(0x1)
	float                                                        WhiteTemp;                                         // 0x14(0x4)
	float                                                        WhiteTint;                                         // 0x18(0x4)
	struct Vector                                                ColorSaturation;                                   // 0x1c(0xc)
	struct Vector                                                ColorContrast;                                     // 0x28(0xc)
	struct Vector                                                ColorGamma;                                        // 0x34(0xc)
	struct Vector                                                ColorGain;                                         // 0x40(0xc)
	struct Vector                                                ColorOffset;                                       // 0x4c(0xc)
	struct LinearColor                                           FilmWhitePoint;                                    // 0x58(0x10)
	struct LinearColor                                           FilmShadowTint;                                    // 0x68(0x10)
	float                                                        FilmShadowTintBlend;                               // 0x78(0x4)
	float                                                        FilmShadowTintAmount;                              // 0x7c(0x4)
	float                                                        FilmSaturation;                                    // 0x80(0x4)
	struct LinearColor                                           FilmChannelMixerRed;                               // 0x84(0x10)
	struct LinearColor                                           FilmChannelMixerGreen;                             // 0x94(0x10)
	struct LinearColor                                           FilmChannelMixerBlue;                              // 0xa4(0x10)
	float                                                        FilmContrast;                                      // 0xb4(0x4)
	float                                                        FilmToeAmount;                                     // 0xb8(0x4)
	float                                                        FilmHealAmount;                                    // 0xbc(0x4)
	float                                                        FilmDynamicRange;                                  // 0xc0(0x4)
	float                                                        FilmSlope;                                         // 0xc4(0x4)
	float                                                        FilmToe;                                           // 0xc8(0x4)
	float                                                        FilmShoulder;                                      // 0xcc(0x4)
	float                                                        FilmBlackClip;                                     // 0xd0(0x4)
	float                                                        FilmWhiteClip;                                     // 0xd4(0x4)
	struct LinearColor                                           SceneColorTint;                                    // 0xd8(0x10)
	float                                                        SceneFringeIntensity;                              // 0xe8(0x4)
	float                                                        SceneFringeSaturation;                             // 0xec(0x4)
	float                                                        BloomIntensity;                                    // 0xf0(0x4)
	float                                                        BloomThreshold;                                    // 0xf4(0x4)
	float                                                        BloomSizeScale;                                    // 0xf8(0x4)
	float                                                        Bloom1Size;                                        // 0xfc(0x4)
	float                                                        Bloom2Size;                                        // 0x100(0x4)
	float                                                        Bloom3Size;                                        // 0x104(0x4)
	float                                                        Bloom4Size;                                        // 0x108(0x4)
	float                                                        Bloom5Size;                                        // 0x10c(0x4)
	float                                                        Bloom6Size;                                        // 0x110(0x4)
	struct LinearColor                                           Bloom1Tint;                                        // 0x114(0x10)
	struct LinearColor                                           Bloom2Tint;                                        // 0x124(0x10)
	struct LinearColor                                           Bloom3Tint;                                        // 0x134(0x10)
	struct LinearColor                                           Bloom4Tint;                                        // 0x144(0x10)
	struct LinearColor                                           Bloom5Tint;                                        // 0x154(0x10)
	struct LinearColor                                           Bloom6Tint;                                        // 0x164(0x10)
	float                                                        BloomDirtMaskIntensity;                            // 0x174(0x4)
	struct LinearColor                                           BloomDirtMaskTint;                                 // 0x178(0x10)
	class Texture*                                               BloomDirtMask;                                     // 0x188(0x8)
	float                                                        LPVIntensity;                                      // 0x190(0x4)
	float                                                        LPVVplInjectionBias;                               // 0x194(0x4)
	float                                                        LPVSize;                                           // 0x198(0x4)
	float                                                        LPVSecondaryOcclusionIntensity;                    // 0x19c(0x4)
	float                                                        LPVSecondaryBounceIntensity;                       // 0x1a0(0x4)
	float                                                        LPVGeometryVolumeBias;                             // 0x1a4(0x4)
	float                                                        LPVEmissiveInjectionIntensity;                     // 0x1a8(0x4)
	float                                                        LPVDirectionalOcclusionIntensity;                  // 0x1ac(0x4)
	struct Transform                                             LPVWorldRef;                                       // 0x1b0(0x30)
	float                                                        LPVDirectionalOcclusionRadius;                     // 0x1e0(0x4)
	float                                                        LPVDiffuseOcclusionExponent;                       // 0x1e4(0x4)
	float                                                        LPVSpecularOcclusionExponent;                      // 0x1e8(0x4)
	float                                                        LPVDiffuseOcclusionIntensity;                      // 0x1ec(0x4)
	float                                                        LPVSpecularOcclusionIntensity;                     // 0x1f0(0x4)
	struct LinearColor                                           AmbientCubemapTint;                                // 0x1f4(0x10)
	float                                                        AmbientCubemapIntensity;                           // 0x204(0x4)
	class TextureCube*                                           AmbientCubemap;                                    // 0x208(0x8)
	float                                                        AutoExposureLowPercent;                            // 0x210(0x4)
	float                                                        AutoExposureHighPercent;                           // 0x214(0x4)
	float                                                        AutoExposureMinBrightness;                         // 0x218(0x4)
	float                                                        AutoExposureMaxBrightness;                         // 0x21c(0x4)
	float                                                        AutoExposureSpeedUp;                               // 0x220(0x4)
	float                                                        AutoExposureSpeedDown;                             // 0x224(0x4)
	float                                                        AutoExposureBias;                                  // 0x228(0x4)
	float                                                        HistogramLogMin;                                   // 0x22c(0x4)
	float                                                        HistogramLogMax;                                   // 0x230(0x4)
	float                                                        LensFlareIntensity;                                // 0x234(0x4)
	struct LinearColor                                           LensFlareTint;                                     // 0x238(0x10)
	float                                                        LensFlareBokehSize;                                // 0x248(0x4)
	float                                                        LensFlareThreshold;                                // 0x24c(0x4)
	class Texture*                                               LensFlareBokehShape;                               // 0x250(0x8)
	struct LinearColor                                           LensFlareTints;                                    // 0x258(0x10)
	char                                                         pad0x70_5UGFF[0x70];                               // 0x268(0x70)
	float                                                        VignetteIntensity;                                 // 0x2d8(0x4)
	float                                                        GrainJitter;                                       // 0x2dc(0x4)
	float                                                        GrainIntensity;                                    // 0x2e0(0x4)
	float                                                        AmbientOcclusionIntensity;                         // 0x2e4(0x4)
	float                                                        AmbientOcclusionStaticFraction;                    // 0x2e8(0x4)
	float                                                        AmbientOcclusionRadius;                            // 0x2ec(0x4)
	bool                                                         AmbientOcclusionRadiusInWS;                        // 0x2f0(0x1)
	char                                                         pad0x3_FJUOF[0x3];                                 // 0x2f1(0x3)
	float                                                        AmbientOcclusionFadeDistance;                      // 0x2f4(0x4)
	float                                                        AmbientOcclusionFadeRadius;                        // 0x2f8(0x4)
	float                                                        AmbientOcclusionDistance;                          // 0x2fc(0x4)
	float                                                        AmbientOcclusionPower;                             // 0x300(0x4)
	float                                                        AmbientOcclusionBias;                              // 0x304(0x4)
	float                                                        AmbientOcclusionQuality;                           // 0x308(0x4)
	float                                                        AmbientOcclusionMipBlend;                          // 0x30c(0x4)
	float                                                        AmbientOcclusionMipScale;                          // 0x310(0x4)
	float                                                        AmbientOcclusionMipThreshold;                      // 0x314(0x4)
	float                                                        AmbientOcclusionHemiIntensity;                     // 0x318(0x4)
	float                                                        AmbientOcclusionHemiPower;                         // 0x31c(0x4)
	float                                                        AmbientOcclusionHemiRadius;                        // 0x320(0x4)
	float                                                        AmbientOcclusionHemiBlurTolerance;                 // 0x324(0x4)
	float                                                        AmbientOcclusionHemiUpsampleTolerance;             // 0x328(0x4)
	float                                                        AmbientOcclusionHemiNoiseFilterTolerance;          // 0x32c(0x4)
	float                                                        AmbientOcclusionHemiRejectionFalloff;              // 0x330(0x4)
	float                                                        AmbientOcclusionHemiBias;                          // 0x334(0x4)
	bool                                                         AmbientOcclusionHemiMaxDepthDownsample;            // 0x338(0x1)
	bool                                                         AmbientOcclusionHemiUseNormals;                    // 0x338(0x1)
	bool                                                         AmbientOcclusionHemiCombineBeforeBlur;             // 0x338(0x1)
	bool                                                         AmbientOcclusionHemiCombineWithMultiply;           // 0x338(0x1)
	char                                                         pad0x3_SGQPL[0x3];                                 // 0x339(0x3)
	float                                                        MinOverdrawCount;                                  // 0x33c(0x4)
	float                                                        MaxOverdrawCount;                                  // 0x340(0x4)
	struct LinearColor                                           MinOverdrawColour;                                 // 0x344(0x10)
	struct LinearColor                                           MaxOverdrawColour;                                 // 0x354(0x10)
	struct LinearColor                                           IndirectLightingColor;                             // 0x364(0x10)
	float                                                        IndirectLightingIntensity;                         // 0x374(0x4)
	float                                                        ColorGradingIntensity;                             // 0x378(0x4)
	char                                                         pad0x4_KSPBO[0x4];                                 // 0x37c(0x4)
	class Texture*                                               ColorGradingLUT;                                   // 0x380(0x8)
	byte                                                         DepthOfFieldMethod;                                // 0x388(0x1)
	char                                                         pad0x3_EGH2E[0x3];                                 // 0x389(0x3)
	float                                                        DepthOfFieldDepthBlurAmount;                       // 0x38c(0x4)
	float                                                        DepthOfFieldDepthBlurRadius;                       // 0x390(0x4)
	float                                                        DepthOfFieldFstop;                                 // 0x394(0x4)
	float                                                        DepthOfFieldFocalDistance;                         // 0x398(0x4)
	float                                                        DepthOfFieldFocalRegion;                           // 0x39c(0x4)
	float                                                        DepthOfFieldNearTransitionRegion;                  // 0x3a0(0x4)
	float                                                        DepthOfFieldFarTransitionRegion;                   // 0x3a4(0x4)
	float                                                        DepthOfFieldScale;                                 // 0x3a8(0x4)
	float                                                        DepthOfFieldMaxBokehSize;                          // 0x3ac(0x4)
	float                                                        DepthOfFieldNearBlurSize;                          // 0x3b0(0x4)
	float                                                        DepthOfFieldFarBlurSize;                           // 0x3b4(0x4)
	class Texture*                                               DepthOfFieldBokehShape;                            // 0x3b8(0x8)
	float                                                        DepthOfFieldOcclusion;                             // 0x3c0(0x4)
	float                                                        DepthOfFieldColorThreshold;                        // 0x3c4(0x4)
	float                                                        DepthOfFieldSizeThreshold;                         // 0x3c8(0x4)
	float                                                        DepthOfFieldSkyFocusDistance;                      // 0x3cc(0x4)
	float                                                        MotionBlurAmount;                                  // 0x3d0(0x4)
	float                                                        MotionBlurMax;                                     // 0x3d4(0x4)
	float                                                        MotionBlurPerObjectSize;                           // 0x3d8(0x4)
	float                                                        ScreenPercentage;                                  // 0x3dc(0x4)
	byte                                                         AntiAliasingMethod;                                // 0x3e0(0x1)
	char                                                         pad0x3_55TXE[0x3];                                 // 0x3e1(0x3)
	float                                                        ScreenSpaceReflectionIntensity;                    // 0x3e4(0x4)
	float                                                        ScreenSpaceReflectionQuality;                      // 0x3e8(0x4)
	float                                                        ScreenSpaceReflectionMaxRoughness;                 // 0x3ec(0x4)
	float                                                        SkyLightIntensityScale;                            // 0x3f0(0x4)
	float                                                        SkyLightIntensityScaleForMinSpec;                  // 0x3f4(0x4)
	float                                                        SkyLightIntensityScaleInteriorInfluence;           // 0x3f8(0x4)
	bool                                                         bUseVolumeFogScale;                                // 0x3fc(0x1)
	char                                                         pad0x3_OOX83[0x3];                                 // 0x3fd(0x3)
	float                                                        VolumeFogScale;                                    // 0x400(0x4)
	struct LinearColor                                           GlobalReflectionTint;                              // 0x404(0x10)
	float                                                        InsideAmbientColourForParticlesInfluence;          // 0x414(0x4)
	struct LinearColor                                           InsideAmbientColourForParticles;                   // 0x418(0x10)
	struct RainPostProcessSettings                               RainSettings;                                      // 0x428(0xc0)
	TArray<struct LPVCascadeSettings>                            LPVSettings;                                       // 0x4e8(0x10)
	struct PlayerAmbientLightOverrideSettings                    PlayerAmbientLightOverrideSettings;                // 0x4f8(0x18)
	float                                                        GaussianBlurIntensity;                             // 0x510(0x4)
	byte                                                         DisableShadowMethod;                               // 0x514(0x1)
	char                                                         pad0x3_32D8X[0x3];                                 // 0x515(0x3)
	struct WeightedBlendables                                    WeightedBlendables;                                // 0x518(0x10)
	TArray<class Object*>                                        Blendables;                                        // 0x528(0x10)
	char                                                         pad0x8_N3AA5[0x8];                                 // 0x538(0x8)
};


// Size 0x10
struct WeightedBlendables
{
public:
	TArray<struct WeightedBlendable>                             Array;                                             // 0x0(0x10)
};


// Size 0x10
struct WeightedBlendable
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	char                                                         pad0x4_UWUHO[0x4];                                 // 0x4(0x4)
	class Object*                                                Object;                                            // 0x8(0x8)
};


// Size 0x70
struct LPVCascadeSettings
{
public:
	bool                                                         bOverride_LPVIntensity;                            // 0x0(0x1)
	bool                                                         bOverride_LPVDirectionalOcclusionIntensity;        // 0x0(0x1)
	bool                                                         bOverride_LPVDirectionalOcclusionRadius;           // 0x0(0x1)
	bool                                                         bOverride_LPVDiffuseOcclusionExponent;             // 0x0(0x1)
	bool                                                         bOverride_LPVSpecularOcclusionExponent;            // 0x0(0x1)
	bool                                                         bOverride_LPVDiffuseOcclusionIntensity;            // 0x0(0x1)
	bool                                                         bOverride_LPVSpecularOcclusionIntensity;           // 0x0(0x1)
	bool                                                         bOverride_LPVSize;                                 // 0x0(0x1)
	bool                                                         bOverride_LPVSecondaryOcclusionIntensity;          // 0x1(0x1)
	bool                                                         bOverride_LPVSecondaryBounceIntensity;             // 0x1(0x1)
	bool                                                         bOverride_LPVGeometryVolumeBias;                   // 0x1(0x1)
	bool                                                         bOverride_LPVVplInjectionBias;                     // 0x1(0x1)
	bool                                                         bOverride_LPVEmissiveInjectionIntensity;           // 0x1(0x1)
	bool                                                         bOverride_NumberOfPropagationSteps;                // 0x1(0x1)
	bool                                                         bFreezeLPVUpdate;                                  // 0x1(0x1)
	char                                                         pad0x2_QLBLI[0x2];                                 // 0x2(0x2)
	float                                                        LPVIntensity;                                      // 0x4(0x4)
	float                                                        LPVVplInjectionBias;                               // 0x8(0x4)
	float                                                        LPVSize;                                           // 0xc(0x4)
	float                                                        LPVSecondaryOcclusionIntensity;                    // 0x10(0x4)
	float                                                        LPVSecondaryBounceIntensity;                       // 0x14(0x4)
	float                                                        LPVGeometryVolumeBias;                             // 0x18(0x4)
	float                                                        LPVEmissiveInjectionIntensity;                     // 0x1c(0x4)
	float                                                        LPVDirectionalOcclusionIntensity;                  // 0x20(0x4)
	float                                                        LPVDirectionalOcclusionRadius;                     // 0x24(0x4)
	float                                                        LPVDiffuseOcclusionExponent;                       // 0x28(0x4)
	float                                                        LPVSpecularOcclusionExponent;                      // 0x2c(0x4)
	float                                                        LPVDiffuseOcclusionIntensity;                      // 0x30(0x4)
	float                                                        LPVSpecularOcclusionIntensity;                     // 0x34(0x4)
	int                                                          LPVNumberOfPropagationSteps;                       // 0x38(0x4)
	char                                                         pad0x4_EZ9I4[0x4];                                 // 0x3c(0x4)
	struct Transform                                             LPVWorldRef;                                       // 0x40(0x30)
};


// Size 0x5a0
struct MinimalViewInfo
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	struct Rotator                                               Rotation;                                          // 0xc(0xc)
	char                                                         pad0x10_B5LOR[0x10];                               // 0x18(0x10)
	float                                                        FOV;                                               // 0x28(0x4)
	float                                                        OrthoWidth;                                        // 0x2c(0x4)
	float                                                        OrthoNearClipPlane;                                // 0x30(0x4)
	float                                                        OrthoFarClipPlane;                                 // 0x34(0x4)
	float                                                        AspectRatio;                                       // 0x38(0x4)
	bool                                                         bConstrainAspectRatio;                             // 0x3c(0x1)
	bool                                                         bUseFieldOfViewForLOD;                             // 0x3c(0x1)
	char                                                         pad0x3_CBYN2[0x3];                                 // 0x3d(0x3)
	byte                                                         ProjectionMode;                                    // 0x40(0x1)
	char                                                         pad0x3_03CA5[0x3];                                 // 0x41(0x3)
	float                                                        PostProcessBlendWeight;                            // 0x44(0x4)
	char                                                         pad0x8_BX328[0x8];                                 // 0x48(0x8)
	struct PostProcessSettings                                   PostProcessSettings;                               // 0x50(0x540)
	char                                                         pad0x10_LDMZO[0x10];                               // 0x590(0x10)
};


// Size 0x24
struct VOscillator
{
public:
	struct FOscillator                                           X;                                                 // 0x0(0xc)
	struct FOscillator                                           Y;                                                 // 0xc(0xc)
	struct FOscillator                                           Z;                                                 // 0x18(0xc)
};


// Size 0xc
struct FOscillator
{
public:
	float                                                        Amplitude;                                         // 0x0(0x4)
	float                                                        Frequency;                                         // 0x4(0x4)
	byte                                                         InitialOffset;                                     // 0x8(0x1)
	char                                                         pad0x3_8VFW3[0x3];                                 // 0x9(0x3)
};


// Size 0x24
struct ROscillator
{
public:
	struct FOscillator                                           Pitch;                                             // 0x0(0xc)
	struct FOscillator                                           Yaw;                                               // 0xc(0xc)
	struct FOscillator                                           Roll;                                              // 0x18(0xc)
};


// Size 0x28
struct ViewTargetTransitionParams
{
public:
	float                                                        BlendTime;                                         // 0x0(0x4)
	byte                                                         BlendFunction;                                     // 0x4(0x1)
	char                                                         pad0x3_DESBH[0x3];                                 // 0x5(0x3)
	float                                                        BlendExp;                                          // 0x8(0x4)
	bool                                                         bLockOutgoing;                                     // 0xc(0x1)
	char                                                         pad0x1b_CH3J2[0x1b];                               // 0xd(0x1b)
};


// Size 0x5c0
struct TViewTarget
{
public:
	class Actor*                                                 Target;                                            // 0x0(0x8)
	char                                                         pad0x8_XZR1W[0x8];                                 // 0x8(0x8)
	struct MinimalViewInfo                                       POV;                                               // 0x10(0x5a0)
	class PlayerState*                                           PlayerState;                                       // 0x5b0(0x8)
	char                                                         pad0x8_2DYC5[0x8];                                 // 0x5b8(0x8)
};


// Size 0x5b0
struct CameraCacheEntry
{
public:
	float                                                        TimeStamp;                                         // 0x0(0x4)
	char                                                         pad0xc_3EJMT[0xc];                                 // 0x4(0xc)
	struct MinimalViewInfo                                       POV;                                               // 0x10(0x5a0)
};


// Size 0x68
struct NameCurve
{
public:
	char                                                         pad0x58_N62DJ[0x58];                               // 0x0(0x58)
	TArray<struct NameCurveKey>                                  Keys;                                              // 0x58(0x10)
};


// Size 0xc
struct NameCurveKey
{
public:
	float                                                        Time;                                              // 0x0(0x4)
	struct FName                                                 Value;                                             // 0x4(0x8)
};


// Size 0x18
struct ActiveForceFeedbackEffect
{
public:
	class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x0(0x8)
	char                                                         pad0x10_SDNBF[0x10];                               // 0x8(0x10)
};


// Size 0x88
struct ForceFeedbackChannelDetails
{
public:
	bool                                                         bAffectsLeftLarge;                                 // 0x0(0x1)
	bool                                                         bAffectsLeftSmall;                                 // 0x0(0x1)
	bool                                                         bAffectsRightLarge;                                // 0x0(0x1)
	bool                                                         bAffectsRightSmall;                                // 0x0(0x1)
	bool                                                         bAffectsLeftTrigger;                               // 0x0(0x1)
	bool                                                         bAffectsRightTrigger;                              // 0x0(0x1)
	char                                                         pad0x7_O1HLK[0x7];                                 // 0x1(0x7)
	struct RuntimeFloatCurve                                     Curve;                                             // 0x8(0x80)
};


// Size 0x18
struct LevelStreamingStatusUpdateInfo
{
public:
	struct FString                                               PackageName;                                       // 0x0(0x10)
	int                                                          LODIndex;                                          // 0x10(0x4)
	bool                                                         bNewShouldBeLoaded;                                // 0x14(0x1)
	bool                                                         bNewShouldBeVisible;                               // 0x14(0x1)
	bool                                                         bNewShouldBlockOnLoad;                             // 0x14(0x1)
	char                                                         pad0x3_F1QBG[0x3];                                 // 0x15(0x3)
};


// Size 0x60
struct DebugTextInfo
{
public:
	class Actor*                                                 SrcActor;                                          // 0x0(0x8)
	struct Vector                                                SrcActorOffset;                                    // 0x8(0xc)
	struct Vector                                                SrcActorDesiredOffset;                             // 0x14(0xc)
	struct FString                                               DebugText;                                         // 0x20(0x10)
	float                                                        TimeRemaining;                                     // 0x30(0x4)
	float                                                        Duration;                                          // 0x34(0x4)
	struct Color                                                 TextColor;                                         // 0x38(0x4)
	bool                                                         bAbsoluteLocation;                                 // 0x3c(0x1)
	bool                                                         bKeepAttachedToActor;                              // 0x3c(0x1)
	bool                                                         bDrawShadow;                                       // 0x3c(0x1)
	char                                                         pad0x3_P21G2[0x3];                                 // 0x3d(0x3)
	struct Vector                                                OrigActorLocation;                                 // 0x40(0xc)
	char                                                         pad0x4_T2RSL[0x4];                                 // 0x4c(0x4)
	class Font*                                                  Font;                                              // 0x50(0x8)
	float                                                        FontScale;                                         // 0x58(0x4)
	char                                                         pad0x4_4G2JN[0x4];                                 // 0x5c(0x4)
};


// Size 0x20
struct GameClassShortName
{
public:
	struct FString                                               ShortName;                                         // 0x0(0x10)
	struct FString                                               GameClassName;                                     // 0x10(0x10)
};


// Size 0xc
struct MergedCollisionActorsSimplification
{
public:
	struct CollisionMergingSettings                              MergeCollisionSettings;                            // 0x0(0x1)
	char                                                         pad0x3_LEZDA[0x3];                                 // 0x1(0x3)
	float                                                        MaxBoundRadius;                                    // 0x4(0x4)
	int                                                          MinNumberOfComponentsToMerge;                      // 0x8(0x4)
};


// Size 0xd8
struct HierarchicalSimplification
{
public:
	bool                                                         bSimplifyMesh;                                     // 0x0(0x1)
	char                                                         pad0x3_U1KXR[0x3];                                 // 0x1(0x3)
	float                                                        DrawDistance;                                      // 0x4(0x4)
	float                                                        DesiredBoundRadius;                                // 0x8(0x4)
	float                                                        DesiredFillingPercentage;                          // 0xc(0x4)
	int                                                          MinNumberOfActorsToBuild;                          // 0x10(0x4)
	struct MeshProxySettings                                     ProxySetting;                                      // 0x14(0x70)
	char                                                         pad0x4_IS2IM[0x4];                                 // 0x84(0x4)
	struct MeshMergingSettings                                   MergeSetting;                                      // 0x88(0x50)
};


// Size 0x58
struct NetViewer
{
public:
	class Actor*                                                 InViewer;                                          // 0x0(0x8)
	class Actor*                                                 ViewTarget;                                        // 0x8(0x8)
	TArray<struct Vector>                                        CachedViewLocations;                               // 0x10(0x10)
	struct Vector                                                ViewDir;                                           // 0x20(0xc)
	char                                                         pad0x2c_JXGF5[0x2c];                               // 0x2c(0x2c)
};


// Size 0x44
struct LightmassWorldInfoSettings
{
public:
	float                                                        StaticLightingLevelScale;                          // 0x0(0x4)
	int                                                          NumIndirectLightingBounces;                        // 0x4(0x4)
	float                                                        IndirectLightingQuality;                           // 0x8(0x4)
	float                                                        IndirectLightingSmoothness;                        // 0xc(0x4)
	struct Color                                                 EnvironmentColor;                                  // 0x10(0x4)
	float                                                        EnvironmentIntensity;                              // 0x14(0x4)
	float                                                        EmissiveBoost;                                     // 0x18(0x4)
	float                                                        DiffuseBoost;                                      // 0x1c(0x4)
	bool                                                         bUseAmbientOcclusion;                              // 0x20(0x1)
	bool                                                         bGenerateAmbientOcclusionMaterialMask;             // 0x20(0x1)
	char                                                         pad0x3_2PY0P[0x3];                                 // 0x21(0x3)
	float                                                        DirectIlluminationOcclusionFraction;               // 0x24(0x4)
	float                                                        IndirectIlluminationOcclusionFraction;             // 0x28(0x4)
	float                                                        OcclusionExponent;                                 // 0x2c(0x4)
	float                                                        FullyOccludedSamplesFraction;                      // 0x30(0x4)
	float                                                        MaxOcclusionDistance;                              // 0x34(0x4)
	bool                                                         bVisualizeMaterialDiffuse;                         // 0x38(0x1)
	bool                                                         bVisualizeAmbientOcclusion;                        // 0x38(0x1)
	char                                                         pad0x3_MX1WE[0x3];                                 // 0x39(0x3)
	float                                                        VolumeLightSamplePlacementScale;                   // 0x3c(0x4)
	bool                                                         bCompressLightmaps;                                // 0x40(0x1)
	char                                                         pad0x3_XKW4X[0x3];                                 // 0x41(0x3)
};


// Size 0x20
struct GameModePrefix
{
public:
	struct FString                                               Prefix;                                            // 0x0(0x10)
	struct FString                                               GameMode;                                          // 0x10(0x10)
};


// Size 0x18
struct InterpGroupActorInfo
{
public:
	struct FName                                                 ObjectName;                                        // 0x0(0x8)
	TArray<class Actor*>                                         Actors;                                            // 0x8(0x10)
};


// Size 0x10
struct CameraCutInfo
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        TimeStamp;                                         // 0xc(0x4)
};


// Size 0x4
struct NavigationFilterFlags
{
public:
	bool                                                         bNavFlag0;                                         // 0x0(0x1)
	bool                                                         bNavFlag1;                                         // 0x0(0x1)
	bool                                                         bNavFlag2;                                         // 0x0(0x1)
	bool                                                         bNavFlag3;                                         // 0x0(0x1)
	bool                                                         bNavFlag4;                                         // 0x0(0x1)
	bool                                                         bNavFlag5;                                         // 0x0(0x1)
	bool                                                         bNavFlag6;                                         // 0x0(0x1)
	bool                                                         bNavFlag7;                                         // 0x0(0x1)
	bool                                                         bNavFlag8;                                         // 0x1(0x1)
	bool                                                         bNavFlag9;                                         // 0x1(0x1)
	bool                                                         bNavFlag10;                                        // 0x1(0x1)
	bool                                                         bNavFlag11;                                        // 0x1(0x1)
	bool                                                         bNavFlag12;                                        // 0x1(0x1)
	bool                                                         bNavFlag13;                                        // 0x1(0x1)
	bool                                                         bNavFlag14;                                        // 0x1(0x1)
	bool                                                         bNavFlag15;                                        // 0x1(0x1)
	char                                                         pad0x2_LPTN2[0x2];                                 // 0x2(0x2)
};


// Size 0x18
struct NavigationFilterArea
{
public:
	class UClass*                                                AreaClass;                                         // 0x0(0x8)
	float                                                        TravelCostOverride;                                // 0x8(0x4)
	float                                                        EnteringCostOverride;                              // 0xc(0x4)
	bool                                                         bIsExcluded;                                       // 0x10(0x1)
	bool                                                         bOverrideTravelCost;                               // 0x10(0x1)
	bool                                                         bOverrideEnteringCost;                             // 0x10(0x1)
	char                                                         pad0x7_2E8WI[0x7];                                 // 0x11(0x7)
};


// Size 0x20
struct SupportedAreaData
{
public:
	struct FString                                               AreaClassName;                                     // 0x0(0x10)
	int                                                          AreaID;                                            // 0x10(0x4)
	char                                                         pad0x4_KSTQ0[0x4];                                 // 0x14(0x4)
	class UClass*                                                AreaClass;                                         // 0x18(0x8)
};


// Size 0x18
struct NavGraphNode
{
public:
	class Object*                                                Owner;                                             // 0x0(0x8)
	char                                                         pad0x10_5SF03[0x10];                               // 0x8(0x10)
};


// Size 0x18
struct NavGraphEdge
{
public:
	char                                                         pad0x18_FPS01[0x18];                               // 0x0(0x18)
};


// Size 0x60
struct NavigationSegmentLink
{
public:
	char                                                         pad0x30_LW6QR[0x30];                               // 0x0(0x30)
	struct Vector                                                LeftStart;                                         // 0x30(0xc)
	struct Vector                                                LeftEnd;                                           // 0x3c(0xc)
	struct Vector                                                RightStart;                                        // 0x48(0xc)
	struct Vector                                                RightEnd;                                          // 0x54(0xc)
};


// Size 0x30
struct NavigationLinkBase
{
public:
	float                                                        LeftProjectHeight;                                 // 0x0(0x4)
	float                                                        MaxFallDownLength;                                 // 0x4(0x4)
	byte                                                         Direction;                                         // 0x8(0x1)
	char                                                         pad0x7_JWIKG[0x7];                                 // 0x9(0x7)
	float                                                        SnapRadius;                                        // 0x10(0x4)
	float                                                        SnapHeight;                                        // 0x14(0x4)
	bool                                                         bUseSnapHeight;                                    // 0x18(0x1)
	bool                                                         bSnapToCheapestArea;                               // 0x18(0x1)
	char                                                         pad0x7_2V59I[0x7];                                 // 0x19(0x7)
	class UClass*                                                AreaClass;                                         // 0x20(0x8)
	struct NavAgentSelector                                      SupportedAgents;                                   // 0x28(0x4)
	bool                                                         bSupportsAgent0;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent1;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent2;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent3;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent4;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent5;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent6;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent7;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent8;                                   // 0x2d(0x1)
	bool                                                         bSupportsAgent9;                                   // 0x2d(0x1)
	bool                                                         bSupportsAgent10;                                  // 0x2d(0x1)
	bool                                                         bSupportsAgent11;                                  // 0x2d(0x1)
	bool                                                         bSupportsAgent12;                                  // 0x2d(0x1)
	bool                                                         bSupportsAgent13;                                  // 0x2d(0x1)
	bool                                                         bSupportsAgent14;                                  // 0x2d(0x1)
	bool                                                         bSupportsAgent15;                                  // 0x2d(0x1)
	char                                                         pad0x2_R07FN[0x2];                                 // 0x2e(0x2)
};


// Size 0x48
struct NavigationLink
{
public:
	char                                                         pad0x30_PR82I[0x30];                               // 0x0(0x30)
	struct Vector                                                Left;                                              // 0x30(0xc)
	struct Vector                                                Right;                                             // 0x3c(0xc)
};


// Size 0x14
struct LightmassMaterialInterfaceSettings
{
public:
	bool                                                         bCastShadowAsMasked;                               // 0x0(0x1)
	char                                                         pad0x3_CMP8B[0x3];                                 // 0x1(0x3)
	float                                                        EmissiveBoost;                                     // 0x4(0x4)
	float                                                        DiffuseBoost;                                      // 0x8(0x4)
	float                                                        ExportResolutionScale;                             // 0xc(0x4)
	bool                                                         bOverrideCastShadowAsMasked;                       // 0x10(0x1)
	bool                                                         bOverrideEmissiveBoost;                            // 0x10(0x1)
	bool                                                         bOverrideDiffuseBoost;                             // 0x10(0x1)
	bool                                                         bOverrideExportResolutionScale;                    // 0x10(0x1)
	char                                                         pad0x3_6F3VJ[0x3];                                 // 0x11(0x3)
};


// Size 0xc
struct MaterialRelevance
{
public:
	bool                                                         bOpaque;                                           // 0x0(0x1)
	bool                                                         bMasked;                                           // 0x0(0x1)
	bool                                                         bDistortion;                                       // 0x0(0x1)
	bool                                                         bSeparateTranslucency;                             // 0x0(0x1)
	bool                                                         bNormalTranslucency;                               // 0x0(0x1)
	bool                                                         bDisableDepthTest;                                 // 0x0(0x1)
	bool                                                         bOutputsVelocityInBasePass;                        // 0x0(0x1)
	bool                                                         bUsesGlobalDistanceField;                          // 0x0(0x1)
	char                                                         pad0x3_LXQGY[0x3];                                 // 0x1(0x3)
	bool                                                         bOITTranslucencyRelevance;                         // 0x8(0x1)
	bool                                                         bOITAfterTranslucencyRelevance;                    // 0x8(0x1)
	bool                                                         bLowResTranslucencyRelevance;                      // 0x8(0x1)
	bool                                                         bLowResCloudsRelevance;                            // 0x8(0x1)
	bool                                                         bMaskPassRelevance;                                // 0x8(0x1)
	bool                                                         bTranslucentBeforeTranslucency;                    // 0x8(0x1)
	bool                                                         bTranslucentBeforeVolumeFog;                       // 0x8(0x1)
	bool                                                         bTranslucentWithDepthWrite;                        // 0x8(0x1)
	char                                                         pad0x3_IQW6C[0x3];                                 // 0x9(0x3)
};


// Size 0x78
struct SpriteCategoryInfo
{
public:
	struct FName                                                 Category;                                          // 0x0(0x8)
	struct FText                                                 DisplayName;                                       // 0x8(0x38)
	struct FText                                                 Description;                                       // 0x40(0x38)
};


// Size 0x10
struct NamedEmitterMaterial
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	class MaterialInterface*                                     Material;                                          // 0x8(0x8)
};


// Size 0x10
struct LODSoloTrack
{
public:
	TArray<Byte SoloEnableSetting>                               SoloEnableSetting;                                 // 0x0(0x10)
};


// Size 0x1
struct ParticleSystemLOD
{
public:
	char                                                         pad0x1_QYQXD[0x1];                                 // 0x0(0x1)
};


// Size 0x50
struct ParticleSysParam
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	byte                                                         ParamType;                                         // 0x8(0x1)
	char                                                         pad0x3_P2FXB[0x3];                                 // 0x9(0x3)
	float                                                        Scalar;                                            // 0xc(0x4)
	float                                                        Scalar_Low;                                        // 0x10(0x4)
	struct Vector                                                Vector;                                            // 0x14(0xc)
	struct Vector                                                Vector_Low;                                        // 0x20(0xc)
	struct Color                                                 Color;                                             // 0x2c(0x4)
	class Actor*                                                 Actor;                                             // 0x30(0x8)
	class MaterialInterface*                                     Material;                                          // 0x38(0x8)
	TArray<struct EmitterPointData>                              EmitterPoints;                                     // 0x40(0x10)
};


// Size 0x40
struct EmitterPointData
{
public:
	struct Vector4                                               Position;                                          // 0x0(0x10)
	struct Vector4                                               InheritedVelocity;                                 // 0x10(0x10)
	struct Vector4                                               Orientation;                                       // 0x20(0x10)
	struct Vector                                                Scale;                                             // 0x30(0xc)
	char                                                         pad0x4_K5F91[0x4];                                 // 0x3c(0x4)
};


// Size 0x38
struct TriMeshCollisionData
{
public:
	TArray<struct Vector>                                        Vertices;                                          // 0x0(0x10)
	TArray<struct TriIndices>                                    Indices;                                           // 0x10(0x10)
	bool                                                         bFlipNormals;                                      // 0x20(0x1)
	char                                                         pad0x17_92AG6[0x17];                               // 0x21(0x17)
};


// Size 0xc
struct TriIndices
{
public:
	int                                                          v0;                                                // 0x0(0x4)
	int                                                          v1;                                                // 0x4(0x4)
	int                                                          v2;                                                // 0x8(0x4)
};


// Size 0x10
struct PreviewAssetAttachContainer
{
public:
	TArray<struct PreviewAttachedObjectPair>                     AttachedObjects;                                   // 0x0(0x10)
};


// Size 0x30
struct PreviewAttachedObjectPair
{
public:
	char                                                         pad0x20_RRCWV[0x20];                               // 0x0(0x20)
	class Object*                                                Object;                                            // 0x20(0x8)
	struct FName                                                 AttachedTo;                                        // 0x28(0x8)
};


// Size 0x14
struct DeformablesSettings
{
public:
	float                                                        DistanceStiffness;                                 // 0x0(0x4)
	float                                                        VolumeStiffness;                                   // 0x4(0x4)
	float                                                        Damping;                                           // 0x8(0x4)
	float                                                        MaxDistance;                                       // 0xc(0x4)
	float                                                        WeightMultiplier;                                  // 0x10(0x4)
};


// Size 0x10
struct SkeletalMaterial
{
public:
	class MaterialInterface*                                     MaterialInterface;                                 // 0x0(0x8)
	bool                                                         bEnableShadowCasting;                              // 0x8(0x1)
	char                                                         pad0x7_WXLTW[0x7];                                 // 0x9(0x7)
};


// Size 0x40
struct ClothingAssetData
{
public:
	struct FName                                                 AssetName;                                         // 0x0(0x8)
	struct FString                                               ApexFileName;                                      // 0x8(0x10)
	bool                                                         bClothPropertiesChanged;                           // 0x18(0x1)
	char                                                         pad0x3_PDEX1[0x3];                                 // 0x19(0x3)
	struct ClothPhysicsProperties                                PhysicsProperties;                                 // 0x1c(0x24)
};


// Size 0x24
struct ClothPhysicsProperties
{
public:
	float                                                        BendResistance;                                    // 0x0(0x4)
	float                                                        ShearResistance;                                   // 0x4(0x4)
	float                                                        StretchLimit;                                      // 0x8(0x4)
	float                                                        Friction;                                          // 0xc(0x4)
	float                                                        Damping;                                           // 0x10(0x4)
	float                                                        Drag;                                              // 0x14(0x4)
	float                                                        GravityScale;                                      // 0x18(0x4)
	float                                                        InertiaBlend;                                      // 0x1c(0x4)
	float                                                        SelfCollisionThickness;                            // 0x20(0x4)
};


// Size 0x10
struct MorphTargetMap
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	class MorphTarget*                                           MorphTarget;                                       // 0x8(0x8)
};


// Size 0xf0
struct SkeletalMeshLODInfo
{
public:
	float                                                        ScreenSize;                                        // 0x0(0x4)
	float                                                        LODHysteresis;                                     // 0x4(0x4)
	TArray<Int LODMaterialMap>                                   LODMaterialMap;                                    // 0x8(0x10)
	TArray<struct TriangleSortSettings>                          TriangleSortSettings;                              // 0x18(0x10)
	bool                                                         bHasBeenSimplified;                                // 0x28(0x1)
	char                                                         pad0x7_KLEX8[0x7];                                 // 0x29(0x7)
	struct SkeletalMeshOptimizationSettings                      ReductionSettings;                                 // 0x30(0x70)
	struct SimplygonRemeshingSettings                            RemeshingSettings;                                 // 0xa0(0x50)
};


// Size 0x70
struct SkeletalMeshOptimizationSettings
{
public:
	byte                                                         ReductionMethod;                                   // 0x0(0x1)
	char                                                         pad0x3_8QVO7[0x3];                                 // 0x1(0x3)
	float                                                        NumOfTrianglesPercentage;                          // 0x4(0x4)
	float                                                        MaxDeviationPercentage;                            // 0x8(0x4)
	float                                                        WeldingThreshold;                                  // 0xc(0x4)
	bool                                                         bRecalcNormals;                                    // 0x10(0x1)
	char                                                         pad0x3_0HMG2[0x3];                                 // 0x11(0x3)
	float                                                        NormalsThreshold;                                  // 0x14(0x4)
	byte                                                         SilhouetteImportance;                              // 0x18(0x1)
	byte                                                         TextureImportance;                                 // 0x19(0x1)
	byte                                                         ShadingImportance;                                 // 0x1a(0x1)
	byte                                                         SkinningImportance;                                // 0x1b(0x1)
	float                                                        BoneReductionRatio;                                // 0x1c(0x4)
	int                                                          MaxBonesPerVertex;                                 // 0x20(0x4)
	char                                                         pad0x4_Z7CDE[0x4];                                 // 0x24(0x4)
	TArray<struct BoneReference>                                 BonesToRemove;                                     // 0x28(0x10)
	int                                                          BaseLODModel;                                      // 0x38(0x4)
	int                                                          LODChainLastIndex;                                 // 0x3c(0x4)
	bool                                                         bForceRebuild;                                     // 0x40(0x1)
	char                                                         pad0x7_DQHOJ[0x7];                                 // 0x41(0x7)
	struct SimplygonMaterialLODSettings                          MaterialLODSettings;                               // 0x48(0x28)
};


// Size 0xc
struct TriangleSortSettings
{
public:
	byte                                                         TriangleSorting;                                   // 0x0(0x1)
	byte                                                         CustomLeftRightAxis;                               // 0x1(0x1)
	char                                                         pad0x2_0XLLZ[0x2];                                 // 0x2(0x2)
	struct FName                                                 CustomLeftRightBoneName;                           // 0x4(0x8)
};


// Size 0x14
struct BoneMirrorExport
{
public:
	struct FName                                                 BoneName;                                          // 0x0(0x8)
	struct FName                                                 SourceBoneName;                                    // 0x8(0x8)
	byte                                                         BoneFlipAxis;                                      // 0x10(0x1)
	char                                                         pad0x3_5P4RC[0x3];                                 // 0x11(0x3)
};


// Size 0x8
struct BoneMirrorInfo
{
public:
	int                                                          SourceIndex;                                       // 0x0(0x4)
	byte                                                         BoneFlipAxis;                                      // 0x4(0x1)
	char                                                         pad0x3_99ZHR[0x3];                                 // 0x5(0x3)
};


// Size 0xc
struct AnimationGroupReference
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	byte                                                         GroupRole;                                         // 0x8(0x1)
	char                                                         pad0x3_3K8NG[0x3];                                 // 0x9(0x3)
};


// Size 0x40
struct RootMotionMovementParams
{
public:
	bool                                                         bHasRootMotion;                                    // 0x0(0x1)
	char                                                         pad0x3_VAUB8[0x3];                                 // 0x1(0x3)
	float                                                        BlendWeight;                                       // 0x4(0x4)
	char                                                         pad0x8_8LFRH[0x8];                                 // 0x8(0x8)
	struct Transform                                             RootMotionTransform;                               // 0x10(0x30)
};


// Size 0x18
struct AnimGroupInstance
{
public:
	char                                                         pad0x18_5FK07[0x18];                               // 0x0(0x18)
};


// Size 0x40
struct AnimTickRecord
{
public:
	class AnimationAsset*                                        SourceAsset;                                       // 0x0(0x8)
	char                                                         pad0x38_IM4YX[0x38];                               // 0x8(0x38)
};


// Size 0x8
struct AnimExtractContext
{
public:
	bool                                                         bExtractRootMotion;                                // 0x0(0x1)
	char                                                         pad0x3_RM8S0[0x3];                                 // 0x1(0x3)
	float                                                        CurrentTime;                                       // 0x4(0x4)
};


// Size 0x90
struct BlendFilter
{
public:
	char                                                         pad0x90_6XDF9[0x90];                               // 0x0(0x90)
};


// Size 0x20
struct BlendSampleData
{
public:
	int                                                          SampleDataIndex;                                   // 0x0(0x4)
	float                                                        TotalWeight;                                       // 0x4(0x4)
	float                                                        Time;                                              // 0x8(0x4)
	char                                                         pad0x14_0DBOR[0x14];                               // 0xc(0x14)
};


// Size 0x38
struct BasedMovementInfo
{
public:
	class PrimitiveComponent*                                    MovementBase;                                      // 0x0(0x8)
	struct FName                                                 BoneName;                                          // 0x8(0x8)
	struct Vector_NetQuantize100                                 Location;                                          // 0x10(0xc)
	struct Rotator                                               Rotation;                                          // 0x1c(0xc)
	bool                                                         bServerHasBaseComponent;                           // 0x28(0x1)
	bool                                                         bRelativeRotation;                                 // 0x29(0x1)
	char                                                         pad0x2_2UY7O[0x2];                                 // 0x2a(0x2)
	struct Vector                                                LinearVelocity;                                    // 0x2c(0xc)
};


// Size 0x48
struct SimulatedRootMotionReplicatedMove
{
public:
	float                                                        Time;                                              // 0x0(0x4)
	char                                                         pad0x4_MW3I1[0x4];                                 // 0x4(0x4)
	struct RepRootMotionMontage                                  RootMotion;                                        // 0x8(0x40)
};


// Size 0x40
struct RepRootMotionMontage
{
public:
	class AnimMontage*                                           AnimMontage;                                       // 0x0(0x8)
	float                                                        Position;                                          // 0x8(0x4)
	struct Vector_NetQuantize10                                  Location;                                          // 0xc(0xc)
	struct Rotator                                               Rotation;                                          // 0x18(0xc)
	char                                                         pad0x4_J3ZRX[0x4];                                 // 0x24(0x4)
	class PrimitiveComponent*                                    MovementBase;                                      // 0x28(0x8)
	struct FName                                                 MovementBaseBoneName;                              // 0x30(0x8)
	bool                                                         bRelativePosition;                                 // 0x38(0x1)
	bool                                                         bRelativeRotation;                                 // 0x39(0x1)
	char                                                         pad0x6_90ONG[0x6];                                 // 0x3a(0x6)
};


// Size 0x10
struct SkelMeshComponentLODInfo
{
public:
	TArray<Bool HiddenMaterials>                                 HiddenMaterials;                                   // 0x0(0x10)
};


// Size 0x10
struct ActiveVertexAnim
{
public:
	class VertexAnimBase*                                        VertAnim;                                          // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	float                                                        Time;                                              // 0xc(0x4)
};


// Size 0x160
struct ConstraintInstance
{
public:
	char                                                         pad0x8_Q8S73[0x8];                                 // 0x0(0x8)
	class SceneComponent*                                        OwnerComponent;                                    // 0x8(0x8)
	char                                                         pad0xc_S0Z8F[0xc];                                 // 0x10(0xc)
	struct FName                                                 JointName;                                         // 0x1c(0x8)
	struct FName                                                 ConstraintBone1;                                   // 0x24(0x8)
	struct FName                                                 ConstraintBone2;                                   // 0x2c(0x8)
	struct Vector                                                Pos1;                                              // 0x34(0xc)
	struct Vector                                                PriAxis1;                                          // 0x40(0xc)
	struct Vector                                                SecAxis1;                                          // 0x4c(0xc)
	struct Vector                                                Pos2;                                              // 0x58(0xc)
	struct Vector                                                PriAxis2;                                          // 0x64(0xc)
	struct Vector                                                SecAxis2;                                          // 0x70(0xc)
	bool                                                         bDisableCollision;                                 // 0x7c(0x1)
	bool                                                         bEnableProjection;                                 // 0x7c(0x1)
	char                                                         pad0x3_GTJEJ[0x3];                                 // 0x7d(0x3)
	float                                                        ProjectionLinearTolerance;                         // 0x80(0x4)
	float                                                        ProjectionAngularTolerance;                        // 0x84(0x4)
	byte                                                         LinearXMotion;                                     // 0x88(0x1)
	byte                                                         LinearYMotion;                                     // 0x89(0x1)
	byte                                                         LinearZMotion;                                     // 0x8a(0x1)
	char                                                         pad0x1_QIDM2[0x1];                                 // 0x8b(0x1)
	float                                                        LinearLimitSize;                                   // 0x8c(0x4)
	bool                                                         bLinearLimitSoft;                                  // 0x90(0x1)
	char                                                         pad0x3_GP6QH[0x3];                                 // 0x91(0x3)
	float                                                        LinearLimitStiffness;                              // 0x94(0x4)
	float                                                        LinearLimitDamping;                                // 0x98(0x4)
	bool                                                         bLinearBreakable;                                  // 0x9c(0x1)
	char                                                         pad0x3_XA17R[0x3];                                 // 0x9d(0x3)
	float                                                        LinearBreakThreshold;                              // 0xa0(0x4)
	byte                                                         AngularSwing1Motion;                               // 0xa4(0x1)
	byte                                                         AngularTwistMotion;                                // 0xa5(0x1)
	byte                                                         AngularSwing2Motion;                               // 0xa6(0x1)
	char                                                         pad0x1_WXUPY[0x1];                                 // 0xa7(0x1)
	bool                                                         bSwingLimitSoft;                                   // 0xa8(0x1)
	bool                                                         bTwistLimitSoft;                                   // 0xa8(0x1)
	char                                                         pad0x3_90TXQ[0x3];                                 // 0xa9(0x3)
	float                                                        Swing1LimitAngle;                                  // 0xac(0x4)
	float                                                        TwistLimitAngle;                                   // 0xb0(0x4)
	float                                                        Swing2LimitAngle;                                  // 0xb4(0x4)
	float                                                        SwingLimitStiffness;                               // 0xb8(0x4)
	float                                                        SwingLimitDamping;                                 // 0xbc(0x4)
	float                                                        TwistLimitStiffness;                               // 0xc0(0x4)
	float                                                        TwistLimitDamping;                                 // 0xc4(0x4)
	struct Rotator                                               AngularRotationOffset;                             // 0xc8(0xc)
	bool                                                         bAngularBreakable;                                 // 0xd4(0x1)
	char                                                         pad0x3_N7UA3[0x3];                                 // 0xd5(0x3)
	float                                                        AngularBreakThreshold;                             // 0xd8(0x4)
	bool                                                         bLinearXPositionDrive;                             // 0xdc(0x1)
	bool                                                         bLinearXVelocityDrive;                             // 0xdc(0x1)
	bool                                                         bLinearYPositionDrive;                             // 0xdc(0x1)
	bool                                                         bLinearYVelocityDrive;                             // 0xdc(0x1)
	bool                                                         bLinearZPositionDrive;                             // 0xdc(0x1)
	bool                                                         bLinearZVelocityDrive;                             // 0xdc(0x1)
	bool                                                         bLinearPositionDrive;                              // 0xdc(0x1)
	bool                                                         bLinearVelocityDrive;                              // 0xdc(0x1)
	char                                                         pad0x3_J3540[0x3];                                 // 0xdd(0x3)
	struct Vector                                                LinearPositionTarget;                              // 0xe0(0xc)
	struct Vector                                                LinearVelocityTarget;                              // 0xec(0xc)
	float                                                        LinearDriveSpring;                                 // 0xf8(0x4)
	float                                                        LinearDriveDamping;                                // 0xfc(0x4)
	float                                                        LinearDriveForceLimit;                             // 0x100(0x4)
	bool                                                         bSwingPositionDrive;                               // 0x104(0x1)
	bool                                                         bSwingVelocityDrive;                               // 0x104(0x1)
	bool                                                         bTwistPositionDrive;                               // 0x104(0x1)
	bool                                                         bTwistVelocityDrive;                               // 0x104(0x1)
	bool                                                         bAngularSlerpDrive;                                // 0x104(0x1)
	bool                                                         bAngularOrientationDrive;                          // 0x104(0x1)
	bool                                                         bEnableSwingDrive;                                 // 0x104(0x1)
	bool                                                         bEnableTwistDrive;                                 // 0x104(0x1)
	bool                                                         bAngularVelocityDrive;                             // 0x105(0x1)
	char                                                         pad0xa_R4HE0[0xa];                                 // 0x106(0xa)
	struct Quat                                                  AngularPositionTarget;                             // 0x110(0x10)
	byte                                                         AngularDriveMode;                                  // 0x120(0x1)
	char                                                         pad0x3_X1ZJP[0x3];                                 // 0x121(0x3)
	struct Rotator                                               AngularOrientationTarget;                          // 0x124(0xc)
	struct Vector                                                AngularVelocityTarget;                             // 0x130(0xc)
	float                                                        AngularDriveSpring;                                // 0x13c(0x4)
	float                                                        AngularDriveDamping;                               // 0x140(0x4)
	float                                                        AngularDriveForceLimit;                            // 0x144(0x4)
	char                                                         pad0x18_XGCCM[0x18];                               // 0x148(0x18)
};


// Size 0x50
struct SmartNameContainer
{
public:
	char                                                         pad0x50_97BJC[0x50];                               // 0x0(0x50)
};


// Size 0x68
struct SmartNameMapping
{
public:
	char                                                         pad0x68_IFYL0[0x68];                               // 0x0(0x68)
};


// Size 0x18
struct AnimSlotGroup
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	TArray<struct FName>                                         SlotNames;                                         // 0x8(0x10)
};


// Size 0x18
struct RigConfiguration
{
public:
	class Rig*                                                   Rig;                                               // 0x0(0x8)
	TArray<struct NameMapping>                                   BoneMappingTable;                                  // 0x8(0x10)
};


// Size 0x10
struct NameMapping
{
public:
	struct FName                                                 NodeName;                                          // 0x0(0x8)
	struct FName                                                 BoneName;                                          // 0x8(0x8)
};


// Size 0x10
struct BoneReductionSetting
{
public:
	TArray<struct FName>                                         BonesToRemove;                                     // 0x0(0x10)
};


// Size 0x18
struct ReferencePose
{
public:
	struct FName                                                 PoseName;                                          // 0x0(0x8)
	TArray<struct Transform>                                     ReferencePose;                                     // 0x8(0x10)
};


// Size 0x1
struct BoneNode
{
public:
	byte                                                         TranslationRetargetingMode;                        // 0x0(0x1)
};


// Size 0x20
struct SkeletonToMeshLinkup
{
public:
	TArray<Int SkeletonToMeshTable>                              SkeletonToMeshTable;                               // 0x0(0x10)
	TArray<Int MeshToSkeletonTable>                              MeshToSkeletonTable;                               // 0x10(0x10)
};


// Size 0x30
struct AnimLinkableElement
{
public:
	char                                                         pad0x8_QYKI2[0x8];                                 // 0x0(0x8)
	class AnimMontage*                                           LinkedMontage;                                     // 0x8(0x8)
	int                                                          SlotIndex;                                         // 0x10(0x4)
	int                                                          SegmentIndex;                                      // 0x14(0x4)
	byte                                                         LinkMethod;                                        // 0x18(0x1)
	byte                                                         CachedLinkMethod;                                  // 0x19(0x1)
	char                                                         pad0x2_ARO28[0x2];                                 // 0x1a(0x2)
	float                                                        SegmentBeginTime;                                  // 0x1c(0x4)
	float                                                        SegmentLength;                                     // 0x20(0x4)
	float                                                        LinkValue;                                         // 0x24(0x4)
	class AnimSequenceBase*                                      LinkedSequence;                                    // 0x28(0x8)
};


// Size 0x28
struct AnimNotifyTrack
{
public:
	struct FName                                                 TrackName;                                         // 0x0(0x8)
	struct LinearColor                                           TrackColor;                                        // 0x8(0x10)
	char                                                         pad0x10_1YA55[0x10];                               // 0x18(0x10)
};


// Size 0xb0
struct AnimNotifyEvent
{
public:
	char                                                         pad0x30_CYSHB[0x30];                               // 0x0(0x30)
	float                                                        DisplayTime;                                       // 0x30(0x4)
	float                                                        TriggerTimeOffset;                                 // 0x34(0x4)
	float                                                        EndTriggerTimeOffset;                              // 0x38(0x4)
	float                                                        TriggerWeightThreshold;                            // 0x3c(0x4)
	struct FName                                                 NotifyName;                                        // 0x40(0x8)
	class AnimNotify*                                            Notify;                                            // 0x48(0x8)
	class AnimNotifyState*                                       NotifyStateClass;                                  // 0x50(0x8)
	class AnimNotifyCondition*                                   NotifyCondition;                                   // 0x58(0x8)
	float                                                        Duration;                                          // 0x60(0x4)
	char                                                         pad0x4_L4JGL[0x4];                                 // 0x64(0x4)
	struct AnimLinkableElement                                   EndLink;                                           // 0x68(0x30)
	bool                                                         bConvertedFromBranchingPoint;                      // 0x98(0x1)
	byte                                                         MontageTickType;                                   // 0x99(0x1)
	char                                                         pad0x2_9UIKW[0x2];                                 // 0x9a(0x2)
	float                                                        NotifyTriggerChance;                               // 0x9c(0x4)
	byte                                                         NotifyFilterType;                                  // 0xa0(0x1)
	char                                                         pad0x3_PMALB[0x3];                                 // 0xa1(0x3)
	int                                                          NotifyFilterLOD;                                   // 0xa4(0x4)
	int                                                          TrackIndex;                                        // 0xa8(0x4)
	char                                                         pad0x4_8N42E[0x4];                                 // 0xac(0x4)
};


// Size 0x10
struct RawCurveTracks
{
public:
	TArray<struct FloatCurve>                                    FloatCurves;                                       // 0x0(0x10)
};


// Size 0x90
struct FloatCurve
{
public:
	char                                                         pad0x18_2QGEJ[0x18];                               // 0x0(0x18)
	struct RichCurve                                             FloatCurve;                                        // 0x18(0x78)
};


// Size 0x18
struct AnimCurveBase
{
public:
	char                                                         pad0x8_I184H[0x8];                                 // 0x0(0x8)
	struct FName                                                 LastObservedName;                                  // 0x8(0x8)
	char                                                         pad0x4_8VPST[0x4];                                 // 0x10(0x4)
	int                                                          CurveTypeFlags;                                    // 0x14(0x4)
};


// Size 0x498
struct TransformCurve
{
public:
	char                                                         pad0x18_M147Y[0x18];                               // 0x0(0x18)
	struct VectorCurve                                           TranslationCurve;                                  // 0x18(0x180)
	struct VectorCurve                                           RotationCurve;                                     // 0x198(0x180)
	struct VectorCurve                                           ScaleCurve;                                        // 0x318(0x180)
};


// Size 0x180
struct VectorCurve
{
public:
	char                                                         pad0x18_MRV7Z[0x18];                               // 0x0(0x18)
	struct RichCurve                                             FloatCurves;                                       // 0x18(0x78)
	char                                                         pad0xf0_7ST7N[0xf0];                               // 0x90(0xf0)
};


// Size 0x50
struct SkeletalMeshComponentPreClothTickFunction
{
public:
	char                                                         pad0x50_ZS1UN[0x50];                               // 0x0(0x50)
};


// Size 0x20
struct SingleAnimationPlayData
{
public:
	class AnimationAsset*                                        AnimToPlay;                                        // 0x0(0x8)
	class VertexAnimation*                                       VertexAnimToPlay;                                  // 0x8(0x8)
	bool                                                         bSavedLooping;                                     // 0x10(0x1)
	bool                                                         bSavedPlaying;                                     // 0x10(0x1)
	char                                                         pad0x3_H1IOH[0x3];                                 // 0x11(0x3)
	float                                                        SavedPosition;                                     // 0x14(0x4)
	float                                                        SavedPlayRate;                                     // 0x18(0x4)
	char                                                         pad0x4_BKWP2[0x4];                                 // 0x1c(0x4)
};


// Size 0x10
struct AnimTrack
{
public:
	TArray<struct AnimSegment>                                   AnimSegments;                                      // 0x0(0x10)
};


// Size 0x20
struct AnimSegment
{
public:
	class AnimSequenceBase*                                      AnimReference;                                     // 0x0(0x8)
	float                                                        StartPos;                                          // 0x8(0x4)
	float                                                        AnimStartTime;                                     // 0xc(0x4)
	float                                                        AnimEndTime;                                       // 0x10(0x4)
	float                                                        AnimPlayRate;                                      // 0x14(0x4)
	int                                                          LoopingCount;                                      // 0x18(0x4)
	char                                                         pad0x4_VGXQ2[0x4];                                 // 0x1c(0x4)
};


// Size 0x10
struct RootMotionExtractionStep
{
public:
	class AnimSequence*                                          AnimSequence;                                      // 0x0(0x8)
	float                                                        StartPosition;                                     // 0x8(0x4)
	float                                                        EndPosition;                                       // 0xc(0x4)
};


// Size 0x30
struct AlphaBlend
{
public:
	byte                                                         BlendOption;                                       // 0x0(0x1)
	char                                                         pad0x3_YI4VV[0x3];                                 // 0x1(0x3)
	float                                                        BeginValue;                                        // 0x4(0x4)
	float                                                        DesiredValue;                                      // 0x8(0x4)
	float                                                        BlendTime;                                         // 0xc(0x4)
	class CurveFloat*                                            CustomCurve;                                       // 0x10(0x8)
	float                                                        AlphaLerp;                                         // 0x18(0x4)
	float                                                        AlphaBlend;                                        // 0x1c(0x4)
	float                                                        AlphaTarget;                                       // 0x20(0x4)
	float                                                        BlendTimeRemaining;                                // 0x24(0x4)
	float                                                        BlendedValue;                                      // 0x28(0x4)
	char                                                         pad0x4_OC4W7[0x4];                                 // 0x2c(0x4)
};


// Size 0x30
struct BakedAnimationStateMachine
{
public:
	struct FName                                                 MachineName;                                       // 0x0(0x8)
	int                                                          InitialState;                                      // 0x8(0x4)
	char                                                         pad0x4_SKM3U[0x4];                                 // 0xc(0x4)
	TArray<struct BakedAnimationState>                           States;                                            // 0x10(0x10)
	TArray<struct AnimationTransitionBetweenStates>              Transitions;                                       // 0x20(0x10)
};


// Size 0x38
struct AnimationTransitionBetweenStates
{
public:
	char                                                         pad0x8_HJ22F[0x8];                                 // 0x0(0x8)
	int                                                          PreviousState;                                     // 0x8(0x4)
	int                                                          NextState;                                         // 0xc(0x4)
	float                                                        CrossfadeDuration;                                 // 0x10(0x4)
	int                                                          StartNotify;                                       // 0x14(0x4)
	int                                                          EndNotify;                                         // 0x18(0x4)
	int                                                          InterruptNotify;                                   // 0x1c(0x4)
	byte                                                         BlendMode;                                         // 0x20(0x1)
	char                                                         pad0x7_MMQUF[0x7];                                 // 0x21(0x7)
	class CurveFloat*                                            CustomCurve;                                       // 0x28(0x8)
	byte                                                         LogicType;                                         // 0x30(0x1)
	char                                                         pad0x7_DWMZ0[0x7];                                 // 0x31(0x7)
};


// Size 0x8
struct AnimationStateBase
{
public:
	struct FName                                                 StateName;                                         // 0x0(0x8)
};


// Size 0x50
struct BakedAnimationState
{
public:
	struct FName                                                 StateName;                                         // 0x0(0x8)
	struct FName                                                 PathedStateName;                                   // 0x8(0x8)
	TArray<struct BakedStateExitTransition>                      Transitions;                                       // 0x10(0x10)
	int                                                          StateRootNodeIndex;                                // 0x20(0x4)
	int                                                          StartNotify;                                       // 0x24(0x4)
	int                                                          EndNotify;                                         // 0x28(0x4)
	int                                                          FullyBlendedNotify;                                // 0x2c(0x4)
	bool                                                         bIsAConduit;                                       // 0x30(0x1)
	char                                                         pad0x3_S8DLH[0x3];                                 // 0x31(0x3)
	int                                                          EntryRuleNodeIndex;                                // 0x34(0x4)
	TArray<Int PlayerNodeIndices>                                PlayerNodeIndices;                                 // 0x38(0x10)
	bool                                                         CanBeReEntered;                                    // 0x48(0x1)
	char                                                         pad0x7_36A9Q[0x7];                                 // 0x49(0x7)
};


// Size 0x20
struct BakedStateExitTransition
{
public:
	int                                                          CanTakeDelegateIndex;                              // 0x0(0x4)
	int                                                          CustomResultNodeIndex;                             // 0x4(0x4)
	int                                                          TransitionIndex;                                   // 0x8(0x4)
	bool                                                         bDesiredTransitionReturnValue;                     // 0xc(0x1)
	bool                                                         bAutomaticRemainingTimeRule;                       // 0xd(0x1)
	char                                                         pad0x2_45I30[0x2];                                 // 0xe(0x2)
	TArray<Int PoseEvaluatorLinks>                               PoseEvaluatorLinks;                                // 0x10(0x10)
};


// Size 0x28
struct AnimationState
{
public:
	char                                                         pad0x8_0C9SW[0x8];                                 // 0x0(0x8)
	TArray<struct AnimationTransitionRule>                       Transitions;                                       // 0x8(0x10)
	int                                                          StateRootNodeIndex;                                // 0x18(0x4)
	int                                                          StartNotify;                                       // 0x1c(0x4)
	int                                                          EndNotify;                                         // 0x20(0x4)
	int                                                          FullyBlendedNotify;                                // 0x24(0x4)
};


// Size 0x10
struct AnimationTransitionRule
{
public:
	struct FName                                                 RuleToExecute;                                     // 0x0(0x8)
	bool                                                         TransitionReturnVal;                               // 0x8(0x1)
	char                                                         pad0x3_0WJJR[0x3];                                 // 0x9(0x3)
	int                                                          TransitionIndex;                                   // 0xc(0x4)
};


// Size 0x48
struct SlotEvaluationPose
{
public:
	byte                                                         AdditiveType;                                      // 0x0(0x1)
	char                                                         pad0x3_5NK2G[0x3];                                 // 0x1(0x3)
	float                                                        Weight;                                            // 0x4(0x4)
	char                                                         pad0x40_JZVBW[0x40];                               // 0x8(0x40)
};


// Size 0x10
struct PerBoneBlendWeights
{
public:
	TArray<struct PerBoneBlendWeight>                            BoneBlendWeights;                                  // 0x0(0x10)
};


// Size 0x8
struct PerBoneBlendWeight
{
public:
	int                                                          SourceIndex;                                       // 0x0(0x4)
	float                                                        BlendWeight;                                       // 0x4(0x4)
};


// Size 0x28
struct A2CSPose
{
public:
	char                                                         pad0x18_KC7Z9[0x18];                               // 0x0(0x18)
	TArray<Byte ComponentSpaceFlags>                             ComponentSpaceFlags;                               // 0x18(0x10)
};


// Size 0x10
struct A2Pose
{
public:
	TArray<struct Transform>                                     Bones;                                             // 0x0(0x10)
};


// Size 0xa0
struct AnimMontageInstance
{
public:
	class AnimMontage*                                           Montage;                                           // 0x0(0x8)
	float                                                        DesiredWeight;                                     // 0x8(0x4)
	float                                                        Weight;                                            // 0xc(0x4)
	float                                                        BlendTime;                                         // 0x10(0x4)
	float                                                        DefaultBlendTimeMultiplier;                        // 0x14(0x4)
	TArray<Int NextSections>                                     NextSections;                                      // 0x18(0x10)
	TArray<Int PrevSections>                                     PrevSections;                                      // 0x28(0x10)
	bool                                                         bPlaying;                                          // 0x38(0x1)
	char                                                         pad0x2f_RNYS6[0x2f];                               // 0x39(0x2f)
	TArray<struct AnimNotifyEvent>                               ActiveStateBranchingPoints;                        // 0x68(0x10)
	float                                                        Position;                                          // 0x78(0x4)
	float                                                        PlayRate;                                          // 0x7c(0x4)
	char                                                         pad0x20_CNQSS[0x20];                               // 0x80(0x20)
};


// Size 0xc
struct BranchingPointMarker
{
public:
	int                                                          NotifyIndex;                                       // 0x0(0x4)
	float                                                        TriggerTime;                                       // 0x4(0x4)
	byte                                                         NotifyEventType;                                   // 0x8(0x1)
	char                                                         pad0x3_S56ZA[0x3];                                 // 0x9(0x3)
};


// Size 0x40
struct BranchingPoint
{
public:
	char                                                         pad0x30_HQN6H[0x30];                               // 0x0(0x30)
	struct FName                                                 EventName;                                         // 0x30(0x8)
	float                                                        DisplayTime;                                       // 0x38(0x4)
	float                                                        TriggerTimeOffset;                                 // 0x3c(0x4)
};


// Size 0x18
struct SlotAnimationTrack
{
public:
	struct FName                                                 SlotName;                                          // 0x0(0x8)
	struct AnimTrack                                             AnimTrack;                                         // 0x8(0x10)
};


// Size 0x58
struct CompositeSection
{
public:
	char                                                         pad0x30_B93WS[0x30];                               // 0x0(0x30)
	struct FName                                                 SectionName;                                       // 0x30(0x8)
	float                                                        StartTime;                                         // 0x38(0x4)
	struct FName                                                 NextSectionName;                                   // 0x3c(0x8)
	char                                                         pad0x4_GN9WB[0x4];                                 // 0x44(0x4)
	TArray<class AnimMetaData*>                                  MetaData;                                          // 0x48(0x10)
};


// Size 0x4
struct NavAvoidanceMask
{
public:
	bool                                                         bGroup0;                                           // 0x0(0x1)
	bool                                                         bGroup1;                                           // 0x0(0x1)
	bool                                                         bGroup2;                                           // 0x0(0x1)
	bool                                                         bGroup3;                                           // 0x0(0x1)
	bool                                                         bGroup4;                                           // 0x0(0x1)
	bool                                                         bGroup5;                                           // 0x0(0x1)
	bool                                                         bGroup6;                                           // 0x0(0x1)
	bool                                                         bGroup7;                                           // 0x0(0x1)
	bool                                                         bGroup8;                                           // 0x1(0x1)
	bool                                                         bGroup9;                                           // 0x1(0x1)
	bool                                                         bGroup10;                                          // 0x1(0x1)
	bool                                                         bGroup11;                                          // 0x1(0x1)
	bool                                                         bGroup12;                                          // 0x1(0x1)
	bool                                                         bGroup13;                                          // 0x1(0x1)
	bool                                                         bGroup14;                                          // 0x1(0x1)
	bool                                                         bGroup15;                                          // 0x1(0x1)
	bool                                                         bGroup16;                                          // 0x2(0x1)
	bool                                                         bGroup17;                                          // 0x2(0x1)
	bool                                                         bGroup18;                                          // 0x2(0x1)
	bool                                                         bGroup19;                                          // 0x2(0x1)
	bool                                                         bGroup20;                                          // 0x2(0x1)
	bool                                                         bGroup21;                                          // 0x2(0x1)
	bool                                                         bGroup22;                                          // 0x2(0x1)
	bool                                                         bGroup23;                                          // 0x2(0x1)
	bool                                                         bGroup24;                                          // 0x3(0x1)
	bool                                                         bGroup25;                                          // 0x3(0x1)
	bool                                                         bGroup26;                                          // 0x3(0x1)
	bool                                                         bGroup27;                                          // 0x3(0x1)
	bool                                                         bGroup28;                                          // 0x3(0x1)
	bool                                                         bGroup29;                                          // 0x3(0x1)
	bool                                                         bGroup30;                                          // 0x3(0x1)
	bool                                                         bGroup31;                                          // 0x3(0x1)
};


// Size 0x50
struct CharacterMovementComponentPreClothTickFunction
{
public:
	char                                                         pad0x50_7TFJW[0x50];                               // 0x0(0x50)
};


// Size 0x8c
struct FindFloorResult
{
public:
	bool                                                         bBlockingHit;                                      // 0x0(0x1)
	bool                                                         bWalkableFloor;                                    // 0x0(0x1)
	bool                                                         bLineTrace;                                        // 0x0(0x1)
	char                                                         pad0x3_AO5X0[0x3];                                 // 0x1(0x3)
	float                                                        FloorDist;                                         // 0x4(0x4)
	float                                                        LineDist;                                          // 0x8(0x4)
	struct HitResult                                             HitResult;                                         // 0xc(0x80)
};


// Size 0x2c
struct AtmospherePrecomputeParameters
{
public:
	float                                                        DensityHeight;                                     // 0x0(0x4)
	float                                                        DecayHeight;                                       // 0x4(0x4)
	int                                                          MaxScatteringOrder;                                // 0x8(0x4)
	int                                                          TransmittanceTexWidth;                             // 0xc(0x4)
	int                                                          TransmittanceTexHeight;                            // 0x10(0x4)
	int                                                          IrradianceTexWidth;                                // 0x14(0x4)
	int                                                          IrradianceTexHeight;                               // 0x18(0x4)
	int                                                          InscatterAltitudeSampleNum;                        // 0x1c(0x4)
	int                                                          InscatterMuNum;                                    // 0x20(0x4)
	int                                                          InscatterMuSNum;                                   // 0x24(0x4)
	int                                                          InscatterNuNum;                                    // 0x28(0x4)
};


// Size 0xc0
struct AttenuationSettings
{
public:
	bool                                                         bAttenuate;                                        // 0x0(0x1)
	bool                                                         bSpatialize;                                       // 0x0(0x1)
	bool                                                         bAttenuateWithLPF;                                 // 0x0(0x1)
	char                                                         pad0x3_31DCC[0x3];                                 // 0x1(0x3)
	byte                                                         DistanceAlgorithm;                                 // 0x4(0x1)
	char                                                         pad0x3_EXWNL[0x3];                                 // 0x5(0x3)
	struct RuntimeFloatCurve                                     CustomAttenuationCurve;                            // 0x8(0x80)
	byte                                                         DistanceType;                                      // 0x88(0x1)
	byte                                                         AttenuationShape;                                  // 0x89(0x1)
	char                                                         pad0x2_39RBK[0x2];                                 // 0x8a(0x2)
	float                                                        dBAttenuationAtMax;                                // 0x8c(0x4)
	float                                                        OmniRadius;                                        // 0x90(0x4)
	byte                                                         SpatializationAlgorithm;                           // 0x94(0x1)
	char                                                         pad0x3_CBEFR[0x3];                                 // 0x95(0x3)
	float                                                        RadiusMin;                                         // 0x98(0x4)
	float                                                        RadiusMax;                                         // 0x9c(0x4)
	struct Vector                                                AttenuationShapeExtents;                           // 0xa0(0xc)
	float                                                        ConeOffset;                                        // 0xac(0x4)
	float                                                        FalloffDistance;                                   // 0xb0(0x4)
	float                                                        LPFRadiusMin;                                      // 0xb4(0x4)
	float                                                        LPFRadiusMax;                                      // 0xb8(0x4)
	char                                                         pad0x4_KO00U[0x4];                                 // 0xbc(0x4)
};


// Size 0x20
struct AudioComponentParam
{
public:
	struct FName                                                 ParamName;                                         // 0x0(0x8)
	float                                                        FloatParam;                                        // 0x8(0x4)
	bool                                                         BoolParam;                                         // 0xc(0x1)
	char                                                         pad0x3_91WK7[0x3];                                 // 0xd(0x3)
	int                                                          IntParam;                                          // 0x10(0x4)
	char                                                         pad0x4_AR80W[0x4];                                 // 0x14(0x4)
	class SoundWave*                                             SoundWaveParam;                                    // 0x18(0x8)
};


// Size 0x130
struct FogVolumeInfo
{
public:
	class FogVolumeComponent*                                    Component;                                         // 0x0(0x8)
	char                                                         pad0xf8_8TJLA[0xf8];                               // 0x8(0xf8)
	class Texture*                                               VolumeTexture;                                     // 0x100(0x8)
	class Texture*                                               MeshFogVolumeTexture;                              // 0x108(0x8)
	char                                                         pad0x20_SO7U9[0x20];                               // 0x110(0x20)
};


// Size 0x30
struct WaterSimPlane
{
public:
	class UClass*                                                WaterId;                                           // 0x0(0x8)
	class Object*                                                WaterOwner;                                        // 0x8(0x8)
	struct Plane                                                 NonFFTPlane;                                       // 0x10(0x10)
	bool                                                         bUseFFT;                                           // 0x20(0x1)
	bool                                                         bActive;                                           // 0x21(0x1)
	char                                                         pad0x2_55BFY[0x2];                                 // 0x22(0x2)
	float                                                        FFTBasePlaneHeight;                                // 0x24(0x4)
	char                                                         pad0x8_4YN5Q[0x8];                                 // 0x28(0x8)
};


// Size 0x20
struct MurkyRegion
{
public:
	bool                                                         Enabled;                                           // 0x0(0x1)
	char                                                         pad0x3_NRIAF[0x3];                                 // 0x1(0x3)
	struct Vector                                                Position;                                          // 0x4(0xc)
	float                                                        InnerRadius;                                       // 0x10(0x4)
	float                                                        OuterRadius;                                       // 0x14(0x4)
	float                                                        Density;                                           // 0x18(0x4)
	bool                                                         IsSuperHeatedWater;                                // 0x1c(0x1)
	char                                                         pad0x3_IHN0G[0x3];                                 // 0x1d(0x3)
};


// Size 0x310
struct FFTWaterComponentParams
{
public:
	struct LinearColor                                           AmbientColour;                                     // 0x0(0x10)
	struct LinearColor                                           WaterColour;                                       // 0x10(0x10)
	struct LinearColor                                           ShallowWaterColour;                                // 0x20(0x10)
	struct LinearColor                                           BackLitColour;                                     // 0x30(0x10)
	struct LinearColor                                           FoamColour;                                        // 0x40(0x10)
	struct LinearColor                                           FoamHighlightColour;                               // 0x50(0x10)
	float                                                        FresnelPower;                                      // 0x60(0x4)
	float                                                        SpecularBrightness;                                // 0x64(0x4)
	float                                                        FoamBrightness;                                    // 0x68(0x4)
	float                                                        ReflectionBrightness;                              // 0x6c(0x4)
	float                                                        FoamFadeStart;                                     // 0x70(0x4)
	float                                                        FoamFadeEnd;                                       // 0x74(0x4)
	bool                                                         DEBUG_Wireframe;                                   // 0x78(0x1)
	char                                                         pad0x3_BBY1L[0x3];                                 // 0x79(0x3)
	float                                                        Size;                                              // 0x7c(0x4)
	float                                                        WindSpeed;                                         // 0x80(0x4)
	float                                                        WindSpeedInEditor;                                 // 0x84(0x4)
	float                                                        CarrierWaveAmplitude;                              // 0x88(0x4)
	float                                                        CarrierWaveWaveLength;                             // 0x8c(0x4)
	float                                                        CarrierWavePropagationSpeed;                       // 0x90(0x4)
	float                                                        HorizonFadeDistance;                               // 0x94(0x4)
	float                                                        HorizonDarkenStart;                                // 0x98(0x4)
	float                                                        HorizonDarkenRange;                                // 0x9c(0x4)
	float                                                        CloudShadowDarkenStart;                            // 0xa0(0x4)
	float                                                        CloudShadowDarkenRange;                            // 0xa4(0x4)
	float                                                        CausticsDepth;                                     // 0xa8(0x4)
	char                                                         pad0x4_NYF3N[0x4];                                 // 0xac(0x4)
	class Texture*                                               FoamColourTex;                                     // 0xb0(0x8)
	struct FFTWaterComponentParticleParams                       ParticleParams;                                    // 0xb8(0x248)
	float                                                        ExtendedPlaneSize;                                 // 0x300(0x4)
	float                                                        ExtendedPlaneFadeDistance;                         // 0x304(0x4)
	struct Vector2D                                              PositionOffset;                                    // 0x308(0x8)
};


// Size 0x248
struct FFTWaterComponentParticleParams
{
public:
	int                                                          MaxParticlesPerFrame;                              // 0x0(0x4)
	char                                                         pad0x4_4E2Q3[0x4];                                 // 0x4(0x4)
	struct FFTWaterComponentWaveParticleType                     WaveParticles;                                     // 0x8(0x38)
	char                                                         pad0xa8_SAFD3[0xa8];                               // 0x40(0xa8)
	struct FFTWaterComponentIntersectParticleType                IntersectionParticles;                             // 0xe8(0x58)
	char                                                         pad0x108_F8PCG[0x108];                             // 0x140(0x108)
};


// Size 0x58
struct FFTWaterComponentIntersectParticleType
{
public:
	struct Vector2D                                              VelocityRange;                                     // 0x0(0x8)
	struct Vector2D                                              FoamRange;                                         // 0x8(0x8)
	struct Vector2D                                              HeightRange;                                       // 0x10(0x8)
	struct Vector2D                                              ParticleWaveVelocityRange;                         // 0x18(0x8)
	struct Vector2D                                              ParticleWaveAbsoluteSpeedDifferenceRange;          // 0x20(0x8)
	float                                                        Density;                                           // 0x28(0x4)
	float                                                        VolumeHorizontalVelocityWeight;                    // 0x2c(0x4)
	float                                                        HorizontalDirectionFromVolumeWeight;               // 0x30(0x4)
	float                                                        HorizontalRandomVelocityWeight;                    // 0x34(0x4)
	float                                                        VolumeVerticalVelocityWeight;                      // 0x38(0x4)
	float                                                        VerticalRandomVelocityWeight;                      // 0x3c(0x4)
	float                                                        WaterVelocityWeight;                               // 0x40(0x4)
	float                                                        VelocityScaling;                                   // 0x44(0x4)
	bool                                                         UnderwaterParticles;                               // 0x48(0x1)
	char                                                         pad0x7_0D2EF[0x7];                                 // 0x49(0x7)
	class ParticleComputeShaderData*                             ParticleComputeShaderData;                         // 0x50(0x8)
};


// Size 0x38
struct FFTWaterComponentWaveParticleType
{
public:
	struct Vector2D                                              SpawnRadiusRange;                                  // 0x0(0x8)
	struct Vector2D                                              FoamRange;                                         // 0x8(0x8)
	struct Vector2D                                              HeightRange;                                       // 0x10(0x8)
	struct Vector2D                                              AngleRange;                                        // 0x18(0x8)
	struct Vector2D                                              CalmWaterDampeningFactorRange;                     // 0x20(0x8)
	float                                                        Density;                                           // 0x28(0x4)
	char                                                         pad0x4_ZUNW3[0x4];                                 // 0x2c(0x4)
	class ParticleComputeShaderData*                             ParticleComputeShaderData;                         // 0x30(0x8)
};


// Size 0x28
struct BatchedPoint
{
public:
	struct Vector                                                Position;                                          // 0x0(0xc)
	struct LinearColor                                           Color;                                             // 0xc(0x10)
	float                                                        PointSize;                                         // 0x1c(0x4)
	float                                                        RemainingLifeTime;                                 // 0x20(0x4)
	byte                                                         DepthPriority;                                     // 0x24(0x1)
	char                                                         pad0x3_N56GM[0x3];                                 // 0x25(0x3)
};


// Size 0x34
struct BatchedLine
{
public:
	struct Vector                                                Start;                                             // 0x0(0xc)
	struct Vector                                                End;                                               // 0xc(0xc)
	struct LinearColor                                           Color;                                             // 0x18(0x10)
	float                                                        Thickness;                                         // 0x28(0x4)
	float                                                        RemainingLifeTime;                                 // 0x2c(0x4)
	byte                                                         DepthPriority;                                     // 0x30(0x1)
	char                                                         pad0x3_QNH6B[0x3];                                 // 0x31(0x3)
};


// Size 0x28
struct MaterialSpriteElement
{
public:
	class MaterialInterface*                                     Material;                                          // 0x0(0x8)
	class CurveFloat*                                            DistanceToOpacityCurve;                            // 0x8(0x8)
	bool                                                         bSizeIsInScreenSpace;                              // 0x10(0x1)
	char                                                         pad0x3_YUZ68[0x3];                                 // 0x11(0x3)
	float                                                        BaseSizeX;                                         // 0x14(0x4)
	float                                                        BaseSizeY;                                         // 0x18(0x4)
	char                                                         pad0x4_9X4FX[0x4];                                 // 0x1c(0x4)
	class CurveFloat*                                            DistanceToSizeCurve;                               // 0x20(0x8)
};


// Size 0x18
struct CustomProfile
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	TArray<struct ResponseChannel>                               CustomResponses;                                   // 0x8(0x10)
};


// Size 0x10
struct CustomChannelSetup
{
public:
	byte                                                         Channel;                                           // 0x0(0x1)
	char                                                         pad0x3_7JV5I[0x3];                                 // 0x1(0x3)
	struct FName                                                 Name;                                              // 0x4(0x8)
	byte                                                         DefaultResponse;                                   // 0xc(0x1)
	bool                                                         bTraceType;                                        // 0xd(0x1)
	bool                                                         bStaticObject;                                     // 0xe(0x1)
	char                                                         pad0x1_IXBKI[0x1];                                 // 0xf(0x1)
};


// Size 0x60
struct CollisionResponseTemplate
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	byte                                                         CollisionEnabled;                                  // 0x8(0x1)
	char                                                         pad0x3_KGP38[0x3];                                 // 0x9(0x3)
	struct FName                                                 ObjectTypeName;                                    // 0xc(0x8)
	char                                                         pad0x4_CYV34[0x4];                                 // 0x14(0x4)
	TArray<struct ResponseChannel>                               CustomResponses;                                   // 0x18(0x10)
	struct FString                                               HelpMessage;                                       // 0x28(0x10)
	bool                                                         bCanModify;                                        // 0x38(0x1)
	char                                                         pad0x27_MK29M[0x27];                               // 0x39(0x27)
};


// Size 0x28
struct AssetEditorOrbitCameraPosition
{
public:
	bool                                                         bIsSet;                                            // 0x0(0x1)
	char                                                         pad0x3_KTSGQ[0x3];                                 // 0x1(0x3)
	struct Vector                                                CamOrbitPoint;                                     // 0x4(0xc)
	struct Vector                                                CamOrbitZoom;                                      // 0x10(0xc)
	struct Rotator                                               CamOrbitRotation;                                  // 0x1c(0xc)
};


// Size 0x50
struct MeshSectionInfoMap
{
public:
	char                                                         pad0x50_2L3RR[0x50];                               // 0x0(0x50)
};


// Size 0x8
struct MeshSectionInfo
{
public:
	int                                                          MaterialIndex;                                     // 0x0(0x4)
	bool                                                         bEnableCollision;                                  // 0x4(0x1)
	bool                                                         bCastShadow;                                       // 0x5(0x1)
	char                                                         pad0x2_HQPMX[0x2];                                 // 0x6(0x2)
};


// Size 0xf8
struct StaticMeshSourceModel
{
public:
	struct MeshBuildSettings                                     BuildSettings;                                     // 0x0(0x40)
	struct MeshReductionSettings                                 ReductionSettings;                                 // 0x40(0x58)
	struct SimplygonRemeshingSettings                            RemeshingSettings;                                 // 0x98(0x50)
	int                                                          OverriddenLightMapRes;                             // 0xe8(0x4)
	float                                                        LODDistance;                                       // 0xec(0x4)
	float                                                        ScreenSize;                                        // 0xf0(0x4)
	float                                                        MaxDeviation;                                      // 0xf4(0x4)
};


// Size 0x1c
struct StaticMeshOptimizationSettings
{
public:
	byte                                                         ReductionMethod;                                   // 0x0(0x1)
	char                                                         pad0x3_6A23Z[0x3];                                 // 0x1(0x3)
	float                                                        NumOfTrianglesPercentage;                          // 0x4(0x4)
	float                                                        MaxDeviationPercentage;                            // 0x8(0x4)
	float                                                        WeldingThreshold;                                  // 0xc(0x4)
	bool                                                         bRecalcNormals;                                    // 0x10(0x1)
	char                                                         pad0x3_V04UU[0x3];                                 // 0x11(0x3)
	float                                                        NormalsThreshold;                                  // 0x14(0x4)
	byte                                                         SilhouetteImportance;                              // 0x18(0x1)
	byte                                                         TextureImportance;                                 // 0x19(0x1)
	byte                                                         ShadingImportance;                                 // 0x1a(0x1)
	char                                                         pad0x1_HXH2Y[0x1];                                 // 0x1b(0x1)
};


// Size 0x40
struct MergedCollisionComponentStaticMeshInstanceData
{
public:
	struct Transform                                             RelativeTransform;                                 // 0x0(0x30)
	class StaticMesh*                                            StaticMesh;                                        // 0x30(0x8)
	int                                                          OwningActorCrc32;                                  // 0x38(0x4)
	char                                                         pad0x4_GB0EH[0x4];                                 // 0x3c(0x4)
};


// Size 0x28
struct StaticMeshComponentLODInfo
{
public:
	char                                                         pad0x10_PJSR2[0x10];                               // 0x0(0x10)
	TArray<struct PaintedVertex>                                 PaintedVertices;                                   // 0x10(0x10)
	char                                                         pad0x8_LX2RF[0x8];                                 // 0x20(0x8)
};


// Size 0x14
struct PaintedVertex
{
public:
	struct Vector                                                Position;                                          // 0x0(0xc)
	struct PackedNormal                                          Normal;                                            // 0xc(0x4)
	struct Color                                                 Color;                                             // 0x10(0x4)
};


// Size 0x28
struct TexturePlatformData
{
public:
	char                                                         pad0x28_HEAE7[0x28];                               // 0x0(0x28)
};


// Size 0x80
struct TextureSource
{
public:
	char                                                         pad0x80_LZROR[0x80];                               // 0x0(0x80)
};


// Size 0x28
struct ExternalMip
{
public:
	char                                                         pad0x28_HR8KZ[0x28];                               // 0x0(0x28)
};


// Size 0x18
struct FlatWaterMeshTextureOverride
{
public:
	char                                                         pad0x10_Z4K1U[0x10];                               // 0x0(0x10)
	class Texture*                                               Texture;                                           // 0x10(0x8)
};


// Size 0xc
struct NameIndexPair
{
public:
	char                                                         pad0xc_JEK6M[0xc];                                 // 0x0(0xc)
};


// Size 0x8
struct InstancedCoverageMeshLOD
{
public:
	float                                                        LODReduction;                                      // 0x0(0x4)
	float                                                        DistanceToLOD;                                     // 0x4(0x4)
};


// Size 0x8
struct InstancedStaticMeshMappingInfo
{
public:
	char                                                         pad0x8_T9V5X[0x8];                                 // 0x0(0x8)
};


// Size 0x50
struct InstancedStaticMeshInstanceData
{
public:
	struct Matrix                                                Transform;                                         // 0x0(0x40)
	struct Vector2D                                              LightmapUVBias;                                    // 0x40(0x8)
	struct Vector2D                                              ShadowmapUVBias;                                   // 0x48(0x8)
};


// Size 0x28
struct ClusterNode
{
public:
	struct Vector                                                BoundMin;                                          // 0x0(0xc)
	int                                                          FirstChild;                                        // 0xc(0x4)
	struct Vector                                                BoundMax;                                          // 0x10(0xc)
	int                                                          LastChild;                                         // 0x1c(0x4)
	int                                                          FirstInstance;                                     // 0x20(0x4)
	int                                                          LastInstance;                                      // 0x24(0x4)
};


// Size 0x8
struct MobileInstancedStaticMeshLOD
{
public:
	float                                                        LODReduction;                                      // 0x0(0x4)
	float                                                        DistanceToLOD;                                     // 0x4(0x4)
};


// Size 0x58
struct SplineMeshParams
{
public:
	struct Vector                                                StartPos;                                          // 0x0(0xc)
	struct Vector                                                StartTangent;                                      // 0xc(0xc)
	struct Vector2D                                              StartScale;                                        // 0x18(0x8)
	float                                                        StartRoll;                                         // 0x20(0x4)
	struct Vector2D                                              StartOffset;                                       // 0x24(0x8)
	struct Vector                                                EndPos;                                            // 0x2c(0xc)
	struct Vector                                                EndTangent;                                        // 0x38(0xc)
	struct Vector2D                                              EndScale;                                          // 0x44(0x8)
	float                                                        EndRoll;                                           // 0x4c(0x4)
	struct Vector2D                                              EndOffset;                                         // 0x50(0x8)
};


// Size 0x18
struct EngineShowFlagsSetting
{
public:
	struct FString                                               ShowFlagName;                                      // 0x0(0x10)
	bool                                                         Enabled;                                           // 0x10(0x1)
	char                                                         pad0x7_JPNKE[0x7];                                 // 0x11(0x7)
};


// Size 0x98
struct Timeline
{
public:
	byte                                                         LengthMode;                                        // 0x0(0x1)
	char                                                         pad0x3_HNIQW[0x3];                                 // 0x1(0x3)
	float                                                        Length;                                            // 0x4(0x4)
	bool                                                         bLooping;                                          // 0x8(0x1)
	bool                                                         bReversePlayback;                                  // 0x8(0x1)
	bool                                                         bPlaying;                                          // 0x8(0x1)
	char                                                         pad0x3_Q70DY[0x3];                                 // 0x9(0x3)
	float                                                        PlayRate;                                          // 0xc(0x4)
	float                                                        Position;                                          // 0x10(0x4)
	char                                                         pad0x4_OBZJY[0x4];                                 // 0x14(0x4)
	TArray<struct TimelineEventEntry>                            Events;                                            // 0x18(0x10)
	TArray<struct TimelineVectorTrack>                           InterpVectors;                                     // 0x28(0x10)
	TArray<struct TimelineFloatTrack>                            InterpFloats;                                      // 0x38(0x10)
	TArray<struct TimelineLinearColorTrack>                      InterpLinearColors;                                // 0x48(0x10)
	struct FName                                                 DirectionPropertyName;                             // 0x88(0x8)
	class ByteProperty*                                          DirectionProperty;                                 // 0x90(0x8)
};


// Size 0x30
struct TimelineLinearColorTrack
{
public:
	class CurveLinearColor*                                      LinearColorCurve;                                  // 0x0(0x8)
	struct FName                                                 LinearColorPropertyName;                           // 0x18(0x8)
	class StructProperty*                                        LinearColorProperty;                               // 0x20(0x8)
	char                                                         pad0x8_SVSM0[0x8];                                 // 0x28(0x8)
};


// Size 0x30
struct TimelineFloatTrack
{
public:
	class CurveFloat*                                            FloatCurve;                                        // 0x0(0x8)
	struct FName                                                 FloatPropertyName;                                 // 0x18(0x8)
	class FloatProperty*                                         FloatProperty;                                     // 0x20(0x8)
	char                                                         pad0x8_GNUKV[0x8];                                 // 0x28(0x8)
};


// Size 0x30
struct TimelineVectorTrack
{
public:
	class CurveVector*                                           VectorCurve;                                       // 0x0(0x8)
	struct FName                                                 VectorPropertyName;                                // 0x18(0x8)
	class StructProperty*                                        VectorProperty;                                    // 0x20(0x8)
	char                                                         pad0x8_6EAF4[0x8];                                 // 0x28(0x8)
};


// Size 0x14
struct TimelineEventEntry
{
public:
	float                                                        Time;                                              // 0x0(0x4)
	char                                                         pad0x10_O7EXX[0x10];                               // 0x4(0x10)
};


// Size 0x18
struct CompressedOffsetData
{
public:
	TArray<Int OffsetData>                                       OffsetData;                                        // 0x0(0x10)
	int                                                          StripSize;                                         // 0x10(0x4)
	char                                                         pad0x4_1KJRG[0x4];                                 // 0x14(0x4)
};


// Size 0x38
struct CompressedTrack
{
public:
	TArray<Byte ByteStream>                                      ByteStream;                                        // 0x0(0x10)
	TArray<Float Times>                                          Times;                                             // 0x10(0x10)
	float                                                        Mins;                                              // 0x20(0x4)
	char                                                         pad0x8_OVKKX[0x8];                                 // 0x24(0x8)
	float                                                        Ranges;                                            // 0x2c(0x4)
	char                                                         pad0x8_U8HCG[0x8];                                 // 0x30(0x8)
};


// Size 0x18
struct CurveTrack
{
public:
	struct FName                                                 CurveName;                                         // 0x0(0x8)
	TArray<Float CurveWeights>                                   CurveWeights;                                      // 0x8(0x10)
};


// Size 0x20
struct ScaleTrack
{
public:
	TArray<struct Vector>                                        ScaleKeys;                                         // 0x0(0x10)
	TArray<Float Times>                                          Times;                                             // 0x10(0x10)
};


// Size 0x20
struct RotationTrack
{
public:
	TArray<struct Quat>                                          RotKeys;                                           // 0x0(0x10)
	TArray<Float Times>                                          Times;                                             // 0x10(0x10)
};


// Size 0x20
struct TranslationTrack
{
public:
	TArray<struct Vector>                                        PosKeys;                                           // 0x0(0x10)
	TArray<Float Times>                                          Times;                                             // 0x10(0x10)
};


// Size 0x4
struct TrackToSkeletonMap
{
public:
	int                                                          BoneTreeIndex;                                     // 0x0(0x4)
};


// Size 0x20
struct AnimSequenceTrackContainer
{
public:
	TArray<struct RawAnimSequenceTrack>                          AnimationTracks;                                   // 0x0(0x10)
	TArray<struct FName>                                         TrackNames;                                        // 0x10(0x10)
};


// Size 0x30
struct RawAnimSequenceTrack
{
public:
	TArray<struct Vector>                                        PosKeys;                                           // 0x0(0x10)
	TArray<struct Quat>                                          RotKeys;                                           // 0x10(0x10)
	TArray<struct Vector>                                        ScaleKeys;                                         // 0x20(0x10)
};


// Size 0x10
struct PerBoneInterpolation
{
public:
	struct BoneReference                                         BoneReference;                                     // 0x0(0xc)
	float                                                        InterpolationSpeedPerSec;                          // 0xc(0x4)
};


// Size 0x1c
struct GridBlendSample
{
public:
	struct EditorElement                                         GridElement;                                       // 0x0(0x18)
	float                                                        BlendWeight;                                       // 0x18(0x4)
};


// Size 0x18
struct EditorElement
{
public:
	int                                                          Indices;                                           // 0x0(0x4)
	char                                                         pad0x8_HU83M[0x8];                                 // 0x4(0x8)
	float                                                        Weights;                                           // 0xc(0x4)
	char                                                         pad0x8_EL73L[0x8];                                 // 0x10(0x8)
};


// Size 0x18
struct BlendSample
{
public:
	class AnimSequence*                                          Animation;                                         // 0x0(0x8)
	struct Vector                                                SampleValue;                                       // 0x8(0xc)
	char                                                         pad0x4_JUFOA[0x4];                                 // 0x14(0x4)
};


// Size 0x20
struct BlendParameter
{
public:
	struct FString                                               DisplayName;                                       // 0x0(0x10)
	float                                                        Min;                                               // 0x10(0x4)
	float                                                        Max;                                               // 0x14(0x4)
	int                                                          GridNum;                                           // 0x18(0x4)
	char                                                         pad0x4_ECSLR[0x4];                                 // 0x1c(0x4)
};


// Size 0x8
struct InterpolationParameter
{
public:
	float                                                        InterpolationTime;                                 // 0x0(0x4)
	byte                                                         InterpolationType;                                 // 0x4(0x1)
	char                                                         pad0x3_H6QNP[0x3];                                 // 0x5(0x3)
};


// Size 0x10
struct AnimSetMeshLinkup
{
public:
	TArray<Int BoneToTrackTable>                                 BoneToTrackTable;                                  // 0x0(0x10)
};


// Size 0x1
struct AssetImportInfo
{
public:
	char                                                         pad0x1_PHW23[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct LaunchOnTestSettings
{
public:
	struct FilePath                                              LaunchOnTestmap;                                   // 0x0(0x10)
	struct FString                                               DeviceID;                                          // 0x10(0x10)
};


// Size 0x18
struct EditorMapPerformanceTestDefinition
{
public:
	struct FilePath                                              PerformanceTestmap;                                // 0x0(0x10)
	int                                                          TestTimer;                                         // 0x10(0x4)
	char                                                         pad0x4_B4L7A[0x4];                                 // 0x14(0x4)
};


// Size 0x210
struct BuildPromotionTestSettings
{
public:
	struct FilePath                                              DefaultStaticMeshAsset;                            // 0x0(0x10)
	struct BuildPromotionImportWorkflowSettings                  ImportWorkflow;                                    // 0x10(0x150)
	struct BuildPromotionOpenAssetSettings                       OpenAssets;                                        // 0x160(0x60)
	struct BuildPromotionBlueprintSettings                       BlueprintSettings;                                 // 0x1c0(0x20)
	struct BuildPromotionNewProjectSettings                      NewProjectSettings;                                // 0x1e0(0x20)
	struct FilePath                                              SourceControlMaterial;                             // 0x200(0x10)
};


// Size 0x20
struct BuildPromotionNewProjectSettings
{
public:
	struct DirectoryPath                                         NewProjectFolderOverride;                          // 0x0(0x10)
	struct FString                                               NewProjectNameOverride;                            // 0x10(0x10)
};


// Size 0x20
struct BuildPromotionBlueprintSettings
{
public:
	struct FilePath                                              FirstMeshPath;                                     // 0x0(0x10)
	struct FilePath                                              SecondMeshPath;                                    // 0x10(0x10)
};


// Size 0x60
struct BuildPromotionOpenAssetSettings
{
public:
	struct FilePath                                              BlueprintAsset;                                    // 0x0(0x10)
	struct FilePath                                              MaterialAsset;                                     // 0x10(0x10)
	struct FilePath                                              ParticleSystemAsset;                               // 0x20(0x10)
	struct FilePath                                              SkeletalMeshAsset;                                 // 0x30(0x10)
	struct FilePath                                              StaticMeshAsset;                                   // 0x40(0x10)
	struct FilePath                                              TextureAsset;                                      // 0x50(0x10)
};


// Size 0x150
struct BuildPromotionImportWorkflowSettings
{
public:
	struct EditorImportWorkflowDefinition                        Diffuse;                                           // 0x0(0x20)
	struct EditorImportWorkflowDefinition                        Normal;                                            // 0x20(0x20)
	struct EditorImportWorkflowDefinition                        StaticMesh;                                        // 0x40(0x20)
	struct EditorImportWorkflowDefinition                        ReimportStaticMesh;                                // 0x60(0x20)
	struct EditorImportWorkflowDefinition                        BlendShapeMesh;                                    // 0x80(0x20)
	struct EditorImportWorkflowDefinition                        MorphMesh;                                         // 0xa0(0x20)
	struct EditorImportWorkflowDefinition                        SkeletalMesh;                                      // 0xc0(0x20)
	struct EditorImportWorkflowDefinition                        Animation;                                         // 0xe0(0x20)
	struct EditorImportWorkflowDefinition                        Sound;                                             // 0x100(0x20)
	struct EditorImportWorkflowDefinition                        SurroundSound;                                     // 0x120(0x20)
	TArray<struct EditorImportWorkflowDefinition>                OtherAssetsToImport;                               // 0x140(0x10)
};


// Size 0x20
struct EditorImportWorkflowDefinition
{
public:
	struct FilePath                                              ImportFilePath;                                    // 0x0(0x10)
	TArray<struct ImportFactorySettingValues>                    FactorySettings;                                   // 0x10(0x10)
};


// Size 0x20
struct ImportFactorySettingValues
{
public:
	struct FString                                               SettingName;                                       // 0x0(0x10)
	struct FString                                               Value;                                             // 0x10(0x10)
};


// Size 0x10
struct ParticleEditorPromotionSettings
{
public:
	struct FilePath                                              DefaultParticleAsset;                              // 0x0(0x10)
};


// Size 0x30
struct MaterialEditorPromotionSettings
{
public:
	struct FilePath                                              DefaultMaterialAsset;                              // 0x0(0x10)
	struct FilePath                                              DefaultDiffuseTexture;                             // 0x10(0x10)
	struct FilePath                                              DefaultNormalTexture;                              // 0x20(0x10)
};


// Size 0x38
struct EditorImportExportTestDefinition
{
public:
	struct FilePath                                              ImportFilePath;                                    // 0x0(0x10)
	struct FString                                               ExportFileExtension;                               // 0x10(0x10)
	bool                                                         bSkipExport;                                       // 0x20(0x1)
	char                                                         pad0x7_CVN6Z[0x7];                                 // 0x21(0x7)
	TArray<struct ImportFactorySettingValues>                    FactorySettings;                                   // 0x28(0x10)
};


// Size 0x60
struct ExternalToolDefinition
{
public:
	struct FString                                               ToolName;                                          // 0x0(0x10)
	struct FilePath                                              ExecutablePath;                                    // 0x10(0x10)
	struct FString                                               CommandLineOptions;                                // 0x20(0x10)
	struct DirectoryPath                                         WorkingDirectory;                                  // 0x30(0x10)
	struct FString                                               ScriptExtension;                                   // 0x40(0x10)
	struct DirectoryPath                                         ScriptDirectory;                                   // 0x50(0x10)
};


// Size 0x18
struct OpenTestAsset
{
public:
	struct FilePath                                              AssetToOpen;                                       // 0x0(0x10)
	bool                                                         bSkipTestWhenUnAttended;                           // 0x10(0x1)
	char                                                         pad0x7_23RFK[0x7];                                 // 0x11(0x7)
};


// Size 0x3c
struct NavAvoidanceData
{
public:
	char                                                         pad0x3c_3A4QZ[0x3c];                               // 0x0(0x3c)
};


// Size 0x18
struct AnimParentNodeAssetOverride
{
public:
	class AnimationAsset*                                        NewAsset;                                          // 0x0(0x8)
	struct Guid                                                  ParentNodeGuid;                                    // 0x8(0x10)
};


// Size 0x18
struct AnimGroupInfo
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	struct LinearColor                                           Color;                                             // 0x8(0x10)
};


// Size 0x18
struct DataTableCategoryHandle
{
public:
	class DataTable*                                             DataTable;                                         // 0x0(0x8)
	struct FName                                                 ColumnName;                                        // 0x8(0x8)
	struct FName                                                 RowContents;                                       // 0x10(0x8)
};


// Size 0x10
struct DataTableRowHandle
{
public:
	class DataTable*                                             DataTable;                                         // 0x0(0x8)
	struct FName                                                 RowName;                                           // 0x8(0x8)
};


// Size 0x20
struct DialogueWaveParameter
{
public:
	class DialogueWave*                                          DialogueWave;                                      // 0x0(0x8)
	struct DialogueContext                                       Context;                                           // 0x8(0x18)
};


// Size 0x18
struct DialogueContext
{
public:
	class DialogueVoice*                                         Speaker;                                           // 0x0(0x8)
	TArray<class DialogueVoice*>                                 Targets;                                           // 0x8(0x10)
};


// Size 0x70
struct FormatTextArgument
{
public:
	struct FText                                                 ArgumentName;                                      // 0x0(0x38)
	struct FText                                                 TextValue;                                         // 0x38(0x38)
};


// Size 0x10
struct EventGraphFastCallPair
{
public:
	class Function*                                              FunctionToPatch;                                   // 0x0(0x8)
	int                                                          EventGraphCallOffset;                              // 0x8(0x4)
	char                                                         pad0x4_W0HEL[0x4];                                 // 0xc(0x4)
};


// Size 0x1
struct BlueprintDebugData
{
public:
	char                                                         pad0x1_IF6YX[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct PointerToUberGraphFrame
{
public:
	char                                                         pad0x8_V3225[0x8];                                 // 0x0(0x8)
};


// Size 0x140
struct DebuggingInfoForSingleFunction
{
public:
	char                                                         pad0x140_OJ6PM[0x140];                             // 0x0(0x140)
};


// Size 0x14
struct NodeToCodeAssociation
{
public:
	char                                                         pad0x14_W923T[0x14];                               // 0x0(0x14)
};


// Size 0x1
struct AnimBlueprintDebugData
{
public:
	char                                                         pad0x1_ACPCZ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct AnimationFrameSnapshot
{
public:
