#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Engine_Structs.h"


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ParticleSystemAggregateTickSettings: public Object
{
public:
	int                                                          FramesTickScaledOver;                              // 0x28(0x4)
	int                                                          MaxTicksPerFrame;                                  // 0x2c(0x4)
	float                                                        PriorityInflationPower;                            // 0x30(0x4)
};


// Size 0xd8 (Full Size[0x100] - InheritedSize[0x28]
class PendingNetGame: public Object
{
public:
	class NetDriver*                                             NetDriver;                                         // 0x30(0x8)
	class Package*                                               PreLoadedMapPackage;                               // 0xe8(0x8)
	class World*                                                 PreLoadedWorld;                                    // 0xf0(0x8)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class ReverbEffect: public Object
{
public:
	float                                                        Density;                                           // 0x28(0x4)
	float                                                        Diffusion;                                         // 0x2c(0x4)
	float                                                        Gain;                                              // 0x30(0x4)
	float                                                        GainHF;                                            // 0x34(0x4)
	float                                                        DecayTime;                                         // 0x38(0x4)
	float                                                        DecayHFRatio;                                      // 0x3c(0x4)
	float                                                        ReflectionsGain;                                   // 0x40(0x4)
	float                                                        ReflectionsDelay;                                  // 0x44(0x4)
	float                                                        LateGain;                                          // 0x48(0x4)
	float                                                        LateDelay;                                         // 0x4c(0x4)
	float                                                        AirAbsorptionGainHF;                               // 0x50(0x4)
	float                                                        RoomRolloffFactor;                                 // 0x54(0x4)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class SubUVAnimation: public Object
{
public:
	class Texture2D*                                             SubUVTexture;                                      // 0x28(0x8)
	int                                                          SubImages_Horizontal;                              // 0x30(0x4)
	int                                                          SubImages_Vertical;                                // 0x34(0x4)
	char                                                         BoundingMode;                                      // 0x38(0x1)
	char                                                         OpacitySourceMode;                                 // 0x39(0x1)
	float                                                        AlphaThreshold;                                    // 0x3c(0x4)
	float                                                        SafeMarginSize;                                    // 0x40(0x4)
};


// Size 0x110 (Full Size[0x138] - InheritedSize[0x28]
class StaticMesh: public Object
{
public:
	int                                                          MinLOD;                                            // 0x40(0x4)
	TArray<class MaterialInterface*>                             Materials;                                         // 0x48(0x10)
	int                                                          LightMapResolution;                                // 0x58(0x4)
	int                                                          LightMapCoordinateIndex;                           // 0x5c(0x4)
	class BodySetup*                                             BodySetup;                                         // 0x60(0x8)
	int                                                          LODForCollision;                                   // 0x68(0x4)
	bool                                                         bUseMaximumStreamingTexelRatio;                    // 0x6c(0x1)
	bool                                                         bStripComplexCollisionForConsole;                  // 0x6c(0x1)
	bool                                                         bHasNavigationData;                                // 0x6c(0x1)
	float                                                        StreamingDistanceMultiplier;                       // 0x70(0x4)
	float                                                        LpvBiasMultiplier;                                 // 0x74(0x4)
	TArray<class StaticMeshSocket*>                              Sockets;                                           // 0xa8(0x10)
	struct Vector                                                PositiveBoundsExtension;                           // 0xd0(0xc)
	struct Vector                                                NegativeBoundsExtension;                           // 0xdc(0xc)
	struct BoxSphereBounds                                       ExtendedBounds;                                    // 0xe8(0x1c)
	TArray<String>                                               SourceMaterials;                                   // 0x108(0x10)
	int                                                          UVsForStreaming;                                   // 0x118(0x4)
	int                                                          ElementToIgnoreForTexFactor;                       // 0x11c(0x4)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x120(0x10)
	class NavCollision*                                          NavCollision;                                      // 0x130(0x8)
};


// Size 0x40 (Full Size[0x90] - InheritedSize[0x50]
class ParticleModuleCameraOffset: public ParticleModuleCameraBase
{
public:
	struct RawDistributionFloat                                  CameraOffset;                                      // 0x50(0x38)
	bool                                                         bSpawnTimeOnly;                                    // 0x88(0x1)
	char                                                         UpdateMethod;                                      // 0x8c(0x1)
};


// Size 0x68 (Full Size[0xb8] - InheritedSize[0x50]
class ParticleModuleRotateRotationAxis: public ParticleModuleRotationBase
{
public:
	struct RotationAboutAxisParameters                           FacingAxis;                                        // 0x50(0x10)
	bool                                                         bUseGroupAFacingAxisForAllGroups;                  // 0x60(0x1)
	struct RotationAboutAxisParameters                           AdditionalFacingAxes;                              // 0x64(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SoundNode: public Object
{
public:
	TArray<class SoundNode*>                                     ChildNodes;                                        // 0x28(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ForceFeedbackEffect: public Object
{
public:
	TArray<struct ForceFeedbackChannelDetails>                   ChannelDetails;                                    // 0x28(0x10)
	float                                                        Duration;                                          // 0x38(0x4)
};


// Size 0x90 (Full Size[0xe0] - InheritedSize[0x50]
class ParticleModuleAttractorParticle: public ParticleModuleAttractorBase
{
public:
	struct FName                                                 EmitterName;                                       // 0x50(0x8)
	struct RawDistributionFloat                                  Range;                                             // 0x58(0x38)
	bool                                                         bStrengthByDistance;                               // 0x90(0x1)
	struct RawDistributionFloat                                  Strength;                                          // 0x98(0x38)
	bool                                                         bAffectBaseVelocity;                               // 0xd0(0x1)
	char                                                         SelectionMethod;                                   // 0xd4(0x1)
	bool                                                         bRenewSource;                                      // 0xd8(0x1)
	bool                                                         bInheritSourceVel;                                 // 0xd8(0x1)
	int                                                          LastSelIndex;                                      // 0xdc(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class TextureLODSettings: public Object
{
public:
	TArray<struct TextureLODGroup>                               TextureLODGroups;                                  // 0x28(0x10)
};


// Size 0x78 (Full Size[0xc8] - InheritedSize[0x50]
class ParticleModuleLocationPrimitiveBase: public ParticleModuleLocationBase
{
public:
	bool                                                         Positive_X;                                        // 0x50(0x1)
	bool                                                         Positive_Y;                                        // 0x50(0x1)
	bool                                                         Positive_Z;                                        // 0x50(0x1)
	bool                                                         Negative_X;                                        // 0x50(0x1)
	bool                                                         Negative_Y;                                        // 0x50(0x1)
	bool                                                         Negative_Z;                                        // 0x50(0x1)
	bool                                                         SurfaceOnly;                                       // 0x50(0x1)
	bool                                                         Velocity;                                          // 0x50(0x1)
	struct RawDistributionFloat                                  VelocityScale;                                     // 0x58(0x38)
	struct RawDistributionVector                                 StartLocation;                                     // 0x90(0x38)
};


// Size 0x158 (Full Size[0x1a8] - InheritedSize[0x50]
class ParticleModuleRotation: public ParticleModuleRotationBase
{
public:
	bool                                                         bUseGroupARotationForAllGroups;                    // 0x50(0x1)
	struct RawDistributionFloat                                  StartRotation;                                     // 0x58(0x38)
	struct RawDistributionFloat                                  AdditionalStartRotation;                           // 0x90(0x38)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class CameraModifier: public Object
{
public:
	bool                                                         bDebug;                                            // 0x28(0x1)
	bool                                                         bExclusive;                                        // 0x28(0x1)
	char                                                         Priority;                                          // 0x2c(0x1)
	class PlayerCameraManager*                                   CameraOwner;                                       // 0x30(0x8)
	float                                                        AlphaInTime;                                       // 0x38(0x4)
	float                                                        AlphaOutTime;                                      // 0x3c(0x4)
	float                                                        Alpha;                                             // 0x40(0x4)
	bool                                                         bAutoDestroyOnCompletion;                          // 0x44(0x1)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class Commandlet: public Object
{
public:
	struct FString                                               HelpDescription;                                   // 0x28(0x10)
	struct FString                                               HelpUsage;                                         // 0x38(0x10)
	struct FString                                               HelpWebLink;                                       // 0x48(0x10)
	TArray<String>                                               HelpParamNames;                                    // 0x58(0x10)
	TArray<String>                                               HelpParamDescriptions;                             // 0x68(0x10)
	bool                                                         IsServer;                                          // 0x78(0x1)
	bool                                                         IsClient;                                          // 0x78(0x1)
	bool                                                         IsEditor;                                          // 0x78(0x1)
	bool                                                         LogToConsole;                                      // 0x78(0x1)
	bool                                                         ShowErrorCount;                                    // 0x78(0x1)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class BlueprintCore: public Object
{
public:
	class UClass*                                                SkeletonGeneratedClass;                            // 0x28(0x8)
	class UClass*                                                GeneratedClass;                                    // 0x30(0x8)
	bool                                                         bLegacyNeedToPurgeSkelRefs;                        // 0x38(0x1)
	bool                                                         bLegacyGeneratedClassIsAuthoritative;              // 0x39(0x1)
	struct Guid                                                  BlueprintGuid;                                     // 0x3c(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InputTouchDelegateBinding: public InputDelegateBinding
{
public:
	TArray<struct BlueprintInputTouchDelegateBinding>            InputTouchDelegateBindings;                        // 0x28(0x10)
};


// Size 0xd30 (Full Size[0xd80] - InheritedSize[0x50]
class ParticleModuleTypeDataGpu: public ParticleModuleTypeDataBase
{
public:
	struct GPUSpriteEmitterInfo                                  EmitterInfo;                                       // 0x50(0x2b0)
	struct GPUSpriteResourceData                                 ResourceData;                                      // 0x300(0xa60)
	float                                                        CameraMotionBlurAmount;                            // 0xd60(0x4)
	bool                                                         bClearExistingParticlesOnInit;                     // 0xd64(0x1)
	char                                                         AlphaCullingAggressiveness;                        // 0xd68(0x1)
	bool                                                         bOverrideAlphaThreshold;                           // 0xd6c(0x1)
	float                                                        OverriddenAlphaThreshold;                          // 0xd70(0x4)
	char                                                         InteractionWithKillPlane;                          // 0xd74(0x1)
	char                                                         KillPlanePointLocation;                            // 0xd75(0x1)
	float                                                        FadingTimeWhenKilled;                              // 0xd78(0x4)
};


// Size 0x168 (Full Size[0x198] - InheritedSize[0x30]
class CurveVector: public CurveBase
{
public:
	struct RichCurve                                             FloatCurves;                                       // 0x30(0x78)
};


// Size 0x40 (Full Size[0x90] - InheritedSize[0x50]
class ParticleModuleSubUV: public ParticleModuleSubUVBase
{
public:
	struct RawDistributionFloat                                  SubImageIndex;                                     // 0x50(0x38)
	bool                                                         bUseRealTime;                                      // 0x88(0x1)
};


// Size 0x1e8 (Full Size[0x210] - InheritedSize[0x28]
class LevelStreaming: public Object
{
public:
	assetobject                                                  WorldAsset;                                        // 0x28(0x20)
	struct FName                                                 PackageNameToLoad;                                 // 0x50(0x8)
	TArray<struct Name>                                          LODPackageNames;                                   // 0x58(0x10)
	struct Transform                                             LevelTransform;                                    // 0x80(0x30)
	bool                                                         bShouldBeVisibleInEditor;                          // 0xbc(0x1)
	bool                                                         Blocked;                                           // 0xbc(0x1)
	bool                                                         bShouldBeLoaded;                                   // 0xbc(0x1)
	bool                                                         bShouldBeVisible;                                  // 0xbc(0x1)
	bool                                                         bShouldBlockOnLoad;                                // 0xbc(0x1)
	int                                                          LevelLODIndex;                                     // 0xc0(0x4)
	bool                                                         bDisableDistanceStreaming;                         // 0xc4(0x1)
	bool                                                         bDrawOnLevelStatusMap;                             // 0xc4(0x1)
	struct LinearColor                                           LevelColor;                                        // 0xc8(0x10)
	TArray<class LevelStreamingVolume*>                          EditorStreamingVolumes;                            // 0xd8(0x10)
	float                                                        MinTimeBetweenVolumeUnloadRequests;                // 0xe8(0x4)
	TArray<String>                                               Keywords;                                          // 0xf0(0x10)
	multicastinlinedelegate                                      OnLevelLoaded;                                     // 0x100(0x10)
	multicastinlinedelegate                                      OnLevelUnloaded;                                   // 0x110(0x10)
	multicastinlinedelegate                                      OnLevelShown;                                      // 0x120(0x10)
	multicastinlinedelegate                                      OnLevelHidden;                                     // 0x130(0x10)
	class Level*                                                 LoadedLevel;                                       // 0x200(0x8)
	class Level*                                                 PendingUnloadLevel;                                // 0x208(0x8)
};


// Size 0x68 (Full Size[0xb8] - InheritedSize[0x50]
class ParticleModuleKillSphere: public ParticleModuleKillBase
{
public:
	struct Vector                                                Centre;                                            // 0x50(0xc)
	float                                                        Radius;                                            // 0x5c(0x4)
	bool                                                         bUseGroupAForAll;                                  // 0x60(0x1)
	struct KillSphereGroupParams                                 AdditionalParams;                                  // 0x64(0x10)
};


// Size 0x48 (Full Size[0x80] - InheritedSize[0x38]
class AudioSettings: public DeveloperSettings
{
public:
	struct StringAssetReference                                  DefaultSoundClassName;                             // 0x38(0x10)
	struct StringAssetReference                                  DefaultBaseSoundMix;                               // 0x48(0x10)
	struct StringAssetReference                                  VoiPSoundClass;                                    // 0x58(0x10)
	float                                                        LowPassFilterResonance;                            // 0x68(0x4)
	int                                                          MaximumConcurrentStreams;                          // 0x6c(0x4)
	TArray<struct AudioQualitySettings>                          QualityLevels;                                     // 0x70(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class InterpGroup: public Object
{
public:
	TArray<class InterpTrack*>                                   InterpTracks;                                      // 0x30(0x10)
	struct FName                                                 GroupName;                                         // 0x40(0x8)
	struct Color                                                 GroupColor;                                        // 0x48(0x4)
	bool                                                         bCollapsed;                                        // 0x4c(0x1)
	bool                                                         bVisible;                                          // 0x4c(0x1)
	bool                                                         bIsFolder;                                         // 0x4c(0x1)
	bool                                                         bIsParented;                                       // 0x4c(0x1)
	bool                                                         bIsSelected;                                       // 0x4c(0x1)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class InterpTrackInstEvent: public InterpTrackInst
{
public:
	float                                                        LastUpdatePosition;                                // 0x28(0x4)
};


// Size 0x70 (Full Size[0xc0] - InheritedSize[0x50]
class ParticleModuleTypeDataMesh: public ParticleModuleTypeDataBase
{
public:
	class StaticMesh*                                            Mesh;                                              // 0x50(0x8)
	bool                                                         CastShadows;                                       // 0x58(0x1)
	bool                                                         DoCollisions;                                      // 0x58(0x1)
	char                                                         MeshAlignment;                                     // 0x5c(0x1)
	bool                                                         bOverrideMaterial;                                 // 0x60(0x1)
	float                                                        Pitch;                                             // 0x64(0x4)
	float                                                        Roll;                                              // 0x68(0x4)
	float                                                        Yaw;                                               // 0x6c(0x4)
	struct RawDistributionVector                                 RollPitchYawRange;                                 // 0x70(0x38)
	char                                                         AxisLockOption;                                    // 0xb0(0x1)
	bool                                                         bCameraFacing;                                     // 0xb4(0x1)
	char                                                         CameraFacingUpAxisOption;                          // 0xb8(0x1)
	char                                                         CameraFacingOption;                                // 0xb9(0x1)
	bool                                                         bApplyParticleRotationAsSpin;                      // 0xbc(0x1)
	bool                                                         bFaceCameraDirectionRatherThanPosition;            // 0xbc(0x1)
	bool                                                         bFaceCameraOnlyOnSpawn;                            // 0xbc(0x1)
	bool                                                         bCollisionsConsiderPartilceSize;                   // 0xbc(0x1)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class DataTable: public Object
{
public:
	class ScriptStruct*                                          RowStruct;                                         // 0x28(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class BoneMaskFilter: public Object
{
public:
	TArray<struct InputBlendPose>                                BlendPoses;                                        // 0x28(0x10)
};


// Size 0xb0 (Full Size[0xd8] - InheritedSize[0x28]
class FontImportOptions: public Object
{
public:
	struct FontImportOptionsData                                 Data;                                              // 0x28(0xb0)
};


// Size 0x40 (Full Size[0x90] - InheritedSize[0x50]
class ParticleModuleKillHeight: public ParticleModuleKillBase
{
public:
	struct RawDistributionFloat                                  Height;                                            // 0x50(0x38)
	bool                                                         bAbsolute;                                         // 0x88(0x1)
	bool                                                         bFloor;                                            // 0x88(0x1)
	bool                                                         bApplyPSysScale;                                   // 0x88(0x1)
};


// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class ActorComponent: public Object
{
public:
	struct ActorComponentTickFunction                            PrimaryComponentTick;                              // 0x30(0x50)
	TArray<struct Name>                                          ComponentTags;                                     // 0x80(0x10)
	TArray<struct SimpleMemberReference>                         UCSModifiedProperties;                             // 0x90(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0xb0(0x10)
	bool                                                         bReplicates;                                       // 0xc0(0x1)
	bool                                                         bNetAddressable;                                   // 0xc0(0x1)
	bool                                                         bCreatedByConstructionScript;                      // 0xc1(0x1)
	bool                                                         bInstanceComponent;                                // 0xc1(0x1)
	bool                                                         bAutoActivate;                                     // 0xc2(0x1)
	bool                                                         bIsActive;                                         // 0xc2(0x1)
	bool                                                         bEditableWhenInherited;                            // 0xc2(0x1)
	bool                                                         bNeedsLoadForClient;                               // 0xc3(0x1)
	bool                                                         bNeedsLoadForServer;                               // 0xc3(0x1)
	char                                                         TargetNetDormancy;                                 // 0xc4(0x1)
	char                                                         CreationMethod;                                    // 0xc5(0x1)
};


// Size 0x68 (Full Size[0xb8] - InheritedSize[0x50]
class ParticleModuleTrailSource: public ParticleModuleTrailBase
{
public:
	char                                                         SourceMethod;                                      // 0x50(0x1)
	struct FName                                                 SourceName;                                        // 0x54(0x8)
	struct RawDistributionFloat                                  SourceStrength;                                    // 0x60(0x38)
	bool                                                         bLockSourceStength;                                // 0x98(0x1)
	int                                                          SourceOffsetCount;                                 // 0x9c(0x4)
	TArray<struct Vector>                                        SourceOffsetDefaults;                              // 0xa0(0x10)
	char                                                         SelectionMethod;                                   // 0xb0(0x1)
	bool                                                         bInheritRotation;                                  // 0xb4(0x1)
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class SlateBrushAsset: public Object
{
public:
	struct SlateBrush                                            Brush;                                             // 0x28(0x90)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class LevelActorContainer: public Object
{
public:
	TArray<class Actor*>                                         Actors;                                            // 0x28(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class Rig: public Object
{
public:
	TArray<struct TransformBase>                                 TransformBases;                                    // 0x28(0x10)
	TArray<struct Node>                                          Nodes;                                             // 0x38(0x10)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class SoundMix: public Object
{
public:
	bool                                                         bApplyEQ;                                          // 0x28(0x1)
	float                                                        EQPriority;                                        // 0x2c(0x4)
	struct AudioEQEffect                                         EQSettings;                                        // 0x30(0x28)
	TArray<struct SoundClassAdjuster>                            SoundClassEffects;                                 // 0x58(0x10)
	float                                                        InitialDelay;                                      // 0x68(0x4)
	float                                                        FadeInTime;                                        // 0x6c(0x4)
	float                                                        Duration;                                          // 0x70(0x4)
	float                                                        FadeOutTime;                                       // 0x74(0x4)
};


// Size 0x20 (Full Size[0x3e8] - InheritedSize[0x3c8]
class PhysicsConstraintActor: public RigidBodyBase
{
public:
	class PhysicsConstraintComponent*                            ConstraintComp;                                    // 0x3c8(0x8)
	class Actor*                                                 ConstraintActor1;                                  // 0x3d0(0x8)
	class Actor*                                                 ConstraintActor2;                                  // 0x3d8(0x8)
	bool                                                         bDisableCollision;                                 // 0x3e0(0x1)
};


// Size 0x8 (Full Size[0x58] - InheritedSize[0x50]
class ParticleModuleOrientationAxisLock: public ParticleModuleOrientationBase
{
public:
	char                                                         LockAxisFlags;                                     // 0x50(0x1)
	bool                                                         bLockToOwnerAxis;                                  // 0x54(0x1)
};


// Size 0x218 (Full Size[0x240] - InheritedSize[0x28]
class PhysicsConstraintTemplate: public Object
{
public:
	struct FName                                                 JointName;                                         // 0x28(0x8)
	struct FName                                                 ConstraintBone1;                                   // 0x30(0x8)
	struct FName                                                 ConstraintBone2;                                   // 0x38(0x8)
	struct Vector                                                Pos1;                                              // 0x40(0xc)
	struct Vector                                                PriAxis1;                                          // 0x4c(0xc)
	struct Vector                                                SecAxis1;                                          // 0x58(0xc)
	struct Vector                                                Pos2;                                              // 0x64(0xc)
	struct Vector                                                PriAxis2;                                          // 0x70(0xc)
	struct Vector                                                SecAxis2;                                          // 0x7c(0xc)
	bool                                                         bEnableProjection;                                 // 0x88(0x1)
	float                                                        ProjectionLinearTolerance;                         // 0x8c(0x4)
	float                                                        ProjectionAngularTolerance;                        // 0x90(0x4)
	char                                                         LinearXMotion;                                     // 0x94(0x1)
	char                                                         LinearYMotion;                                     // 0x95(0x1)
	char                                                         LinearZMotion;                                     // 0x96(0x1)
	float                                                        LinearLimitSize;                                   // 0x98(0x4)
	bool                                                         bLinearLimitSoft;                                  // 0x9c(0x1)
	float                                                        LinearLimitStiffness;                              // 0xa0(0x4)
	float                                                        LinearLimitDamping;                                // 0xa4(0x4)
	bool                                                         bLinearBreakable;                                  // 0xa8(0x1)
	float                                                        LinearBreakThreshold;                              // 0xac(0x4)
	char                                                         AngularSwing1Motion;                               // 0xb0(0x1)
	char                                                         AngularSwing2Motion;                               // 0xb1(0x1)
	char                                                         AngularTwistMotion;                                // 0xb2(0x1)
	bool                                                         bSwingLimitSoft;                                   // 0xb4(0x1)
	bool                                                         bTwistLimitSoft;                                   // 0xb4(0x1)
	float                                                        Swing1LimitAngle;                                  // 0xb8(0x4)
	float                                                        Swing2LimitAngle;                                  // 0xbc(0x4)
	float                                                        TwistLimitAngle;                                   // 0xc0(0x4)
	float                                                        SwingLimitStiffness;                               // 0xc4(0x4)
	float                                                        SwingLimitDamping;                                 // 0xc8(0x4)
	float                                                        TwistLimitStiffness;                               // 0xcc(0x4)
	float                                                        TwistLimitDamping;                                 // 0xd0(0x4)
	bool                                                         bAngularBreakable;                                 // 0xd4(0x1)
	float                                                        AngularBreakThreshold;                             // 0xd8(0x4)
	struct ConstraintInstance                                    DefaultInstance;                                   // 0xe0(0x160)
};


// Size 0x18 (Full Size[0x68] - InheritedSize[0x50]
class ParticleModuleTypeDataAnimTrail: public ParticleModuleTypeDataBase
{
public:
	bool                                                         bDeadTrailsOnDeactivate;                           // 0x50(0x1)
	bool                                                         bEnablePreviousTangentRecalculation;               // 0x50(0x1)
	bool                                                         bTangentRecalculationEveryFrame;                   // 0x50(0x1)
	float                                                        TilingDistance;                                    // 0x54(0x4)
	float                                                        DistanceTessellationStepSize;                      // 0x58(0x4)
	float                                                        TangentTessellationStepSize;                       // 0x5c(0x4)
	float                                                        WidthTessellationStepSize;                         // 0x60(0x4)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class BookMark: public Object
{
public:
	struct Vector                                                Location;                                          // 0x28(0xc)
	struct Rotator                                               Rotation;                                          // 0x34(0xc)
	TArray<String>                                               HiddenLevels;                                      // 0x40(0x10)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class Exporter: public Object
{
public:
	class UClass*                                                SupportedClass;                                    // 0x28(0x8)
	class Object*                                                ExportRootScope;                                   // 0x30(0x8)
	TArray<String>                                               FormatExtension;                                   // 0x38(0x10)
	TArray<String>                                               FormatDescription;                                 // 0x48(0x10)
	int                                                          PreferredFormatIndex;                              // 0x58(0x4)
	int                                                          TextIndent;                                        // 0x5c(0x4)
	bool                                                         bText;                                             // 0x60(0x1)
	bool                                                         bSelectedOnly;                                     // 0x60(0x1)
	bool                                                         bForceFileOperations;                              // 0x60(0x1)
};


// Size 0x88 (Full Size[0xd8] - InheritedSize[0x50]
class ParticleModuleCollisionGPU: public ParticleModuleCollisionBase
{
public:
	struct RawDistributionFloat                                  Resilience;                                        // 0x50(0x38)
	struct RawDistributionFloat                                  ResilienceScaleOverLife;                           // 0x88(0x38)
	float                                                        DampingFactorRotation;                             // 0xc0(0x4)
	float                                                        Friction;                                          // 0xc4(0x4)
	float                                                        RadiusScale;                                       // 0xc8(0x4)
	float                                                        RadiusBias;                                        // 0xcc(0x4)
	char                                                         Response;                                          // 0xd0(0x1)
	char                                                         CollisionMode;                                     // 0xd1(0x1)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InstancedActorDelegateBinding: public DynamicBlueprintBinding
{
public:
	TArray<struct BlueprintInstancedActorDelegateBinding>        ActorDelegateBindings;                             // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InheritableComponentHandler: public Object
{
public:
	TArray<struct ComponentOverrideRecord>                       Records;                                           // 0x28(0x10)
};


// Size 0x38 (Full Size[0x88] - InheritedSize[0x50]
class ParticleModuleMeshRotationRateMultiplyLife: public ParticleModuleRotationRateBase
{
public:
	struct RawDistributionVector                                 LifeMultiplier;                                    // 0x50(0x38)
};


// Size 0x18 (Full Size[0x418] - InheritedSize[0x400]
class LevelStreamingVolume: public Volume
{
public:
	TArray<struct Name>                                          StreamingLevelNames;                               // 0x400(0x10)
	bool                                                         bEditorPreVisOnly;                                 // 0x410(0x1)
	bool                                                         bDisabled;                                         // 0x410(0x1)
	char                                                         StreamingUsage;                                    // 0x414(0x1)
};


// Size 0x40 (Full Size[0x90] - InheritedSize[0x50]
class ParticleModuleSizeMultiplyLife: public ParticleModuleSizeBase
{
public:
	struct RawDistributionVector                                 LifeMultiplier;                                    // 0x50(0x38)
	bool                                                         MultiplyX;                                         // 0x88(0x1)
	bool                                                         MultiplyY;                                         // 0x88(0x1)
	bool                                                         MultiplyZ;                                         // 0x88(0x1)
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class ParticleSystem: public Object
{
public:
	char                                                         SystemUpdateMode;                                  // 0x28(0x1)
	float                                                        UpdateTime_FPS;                                    // 0x2c(0x4)
	float                                                        UpdateTime_Delta;                                  // 0x30(0x4)
	float                                                        WarmUpTime;                                        // 0x34(0x4)
	float                                                        WarmupTickRate;                                    // 0x38(0x4)
	TArray<class ParticleEmitter*>                               Emitters;                                          // 0x40(0x10)
	class ParticleSystemComponent*                               PreviewComponent;                                  // 0x50(0x8)
	class InterpCurveEdSetup*                                    CurveEdSetup;                                      // 0x58(0x8)
	bool                                                         bOrientZAxisTowardCamera;                          // 0x60(0x1)
	float                                                        LODDistanceCheckTime;                              // 0x64(0x4)
	char                                                         LODMethod;                                         // 0x68(0x1)
	TArray<float>                                                LODDistances;                                      // 0x70(0x10)
	bool                                                         bRegenerateLODDuplicate;                           // 0x80(0x1)
	TArray<struct ParticleSystemLOD>                             LODSettings;                                       // 0x88(0x10)
	bool                                                         bIgnoreBoundsRotation;                             // 0x98(0x1)
	bool                                                         bBoostParticleAggregationPriority;                 // 0x98(0x1)
	bool                                                         bUseFixedRelativeBoundingBox;                      // 0x98(0x1)
	struct Box                                                   FixedRelativeBoundingBox;                          // 0x9c(0x1c)
	bool                                                         bUseLowResTranslucencyBoundingBox;                 // 0xb8(0x1)
	struct Box                                                   LowResTranslucencyBoundingBox;                     // 0xbc(0x1c)
	float                                                        SecondsBeforeInactive;                             // 0xd8(0x4)
	bool                                                         bShouldResetPeakCounts;                            // 0xdc(0x1)
	bool                                                         bHasPhysics;                                       // 0xdc(0x1)
	bool                                                         bPostPhysicsTick;                                  // 0xdc(0x1)
	bool                                                         bUseRealtimeThumbnail;                             // 0xdc(0x1)
	bool                                                         ThumbnailImageOutOfDate;                           // 0xdc(0x1)
	float                                                        Delay;                                             // 0xe0(0x4)
	float                                                        DelayLow;                                          // 0xe4(0x4)
	bool                                                         bUseDelayRange;                                    // 0xe8(0x1)
	struct Vector                                                MacroUVPosition;                                   // 0xec(0xc)
	float                                                        MacroUVRadius;                                     // 0xf8(0x4)
	char                                                         OcclusionBoundsMethod;                             // 0xfc(0x1)
	struct Box                                                   CustomOcclusionBounds;                             // 0x100(0x1c)
	TArray<struct LODSoloTrack>                                  SoloTracking;                                      // 0x120(0x10)
	TArray<struct NamedEmitterMaterial>                          NamedMaterialSlots;                                // 0x130(0x10)
};


// Size 0xc8 (Full Size[0xf0] - InheritedSize[0x28]
class Console: public Object
{
public:
	class LocalPlayer*                                           ConsoleTargetPlayer;                               // 0x38(0x8)
	class Texture2D*                                             DefaultTexture_Black;                              // 0x40(0x8)
	class Texture2D*                                             DefaultTexture_White;                              // 0x48(0x8)
	TArray<String>                                               HistoryBuffer;                                     // 0x68(0x10)
};


// Size 0x88 (Full Size[0xd8] - InheritedSize[0x50]
class ParticleModuleAttractorLine: public ParticleModuleAttractorBase
{
public:
	struct Vector                                                EndPoint0;                                         // 0x50(0xc)
	struct Vector                                                EndPoint1;                                         // 0x5c(0xc)
	struct RawDistributionFloat                                  Range;                                             // 0x68(0x38)
	struct RawDistributionFloat                                  Strength;                                          // 0xa0(0x38)
};


// Size 0x10 (Full Size[0x60] - InheritedSize[0x50]
class ParticleModuleEventGenerator: public ParticleModuleEventBase
{
public:
	TArray<struct ParticleEvent_GenerateInfo>                    Events;                                            // 0x50(0x10)
};


// Size 0x10 (Full Size[0x60] - InheritedSize[0x50]
class ParticleModuleVectorFieldGlobal: public ParticleModuleVectorFieldBase
{
public:
	bool                                                         bOverrideGlobalVectorFieldTightness;               // 0x50(0x1)
	float                                                        GlobalVectorFieldScale;                            // 0x54(0x4)
	float                                                        GlobalVectorFieldTightness;                        // 0x58(0x4)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class StaticMeshSocket: public Object
{
public:
	struct FName                                                 SocketName;                                        // 0x28(0x8)
	struct Vector                                                RelativeLocation;                                  // 0x30(0xc)
	struct Rotator                                               RelativeRotation;                                  // 0x3c(0xc)
	struct Vector                                                RelativeScale;                                     // 0x48(0xc)
	struct FString                                               Tag;                                               // 0x58(0x10)
};


// Size 0x50 (Full Size[0x450] - InheritedSize[0x400]
class AudioVolume: public Volume
{
public:
	float                                                        Priority;                                          // 0x400(0x4)
	bool                                                         bEnabled;                                          // 0x404(0x1)
	struct ReverbSettings                                        Settings;                                          // 0x408(0x18)
	struct InteriorSettings                                      AmbientZoneSettings;                               // 0x420(0x24)
	class AudioVolume*                                           NextLowerPriorityVolume;                           // 0x448(0x8)
};


// Size 0x2d8 (Full Size[0x300] - InheritedSize[0x28]
class Level: public Object
{
public:
	class LevelActorContainer*                                   ActorCluster;                                      // 0xc8(0x8)
	class World*                                                 OwningWorld;                                       // 0xd0(0x8)
	class Model*                                                 Model;                                             // 0xd8(0x8)
	TArray<class ModelComponent*>                                ModelComponents;                                   // 0xe0(0x10)
	class LevelScriptActor*                                      LevelScriptActor;                                  // 0xf0(0x8)
	class NavigationObjectBase*                                  NavListStart;                                      // 0xf8(0x8)
	class NavigationObjectBase*                                  NavListEnd;                                        // 0x100(0x8)
	TArray<class NavigationDataChunk*>                           NavDataChunks;                                     // 0x108(0x10)
	float                                                        LightmapTotalSize;                                 // 0x118(0x4)
	float                                                        ShadowmapTotalSize;                                // 0x11c(0x4)
	TArray<struct Vector>                                        StaticNavigableGeometry;                           // 0x120(0x10)
	bool                                                         LevelVisibility;                                   // 0x260(0x1)
	bool                                                         Blocked;                                           // 0x270(0x1)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x2d8(0x10)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class DeviceProfileManager: public Object
{
public:
	TArray<class Object*>                                        Profiles;                                          // 0x28(0x10)
};


// Size 0x58 (Full Size[0xa8] - InheritedSize[0x50]
class ParticleModuleLocationEmitter: public ParticleModuleLocationBase
{
public:
	struct FName                                                 EmitterName;                                       // 0x50(0x8)
	char                                                         SelectionMethod;                                   // 0x58(0x1)
	bool                                                         InheritSourceVelocity;                             // 0x5c(0x1)
	struct RawDistributionFloat                                  InheritSourceVelocityScaleDistribution;            // 0x60(0x38)
	bool                                                         bInheritSourceRotation;                            // 0x98(0x1)
	float                                                        InheritSourceRotationScale;                        // 0x9c(0x4)
	char                                                         MissingParentParticlesBehaviour;                   // 0xa0(0x1)
};


// Size 0x8 (Full Size[0x58] - InheritedSize[0x50]
class ParticleModuleVectorFieldScale: public ParticleModuleVectorFieldBase
{
public:
	class DistributionFloat*                                     VectorFieldScale;                                  // 0x50(0x8)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class AutomaticInstancingSettings: public DeveloperSettings
{
public:
	bool                                                         IsEnabled;                                         // 0x38(0x1)
};


// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class AvoidanceManager: public Object
{
public:
	float                                                        DefaultTimeToLive;                                 // 0x30(0x4)
	float                                                        LockTimeAfterAvoid;                                // 0x34(0x4)
	float                                                        LockTimeAfterClean;                                // 0x38(0x4)
	float                                                        DeltaTimeToPredict;                                // 0x3c(0x4)
	float                                                        ArtificialRadiusExpansion;                         // 0x40(0x4)
	float                                                        TestHeightDifference;                              // 0x44(0x4)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class DialogueVoice: public Object
{
public:
	char                                                         Gender;                                            // 0x28(0x1)
	char                                                         Plurality;                                         // 0x29(0x1)
	struct Guid                                                  LocalizationGUID;                                  // 0x2c(0x10)
};


// Size 0x450 (Full Size[0x478] - InheritedSize[0x28]
class NetDriver: public Object
{
public:
	struct FString                                               NetConnectionClassName;                            // 0x38(0x10)
	int                                                          MaxDownloadSize;                                   // 0x48(0x4)
	bool                                                         bClampListenServerTickRate;                        // 0x4c(0x1)
	int                                                          NetServerMaxTickRate;                              // 0x50(0x4)
	int                                                          MaxInternetClientRate;                             // 0x54(0x4)
	int                                                          MaxClientRate;                                     // 0x58(0x4)
	float                                                        ServerTravelPause;                                 // 0x5c(0x4)
	float                                                        SpawnPrioritySeconds;                              // 0x60(0x4)
	float                                                        RelevantTimeout;                                   // 0x64(0x4)
	float                                                        KeepAliveTime;                                     // 0x68(0x4)
	float                                                        InitialConnectTimeout;                             // 0x6c(0x4)
	float                                                        ConnectionTimeout;                                 // 0x70(0x4)
	class NetConnection*                                         ServerConnection;                                  // 0x78(0x8)
	TArray<class NetConnection*>                                 ClientConnections;                                 // 0x80(0x10)
	class World*                                                 World;                                             // 0x90(0x8)
	class UClass*                                                NetConnectionClass;                                // 0xc8(0x8)
	class Property*                                              RoleProperty;                                      // 0xd0(0x8)
	class Property*                                              RemoteRoleProperty;                                // 0xd8(0x8)
	struct FName                                                 NetDriverName;                                     // 0xe0(0x8)
};


// Size 0x8 (Full Size[0x1d0] - InheritedSize[0x1c8]
class MaterialExpressionAntialiasedTextureMask: public MaterialExpressionTextureSampleParameter2D
{
public:
	float                                                        Threshold;                                         // 0x1c8(0x4)
	char                                                         Channel;                                           // 0x1cc(0x1)
};


// Size 0x158 (Full Size[0x1a8] - InheritedSize[0x50]
class ParticleModuleBeamNoise: public ParticleModuleBeamBase
{
public:
	bool                                                         bLowFreq_Enabled;                                  // 0x50(0x1)
	int                                                          Frequency;                                         // 0x54(0x4)
	int                                                          Frequency_LowRange;                                // 0x58(0x4)
	struct RawDistributionVector                                 NoiseRange;                                        // 0x60(0x38)
	struct RawDistributionFloat                                  NoiseRangeScale;                                   // 0x98(0x38)
	bool                                                         bNRScaleEmitterTime;                               // 0xd0(0x1)
	struct RawDistributionVector                                 NoiseSpeed;                                        // 0xd8(0x38)
	bool                                                         bSmooth;                                           // 0x110(0x1)
	float                                                        NoiseLockRadius;                                   // 0x114(0x4)
	bool                                                         bNoiseLock;                                        // 0x118(0x1)
	bool                                                         bOscillate;                                        // 0x118(0x1)
	float                                                        NoiseLockTime;                                     // 0x11c(0x4)
	float                                                        NoiseTension;                                      // 0x120(0x4)
	bool                                                         bUseNoiseTangents;                                 // 0x124(0x1)
	struct RawDistributionFloat                                  NoiseTangentStrength;                              // 0x128(0x38)
	int                                                          NoiseTessellation;                                 // 0x160(0x4)
	bool                                                         bTargetNoise;                                      // 0x164(0x1)
	float                                                        FrequencyDistance;                                 // 0x168(0x4)
	bool                                                         bApplyNoiseScale;                                  // 0x16c(0x1)
	struct RawDistributionFloat                                  NoiseScale;                                        // 0x170(0x38)
};


// Size 0x10 (Full Size[0x410] - InheritedSize[0x400]
class PhysicsVolume: public Volume
{
public:
	float                                                        TerminalVelocity;                                  // 0x400(0x4)
	int                                                          Priority;                                          // 0x404(0x4)
	float                                                        FluidFriction;                                     // 0x408(0x4)
	bool                                                         bWaterVolume;                                      // 0x40c(0x1)
	bool                                                         bPhysicsOnContact;                                 // 0x40c(0x1)
};


// Size 0xc8 (Full Size[0xf0] - InheritedSize[0x28]
class MaterialParameterCollectionInstance: public Object
{
public:
	class MaterialParameterCollection*                           Collection;                                        // 0x30(0x8)
	class World*                                                 World;                                             // 0x38(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InterpTrackInstProperty: public InterpTrackInst
{
public:
	class Property*                                              InterpProperty;                                    // 0x28(0x8)
	class Object*                                                PropertyOuterObjectInst;                           // 0x30(0x8)
};


// Size 0xd0 (Full Size[0xf8] - InheritedSize[0x28]
class PhysicsAsset: public Object
{
public:
	TArray<class BodySetup*>                                     BodySetup;                                         // 0x28(0x10)
	TArray<int>                                                  BoundsBodies;                                      // 0x38(0x10)
	TArray<class PhysicsConstraintTemplate*>                     ConstraintSetup;                                   // 0x48(0x10)
};


// Size 0x1b8 (Full Size[0x208] - InheritedSize[0x50]
class ParticleModuleLocationPrimitiveSphereSlice: public ParticleModuleLocationBase
{
public:
	struct RawDistributionFloat                                  StartRadius;                                       // 0x50(0x38)
	struct RawDistributionFloat                                  AdditionalStartRadiuses;                           // 0x88(0x38)
	bool                                                         StartRadiusUseGroupAForAll;                        // 0x168(0x1)
	struct PrimitiveSphereEmitterAngleRanges                     AngleRanges;                                       // 0x16c(0x10)
	float                                                        FirstSliceDistributionWeight;                      // 0x18c(0x4)
	bool                                                         SurfaceOnly;                                       // 0x190(0x1)
	bool                                                         Velocity;                                          // 0x190(0x1)
	struct RawDistributionFloat                                  VelocityScale;                                     // 0x198(0x38)
	struct RawDistributionVector                                 StartLocation;                                     // 0x1d0(0x38)
};


// Size 0x68 (Full Size[0x228] - InheritedSize[0x1c0]
class BlueprintGeneratedClass: public Class
{
public:
	int                                                          NumReplicatedProperties;                           // 0x1c0(0x4)
	TArray<class DynamicBlueprintBinding*>                       DynamicBindingObjects;                             // 0x1c8(0x10)
	TArray<class ActorComponent*>                                ComponentTemplates;                                // 0x1d8(0x10)
	TArray<class TimelineTemplate*>                              Timelines;                                         // 0x1e8(0x10)
	class SimpleConstructionScript*                              SimpleConstructionScript;                          // 0x1f8(0x8)
	class InheritableComponentHandler*                           InheritableComponentHandler;                       // 0x200(0x8)
	class StructProperty*                                        UberGraphFramePointerProperty;                     // 0x208(0x8)
	class Function*                                              UberGraphFunction;                                 // 0x210(0x8)
	TArray<struct EventGraphFastCallPair>                        FastCallPairs;                                     // 0x218(0x10)
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class TimelineTemplate: public Object
{
public:
	float                                                        TimelineLength;                                    // 0x28(0x4)
	char                                                         LengthMode;                                        // 0x2c(0x1)
	bool                                                         bAutoPlay;                                         // 0x30(0x1)
	bool                                                         bLoop;                                             // 0x30(0x1)
	bool                                                         bReplicated;                                       // 0x30(0x1)
	bool                                                         bValidatedAsWired;                                 // 0x30(0x1)
	TArray<struct TTEventTrack>                                  EventTracks;                                       // 0x38(0x10)
	TArray<struct TTFloatTrack>                                  FloatTracks;                                       // 0x48(0x10)
	TArray<struct TTVectorTrack>                                 VectorTracks;                                      // 0x58(0x10)
	TArray<struct TTLinearColorTrack>                            LinearColorTracks;                                 // 0x68(0x10)
	TArray<struct BPVariableMetaDataEntry>                       MetaDataArray;                                     // 0x78(0x10)
	struct Guid                                                  TimelineGuid;                                      // 0x88(0x10)
};


// Size 0x10 (Full Size[0x410] - InheritedSize[0x400]
class NavModifierVolume: public Volume
{
public:
	class UClass*                                                AreaClass;                                         // 0x408(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class NavigationQueryFilter: public Object
{
public:
	TArray<struct NavigationFilterArea>                          Areas;                                             // 0x28(0x10)
	struct NavigationFilterFlags                                 IncludeFlags;                                      // 0x38(0x4)
	struct NavigationFilterFlags                                 ExcludeFlags;                                      // 0x3c(0x4)
};


// Size 0x80 (Full Size[0x448] - InheritedSize[0x3c8]
class PlayerState: public Info
{
public:
	float                                                        Score;                                             // 0x3c8(0x4)
	char                                                         Ping;                                              // 0x3cc(0x1)
	struct FString                                               PlayerName;                                        // 0x3d0(0x10)
	int                                                          PlayerId;                                          // 0x3f0(0x4)
	bool                                                         bIsSpectator;                                      // 0x3f4(0x1)
	bool                                                         bOnlySpectator;                                    // 0x3f4(0x1)
	bool                                                         bIsABot;                                           // 0x3f4(0x1)
	bool                                                         bIsInactive;                                       // 0x3f4(0x1)
	bool                                                         bFromPreviousLevel;                                // 0x3f4(0x1)
	class UClass*                                                EngineMessageClass;                                // 0x3f8(0x8)
	struct UniqueNetIdRepl                                       UniqueId;                                          // 0x418(0x18)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ParticleSystemReplay: public Object
{
public:
	int                                                          ClipIDNumber;                                      // 0x28(0x4)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class FFTWaterSettings: public Object
{
public:
	struct StringAssetReference                                  FFTWaterMaterialName;                              // 0x28(0x10)
	struct StringAssetReference                                  FFTWaterFoamTextureName;                           // 0x38(0x10)
	int                                                          BaseMeshDetail;                                    // 0x48(0x4)
};


// Size 0x120 (Full Size[0x158] - InheritedSize[0x38]
class UserInterfaceSettings: public DeveloperSettings
{
public:
	char                                                         RenderFocusRule;                                   // 0x38(0x1)
	struct StringClassReference                                  DefaultCursor;                                     // 0x40(0x10)
	struct StringClassReference                                  TextEditBeamCursor;                                // 0x50(0x10)
	struct StringClassReference                                  CrosshairsCursor;                                  // 0x60(0x10)
	struct StringClassReference                                  GrabHandCursor;                                    // 0x70(0x10)
	struct StringClassReference                                  GrabHandClosedCursor;                              // 0x80(0x10)
	struct StringClassReference                                  SlashedCircleCursor;                               // 0x90(0x10)
	float                                                        ApplicationScale;                                  // 0xa0(0x4)
	char                                                         UIScaleRule;                                       // 0xa4(0x1)
	struct StringClassReference                                  CustomScalingRuleClass;                            // 0xa8(0x10)
	struct RuntimeFloatCurve                                     UIScaleCurve;                                      // 0xb8(0x80)
	TArray<class Object*>                                        CursorClasses;                                     // 0x138(0x10)
	class UClass*                                                CustomScalingRuleClassInstance;                    // 0x148(0x8)
	class DPICustomScalingRule*                                  CustomScalingRule;                                 // 0x150(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PlatformInterfaceBase: public Object
{
public:
	TArray<struct DelegateArray>                                 AllDelegates;                                      // 0x28(0x10)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class InterpTrackInstFloatMaterialParam: public InterpTrackInst
{
public:
	TArray<class MaterialInstanceDynamic*>                       MaterialInstances;                                 // 0x28(0x10)
	TArray<float>                                                ResetFloats;                                       // 0x38(0x10)
	TArray<struct PrimitiveMaterialRef>                          PrimitiveMaterialRefs;                             // 0x48(0x10)
	class InterpTrackFloatMaterialParam*                         InstancedTrack;                                    // 0x58(0x8)
};


// Size 0xe8 (Full Size[0x110] - InheritedSize[0x28]
class NavCollision: public Object
{
public:
	TArray<struct NavCollisionCylinder>                          CylinderCollision;                                 // 0x78(0x10)
	TArray<struct NavCollisionBox>                               BoxCollision;                                      // 0x88(0x10)
	class UClass*                                                AreaClass;                                         // 0x98(0x8)
	bool                                                         bIsDynamicObstacle;                                // 0xa0(0x1)
	bool                                                         bGatherConvexGeometry;                             // 0xa0(0x1)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class InterpTrackInstVectorMaterialParam: public InterpTrackInst
{
public:
	TArray<class MaterialInstanceDynamic*>                       MaterialInstances;                                 // 0x28(0x10)
	TArray<struct Vector>                                        ResetVectors;                                      // 0x38(0x10)
	TArray<struct PrimitiveMaterialRef>                          PrimitiveMaterialRefs;                             // 0x48(0x10)
	class InterpTrackVectorMaterialParam*                        InstancedTrack;                                    // 0x58(0x8)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class DialogueWave: public Object
{
public:
	bool                                                         bMature;                                           // 0x28(0x1)
	struct FString                                               SpokenText;                                        // 0x30(0x10)
	TArray<struct DialogueContextMapping>                        ContextMappings;                                   // 0x40(0x10)
	struct Guid                                                  LocalizationGUID;                                  // 0x50(0x10)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class GameUserSettings: public Object
{
public:
	bool                                                         bUseVSync;                                         // 0x28(0x1)
	uint32                                                       ResolutionSizeX;                                   // 0x48(0x4)
	uint32                                                       ResolutionSizeY;                                   // 0x4c(0x4)
	uint32                                                       LastUserConfirmedResolutionSizeX;                  // 0x50(0x4)
	uint32                                                       LastUserConfirmedResolutionSizeY;                  // 0x54(0x4)
	int                                                          WindowPosX;                                        // 0x58(0x4)
	int                                                          WindowPosY;                                        // 0x5c(0x4)
	bool                                                         bUseDesktopResolutionForFullscreen;                // 0x60(0x1)
	int                                                          FullscreenMode;                                    // 0x64(0x4)
	int                                                          LastConfirmedFullscreenMode;                       // 0x68(0x4)
	uint32                                                       Version;                                           // 0x6c(0x4)
	int                                                          AudioQualityLevel;                                 // 0x70(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class InterpTrackInstVisibility: public InterpTrackInst
{
public:
	char                                                         Action;                                            // 0x28(0x1)
	float                                                        LastUpdatePosition;                                // 0x2c(0x4)
};


// Size 0x10 (Full Size[0x60] - InheritedSize[0x50]
class ParticleModuleEventGeneratorGPU: public ParticleModuleEventBase
{
public:
	TArray<struct ParticleEventGPU_GenerateInfo>                 Events;                                            // 0x50(0x10)
};


// Size 0x80 (Full Size[0xa8] - InheritedSize[0x28]
class EngineMessage: public LocalMessage
{
public:
	struct FString                                               FailedPlaceMessage;                                // 0x28(0x10)
	struct FString                                               MaxedOutMessage;                                   // 0x38(0x10)
	struct FString                                               EnteredMessage;                                    // 0x48(0x10)
	struct FString                                               LeftMessage;                                       // 0x58(0x10)
	struct FString                                               GlobalNameChange;                                  // 0x68(0x10)
	struct FString                                               SpecEnteredMessage;                                // 0x78(0x10)
	struct FString                                               NewPlayerMessage;                                  // 0x88(0x10)
	struct FString                                               NewSpecMessage;                                    // 0x98(0x10)
};


// Size 0x128 (Full Size[0x178] - InheritedSize[0x50]
class ParticleModuleLocation: public ParticleModuleLocationBase
{
public:
	struct RawDistributionVector                                 StartLocation;                                     // 0x50(0x38)
	struct RawDistributionVector                                 AdditionalStartLocations;                          // 0x88(0x38)
	bool                                                         StartLocationUseGroupAForAll;                      // 0x168(0x1)
	float                                                        DistributeOverNPoints;                             // 0x16c(0x4)
	float                                                        DistributeThreshold;                               // 0x170(0x4)
};


// Size 0x38 (Full Size[0x88] - InheritedSize[0x50]
class ParticleModuleRotationRateMultiplyLife: public ParticleModuleRotationRateBase
{
public:
	struct RawDistributionFloat                                  LifeMultiplier;                                    // 0x50(0x38)
};


// Size 0xe8 (Full Size[0x138] - InheritedSize[0x50]
class ParticleModuleLight: public ParticleModuleLightBase
{
public:
	bool                                                         bUseInverseSquaredFalloff;                         // 0x50(0x1)
	bool                                                         bAffectsTranslucency;                              // 0x51(0x1)
	bool                                                         bIgnoreComponentTint;                              // 0x52(0x1)
	bool                                                         bPreviewLightRadius;                               // 0x53(0x1)
	float                                                        SpawnFraction;                                     // 0x54(0x4)
	struct RawDistributionVector                                 ColorScaleOverLife;                                // 0x58(0x38)
	struct RawDistributionFloat                                  BrightnessOverLife;                                // 0x90(0x38)
	struct RawDistributionFloat                                  RadiusScale;                                       // 0xc8(0x38)
	struct RawDistributionFloat                                  LightExponent;                                     // 0x100(0x38)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class MaterialParameterCollection: public Object
{
public:
	struct Guid                                                  StateId;                                           // 0x28(0x10)
	TArray<struct CollectionScalarParameter>                     ScalarParameters;                                  // 0x38(0x10)
	TArray<struct CollectionVectorParameter>                     VectorParameters;                                  // 0x48(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class StringArrayDataAsset: public DataAsset
{
public:
	TArray<String>                                               Array;                                             // 0x28(0x10)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class MaterialInterface: public Object
{
public:
	class SubsurfaceProfile*                                     SubsurfaceProfile;                                 // 0x30(0x8)
	struct LightmassMaterialInterfaceSettings                    LightmassSettings;                                 // 0x3c(0x14)
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class CameraShake: public Object
{
public:
	bool                                                         bSingleInstance;                                   // 0x28(0x1)
	float                                                        OscillationDuration;                               // 0x2c(0x4)
	float                                                        OscillationBlendInTime;                            // 0x30(0x4)
	float                                                        OscillationBlendOutTime;                           // 0x34(0x4)
	struct ROscillator                                           RotOscillation;                                    // 0x38(0x24)
	struct VOscillator                                           LocOscillation;                                    // 0x5c(0x24)
	struct FOscillator                                           FOVOscillation;                                    // 0x80(0xc)
	float                                                        AnimPlayRate;                                      // 0x8c(0x4)
	float                                                        AnimScale;                                         // 0x90(0x4)
	float                                                        AnimBlendInTime;                                   // 0x94(0x4)
	float                                                        AnimBlendOutTime;                                  // 0x98(0x4)
	float                                                        RandomAnimSegmentDuration;                         // 0x9c(0x4)
	class CameraAnim*                                            Anim;                                              // 0xa0(0x8)
	bool                                                         bRandomAnimSegment;                                // 0xa8(0x1)
	class PlayerCameraManager*                                   CameraOwner;                                       // 0xc0(0x8)
	float                                                        ShakeScale;                                        // 0x130(0x4)
	float                                                        OscillatorTimeRemaining;                           // 0x134(0x4)
	class CameraAnimInst*                                        AnimInst;                                          // 0x138(0x8)
};


// Size 0xd0 (Full Size[0x120] - InheritedSize[0x50]
class ParticleModuleBeamSource: public ParticleModuleBeamBase
{
public:
	char                                                         SourceMethod;                                      // 0x50(0x1)
	struct FName                                                 SourceName;                                        // 0x54(0x8)
	bool                                                         bSourceAbsolute;                                   // 0x5c(0x1)
	struct RawDistributionVector                                 Source;                                            // 0x60(0x38)
	bool                                                         bLockSource;                                       // 0x98(0x1)
	char                                                         SourceTangentMethod;                               // 0x9c(0x1)
	struct RawDistributionVector                                 SourceTangent;                                     // 0xa0(0x38)
	bool                                                         bLockSourceTangent;                                // 0xd8(0x1)
	struct RawDistributionFloat                                  SourceStrength;                                    // 0xe0(0x38)
	bool                                                         bLockSourceStength;                                // 0x118(0x1)
};


// Size 0x88 (Full Size[0xb0] - InheritedSize[0x28]
class ParticleEmitter: public Object
{
public:
	struct FName                                                 EmitterName;                                       // 0x28(0x8)
	int                                                          SubUVDataOffset;                                   // 0x30(0x4)
	char                                                         EmitterRenderMode;                                 // 0x34(0x1)
	TArray<class ParticleLODLevel*>                              LODLevels;                                         // 0x38(0x10)
	bool                                                         ConvertedModules;                                  // 0x48(0x1)
	int                                                          PeakActiveParticles;                               // 0x4c(0x4)
	int                                                          InitialAllocationCount;                            // 0x50(0x4)
	float                                                        MediumDetailSpawnRateScale;                        // 0x54(0x4)
	float                                                        QualityLevelSpawnRateScale;                        // 0x58(0x4)
	char                                                         DetailMode;                                        // 0x5c(0x1)
	char                                                         MaxEmitterQuality;                                 // 0x5d(0x1)
	char                                                         MinEmitterQuality;                                 // 0x5e(0x1)
	bool                                                         bIsSoloing;                                        // 0x60(0x1)
	bool                                                         bCookedOut;                                        // 0x60(0x1)
	bool                                                         bDisabledLODsKeepEmitterAlive;                     // 0x60(0x1)
	bool                                                         bHasAnyEnabledLODs;                                // 0x60(0x1)
	bool                                                         bHasAnyEnabledLODsValid;                           // 0x60(0x1)
	TArray<class ParticleModule*>                                ModulesNeedingInstanceData;                        // 0xa0(0x10)
};


// Size 0x3b0 (Full Size[0x3d8] - InheritedSize[0x28]
class NavigationSystem: public BlueprintFunctionLibrary
{
public:
	class NavigationData*                                        MainNavData;                                       // 0x28(0x8)
	class NavigationData*                                        AbstractNavData;                                   // 0x30(0x8)
	bool                                                         bAutoCreateNavigationData;                         // 0x38(0x1)
	bool                                                         bAllowClientSideNavigation;                        // 0x38(0x1)
	bool                                                         bSupportRebuilding;                                // 0x38(0x1)
	bool                                                         bInitialBuildingLocked;                            // 0x38(0x1)
	bool                                                         bSkipAgentHeightCheckWhenPickingNavData;           // 0x38(0x1)
	char                                                         DataGatheringMode;                                 // 0x3c(0x1)
	bool                                                         bGenerateNavigationOnlyAroundNavigationInvokers;   // 0x40(0x1)
	float                                                        ActiveTilesUpdateInterval;                         // 0x44(0x4)
	TArray<struct NavDataConfig>                                 SupportedAgents;                                   // 0x48(0x10)
	float                                                        DirtyAreasUpdateFreq;                              // 0x58(0x4)
	TArray<class NavigationData*>                                NavDataSet;                                        // 0x60(0x10)
	TArray<class NavigationData*>                                NavDataRegistrationQueue;                          // 0x70(0x10)
	multicastinlinedelegate                                      OnNavDataRegisteredEvent;                          // 0xe0(0x10)
	multicastinlinedelegate                                      OnNavigationGenerationFinishedDelegate;            // 0xf0(0x10)
	char                                                         OperationMode;                                     // 0x1cc(0x1)
	struct StringAssetReference                                  InstancedNavMeshesDataAsset;                       // 0x3c0(0x10)
	class InstancedNavMeshesDataAsset*                           InstancedNavMeshesData;                            // 0x3d0(0x8)
};


// Size 0x2b8 (Full Size[0x308] - InheritedSize[0x50]
class ParticleModuleColor: public ParticleModuleColorBase
{
public:
	bool                                                         bUseGroupAColorForAllGroups;                       // 0x50(0x1)
	struct RawDistributionVector                                 StartColor;                                        // 0x58(0x38)
	struct RawDistributionVector                                 AdditionalStartColor;                              // 0x90(0x38)
	bool                                                         bUseGroupAAlphaForAllGroups;                       // 0x1a8(0x1)
	struct RawDistributionFloat                                  StartAlpha;                                        // 0x1b0(0x38)
	struct RawDistributionFloat                                  AdditionalStartAlpha;                              // 0x1e8(0x38)
	bool                                                         bClampAlpha;                                       // 0x300(0x1)
	bool                                                         bIgnoreComponentColorTint;                         // 0x300(0x1)
};


// Size 0x78 (Full Size[0xc8] - InheritedSize[0x50]
class ParticleModuleColorScaleOverLife: public ParticleModuleColorBase
{
public:
	struct RawDistributionVector                                 ColorScaleOverLife;                                // 0x50(0x38)
	struct RawDistributionFloat                                  AlphaScaleOverLife;                                // 0x88(0x38)
	bool                                                         bEmitterTime;                                      // 0xc0(0x1)
};


// Size 0x60 (Full Size[0xb0] - InheritedSize[0x50]
class ParticleModuleLocationSkelVertSurface: public ParticleModuleLocationBase
{
public:
	char                                                         SourceType;                                        // 0x50(0x1)
	struct Vector                                                UniversalOffset;                                   // 0x54(0xc)
	bool                                                         bUpdatePositionEachFrame;                          // 0x60(0x1)
	bool                                                         bOrientMeshEmitters;                               // 0x60(0x1)
	bool                                                         bInheritBoneVelocity;                              // 0x60(0x1)
	struct FName                                                 SkelMeshActorParamName;                            // 0x64(0x8)
	TArray<struct Name>                                          ValidAssociatedBones;                              // 0x70(0x10)
	bool                                                         bEnforceNormalCheck;                               // 0x80(0x1)
	struct Vector                                                NormalToCompare;                                   // 0x84(0xc)
	float                                                        NormalCheckToleranceDegrees;                       // 0x90(0x4)
	float                                                        NormalCheckTolerance;                              // 0x94(0x4)
	TArray<int>                                                  ValidMaterialIndices;                              // 0x98(0x10)
	bool                                                         bInheritVertexColor;                               // 0xa8(0x1)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class SoundClass: public Object
{
public:
	struct SoundClassProperties                                  Properties;                                        // 0x28(0x24)
	TArray<class SoundClass*>                                    ChildClasses;                                      // 0x50(0x10)
	TArray<struct PassiveSoundMixModifier>                       PassiveSoundMixModifiers;                          // 0x60(0x10)
	class SoundClass*                                            ParentClass;                                       // 0x70(0x8)
};


// Size 0x30 (Full Size[0x430] - InheritedSize[0x400]
class PrecomputedVisibilityOverrideVolume: public Volume
{
public:
	TArray<class Actor*>                                         OverrideVisibleActors;                             // 0x400(0x10)
	TArray<class Actor*>                                         OverrideInvisibleActors;                           // 0x410(0x10)
	TArray<struct Name>                                          OverrideInvisibleLevels;                           // 0x420(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AISystemBase: public Object
{
public:
	struct StringClassReference                                  AISystemClassName;                                 // 0x28(0x10)
	struct FName                                                 AISystemModuleName;                                // 0x38(0x8)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class InterpTrackInstFloatParticleParam: public InterpTrackInst
{
public:
	float                                                        ResetFloat;                                        // 0x28(0x4)
};


// Size 0x20 (Full Size[0x198] - InheritedSize[0x178]
class ParticleModuleLocationWorldOffset_Seeded: public ParticleModuleLocationWorldOffset
{
public:
	struct ParticleRandomSeedInfo                                RandomSeedInfo;                                    // 0x178(0x20)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class MaybeCompressedCanvasRenderTarget2D: public Object
{
public:
	multicastinlinedelegate                                      OnCanvasUpdate;                                    // 0x28(0x10)
	int                                                          ChannelCount;                                      // 0x38(0x4)
	class CanvasRenderTarget2D*                                  UncompressedRenderTarget;                          // 0x40(0x8)
	class CompressedCanvasRenderTarget2D*                        CompressedRenderTarget;                            // 0x48(0x8)
};


// Size 0x48 (Full Size[0x80] - InheritedSize[0x38]
class AnimationSettings: public DeveloperSettings
{
public:
	TArray<float>                                                DefaultVisibleDistanceFactorThresholds;            // 0x38(0x10)
	int                                                          CompressCommandletVersion;                         // 0x48(0x4)
	TArray<String>                                               KeyEndEffectorsMatchNameArray;                     // 0x50(0x10)
	class UClass*                                                DefaultCompressionAlgorithm;                       // 0x60(0x8)
	char                                                         RotationCompressionFormat;                         // 0x68(0x1)
	char                                                         TranslationCompressionFormat;                      // 0x69(0x1)
	float                                                        AlternativeCompressionThreshold;                   // 0x6c(0x4)
	bool                                                         ForceRecompression;                                // 0x70(0x1)
	bool                                                         bOnlyCheckForMissingSkeletalMeshes;                // 0x71(0x1)
	bool                                                         bForceBelowThreshold;                              // 0x72(0x1)
	bool                                                         bFirstRecompressUsingCurrentOrDefault;             // 0x73(0x1)
	bool                                                         bRaiseMaxErrorToExisting;                          // 0x74(0x1)
	bool                                                         bTryFixedBitwiseCompression;                       // 0x75(0x1)
	bool                                                         bTryPerTrackBitwiseCompression;                    // 0x76(0x1)
	bool                                                         bTryLinearKeyRemovalCompression;                   // 0x77(0x1)
	bool                                                         bTryIntervalKeyRemoval;                            // 0x78(0x1)
	bool                                                         bStripAnimationDataOnDedicatedServer;              // 0x79(0x1)
};


// Size 0x80 (Full Size[0xc0] - InheritedSize[0x40]
class NavAreaMeta_SwitchByAgent: public NavAreaMeta
{
public:
	class UClass*                                                Agent0Area;                                        // 0x40(0x8)
	class UClass*                                                Agent1Area;                                        // 0x48(0x8)
	class UClass*                                                Agent2Area;                                        // 0x50(0x8)
	class UClass*                                                Agent3Area;                                        // 0x58(0x8)
	class UClass*                                                Agent4Area;                                        // 0x60(0x8)
	class UClass*                                                Agent5Area;                                        // 0x68(0x8)
	class UClass*                                                Agent6Area;                                        // 0x70(0x8)
	class UClass*                                                Agent7Area;                                        // 0x78(0x8)
	class UClass*                                                Agent8Area;                                        // 0x80(0x8)
	class UClass*                                                Agent9Area;                                        // 0x88(0x8)
	class UClass*                                                Agent10Area;                                       // 0x90(0x8)
	class UClass*                                                Agent11Area;                                       // 0x98(0x8)
	class UClass*                                                Agent12Area;                                       // 0xa0(0x8)
	class UClass*                                                Agent13Area;                                       // 0xa8(0x8)
	class UClass*                                                Agent14Area;                                       // 0xb0(0x8)
	class UClass*                                                Agent15Area;                                       // 0xb8(0x8)
};


// Size 0x8 (Full Size[0x58] - InheritedSize[0x50]
class ParticleModulePivotOffset: public ParticleModuleLocationBase
{
public:
	struct Vector2D                                              PivotOffset;                                       // 0x50(0x8)
};


// Size 0x78 (Full Size[0xc8] - InheritedSize[0x50]
class ParticleModuleWindInfluence: public ParticleModuleWindBase
{
public:
	float                                                        WindSpeedCap;                                      // 0x50(0x4)
	float                                                        RandomFactorForWindDirection;                      // 0x54(0x4)
	struct RawDistributionFloat                                  InfluenceOnAcceleration;                           // 0x58(0x38)
	struct RawDistributionFloat                                  InfluenceOnVelocity;                               // 0x90(0x38)
};


// Size 0x78 (Full Size[0xc8] - InheritedSize[0x50]
class ParticleModuleColorOverLife: public ParticleModuleColorBase
{
public:
	struct RawDistributionVector                                 ColorOverLife;                                     // 0x50(0x38)
	struct RawDistributionFloat                                  AlphaOverLife;                                     // 0x88(0x38)
	bool                                                         bClampAlpha;                                       // 0xc0(0x1)
};


// Size 0x10 (Full Size[0x88] - InheritedSize[0x78]
class AnimComposite: public AnimCompositeBase
{
public:
	struct AnimTrack                                             AnimationTrack;                                    // 0x78(0x10)
};


// Size 0xd8 (Full Size[0x110] - InheritedSize[0x38]
class RendererSettings: public DeveloperSettings
{
public:
	bool                                                         bMobileHDR;                                        // 0x38(0x1)
	uint32                                                       MobileNumDynamicPointLights;                       // 0x3c(0x4)
	bool                                                         bMobileDynamicPointLightsUseStaticBranch;          // 0x40(0x1)
	bool                                                         bOcclusionCulling;                                 // 0x40(0x1)
	float                                                        MinScreenRadiusForLights;                          // 0x44(0x4)
	float                                                        MinScreenRadiusForEarlyZPass;                      // 0x48(0x4)
	float                                                        MinScreenRadiusForCSMdepth;                        // 0x4c(0x4)
	bool                                                         bPrecomputedVisibilityWarning;                     // 0x50(0x1)
	bool                                                         bTextureStreaming;                                 // 0x50(0x1)
	bool                                                         bUseDXT5NormalMaps;                                // 0x50(0x1)
	bool                                                         bAllowStaticLighting;                              // 0x50(0x1)
	bool                                                         bUseNormalMapsForStaticLighting;                   // 0x50(0x1)
	bool                                                         bGenerateMeshDistanceFields;                       // 0x50(0x1)
	bool                                                         bGenerateLandscapeGIData;                          // 0x50(0x1)
	float                                                        TessellationAdaptivePixelsPerTriangle;             // 0x54(0x4)
	bool                                                         bSeparateTranslucency;                             // 0x58(0x1)
	char                                                         TranslucentSortPolicy;                             // 0x5c(0x1)
	struct Vector                                                TranslucentSortAxis;                               // 0x60(0xc)
	char                                                         CustomDepthStencil;                                // 0x6c(0x1)
	bool                                                         bDefaultFeatureBloom;                              // 0x70(0x1)
	bool                                                         bDefaultFeatureAmbientOcclusion;                   // 0x70(0x1)
	bool                                                         bDefaultFeatureAmbientOcclusionStaticFraction;     // 0x70(0x1)
	bool                                                         bDefaultFeatureAutoExposure;                       // 0x70(0x1)
	bool                                                         bDefaultFeatureMotionBlur;                         // 0x70(0x1)
	bool                                                         bDefaultFeatureLensFlare;                          // 0x70(0x1)
	char                                                         DefaultFeatureAntiAliasing;                        // 0x74(0x1)
	char                                                         EarlyZPass;                                        // 0x75(0x1)
	char                                                         bDepthSort;                                        // 0x76(0x1)
	bool                                                         bEarlyZPassMovable;                                // 0x78(0x1)
	bool                                                         bDBuffer;                                          // 0x78(0x1)
	char                                                         ClearSceneMethod;                                  // 0x7c(0x1)
	bool                                                         bBasePassOutputsVelocity;                          // 0x80(0x1)
	float                                                        WireframeCullThreshold;                            // 0x84(0x4)
	char                                                         UIScaleRule;                                       // 0x88(0x1)
	struct RuntimeFloatCurve                                     UIScaleCurve;                                      // 0x90(0x80)
};


// Size 0x38 (Full Size[0x88] - InheritedSize[0x50]
class ParticleModuleMeshRotationRate: public ParticleModuleRotationRateBase
{
public:
	struct RawDistributionVector                                 StartRotationRate;                                 // 0x50(0x38)
};


// Size 0x30 (Full Size[0x80] - InheritedSize[0x50]
class ParticleModuleTypeDataRibbon: public ParticleModuleTypeDataBase
{
public:
	int                                                          MaxTessellationBetweenParticles;                   // 0x50(0x4)
	int                                                          SheetsPerTrail;                                    // 0x54(0x4)
	int                                                          MaxTrailCount;                                     // 0x58(0x4)
	int                                                          MaxParticleInTrailCount;                           // 0x5c(0x4)
	bool                                                         bDeadTrailsOnDeactivate;                           // 0x60(0x1)
	bool                                                         bDeadTrailsOnSourceLoss;                           // 0x60(0x1)
	bool                                                         bClipSourceSegement;                               // 0x60(0x1)
	bool                                                         bEnablePreviousTangentRecalculation;               // 0x60(0x1)
	bool                                                         bTangentRecalculationEveryFrame;                   // 0x60(0x1)
	bool                                                         bSpawnInitialParticle;                             // 0x60(0x1)
	char                                                         RenderAxis;                                        // 0x64(0x1)
	float                                                        TangentSpawningScalar;                             // 0x68(0x4)
	bool                                                         bRenderGeometry;                                   // 0x6c(0x1)
	bool                                                         bRenderSpawnPoints;                                // 0x6c(0x1)
	bool                                                         bRenderTangents;                                   // 0x6c(0x1)
	bool                                                         bRenderTessellation;                               // 0x6c(0x1)
	float                                                        TilingDistance;                                    // 0x70(0x4)
	float                                                        DistanceTessellationStepSize;                      // 0x74(0x4)
	bool                                                         bEnableTangentDiffInterpScale;                     // 0x78(0x1)
	float                                                        TangentTessellationScalar;                         // 0x7c(0x4)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class DistributionFloat: public Distribution
{
public:
	bool                                                         bCanBeBaked;                                       // 0x30(0x1)
};


// Size 0x48 (Full Size[0x410] - InheritedSize[0x3c8]
class GameState: public Info
{
public:
	class UClass*                                                GameModeClass;                                     // 0x3c8(0x8)
	class GameMode*                                              AuthorityGameMode;                                 // 0x3d0(0x8)
	class UClass*                                                SpectatorClass;                                    // 0x3d8(0x8)
	struct FName                                                 MatchState;                                        // 0x3e0(0x8)
	struct FName                                                 PreviousMatchState;                                // 0x3e8(0x8)
	TArray<class PlayerState*>                                   PlayerArray;                                       // 0x3f0(0x10)
	float                                                        ReplicatedWorldTimeSeconds;                        // 0x400(0x4)
	float                                                        ServerWorldTimeSecondsDelta;                       // 0x404(0x4)
	float                                                        ServerWorldTimeSecondsUpdateFrequency;             // 0x408(0x4)
};


// Size 0x10 (Full Size[0x60] - InheritedSize[0x50]
class ParticleModuleEventReceiverBase: public ParticleModuleEventBase
{
public:
	char                                                         EventGeneratorType;                                // 0x50(0x1)
	struct FName                                                 EventName;                                         // 0x54(0x8)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class InterpGroupInst: public Object
{
public:
	class InterpGroup*                                           Group;                                             // 0x28(0x8)
	class Actor*                                                 GroupActor;                                        // 0x30(0x8)
	TArray<class InterpTrackInst*>                               TrackInst;                                         // 0x38(0x10)
};


// Size 0x1e0 (Full Size[0x210] - InheritedSize[0x30]
class CurveLinearColor: public CurveBase
{
public:
	struct RichCurve                                             FloatCurves;                                       // 0x30(0x78)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class InterpTrackInstFloatAnimBPParam: public InterpTrackInst
{
public:
	class AnimInstance*                                          AnimScriptInstance;                                // 0x28(0x8)
	float                                                        ResetFloat;                                        // 0x30(0x4)
};


// Size 0x5f0 (Full Size[0x618] - InheritedSize[0x28]
class CheckBoxStyleAsset: public Object
{
public:
	struct CheckBoxStyle                                         CheckBoxStyle;                                     // 0x28(0x5f0)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class LightmassPrimitiveSettingsObject: public Object
{
public:
	struct LightmassPrimitiveSettings                            LightmassSettings;                                 // 0x28(0x18)
};


// Size 0x7d8 (Full Size[0x800] - InheritedSize[0x28]
class World: public Object
{
public:
	class Level*                                                 PersistentLevel;                                   // 0x30(0x8)
	class NetDriver*                                             NetDriver;                                         // 0x38(0x8)
	class LineBatchComponent*                                    LineBatcher;                                       // 0x40(0x8)
	class LineBatchComponent*                                    PersistentLineBatcher;                             // 0x48(0x8)
	class LineBatchComponent*                                    ForegroundLineBatcher;                             // 0x50(0x8)
	class GameState*                                             GameState;                                         // 0x58(0x8)
	class GameNetworkManager*                                    NetworkManager;                                    // 0x60(0x8)
	class PhysicsCollisionHandler*                               PhysicsCollisionHandler;                           // 0x68(0x8)
	TArray<class Object*>                                        ExtraReferencedObjects;                            // 0x70(0x10)
	TArray<class Object*>                                        PerModuleDataObjects;                              // 0x80(0x10)
	TArray<class LevelStreaming*>                                StreamingLevels;                                   // 0x90(0x10)
	struct FString                                               StreamingLevelsPrefix;                             // 0xa0(0x10)
	class Level*                                                 CurrentLevelPendingVisibility;                     // 0xb0(0x8)
	class ParticleEventManager*                                  MyParticleEventManager;                            // 0xb8(0x8)
	class PhysicsVolume*                                         DefaultPhysicsVolume;                              // 0xc0(0x8)
	TArray<class LevelStreaming*>                                DirtyStreamingLevels;                              // 0xc8(0x10)
	struct FName                                                 Feature;                                           // 0xf4(0x8)
	TArray<struct Name>                                          FeatureReferences;                                 // 0x100(0x10)
	bool                                                         ParticleLOD_bUseGameThread;                        // 0x110(0x1)
	bool                                                         ParticleLOD_bUseMultipleViewportCase;              // 0x111(0x1)
	struct Vector                                                ParticleLOD_PlayerViewpointLocation;               // 0x114(0xc)
	struct FString                                               TestMetadata;                                      // 0x120(0x10)
	class NavigationSystem*                                      NavigationSystem;                                  // 0x130(0x8)
	class GameMode*                                              AuthorityGameMode;                                 // 0x138(0x8)
	class AISystemBase*                                          AISystem;                                          // 0x140(0x8)
	class AvoidanceManager*                                      AvoidanceManager;                                  // 0x148(0x8)
	TArray<class Level*>                                         Levels;                                            // 0x150(0x10)
	class Level*                                                 CurrentLevel;                                      // 0x1b0(0x8)
	class GameInstance*                                          OwningGameInstance;                                // 0x1c0(0x8)
	TArray<class MaterialParameterCollectionInstance*>           ParameterCollectionInstances;                      // 0x1c8(0x10)
	class WorldComposition*                                      WorldComposition;                                  // 0x728(0x8)
	bool                                                         bAreConstraintsDirty;                              // 0x76d(0x1)
};


// Size 0x40 (Full Size[0x90] - InheritedSize[0x50]
class ParticleModuleSizeScale: public ParticleModuleSizeBase
{
public:
	struct RawDistributionVector                                 SizeScale;                                         // 0x50(0x38)
	bool                                                         EnableX;                                           // 0x88(0x1)
	bool                                                         EnableY;                                           // 0x88(0x1)
	bool                                                         EnableZ;                                           // 0x88(0x1)
};


// Size 0x2a0 (Full Size[0x2c8] - InheritedSize[0x28]
class BodySetup: public Object
{
public:
	struct KAggregateGeom                                        AggGeom;                                           // 0x28(0x48)
	struct FName                                                 BoneName;                                          // 0x70(0x8)
	char                                                         PhysicsType;                                       // 0x78(0x1)
	bool                                                         bCookComplexGeometryOnServer;                      // 0x7c(0x1)
	bool                                                         bConsiderForBounds;                                // 0x7c(0x1)
	bool                                                         bMeshCollideAll;                                   // 0x7c(0x1)
	bool                                                         bDoubleSidedGeometry;                              // 0x7c(0x1)
	bool                                                         bGenerateNonMirroredCollision;                     // 0x7c(0x1)
	bool                                                         bSharedCookedData;                                 // 0x7c(0x1)
	bool                                                         bGenerateMirroredCollision;                        // 0x7c(0x1)
	class PhysicalMaterial*                                      PhysMaterial;                                      // 0x80(0x8)
	char                                                         CollisionReponse;                                  // 0x88(0x1)
	char                                                         CollisionTraceFlag;                                // 0x89(0x1)
	struct BodyInstance                                          DefaultInstance;                                   // 0x90(0x180)
	struct WalkableSlopeOverride                                 WalkableSlopeOverride;                             // 0x210(0x8)
	struct Vector                                                BuildScale3D;                                      // 0x218(0xc)
};


// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class DestructibleFractureSettings: public Object
{
public:
	int                                                          CellSiteCount;                                     // 0x28(0x4)
	struct FractureMaterial                                      FractureMaterialDesc;                              // 0x2c(0x24)
	int                                                          RandomSeed;                                        // 0x50(0x4)
	TArray<struct Vector>                                        VoronoiSites;                                      // 0x58(0x10)
	int                                                          OriginalSubmeshCount;                              // 0x68(0x4)
	TArray<class MaterialInterface*>                             Materials;                                         // 0x70(0x10)
	TArray<struct DestructibleChunkParameters>                   ChunkParameters;                                   // 0x80(0x10)
	TArray<String>                                               MaterialNames;                                     // 0x90(0x10)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class PhysicsThruster: public RigidBodyBase
{
public:
	class PhysicsThrusterComponent*                              ThrusterComponent;                                 // 0x3c8(0x8)
};


// Size 0x90 (Full Size[0xc8] - InheritedSize[0x38]
class PhysicsSettings: public DeveloperSettings
{
public:
	float                                                        DefaultGravityZ;                                   // 0x38(0x4)
	float                                                        DefaultTerminalVelocity;                           // 0x3c(0x4)
	float                                                        DefaultFluidFriction;                              // 0x40(0x4)
	int                                                          SimulateScratchMemorySize;                         // 0x44(0x4)
	int                                                          RagdollAggregateThreshold;                         // 0x48(0x4)
	float                                                        TriangleMeshTriangleMinAreaThreshold;              // 0x4c(0x4)
	bool                                                         bEnableAsyncScene;                                 // 0x50(0x1)
	bool                                                         bEnableShapeSharing;                               // 0x51(0x1)
	bool                                                         bEnablePCM;                                        // 0x52(0x1)
	bool                                                         bWarnMissingLocks;                                 // 0x53(0x1)
	bool                                                         bEnable2DPhysics;                                  // 0x54(0x1)
	char                                                         LockedAxis;                                        // 0x55(0x1)
	char                                                         DefaultDegreesOfFreedom;                           // 0x56(0x1)
	float                                                        BounceThresholdVelocity;                           // 0x58(0x4)
	char                                                         FrictionCombineMode;                               // 0x5c(0x1)
	char                                                         RestitutionCombineMode;                            // 0x5d(0x1)
	float                                                        MaxAngularVelocity;                                // 0x60(0x4)
	float                                                        MaxDepenetrationVelocity;                          // 0x64(0x4)
	bool                                                         bSimulateSkeletalMeshOnDedicatedServer;            // 0x68(0x1)
	bool                                                         bDefaultHasComplexCollision;                       // 0x69(0x1)
	float                                                        MaxPhysicsDeltaTime;                               // 0x6c(0x4)
	bool                                                         bSubstepping;                                      // 0x70(0x1)
	bool                                                         bSubsteppingAsync;                                 // 0x71(0x1)
	float                                                        MaxSubstepDeltaTime;                               // 0x74(0x4)
	int                                                          MaxSubsteps;                                       // 0x78(0x4)
	float                                                        SyncSceneSmoothingFactor;                          // 0x7c(0x4)
	float                                                        AsyncSceneSmoothingFactor;                         // 0x80(0x4)
	float                                                        InitialAverageFrameRate;                           // 0x84(0x4)
	TArray<struct PhysicalSurfaceName>                           PhysicalSurfaces;                                  // 0x88(0x10)
	TArray<struct DominanceGroupPair>                            DominanceGroups;                                   // 0x98(0x10)
	TArray<struct DominanceGroupName>                            DominanceGroupNames;                               // 0xa8(0x10)
	char                                                         DefaultStaticDominanceGroup;                       // 0xb8(0x1)
	char                                                         DefaultMovableDominanceGroup;                      // 0xb9(0x1)
	bool                                                         bEnableMBP;                                        // 0xba(0x1)
	int                                                          MBPSubdivisions;                                   // 0xbc(0x4)
	float                                                        MBPWorldHalfExtentInCM;                            // 0xc0(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InterpTrackInstToggle: public InterpTrackInst
{
public:
	char                                                         Action;                                            // 0x28(0x1)
	float                                                        LastUpdatePosition;                                // 0x2c(0x4)
	bool                                                         bSavedActiveState;                                 // 0x30(0x1)
};


// Size 0x1b8 (Full Size[0x580] - InheritedSize[0x3c8]
class WorldSettings: public Info
{
public:
	bool                                                         bEnableWorldBoundsChecks;                          // 0x3d0(0x1)
	bool                                                         bEnableNavigationSystem;                           // 0x3d0(0x1)
	char                                                         WorldCompositionSetting;                           // 0x3d4(0x1)
	struct StringAssetReference                                  InstancedNavMeshesDataAssetOveride;                // 0x3d8(0x10)
	bool                                                         bEnableWorldOriginRebasing;                        // 0x3e8(0x1)
	bool                                                         bWorldGravitySet;                                  // 0x3e8(0x1)
	bool                                                         bGlobalGravitySet;                                 // 0x3e8(0x1)
	float                                                        KillZ;                                             // 0x3ec(0x4)
	class UClass*                                                KillZDamageType;                                   // 0x3f0(0x8)
	float                                                        GlobalGravityZ;                                    // 0x3f8(0x4)
	class UClass*                                                DefaultPhysicsVolumeClass;                         // 0x400(0x8)
	class UClass*                                                PhysicsCollisionHandlerClass;                      // 0x408(0x8)
	class UClass*                                                DefaultGameMode;                                   // 0x410(0x8)
	TArray<struct GameModePrefix>                                DefaultMapPrefixes;                                // 0x418(0x10)
	class UClass*                                                GameNetworkManagerClass;                           // 0x428(0x8)
	int                                                          PackedLightAndShadowMapTextureSize;                // 0x430(0x4)
	bool                                                         bMinimizeBSPSections;                              // 0x434(0x1)
	struct Vector                                                DefaultColorScale;                                 // 0x438(0xc)
	bool                                                         bPrecomputeVisibility;                             // 0x444(0x1)
	bool                                                         bPlaceCellsOnlyAlongCameraTracks;                  // 0x444(0x1)
	int                                                          VisibilityCellSize;                                // 0x448(0x4)
	char                                                         VisibilityAggressiveness;                          // 0x44c(0x1)
	bool                                                         bForceNoPrecomputedLighting;                       // 0x450(0x1)
	struct LightmassWorldInfoSettings                            LightmassSettings;                                 // 0x454(0x44)
	char                                                         LevelLightingQuality;                              // 0x498(0x1)
	struct ReverbSettings                                        DefaultReverbSettings;                             // 0x4a0(0x18)
	struct InteriorSettings                                      DefaultAmbientZoneSettings;                        // 0x4b8(0x24)
	class SoundMix*                                              DefaultBaseSoundMix;                               // 0x4e0(0x8)
	float                                                        WorldToMeters;                                     // 0x4e8(0x4)
	class BookMark*                                              BookMarks;                                         // 0x4f0(0x8)
	float                                                        TimeDilation;                                      // 0x540(0x4)
	float                                                        MatineeTimeDilation;                               // 0x544(0x4)
	float                                                        DemoPlayTimeDilation;                              // 0x548(0x4)
	bool                                                         bHighPriorityLoading;                              // 0x54c(0x1)
	bool                                                         bHighPriorityLoadingLocal;                         // 0x54c(0x1)
	TArray<struct NetViewer>                                     ReplicationViewers;                                // 0x550(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x560(0x10)
	float                                                        WorldGravityZ;                                     // 0x570(0x4)
	class PlayerState*                                           Pauser;                                            // 0x578(0x8)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class NavigationDataChunk: public Object
{
public:
	struct FName                                                 NavigationDataName;                                // 0x28(0x8)
};


// Size 0x78 (Full Size[0xc8] - InheritedSize[0x50]
class ParticleModuleKillBox: public ParticleModuleKillBase
{
public:
	struct RawDistributionVector                                 LowerLeftCorner;                                   // 0x50(0x38)
	struct RawDistributionVector                                 UpperRightCorner;                                  // 0x88(0x38)
	bool                                                         bAbsolute;                                         // 0xc0(0x1)
	bool                                                         bKillInside;                                       // 0xc0(0x1)
	bool                                                         bAxisAlignedAndFixedSize;                          // 0xc0(0x1)
};


// Size 0x10 (Full Size[0x68] - InheritedSize[0x58]
class UserDefinedEnum: public Enum
{
public:
	TArray<struct Text>                                          DisplayNames;                                      // 0x58(0x10)
};


// Size 0x30 (Full Size[0x3f8] - InheritedSize[0x3c8]
class GameSession: public Info
{
public:
	int                                                          MaxSpectators;                                     // 0x3c8(0x4)
	int                                                          MaxPlayers;                                        // 0x3cc(0x4)
	char                                                         MaxSplitscreensPerConnection;                      // 0x3d0(0x1)
	bool                                                         bRequiresPushToTalk;                               // 0x3d1(0x1)
	struct FName                                                 SessionName;                                       // 0x3d4(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InterpFilter: public Object
{
public:
	struct FString                                               Caption;                                           // 0x28(0x10)
};


// Size 0x240 (Full Size[0x268] - InheritedSize[0x28]
class Skeleton: public Object
{
public:
	TArray<struct BoneNode>                                      BoneTree;                                          // 0x28(0x10)
	TArray<struct SkeletonToMeshLinkup>                          LinkupCache;                                       // 0xb8(0x10)
	TArray<class SkeletalMeshSocket*>                            Sockets;                                           // 0xc8(0x10)
	struct SmartNameContainer                                    SmartNames;                                        // 0x128(0x50)
	TArray<struct AnimSlotGroup>                                 SlotGroups;                                        // 0x178(0x10)
};


// Size 0xf8 (Full Size[0x120] - InheritedSize[0x28]
class CameraAnimInst: public Object
{
public:
	class CameraAnim*                                            CamAnim;                                           // 0x28(0x8)
	class InterpGroupInst*                                       InterpGroupInst;                                   // 0x30(0x8)
	float                                                        PlayRate;                                          // 0x54(0x4)
	class InterpTrackMove*                                       MoveTrack;                                         // 0x68(0x8)
	class InterpTrackInstMove*                                   MoveInst;                                          // 0x70(0x8)
	class CurveFloat*                                            BlendInCurve;                                      // 0x78(0x8)
	char                                                         PlaySpace;                                         // 0x80(0x1)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class InterpCurveEdSetup: public Object
{
public:
	TArray<struct CurveEdTab>                                    Tabs;                                              // 0x28(0x10)
	int                                                          ActiveTab;                                         // 0x38(0x4)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class EdGraph: public Object
{
public:
	class UClass*                                                Schema;                                            // 0x28(0x8)
	TArray<class EdGraphNode*>                                   Nodes;                                             // 0x30(0x10)
	bool                                                         bEditable;                                         // 0x40(0x1)
	bool                                                         bAllowDeletion;                                    // 0x40(0x1)
	bool                                                         bAllowRenaming;                                    // 0x40(0x1)
};


// Size 0x170 (Full Size[0x1c0] - InheritedSize[0x50]
class ParticleModuleLifetime: public ParticleModuleLifetimeBase
{
public:
	bool                                                         bUseGroupAValuesForAllGroups;                      // 0x50(0x1)
	struct RawDistributionFloat                                  LifeTime;                                          // 0x58(0x38)
	struct RawDistributionFloat                                  AdditionalLifetimes;                               // 0x90(0x38)
};


// Size 0x18 (Full Size[0x68] - InheritedSize[0x50]
class ParticleModuleParameterDynamic: public ParticleModuleParameterBase
{
public:
	TArray<struct EmitterDynamicParameter>                       DynamicParams;                                     // 0x50(0x10)
	int                                                          UpdateFlags;                                       // 0x60(0x4)
	bool                                                         bUsesVelocity;                                     // 0x64(0x1)
};


// Size 0x10 (Full Size[0x60] - InheritedSize[0x50]
class ParticleModuleVectorFieldRotationRate: public ParticleModuleVectorFieldBase
{
public:
	struct Vector                                                RotationRate;                                      // 0x50(0xc)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class GameInstance: public Object
{
public:
	TArray<class LocalPlayer*>                                   LocalPlayers;                                      // 0x38(0x10)
	class OnlineSession*                                         OnlineSession;                                     // 0x50(0x8)
};


// Size 0x10 (Full Size[0x60] - InheritedSize[0x50]
class ParticleModuleKillOnFFTWater: public ParticleModuleKillBase
{
public:
	char                                                         FFTWaterKillPointLocation;                         // 0x50(0x1)
	bool                                                         bUseGroupAFFTWaterKillPointForAllGroups;           // 0x54(0x1)
	char                                                         AdditionalFFTWaterKillPointLocations;              // 0x58(0x1)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class InterpTrackInstParticleReplay: public InterpTrackInst
{
public:
	float                                                        LastUpdatePosition;                                // 0x28(0x4)
};


// Size 0xd0 (Full Size[0x120] - InheritedSize[0x50]
class ParticleModuleBeamTarget: public ParticleModuleBeamBase
{
public:
	char                                                         TargetMethod;                                      // 0x50(0x1)
	struct FName                                                 TargetName;                                        // 0x54(0x8)
	struct RawDistributionVector                                 Target;                                            // 0x60(0x38)
	bool                                                         bTargetAbsolute;                                   // 0x98(0x1)
	bool                                                         bLockTarget;                                       // 0x98(0x1)
	char                                                         TargetTangentMethod;                               // 0x9c(0x1)
	struct RawDistributionVector                                 TargetTangent;                                     // 0xa0(0x38)
	bool                                                         bLockTargetTangent;                                // 0xd8(0x1)
	struct RawDistributionFloat                                  TargetStrength;                                    // 0xe0(0x38)
	bool                                                         bLockTargetStength;                                // 0x118(0x1)
	float                                                        LockRadius;                                        // 0x11c(0x4)
};


// Size 0x418 (Full Size[0x440] - InheritedSize[0x28]
class AnimInstance: public Object
{
public:
	class Skeleton*                                              CurrentSkeleton;                                   // 0x28(0x8)
	TArray<struct AnimTickRecord>                                UngroupedActivePlayers;                            // 0x30(0x10)
	TArray<struct AnimGroupInstance>                             SyncGroups;                                        // 0x40(0x10)
	TArray<struct ActiveVertexAnim>                              VertexAnims;                                       // 0x50(0x10)
	char                                                         RootMotionMode;                                    // 0x60(0x1)
	bool                                                         bWarnAboutBlueprintUsage;                          // 0x61(0x1)
	multicastinlinedelegate                                      OnMontageBlendingOut;                              // 0x68(0x10)
	multicastinlinedelegate                                      OnMontageStarted;                                  // 0x78(0x10)
	multicastinlinedelegate                                      OnMontageEnded;                                    // 0x88(0x10)
	multicastinlinedelegate                                      OnStateEntered;                                    // 0x98(0x10)
	multicastinlinedelegate                                      OnStateExited;                                     // 0xa8(0x10)
	multicastinlinedelegate                                      OnStateInitialised;                                // 0xb8(0x10)
	multicastinlinedelegate                                      OnAnimUpdated;                                     // 0xc8(0x10)
	bool                                                         bQueueMontageEvents;                               // 0x148(0x1)
	TArray<struct AnimNotifyEvent>                               ActiveAnimNotifyState;                             // 0x240(0x10)
	int16                                                        SlotNodeInitializationCounter;                     // 0x350(0x2)
	int16                                                        GraphTraversalCounter;                             // 0x352(0x2)
	bool                                                         bBoneCachesInvalidated;                            // 0x3a8(0x1)
	bool                                                         bBlueprintAnimUpdateEnabled;                       // 0x438(0x1)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class VectorField: public Object
{
public:
	struct Box                                                   Bounds;                                            // 0x28(0x1c)
	float                                                        Intensity;                                         // 0x44(0x4)
};


// Size 0x2a8 (Full Size[0x2d0] - InheritedSize[0x28]
class ButtonStyleAsset: public Object
{
public:
	struct ButtonStyle                                           ButtonStyle;                                       // 0x28(0x2a8)
};


// Size 0x10 (Full Size[0x60] - InheritedSize[0x50]
class ParticleModuleMurkyColor: public ParticleModuleColorBase
{
public:
	struct LinearColor                                           ColorScale;                                        // 0x50(0x10)
};


// Size 0x158 (Full Size[0x1a8] - InheritedSize[0x50]
class ParticleModuleRotationRate: public ParticleModuleRotationRateBase
{
public:
	bool                                                         bUseGroupARotationRateForAllGroups;                // 0x50(0x1)
	struct RawDistributionFloat                                  StartRotationRate;                                 // 0x58(0x38)
	struct RawDistributionFloat                                  AdditionalStartRotationRate;                       // 0x90(0x38)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class AtmosphericFog: public Info
{
public:
	class AtmosphericFogComponent*                               AtmosphericFogComponent;                           // 0x3c8(0x8)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class NetworkClusteringSettings: public DeveloperSettings
{
public:
	float                                                        DynamicActorGridHalfSizeKm;                        // 0x38(0x4)
	float                                                        DynamicActorGridCellSizeKm;                        // 0x3c(0x4)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class NetworkSettings: public DeveloperSettings
{
public:
	bool                                                         bVerifyPeer;                                       // 0x38(0x1)
};


// Size 0x18 (Full Size[0x68] - InheritedSize[0x50]
class ParticleModuleAttractorPointGravity: public ParticleModuleAttractorBase
{
public:
	struct Vector                                                Position;                                          // 0x50(0xc)
	float                                                        Radius;                                            // 0x5c(0x4)
	class DistributionFloat*                                     Strength;                                          // 0x60(0x8)
};


// Size 0x80 (Full Size[0xb0] - InheritedSize[0x30]
class CurveFloat: public CurveBase
{
public:
	struct RichCurve                                             FloatCurve;                                        // 0x30(0x78)
	bool                                                         bIsEventCurve;                                     // 0xa8(0x1)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class SubsurfaceProfile: public Object
{
public:
	struct SubsurfaceProfileStruct                               Settings;                                          // 0x28(0x24)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class Layer: public Object
{
public:
	struct FName                                                 LayerName;                                         // 0x28(0x8)
	bool                                                         bIsVisible;                                        // 0x30(0x1)
	TArray<struct LayerActorStats>                               ActorStats;                                        // 0x38(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class InterpTrackInstAnimControl: public InterpTrackInst
{
public:
	float                                                        LastUpdatePosition;                                // 0x28(0x4)
};


// Size 0x8 (Full Size[0x58] - InheritedSize[0x50]
class ParticleModuleLocationEmitterDirect: public ParticleModuleLocationBase
{
public:
	struct FName                                                 EmitterName;                                       // 0x50(0x8)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class InterpTrack: public Object
{
public:
	TArray<class InterpTrack*>                                   SubTracks;                                         // 0x38(0x10)
	class UClass*                                                TrackInstClass;                                    // 0x48(0x8)
	char                                                         ActiveCondition;                                   // 0x50(0x1)
	struct FString                                               TrackTitle;                                        // 0x58(0x10)
	bool                                                         bOnePerGroup;                                      // 0x68(0x1)
	bool                                                         bDirGroupOnly;                                     // 0x68(0x1)
	bool                                                         bDisableTrack;                                     // 0x68(0x1)
	bool                                                         bIsSelected;                                       // 0x68(0x1)
	bool                                                         bIsAnimControlTrack;                               // 0x68(0x1)
	bool                                                         bSubTrackOnly;                                     // 0x68(0x1)
	bool                                                         bVisible;                                          // 0x68(0x1)
	bool                                                         bIsRecording;                                      // 0x68(0x1)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class DamageType: public Object
{
public:
	bool                                                         bCausedByWorld;                                    // 0x28(0x1)
	bool                                                         bScaleMomentumByMass;                              // 0x28(0x1)
	float                                                        DamageImpulse;                                     // 0x2c(0x4)
	bool                                                         bRadialDamageVelChange;                            // 0x30(0x1)
	float                                                        DestructibleImpulse;                               // 0x34(0x4)
	float                                                        DestructibleDamageSpreadScale;                     // 0x38(0x4)
	float                                                        DamageFalloff;                                     // 0x3c(0x4)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class NavigationPath: public Object
{
public:
	multicastinlinedelegate                                      PathUpdatedNotifier;                               // 0x28(0x10)
	TArray<struct Vector>                                        PathPoints;                                        // 0x38(0x10)
	char                                                         RecalculateOnInvalidation;                         // 0x48(0x1)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class PhysicalMaterial: public Object
{
public:
	float                                                        Friction;                                          // 0x28(0x4)
	char                                                         FrictionCombineMode;                               // 0x2c(0x1)
	bool                                                         bOverrideFrictionCombineMode;                      // 0x2d(0x1)
	float                                                        Restitution;                                       // 0x30(0x4)
	char                                                         RestitutionCombineMode;                            // 0x34(0x1)
	bool                                                         bOverrideRestitutionCombineMode;                   // 0x35(0x1)
	float                                                        Density;                                           // 0x38(0x4)
	float                                                        RaiseMassToPower;                                  // 0x3c(0x4)
	float                                                        DestructibleDamageThresholdScale;                  // 0x40(0x4)
	class PhysicalMaterialPropertyBase*                          PhysicalMaterialProperty;                          // 0x48(0x8)
	char                                                         SurfaceType;                                       // 0x50(0x1)
};


// Size 0x160 (Full Size[0x1b0] - InheritedSize[0x50]
class ParticleModuleSize: public ParticleModuleSizeBase
{
public:
	bool                                                         bUseGroupAForAll;                                  // 0x50(0x1)
	struct RawDistributionVector                                 StartSize;                                         // 0x58(0x38)
	struct RawDistributionVector                                 AdditionalStartSizes;                              // 0x90(0x38)
	bool                                                         bKeepAspectRatio;                                  // 0x1a8(0x1)
	bool                                                         bIgnoreComponentScale;                             // 0x1a8(0x1)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class SkeletalMeshSocket: public Object
{
public:
	struct FName                                                 SocketName;                                        // 0x28(0x8)
	struct FName                                                 BoneName;                                          // 0x30(0x8)
	struct Vector                                                RelativeLocation;                                  // 0x38(0xc)
	struct Rotator                                               RelativeRotation;                                  // 0x44(0xc)
	struct Vector                                                RelativeScale;                                     // 0x50(0xc)
	bool                                                         bForceAlwaysAnimated;                              // 0x5c(0x1)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class NavLinkDefinition: public Object
{
public:
	TArray<struct NavigationLink>                                Links;                                             // 0x28(0x10)
	TArray<struct NavigationSegmentLink>                         SegmentLinks;                                      // 0x38(0x10)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class MaterialExpression: public Object
{
public:
	class Material*                                              Material;                                          // 0x28(0x8)
	class MaterialFunction*                                      Function;                                          // 0x30(0x8)
	struct FString                                               Desc;                                              // 0x38(0x10)
	struct Color                                                 BorderColor;                                       // 0x48(0x4)
	bool                                                         bRealtimePreview;                                  // 0x4c(0x1)
	bool                                                         bNeedToUpdatePreview;                              // 0x4c(0x1)
	bool                                                         bIsParameterExpression;                            // 0x4c(0x1)
	bool                                                         bCommentBubbleVisible;                             // 0x4c(0x1)
	bool                                                         bShowOutputNameOnPin;                              // 0x4c(0x1)
	bool                                                         bHidePreviewWindow;                                // 0x4c(0x1)
	bool                                                         bCollapsed;                                        // 0x4c(0x1)
	bool                                                         bShaderInputData;                                  // 0x4c(0x1)
	bool                                                         bShowInputs;                                       // 0x4d(0x1)
	bool                                                         bShowOutputs;                                      // 0x4d(0x1)
	TArray<struct Text>                                          MenuCategories;                                    // 0x50(0x10)
	TArray<struct ExpressionOutput>                              Outputs;                                           // 0x60(0x10)
};


// Size 0x220 (Full Size[0x250] - InheritedSize[0x30]
class GameViewportClient: public ScriptViewportClient
{
public:
	class Console*                                               ViewportConsole;                                   // 0x38(0x8)
	TArray<struct DebugDisplayProperty>                          DebugProperties;                                   // 0x40(0x10)
	class World*                                                 World;                                             // 0x80(0x8)
	class GameInstance*                                          GameInstance;                                      // 0x88(0x8)
};


// Size 0x588 (Full Size[0x5b0] - InheritedSize[0x28]
class CameraAnim: public Object
{
public:
	class InterpGroup*                                           CameraInterpGroup;                                 // 0x28(0x8)
	float                                                        AnimLength;                                        // 0x30(0x4)
	struct Box                                                   BoundingBox;                                       // 0x34(0x1c)
	bool                                                         bRelativeToInitialTransform;                       // 0x50(0x1)
	float                                                        BaseFOV;                                           // 0x54(0x4)
	struct PostProcessSettings                                   BasePostProcessSettings;                           // 0x60(0x540)
	float                                                        BasePostProcessBlendWeight;                        // 0x5a0(0x4)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class ParticleModule: public Object
{
public:
	bool                                                         bSpawnModule;                                      // 0x28(0x1)
	bool                                                         bUpdateModule;                                     // 0x28(0x1)
	bool                                                         bFinalUpdateModule;                                // 0x28(0x1)
	bool                                                         bUpdateForGPUEmitter;                              // 0x28(0x1)
	bool                                                         bCurvesAsColor;                                    // 0x28(0x1)
	bool                                                         b3DDrawMode;                                       // 0x28(0x1)
	bool                                                         bSupported3DDrawMode;                              // 0x28(0x1)
	bool                                                         bEnabled;                                          // 0x28(0x1)
	bool                                                         bEditable;                                         // 0x29(0x1)
	bool                                                         LODDuplicate;                                      // 0x29(0x1)
	bool                                                         bSupportsRandomSeed;                               // 0x29(0x1)
	bool                                                         bRequiresLoopingNotification;                      // 0x29(0x1)
	char                                                         LODValidity;                                       // 0x2c(0x1)
	TArray<int>                                                  ModuleInstanceOffsets;                             // 0x30(0x10)
	TArray<int>                                                  ModuleOffsets;                                     // 0x40(0x10)
};


// Size 0x158 (Full Size[0x1a8] - InheritedSize[0x50]
class ParticleModuleLocationGPU: public ParticleModuleLocationBase
{
public:
	struct RawDistributionVector                                 StartLocation;                                     // 0x50(0x38)
	struct RawDistributionVector                                 AdditionalStartLocations;                          // 0x88(0x38)
	bool                                                         bUseGroupAStartLocationForAllGroups;               // 0x1a0(0x1)
};


// Size 0x38 (Full Size[0x88] - InheritedSize[0x50]
class ParticleModuleSizeOverVelocity: public ParticleModuleSizeBase
{
public:
	struct RawDistributionFloat                                  SizeMultiplier;                                    // 0x50(0x38)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class AnimNotifyState: public Object
{
public:
	bool                                                         PlayedWithSequencer;                               // 0x28(0x1)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AnimNotify: public Object
{
public:
	bool                                                         PlayedWithSequencer;                               // 0x28(0x1)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class Player: public Object
{
public:
	class PlayerController*                                      PlayerController;                                  // 0x30(0x8)
	int                                                          CurrentNetSpeed;                                   // 0x38(0x4)
	int                                                          ConfiguredInternetSpeed;                           // 0x3c(0x4)
	int                                                          ConfiguredLanSpeed;                                // 0x40(0x4)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class EdGraphNode: public Object
{
public:
	TArray<class EdGraphPin*>                                    Pins;                                              // 0x28(0x10)
	int                                                          NodePosX;                                          // 0x38(0x4)
	int                                                          NodePosY;                                          // 0x3c(0x4)
	int                                                          NodeWidth;                                         // 0x40(0x4)
	int                                                          NodeHeight;                                        // 0x44(0x4)
	bool                                                         bHasCompilerMessage;                               // 0x48(0x1)
	struct FString                                               NodeComment;                                       // 0x50(0x10)
	bool                                                         bCommentBubblePinned;                              // 0x60(0x1)
	bool                                                         bCommentBubbleVisible;                             // 0x61(0x1)
	int                                                          ErrorType;                                         // 0x64(0x4)
	struct FString                                               ErrorMsg;                                          // 0x68(0x10)
	struct Guid                                                  NodeGuid;                                          // 0x78(0x10)
	char                                                         AdvancedPinDisplay;                                // 0x88(0x1)
	bool                                                         bIsNodeEnabled;                                    // 0x89(0x1)
	bool                                                         bIsDebugFunction;                                  // 0x8a(0x1)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class DistributionVector: public Distribution
{
public:
	bool                                                         bCanBeBaked;                                       // 0x30(0x1)
	bool                                                         bIsDirty;                                          // 0x30(0x1)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InputAxisKeyDelegateBinding: public InputDelegateBinding
{
public:
	TArray<struct BlueprintInputAxisKeyDelegateBinding>          InputAxisKeyDelegateBindings;                      // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InputKeyDelegateBinding: public InputDelegateBinding
{
public:
	TArray<struct BlueprintInputKeyDelegateBinding>              InputKeyDelegateBindings;                          // 0x28(0x10)
};


// Size 0x98 (Full Size[0xc0] - InheritedSize[0x28]
class InputSettings: public Object
{
public:
	TArray<struct InputAxisConfigEntry>                          AxisConfig;                                        // 0x28(0x10)
	bool                                                         bAltEnterTogglesFullscreen;                        // 0x38(0x1)
	bool                                                         bUseMouseForTouch;                                 // 0x38(0x1)
	bool                                                         bEnableMouseSmoothing;                             // 0x38(0x1)
	bool                                                         bEnableFOVScaling;                                 // 0x38(0x1)
	float                                                        FOVScale;                                          // 0x3c(0x4)
	float                                                        DoubleClickTime;                                   // 0x40(0x4)
	TArray<struct InputActionKeyMapping>                         ActionMappings;                                    // 0x48(0x10)
	TArray<struct InputAxisKeyMapping>                           AxisMappings;                                      // 0x58(0x10)
	TArray<struct InputCombinedAxisKeyMapping>                   CombinedAxisMappings;                              // 0x68(0x10)
	bool                                                         bAlwaysShowTouchInterface;                         // 0x78(0x1)
	bool                                                         bShowConsoleOnFourFingerTap;                       // 0x79(0x1)
	struct StringAssetReference                                  DefaultTouchInterface;                             // 0x80(0x10)
	struct Key                                                   ConsoleKey;                                        // 0x90(0x20)
	TArray<struct Key>                                           ConsoleKeys;                                       // 0xb0(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class NavArea: public Object
{
public:
	float                                                        DefaultCost;                                       // 0x28(0x4)
	float                                                        FixedAreaEnteringCost;                             // 0x2c(0x4)
	struct Color                                                 DrawColor;                                         // 0x30(0x4)
	struct NavAgentSelector                                      SupportedAgents;                                   // 0x34(0x4)
	bool                                                         bSupportsAgent0;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent1;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent2;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent3;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent4;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent5;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent6;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent7;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent8;                                   // 0x39(0x1)
	bool                                                         bSupportsAgent9;                                   // 0x39(0x1)
	bool                                                         bSupportsAgent10;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent11;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent12;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent13;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent14;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent15;                                  // 0x39(0x1)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class SoundGroups: public Object
{
public:
	TArray<struct SoundGroup>                                    SoundGroupProfiles;                                // 0x28(0x10)
};


// Size 0x40 (Full Size[0x90] - InheritedSize[0x50]
class ParticleModuleLocationBoneSocket: public ParticleModuleLocationBase
{
public:
	char                                                         SourceType;                                        // 0x50(0x1)
	struct Vector                                                UniversalOffset;                                   // 0x54(0xc)
	TArray<struct LocationBoneSocketInfo>                        SourceLocations;                                   // 0x60(0x10)
	char                                                         SelectionMethod;                                   // 0x70(0x1)
	bool                                                         bUpdatePositionEachFrame;                          // 0x74(0x1)
	bool                                                         bOrientMeshEmitters;                               // 0x74(0x1)
	bool                                                         bInheritBoneVelocity;                              // 0x74(0x1)
	struct Vector                                                InheritVelocityScale;                              // 0x78(0xc)
	float                                                        InheritedSpeedCap;                                 // 0x84(0x4)
	struct FName                                                 SkelMeshActorParamName;                            // 0x88(0x8)
};


// Size 0x400 (Full Size[0x428] - InheritedSize[0x28]
class PlayerInput: public Object
{
public:
	TArray<struct KeyBind>                                       DebugExecBindings;                                 // 0x120(0x10)
	TArray<struct Name>                                          GamepadInvertedAxes;                               // 0x170(0x10)
	TArray<struct Name>                                          MouseInvertedAxes;                                 // 0x180(0x10)
	TArray<struct Name>                                          InvertedCombinedAxisY;                             // 0x190(0x10)
	TArray<struct Name>                                          InvertedCombinedAxisX;                             // 0x1a0(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class InterpTrackInstMove: public InterpTrackInst
{
public:
	struct Vector                                                ResetLocation;                                     // 0x28(0xc)
	struct Rotator                                               ResetRotation;                                     // 0x34(0xc)
};


// Size 0xf8 (Full Size[0x4c0] - InheritedSize[0x3c8]
class GameMode: public Info
{
public:
	bool                                                         bDisableAsyncOcclusionChecking;                    // 0x3d0(0x1)
	bool                                                         bUseSeamlessTravel;                                // 0x3d0(0x1)
	bool                                                         bPauseable;                                        // 0x3d0(0x1)
	bool                                                         bStartPlayersAsSpectators;                         // 0x3d0(0x1)
	bool                                                         bDelayedStart;                                     // 0x3d0(0x1)
	struct FString                                               OptionsString;                                     // 0x3d8(0x10)
	class UClass*                                                DefaultPawnClass;                                  // 0x3e8(0x8)
	class UClass*                                                HUDClass;                                          // 0x3f0(0x8)
	int                                                          NumSpectators;                                     // 0x3f8(0x4)
	int                                                          NumPlayers;                                        // 0x3fc(0x4)
	int                                                          NumBots;                                           // 0x400(0x4)
	float                                                        MinRespawnDelay;                                   // 0x404(0x4)
	class GameSession*                                           GameSession;                                       // 0x408(0x8)
	int                                                          NumTravellingPlayers;                              // 0x410(0x4)
	struct FText                                                 DefaultPlayerName;                                 // 0x418(0x38)
	class UClass*                                                EngineMessageClass;                                // 0x450(0x8)
	class UClass*                                                PlayerControllerClass;                             // 0x458(0x8)
	class UClass*                                                SpectatorClass;                                    // 0x460(0x8)
	class UClass*                                                ReplaySpectatorPlayerControllerClass;              // 0x468(0x8)
	class UClass*                                                PlayerStateClass;                                  // 0x470(0x8)
	class UClass*                                                GameStateClass;                                    // 0x478(0x8)
	class GameState*                                             GameState;                                         // 0x480(0x8)
	TArray<class PlayerState*>                                   InactivePlayerArray;                               // 0x488(0x10)
	TArray<struct GameClassShortName>                            GameModeClassAliases;                              // 0x4a8(0x10)
	float                                                        InactivePlayerStateLifeSpan;                       // 0x4b8(0x4)
	bool                                                         bHandleDedicatedServerReplays;                     // 0x4bc(0x1)
};


// Size 0x10 (Full Size[0x60] - InheritedSize[0x50]
class ParticleModuleSizeScaleBySpeed: public ParticleModuleSizeBase
{
public:
	struct Vector2D                                              SpeedScale;                                        // 0x50(0x8)
	struct Vector2D                                              MaxScale;                                          // 0x58(0x8)
};


// Size 0x560 (Full Size[0x960] - InheritedSize[0x400]
class PostProcessVolume: public Volume
{
public:
	struct PostProcessSettings                                   Settings;                                          // 0x410(0x540)
	float                                                        Priority;                                          // 0x950(0x4)
	float                                                        BlendRadius;                                       // 0x954(0x4)
	float                                                        BlendWeight;                                       // 0x958(0x4)
	bool                                                         bEnabled;                                          // 0x95c(0x1)
	bool                                                         bUnbound;                                          // 0x95c(0x1)
};


// Size 0x38 (Full Size[0x88] - InheritedSize[0x50]
class ParticleModuleAlignRotationToVelocity: public ParticleModuleRotationBase
{
public:
	struct RawDistributionFloat                                  AdditionalAngle;                                   // 0x50(0x38)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class SimpleConstructionScript: public Object
{
public:
	TArray<class SCS_Node*>                                      RootNodes;                                         // 0x28(0x10)
	class SCS_Node*                                              DefaultSceneRootNode;                              // 0x38(0x8)
};


// Size 0x120 (Full Size[0x158] - InheritedSize[0x38]
class CollisionProfile: public DeveloperSettings
{
public:
	TArray<struct CollisionResponseTemplate>                     Profiles;                                          // 0x38(0x10)
	TArray<struct CustomChannelSetup>                            DefaultChannelResponses;                           // 0x48(0x10)
	TArray<struct CustomProfile>                                 EditProfiles;                                      // 0x58(0x10)
	TArray<struct Redirector>                                    ProfileRedirects;                                  // 0x68(0x10)
	TArray<struct Redirector>                                    CollisionChannelRedirects;                         // 0x78(0x10)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class CheatManager: public Object
{
public:
	class DebugCameraController*                                 DebugCameraControllerRef;                          // 0x28(0x8)
	class UClass*                                                DebugCameraControllerClass;                        // 0x30(0x8)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class Channel: public Object
{
public:
	class NetConnection*                                         Connection;                                        // 0x28(0x8)
};


// Size 0x1b0 (Full Size[0x1d8] - InheritedSize[0x28]
class Font: public Object
{
public:
	char                                                         FontCacheType;                                     // 0x30(0x1)
	TArray<struct FontCharacter>                                 Characters;                                        // 0x38(0x10)
	TArray<class Texture2D*>                                     Textures;                                          // 0x48(0x10)
	int                                                          IsRemapped;                                        // 0x58(0x4)
	float                                                        EmScale;                                           // 0x5c(0x4)
	float                                                        Ascent;                                            // 0x60(0x4)
	float                                                        Descent;                                           // 0x64(0x4)
	float                                                        Leading;                                           // 0x68(0x4)
	int                                                          Kerning;                                           // 0x6c(0x4)
	struct FontImportOptionsData                                 ImportOptions;                                     // 0x70(0xb0)
	int                                                          NumCharacters;                                     // 0x120(0x4)
	TArray<int>                                                  MaxCharHeight;                                     // 0x128(0x10)
	float                                                        ScalingFactor;                                     // 0x138(0x4)
	int                                                          LegacyFontSize;                                    // 0x13c(0x4)
	struct FName                                                 LegacyFontName;                                    // 0x140(0x8)
	struct CompositeFont                                         CompositeFont;                                     // 0x148(0x28)
};


// Size 0x70 (Full Size[0x438] - InheritedSize[0x3c8]
class GameNetworkManager: public Info
{
public:
	int                                                          AdjustedNetSpeed;                                  // 0x3c8(0x4)
	float                                                        LastNetSpeedUpdateTime;                            // 0x3cc(0x4)
	int                                                          TotalNetBandwidth;                                 // 0x3d0(0x4)
	int                                                          MinDynamicBandwidth;                               // 0x3d4(0x4)
	int                                                          MaxDynamicBandwidth;                               // 0x3d8(0x4)
	bool                                                         bIsStandbyCheckingEnabled;                         // 0x3dc(0x1)
	bool                                                         bHasStandbyCheatTriggered;                         // 0x3dc(0x1)
	float                                                        StandbyRxCheatTime;                                // 0x3e0(0x4)
	float                                                        StandbyTxCheatTime;                                // 0x3e4(0x4)
	int                                                          BadPingThreshold;                                  // 0x3e8(0x4)
	float                                                        PercentMissingForRxStandby;                        // 0x3ec(0x4)
	float                                                        PercentMissingForTxStandby;                        // 0x3f0(0x4)
	float                                                        PercentForBadPing;                                 // 0x3f4(0x4)
	float                                                        JoinInProgressStandbyWaitTime;                     // 0x3f8(0x4)
	float                                                        MoveRepSize;                                       // 0x3fc(0x4)
	float                                                        MAXPOSITIONERRORSQUARED;                           // 0x400(0x4)
	float                                                        MAXNEARZEROVELOCITYSQUARED;                        // 0x404(0x4)
	float                                                        CLIENTADJUSTUPDATECOST;                            // 0x408(0x4)
	float                                                        MAXCLIENTUPDATEINTERVAL;                           // 0x40c(0x4)
	float                                                        MaxMoveDeltaTime;                                  // 0x410(0x4)
	bool                                                         ClientAuthorativePosition;                         // 0x414(0x1)
	float                                                        ClientErrorUpdateRateLimit;                        // 0x418(0x4)
	bool                                                         bMovementTimeDiscrepancyDetection;                 // 0x41c(0x1)
	bool                                                         bMovementTimeDiscrepancyResolution;                // 0x41d(0x1)
	float                                                        MovementTimeDiscrepancyMaxTimeMargin;              // 0x420(0x4)
	float                                                        MovementTimeDiscrepancyMinTimeMargin;              // 0x424(0x4)
	float                                                        MovementTimeDiscrepancyResolutionRate;             // 0x428(0x4)
	float                                                        MovementTimeDiscrepancyDriftAllowance;             // 0x42c(0x4)
	bool                                                         bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x430(0x1)
	bool                                                         bUseDistanceBasedRelevancy;                        // 0x431(0x1)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class MaterialFunction: public Object
{
public:
	struct Guid                                                  StateId;                                           // 0x28(0x10)
	struct FString                                               Description;                                       // 0x38(0x10)
	bool                                                         bExposeToLibrary;                                  // 0x48(0x1)
	TArray<struct Text>                                          LibraryCategoriesText;                             // 0x50(0x10)
	TArray<class MaterialExpression*>                            FunctionExpressions;                               // 0x60(0x10)
	bool                                                         bReentrantFlag;                                    // 0x70(0x1)
};


// Size 0x2e0 (Full Size[0x308] - InheritedSize[0x28]
class AutomationTestSettings: public Object
{
public:
	struct FilePath                                              AutomationTestmap;                                 // 0x28(0x10)
	TArray<struct EditorMapPerformanceTestDefinition>            EditorPerformanceTestMaps;                         // 0x38(0x10)
	struct BuildPromotionTestSettings                            BuildPromotionTest;                                // 0x48(0x210)
	struct MaterialEditorPromotionSettings                       MaterialEditorPromotionTest;                       // 0x258(0x30)
	struct ParticleEditorPromotionSettings                       ParticleEditorPromotionTest;                       // 0x288(0x10)
	TArray<String>                                               EngineTestModules;                                 // 0x298(0x10)
	TArray<String>                                               EditorTestModules;                                 // 0x2a8(0x10)
	TArray<String>                                               TestLevelFolders;                                  // 0x2b8(0x10)
	TArray<struct OpenTestAsset>                                 TestAssetsToOpen;                                  // 0x2c8(0x10)
	TArray<struct ExternalToolDefinition>                        ExternalTools;                                     // 0x2d8(0x10)
	TArray<struct EditorImportExportTestDefinition>              ImportExportTestDefinitions;                       // 0x2e8(0x10)
	TArray<struct LaunchOnTestSettings>                          LaunchOnSettings;                                  // 0x2f8(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class LightmappedSurfaceCollection: public Object
{
public:
	class Model*                                                 SourceModel;                                       // 0x28(0x8)
	TArray<int>                                                  Surfaces;                                          // 0x30(0x10)
};


// Size 0xc0 (Full Size[0x110] - InheritedSize[0x50]
class ParticleModuleBeamModifier: public ParticleModuleBeamBase
{
public:
	char                                                         ModifierType;                                      // 0x50(0x1)
	struct BeamModifierOptions                                   PositionOptions;                                   // 0x54(0x4)
	struct RawDistributionVector                                 Position;                                          // 0x58(0x38)
	struct BeamModifierOptions                                   TangentOptions;                                    // 0x90(0x4)
	struct RawDistributionVector                                 Tangent;                                           // 0x98(0x38)
	bool                                                         bAbsoluteTangent;                                  // 0xd0(0x1)
	struct BeamModifierOptions                                   StrengthOptions;                                   // 0xd4(0x4)
	struct RawDistributionFloat                                  Strength;                                          // 0xd8(0x38)
};


// Size 0x40 (Full Size[0x90] - InheritedSize[0x50]
class ParticleModuleMeshRotation: public ParticleModuleRotationBase
{
public:
	struct RawDistributionVector                                 StartRotation;                                     // 0x50(0x38)
	bool                                                         bInheritParent;                                    // 0x88(0x1)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class RadialForceActor: public RigidBodyBase
{
public:
	class RadialForceComponent*                                  ForceComponent;                                    // 0x3c8(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ObjectReferencer: public Object
{
public:
	TArray<class Object*>                                        ReferencedObjects;                                 // 0x28(0x10)
};


// Size 0xe0 (Full Size[0x130] - InheritedSize[0x50]
class ParticleModuleLocationDirect: public ParticleModuleLocationBase
{
public:
	struct RawDistributionVector                                 Location;                                          // 0x50(0x38)
	struct RawDistributionVector                                 LocationOffset;                                    // 0x88(0x38)
	struct RawDistributionVector                                 ScaleFactor;                                       // 0xc0(0x38)
	struct RawDistributionVector                                 Direction;                                         // 0xf8(0x38)
};


// Size 0x10 (Full Size[0x60] - InheritedSize[0x50]
class ParticleModuleMeshMaterial: public ParticleModuleMaterialBase
{
public:
	TArray<class MaterialInterface*>                             MeshMaterials;                                     // 0x50(0x10)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class WindDirectionalSource: public Info
{
public:
	class WindDirectionalSourceComponent*                        Component;                                         // 0x3c8(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class Breakpoint: public Object
{
public:
	bool                                                         bEnabled;                                          // 0x28(0x1)
	class EdGraphNode*                                           Node;                                              // 0x30(0x8)
	bool                                                         bStepOnce;                                         // 0x38(0x1)
	bool                                                         bStepOnce_WasPreviouslyDisabled;                   // 0x38(0x1)
	bool                                                         bStepOnce_RemoveAfterHit;                          // 0x38(0x1)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InputActionDelegateBinding: public InputDelegateBinding
{
public:
	TArray<struct BlueprintInputActionDelegateBinding>           InputActionDelegateBindings;                       // 0x28(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AnimCompress: public Object
{
public:
	struct FString                                               Description;                                       // 0x28(0x10)
	bool                                                         bNeedsSkeleton;                                    // 0x38(0x1)
	char                                                         TranslationCompressionFormat;                      // 0x3c(0x1)
	char                                                         RotationCompressionFormat;                         // 0x3d(0x1)
	char                                                         ScaleCompressionFormat;                            // 0x3e(0x1)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class HighLatencySettings: public Object
{
public:
	bool                                                         UseHighLatency;                                    // 0x28(0x1)
	int                                                          PktLag;                                            // 0x2c(0x4)
	int                                                          PktLagVariance;                                    // 0x30(0x4)
	bool                                                         PktOrder;                                          // 0x34(0x1)
	int                                                          PktDup;                                            // 0x38(0x4)
	int                                                          PktLoss;                                           // 0x3c(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class InterpTrackInstDirector: public InterpTrackInst
{
public:
	class Actor*                                                 OldViewTarget;                                     // 0x28(0x8)
};


// Size 0x20 (Full Size[0x58] - InheritedSize[0x38]
class GarbageCollectionSettings: public DeveloperSettings
{
public:
	float                                                        TimeBetweenPurgingPendingKillObjects;              // 0x38(0x4)
	bool                                                         FlushStreamingOnGC;                                // 0x3c(0x1)
	bool                                                         AllowParallelGC;                                   // 0x3c(0x1)
	bool                                                         CreateGCClusters;                                  // 0x3c(0x1)
	bool                                                         MergeGCClusters;                                   // 0x3c(0x1)
	int                                                          NumRetriesBeforeForcingGC;                         // 0x40(0x4)
	int                                                          MaxObjectsNotConsideredByGC;                       // 0x44(0x4)
	int                                                          SizeOfPermanentObjectPool;                         // 0x48(0x4)
	int                                                          MaxObjectsInGame;                                  // 0x4c(0x4)
	int                                                          MaxObjectsInEditor;                                // 0x50(0x4)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AnimationAsset: public Object
{
public:
	class Skeleton*                                              Skeleton;                                          // 0x28(0x8)
	TArray<class AnimMetaData*>                                  MetaData;                                          // 0x40(0x10)
};


// Size 0x100 (Full Size[0x128] - InheritedSize[0x28]
class EdGraphPin: public Object
{
public:
	struct FString                                               PinName;                                           // 0x28(0x10)
	struct FString                                               PinToolTip;                                        // 0x38(0x10)
	char                                                         Direction;                                         // 0x48(0x1)
	struct EdGraphPinType                                        PinType;                                           // 0x50(0x50)
	struct FString                                               DefaultValue;                                      // 0xa0(0x10)
	struct FString                                               AutogeneratedDefaultValue;                         // 0xb0(0x10)
	class Object*                                                DefaultObject;                                     // 0xc0(0x8)
	struct FText                                                 DefaultTextValue;                                  // 0xc8(0x38)
	TArray<class EdGraphPin*>                                    LinkedTo;                                          // 0x100(0x10)
	TArray<class EdGraphPin*>                                    SubPins;                                           // 0x110(0x10)
	class EdGraphPin*                                            ParentPin;                                         // 0x120(0x8)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class AutomationTestUserSettings: public Object
{
public:
	bool                                                         FilterTests;                                       // 0x28(0x1)
	TArray<String>                                               IncludedTestsPrefix;                               // 0x30(0x10)
	TArray<String>                                               ExcludedTestsPrefix;                               // 0x40(0x10)
	bool                                                         IncludeEpicTests;                                  // 0x50(0x1)
};


// Size 0xe0 (Full Size[0x130] - InheritedSize[0x50]
class ParticleModuleLocationPrimitiveTriangle: public ParticleModuleLocationBase
{
public:
	struct RawDistributionVector                                 StartOffset;                                       // 0x50(0x38)
	struct RawDistributionFloat                                  Height;                                            // 0x88(0x38)
	struct RawDistributionFloat                                  Angle;                                             // 0xc0(0x38)
	struct RawDistributionFloat                                  Thickness;                                         // 0xf8(0x38)
};


// Size 0x38 (Full Size[0x88] - InheritedSize[0x50]
class ParticleModuleSourceMovement: public ParticleModuleLocationBase
{
public:
	struct RawDistributionVector                                 SourceMovementScale;                               // 0x50(0x38)
};


// Size 0x8 (Full Size[0x58] - InheritedSize[0x50]
class ParticleModuleVectorFieldScaleOverLife: public ParticleModuleVectorFieldBase
{
public:
	class DistributionFloat*                                     VectorFieldScaleOverLife;                          // 0x50(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EndUserSettings: public Object
{
public:
	bool                                                         bSendAnonymousUsageDataToEpic;                     // 0x30(0x1)
};


// Size 0x110 (Full Size[0x138] - InheritedSize[0x28]
class HIKCharacterization: public Object
{
public:
	struct FName                                                 Reference;                                         // 0x28(0x8)
	struct FName                                                 Hips;                                              // 0x30(0x8)
	struct FName                                                 LeftUpLeg;                                         // 0x38(0x8)
	struct FName                                                 LeftLeg;                                           // 0x40(0x8)
	struct FName                                                 LeftFoot;                                          // 0x48(0x8)
	struct FName                                                 RightUpLeg;                                        // 0x50(0x8)
	struct FName                                                 RightLeg;                                          // 0x58(0x8)
	struct FName                                                 RightFoot;                                         // 0x60(0x8)
	struct FName                                                 Spine;                                             // 0x68(0x8)
	struct FName                                                 LeftArm;                                           // 0x70(0x8)
	struct FName                                                 LeftForeArm;                                       // 0x78(0x8)
	struct FName                                                 LeftHand;                                          // 0x80(0x8)
	struct FName                                                 RightArm;                                          // 0x88(0x8)
	struct FName                                                 RightForeArm;                                      // 0x90(0x8)
	struct FName                                                 RightHand;                                         // 0x98(0x8)
	struct FName                                                 Head;                                              // 0xa0(0x8)
	TArray<struct HIKBoneTransform>                              BoneTransforms;                                    // 0xa8(0x10)
	bool                                                         Locked;                                            // 0xb8(0x1)
	TArray<int>                                                  UnrealToHumanIKBoneMapping;                        // 0xc0(0x10)
	TArray<struct HIKBoneMapping>                                AdditionalBones;                                   // 0xd0(0x10)
	bool                                                         LeftElbowInverted;                                 // 0xe0(0x1)
	bool                                                         RightElbowInverted;                                // 0xe1(0x1)
	bool                                                         LeftKneeInverted;                                  // 0xe2(0x1)
	bool                                                         RightKneeInverted;                                 // 0xe3(0x1)
	bool                                                         AdjustLeftShoulder;                                // 0xe4(0x1)
	struct Vector                                                AdjustLeftShoulder_Axis;                           // 0xe8(0xc)
	float                                                        AdjustLeftShoulder_Angle;                          // 0xf4(0x4)
	bool                                                         AdjustRightShoulder;                               // 0xf8(0x1)
	struct Vector                                                AdjustRightShoulder_Axis;                          // 0xfc(0xc)
	float                                                        AdjustRightShoulder_Angle;                         // 0x108(0x4)
	bool                                                         SpineSquashNStretch;                               // 0x10c(0x1)
	bool                                                         NeckSquashNStretch;                                // 0x10d(0x1)
	float                                                        SpineJointsMinSquashNStretchFactor;                // 0x110(0x4)
	float                                                        SpineJointsMaxSquashNStretchFactor;                // 0x114(0x4)
	float                                                        NeckJointsMinSquashNStretchFactor;                 // 0x118(0x4)
	float                                                        NeckJointsMaxSquashNStretchFactor;                 // 0x11c(0x4)
	bool                                                         bInitFromSkeleton;                                 // 0x120(0x1)
	int                                                          InitFromSkeletonCount;                             // 0x124(0x4)
	struct Rotator                                               ImportRotator;                                     // 0x128(0xc)
};


// Size 0x10 (Full Size[0x410] - InheritedSize[0x400]
class FFTWater: public Volume
{
public:
	class FFTWaterComponent*                                     FFTWaterComponent;                                 // 0x400(0x8)
	class FFTWaterExtendedPlaneComponent*                        ExtendedPlaneComponent;                            // 0x408(0x8)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class ObjectLibrary: public Object
{
public:
	class UClass*                                                ObjectBaseClass;                                   // 0x28(0x8)
	bool                                                         bHasBlueprintClasses;                              // 0x30(0x1)
	TArray<class Object*>                                        Objects;                                           // 0x38(0x10)
	TArray<uintptr_t>                                            WeakObjects;                                       // 0x48(0x10)
	bool                                                         bUseWeakReferences;                                // 0x58(0x1)
	bool                                                         bIsFullyLoaded;                                    // 0x59(0x1)
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class Texture: public Object
{
public:
	int                                                          LODBias;                                           // 0x28(0x4)
	int                                                          NumCinematicMipLevels;                             // 0x2c(0x4)
	bool                                                         SRGB;                                              // 0x30(0x1)
	bool                                                         NeverStream;                                       // 0x30(0x1)
	bool                                                         bNoTiling;                                         // 0x30(0x1)
	bool                                                         bUseCinematicMipLevels;                            // 0x30(0x1)
	bool                                                         CompressionNone;                                   // 0x30(0x1)
	bool                                                         bUAV;                                              // 0x30(0x1)
	uint32                                                       MaxQualityReduction;                               // 0x34(0x4)
	int                                                          CachedCombinedLODBias;                             // 0x38(0x4)
	bool                                                         bAsyncResourceReleaseHasBeenStarted;               // 0x3c(0x1)
	char                                                         CompressionSettings;                               // 0x40(0x1)
	char                                                         Filter;                                            // 0x41(0x1)
	char                                                         LODGroup;                                          // 0x42(0x1)
	float                                                        StreamingPriorityBoost;                            // 0x44(0x4)
	TArray<struct ExternalMip>                                   ExternalMips;                                      // 0xa8(0x10)
};


// Size 0x38 (Full Size[0x88] - InheritedSize[0x50]
class ParticleModuleVectorFieldLocal: public ParticleModuleVectorFieldBase
{
public:
	class VectorField*                                           VectorField;                                       // 0x50(0x8)
	struct Vector                                                RelativeTranslation;                               // 0x58(0xc)
	struct Rotator                                               RelativeRotation;                                  // 0x64(0xc)
	struct Vector                                                RelativeScale3D;                                   // 0x70(0xc)
	float                                                        Intensity;                                         // 0x7c(0x4)
	float                                                        Tightness;                                         // 0x80(0x4)
	bool                                                         bIgnoreComponentTransform;                         // 0x84(0x1)
	bool                                                         bTileX;                                            // 0x84(0x1)
	bool                                                         bTileY;                                            // 0x84(0x1)
	bool                                                         bTileZ;                                            // 0x84(0x1)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class InterpData: public Object
{
public:
	float                                                        InterpLength;                                      // 0x28(0x4)
	float                                                        PathBuildTime;                                     // 0x2c(0x4)
	TArray<class InterpGroup*>                                   InterpGroups;                                      // 0x30(0x10)
	class InterpCurveEdSetup*                                    CurveEdSetup;                                      // 0x40(0x8)
	float                                                        EdSectionStart;                                    // 0x48(0x4)
	float                                                        EdSectionEnd;                                      // 0x4c(0x4)
	bool                                                         bShouldBakeAndPrune;                               // 0x50(0x1)
	class InterpGroupDirector*                                   CachedDirectorGroup;                               // 0x58(0x8)
	TArray<struct Name>                                          AllEventNames;                                     // 0x60(0x10)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionCustomVelocity: public MaterialExpressionCustomOutput
{
public:
	struct ExpressionInput                                       Velocity2D;                                        // 0x70(0x38)
};


// Size 0x18 (Full Size[0x418] - InheritedSize[0x400]
class CullDistanceVolume: public Volume
{
public:
	TArray<struct CullDistanceSizePair>                          CullDistances;                                     // 0x400(0x10)
	bool                                                         bEnabled;                                          // 0x410(0x1)
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class UserDefinedStruct: public ScriptStruct
{
public:
	struct Guid                                                  Guid;                                              // 0x98(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class BookMark2D: public Object
{
public:
	float                                                        Zoom2D;                                            // 0x28(0x4)
	struct IntPoint                                              Location;                                          // 0x2c(0x8)
};


// Size 0x100 (Full Size[0x128] - InheritedSize[0x28]
class HapticFeedbackEffect: public Object
{
public:
	struct HapticFeedbackDetails                                 HapticDetails;                                     // 0x28(0x100)
};


// Size 0x150 (Full Size[0x1a0] - InheritedSize[0x50]
class ParticleModuleCollision: public ParticleModuleCollisionBase
{
public:
	struct RawDistributionVector                                 DampingFactor;                                     // 0x50(0x38)
	struct RawDistributionVector                                 DampingFactorRotation;                             // 0x88(0x38)
	struct RawDistributionFloat                                  MaxCollisions;                                     // 0xc0(0x38)
	char                                                         CollisionCompletionOption;                         // 0xf8(0x1)
	TArray<char>                                                 CollisionTypes;                                    // 0x100(0x10)
	bool                                                         bApplyPhysics;                                     // 0x114(0x1)
	struct RawDistributionFloat                                  ParticleMass;                                      // 0x118(0x38)
	float                                                        DirScalar;                                         // 0x150(0x4)
	bool                                                         bPawnsDoNotDecrementCount;                         // 0x154(0x1)
	bool                                                         bOnlyVerticalNormalsDecrementCount;                // 0x154(0x1)
	float                                                        VerticalFudgeFactor;                               // 0x158(0x4)
	struct RawDistributionFloat                                  DelayAmount;                                       // 0x160(0x38)
	bool                                                         bDropDetail;                                       // 0x198(0x1)
	bool                                                         bCollideOnlyIfVisible;                             // 0x198(0x1)
	bool                                                         bIgnoreSourceActor;                                // 0x198(0x1)
	bool                                                         bIgnoreCollisionsWithHiddenObjects;                // 0x198(0x1)
	float                                                        MaxCollisionDistance;                              // 0x19c(0x4)
};


// Size 0x10 (Full Size[0x410] - InheritedSize[0x400]
class NavMeshBoundsVolume: public Volume
{
public:
	struct NavAgentSelector                                      SupportedAgents;                                   // 0x400(0x4)
	struct FName                                                 OriginatingLevelName;                              // 0x404(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InstancedNavMeshesDataAsset: public DataAsset
{
public:
	TArray<struct InstancedNavMesh>                              InstancedNavMeshes;                                // 0x28(0x10)
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class WorldComposition: public Object
{
public:
	TArray<class LevelStreaming*>                                TilesStreaming;                                    // 0x98(0x10)
	double                                                       TilesStreamingTimeThreshold;                       // 0xa8(0x8)
	bool                                                         bLoadAllTilesDuringCinematic;                      // 0xb0(0x1)
	bool                                                         bRebaseOriginIn3DSpace;                            // 0xb1(0x1)
	float                                                        RebaseOriginDistance;                              // 0xb4(0x4)
};


// Size 0x40 (Full Size[0x90] - InheritedSize[0x50]
class ParticleModuleRotationOverLifetime: public ParticleModuleRotationBase
{
public:
	struct RawDistributionFloat                                  RotationOverLife;                                  // 0x50(0x38)
	bool                                                         Scale;                                             // 0x88(0x1)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class SoundNodeWavePlayer: public SoundNodeAssetReferencer
{
public:
	assetobject                                                  SoundWaveAssetPtr;                                 // 0x38(0x20)
	class SoundWave*                                             SoundWave;                                         // 0x58(0x8)
	bool                                                         bLooping;                                          // 0x60(0x1)
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class ParticleLODLevel: public Object
{
public:
	int                                                          Level;                                             // 0x28(0x4)
	bool                                                         bEnabled;                                          // 0x2c(0x1)
	class ParticleModuleRequired*                                RequiredModule;                                    // 0x30(0x8)
	TArray<class ParticleModule*>                                Modules;                                           // 0x38(0x10)
	class ParticleModule*                                        TypeDataModule;                                    // 0x48(0x8)
	class ParticleModuleSpawn*                                   SpawnModule;                                       // 0x50(0x8)
	class ParticleModuleEventGenerator*                          EventGenerator;                                    // 0x58(0x8)
	TArray<class ParticleModuleSpawnBase*>                       SpawningModules;                                   // 0x60(0x10)
	TArray<class ParticleModule*>                                SpawnModules;                                      // 0x70(0x10)
	TArray<class ParticleModule*>                                UpdateModules;                                     // 0x80(0x10)
	TArray<class ParticleModuleOrbit*>                           OrbitModules;                                      // 0x90(0x10)
	TArray<class ParticleModuleEventReceiverBase*>               EventReceiverModules;                              // 0xa0(0x10)
	bool                                                         ConvertedModules;                                  // 0xb0(0x1)
	int                                                          PeakActiveParticles;                               // 0xb4(0x4)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class IntSerialization: public Object
{
public:
	uint16                                                       UnsignedInt16Variable;                             // 0x28(0x2)
	uint32                                                       UnsignedInt32Variable;                             // 0x2c(0x4)
	uint64                                                       UnsignedInt64Variable;                             // 0x30(0x8)
	int8                                                         SignedInt8Variable;                                // 0x38(0x1)
	int16                                                        SignedInt16Variable;                               // 0x3a(0x2)
	int64                                                        SignedInt64Variable;                               // 0x40(0x8)
	char                                                         UnsignedInt8Variable;                              // 0x48(0x1)
	int                                                          SignedInt32Variable;                               // 0x4c(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InputAxisDelegateBinding: public InputDelegateBinding
{
public:
	TArray<struct BlueprintInputAxisDelegateBinding>             InputAxisDelegateBindings;                         // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InterpTrackInstSound: public InterpTrackInst
{
public:
	float                                                        LastUpdatePosition;                                // 0x28(0x4)
	class AudioComponent*                                        PlayAudioComp;                                     // 0x30(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class PhysicsCollisionHandler: public Object
{
public:
	float                                                        ImpactThreshold;                                   // 0x28(0x4)
	float                                                        ImpactReFireDelay;                                 // 0x2c(0x4)
	class SoundBase*                                             DefaultImpactSound;                                // 0x30(0x8)
	float                                                        LastImpactSoundTime;                               // 0x38(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class VertexAnimBase: public Object
{
public:
	class SkeletalMesh*                                          BaseSkelMesh;                                      // 0x28(0x8)
};


// Size 0x210 (Full Size[0x238] - InheritedSize[0x28]
class SkeletalMesh: public Object
{
public:
	class Skeleton*                                              Skeleton;                                          // 0x50(0x8)
	struct BoxSphereBounds                                       Bounds;                                            // 0x58(0x1c)
	TArray<struct SkeletalMaterial>                              Materials;                                         // 0x78(0x10)
	TArray<struct BoneMirrorInfo>                                SkelMirrorTable;                                   // 0x88(0x10)
	char                                                         SkelMirrorAxis;                                    // 0x98(0x1)
	char                                                         SkelMirrorFlipAxis;                                // 0x99(0x1)
	TArray<struct SkeletalMeshLODInfo>                           LODInfo;                                           // 0xa0(0x10)
	bool                                                         bUseFullPrecisionUVs;                              // 0xb0(0x1)
	bool                                                         bHasBeenSimplified;                                // 0xb0(0x1)
	bool                                                         bHasVertexColors;                                  // 0xb0(0x1)
	TArray<struct DeformablesSettings>                           DeformablesSettings;                               // 0xb8(0x10)
	bool                                                         bKeepTessellationAdjacency;                        // 0xc8(0x1)
	bool                                                         bKeepSkeletalMeshBuffersInMemory;                  // 0xc8(0x1)
	bool                                                         bEnablePerPolyCollision;                           // 0xc8(0x1)
	class BodySetup*                                             BodySetup;                                         // 0xd0(0x8)
	class PhysicsAsset*                                          PhysicsAsset;                                      // 0xd8(0x8)
	class HIKCharacterization*                                   Characterization;                                  // 0xe0(0x8)
	class PhysicsAsset*                                          DeformablesPhysicsAsset;                           // 0xe8(0x8)
	float                                                        StreamingDistanceMultiplier;                       // 0xf0(0x4)
	float                                                        StreamingDiscardedTexelRatios;                     // 0xf4(0x4)
	TArray<class MorphTarget*>                                   MorphTargets;                                      // 0xf8(0x10)
	TArray<class MeshPatchAsset*>                                MeshPatchAssets;                                   // 0x108(0x10)
	TArray<struct ClothingAssetData>                             ClothingAssets;                                    // 0x1f0(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x210(0x10)
	TArray<class SkeletalMeshSocket*>                            Sockets;                                           // 0x228(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class TimecodeProvider: public Object
{
public:
	float                                                        FrameDelay;                                        // 0x28(0x4)
};


// Size 0xc0 (Full Size[0xe8] - InheritedSize[0x28]
class SoundAttenuation: public Object
{
public:
	struct AttenuationSettings                                   Attenuation;                                       // 0x28(0xc0)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class FeatureToggledStringAssetReference: public DataAsset
{
public:
	TArray<struct FeatureToggledStringAssetReferenceEntry>       Entries;                                           // 0x28(0x10)
	class UClass*                                                ClassType;                                         // 0x38(0x8)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class TouchInterface: public Object
{
public:
	TArray<struct TouchInputControl>                             Controls;                                          // 0x28(0x10)
	float                                                        ActiveOpacity;                                     // 0x38(0x4)
	float                                                        InactiveOpacity;                                   // 0x3c(0x4)
	float                                                        TimeUntilDeactive;                                 // 0x40(0x4)
	float                                                        TimeUntilReset;                                    // 0x44(0x4)
	float                                                        ActivationDelay;                                   // 0x48(0x4)
	bool                                                         bPreventRecenter;                                  // 0x4c(0x1)
	float                                                        StartupDelay;                                      // 0x50(0x4)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class ExponentialHeightFog: public Info
{
public:
	class ExponentialHeightFogComponent*                         Component;                                         // 0x3c8(0x8)
	bool                                                         bEnabled;                                          // 0x3d0(0x1)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class SoundBase: public Object
{
public:
	class SoundClass*                                            SoundClassObject;                                  // 0x28(0x8)
	bool                                                         bDebug;                                            // 0x30(0x1)
	char                                                         MaxConcurrentResolutionRule;                       // 0x34(0x1)
	int                                                          MaxConcurrentPlayCount;                            // 0x38(0x4)
	float                                                        Duration;                                          // 0x3c(0x4)
	class SoundAttenuation*                                      AttenuationSettings;                               // 0x40(0x8)
};


// Size 0x138 (Full Size[0x188] - InheritedSize[0x50]
class ParticleModuleTypeDataBeam2: public ParticleModuleTypeDataBase
{
public:
	char                                                         BeamMethod;                                        // 0x50(0x1)
	int                                                          TextureTile;                                       // 0x54(0x4)
	float                                                        TextureTileDistance;                               // 0x58(0x4)
	int                                                          Sheets;                                            // 0x5c(0x4)
	int                                                          MaxBeamCount;                                      // 0x60(0x4)
	float                                                        Speed;                                             // 0x64(0x4)
	int                                                          InterpolationPoints;                               // 0x68(0x4)
	bool                                                         bAlwaysOn;                                         // 0x6c(0x1)
	int                                                          UpVectorStepSize;                                  // 0x70(0x4)
	struct FName                                                 BranchParentName;                                  // 0x74(0x8)
	struct RawDistributionFloat                                  Distance;                                          // 0x80(0x38)
	char                                                         TaperMethod;                                       // 0xb8(0x1)
	struct RawDistributionFloat                                  TaperFactor;                                       // 0xc0(0x38)
	struct RawDistributionFloat                                  TaperScale;                                        // 0xf8(0x38)
	bool                                                         RenderGeometry;                                    // 0x130(0x1)
	bool                                                         RenderDirectLine;                                  // 0x130(0x1)
	bool                                                         RenderLines;                                       // 0x130(0x1)
	bool                                                         RenderTessellation;                                // 0x130(0x1)
	TArray<class ParticleModuleBeamSource*>                      LOD_BeamModule_Source;                             // 0x138(0x10)
	TArray<class ParticleModuleBeamTarget*>                      LOD_BeamModule_Target;                             // 0x148(0x10)
	TArray<class ParticleModuleBeamNoise*>                       LOD_BeamModule_Noise;                              // 0x158(0x10)
	TArray<class ParticleModuleBeamModifier*>                    LOD_BeamModule_SourceModifier;                     // 0x168(0x10)
	TArray<class ParticleModuleBeamModifier*>                    LOD_BeamModule_TargetModifier;                     // 0x178(0x10)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class SkyLight: public Info
{
public:
	class SkyLightComponent*                                     LightComponent;                                    // 0x3c8(0x8)
	bool                                                         bEnabled;                                          // 0x3d0(0x1)
};


// Size 0x3a0 (Full Size[0x3c8] - InheritedSize[0x28]
class Actor: public Object
{
public:
	struct ActorTickFunction                                     PrimaryActorTick;                                  // 0x28(0x50)
	float                                                        CustomTimeDilation;                                // 0x78(0x4)
	bool                                                         bAllowRemovalFromServerWhenCollisionMerged;        // 0x7c(0x1)
	bool                                                         bAllowRemovalFromServerWhenAutomaticallyInstanced; // 0x7c(0x1)
	bool                                                         bHidden;                                           // 0x7c(0x1)
	bool                                                         bNetTemporary;                                     // 0x7c(0x1)
	bool                                                         bNetStartup;                                       // 0x7c(0x1)
	bool                                                         bOnlyRelevantToOwner;                              // 0x7c(0x1)
	bool                                                         bAlwaysRelevant;                                   // 0x7c(0x1)
	bool                                                         bReplicateMovement;                                // 0x7c(0x1)
	bool                                                         bTearOff;                                          // 0x7d(0x1)
	bool                                                         bExchangedRoles;                                   // 0x7d(0x1)
	bool                                                         bPendingNetUpdate;                                 // 0x7d(0x1)
	bool                                                         bNetLoadOnClient;                                  // 0x7d(0x1)
	bool                                                         bNetUseOwnerRelevancy;                             // 0x7d(0x1)
	bool                                                         bBlockInput;                                       // 0x7d(0x1)
	bool                                                         bCanBeInCluster;                                   // 0x7d(0x1)
	bool                                                         bActorEnableCollision;                             // 0x7e(0x1)
	bool                                                         bReplicateAttachment;                              // 0x7e(0x1)
	bool                                                         bReplicates;                                       // 0x7e(0x1)
	bool                                                         bActorVisible;                                     // 0x7e(0x1)
	char                                                         RemoteRole;                                        // 0x83(0x1)
	class Actor*                                                 Owner;                                             // 0x88(0x8)
	struct RepMovement                                           ReplicatedMovement;                                // 0x90(0x38)
	struct RepAttachment                                         AttachmentReplication;                             // 0xc8(0x48)
	char                                                         Role;                                              // 0x110(0x1)
	char                                                         SpawnRestrictions;                                 // 0x112(0x1)
	char                                                         AutoReceiveInput;                                  // 0x113(0x1)
	int                                                          InputPriority;                                     // 0x114(0x4)
	class InputComponent*                                        InputComponent;                                    // 0x118(0x8)
	float                                                        NetCullDistanceSquared;                            // 0x120(0x4)
	int                                                          NetTag;                                            // 0x128(0x4)
	float                                                        NetUpdateTime;                                     // 0x12c(0x4)
	float                                                        NetUpdateFrequency;                                // 0x130(0x4)
	float                                                        NetPriority;                                       // 0x134(0x4)
	float                                                        LastNetUpdateTime;                                 // 0x138(0x4)
	struct FName                                                 NetDriverName;                                     // 0x13c(0x8)
	bool                                                         bAutoDestroyWhenFinished;                          // 0x144(0x1)
	bool                                                         bCanBeDamaged;                                     // 0x144(0x1)
	bool                                                         bActorIsBeingDestroyed;                            // 0x144(0x1)
	bool                                                         bCollideWhenPlacing;                               // 0x144(0x1)
	bool                                                         bFindCameraComponentWhenViewTarget;                // 0x144(0x1)
	bool                                                         bRelevantForNetworkReplays;                        // 0x144(0x1)
	char                                                         SpawnCollisionHandlingMethod;                      // 0x148(0x1)
	class Pawn*                                                  Instigator;                                        // 0x150(0x8)
	TArray<class Actor*>                                         Children;                                          // 0x158(0x10)
	class SceneComponent*                                        RootComponent;                                     // 0x168(0x8)
	TArray<class MatineeActor*>                                  ControllingMatineeActors;                          // 0x170(0x10)
	float                                                        InitialLifeSpan;                                   // 0x180(0x4)
	bool                                                         bAllowReceiveTickEventOnDedicatedServer;           // 0x188(0x1)
	TArray<struct Name>                                          Layers;                                            // 0x190(0x10)
	struct ActorPtr                                              ParentComponentActor;                              // 0x1a0(0x8)
	TArray<uintptr_t>                                            ChildComponentActors;                              // 0x1a8(0x10)
	bool                                                         bActorSeamlessTraveled;                            // 0x1c0(0x1)
	bool                                                         bIgnoresOriginShifting;                            // 0x1c0(0x1)
	bool                                                         bEnableAutoLODGeneration;                          // 0x1c0(0x1)
	bool                                                         InvertFeatureCheck;                                // 0x1c0(0x1)
	struct FName                                                 Feature;                                           // 0x1c4(0x8)
	TArray<struct Name>                                          Tags;                                              // 0x1d0(0x10)
	uint64                                                       HiddenEditorViews;                                 // 0x1e0(0x8)
	bool                                                         bDoOverlapNotifiesOnLoad;                          // 0x229(0x1)
	TArray<class ActorComponent*>                                BlueprintCreatedComponents;                        // 0x320(0x10)
	TArray<class ActorComponent*>                                InstanceComponents;                                // 0x330(0x10)
	TArray<class Actor*>                                         ChildActorInterfaceProviders;                      // 0x348(0x10)
	double                                                       DormancyLingeringInSeconds;                        // 0x3c0(0x8)
};


// Size 0xc8 (Full Size[0xf0] - InheritedSize[0x28]
class Canvas: public Object
{
public:
	float                                                        OrgX;                                              // 0x28(0x4)
	float                                                        OrgY;                                              // 0x2c(0x4)
	float                                                        ClipX;                                             // 0x30(0x4)
	float                                                        ClipY;                                             // 0x34(0x4)
	struct Color                                                 DrawColor;                                         // 0x38(0x4)
	bool                                                         bCenterX;                                          // 0x3c(0x1)
	bool                                                         bCenterY;                                          // 0x3c(0x1)
	bool                                                         bNoSmooth;                                         // 0x3c(0x1)
	int                                                          SizeX;                                             // 0x40(0x4)
	int                                                          SizeY;                                             // 0x44(0x4)
	struct Plane                                                 ColorModulate;                                     // 0x50(0x10)
	class Texture2D*                                             DefaultTexture;                                    // 0x60(0x8)
	class Texture2D*                                             GradientTexture0;                                  // 0x68(0x8)
	class ReporterGraph*                                         ReporterGraph;                                     // 0x70(0x8)
};


// Size 0x18 (Full Size[0x68] - InheritedSize[0x50]
class ParticleModuleVectorFieldRotation: public ParticleModuleVectorFieldBase
{
public:
	struct Vector                                                MinInitialRotation;                                // 0x50(0xc)
	struct Vector                                                MaxInitialRotation;                                // 0x5c(0xc)
};


// Size 0x40 (Full Size[0x208] - InheritedSize[0x1c8]
class MaterialExpressionPredicatedTextureSampleParameter2D: public MaterialExpressionTextureSampleParameter2D
{
public:
	struct ExpressionInput                                       Predicate;                                         // 0x1c8(0x38)
	struct Color                                                 DefaultColour;                                     // 0x200(0x4)
};


// Size 0x88 (Full Size[0xb0] - InheritedSize[0x28]
class PlatformInterfaceWebResponse: public Object
{
public:
	struct FString                                               OriginalURL;                                       // 0x28(0x10)
	int                                                          ResponseCode;                                      // 0x38(0x4)
	int                                                          Tag;                                               // 0x3c(0x4)
	struct FString                                               StringResponse;                                    // 0x40(0x10)
	TArray<char>                                                 BinaryResponse;                                    // 0x50(0x10)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class StreamingSettings: public DeveloperSettings
{
public:
	bool                                                         AsyncLoadingThreadEnabled;                         // 0x38(0x1)
	bool                                                         WarnIfTimeLimitExceeded;                           // 0x38(0x1)
	float                                                        TimeLimitExceededMultiplier;                       // 0x3c(0x4)
	float                                                        TimeLimitExceededMinTime;                          // 0x40(0x4)
	int                                                          MinBulkDataSizeForAsyncLoading;                    // 0x44(0x4)
	float                                                        AsyncIOBandwidthLimit;                             // 0x48(0x4)
	bool                                                         UseBackgroundLevelStreaming;                       // 0x4c(0x1)
	bool                                                         AsyncLoadingUseFullTimeLimit;                      // 0x4c(0x1)
	float                                                        AsyncLoadingTimeLimit;                             // 0x50(0x4)
	float                                                        PriorityAsyncLoadingExtraTime;                     // 0x54(0x4)
	float                                                        LevelStreamingActorsUpdateTimeLimit;               // 0x58(0x4)
	int                                                          LevelStreamingComponentsRegistrationGranularity;   // 0x5c(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ComponentDelegateBinding: public DynamicBlueprintBinding
{
public:
	TArray<struct BlueprintComponentDelegateBinding>             ComponentDelegateBindings;                         // 0x28(0x10)
};


// Size 0x8 (Full Size[0x1d0] - InheritedSize[0x1c8]
class MaterialExpressionTextureSampleParameterSubUV: public MaterialExpressionTextureSampleParameter2D
{
public:
	bool                                                         bBlend;                                            // 0x1c8(0x1)
	bool                                                         bMipBiasOnLowResolution;                           // 0x1c8(0x1)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class SCS_Node: public Object
{
public:
	class ActorComponent*                                        ComponentTemplate;                                 // 0x28(0x8)
	struct FName                                                 VariableName;                                      // 0x30(0x8)
	struct FName                                                 AttachToName;                                      // 0x38(0x8)
	struct FName                                                 ParentComponentOrVariableName;                     // 0x40(0x8)
	struct FName                                                 ParentComponentOwnerClassName;                     // 0x48(0x8)
	bool                                                         bIsParentComponentNative;                          // 0x50(0x1)
	bool                                                         ServerMigrationFlagSet;                            // 0x51(0x1)
	TArray<class SCS_Node*>                                      ChildNodes;                                        // 0x58(0x10)
	TArray<struct BPVariableMetaDataEntry>                       MetaDataArray;                                     // 0x68(0x10)
	struct Guid                                                  VariableGuid;                                      // 0x78(0x10)
};


// Size 0x40 (Full Size[0x90] - InheritedSize[0x50]
class ParticleModuleMeshRotationRateOverLife: public ParticleModuleRotationRateBase
{
public:
	struct RawDistributionVector                                 RotRate;                                           // 0x50(0x38)
	bool                                                         bScaleRotRate;                                     // 0x88(0x1)
};


// Size 0x70 (Full Size[0xe8] - InheritedSize[0x78]
class AnimMontage: public AnimCompositeBase
{
public:
	float                                                        BlendInTime;                                       // 0x78(0x4)
	float                                                        BlendOutTime;                                      // 0x7c(0x4)
	float                                                        BlendOutTriggerTime;                               // 0x80(0x4)
	TArray<struct CompositeSection>                              CompositeSections;                                 // 0x88(0x10)
	TArray<struct SlotAnimationTrack>                            SlotAnimTracks;                                    // 0x98(0x10)
	TArray<struct BranchingPoint>                                BranchingPoints;                                   // 0xa8(0x10)
	bool                                                         bEnableRootMotionTranslation;                      // 0xb8(0x1)
	bool                                                         bEnableRootMotionRotation;                         // 0xb9(0x1)
	char                                                         RootMotionRootLock;                                // 0xba(0x1)
	TArray<struct BranchingPointMarker>                          BranchingPointMarkers;                             // 0xc0(0x10)
	bool                                                         bAnimBranchingPointNeedsSort;                      // 0xd0(0x1)
	TArray<int>                                                  BranchingPointStateNotifyIndices;                  // 0xd8(0x10)
};


// Size 0x9a8 (Full Size[0x9d0] - InheritedSize[0x28]
class Engine: public Object
{
public:
	class Font*                                                  TinyFont;                                          // 0x30(0x8)
	struct StringAssetReference                                  TinyFontName;                                      // 0x38(0x10)
	class Font*                                                  SmallFont;                                         // 0x48(0x8)
	struct StringAssetReference                                  SmallFontName;                                     // 0x50(0x10)
	class Font*                                                  MediumFont;                                        // 0x60(0x8)
	struct StringAssetReference                                  MediumFontName;                                    // 0x68(0x10)
	class Font*                                                  LargeFont;                                         // 0x78(0x8)
	struct StringAssetReference                                  LargeFontName;                                     // 0x80(0x10)
	class Font*                                                  MonoFont;                                          // 0x90(0x8)
	struct StringAssetReference                                  MonoFontName;                                      // 0x98(0x10)
	class Font*                                                  SubtitleFont;                                      // 0xa8(0x8)
	struct StringAssetReference                                  SubtitleFontName;                                  // 0xb0(0x10)
	class Font*                                                  HugeFont;                                          // 0xc0(0x8)
	struct StringAssetReference                                  HugeFontName;                                      // 0xc8(0x10)
	TArray<class Font*>                                          AdditionalFonts;                                   // 0xd8(0x10)
	TArray<String>                                               AdditionalFontNames;                               // 0xf0(0x10)
	class UClass*                                                ConsoleClass;                                      // 0x100(0x8)
	struct StringClassReference                                  ConsoleClassName;                                  // 0x108(0x10)
	class UClass*                                                GameViewportClientClass;                           // 0x118(0x8)
	struct StringClassReference                                  GameViewportClientClassName;                       // 0x120(0x10)
	class UClass*                                                LocalPlayerClass;                                  // 0x130(0x8)
	struct StringClassReference                                  LocalPlayerClassName;                              // 0x138(0x10)
	class UClass*                                                WorldSettingsClass;                                // 0x148(0x8)
	struct StringClassReference                                  WorldSettingsClassName;                            // 0x150(0x10)
	struct StringClassReference                                  NavigationSystemClassName;                         // 0x160(0x10)
	class UClass*                                                NavigationSystemClass;                             // 0x170(0x8)
	struct StringClassReference                                  AvoidanceManagerClassName;                         // 0x178(0x10)
	class UClass*                                                AvoidanceManagerClass;                             // 0x188(0x8)
	class UClass*                                                PhysicsCollisionHandlerClass;                      // 0x190(0x8)
	struct StringClassReference                                  PhysicsCollisionHandlerClassName;                  // 0x198(0x10)
	struct StringClassReference                                  GameUserSettingsClassName;                         // 0x1a8(0x10)
	class UClass*                                                GameUserSettingsClass;                             // 0x1b8(0x8)
	struct StringClassReference                                  AIControllerClassName;                             // 0x1c0(0x10)
	class GameUserSettings*                                      GameUserSettings;                                  // 0x1d0(0x8)
	class UClass*                                                LevelScriptActorClass;                             // 0x1d8(0x8)
	struct StringClassReference                                  LevelScriptActorClassName;                         // 0x1e0(0x10)
	struct StringClassReference                                  DefaultBlueprintBaseClassName;                     // 0x1f0(0x10)
	struct StringClassReference                                  GameSingletonClassName;                            // 0x200(0x10)
	class Object*                                                GameSingleton;                                     // 0x210(0x8)
	class UClass*                                                DefaultPreviewPawnClass;                           // 0x218(0x8)
	struct StringClassReference                                  DefaultPreviewPawnClassName;                       // 0x220(0x10)
	struct FString                                               PlayOnConsoleSaveDir;                              // 0x230(0x10)
	class Texture2D*                                             DefaultTexture;                                    // 0x240(0x8)
	struct StringAssetReference                                  DefaultTextureName;                                // 0x248(0x10)
	class Texture*                                               DefaultDiffuseTexture;                             // 0x258(0x8)
	struct StringAssetReference                                  DefaultDiffuseTextureName;                         // 0x260(0x10)
	class Texture2D*                                             DefaultBSPVertexTexture;                           // 0x270(0x8)
	struct StringAssetReference                                  DefaultBSPVertexTextureName;                       // 0x278(0x10)
	class Texture2D*                                             HighFrequencyNoiseTexture;                         // 0x288(0x8)
	struct StringAssetReference                                  HighFrequencyNoiseTextureName;                     // 0x290(0x10)
	class Texture2D*                                             DefaultBokehTexture;                               // 0x2a0(0x8)
	struct StringAssetReference                                  DefaultBokehTextureName;                           // 0x2a8(0x10)
	class Texture2D*                                             HDRCalibrationTexture;                             // 0x2b8(0x8)
	struct StringAssetReference                                  HDRCalibrationTextureName;                         // 0x2c0(0x10)
	class Material*                                              WireframeMaterial;                                 // 0x2d0(0x8)
	struct FString                                               WireframeMaterialName;                             // 0x2d8(0x10)
	class Material*                                              DebugMeshMaterial;                                 // 0x2e8(0x8)
	struct StringAssetReference                                  DebugMeshMaterialName;                             // 0x2f0(0x10)
	class Material*                                              LevelColorationLitMaterial;                        // 0x300(0x8)
	struct FString                                               LevelColorationLitMaterialName;                    // 0x308(0x10)
	class Material*                                              LevelColorationUnlitMaterial;                      // 0x318(0x8)
	struct FString                                               LevelColorationUnlitMaterialName;                  // 0x320(0x10)
	class Material*                                              TriangleDensityScreenSpaceMaterial;                // 0x330(0x8)
	struct FString                                               TriangleDensityScreenSpaceMaterialName;            // 0x338(0x10)
	class Material*                                              TriangleDensityWorldSpaceMaterial;                 // 0x348(0x8)
	struct FString                                               TriangleDensityWorldSpaceMaterialName;             // 0x350(0x10)
	class Material*                                              LightingTexelDensityMaterial;                      // 0x360(0x8)
	struct FString                                               LightingTexelDensityName;                          // 0x368(0x10)
	class Material*                                              ShadedLevelColorationLitMaterial;                  // 0x378(0x8)
	struct FString                                               ShadedLevelColorationLitMaterialName;              // 0x380(0x10)
	class Material*                                              ShadedLevelColorationUnlitMaterial;                // 0x390(0x8)
	struct FString                                               ShadedLevelColorationUnlitMaterialName;            // 0x398(0x10)
	class Material*                                              RemoveSurfaceMaterial;                             // 0x3a8(0x8)
	struct StringAssetReference                                  RemoveSurfaceMaterialName;                         // 0x3b0(0x10)
	class Material*                                              VertexColorMaterial;                               // 0x3c0(0x8)
	struct FString                                               VertexColorMaterialName;                           // 0x3c8(0x10)
	class Material*                                              VertexColorViewModeMaterial_ColorOnly;             // 0x3d8(0x8)
	struct FString                                               VertexColorViewModeMaterialName_ColorOnly;         // 0x3e0(0x10)
	class Material*                                              VertexColorViewModeMaterial_AlphaAsColor;          // 0x3f0(0x8)
	struct FString                                               VertexColorViewModeMaterialName_AlphaAsColor;      // 0x3f8(0x10)
	class Material*                                              VertexColorViewModeMaterial_RedOnly;               // 0x408(0x8)
	struct FString                                               VertexColorViewModeMaterialName_RedOnly;           // 0x410(0x10)
	class Material*                                              VertexColorViewModeMaterial_GreenOnly;             // 0x420(0x8)
	struct FString                                               VertexColorViewModeMaterialName_GreenOnly;         // 0x428(0x10)
	class Material*                                              VertexColorViewModeMaterial_BlueOnly;              // 0x438(0x8)
	struct FString                                               VertexColorViewModeMaterialName_BlueOnly;          // 0x440(0x10)
	class Material*                                              ConstraintLimitMaterial;                           // 0x450(0x8)
	class MaterialInstanceDynamic*                               ConstraintLimitMaterialX;                          // 0x458(0x8)
	class MaterialInstanceDynamic*                               ConstraintLimitMaterialY;                          // 0x460(0x8)
	class MaterialInstanceDynamic*                               ConstraintLimitMaterialZ;                          // 0x468(0x8)
	struct StringAssetReference                                  ConstraintLimitMaterialName;                       // 0x470(0x10)
	class Material*                                              InvalidLightmapSettingsMaterial;                   // 0x480(0x8)
	struct StringAssetReference                                  InvalidLightmapSettingsMaterialName;               // 0x488(0x10)
	class Material*                                              PreviewShadowsIndicatorMaterial;                   // 0x498(0x8)
	struct StringAssetReference                                  PreviewShadowsIndicatorMaterialName;               // 0x4a0(0x10)
	class Material*                                              ArrowMaterial;                                     // 0x4b0(0x8)
	struct StringAssetReference                                  ArrowMaterialName;                                 // 0x4b8(0x10)
	struct LinearColor                                           LightingOnlyBrightness;                            // 0x4c8(0x10)
	TArray<struct Color>                                         LightComplexityColors;                             // 0x4d8(0x10)
	TArray<struct LinearColor>                                   ShaderComplexityColors;                            // 0x4e8(0x10)
	TArray<struct LinearColor>                                   StationaryLightOverlapColors;                      // 0x4f8(0x10)
	TArray<struct LinearColor>                                   LODColorationColors;                               // 0x508(0x10)
	float                                                        MaxPixelShaderAdditiveComplexityCount;             // 0x518(0x4)
	float                                                        MaxES2PixelShaderAdditiveComplexityCount;          // 0x51c(0x4)
	float                                                        MinLightMapDensity;                                // 0x520(0x4)
	float                                                        IdealLightMapDensity;                              // 0x524(0x4)
	float                                                        MaxLightMapDensity;                                // 0x528(0x4)
	bool                                                         bRenderLightMapDensityGrayscale;                   // 0x52c(0x1)
	float                                                        RenderLightMapDensityGrayscaleScale;               // 0x530(0x4)
	float                                                        RenderLightMapDensityColorScale;                   // 0x534(0x4)
	struct LinearColor                                           LightMapDensityVertexMappedColor;                  // 0x538(0x10)
	struct LinearColor                                           LightMapDensitySelectedColor;                      // 0x548(0x10)
	TArray<struct StatColorMapping>                              StatColorMappings;                                 // 0x558(0x10)
	class PhysicalMaterial*                                      DefaultPhysMaterial;                               // 0x568(0x8)
	struct StringAssetReference                                  DefaultPhysMaterialName;                           // 0x570(0x10)
	TArray<struct GameNameRedirect>                              ActiveGameNameRedirects;                           // 0x580(0x10)
	TArray<struct ClassRedirect>                                 ActiveClassRedirects;                              // 0x590(0x10)
	TArray<struct PluginRedirect>                                ActivePluginRedirects;                             // 0x5a0(0x10)
	TArray<struct StructRedirect>                                ActiveStructRedirects;                             // 0x5b0(0x10)
	class Texture2D*                                             PreIntegratedSkinBRDFTexture;                      // 0x5c0(0x8)
	struct StringAssetReference                                  PreIntegratedSkinBRDFTextureName;                  // 0x5c8(0x10)
	class Texture2D*                                             MiniFontTexture;                                   // 0x5d8(0x8)
	struct StringAssetReference                                  MiniFontTextureName;                               // 0x5e0(0x10)
	class Texture*                                               WeightMapPlaceholderTexture;                       // 0x5f0(0x8)
	struct StringAssetReference                                  WeightMapPlaceholderTextureName;                   // 0x5f8(0x10)
	class Texture2D*                                             LightMapDensityTexture;                            // 0x608(0x8)
	struct StringAssetReference                                  LightMapDensityTextureName;                        // 0x610(0x10)
	class GameViewportClient*                                    GameViewport;                                      // 0x628(0x8)
	TArray<String>                                               DeferredCommands;                                  // 0x630(0x10)
	int                                                          TickCycles;                                        // 0x640(0x4)
	int                                                          GameCycles;                                        // 0x644(0x4)
	int                                                          ClientCycles;                                      // 0x648(0x4)
	float                                                        NearClipPlane;                                     // 0x64c(0x4)
	bool                                                         bHardwareSurveyEnabled;                            // 0x650(0x1)
	bool                                                         bSubtitlesEnabled;                                 // 0x650(0x1)
	bool                                                         bSubtitlesForcedOff;                               // 0x650(0x1)
	int                                                          MaximumLoopIterationCount;                         // 0x654(0x4)
	bool                                                         bCanBlueprintsTickByDefault;                       // 0x658(0x1)
	bool                                                         bOptimizeAnimBlueprintMemberVariableAccess;        // 0x658(0x1)
	bool                                                         bEnableEditorPSysRealtimeLOD;                      // 0x658(0x1)
	bool                                                         bSmoothFrameRate;                                  // 0x658(0x1)
	bool                                                         bUseFixedFrameRate;                                // 0x658(0x1)
	float                                                        FixedFrameRate;                                    // 0x65c(0x4)
	struct FloatRange                                            SmoothedFrameRateRange;                            // 0x660(0x10)
	class EngineCustomTimeStep*                                  CustomTimeStep;                                    // 0x670(0x8)
	class TimecodeProvider*                                      TimecodeProvider;                                  // 0x698(0x8)
	bool                                                         bGenerateDefaultTimecode;                          // 0x6b9(0x1)
	float                                                        GenerateDefaultTimecodeFrameDelay;                 // 0x6c4(0x4)
	bool                                                         bCheckForMultiplePawnsSpawnedInAFrame;             // 0x6c8(0x1)
	int                                                          NumPawnsAllowedToBeSpawnedInAFrame;                // 0x6cc(0x4)
	bool                                                         bShouldGenerateLowQualityLightmaps;                // 0x6d0(0x1)
	struct Color                                                 C_WorldBox;                                        // 0x6d4(0x4)
	struct Color                                                 C_BrushWire;                                       // 0x6d8(0x4)
	struct Color                                                 C_AddWire;                                         // 0x6dc(0x4)
	struct Color                                                 C_SubtractWire;                                    // 0x6e0(0x4)
	struct Color                                                 C_SemiSolidWire;                                   // 0x6e4(0x4)
	struct Color                                                 C_NonSolidWire;                                    // 0x6e8(0x4)
	struct Color                                                 C_WireBackground;                                  // 0x6ec(0x4)
	struct Color                                                 C_ScaleBoxHi;                                      // 0x6f0(0x4)
	struct Color                                                 C_VolumeCollision;                                 // 0x6f4(0x4)
	struct Color                                                 C_BSPCollision;                                    // 0x6f8(0x4)
	struct Color                                                 C_OrthoBackground;                                 // 0x6fc(0x4)
	struct Color                                                 C_Volume;                                          // 0x700(0x4)
	struct Color                                                 C_BrushShape;                                      // 0x704(0x4)
	float                                                        StreamingDistanceFactor;                           // 0x708(0x4)
	char                                                         TransitionType;                                    // 0x70c(0x1)
	struct FString                                               TransitionDescription;                             // 0x710(0x10)
	struct FString                                               TransitionGameMode;                                // 0x720(0x10)
	float                                                        MeshLODRange;                                      // 0x730(0x4)
	bool                                                         bAllowMatureLanguage;                              // 0x734(0x1)
	float                                                        CameraRotationThreshold;                           // 0x738(0x4)
	float                                                        CameraTranslationThreshold;                        // 0x73c(0x4)
	float                                                        PrimitiveProbablyVisibleTime;                      // 0x740(0x4)
	float                                                        MaxOcclusionPixelsFraction;                        // 0x744(0x4)
	bool                                                         bPauseOnLossOfFocus;                               // 0x748(0x1)
	int                                                          MaxParticleResize;                                 // 0x74c(0x4)
	int                                                          MaxParticleResizeWarn;                             // 0x750(0x4)
	TArray<struct DropNoteInfo>                                  PendingDroppedNotes;                               // 0x758(0x10)
	struct RigidBodyErrorCorrection                              PhysicErrorCorrection;                             // 0x768(0x1c)
	float                                                        NetClientTicksPerSecond;                           // 0x784(0x4)
	bool                                                         bHasPendingGlobalReregister;                       // 0x788(0x1)
	float                                                        DisplayGamma;                                      // 0x78c(0x4)
	float                                                        MinDesiredFrameRate;                               // 0x790(0x4)
	struct LinearColor                                           DefaultSelectedMaterialColor;                      // 0x794(0x10)
	struct LinearColor                                           SelectedMaterialColor;                             // 0x7a4(0x10)
	struct LinearColor                                           SelectionOutlineColor;                             // 0x7b4(0x10)
	struct LinearColor                                           SubduedSelectionOutlineColor;                      // 0x7c4(0x10)
	struct LinearColor                                           SelectedMaterialColorOverride;                     // 0x7d4(0x10)
	bool                                                         bIsOverridingSelectedColor;                        // 0x7e4(0x1)
	bool                                                         bEnableOnScreenDebugMessages;                      // 0x7e8(0x1)
	bool                                                         bEnableOnScreenDebugMessagesDisplay;               // 0x7e8(0x1)
	bool                                                         bSuppressMapWarnings;                              // 0x7e8(0x1)
	bool                                                         bCookSeparateSharedMPGameContent;                  // 0x7e8(0x1)
	bool                                                         bDisableAILogging;                                 // 0x7e8(0x1)
	uint32                                                       bEnableVisualLogRecordingOnStart;                  // 0x7ec(0x4)
	int                                                          ScreenSaverInhibitorSemaphore;                     // 0x7f4(0x4)
	bool                                                         bLockReadOnlyLevels;                               // 0x7f8(0x1)
	struct FString                                               ParticleEventManagerClassPath;                     // 0x800(0x10)
	float                                                        SelectionHighlightIntensity;                       // 0x820(0x4)
	float                                                        BSPSelectionHighlightIntensity;                    // 0x824(0x4)
	float                                                        HoverHighlightIntensity;                           // 0x828(0x4)
	float                                                        SelectionHighlightIntensityBillboards;             // 0x82c(0x4)
	TArray<struct NetDriverDefinition>                           NetDriverDefinitions;                              // 0x960(0x10)
	TArray<String>                                               ServerActors;                                      // 0x970(0x10)
	TArray<String>                                               RuntimeServerActors;                               // 0x980(0x10)
	bool                                                         bStartedLoadMapMovie;                              // 0x990(0x1)
	int                                                          NextWorldContextHandle;                            // 0x9a8(0x4)
};


// Size 0xb0 (Full Size[0x100] - InheritedSize[0x50]
class ParticleModuleAttractorPoint: public ParticleModuleAttractorBase
{
public:
	struct RawDistributionVector                                 Position;                                          // 0x50(0x38)
	struct RawDistributionFloat                                  Range;                                             // 0x88(0x38)
	struct RawDistributionFloat                                  Strength;                                          // 0xc0(0x38)
	bool                                                         StrengthByDistance;                                // 0xf8(0x1)
	bool                                                         bAffectBaseVelocity;                               // 0xf8(0x1)
	bool                                                         bOverrideVelocity;                                 // 0xf8(0x1)
	bool                                                         bUseWorldSpacePosition;                            // 0xf8(0x1)
	bool                                                         Positive_X;                                        // 0xf8(0x1)
	bool                                                         Positive_Y;                                        // 0xf8(0x1)
	bool                                                         Positive_Z;                                        // 0xf8(0x1)
	bool                                                         Negative_X;                                        // 0xf8(0x1)
	bool                                                         Negative_Y;                                        // 0xf9(0x1)
	bool                                                         Negative_Z;                                        // 0xf9(0x1)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class BrushBuilder: public Object
{
public:
	struct FString                                               BitmapFilename;                                    // 0x28(0x10)
	struct FString                                               Tooltip;                                           // 0x38(0x10)
	bool                                                         NotifyBadParams;                                   // 0x48(0x1)
	TArray<struct Vector>                                        Vertices;                                          // 0x50(0x10)
	TArray<struct BuilderPoly>                                   Polys;                                             // 0x60(0x10)
	struct FName                                                 Layer;                                             // 0x70(0x8)
	bool                                                         MergeCoplanars;                                    // 0x78(0x1)
};


// Size 0xc8 (Full Size[0xf0] - InheritedSize[0x28]
class AnimSet: public Object
{
public:
	bool                                                         bAnimRotationOnly;                                 // 0x28(0x1)
	TArray<struct Name>                                          TrackBoneNames;                                    // 0x30(0x10)
	TArray<struct AnimSetMeshLinkup>                             LinkupCache;                                       // 0x40(0x10)
	TArray<char>                                                 BoneUseAnimTranslation;                            // 0x50(0x10)
	TArray<char>                                                 ForceUseMeshTranslation;                           // 0x60(0x10)
	TArray<struct Name>                                          UseTranslationBoneNames;                           // 0x70(0x10)
	TArray<struct Name>                                          ForceMeshTranslationBoneNames;                     // 0x80(0x10)
	struct FName                                                 PreviewSkelMeshName;                               // 0x90(0x8)
	struct FName                                                 BestRatioSkelMeshName;                             // 0x98(0x8)
};


// Size 0xa8 (Full Size[0xd0] - InheritedSize[0x28]
class TextPropertyTestObject: public Object
{
public:
	struct FText                                                 DefaultedText;                                     // 0x28(0x38)
	struct FText                                                 UndefaultedText;                                   // 0x60(0x38)
	struct FText                                                 TransientText;                                     // 0x98(0x38)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class SoundNodeWaveParam: public SoundNode
{
public:
	struct FName                                                 WaveParameterName;                                 // 0x38(0x8)
};


// Size 0x50 (Full Size[0x418] - InheritedSize[0x3c8]
class Emitter: public Actor
{
public:
	class ParticleSystemComponent*                               ParticleSystemComponent;                           // 0x3c8(0x8)
	bool                                                         bDestroyOnSystemFinish;                            // 0x3d0(0x1)
	bool                                                         bPostUpdateTickGroup;                              // 0x3d0(0x1)
	bool                                                         bCurrentlyActive;                                  // 0x3d0(0x1)
	multicastinlinedelegate                                      OnParticleSpawn;                                   // 0x3d8(0x10)
	multicastinlinedelegate                                      OnParticleBurst;                                   // 0x3e8(0x10)
	multicastinlinedelegate                                      OnParticleDeath;                                   // 0x3f8(0x10)
	multicastinlinedelegate                                      OnParticleCollide;                                 // 0x408(0x10)
};


// Size 0x20 (Full Size[0x90] - InheritedSize[0x70]
class InterpTrackLinearColorBase: public InterpTrack
{
public:
	struct InterpCurveLinearColor                                LinearColorTrack;                                  // 0x70(0x18)
	float                                                        CurveTension;                                      // 0x88(0x4)
};


// Size 0x18 (Full Size[0x158] - InheritedSize[0x140]
class Texture2DDynamic: public Texture
{
public:
	char                                                         Format;                                            // 0x148(0x1)
};


// Size 0x80 (Full Size[0xf0] - InheritedSize[0x70]
class MaterialExpressionSceneColor: public MaterialExpression
{
public:
	char                                                         InputMode;                                         // 0x70(0x1)
	struct ExpressionInput                                       Input;                                             // 0x78(0x38)
	struct ExpressionInput                                       OffsetFraction;                                    // 0xb0(0x38)
	struct Vector2D                                              ConstInput;                                        // 0xe8(0x8)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class SoundNodeMixer: public SoundNode
{
public:
	TArray<float>                                                InputVolume;                                       // 0x38(0x10)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class CalmWaterZone: public Actor
{
public:
	class CalmWaterComponent*                                    CalmWaterComponent;                                // 0x3c8(0x8)
};


// Size 0x40 (Full Size[0x88] - InheritedSize[0x48]
class VectorFieldAnimated: public VectorField
{
public:
	class Texture2D*                                             Texture;                                           // 0x48(0x8)
	char                                                         ConstructionOp;                                    // 0x50(0x1)
	int                                                          VolumeSizeX;                                       // 0x54(0x4)
	int                                                          VolumeSizeY;                                       // 0x58(0x4)
	int                                                          VolumeSizeZ;                                       // 0x5c(0x4)
	int                                                          SubImagesX;                                        // 0x60(0x4)
	int                                                          SubImagesY;                                        // 0x64(0x4)
	int                                                          FrameCount;                                        // 0x68(0x4)
	float                                                        FramesPerSecond;                                   // 0x6c(0x4)
	bool                                                         bLoop;                                             // 0x70(0x1)
	class VectorFieldStatic*                                     NoiseField;                                        // 0x78(0x8)
	float                                                        NoiseScale;                                        // 0x80(0x4)
	float                                                        NoiseMax;                                          // 0x84(0x4)
};


// Size 0x78 (Full Size[0x440] - InheritedSize[0x3c8]
class Pawn: public Actor
{
public:
	bool                                                         bUseControllerRotationPitch;                       // 0x3d0(0x1)
	bool                                                         bUseControllerRotationYaw;                         // 0x3d0(0x1)
	bool                                                         bUseControllerRotationRoll;                        // 0x3d0(0x1)
	bool                                                         bCanAffectNavigationGeneration;                    // 0x3d0(0x1)
	float                                                        BaseEyeHeight;                                     // 0x3d4(0x4)
	char                                                         AutoPossessPlayer;                                 // 0x3d8(0x1)
	char                                                         AutoPossessAI;                                     // 0x3d9(0x1)
	class UClass*                                                AIControllerClass;                                 // 0x3e0(0x8)
	class PlayerState*                                           PlayerState;                                       // 0x3e8(0x8)
	char                                                         RemoteViewPitch;                                   // 0x3f0(0x1)
	class Controller*                                            LastHitBy;                                         // 0x3f8(0x8)
	class Controller*                                            Controller;                                        // 0x400(0x8)
	struct Vector                                                ControlInputVector;                                // 0x420(0xc)
	struct Vector                                                LastControlInputVector;                            // 0x42c(0xc)
};


// Size 0x1898 (Full Size[0x1c60] - InheritedSize[0x3c8]
class PlayerCameraManager: public Actor
{
public:
	class PlayerController*                                      PCOwner;                                           // 0x3c8(0x8)
	class SceneComponent*                                        TransformComponent;                                // 0x3d0(0x8)
	float                                                        DefaultFOV;                                        // 0x3e0(0x4)
	float                                                        DefaultOrthoWidth;                                 // 0x3e8(0x4)
	float                                                        DefaultAspectRatio;                                // 0x3f0(0x4)
	struct CameraCacheEntry                                      CameraCache;                                       // 0x440(0x5b0)
	struct CameraCacheEntry                                      LastFrameCameraCache;                              // 0x9f0(0x5b0)
	struct TViewTarget                                           ViewTarget;                                        // 0xfa0(0x5c0)
	struct TViewTarget                                           PendingViewTarget;                                 // 0x1560(0x5c0)
	TArray<class CameraModifier*>                                ModifierList;                                      // 0x1b50(0x10)
	TArray<class Class*>                                         DefaultModifiers;                                  // 0x1b60(0x10)
	float                                                        FreeCamDistance;                                   // 0x1b70(0x4)
	struct Vector                                                FreeCamOffset;                                     // 0x1b74(0xc)
	struct Vector                                                ViewTargetOffset;                                  // 0x1b80(0xc)
	TArray<class EmitterCameraLensEffectBase*>                   CameraLensEffects;                                 // 0x1ba0(0x10)
	class CameraModifier_CameraShake*                            CachedCameraShakeMod;                              // 0x1bb0(0x8)
	class CameraAnimInst*                                        AnimInstPool;                                      // 0x1bb8(0x8)
	TArray<struct PostProcessSettings>                           PostProcessBlendCache;                             // 0x1bf8(0x10)
	TArray<class CameraAnimInst*>                                ActiveAnims;                                       // 0x1c18(0x10)
	TArray<class CameraAnimInst*>                                FreeAnims;                                         // 0x1c28(0x10)
	class CameraActor*                                           AnimCameraActor;                                   // 0x1c38(0x8)
	bool                                                         bIsOrthographic;                                   // 0x1c40(0x1)
	bool                                                         bUseClientSideCameraUpdates;                       // 0x1c40(0x1)
	bool                                                         bFollowHmdOrientation;                             // 0x1c41(0x1)
	float                                                        ViewPitchMin;                                      // 0x1c44(0x4)
	float                                                        ViewPitchMax;                                      // 0x1c48(0x4)
	float                                                        ViewYawMin;                                        // 0x1c4c(0x4)
	float                                                        ViewYawMax;                                        // 0x1c50(0x4)
	float                                                        ViewRollMin;                                       // 0x1c54(0x4)
	float                                                        ViewRollMax;                                       // 0x1c58(0x4)
};


// Size 0x28 (Full Size[0x98] - InheritedSize[0x70]
class MaterialExpressionComment: public MaterialExpression
{
public:
	int                                                          SizeX;                                             // 0x70(0x4)
	int                                                          SizeY;                                             // 0x74(0x4)
	struct FString                                               Text;                                              // 0x78(0x10)
	struct LinearColor                                           CommentColor;                                      // 0x88(0x10)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class SoundNodeDoppler: public SoundNode
{
public:
	float                                                        DopplerIntensity;                                  // 0x38(0x4)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class InGameAdManager: public PlatformInterfaceBase
{
public:
	bool                                                         bShouldPauseWhileAdOpen;                           // 0x38(0x1)
	TArray<uintptr_t>                                            ClickedBannerDelegates;                            // 0x40(0x10)
	TArray<uintptr_t>                                            ClosedAdDelegates;                                 // 0x50(0x10)
};


// Size 0x78 (Full Size[0xe8] - InheritedSize[0x70]
class MaterialExpressionPower: public MaterialExpression
{
public:
	struct ExpressionInput                                       Base;                                              // 0x70(0x38)
	struct ExpressionInput                                       Exponent;                                          // 0xa8(0x38)
	float                                                        ConstExponent;                                     // 0xe0(0x4)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class VectorFieldVolume: public Actor
{
public:
	class VectorFieldComponent*                                  VectorFieldComponent;                              // 0x3c8(0x8)
};


// Size 0x20 (Full Size[0x1c8] - InheritedSize[0x1a8]
class ParticleModuleRotation_Seeded: public ParticleModuleRotation
{
public:
	struct ParticleRandomSeedInfo                                RandomSeedInfo;                                    // 0x1a8(0x20)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionFloor: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
};


// Size 0x30 (Full Size[0x2f8] - InheritedSize[0x2c8]
class BodySetup2D: public BodySetup
{
public:
	struct AggregateGeometry2D                                   AggGeom2D;                                         // 0x2c8(0x30)
};


// Size 0xe8 (Full Size[0x158] - InheritedSize[0x70]
class MaterialExpressionRotateAboutAxis: public MaterialExpression
{
public:
	struct ExpressionInput                                       NormalizedRotationAxis;                            // 0x70(0x38)
	struct ExpressionInput                                       RotationAngle;                                     // 0xa8(0x38)
	struct ExpressionInput                                       PivotPoint;                                        // 0xe0(0x38)
	struct ExpressionInput                                       Position;                                          // 0x118(0x38)
	float                                                        Period;                                            // 0x150(0x4)
};


// Size 0x18 (Full Size[0x68] - InheritedSize[0x50]
class ParticleModuleParametersOverX: public ParticleModule
{
public:
	float                                                        GroupScales;                                       // 0x50(0x4)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionLogarithm2: public MaterialExpression
{
public:
	struct ExpressionInput                                       X;                                                 // 0x70(0x38)
};


// Size 0x50 (Full Size[0x118] - InheritedSize[0xc8]
class ApplicationLifecycleComponent: public ActorComponent
{
public:
	multicastinlinedelegate                                      ApplicationWillDeactivateDelegate;                 // 0xc8(0x10)
	multicastinlinedelegate                                      ApplicationHasReactivatedDelegate;                 // 0xd8(0x10)
	multicastinlinedelegate                                      ApplicationWillEnterBackgroundDelegate;            // 0xe8(0x10)
	multicastinlinedelegate                                      ApplicationHasEnteredForegroundDelegate;           // 0xf8(0x10)
	multicastinlinedelegate                                      ApplicationWillTerminateDelegate;                  // 0x108(0x10)
};


// Size 0x30 (Full Size[0x3f8] - InheritedSize[0x3c8]
class SkeletalMeshActor: public Actor
{
public:
	bool                                                         bShouldDoAnimNotifies;                             // 0x3d0(0x1)
	bool                                                         bWakeOnLevelStart;                                 // 0x3d0(0x1)
	class SkeletalMeshComponent*                                 SkeletalMeshComponent;                             // 0x3d8(0x8)
	class SkeletalMesh*                                          ReplicatedMesh;                                    // 0x3e0(0x8)
	class PhysicsAsset*                                          ReplicatedPhysAsset;                               // 0x3e8(0x8)
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class LODActor: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x3c8(0x8)
	TArray<class Actor*>                                         SubActors;                                         // 0x3d0(0x10)
	float                                                        LODDrawDistance;                                   // 0x3e0(0x4)
	int                                                          LodLevel;                                          // 0x3e4(0x4)
	TArray<class Object*>                                        SubObjects;                                        // 0x3e8(0x10)
};


// Size 0x20 (Full Size[0x158] - InheritedSize[0x138]
class ParticleModuleLight_Seeded: public ParticleModuleLight
{
public:
	struct ParticleRandomSeedInfo                                RandomSeedInfo;                                    // 0x138(0x20)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class ActorWithComponentWithDerivedTestInterface: public Actor
{
public:
	class ComponentWithDerivedTestInterface*                     ComponentWithDerivedTestInterface;                 // 0x3c8(0x8)
};


// Size 0xd0 (Full Size[0x498] - InheritedSize[0x3c8]
class NavigationTestingActor: public Actor
{
public:
	class CapsuleComponent*                                      CapsuleComponent;                                  // 0x3d8(0x8)
	class NavigationInvokerComponent*                            InvokerComponent;                                  // 0x3e0(0x8)
	bool                                                         bActAsNavigationInvoker;                           // 0x3e8(0x1)
	struct NavAgentProperties                                    NavAgentProps;                                     // 0x3ec(0x30)
	struct Vector                                                QueryingExtent;                                    // 0x41c(0xc)
	class NavigationData*                                        MyNavData;                                         // 0x428(0x8)
	struct Vector                                                ProjectedLocation;                                 // 0x430(0xc)
	bool                                                         bProjectedLocationValid;                           // 0x43c(0x1)
	bool                                                         bSearchStart;                                      // 0x43c(0x1)
	bool                                                         bUseHierarchicalPathfinding;                       // 0x43c(0x1)
	bool                                                         bGatherDetailedInfo;                               // 0x43c(0x1)
	bool                                                         bShowNodePool;                                     // 0x43c(0x1)
	bool                                                         bShowBestPath;                                     // 0x43c(0x1)
	bool                                                         bShowDiffWithPreviousStep;                         // 0x43c(0x1)
	bool                                                         bShouldBeVisibleInGame;                            // 0x43c(0x1)
	char                                                         CostDisplayMode;                                   // 0x440(0x1)
	struct Vector2D                                              TextCanvasOffset;                                  // 0x444(0x8)
	bool                                                         bPathExist;                                        // 0x44c(0x1)
	bool                                                         bPathIsPartial;                                    // 0x44c(0x1)
	bool                                                         bPathSearchOutOfNodes;                             // 0x44c(0x1)
	float                                                        PathfindingTime;                                   // 0x450(0x4)
	float                                                        PathCost;                                          // 0x454(0x4)
	int                                                          PathfindingSteps;                                  // 0x458(0x4)
	class NavigationTestingActor*                                OtherActor;                                        // 0x460(0x8)
	class UClass*                                                FilterClass;                                       // 0x468(0x8)
	int                                                          ShowStepIndex;                                     // 0x470(0x4)
