// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x28
struct DistributionLookupTable
{
public:
	byte                                                         Op;                                                // 0x0(0x1)
	byte                                                         EntryCount;                                        // 0x1(0x1)
	byte                                                         EntryStride;                                       // 0x2(0x1)
	byte                                                         SubEntryStride;                                    // 0x3(0x1)
	float                                                        TimeScale;                                         // 0x4(0x4)
	float                                                        TimeBias;                                          // 0x8(0x4)
	char                                                         pad0x4_2VGHL[0x4];                                 // 0xc(0x4)
	TArray<Float Values>                                         Values;                                            // 0x10(0x10)
	byte                                                         LockFlag;                                          // 0x20(0x1)
};


// Size 0x28
struct RawDistribution
{
public:
	Struct DistributionLookupTable                               Table;                                             // 0x0(0x28)
};


// Size 0x28
struct FloatDistribution
{
public:
	Struct DistributionLookupTable                               Table;                                             // 0x0(0x28)
};


// Size 0x28
struct VectorDistribution
{
public:
	Struct DistributionLookupTable                               Table;                                             // 0x0(0x28)
};


// Size 0x28
struct Vector4Distribution
{
public:
	Struct DistributionLookupTable                               Table;                                             // 0x0(0x28)
};


// Size 0x38
struct ExpressionInput
{
public:
	Class MaterialExpression*                                    Expression;                                        // 0x0(0x8)
	int                                                          OutputIndex;                                       // 0x8(0x4)
	char                                                         pad0x4_N6YII[0x4];                                 // 0xc(0x4)
	Struct FString                                               InputName;                                         // 0x10(0x10)
	int                                                          Mask;                                              // 0x20(0x4)
	int                                                          MaskR;                                             // 0x24(0x4)
	int                                                          MaskG;                                             // 0x28(0x4)
	int                                                          MaskB;                                             // 0x2c(0x4)
	int                                                          MaskA;                                             // 0x30(0x4)
	int                                                          GCC64_Padding;                                     // 0x34(0x4)
};


// Size 0x38
struct MaterialAttributesInput
{
public:
};


// Size 0x28
struct ExpressionOutput
{
public:
	Struct FString                                               OutputName;                                        // 0x0(0x10)
	int                                                          Mask;                                              // 0x10(0x4)
	int                                                          MaskR;                                             // 0x14(0x4)
	int                                                          MaskG;                                             // 0x18(0x4)
	int                                                          MaskB;                                             // 0x1c(0x4)
	int                                                          MaskA;                                             // 0x20(0x4)
};


// Size 0x38
struct MaterialInput
{
public:
	Class MaterialExpression*                                    Expression;                                        // 0x0(0x8)
	int                                                          OutputIndex;                                       // 0x8(0x4)
	char                                                         pad0x4_UW09U[0x4];                                 // 0xc(0x4)
	Struct FString                                               InputName;                                         // 0x10(0x10)
	int                                                          Mask;                                              // 0x20(0x4)
	int                                                          MaskR;                                             // 0x24(0x4)
	int                                                          MaskG;                                             // 0x28(0x4)
	int                                                          MaskB;                                             // 0x2c(0x4)
	int                                                          MaskA;                                             // 0x30(0x4)
	int                                                          GCC64_Padding;                                     // 0x34(0x4)
};


// Size 0x40
struct ColorMaterialInput
{
public:
	bool                                                         UseConstant;                                       // 0x38(0x1)
	char                                                         pad0x3_ZCV22[0x3];                                 // 0x39(0x3)
	Struct Color                                                 Constant;                                          // 0x3c(0x4)
};


// Size 0x40
struct ScalarMaterialInput
{
public:
	bool                                                         UseConstant;                                       // 0x38(0x1)
	char                                                         pad0x3_HHXI9[0x3];                                 // 0x39(0x3)
	float                                                        Constant;                                          // 0x3c(0x4)
};


// Size 0x48
struct VectorMaterialInput
{
public:
	bool                                                         UseConstant;                                       // 0x38(0x1)
	char                                                         pad0x3_28GSE[0x3];                                 // 0x39(0x3)
	Struct Vector                                                Constant;                                          // 0x3c(0xc)
};


// Size 0x48
struct Vector2MaterialInput
{
public:
	bool                                                         UseConstant;                                       // 0x38(0x1)
	char                                                         pad0x3_FFNEL[0x3];                                 // 0x39(0x3)
	float                                                        ConstantX;                                         // 0x3c(0x4)
	float                                                        ConstantY;                                         // 0x40(0x4)
};


// Size 0x80
struct HitResult
{
public:
	bool                                                         bBlockingHit;                                      // 0x0(0x1)
	bool                                                         bStartPenetrating;                                 // 0x0(0x1)
	char                                                         pad0x3_GQY5D[0x3];                                 // 0x1(0x3)
	float                                                        Time;                                              // 0x4(0x4)
	float                                                        Distance;                                          // 0x8(0x4)
	Struct Vector_NetQuantize                                    Location;                                          // 0xc(0xc)
	Struct Vector_NetQuantize                                    ImpactPoint;                                       // 0x18(0xc)
	Struct Vector_NetQuantizeNormal                              Normal;                                            // 0x24(0xc)
	Struct Vector_NetQuantizeNormal                              ImpactNormal;                                      // 0x30(0xc)
	Struct Vector_NetQuantize                                    TraceStart;                                        // 0x3c(0xc)
	Struct Vector_NetQuantize                                    TraceEnd;                                          // 0x48(0xc)
	float                                                        PenetrationDepth;                                  // 0x54(0x4)
	int                                                          Item;                                              // 0x58(0x4)
	struct FName                                                 BoneName;                                          // 0x74(0x8)
	int                                                          FaceIndex;                                         // 0x7c(0x4)
};


// Size 0xc
struct Vector_NetQuantize
{
public:
};


// Size 0xc
struct Vector_NetQuantizeNormal
{
public:
};


// Size 0x8
struct ActorPtr
{
public:
	Class Actor*                                                 Actor;                                             // 0x0(0x8)
};


// Size 0x48
struct RepAttachment
{
public:
	Class Actor*                                                 AttachParent;                                      // 0x0(0x8)
	Struct Vector_NetQuantize100                                 LocationOffset;                                    // 0x8(0xc)
	Struct Vector_NetQuantize100                                 RelativeScale3D;                                   // 0x14(0xc)
	Struct Rotator                                               RotationOffset;                                    // 0x20(0xc)
	struct FName                                                 AttachSocket;                                      // 0x2c(0x8)
	char                                                         pad0x4_VLJWI[0x4];                                 // 0x34(0x4)
	Class SceneComponent*                                        AttachComponent;                                   // 0x38(0x8)
};


// Size 0xc
struct Vector_NetQuantize100
{
public:
};


// Size 0x38
struct RepMovement
{
public:
	Struct Vector                                                LinearVelocity;                                    // 0x0(0xc)
	Struct Vector                                                AngularVelocity;                                   // 0xc(0xc)
	Struct Vector                                                Location;                                          // 0x18(0xc)
	Struct Rotator                                               Rotation;                                          // 0x24(0xc)
	bool                                                         bSimulatedPhysicSleep;                             // 0x30(0x1)
	bool                                                         bRepPhysics;                                       // 0x30(0x1)
	byte                                                         LocationQuantizationLevel;                         // 0x31(0x1)
	byte                                                         VelocityQuantizationLevel;                         // 0x32(0x1)
	byte                                                         RotationQuantizationLevel;                         // 0x33(0x1)
};


// Size 0x50
struct ActorTickFunction
{
public:
};


// Size 0x48
struct TickFunction
{
public:
	byte                                                         TickGroup;                                         // 0x30(0x1)
	char                                                         pad0x1_TJL3H[0x1];                                 // 0x31(0x1)
	bool                                                         bTickEvenWhenPaused;                               // 0x32(0x1)
	bool                                                         bCanEverTick;                                      // 0x32(0x1)
	bool                                                         bStartWithTickEnabled;                             // 0x32(0x1)
	bool                                                         bAllowTickOnDedicatedServer;                       // 0x32(0x1)
	char                                                         pad0xd_MM5DT[0xd];                                 // 0x33(0xd)
	float                                                        TickInterval;                                      // 0x40(0x4)
};


// Size 0x20
struct SimpleMemberReference
{
public:
	Class Object*                                                MemberParent;                                      // 0x0(0x8)
	struct FName                                                 MemberName;                                        // 0x8(0x8)
	Struct Guid                                                  MemberGuid;                                        // 0x10(0x10)
};


// Size 0x50
struct ActorComponentTickFunction
{
public:
};


// Size 0x40
struct SubtitleCue
{
public:
	Struct FText                                                 Text;                                              // 0x0(0x38)
	float                                                        Time;                                              // 0x38(0x4)
};


// Size 0x1c
struct InterpControlPoint
{
public:
	Struct Vector                                                PositionControlPoint;                              // 0x0(0xc)
	bool                                                         bPositionIsRelative;                               // 0xc(0x1)
};


// Size 0x38
struct PlatformInterfaceDelegateResult
{
public:
	bool                                                         bSuccessful;                                       // 0x0(0x1)
	char                                                         pad0x7_BCYJ8[0x7];                                 // 0x1(0x7)
	Struct PlatformInterfaceData                                 Data;                                              // 0x8(0x30)
};


// Size 0x30
struct PlatformInterfaceData
{
public:
	struct FName                                                 DataName;                                          // 0x0(0x8)
	byte                                                         Type;                                              // 0x8(0x1)
	char                                                         pad0x3_7PYE3[0x3];                                 // 0x9(0x3)
	int                                                          IntValue;                                          // 0xc(0x4)
	float                                                        FloatValue;                                        // 0x10(0x4)
	char                                                         pad0x4_W6PXF[0x4];                                 // 0x14(0x4)
	Struct FString                                               StringValue;                                       // 0x18(0x10)
	Class Object*                                                ObjectValue;                                       // 0x28(0x8)
};


// Size 0x20
struct DebugFloatHistory
{
public:
	TArray<Float Samples>                                        Samples;                                           // 0x0(0x10)
	float                                                        MaxSamples;                                        // 0x10(0x4)
	float                                                        MinValue;                                          // 0x14(0x4)
	float                                                        MaxValue;                                          // 0x18(0x4)
	bool                                                         bAutoAdjustMinMax;                                 // 0x1c(0x1)
};


// Size 0x18
struct LatentActionInfo
{
public:
	int                                                          Linkage;                                           // 0x0(0x4)
	int                                                          UUID;                                              // 0x4(0x4)
	struct FName                                                 ExecutionFunction;                                 // 0x8(0x8)
	Class Object*                                                CallbackTarget;                                    // 0x10(0x8)
};


// Size 0x4
struct TimerHandle
{
public:
};


// Size 0x8
struct CollisionProfileName
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
};


// Size 0x4
struct GenericStruct
{
public:
	int                                                          Data;                                              // 0x0(0x4)
};


// Size 0x8
struct FastArraySerializerItem
{
public:
	int                                                          ReplicationID;                                     // 0x0(0x4)
	int                                                          ReplicationKey;                                    // 0x4(0x4)
};


// Size 0xa8
struct FastArraySerializer
{
public:
};


// Size 0x84
struct OverlapInfo
{
public:
};


// Size 0x8
struct WalkableSlopeOverride
{
public:
	byte                                                         WalkableSlopeBehavior;                             // 0x0(0x1)
	char                                                         pad0x3_VXDWH[0x3];                                 // 0x1(0x3)
	float                                                        WalkableSlopeAngle;                                // 0x4(0x4)
};


// Size 0x50
struct PrimitiveComponentPostPhysicsTickFunction
{
public:
};


// Size 0x180
struct BodyInstance
{
public:
	Struct Vector                                                Scale3D;                                           // 0x4(0xc)
	char                                                         pad0x4_YQVIR[0x4];                                 // 0x10(0x4)
	struct FName                                                 CollisionProfileName;                              // 0x14(0x8)
	char                                                         pad0x4_GUQIM[0x4];                                 // 0x1c(0x4)
	Struct CollisionResponse                                     CollisionResponses;                                // 0x20(0x30)
	bool                                                         bUseCCD;                                           // 0x50(0x1)
	bool                                                         bNotifyRigidBodyCollision;                         // 0x50(0x1)
	bool                                                         bSimulatePhysics;                                  // 0x50(0x1)
	bool                                                         bOverrideMass;                                     // 0x50(0x1)
	bool                                                         bOverrideMassProperties;                           // 0x50(0x1)
	bool                                                         bEnableGravity;                                    // 0x50(0x1)
	bool                                                         bAutoWeld;                                         // 0x50(0x1)
	bool                                                         bStartAwake;                                       // 0x51(0x1)
	bool                                                         bGenerateWakeEvents;                               // 0x51(0x1)
	bool                                                         bUpdateMassWhenScaleChanges;                       // 0x51(0x1)
	bool                                                         bLockTranslation;                                  // 0x51(0x1)
	bool                                                         bLockRotation;                                     // 0x51(0x1)
	bool                                                         bLockXTranslation;                                 // 0x51(0x1)
	bool                                                         bLockYTranslation;                                 // 0x51(0x1)
	bool                                                         bLockZTranslation;                                 // 0x51(0x1)
	bool                                                         bLockXRotation;                                    // 0x52(0x1)
	bool                                                         bLockYRotation;                                    // 0x52(0x1)
	bool                                                         bLockZRotation;                                    // 0x52(0x1)
	bool                                                         bOverrideMaxAngularVelocity;                       // 0x52(0x1)
	bool                                                         bUseAsyncScene;                                    // 0x52(0x1)
	bool                                                         bOverrideMaxDepenetrationVelocity;                 // 0x52(0x1)
	bool                                                         bOverrideWalkableSlopeOnInstance;                  // 0x52(0x1)
	char                                                         pad0x1_SKM3D[0x1];                                 // 0x53(0x1)
	float                                                        MaxDepenetrationVelocity;                          // 0x54(0x4)
	float                                                        MassInKg;                                          // 0x58(0x4)
	Struct MassPropertiesOverride                                MassPropertiesOverride;                            // 0x5c(0x24)
	float                                                        LinearDamping;                                     // 0x80(0x4)
	float                                                        AngularDamping;                                    // 0x84(0x4)
	Struct Vector                                                COMNudge;                                          // 0x88(0xc)
	float                                                        MassScale;                                         // 0x94(0x4)
	char                                                         pad0x10_F2VHJ[0x10];                               // 0x98(0x10)
	Struct WalkableSlopeOverride                                 WalkableSlopeOverride;                             // 0xa8(0x8)
	Class PhysicalMaterial*                                      PhysMaterialOverride;                              // 0xb0(0x8)
	float                                                        MaxAngularVelocity;                                // 0xb8(0x4)
	float                                                        CustomSleepThresholdMultiplier;                    // 0xbc(0x4)
	float                                                        PhysicsBlendWeight;                                // 0xc0(0x4)
	int                                                          PositionSolverIterationCount;                      // 0xc4(0x4)
	byte                                                         DominanceGroup;                                    // 0xc8(0x1)
	char                                                         pad0x37_DNNZ6[0x37];                               // 0xc9(0x37)
	int                                                          VelocitySolverIterationCount;                      // 0x110(0x4)
	char                                                         pad0x68_CT0V0[0x68];                               // 0x114(0x68)
	byte                                                         SleepFamily;                                       // 0x17c(0x1)
	byte                                                         DOFMode;                                           // 0x17d(0x1)
	byte                                                         CollisionEnabled;                                  // 0x17e(0x1)
	byte                                                         ObjectType;                                        // 0x17f(0x1)
};


// Size 0x24
struct MassPropertiesOverride
{
public:
	Struct Vector                                                InertiaTensorOverride;                             // 0x0(0xc)
	Struct Vector                                                COMTranslationOverride;                            // 0xc(0xc)
	Struct Rotator                                               COMRotatorOverride;                                // 0x18(0xc)
};


// Size 0x30
struct CollisionResponse
{
public:
	Struct CollisionResponseContainer                            ResponseToChannels;                                // 0x0(0x20)
	TArray<struct ResponseArray>                                 ResponseArray;                                     // 0x20(0x10)
};


// Size 0xc
struct ResponseChannel
{
public:
	struct FName                                                 Channel;                                           // 0x0(0x8)
	byte                                                         Response;                                          // 0x8(0x1)
};


// Size 0x20
struct CollisionResponseContainer
{
public:
	byte                                                         WorldStatic;                                       // 0x0(0x1)
	byte                                                         WorldDynamic;                                      // 0x1(0x1)
	byte                                                         Pawn;                                              // 0x2(0x1)
	byte                                                         Visibility;                                        // 0x3(0x1)
	byte                                                         Camera;                                            // 0x4(0x1)
	byte                                                         PhysicsBody;                                       // 0x5(0x1)
	byte                                                         Vehicle;                                           // 0x6(0x1)
	byte                                                         Destructible;                                      // 0x7(0x1)
	byte                                                         EngineTraceChannel1;                               // 0x8(0x1)
	byte                                                         EngineTraceChannel2;                               // 0x9(0x1)
	byte                                                         EngineTraceChannel3;                               // 0xa(0x1)
	byte                                                         EngineTraceChannel4;                               // 0xb(0x1)
	byte                                                         EngineTraceChannel5;                               // 0xc(0x1)
	byte                                                         EngineTraceChannel6;                               // 0xd(0x1)
	byte                                                         GameTraceChannel1;                                 // 0xe(0x1)
	byte                                                         GameTraceChannel2;                                 // 0xf(0x1)
	byte                                                         GameTraceChannel3;                                 // 0x10(0x1)
	byte                                                         GameTraceChannel4;                                 // 0x11(0x1)
	byte                                                         GameTraceChannel5;                                 // 0x12(0x1)
	byte                                                         GameTraceChannel6;                                 // 0x13(0x1)
	byte                                                         GameTraceChannel7;                                 // 0x14(0x1)
	byte                                                         GameTraceChannel8;                                 // 0x15(0x1)
	byte                                                         GameTraceChannel9;                                 // 0x16(0x1)
	byte                                                         GameTraceChannel10;                                // 0x17(0x1)
	byte                                                         GameTraceChannel11;                                // 0x18(0x1)
	byte                                                         GameTraceChannel12;                                // 0x19(0x1)
	byte                                                         GameTraceChannel13;                                // 0x1a(0x1)
	byte                                                         GameTraceChannel14;                                // 0x1b(0x1)
	byte                                                         GameTraceChannel15;                                // 0x1c(0x1)
	byte                                                         GameTraceChannel16;                                // 0x1d(0x1)
	byte                                                         GameTraceChannel17;                                // 0x1e(0x1)
	byte                                                         GameTraceChannel18;                                // 0x1f(0x1)
};


// Size 0x10
struct CustomPrimitiveData
{
public:
	TArray<Float Data>                                           Data;                                              // 0x0(0x10)
};


// Size 0x80
struct RuntimeFloatCurve
{
public:
	Struct RichCurve                                             EditorCurveData;                                   // 0x0(0x78)
	Class CurveFloat*                                            ExternalCurve;                                     // 0x78(0x8)
};


// Size 0x78
struct RichCurve
{
public:
	byte                                                         PreInfinityExtrap;                                 // 0x58(0x1)
	byte                                                         PostInfinityExtrap;                                // 0x59(0x1)
	char                                                         pad0x6_DILR8[0x6];                                 // 0x5a(0x6)
	TArray<struct Keys>                                          Keys;                                              // 0x60(0x10)
	float                                                        DefaultValue;                                      // 0x70(0x4)
};


// Size 0x58
struct IndexedCurve
{
public:
	Struct KeyHandleMap                                          KeyHandlesToIndices;                               // 0x8(0x50)
};


// Size 0x50
struct KeyHandleMap
{
public:
};


// Size 0x1c
struct RichCurveKey
{
public:
	byte                                                         InterpMode;                                        // 0x0(0x1)
	byte                                                         TangentMode;                                       // 0x1(0x1)
	byte                                                         TangentWeightMode;                                 // 0x2(0x1)
	char                                                         pad0x1_QF3W4[0x1];                                 // 0x3(0x1)
	float                                                        Time;                                              // 0x4(0x4)
	float                                                        Value;                                             // 0x8(0x4)
	float                                                        ArriveTangent;                                     // 0xc(0x4)
	float                                                        ArriveTangentWeight;                               // 0x10(0x4)
	float                                                        LeaveTangent;                                      // 0x14(0x4)
	float                                                        LeaveTangentWeight;                                // 0x18(0x4)
};


// Size 0xc
struct FeatureFlag
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	bool                                                         InverseToggle;                                     // 0x8(0x1)
};


// Size 0x14
struct NetActorPtr
{
public:
	Struct NetObjectPtr                                          ObjectPtr;                                         // 0x0(0x14)
};


// Size 0x14
struct NetObjectPtr
{
public:
};


// Size 0x20
struct PacketDiscardStats
{
public:
	int                                                          DiscardCounts;                                     // 0x0(0x4)
	char                                                         pad0x18_1CVYG[0x18];                               // 0x4(0x18)
	int                                                          BytesDiscarded;                                    // 0x1c(0x4)
};


// Size 0x18
struct UniqueNetIdRepl
{
public:
};


// Size 0xc0
struct RainPostProcessSettings
{
public:
	bool                                                         bOverride_RainParticleTexture;                     // 0x0(0x1)
	bool                                                         bOverride_RainMeshTexture;                         // 0x0(0x1)
	bool                                                         bOverride_RainIntensity;                           // 0x0(0x1)
	bool                                                         bOverride_RainParticleAlpha;                       // 0x0(0x1)
	bool                                                         bOverride_RainCloseParticleAlphaReductionMultiplier; // 0x0(0x1)
	bool                                                         bOverride_RainCloseParticleAlphaDistance;          // 0x0(0x1)
	bool                                                         bOverride_RainParticleDensity;                     // 0x0(0x1)
	bool                                                         bOverride_RainParticleSpeed;                       // 0x0(0x1)
	bool                                                         bOverride_RainParticleWindVelocity;                // 0x1(0x1)
	bool                                                         bOverride_RainParticleWidth;                       // 0x1(0x1)
	bool                                                         bOverride_RainParticleLength;                      // 0x1(0x1)
	bool                                                         bOverride_RainMeshScale;                           // 0x1(0x1)
	bool                                                         bOverride_RainMeshTextureScroll;                   // 0x1(0x1)
	bool                                                         bOverride_RainMeshTextureTiling;                   // 0x1(0x1)
	bool                                                         bOverride_RainMeshAlpha;                           // 0x1(0x1)
	bool                                                         bOverride_RainMeshRowDivision;                     // 0x1(0x1)
	bool                                                         bOverride_RainMeshColumnDivision;                  // 0x2(0x1)
	bool                                                         bOverride_RainMeshBrightness;                      // 0x2(0x1)
	bool                                                         bOverride_RainBrightness;                          // 0x2(0x1)
	bool                                                         bOverride_RainTint;                                // 0x2(0x1)
	bool                                                         bOverride_RainMeshEndRadiusScale;                  // 0x2(0x1)
	bool                                                         bOverride_RainMeshEndAlphaFade;                    // 0x2(0x1)
	bool                                                         bOverride_RainMeshFadeDistance;                    // 0x2(0x1)
	bool                                                         bOverride_RainAnimationFrameTime;                  // 0x2(0x1)
	bool                                                         bOverride_RainSplashesPerSecond;                   // 0x3(0x1)
	bool                                                         bOverride_RainSplashesPerSquareMetre;              // 0x3(0x1)
	bool                                                         bOverride_RainSplashesMaxPlacementAngle;           // 0x3(0x1)
	bool                                                         bOverride_RainSplashData;                          // 0x3(0x1)
	bool                                                         bOverride_RainSplashesMaxDistance1;                // 0x3(0x1)
	bool                                                         bOverride_RainSplashData2;                         // 0x3(0x1)
	bool                                                         bOverride_RainSplashesMaxDistance2;                // 0x3(0x1)
	char                                                         pad0x4_F8FEV[0x4];                                 // 0x4(0x4)
	Class Texture*                                               RainParticleTexture;                               // 0x8(0x8)
	Class Texture*                                               RainMeshTexture;                                   // 0x10(0x8)
	float                                                        RainIntensity;                                     // 0x18(0x4)
	float                                                        RainParticleAlpha;                                 // 0x1c(0x4)
	float                                                        RainCloseParticleAlphaReductionMultiplier;         // 0x20(0x4)
	float                                                        RainCloseParticleAlphaDistance;                    // 0x24(0x4)
	float                                                        RainParticleDensity;                               // 0x28(0x4)
	float                                                        RainParticleSpeed;                                 // 0x2c(0x4)
	Struct Vector                                                RainParticleWindVelocity;                          // 0x30(0xc)
	float                                                        RainParticleWidth;                                 // 0x3c(0x4)
	float                                                        RainParticleLength;                                // 0x40(0x4)
	Struct Vector                                                RainMeshScale;                                     // 0x44(0xc)
	Struct Vector2D                                              RainMeshTextureScroll;                             // 0x50(0x8)
	Struct Vector2D                                              RainMeshTextureTiling;                             // 0x58(0x8)
	float                                                        RainMeshAlpha;                                     // 0x60(0x4)
	int                                                          RainMeshRowDivision;                               // 0x64(0x4)
	int                                                          RainMeshColumnDivision;                            // 0x68(0x4)
	float                                                        RainMeshEndRadiusScale;                            // 0x6c(0x4)
	float                                                        RainMeshEndAlphaFade;                              // 0x70(0x4)
	float                                                        RainMeshFadeDistance;                              // 0x74(0x4)
	float                                                        RainMeshBrightness;                                // 0x78(0x4)
	float                                                        RainBrightness;                                    // 0x7c(0x4)
	Struct LinearColor                                           RainTint;                                          // 0x80(0x10)
	float                                                        RainAnimationFrameTime;                            // 0x90(0x4)
	int                                                          RainSplashesPerSecond;                             // 0x94(0x4)
	float                                                        RainSplashesPerSquareMetre;                        // 0x98(0x4)
	float                                                        RainSplashesMaxPlacementAngle;                     // 0x9c(0x4)
	Class ParticleComputeShaderData*                             RainSplashData;                                    // 0xa0(0x8)
	float                                                        RainSplashesMaxDistance1;                          // 0xa8(0x4)
	char                                                         pad0x4_PUAMN[0x4];                                 // 0xac(0x4)
	Class ParticleComputeShaderData*                             RainSplashData2;                                   // 0xb0(0x8)
	float                                                        RainSplashesMaxDistance2;                          // 0xb8(0x4)
};


// Size 0x170
struct RuntimeVectorCurve
{
public:
	Struct RichCurve                                             FloatCurves;                                       // 0x0(0x78)
	char                                                         pad0xf0_PRDP5[0xf0];                               // 0x78(0xf0)
	Class CurveVector*                                           ExternalCurve;                                     // 0x168(0x8)
};


// Size 0x1
struct TableRowBase
{
public:
};


// Size 0x14
struct NetSubObjectPtr
{
public:
	Struct NetObjectPtr                                          SubObject;                                         // 0x0(0x14)
};


// Size 0x30
struct AnimNode_Base
{
public:
	Struct ExposedValueHandler                                   EvaluateGraphExposedInputs;                        // 0x8(0x28)
};


// Size 0x28
struct ExposedValueHandler
{
public:
	struct FName                                                 BoundFunction;                                     // 0x0(0x8)
	TArray<struct CopyRecords>                                   CopyRecords;                                       // 0x8(0x10)
};


// Size 0x70
struct ExposedValueCopyRecord
{
public:
	Class Property*                                              SourceProperty;                                    // 0x0(0x8)
	struct FName                                                 SourcePropertyName;                                // 0x8(0x8)
	TArray<struct FName>                                         SourceSubPropertyNames;                            // 0x10(0x10)
	int                                                          SourceArrayIndex;                                  // 0x20(0x4)
	char                                                         pad0x4_OJQGP[0x4];                                 // 0x24(0x4)
	Class Property*                                              DestProperty;                                      // 0x28(0x8)
	int                                                          DestArrayIndex;                                    // 0x30(0x4)
	int                                                          Size;                                              // 0x34(0x4)
	byte                                                         PostCopyOperation;                                 // 0x38(0x1)
	char                                                         pad0x7_K5QQE[0x7];                                 // 0x39(0x7)
	Class BoolProperty*                                          CachedBoolSourceProperty;                          // 0x40(0x8)
	Class BoolProperty*                                          CachedBoolDestProperty;                            // 0x48(0x8)
};


// Size 0x8
struct InputScaleBias
{
public:
	float                                                        Scale;                                             // 0x0(0x4)
	float                                                        Bias;                                              // 0x4(0x4)
};


// Size 0x18
struct ComponentSpacePoseLink
{
public:
};


// Size 0x18
struct PoseLinkBase
{
public:
	int                                                          LinkID;                                            // 0x0(0x4)
};


// Size 0xc
struct BoneReference
{
public:
	struct FName                                                 BoneName;                                          // 0x0(0x8)
};


// Size 0x70
struct IntegralCurve
{
public:
	TArray<struct Keys>                                          Keys;                                              // 0x58(0x10)
	int                                                          DefaultValue;                                      // 0x68(0x4)
	bool                                                         bUseDefaultValueBeforeFirstKey;                    // 0x6c(0x1)
};


// Size 0x8
struct IntegralKey
{
public:
	float                                                        Time;                                              // 0x0(0x4)
	int                                                          Value;                                             // 0x4(0x4)
};


// Size 0x78
struct StringCurve
{
public:
	Struct FString                                               DefaultValue;                                      // 0x58(0x10)
	TArray<struct Keys>                                          Keys;                                              // 0x68(0x10)
};


// Size 0x18
struct StringCurveKey
{
public:
	float                                                        Time;                                              // 0x0(0x4)
	char                                                         pad0x4_HHE4E[0x4];                                 // 0x4(0x4)
	Struct FString                                               Value;                                             // 0x8(0x10)
};


// Size 0x10
struct DirectoryPath
{
public:
	Struct FString                                               path;                                              // 0x0(0x10)
};


// Size 0x50
struct EdGraphPinType
{
public:
	Struct FString                                               PinCategory;                                       // 0x0(0x10)
	Struct FString                                               PinSubCategory;                                    // 0x10(0x10)
	Struct SimpleMemberReference                                 PinSubCategoryMemberReference;                     // 0x28(0x20)
	bool                                                         bIsArray;                                          // 0x48(0x1)
	bool                                                         bIsReference;                                      // 0x49(0x1)
	bool                                                         bIsConst;                                          // 0x4a(0x1)
	bool                                                         bIsWeakPointer;                                    // 0x4b(0x1)
};


// Size 0x8
struct ExposureSettings
{
public:
	int                                                          LogOffset;                                         // 0x0(0x4)
	bool                                                         bFixed;                                            // 0x4(0x1)
};


// Size 0x70
struct URL
{
public:
	Struct FString                                               Protocol;                                          // 0x0(0x10)
	Struct FString                                               Host;                                              // 0x10(0x10)
	int                                                          Port;                                              // 0x20(0x4)
	char                                                         pad0x4_H907Z[0x4];                                 // 0x24(0x4)
	Struct FString                                               Map;                                               // 0x28(0x10)
	Struct FString                                               RedirectURL;                                       // 0x38(0x10)
	TArray<Str Op>                                               Op;                                                // 0x48(0x10)
	Struct FString                                               Portal;                                            // 0x58(0x10)
	int                                                          Valid;                                             // 0x68(0x4)
};


// Size 0x10
struct TickPrerequisite
{
public:
};


// Size 0x4
struct Float_NetQuantized
{
public:
};


// Size 0xc
struct Vector_NetQuantize10
{
public:
};


// Size 0x50
struct SimplygonRemeshingSettings
{
public:
	bool                                                         bActive;                                           // 0x0(0x1)
	char                                                         pad0x3_ASUSA[0x3];                                 // 0x1(0x3)
	int                                                          ScreenSize;                                        // 0x4(0x4)
	bool                                                         bRecalculateNormals;                               // 0x8(0x1)
	char                                                         pad0x3_S0OA3[0x3];                                 // 0x9(0x3)
	float                                                        HardAngleThreshold;                                // 0xc(0x4)
	int                                                          MergeDistance;                                     // 0x10(0x4)
	bool                                                         bUseClippingPlane;                                 // 0x14(0x1)
	char                                                         pad0x3_5NNBN[0x3];                                 // 0x15(0x3)
	float                                                        ClippingLevel;                                     // 0x18(0x4)
	int                                                          AxisIndex;                                         // 0x1c(0x4)
	bool                                                         bPlaneNegativeHalfspace;                           // 0x20(0x1)
	bool                                                         bUseMassiveLOD;                                    // 0x21(0x1)
	bool                                                         bUseAggregateLOD;                                  // 0x22(0x1)
	char                                                         pad0x5_83PW5[0x5];                                 // 0x23(0x5)
	Struct SimplygonMaterialLODSettings                          MaterialLODSettings;                               // 0x28(0x28)
};


// Size 0x28
struct SimplygonMaterialLODSettings
{
public:
	bool                                                         bActive;                                           // 0x0(0x1)
	byte                                                         MaterialLODType;                                   // 0x1(0x1)
	bool                                                         bUseAutomaticSizes;                                // 0x2(0x1)
	byte                                                         TextureWidth;                                      // 0x3(0x1)
	byte                                                         TextureHeight;                                     // 0x4(0x1)
	byte                                                         SamplingQuality;                                   // 0x5(0x1)
	char                                                         pad0x2_ALM3Z[0x2];                                 // 0x6(0x2)
	int                                                          GutterSpace;                                       // 0x8(0x4)
	byte                                                         TextureStrech;                                     // 0xc(0x1)
	bool                                                         bReuseExistingCharts;                              // 0xd(0x1)
	char                                                         pad0x2_5XEYA[0x2];                                 // 0xe(0x2)
	TArray<struct ChannelsToCast>                                ChannelsToCast;                                    // 0x10(0x10)
	bool                                                         bBakeVertexData;                                   // 0x20(0x1)
	bool                                                         bBakeActorData;                                    // 0x21(0x1)
	bool                                                         bAllowMultiMaterial;                               // 0x22(0x1)
	bool                                                         bPreferTwoSideMaterials;                           // 0x23(0x1)
};


// Size 0x10
struct SimplygonChannelCastingSettings
{
public:
	byte                                                         MaterialChannel;                                   // 0x0(0x1)
	byte                                                         Caster;                                            // 0x1(0x1)
	bool                                                         bActive;                                           // 0x2(0x1)
	byte                                                         ColorChannels;                                     // 0x3(0x1)
	int                                                          BitsPerChannel;                                    // 0x4(0x4)
	bool                                                         bUseSRGB;                                          // 0x8(0x1)
	bool                                                         bBakeVertexColors;                                 // 0x9(0x1)
	bool                                                         bFlipBackfacingNormals;                            // 0xa(0x1)
	bool                                                         bUseTangentSpaceNormals;                           // 0xb(0x1)
	bool                                                         bFlipGreenChannel;                                 // 0xc(0x1)
};


// Size 0x60
struct CanvasUVTri
{
public:
	Struct Vector2D                                              V0_Pos;                                            // 0x0(0x8)
	Struct Vector2D                                              V0_UV;                                             // 0x8(0x8)
	Struct LinearColor                                           V0_Color;                                          // 0x10(0x10)
	Struct Vector2D                                              V1_Pos;                                            // 0x20(0x8)
	Struct Vector2D                                              V1_UV;                                             // 0x28(0x8)
	Struct LinearColor                                           V1_Color;                                          // 0x30(0x10)
	Struct Vector2D                                              V2_Pos;                                            // 0x40(0x8)
	Struct Vector2D                                              V2_UV;                                             // 0x48(0x8)
	Struct LinearColor                                           V2_Color;                                          // 0x50(0x10)
};


// Size 0x28
struct FontRenderInfo
{
public:
	bool                                                         bClipText;                                         // 0x0(0x1)
	bool                                                         bEnableShadow;                                     // 0x0(0x1)
	char                                                         pad0x3_BEQVP[0x3];                                 // 0x1(0x3)
	Struct DepthFieldGlowInfo                                    GlowInfo;                                          // 0x4(0x24)
};


// Size 0x24
struct DepthFieldGlowInfo
{
public:
	bool                                                         bEnableGlow;                                       // 0x0(0x1)
	char                                                         pad0x3_7WNRL[0x3];                                 // 0x1(0x3)
	Struct LinearColor                                           GlowColor;                                         // 0x4(0x10)
	Struct Vector2D                                              GlowOuterRadius;                                   // 0x14(0x8)
	Struct Vector2D                                              GlowInnerRadius;                                   // 0x1c(0x8)
};


// Size 0x10
struct Redirector
{
public:
	struct FName                                                 OldName;                                           // 0x0(0x8)
	struct FName                                                 NewName;                                           // 0x8(0x8)
};


// Size 0x10
struct FilePath
{
public:
	Struct FString                                               FilePath;                                          // 0x0(0x10)
};


// Size 0x18
struct ComponentReference
{
public:
	Class Actor*                                                 OtherActor;                                        // 0x0(0x8)
	struct FName                                                 ComponentProperty;                                 // 0x8(0x8)
};


// Size 0x8
struct ConstrainComponentPropName
{
public:
	struct FName                                                 ComponentName;                                     // 0x0(0x8)
};


// Size 0x40
struct RadialDamageEvent
{
public:
	Struct RadialDamageParams                                    Params;                                            // 0x10(0x14)
	Struct Vector                                                Origin;                                            // 0x24(0xc)
	TArray<struct ComponentHits>                                 ComponentHits;                                     // 0x30(0x10)
};


// Size 0x10
struct DamageEvent
{
public:
	class                                                        DamageTypeClass;                                   // 0x8(0x8)
};


// Size 0x14
struct RadialDamageParams
{
public:
	float                                                        BaseDamage;                                        // 0x0(0x4)
	float                                                        MinimumDamage;                                     // 0x4(0x4)
	float                                                        InnerRadius;                                       // 0x8(0x4)
	float                                                        OuterRadius;                                       // 0xc(0x4)
	float                                                        DamageFalloff;                                     // 0x10(0x4)
};


// Size 0xa0
struct PointDamageEvent
{
public:
	float                                                        Damage;                                            // 0x10(0x4)
	Struct Vector_NetQuantizeNormal                              ShotDirection;                                     // 0x14(0xc)
	Struct HitResult                                             HitInfo;                                           // 0x20(0x80)
};


// Size 0x1
struct CollisionMergingSettings
{
public:
};


// Size 0x50
struct MeshMergingSettings
{
public:
	bool                                                         bGenerateLightMapUV;                               // 0x0(0x1)
	char                                                         pad0x3_AT5S5[0x3];                                 // 0x1(0x3)
	int                                                          TargetLightMapUVChannel;                           // 0x4(0x4)
	int                                                          TargetLightMapResolution;                          // 0x8(0x4)
	bool                                                         bImportVertexColors;                               // 0xc(0x1)
	bool                                                         bPivotPointAtZero;                                 // 0xd(0x1)
	bool                                                         bMergePhysicsData;                                 // 0xe(0x1)
	bool                                                         bMergeMaterials;                                   // 0xf(0x1)
	bool                                                         bExportNormalMap;                                  // 0x10(0x1)
	bool                                                         bExportMetallicMap;                                // 0x11(0x1)
	bool                                                         bExportRoughnessMap;                               // 0x12(0x1)
	bool                                                         bExportSpecularMap;                                // 0x13(0x1)
	int                                                          MergedMaterialAtlasResolution;                     // 0x14(0x4)
	bool                                                         bEnableCollisionMerging;                           // 0x18(0x1)
	bool                                                         bUseRelativeTransform;                             // 0x19(0x1)
	bool                                                         bMergeRelativeToFirstComponent;                    // 0x1a(0x1)
	bool                                                         bDuplicateLODs;                                    // 0x1b(0x1)
	char                                                         pad0x4_MRO7R[0x4];                                 // 0x1c(0x4)
	TArray<Float LODScreenSizes>                                 LODScreenSizes;                                    // 0x20(0x10)
	int                                                          LODForCollision;                                   // 0x30(0x4)
	char                                                         pad0x4_2355T[0x4];                                 // 0x34(0x4)
	TArray<Float LODReductionPercentTriangles>                   LODReductionPercentTriangles;                      // 0x38(0x10)
	int                                                          MaxNumberOfLODs;                                   // 0x48(0x4)
};


// Size 0x70
struct MeshProxySettings
{
public:
	int                                                          ScreenSize;                                        // 0x0(0x4)
	Struct MaterialSimplificationSettings                        Material;                                          // 0x4(0x44)
	int                                                          TextureWidth;                                      // 0x48(0x4)
	int                                                          TextureHeight;                                     // 0x4c(0x4)
	bool                                                         bExportNormalMap;                                  // 0x50(0x1)
	bool                                                         bExportMetallicMap;                                // 0x51(0x1)
	bool                                                         bExportRoughnessMap;                               // 0x52(0x1)
	bool                                                         bExportSpecularMap;                                // 0x53(0x1)
	bool                                                         bRecalculateNormals;                               // 0x54(0x1)
	char                                                         pad0x3_1QOCL[0x3];                                 // 0x55(0x3)
	float                                                        HardAngleThreshold;                                // 0x58(0x4)
	int                                                          MergeDistance;                                     // 0x5c(0x4)
	bool                                                         bUseClippingPlane;                                 // 0x60(0x1)
	char                                                         pad0x3_B8CJI[0x3];                                 // 0x61(0x3)
	float                                                        ClippingLevel;                                     // 0x64(0x4)
	int                                                          AxisIndex;                                         // 0x68(0x4)
	bool                                                         bPlaneNegativeHalfspace;                           // 0x6c(0x1)
};


// Size 0x44
struct MaterialSimplificationSettings
{
public:
	Struct IntPoint                                              BaseColorMapSize;                                  // 0x0(0x8)
	bool                                                         bNormalMap;                                        // 0x8(0x1)
	char                                                         pad0x3_Y1HGW[0x3];                                 // 0x9(0x3)
	Struct IntPoint                                              NormalMapSize;                                     // 0xc(0x8)
	float                                                        MetallicConstant;                                  // 0x14(0x4)
	bool                                                         bMetallicMap;                                      // 0x18(0x1)
	char                                                         pad0x3_28TUL[0x3];                                 // 0x19(0x3)
	Struct IntPoint                                              MetallicMapSize;                                   // 0x1c(0x8)
	float                                                        RoughnessConstant;                                 // 0x24(0x4)
	bool                                                         bRoughnessMap;                                     // 0x28(0x1)
	char                                                         pad0x3_VZCDB[0x3];                                 // 0x29(0x3)
	Struct IntPoint                                              RoughnessMapSize;                                  // 0x2c(0x8)
	float                                                        SpecularConstant;                                  // 0x34(0x4)
	bool                                                         bSpecularMap;                                      // 0x38(0x1)
	char                                                         pad0x3_0B10L[0x3];                                 // 0x39(0x3)
	Struct IntPoint                                              SpecularMapSize;                                   // 0x3c(0x8)
};


// Size 0x40
struct MeshBuildSettings
{
public:
	bool                                                         bUseMikkTSpace;                                    // 0x0(0x1)
	bool                                                         bRecomputeNormals;                                 // 0x1(0x1)
	bool                                                         bRecomputeTangents;                                // 0x2(0x1)
	bool                                                         bRemoveDegenerates;                                // 0x3(0x1)
	bool                                                         bBuildAdjacencyBuffer;                             // 0x4(0x1)
	bool                                                         bUseFullPrecisionUVs;                              // 0x5(0x1)
	bool                                                         bGenerateLightmapUVs;                              // 0x6(0x1)
	char                                                         pad0x1_J9ID6[0x1];                                 // 0x7(0x1)
	Struct PresortedBillboardsParams                             PresortedBillboardsParams;                         // 0x8(0x8)
	int                                                          MinLightmapResolution;                             // 0x10(0x4)
	int                                                          SrcLightmapIndex;                                  // 0x14(0x4)
	int                                                          DstLightmapIndex;                                  // 0x18(0x4)
	float                                                        BuildScale;                                        // 0x1c(0x4)
	Struct Vector                                                BuildScale3D;                                      // 0x20(0xc)
	float                                                        DistanceFieldResolutionScale;                      // 0x2c(0x4)
	bool                                                         bGenerateDistanceFieldAsIfTwoSided;                // 0x30(0x1)
	char                                                         pad0x7_OCYRL[0x7];                                 // 0x31(0x7)
	Class StaticMesh*                                            DistanceFieldReplacementMesh;                      // 0x38(0x8)
};


// Size 0x8
struct PresortedBillboardsParams
{
public:
	byte                                                         Mode;                                              // 0x0(0x1)
	char                                                         pad0x3_78Z19[0x3];                                 // 0x1(0x3)
	int                                                          NumDirections;                                     // 0x4(0x4)
};


// Size 0x58
struct MeshReductionSettings
{
public:
	float                                                        PercentTriangles;                                  // 0x0(0x4)
	float                                                        MaxDeviation;                                      // 0x4(0x4)
	float                                                        WeldingThreshold;                                  // 0x8(0x4)
	float                                                        HardAngleThreshold;                                // 0xc(0x4)
	byte                                                         SilhouetteImportance;                              // 0x10(0x1)
	byte                                                         TextureImportance;                                 // 0x11(0x1)
	byte                                                         ShadingImportance;                                 // 0x12(0x1)
	bool                                                         bActive;                                           // 0x13(0x1)
	bool                                                         bRecalculateNormals;                               // 0x14(0x1)
	char                                                         pad0x3_D79V7[0x3];                                 // 0x15(0x3)
	int                                                          BaseLODModel;                                      // 0x18(0x4)
	bool                                                         bGenerateUniqueLightmapUVs;                        // 0x1c(0x1)
	bool                                                         bKeepSymmetry;                                     // 0x1d(0x1)
	bool                                                         bVisibilityAided;                                  // 0x1e(0x1)
	bool                                                         bCullOccluded;                                     // 0x1f(0x1)
	byte                                                         VisibilityAggressiveness;                          // 0x20(0x1)
	char                                                         pad0x7_DH6RS[0x7];                                 // 0x21(0x7)
	Struct SimplygonMaterialLODSettings                          MaterialLODSettings;                               // 0x28(0x28)
	byte                                                         VertexColorImportance;                             // 0x50(0x1)
	bool                                                         bForceRebuild;                                     // 0x51(0x1)
};


// Size 0x1c
struct POV
{
public:
	Struct Vector                                                Location;                                          // 0x0(0xc)
	Struct Rotator                                               Rotation;                                          // 0xc(0xc)
	float                                                        FOV;                                               // 0x18(0x4)
};


// Size 0x38
struct AnimUpdateRateParameters
{
public:
	int                                                          UpdateRate;                                        // 0x4(0x4)
	int                                                          EvaluationRate;                                    // 0x8(0x4)
	bool                                                         bInterpolateSkippedFrames;                         // 0xc(0x1)
	bool                                                         bSkipUpdate;                                       // 0xd(0x1)
	bool                                                         bSkipEvaluation;                                   // 0xe(0x1)
	char                                                         pad0x1_H3C7C[0x1];                                 // 0xf(0x1)
	float                                                        TickedPoseOffestTime;                              // 0x10(0x4)
	float                                                        AdditionalTime;                                    // 0x14(0x4)
	char                                                         pad0x4_QJTE1[0x4];                                 // 0x18(0x4)
	int                                                          BaseNonRenderedUpdateRate;                         // 0x1c(0x4)
	char                                                         pad0x8_WY5MC[0x8];                                 // 0x20(0x8)
	TArray<Float BaseVisibleDistanceFactorThesholds>             BaseVisibleDistanceFactorThesholds;                // 0x28(0x10)
};


// Size 0xc
struct AnimSlotDesc
{
public:
	struct FName                                                 SlotName;                                          // 0x0(0x8)
	int                                                          NumChannels;                                       // 0x8(0x4)
};


// Size 0x18
struct AnimSlotInfo
{
public:
	struct FName                                                 SlotName;                                          // 0x0(0x8)
	TArray<Float ChannelWeights>                                 ChannelWeights;                                    // 0x8(0x10)
};


// Size 0x10
struct MTDResult
{
public:
	Struct Vector                                                Direction;                                         // 0x0(0xc)
	float                                                        Distance;                                          // 0xc(0x4)
};


// Size 0x18
struct OverlapResult
{
public:
	bool                                                         bBlockingHit;                                      // 0x14(0x1)
};


// Size 0x18
struct PrimitiveMaterialRef
{
public:
	Class PrimitiveComponent*                                    Primitive;                                         // 0x0(0x8)
	Class DecalComponent*                                        Decal;                                             // 0x8(0x8)
	int                                                          ElementIndex;                                      // 0x10(0x4)
};


// Size 0x4
struct SwarmDebugOptions
{
public:
	bool                                                         bDistributionEnabled;                              // 0x0(0x1)
	bool                                                         bForceContentExport;                               // 0x0(0x1)
	bool                                                         bInitialized;                                      // 0x0(0x1)
};


// Size 0x10
struct LightmassDebugOptions
{
public:
	bool                                                         bDebugMode;                                        // 0x0(0x1)
	bool                                                         bStatsEnabled;                                     // 0x0(0x1)
	bool                                                         bGatherBSPSurfacesAcrossComponents;                // 0x0(0x1)
	char                                                         pad0x3_XBZOQ[0x3];                                 // 0x1(0x3)
	float                                                        CoplanarTolerance;                                 // 0x4(0x4)
	bool                                                         bUseImmediateImport;                               // 0x8(0x1)
	bool                                                         bImmediateProcessMappings;                         // 0x8(0x1)
	bool                                                         bSortMappings;                                     // 0x8(0x1)
	bool                                                         bDumpBinaryFiles;                                  // 0x8(0x1)
	bool                                                         bDebugMaterials;                                   // 0x8(0x1)
	bool                                                         bPadMappings;                                      // 0x8(0x1)
	bool                                                         bDebugPaddings;                                    // 0x8(0x1)
	bool                                                         bOnlyCalcDebugTexelMappings;                       // 0x8(0x1)
	bool                                                         bUseRandomColors;                                  // 0x9(0x1)
	bool                                                         bColorBordersGreen;                                // 0x9(0x1)
	bool                                                         bColorByExecutionTime;                             // 0x9(0x1)
	char                                                         pad0x2_P4JKH[0x2];                                 // 0xa(0x2)
	float                                                        ExecutionTimeDivisor;                              // 0xc(0x4)
};


// Size 0x18
struct LightmassPrimitiveSettings
{
public:
	bool                                                         bUseTwoSidedLighting;                              // 0x0(0x1)
	bool                                                         bShadowIndirectOnly;                               // 0x0(0x1)
	bool                                                         bUseEmissiveForStaticLighting;                     // 0x0(0x1)
	bool                                                         bUseVertexNormalForHemisphereGather;               // 0x0(0x1)
	char                                                         pad0x3_OO4XO[0x3];                                 // 0x1(0x3)
	float                                                        EmissiveLightFalloffExponent;                      // 0x4(0x4)
	float                                                        EmissiveLightExplicitInfluenceRadius;              // 0x8(0x4)
	float                                                        EmissiveBoost;                                     // 0xc(0x4)
	float                                                        DiffuseBoost;                                      // 0x10(0x4)
	float                                                        FullyOccludedSamplesFraction;                      // 0x14(0x4)
};


// Size 0x10
struct LightmassDirectionalLightSettings
{
public:
	float                                                        LightSourceAngle;                                  // 0xc(0x4)
};


// Size 0xc
struct LightmassLightSettings
{
public:
	float                                                        IndirectLightingSaturation;                        // 0x0(0x4)
	float                                                        ShadowExponent;                                    // 0x4(0x4)
	bool                                                         bUseAreaShadowsForStationaryLight;                 // 0x8(0x1)
};


// Size 0xc
struct LightmassPointLightSettings
{
public:
};


// Size 0x28
struct LocalizedSubtitle
{
public:
	Struct FString                                               LanguageExt;                                       // 0x0(0x10)
	TArray<struct Subtitles>                                     Subtitles;                                         // 0x10(0x10)
	bool                                                         bMature;                                           // 0x20(0x1)
	bool                                                         bManualWordWrap;                                   // 0x20(0x1)
	bool                                                         bSingleLine;                                       // 0x20(0x1)
};


// Size 0x38
struct BasedPosition
{
public:
	Class Actor*                                                 Base;                                              // 0x0(0x8)
	Struct Vector                                                Position;                                          // 0x8(0xc)
	Struct Vector                                                CachedBaseLocation;                                // 0x14(0xc)
	Struct Rotator                                               CachedBaseRotation;                                // 0x20(0xc)
	Struct Vector                                                CachedTransPosition;                               // 0x2c(0xc)
};


// Size 0x10
struct FractureEffect
{
public:
	Class ParticleSystem*                                        ParticleSystem;                                    // 0x0(0x8)
	Class SoundBase*                                             Sound;                                             // 0x8(0x8)
};


// Size 0x28
struct CollisionImpactData
{
public:
	TArray<struct ContactInfos>                                  ContactInfos;                                      // 0x0(0x10)
	Struct Vector                                                TotalNormalImpulse;                                // 0x10(0xc)
	Struct Vector                                                TotalFrictionImpulse;                              // 0x1c(0xc)
};


// Size 0x30
struct RigidBodyContactInfo
{
public:
	Struct Vector                                                ContactPosition;                                   // 0x0(0xc)
	Struct Vector                                                ContactNormal;                                     // 0xc(0xc)
	float                                                        ContactPenetration;                                // 0x18(0x4)
	char                                                         pad0x4_NORZX[0x4];                                 // 0x1c(0x4)
	Class PhysicalMaterial*                                      PhysMaterial;                                      // 0x20(0x8)
};


// Size 0x1c
struct RigidBodyErrorCorrection
{
public:
	float                                                        LinearDeltaThresholdSq;                            // 0x0(0x4)
	float                                                        LinearInterpAlpha;                                 // 0x4(0x4)
	float                                                        LinearRecipFixTime;                                // 0x8(0x4)
	float                                                        AngularDeltaThreshold;                             // 0xc(0x4)
	float                                                        AngularInterpAlpha;                                // 0x10(0x4)
	float                                                        AngularRecipFixTime;                               // 0x14(0x4)
	float                                                        BodySpeedThresholdSq;                              // 0x18(0x4)
};


// Size 0x40
struct RigidBodyState
{
public:
	Struct Vector_NetQuantize100                                 Position;                                          // 0x0(0xc)
	char                                                         pad0x4_YG374[0x4];                                 // 0xc(0x4)
	Struct Quat                                                  Quaternion;                                        // 0x10(0x10)
	Struct Vector_NetQuantize100                                 LinVel;                                            // 0x20(0xc)
	Struct Vector_NetQuantize100                                 AngVel;                                            // 0x2c(0xc)
	byte                                                         Flags;                                             // 0x38(0x1)
};


// Size 0x18
struct EditedDocumentInfo
{
public:
	Class Object*                                                EditedObject;                                      // 0x0(0x8)
	Struct Vector2D                                              SavedViewOffset;                                   // 0x8(0x8)
	float                                                        SavedZoomAmount;                                   // 0x10(0x4)
};


// Size 0x18
struct BPInterfaceDescription
{
public:
	class                                                        Interface;                                         // 0x0(0x8)
	TArray<class EdGraph*>                                       Graphs;                                            // 0x8(0x10)
};


// Size 0xe0
struct BPVariableDescription
{
public:
	struct FName                                                 VarName;                                           // 0x0(0x8)
	Struct Guid                                                  VarGuid;                                           // 0x8(0x10)
	Struct EdGraphPinType                                        VarType;                                           // 0x18(0x50)
	Struct FString                                               FriendlyName;                                      // 0x68(0x10)
	Struct FText                                                 Category;                                          // 0x78(0x38)
	struct FName                                                 RepNotifyFunc;                                     // 0xb8(0x8)
	TArray<struct MetaDataArray>                                 MetaDataArray;                                     // 0xc0(0x10)
	Struct FString                                               DefaultValue;                                      // 0xd0(0x10)
};


// Size 0x18
struct BPVariableMetaDataEntry
{
public:
	struct FName                                                 DataKey;                                           // 0x0(0x8)
	Struct FString                                               DataValue;                                         // 0x8(0x10)
};


// Size 0x38
struct MemberReference
{
public:
	Class Object*                                                MemberParent;                                      // 0x0(0x8)
	Struct FString                                               MemberScope;                                       // 0x8(0x10)
	struct FName                                                 MemberName;                                        // 0x18(0x8)
	Struct Guid                                                  MemberGuid;                                        // 0x20(0x10)
	bool                                                         bSelfContext;                                      // 0x30(0x1)
	bool                                                         bWasDeprecated;                                    // 0x31(0x1)
};


// Size 0x10
struct AutomaticInstancingMeshComponentArray
{
public:
	TArray<class InstancedStaticMeshComponent*>                  Array;                                             // 0x0(0x10)
};


// Size 0xf0
struct LatentActionManager
{
public:
};


// Size 0x50
struct EndClothSimulationFunction
{
public:
};


// Size 0x50
struct StartClothSimulationFunction
{
public:
};


// Size 0x50
struct EndPhysicsTickFunction
{
public:
};


// Size 0x50
struct StartPhysicsTickFunction
{
public:
};


// Size 0x20
struct LevelViewportInfo
{
public:
	Struct Vector                                                CamPosition;                                       // 0x0(0xc)
	Struct Rotator                                               CamRotation;                                       // 0xc(0xc)
	float                                                        CamOrthoZoom;                                      // 0x18(0x4)
	bool                                                         CamUpdated;                                        // 0x1c(0x1)
};


// Size 0xac
struct LevelSimplificationDetails
{
public:
	bool                                                         bCreatePackagePerAsset;                            // 0x0(0x1)
	char                                                         pad0x3_CB0PY[0x3];                                 // 0x1(0x3)
	float                                                        ProxyPixelSize;                                    // 0x4(0x4)
	Struct MaterialSimplificationSettings                        StaticMeshMaterial;                                // 0x8(0x44)
	bool                                                         bOverrideLandscapeExportLOD;                       // 0x4c(0x1)
	char                                                         pad0x3_J1O81[0x3];                                 // 0x4d(0x3)
	int                                                          LandscapeExportLOD;                                // 0x50(0x4)
	Struct MaterialSimplificationSettings                        LandscapeMaterial;                                 // 0x54(0x44)
	bool                                                         bRemoveDownwardFacingTriangles;                    // 0x98(0x1)
	char                                                         pad0x3_9ET31[0x3];                                 // 0x99(0x3)
	float                                                        CullAngleThreshold;                                // 0x9c(0x4)
	bool                                                         bBakeFoliageToLandscape;                           // 0xa0(0x1)
	bool                                                         bBakeGrassToLandscape;                             // 0xa1(0x1)
	bool                                                         bGenerateMeshNormalMap;                            // 0xa2(0x1)
	bool                                                         bGenerateMeshMetallicMap;                          // 0xa3(0x1)
	bool                                                         bGenerateMeshRoughnessMap;                         // 0xa4(0x1)
	bool                                                         bGenerateMeshSpecularMap;                          // 0xa5(0x1)
	bool                                                         bGenerateLandscapeNormalMap;                       // 0xa6(0x1)
	bool                                                         bGenerateLandscapeMetallicMap;                     // 0xa7(0x1)
	bool                                                         bGenerateLandscapeRoughnessMap;                    // 0xa8(0x1)
	bool                                                         bGenerateLandscapeSpecularMap;                     // 0xa9(0x1)
};


// Size 0x28
struct DynamicTextureInstance
{
public:
	Class Texture2D*                                             Texture;                                           // 0x18(0x8)
	bool                                                         bAttached;                                         // 0x20(0x1)
	char                                                         pad0x3_RRA2W[0x3];                                 // 0x21(0x3)
	float                                                        OriginalRadius;                                    // 0x24(0x4)
};


// Size 0x14
struct StreamableTextureInstance
{
public:
};


// Size 0xc
struct GeomSelection
{
public:
	int                                                          Type;                                              // 0x0(0x4)
	int                                                          Index;                                             // 0x4(0x4)
	int                                                          SelectionIndex;                                    // 0x8(0x4)
};


// Size 0x24
struct InteriorSettings
{
public:
	bool                                                         bIsWorldSettings;                                  // 0x0(0x1)
	char                                                         pad0x3_YPPF7[0x3];                                 // 0x1(0x3)
	float                                                        ExteriorVolume;                                    // 0x4(0x4)
	float                                                        ExteriorTime;                                      // 0x8(0x4)
	float                                                        ExteriorLPF;                                       // 0xc(0x4)
	float                                                        ExteriorLPFTime;                                   // 0x10(0x4)
	float                                                        InteriorVolume;                                    // 0x14(0x4)
	float                                                        InteriorTime;                                      // 0x18(0x4)
	float                                                        InteriorLPF;                                       // 0x1c(0x4)
	float                                                        InteriorLPFTime;                                   // 0x20(0x4)
};


// Size 0x18
struct ReverbSettings
{
public:
	bool                                                         bApplyReverb;                                      // 0x0(0x1)
	char                                                         pad0x3_MTN3Z[0x3];                                 // 0x1(0x3)
	byte                                                         ReverbType;                                        // 0x4(0x1)
	char                                                         pad0x3_ADNQN[0x3];                                 // 0x5(0x3)
	Class ReverbEffect*                                          ReverbEffect;                                      // 0x8(0x8)
	float                                                        Volume;                                            // 0x10(0x4)
	float                                                        FadeTime;                                          // 0x14(0x4)
};


// Size 0x8
struct CullDistanceSizePair
{
public:
	float                                                        Size;                                              // 0x0(0x4)
	float                                                        CullDistance;                                      // 0x4(0x4)
};


// Size 0x58
struct NavDataConfig
{
public:
	Struct Color                                                 Color;                                             // 0x30(0x4)
	Struct Vector                                                DefaultQueryExtent;                                // 0x34(0xc)
	class                                                        NavigationDataClass;                               // 0x40(0x8)
	Struct StringClassReference                                  NavigationDataClassName;                           // 0x48(0x10)
};


// Size 0x30
struct NavAgentProperties
{
public:
	struct FName                                                 Name;                                              // 0x4(0x8)
	float                                                        AgentRadius;                                       // 0xc(0x4)
	float                                                        AgentHeight;                                       // 0x10(0x4)
	float                                                        AgentStepHeight;                                   // 0x14(0x4)
	float                                                        NavWalkingSearchHeightScale;                       // 0x18(0x4)
	float                                                        NavWalkingSearchRadiusScale;                       // 0x1c(0x4)
	float                                                        NavWalkingSearchRadiusScaleOffMesh;                // 0x20(0x4)
	float                                                        AgentMaxSlope;                                     // 0x24(0x4)
	float                                                        MinRegionArea;                                     // 0x28(0x4)
};


// Size 0x4
struct MovementProperties
{
public:
	bool                                                         bCanCrouch;                                        // 0x0(0x1)
	bool                                                         bCanJump;                                          // 0x0(0x1)
	bool                                                         bCanWalk;                                          // 0x0(0x1)
	bool                                                         bCanSwim;                                          // 0x0(0x1)
	bool                                                         bCanFly;                                           // 0x0(0x1)
};


// Size 0x4
struct NavAgentSelector
{
public:
	bool                                                         bSupportsAgent0;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent1;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent2;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent3;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent4;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent5;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent6;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent7;                                   // 0x0(0x1)
	bool                                                         bSupportsAgent8;                                   // 0x1(0x1)
	bool                                                         bSupportsAgent9;                                   // 0x1(0x1)
	bool                                                         bSupportsAgent10;                                  // 0x1(0x1)
	bool                                                         bSupportsAgent11;                                  // 0x1(0x1)
	bool                                                         bSupportsAgent12;                                  // 0x1(0x1)
	bool                                                         bSupportsAgent13;                                  // 0x1(0x1)
	bool                                                         bSupportsAgent14;                                  // 0x1(0x1)
	bool                                                         bSupportsAgent15;                                  // 0x1(0x1)
};


// Size 0x18
struct PlayerAmbientLightOverrideSettings
{
public:
	bool                                                         OverrideBodyLightAmbience;                         // 0x0(0x1)
	char                                                         pad0x3_1GNIQ[0x3];                                 // 0x1(0x3)
	float                                                        BodyLightAmbienceLightFactor;                      // 0x4(0x4)
	float                                                        BodyLightAmbienceBlendWithDefault;                 // 0x8(0x4)
	bool                                                         OverrideLanternAmbience;                           // 0xc(0x1)
	char                                                         pad0x3_PIUY6[0x3];                                 // 0xd(0x3)
	float                                                        LanternAmbienceLightFactor;                        // 0x10(0x4)
	float                                                        LanternAmbienceBlendWithDefault;                   // 0x14(0x4)
};


// Size 0x540
struct PostProcessSettings
{
public:
	bool                                                         bOverride_WhiteTemp;                               // 0x0(0x1)
	bool                                                         bOverride_WhiteTint;                               // 0x0(0x1)
	bool                                                         bOverride_ColorSaturation;                         // 0x0(0x1)
	bool                                                         bOverride_ColorContrast;                           // 0x0(0x1)
	bool                                                         bOverride_ColorGamma;                              // 0x0(0x1)
	bool                                                         bOverride_ColorGain;                               // 0x0(0x1)
	bool                                                         bOverride_ColorOffset;                             // 0x0(0x1)
	bool                                                         bOverride_FilmWhitePoint;                          // 0x0(0x1)
	bool                                                         bOverride_FilmSaturation;                          // 0x1(0x1)
	bool                                                         bOverride_FilmChannelMixerRed;                     // 0x1(0x1)
	bool                                                         bOverride_FilmChannelMixerGreen;                   // 0x1(0x1)
	bool                                                         bOverride_FilmChannelMixerBlue;                    // 0x1(0x1)
	bool                                                         bOverride_FilmContrast;                            // 0x1(0x1)
	bool                                                         bOverride_FilmDynamicRange;                        // 0x1(0x1)
	bool                                                         bOverride_FilmHealAmount;                          // 0x1(0x1)
	bool                                                         bOverride_FilmToeAmount;                           // 0x1(0x1)
	bool                                                         bOverride_FilmShadowTint;                          // 0x2(0x1)
	bool                                                         bOverride_FilmShadowTintBlend;                     // 0x2(0x1)
	bool                                                         bOverride_FilmShadowTintAmount;                    // 0x2(0x1)
	bool                                                         bOverride_FilmSlope;                               // 0x2(0x1)
	bool                                                         bOverride_FilmToe;                                 // 0x2(0x1)
	bool                                                         bOverride_FilmShoulder;                            // 0x2(0x1)
	bool                                                         bOverride_FilmBlackClip;                           // 0x2(0x1)
	bool                                                         bOverride_FilmWhiteClip;                           // 0x2(0x1)
	bool                                                         bOverride_SceneColorTint;                          // 0x3(0x1)
	bool                                                         bOverride_SceneFringeIntensity;                    // 0x3(0x1)
	bool                                                         bOverride_SceneFringeSaturation;                   // 0x3(0x1)
	bool                                                         bOverride_AmbientCubemapTint;                      // 0x3(0x1)
	bool                                                         bOverride_AmbientCubemapIntensity;                 // 0x3(0x1)
	bool                                                         bOverride_BloomIntensity;                          // 0x3(0x1)
	bool                                                         bOverride_BloomThreshold;                          // 0x3(0x1)
	bool                                                         bOverride_Bloom1Tint;                              // 0x3(0x1)
	bool                                                         bOverride_Bloom1Size;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom2Size;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom2Tint;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom3Tint;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom3Size;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom4Tint;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom4Size;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom5Tint;                              // 0x4(0x1)
	bool                                                         bOverride_Bloom5Size;                              // 0x5(0x1)
	bool                                                         bOverride_Bloom6Tint;                              // 0x5(0x1)
	bool                                                         bOverride_Bloom6Size;                              // 0x5(0x1)
	bool                                                         bOverride_BloomSizeScale;                          // 0x5(0x1)
	bool                                                         bOverride_BloomDirtMaskIntensity;                  // 0x5(0x1)
	bool                                                         bOverride_BloomDirtMaskTint;                       // 0x5(0x1)
	bool                                                         bOverride_BloomDirtMask;                           // 0x5(0x1)
	bool                                                         bOverride_AutoExposureLowPercent;                  // 0x5(0x1)
	bool                                                         bOverride_AutoExposureHighPercent;                 // 0x6(0x1)
	bool                                                         bOverride_AutoExposureMinBrightness;               // 0x6(0x1)
	bool                                                         bOverride_AutoExposureMaxBrightness;               // 0x6(0x1)
	bool                                                         bOverride_AutoExposureSpeedUp;                     // 0x6(0x1)
	bool                                                         bOverride_AutoExposureSpeedDown;                   // 0x6(0x1)
	bool                                                         bOverride_AutoExposureBias;                        // 0x6(0x1)
	bool                                                         bOverride_HistogramLogMin;                         // 0x6(0x1)
	bool                                                         bOverride_HistogramLogMax;                         // 0x6(0x1)
	bool                                                         bOverride_LensFlareIntensity;                      // 0x7(0x1)
	bool                                                         bOverride_LensFlareTint;                           // 0x7(0x1)
	bool                                                         bOverride_LensFlareTints;                          // 0x7(0x1)
	bool                                                         bOverride_LensFlareBokehSize;                      // 0x7(0x1)
	bool                                                         bOverride_LensFlareBokehShape;                     // 0x7(0x1)
	bool                                                         bOverride_LensFlareThreshold;                      // 0x7(0x1)
	bool                                                         bOverride_VignetteIntensity;                       // 0x7(0x1)
	bool                                                         bOverride_GrainIntensity;                          // 0x7(0x1)
	bool                                                         bOverride_GrainJitter;                             // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionIntensity;               // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionStaticFraction;          // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionRadius;                  // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionFadeDistance;            // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionFadeRadius;              // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionDistance;                // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionRadiusInWS;              // 0x8(0x1)
	bool                                                         bOverride_AmbientOcclusionPower;                   // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionBias;                    // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionQuality;                 // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionMipBlend;                // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionMipScale;                // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionMipThreshold;            // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiIntensity;           // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiPower;               // 0x9(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiRadius;              // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiBlurTolerance;       // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiUpsampleTolerance;   // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiNoiseFilterTolerance; // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiRejectionFalloff;    // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiBias;                // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiMaxDepthDownsample;  // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiUseNormals;          // 0xa(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiCombineBeforeBlur;   // 0xb(0x1)
	bool                                                         bOverride_AmbientOcclusionHemiCombineWithMultiply; // 0xb(0x1)
	bool                                                         bOverride_MinOverdrawCount;                        // 0xb(0x1)
	bool                                                         bOverride_MaxOverdrawCount;                        // 0xb(0x1)
	bool                                                         bOverride_MinOverdrawColour;                       // 0xb(0x1)
	bool                                                         bOverride_MaxOverdrawColour;                       // 0xb(0x1)
	bool                                                         bOverride_LPVIntensity;                            // 0xb(0x1)
	bool                                                         bOverride_LPVDirectionalOcclusionIntensity;        // 0xb(0x1)
	bool                                                         bOverride_LPVDirectionalOcclusionRadius;           // 0xc(0x1)
	bool                                                         bOverride_LPVDiffuseOcclusionExponent;             // 0xc(0x1)
	bool                                                         bOverride_LPVSpecularOcclusionExponent;            // 0xc(0x1)
	bool                                                         bOverride_LPVDiffuseOcclusionIntensity;            // 0xc(0x1)
	bool                                                         bOverride_LPVSpecularOcclusionIntensity;           // 0xc(0x1)
	bool                                                         bOverride_LPVSize;                                 // 0xc(0x1)
	bool                                                         bOverride_LPVSecondaryOcclusionIntensity;          // 0xc(0x1)
	bool                                                         bOverride_LPVSecondaryBounceIntensity;             // 0xc(0x1)
	bool                                                         bOverride_LPVGeometryVolumeBias;                   // 0xd(0x1)
	bool                                                         bOverride_LPVVplInjectionBias;                     // 0xd(0x1)
	bool                                                         bOverride_LPVEmissiveInjectionIntensity;           // 0xd(0x1)
	bool                                                         bOverride_LPVWorldRef;                             // 0xd(0x1)
	bool                                                         bOverride_IndirectLightingColor;                   // 0xd(0x1)
	bool                                                         bOverride_IndirectLightingIntensity;               // 0xd(0x1)
	bool                                                         bOverride_ColorGradingIntensity;                   // 0xd(0x1)
	bool                                                         bOverride_ColorGradingLUT;                         // 0xd(0x1)
	bool                                                         bOverride_DepthOfFieldFocalDistance;               // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldFstop;                       // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldDepthBlurRadius;             // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldDepthBlurAmount;             // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldFocalRegion;                 // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldNearTransitionRegion;        // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldFarTransitionRegion;         // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldScale;                       // 0xe(0x1)
	bool                                                         bOverride_DepthOfFieldMaxBokehSize;                // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldNearBlurSize;                // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldFarBlurSize;                 // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldMethod;                      // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldBokehShape;                  // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldOcclusion;                   // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldColorThreshold;              // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldSizeThreshold;               // 0xf(0x1)
	bool                                                         bOverride_DepthOfFieldSkyFocusDistance;            // 0x10(0x1)
	bool                                                         bOverride_MotionBlurAmount;                        // 0x10(0x1)
	bool                                                         bOverride_MotionBlurMax;                           // 0x10(0x1)
	bool                                                         bOverride_MotionBlurPerObjectSize;                 // 0x10(0x1)
	bool                                                         bOverride_ScreenPercentage;                        // 0x10(0x1)
	bool                                                         bOverride_AntiAliasingMethod;                      // 0x10(0x1)
	bool                                                         bOverride_ScreenSpaceReflectionIntensity;          // 0x10(0x1)
	bool                                                         bOverride_ScreenSpaceReflectionQuality;            // 0x10(0x1)
	bool                                                         bOverride_ScreenSpaceReflectionMaxRoughness;       // 0x11(0x1)
	bool                                                         bOverride_ScreenSpaceReflectionRoughnessScale;     // 0x11(0x1)
	bool                                                         bOverride_SkyLightIntensityScale;                  // 0x11(0x1)
	bool                                                         bOverride_SkyLightIntensityScaleForMinSpec;        // 0x11(0x1)
	bool                                                         bOverride_SkyLightIntensityScaleInteriorInfluence; // 0x11(0x1)
	bool                                                         bOverride_GlobalReflectionTint;                    // 0x11(0x1)
	bool                                                         bOverride_InsideAmbientColourForParticlesInfluence; // 0x11(0x1)
	bool                                                         bOverride_InsideAmbientColourForParticles;         // 0x11(0x1)
	bool                                                         bUseThisVolumeForLPVSettings;                      // 0x12(0x1)
	bool                                                         bOverride_GaussianBlur;                            // 0x12(0x1)
	bool                                                         bOverride_DisableShadowMapMethod;                  // 0x12(0x1)
	bool                                                         bOverride_UseVolumeFogScale;                       // 0x12(0x1)
	bool                                                         bOverride_VolumeFogScale;                          // 0x12(0x1)
	char                                                         pad0x1_XFQPQ[0x1];                                 // 0x13(0x1)
	float                                                        WhiteTemp;                                         // 0x14(0x4)
	float                                                        WhiteTint;                                         // 0x18(0x4)
	Struct Vector                                                ColorSaturation;                                   // 0x1c(0xc)
	Struct Vector                                                ColorContrast;                                     // 0x28(0xc)
	Struct Vector                                                ColorGamma;                                        // 0x34(0xc)
	Struct Vector                                                ColorGain;                                         // 0x40(0xc)
	Struct Vector                                                ColorOffset;                                       // 0x4c(0xc)
	Struct LinearColor                                           FilmWhitePoint;                                    // 0x58(0x10)
	Struct LinearColor                                           FilmShadowTint;                                    // 0x68(0x10)
	float                                                        FilmShadowTintBlend;                               // 0x78(0x4)
	float                                                        FilmShadowTintAmount;                              // 0x7c(0x4)
	float                                                        FilmSaturation;                                    // 0x80(0x4)
	Struct LinearColor                                           FilmChannelMixerRed;                               // 0x84(0x10)
	Struct LinearColor                                           FilmChannelMixerGreen;                             // 0x94(0x10)
	Struct LinearColor                                           FilmChannelMixerBlue;                              // 0xa4(0x10)
	float                                                        FilmContrast;                                      // 0xb4(0x4)
	float                                                        FilmToeAmount;                                     // 0xb8(0x4)
	float                                                        FilmHealAmount;                                    // 0xbc(0x4)
	float                                                        FilmDynamicRange;                                  // 0xc0(0x4)
	float                                                        FilmSlope;                                         // 0xc4(0x4)
	float                                                        FilmToe;                                           // 0xc8(0x4)
	float                                                        FilmShoulder;                                      // 0xcc(0x4)
	float                                                        FilmBlackClip;                                     // 0xd0(0x4)
	float                                                        FilmWhiteClip;                                     // 0xd4(0x4)
	Struct LinearColor                                           SceneColorTint;                                    // 0xd8(0x10)
	float                                                        SceneFringeIntensity;                              // 0xe8(0x4)
	float                                                        SceneFringeSaturation;                             // 0xec(0x4)
	float                                                        BloomIntensity;                                    // 0xf0(0x4)
	float                                                        BloomThreshold;                                    // 0xf4(0x4)
	float                                                        BloomSizeScale;                                    // 0xf8(0x4)
	float                                                        Bloom1Size;                                        // 0xfc(0x4)
	float                                                        Bloom2Size;                                        // 0x100(0x4)
	float                                                        Bloom3Size;                                        // 0x104(0x4)
	float                                                        Bloom4Size;                                        // 0x108(0x4)
	float                                                        Bloom5Size;                                        // 0x10c(0x4)
	float                                                        Bloom6Size;                                        // 0x110(0x4)
	Struct LinearColor                                           Bloom1Tint;                                        // 0x114(0x10)
	Struct LinearColor                                           Bloom2Tint;                                        // 0x124(0x10)
	Struct LinearColor                                           Bloom3Tint;                                        // 0x134(0x10)
	Struct LinearColor                                           Bloom4Tint;                                        // 0x144(0x10)
	Struct LinearColor                                           Bloom5Tint;                                        // 0x154(0x10)
	Struct LinearColor                                           Bloom6Tint;                                        // 0x164(0x10)
	float                                                        BloomDirtMaskIntensity;                            // 0x174(0x4)
	Struct LinearColor                                           BloomDirtMaskTint;                                 // 0x178(0x10)
	Class Texture*                                               BloomDirtMask;                                     // 0x188(0x8)
	float                                                        LPVIntensity;                                      // 0x190(0x4)
	float                                                        LPVVplInjectionBias;                               // 0x194(0x4)
	float                                                        LPVSize;                                           // 0x198(0x4)
	float                                                        LPVSecondaryOcclusionIntensity;                    // 0x19c(0x4)
	float                                                        LPVSecondaryBounceIntensity;                       // 0x1a0(0x4)
	float                                                        LPVGeometryVolumeBias;                             // 0x1a4(0x4)
	float                                                        LPVEmissiveInjectionIntensity;                     // 0x1a8(0x4)
	float                                                        LPVDirectionalOcclusionIntensity;                  // 0x1ac(0x4)
	Struct Transform                                             LPVWorldRef;                                       // 0x1b0(0x30)
	float                                                        LPVDirectionalOcclusionRadius;                     // 0x1e0(0x4)
	float                                                        LPVDiffuseOcclusionExponent;                       // 0x1e4(0x4)
	float                                                        LPVSpecularOcclusionExponent;                      // 0x1e8(0x4)
	float                                                        LPVDiffuseOcclusionIntensity;                      // 0x1ec(0x4)
	float                                                        LPVSpecularOcclusionIntensity;                     // 0x1f0(0x4)
	Struct LinearColor                                           AmbientCubemapTint;                                // 0x1f4(0x10)
	float                                                        AmbientCubemapIntensity;                           // 0x204(0x4)
	Class TextureCube*                                           AmbientCubemap;                                    // 0x208(0x8)
	float                                                        AutoExposureLowPercent;                            // 0x210(0x4)
	float                                                        AutoExposureHighPercent;                           // 0x214(0x4)
	float                                                        AutoExposureMinBrightness;                         // 0x218(0x4)
	float                                                        AutoExposureMaxBrightness;                         // 0x21c(0x4)
	float                                                        AutoExposureSpeedUp;                               // 0x220(0x4)
	float                                                        AutoExposureSpeedDown;                             // 0x224(0x4)
	float                                                        AutoExposureBias;                                  // 0x228(0x4)
	float                                                        HistogramLogMin;                                   // 0x22c(0x4)
	float                                                        HistogramLogMax;                                   // 0x230(0x4)
	float                                                        LensFlareIntensity;                                // 0x234(0x4)
	Struct LinearColor                                           LensFlareTint;                                     // 0x238(0x10)
	float                                                        LensFlareBokehSize;                                // 0x248(0x4)
	float                                                        LensFlareThreshold;                                // 0x24c(0x4)
	Class Texture*                                               LensFlareBokehShape;                               // 0x250(0x8)
	Struct LinearColor                                           LensFlareTints;                                    // 0x258(0x10)
	char                                                         pad0x70_DDHWG[0x70];                               // 0x268(0x70)
	float                                                        VignetteIntensity;                                 // 0x2d8(0x4)
	float                                                        GrainJitter;                                       // 0x2dc(0x4)
	float                                                        GrainIntensity;                                    // 0x2e0(0x4)
	float                                                        AmbientOcclusionIntensity;                         // 0x2e4(0x4)
	float                                                        AmbientOcclusionStaticFraction;                    // 0x2e8(0x4)
	float                                                        AmbientOcclusionRadius;                            // 0x2ec(0x4)
	bool                                                         AmbientOcclusionRadiusInWS;                        // 0x2f0(0x1)
	char                                                         pad0x3_3MF2P[0x3];                                 // 0x2f1(0x3)
	float                                                        AmbientOcclusionFadeDistance;                      // 0x2f4(0x4)
	float                                                        AmbientOcclusionFadeRadius;                        // 0x2f8(0x4)
	float                                                        AmbientOcclusionDistance;                          // 0x2fc(0x4)
	float                                                        AmbientOcclusionPower;                             // 0x300(0x4)
	float                                                        AmbientOcclusionBias;                              // 0x304(0x4)
	float                                                        AmbientOcclusionQuality;                           // 0x308(0x4)
	float                                                        AmbientOcclusionMipBlend;                          // 0x30c(0x4)
	float                                                        AmbientOcclusionMipScale;                          // 0x310(0x4)
	float                                                        AmbientOcclusionMipThreshold;                      // 0x314(0x4)
	float                                                        AmbientOcclusionHemiIntensity;                     // 0x318(0x4)
	float                                                        AmbientOcclusionHemiPower;                         // 0x31c(0x4)
	float                                                        AmbientOcclusionHemiRadius;                        // 0x320(0x4)
	float                                                        AmbientOcclusionHemiBlurTolerance;                 // 0x324(0x4)
	float                                                        AmbientOcclusionHemiUpsampleTolerance;             // 0x328(0x4)
	float                                                        AmbientOcclusionHemiNoiseFilterTolerance;          // 0x32c(0x4)
	float                                                        AmbientOcclusionHemiRejectionFalloff;              // 0x330(0x4)
	float                                                        AmbientOcclusionHemiBias;                          // 0x334(0x4)
	bool                                                         AmbientOcclusionHemiMaxDepthDownsample;            // 0x338(0x1)
	bool                                                         AmbientOcclusionHemiUseNormals;                    // 0x338(0x1)
	bool                                                         AmbientOcclusionHemiCombineBeforeBlur;             // 0x338(0x1)
	bool                                                         AmbientOcclusionHemiCombineWithMultiply;           // 0x338(0x1)
	char                                                         pad0x3_NQLL5[0x3];                                 // 0x339(0x3)
	float                                                        MinOverdrawCount;                                  // 0x33c(0x4)
	float                                                        MaxOverdrawCount;                                  // 0x340(0x4)
	Struct LinearColor                                           MinOverdrawColour;                                 // 0x344(0x10)
	Struct LinearColor                                           MaxOverdrawColour;                                 // 0x354(0x10)
	Struct LinearColor                                           IndirectLightingColor;                             // 0x364(0x10)
	float                                                        IndirectLightingIntensity;                         // 0x374(0x4)
	float                                                        ColorGradingIntensity;                             // 0x378(0x4)
	char                                                         pad0x4_GKMCK[0x4];                                 // 0x37c(0x4)
	Class Texture*                                               ColorGradingLUT;                                   // 0x380(0x8)
	byte                                                         DepthOfFieldMethod;                                // 0x388(0x1)
	char                                                         pad0x3_M5449[0x3];                                 // 0x389(0x3)
	float                                                        DepthOfFieldDepthBlurAmount;                       // 0x38c(0x4)
	float                                                        DepthOfFieldDepthBlurRadius;                       // 0x390(0x4)
	float                                                        DepthOfFieldFstop;                                 // 0x394(0x4)
	float                                                        DepthOfFieldFocalDistance;                         // 0x398(0x4)
	float                                                        DepthOfFieldFocalRegion;                           // 0x39c(0x4)
	float                                                        DepthOfFieldNearTransitionRegion;                  // 0x3a0(0x4)
	float                                                        DepthOfFieldFarTransitionRegion;                   // 0x3a4(0x4)
	float                                                        DepthOfFieldScale;                                 // 0x3a8(0x4)
	float                                                        DepthOfFieldMaxBokehSize;                          // 0x3ac(0x4)
	float                                                        DepthOfFieldNearBlurSize;                          // 0x3b0(0x4)
	float                                                        DepthOfFieldFarBlurSize;                           // 0x3b4(0x4)
	Class Texture*                                               DepthOfFieldBokehShape;                            // 0x3b8(0x8)
	float                                                        DepthOfFieldOcclusion;                             // 0x3c0(0x4)
	float                                                        DepthOfFieldColorThreshold;                        // 0x3c4(0x4)
	float                                                        DepthOfFieldSizeThreshold;                         // 0x3c8(0x4)
	float                                                        DepthOfFieldSkyFocusDistance;                      // 0x3cc(0x4)
	float                                                        MotionBlurAmount;                                  // 0x3d0(0x4)
	float                                                        MotionBlurMax;                                     // 0x3d4(0x4)
	float                                                        MotionBlurPerObjectSize;                           // 0x3d8(0x4)
	float                                                        ScreenPercentage;                                  // 0x3dc(0x4)
	byte                                                         AntiAliasingMethod;                                // 0x3e0(0x1)
	char                                                         pad0x3_VSB6D[0x3];                                 // 0x3e1(0x3)
	float                                                        ScreenSpaceReflectionIntensity;                    // 0x3e4(0x4)
	float                                                        ScreenSpaceReflectionQuality;                      // 0x3e8(0x4)
	float                                                        ScreenSpaceReflectionMaxRoughness;                 // 0x3ec(0x4)
	float                                                        SkyLightIntensityScale;                            // 0x3f0(0x4)
	float                                                        SkyLightIntensityScaleForMinSpec;                  // 0x3f4(0x4)
	float                                                        SkyLightIntensityScaleInteriorInfluence;           // 0x3f8(0x4)
	bool                                                         bUseVolumeFogScale;                                // 0x3fc(0x1)
	char                                                         pad0x3_FNXMJ[0x3];                                 // 0x3fd(0x3)
	float                                                        VolumeFogScale;                                    // 0x400(0x4)
	Struct LinearColor                                           GlobalReflectionTint;                              // 0x404(0x10)
	float                                                        InsideAmbientColourForParticlesInfluence;          // 0x414(0x4)
	Struct LinearColor                                           InsideAmbientColourForParticles;                   // 0x418(0x10)
	Struct RainPostProcessSettings                               RainSettings;                                      // 0x428(0xc0)
	TArray<struct LPVSettings>                                   LPVSettings;                                       // 0x4e8(0x10)
	Struct PlayerAmbientLightOverrideSettings                    PlayerAmbientLightOverrideSettings;                // 0x4f8(0x18)
	float                                                        GaussianBlurIntensity;                             // 0x510(0x4)
	byte                                                         DisableShadowMethod;                               // 0x514(0x1)
	char                                                         pad0x3_Q28TZ[0x3];                                 // 0x515(0x3)
	Struct WeightedBlendables                                    WeightedBlendables;                                // 0x518(0x10)
	TArray<class Object*>                                        Blendables;                                        // 0x528(0x10)
};


// Size 0x10
struct WeightedBlendables
{
public:
	TArray<struct Array>                                         Array;                                             // 0x0(0x10)
};


// Size 0x10
struct WeightedBlendable
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	char                                                         pad0x4_38TM9[0x4];                                 // 0x4(0x4)
	Class Object*                                                Object;                                            // 0x8(0x8)
};


// Size 0x70
struct LPVCascadeSettings
{
public:
	bool                                                         bOverride_LPVIntensity;                            // 0x0(0x1)
	bool                                                         bOverride_LPVDirectionalOcclusionIntensity;        // 0x0(0x1)
	bool                                                         bOverride_LPVDirectionalOcclusionRadius;           // 0x0(0x1)
	bool                                                         bOverride_LPVDiffuseOcclusionExponent;             // 0x0(0x1)
	bool                                                         bOverride_LPVSpecularOcclusionExponent;            // 0x0(0x1)
	bool                                                         bOverride_LPVDiffuseOcclusionIntensity;            // 0x0(0x1)
	bool                                                         bOverride_LPVSpecularOcclusionIntensity;           // 0x0(0x1)
	bool                                                         bOverride_LPVSize;                                 // 0x0(0x1)
	bool                                                         bOverride_LPVSecondaryOcclusionIntensity;          // 0x1(0x1)
	bool                                                         bOverride_LPVSecondaryBounceIntensity;             // 0x1(0x1)
	bool                                                         bOverride_LPVGeometryVolumeBias;                   // 0x1(0x1)
	bool                                                         bOverride_LPVVplInjectionBias;                     // 0x1(0x1)
	bool                                                         bOverride_LPVEmissiveInjectionIntensity;           // 0x1(0x1)
	bool                                                         bOverride_NumberOfPropagationSteps;                // 0x1(0x1)
	bool                                                         bFreezeLPVUpdate;                                  // 0x1(0x1)
	char                                                         pad0x2_AM9X7[0x2];                                 // 0x2(0x2)
	float                                                        LPVIntensity;                                      // 0x4(0x4)
	float                                                        LPVVplInjectionBias;                               // 0x8(0x4)
	float                                                        LPVSize;                                           // 0xc(0x4)
	float                                                        LPVSecondaryOcclusionIntensity;                    // 0x10(0x4)
	float                                                        LPVSecondaryBounceIntensity;                       // 0x14(0x4)
	float                                                        LPVGeometryVolumeBias;                             // 0x18(0x4)
	float                                                        LPVEmissiveInjectionIntensity;                     // 0x1c(0x4)
	float                                                        LPVDirectionalOcclusionIntensity;                  // 0x20(0x4)
	float                                                        LPVDirectionalOcclusionRadius;                     // 0x24(0x4)
	float                                                        LPVDiffuseOcclusionExponent;                       // 0x28(0x4)
	float                                                        LPVSpecularOcclusionExponent;                      // 0x2c(0x4)
	float                                                        LPVDiffuseOcclusionIntensity;                      // 0x30(0x4)
	float                                                        LPVSpecularOcclusionIntensity;                     // 0x34(0x4)
	int                                                          LPVNumberOfPropagationSteps;                       // 0x38(0x4)
	char                                                         pad0x4_E9VZG[0x4];                                 // 0x3c(0x4)
	Struct Transform                                             LPVWorldRef;                                       // 0x40(0x30)
};


// Size 0x5a0
struct MinimalViewInfo
{
public:
	Struct Vector                                                Location;                                          // 0x0(0xc)
	Struct Rotator                                               Rotation;                                          // 0xc(0xc)
	char                                                         pad0x10_XZ8LT[0x10];                               // 0x18(0x10)
	float                                                        FOV;                                               // 0x28(0x4)
	float                                                        OrthoWidth;                                        // 0x2c(0x4)
	float                                                        OrthoNearClipPlane;                                // 0x30(0x4)
	float                                                        OrthoFarClipPlane;                                 // 0x34(0x4)
	float                                                        AspectRatio;                                       // 0x38(0x4)
	bool                                                         bConstrainAspectRatio;                             // 0x3c(0x1)
	bool                                                         bUseFieldOfViewForLOD;                             // 0x3c(0x1)
	char                                                         pad0x3_5UWJZ[0x3];                                 // 0x3d(0x3)
	byte                                                         ProjectionMode;                                    // 0x40(0x1)
	char                                                         pad0x3_BF6BD[0x3];                                 // 0x41(0x3)
	float                                                        PostProcessBlendWeight;                            // 0x44(0x4)
	char                                                         pad0x8_YBFSQ[0x8];                                 // 0x48(0x8)
	Struct PostProcessSettings                                   PostProcessSettings;                               // 0x50(0x540)
};


// Size 0x24
struct VOscillator
{
public:
	Struct FOscillator                                           X;                                                 // 0x0(0xc)
	Struct FOscillator                                           Y;                                                 // 0xc(0xc)
	Struct FOscillator                                           Z;                                                 // 0x18(0xc)
};


// Size 0xc
struct FOscillator
{
public:
	float                                                        Amplitude;                                         // 0x0(0x4)
	float                                                        Frequency;                                         // 0x4(0x4)
	byte                                                         InitialOffset;                                     // 0x8(0x1)
};


// Size 0x24
struct ROscillator
{
public:
	Struct FOscillator                                           Pitch;                                             // 0x0(0xc)
	Struct FOscillator                                           Yaw;                                               // 0xc(0xc)
	Struct FOscillator                                           Roll;                                              // 0x18(0xc)
};


// Size 0x10
struct ViewTargetTransitionParams
{
public:
	float                                                        BlendTime;                                         // 0x0(0x4)
	byte                                                         BlendFunction;                                     // 0x4(0x1)
	char                                                         pad0x3_O3SX6[0x3];                                 // 0x5(0x3)
	float                                                        BlendExp;                                          // 0x8(0x4)
	bool                                                         bLockOutgoing;                                     // 0xc(0x1)
};


// Size 0x5c0
struct TViewTarget
{
public:
	Class Actor*                                                 Target;                                            // 0x0(0x8)
	char                                                         pad0x8_JRMF9[0x8];                                 // 0x8(0x8)
	Struct MinimalViewInfo                                       POV;                                               // 0x10(0x5a0)
	Class PlayerState*                                           PlayerState;                                       // 0x5b0(0x8)
};


// Size 0x5b0
struct CameraCacheEntry
{
public:
	float                                                        TimeStamp;                                         // 0x0(0x4)
	char                                                         pad0xc_ADKZY[0xc];                                 // 0x4(0xc)
	Struct MinimalViewInfo                                       POV;                                               // 0x10(0x5a0)
};


// Size 0x68
struct NameCurve
{
public:
	TArray<struct Keys>                                          Keys;                                              // 0x58(0x10)
};


// Size 0xc
struct NameCurveKey
{
public:
	float                                                        Time;                                              // 0x0(0x4)
	struct FName                                                 Value;                                             // 0x4(0x8)
};


// Size 0x18
struct ActiveForceFeedbackEffect
{
public:
	Class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x0(0x8)
};


// Size 0x88
struct ForceFeedbackChannelDetails
{
public:
	bool                                                         bAffectsLeftLarge;                                 // 0x0(0x1)
	bool                                                         bAffectsLeftSmall;                                 // 0x0(0x1)
	bool                                                         bAffectsRightLarge;                                // 0x0(0x1)
	bool                                                         bAffectsRightSmall;                                // 0x0(0x1)
	bool                                                         bAffectsLeftTrigger;                               // 0x0(0x1)
	bool                                                         bAffectsRightTrigger;                              // 0x0(0x1)
	char                                                         pad0x7_PZDUG[0x7];                                 // 0x1(0x7)
	Struct RuntimeFloatCurve                                     Curve;                                             // 0x8(0x80)
};


// Size 0x18
struct LevelStreamingStatusUpdateInfo
{
public:
	Struct FString                                               PackageName;                                       // 0x0(0x10)
	int                                                          LODIndex;                                          // 0x10(0x4)
	bool                                                         bNewShouldBeLoaded;                                // 0x14(0x1)
	bool                                                         bNewShouldBeVisible;                               // 0x14(0x1)
	bool                                                         bNewShouldBlockOnLoad;                             // 0x14(0x1)
};


// Size 0x60
struct DebugTextInfo
{
public:
	Class Actor*                                                 SrcActor;                                          // 0x0(0x8)
	Struct Vector                                                SrcActorOffset;                                    // 0x8(0xc)
	Struct Vector                                                SrcActorDesiredOffset;                             // 0x14(0xc)
	Struct FString                                               DebugText;                                         // 0x20(0x10)
	float                                                        TimeRemaining;                                     // 0x30(0x4)
	float                                                        Duration;                                          // 0x34(0x4)
	Struct Color                                                 TextColor;                                         // 0x38(0x4)
	bool                                                         bAbsoluteLocation;                                 // 0x3c(0x1)
	bool                                                         bKeepAttachedToActor;                              // 0x3c(0x1)
	bool                                                         bDrawShadow;                                       // 0x3c(0x1)
	char                                                         pad0x3_SREVL[0x3];                                 // 0x3d(0x3)
	Struct Vector                                                OrigActorLocation;                                 // 0x40(0xc)
	char                                                         pad0x4_K481I[0x4];                                 // 0x4c(0x4)
	Class Font*                                                  Font;                                              // 0x50(0x8)
	float                                                        FontScale;                                         // 0x58(0x4)
};


// Size 0x20
struct GameClassShortName
{
public:
	Struct FString                                               ShortName;                                         // 0x0(0x10)
	Struct FString                                               GameClassName;                                     // 0x10(0x10)
};


// Size 0xc
struct MergedCollisionActorsSimplification
{
public:
	Struct CollisionMergingSettings                              MergeCollisionSettings;                            // 0x0(0x1)
	char                                                         pad0x3_0YUF3[0x3];                                 // 0x1(0x3)
	float                                                        MaxBoundRadius;                                    // 0x4(0x4)
	int                                                          MinNumberOfComponentsToMerge;                      // 0x8(0x4)
};


// Size 0xd8
struct HierarchicalSimplification
{
public:
	bool                                                         bSimplifyMesh;                                     // 0x0(0x1)
	char                                                         pad0x3_L40T8[0x3];                                 // 0x1(0x3)
	float                                                        DrawDistance;                                      // 0x4(0x4)
	float                                                        DesiredBoundRadius;                                // 0x8(0x4)
	float                                                        DesiredFillingPercentage;                          // 0xc(0x4)
	int                                                          MinNumberOfActorsToBuild;                          // 0x10(0x4)
	Struct MeshProxySettings                                     ProxySetting;                                      // 0x14(0x70)
	char                                                         pad0x4_962S1[0x4];                                 // 0x84(0x4)
	Struct MeshMergingSettings                                   MergeSetting;                                      // 0x88(0x50)
};


// Size 0x58
struct NetViewer
{
public:
	Class Actor*                                                 InViewer;                                          // 0x0(0x8)
	Class Actor*                                                 ViewTarget;                                        // 0x8(0x8)
	TArray<struct CachedViewLocations>                           CachedViewLocations;                               // 0x10(0x10)
	Struct Vector                                                ViewDir;                                           // 0x20(0xc)
};


// Size 0x44
struct LightmassWorldInfoSettings
{
public:
	float                                                        StaticLightingLevelScale;                          // 0x0(0x4)
	int                                                          NumIndirectLightingBounces;                        // 0x4(0x4)
	float                                                        IndirectLightingQuality;                           // 0x8(0x4)
	float                                                        IndirectLightingSmoothness;                        // 0xc(0x4)
	Struct Color                                                 EnvironmentColor;                                  // 0x10(0x4)
	float                                                        EnvironmentIntensity;                              // 0x14(0x4)
	float                                                        EmissiveBoost;                                     // 0x18(0x4)
	float                                                        DiffuseBoost;                                      // 0x1c(0x4)
	bool                                                         bUseAmbientOcclusion;                              // 0x20(0x1)
	bool                                                         bGenerateAmbientOcclusionMaterialMask;             // 0x20(0x1)
	char                                                         pad0x3_VUPNE[0x3];                                 // 0x21(0x3)
	float                                                        DirectIlluminationOcclusionFraction;               // 0x24(0x4)
	float                                                        IndirectIlluminationOcclusionFraction;             // 0x28(0x4)
	float                                                        OcclusionExponent;                                 // 0x2c(0x4)
	float                                                        FullyOccludedSamplesFraction;                      // 0x30(0x4)
	float                                                        MaxOcclusionDistance;                              // 0x34(0x4)
	bool                                                         bVisualizeMaterialDiffuse;                         // 0x38(0x1)
	bool                                                         bVisualizeAmbientOcclusion;                        // 0x38(0x1)
	char                                                         pad0x3_3HNQ7[0x3];                                 // 0x39(0x3)
	float                                                        VolumeLightSamplePlacementScale;                   // 0x3c(0x4)
	bool                                                         bCompressLightmaps;                                // 0x40(0x1)
};


// Size 0x20
struct GameModePrefix
{
public:
	Struct FString                                               Prefix;                                            // 0x0(0x10)
	Struct FString                                               GameMode;                                          // 0x10(0x10)
};


// Size 0x18
struct InterpGroupActorInfo
{
public:
	struct FName                                                 ObjectName;                                        // 0x0(0x8)
	TArray<class Actor*>                                         Actors;                                            // 0x8(0x10)
};


// Size 0x10
struct CameraCutInfo
{
public:
	Struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        TimeStamp;                                         // 0xc(0x4)
};


// Size 0x4
struct NavigationFilterFlags
{
public:
	bool                                                         bNavFlag0;                                         // 0x0(0x1)
	bool                                                         bNavFlag1;                                         // 0x0(0x1)
	bool                                                         bNavFlag2;                                         // 0x0(0x1)
	bool                                                         bNavFlag3;                                         // 0x0(0x1)
	bool                                                         bNavFlag4;                                         // 0x0(0x1)
	bool                                                         bNavFlag5;                                         // 0x0(0x1)
	bool                                                         bNavFlag6;                                         // 0x0(0x1)
	bool                                                         bNavFlag7;                                         // 0x0(0x1)
	bool                                                         bNavFlag8;                                         // 0x1(0x1)
	bool                                                         bNavFlag9;                                         // 0x1(0x1)
	bool                                                         bNavFlag10;                                        // 0x1(0x1)
	bool                                                         bNavFlag11;                                        // 0x1(0x1)
	bool                                                         bNavFlag12;                                        // 0x1(0x1)
	bool                                                         bNavFlag13;                                        // 0x1(0x1)
	bool                                                         bNavFlag14;                                        // 0x1(0x1)
	bool                                                         bNavFlag15;                                        // 0x1(0x1)
};


// Size 0x18
struct NavigationFilterArea
{
public:
	class                                                        AreaClass;                                         // 0x0(0x8)
	float                                                        TravelCostOverride;                                // 0x8(0x4)
	float                                                        EnteringCostOverride;                              // 0xc(0x4)
	bool                                                         bIsExcluded;                                       // 0x10(0x1)
	bool                                                         bOverrideTravelCost;                               // 0x10(0x1)
	bool                                                         bOverrideEnteringCost;                             // 0x10(0x1)
};


// Size 0x20
struct SupportedAreaData
{
public:
	Struct FString                                               AreaClassName;                                     // 0x0(0x10)
	int                                                          AreaID;                                            // 0x10(0x4)
	char                                                         pad0x4_TWA82[0x4];                                 // 0x14(0x4)
	class                                                        AreaClass;                                         // 0x18(0x8)
};


// Size 0x18
struct NavGraphNode
{
public:
	Class Object*                                                Owner;                                             // 0x0(0x8)
};


// Size 0x18
struct NavGraphEdge
{
public:
};


// Size 0x60
struct NavigationSegmentLink
{
public:
	Struct Vector                                                LeftStart;                                         // 0x30(0xc)
	Struct Vector                                                LeftEnd;                                           // 0x3c(0xc)
	Struct Vector                                                RightStart;                                        // 0x48(0xc)
	Struct Vector                                                RightEnd;                                          // 0x54(0xc)
};


// Size 0x30
struct NavigationLinkBase
{
public:
	float                                                        LeftProjectHeight;                                 // 0x0(0x4)
	float                                                        MaxFallDownLength;                                 // 0x4(0x4)
	byte                                                         Direction;                                         // 0x8(0x1)
	char                                                         pad0x7_WGDJT[0x7];                                 // 0x9(0x7)
	float                                                        SnapRadius;                                        // 0x10(0x4)
	float                                                        SnapHeight;                                        // 0x14(0x4)
	bool                                                         bUseSnapHeight;                                    // 0x18(0x1)
	bool                                                         bSnapToCheapestArea;                               // 0x18(0x1)
	char                                                         pad0x7_YFMEB[0x7];                                 // 0x19(0x7)
	class                                                        AreaClass;                                         // 0x20(0x8)
	Struct NavAgentSelector                                      SupportedAgents;                                   // 0x28(0x4)
	bool                                                         bSupportsAgent0;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent1;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent2;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent3;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent4;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent5;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent6;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent7;                                   // 0x2c(0x1)
	bool                                                         bSupportsAgent8;                                   // 0x2d(0x1)
	bool                                                         bSupportsAgent9;                                   // 0x2d(0x1)
	bool                                                         bSupportsAgent10;                                  // 0x2d(0x1)
	bool                                                         bSupportsAgent11;                                  // 0x2d(0x1)
	bool                                                         bSupportsAgent12;                                  // 0x2d(0x1)
	bool                                                         bSupportsAgent13;                                  // 0x2d(0x1)
	bool                                                         bSupportsAgent14;                                  // 0x2d(0x1)
	bool                                                         bSupportsAgent15;                                  // 0x2d(0x1)
};


// Size 0x48
struct NavigationLink
{
public:
	Struct Vector                                                Left;                                              // 0x30(0xc)
	Struct Vector                                                Right;                                             // 0x3c(0xc)
};


// Size 0x14
struct LightmassMaterialInterfaceSettings
{
public:
	bool                                                         bCastShadowAsMasked;                               // 0x0(0x1)
	char                                                         pad0x3_A2VPY[0x3];                                 // 0x1(0x3)
	float                                                        EmissiveBoost;                                     // 0x4(0x4)
	float                                                        DiffuseBoost;                                      // 0x8(0x4)
	float                                                        ExportResolutionScale;                             // 0xc(0x4)
	bool                                                         bOverrideCastShadowAsMasked;                       // 0x10(0x1)
	bool                                                         bOverrideEmissiveBoost;                            // 0x10(0x1)
	bool                                                         bOverrideDiffuseBoost;                             // 0x10(0x1)
	bool                                                         bOverrideExportResolutionScale;                    // 0x10(0x1)
};


// Size 0xc
struct MaterialRelevance
{
public:
	bool                                                         bOpaque;                                           // 0x0(0x1)
	bool                                                         bMasked;                                           // 0x0(0x1)
	bool                                                         bDistortion;                                       // 0x0(0x1)
	bool                                                         bSeparateTranslucency;                             // 0x0(0x1)
	bool                                                         bNormalTranslucency;                               // 0x0(0x1)
	bool                                                         bDisableDepthTest;                                 // 0x0(0x1)
	bool                                                         bOutputsVelocityInBasePass;                        // 0x0(0x1)
	bool                                                         bUsesGlobalDistanceField;                          // 0x0(0x1)
	char                                                         pad0x3_KH9HC[0x3];                                 // 0x1(0x3)
	bool                                                         bOITTranslucencyRelevance;                         // 0x8(0x1)
	bool                                                         bOITAfterTranslucencyRelevance;                    // 0x8(0x1)
	bool                                                         bLowResTranslucencyRelevance;                      // 0x8(0x1)
	bool                                                         bLowResCloudsRelevance;                            // 0x8(0x1)
	bool                                                         bMaskPassRelevance;                                // 0x8(0x1)
	bool                                                         bTranslucentBeforeTranslucency;                    // 0x8(0x1)
	bool                                                         bTranslucentBeforeVolumeFog;                       // 0x8(0x1)
	bool                                                         bTranslucentWithDepthWrite;                        // 0x8(0x1)
};


// Size 0x78
struct SpriteCategoryInfo
{
public:
	struct FName                                                 Category;                                          // 0x0(0x8)
	Struct FText                                                 DisplayName;                                       // 0x8(0x38)
	Struct FText                                                 Description;                                       // 0x40(0x38)
};


// Size 0x10
struct NamedEmitterMaterial
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	Class MaterialInterface*                                     Material;                                          // 0x8(0x8)
};


// Size 0x10
struct LODSoloTrack
{
public:
	TArray<Byte SoloEnableSetting>                               SoloEnableSetting;                                 // 0x0(0x10)
};


// Size 0x1
struct ParticleSystemLOD
{
public:
};


// Size 0x50
struct ParticleSysParam
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	byte                                                         ParamType;                                         // 0x8(0x1)
	char                                                         pad0x3_NQYRY[0x3];                                 // 0x9(0x3)
	float                                                        Scalar;                                            // 0xc(0x4)
	float                                                        Scalar_Low;                                        // 0x10(0x4)
	Struct Vector                                                Vector;                                            // 0x14(0xc)
	Struct Vector                                                Vector_Low;                                        // 0x20(0xc)
	Struct Color                                                 Color;                                             // 0x2c(0x4)
	Class Actor*                                                 Actor;                                             // 0x30(0x8)
	Class MaterialInterface*                                     Material;                                          // 0x38(0x8)
	TArray<struct EmitterPoints>                                 EmitterPoints;                                     // 0x40(0x10)
};


// Size 0x40
struct EmitterPointData
{
public:
	Struct Vector4                                               Position;                                          // 0x0(0x10)
	Struct Vector4                                               InheritedVelocity;                                 // 0x10(0x10)
	Struct Vector4                                               Orientation;                                       // 0x20(0x10)
	Struct Vector                                                Scale;                                             // 0x30(0xc)
};


// Size 0x38
struct TriMeshCollisionData
{
public:
	TArray<struct Vertices>                                      Vertices;                                          // 0x0(0x10)
	TArray<struct Indices>                                       Indices;                                           // 0x10(0x10)
	bool                                                         bFlipNormals;                                      // 0x20(0x1)
};


// Size 0xc
struct TriIndices
{
public:
	int                                                          v0;                                                // 0x0(0x4)
	int                                                          v1;                                                // 0x4(0x4)
	int                                                          v2;                                                // 0x8(0x4)
};


// Size 0x10
struct PreviewAssetAttachContainer
{
public:
	TArray<struct AttachedObjects>                               AttachedObjects;                                   // 0x0(0x10)
};


// Size 0x30
struct PreviewAttachedObjectPair
{
public:
	Class Object*                                                Object;                                            // 0x20(0x8)
	struct FName                                                 AttachedTo;                                        // 0x28(0x8)
};


// Size 0x14
struct DeformablesSettings
{
public:
	float                                                        DistanceStiffness;                                 // 0x0(0x4)
	float                                                        VolumeStiffness;                                   // 0x4(0x4)
	float                                                        Damping;                                           // 0x8(0x4)
	float                                                        MaxDistance;                                       // 0xc(0x4)
	float                                                        WeightMultiplier;                                  // 0x10(0x4)
};


// Size 0x10
struct SkeletalMaterial
{
public:
	Class MaterialInterface*                                     MaterialInterface;                                 // 0x0(0x8)
	bool                                                         bEnableShadowCasting;                              // 0x8(0x1)
};


// Size 0x40
struct ClothingAssetData
{
public:
	struct FName                                                 AssetName;                                         // 0x0(0x8)
	Struct FString                                               ApexFileName;                                      // 0x8(0x10)
	bool                                                         bClothPropertiesChanged;                           // 0x18(0x1)
	char                                                         pad0x3_FEJPP[0x3];                                 // 0x19(0x3)
	Struct ClothPhysicsProperties                                PhysicsProperties;                                 // 0x1c(0x24)
};


// Size 0x24
struct ClothPhysicsProperties
{
public:
	float                                                        BendResistance;                                    // 0x0(0x4)
	float                                                        ShearResistance;                                   // 0x4(0x4)
	float                                                        StretchLimit;                                      // 0x8(0x4)
	float                                                        Friction;                                          // 0xc(0x4)
	float                                                        Damping;                                           // 0x10(0x4)
	float                                                        Drag;                                              // 0x14(0x4)
	float                                                        GravityScale;                                      // 0x18(0x4)
	float                                                        InertiaBlend;                                      // 0x1c(0x4)
	float                                                        SelfCollisionThickness;                            // 0x20(0x4)
};


// Size 0x10
struct MorphTargetMap
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	Class MorphTarget*                                           MorphTarget;                                       // 0x8(0x8)
};


// Size 0xf0
struct SkeletalMeshLODInfo
{
public:
	float                                                        ScreenSize;                                        // 0x0(0x4)
	float                                                        LODHysteresis;                                     // 0x4(0x4)
	TArray<Int LODMaterialMap>                                   LODMaterialMap;                                    // 0x8(0x10)
	TArray<struct TriangleSortSettings>                          TriangleSortSettings;                              // 0x18(0x10)
	bool                                                         bHasBeenSimplified;                                // 0x28(0x1)
	char                                                         pad0x7_XV0GA[0x7];                                 // 0x29(0x7)
	Struct SkeletalMeshOptimizationSettings                      ReductionSettings;                                 // 0x30(0x70)
	Struct SimplygonRemeshingSettings                            RemeshingSettings;                                 // 0xa0(0x50)
};


// Size 0x70
struct SkeletalMeshOptimizationSettings
{
public:
	byte                                                         ReductionMethod;                                   // 0x0(0x1)
	char                                                         pad0x3_RXIJI[0x3];                                 // 0x1(0x3)
	float                                                        NumOfTrianglesPercentage;                          // 0x4(0x4)
	float                                                        MaxDeviationPercentage;                            // 0x8(0x4)
	float                                                        WeldingThreshold;                                  // 0xc(0x4)
	bool                                                         bRecalcNormals;                                    // 0x10(0x1)
	char                                                         pad0x3_339H8[0x3];                                 // 0x11(0x3)
	float                                                        NormalsThreshold;                                  // 0x14(0x4)
	byte                                                         SilhouetteImportance;                              // 0x18(0x1)
	byte                                                         TextureImportance;                                 // 0x19(0x1)
	byte                                                         ShadingImportance;                                 // 0x1a(0x1)
	byte                                                         SkinningImportance;                                // 0x1b(0x1)
	float                                                        BoneReductionRatio;                                // 0x1c(0x4)
	int                                                          MaxBonesPerVertex;                                 // 0x20(0x4)
	char                                                         pad0x4_RLXMP[0x4];                                 // 0x24(0x4)
	TArray<struct BonesToRemove>                                 BonesToRemove;                                     // 0x28(0x10)
	int                                                          BaseLODModel;                                      // 0x38(0x4)
	int                                                          LODChainLastIndex;                                 // 0x3c(0x4)
	bool                                                         bForceRebuild;                                     // 0x40(0x1)
	char                                                         pad0x7_71SWS[0x7];                                 // 0x41(0x7)
	Struct SimplygonMaterialLODSettings                          MaterialLODSettings;                               // 0x48(0x28)
};


// Size 0xc
struct TriangleSortSettings
{
public:
	byte                                                         TriangleSorting;                                   // 0x0(0x1)
	byte                                                         CustomLeftRightAxis;                               // 0x1(0x1)
	char                                                         pad0x2_MHK3F[0x2];                                 // 0x2(0x2)
	struct FName                                                 CustomLeftRightBoneName;                           // 0x4(0x8)
};


// Size 0x14
struct BoneMirrorExport
{
public:
	struct FName                                                 BoneName;                                          // 0x0(0x8)
	struct FName                                                 SourceBoneName;                                    // 0x8(0x8)
	byte                                                         BoneFlipAxis;                                      // 0x10(0x1)
};


// Size 0x8
struct BoneMirrorInfo
{
public:
	int                                                          SourceIndex;                                       // 0x0(0x4)
	byte                                                         BoneFlipAxis;                                      // 0x4(0x1)
};


// Size 0xc
struct AnimationGroupReference
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	byte                                                         GroupRole;                                         // 0x8(0x1)
};


// Size 0x40
struct RootMotionMovementParams
{
public:
	bool                                                         bHasRootMotion;                                    // 0x0(0x1)
	char                                                         pad0x3_F4RUN[0x3];                                 // 0x1(0x3)
	float                                                        BlendWeight;                                       // 0x4(0x4)
	char                                                         pad0x8_ZYEEE[0x8];                                 // 0x8(0x8)
	Struct Transform                                             RootMotionTransform;                               // 0x10(0x30)
};


// Size 0x18
struct AnimGroupInstance
{
public:
};


// Size 0x40
struct AnimTickRecord
{
public:
	Class AnimationAsset*                                        SourceAsset;                                       // 0x0(0x8)
};


// Size 0x8
struct AnimExtractContext
{
public:
	bool                                                         bExtractRootMotion;                                // 0x0(0x1)
	char                                                         pad0x3_UZ7VV[0x3];                                 // 0x1(0x3)
	float                                                        CurrentTime;                                       // 0x4(0x4)
};


// Size 0x90
struct BlendFilter
{
public:
};


// Size 0x20
struct BlendSampleData
{
public:
	int                                                          SampleDataIndex;                                   // 0x0(0x4)
	float                                                        TotalWeight;                                       // 0x4(0x4)
	float                                                        Time;                                              // 0x8(0x4)
};


// Size 0x38
struct BasedMovementInfo
{
public:
	Class PrimitiveComponent*                                    MovementBase;                                      // 0x0(0x8)
	struct FName                                                 BoneName;                                          // 0x8(0x8)
	Struct Vector_NetQuantize100                                 Location;                                          // 0x10(0xc)
	Struct Rotator                                               Rotation;                                          // 0x1c(0xc)
	bool                                                         bServerHasBaseComponent;                           // 0x28(0x1)
	bool                                                         bRelativeRotation;                                 // 0x29(0x1)
	char                                                         pad0x2_9MZUS[0x2];                                 // 0x2a(0x2)
	Struct Vector                                                LinearVelocity;                                    // 0x2c(0xc)
};


// Size 0x48
struct SimulatedRootMotionReplicatedMove
{
public:
	float                                                        Time;                                              // 0x0(0x4)
	char                                                         pad0x4_6EIE2[0x4];                                 // 0x4(0x4)
	Struct RepRootMotionMontage                                  RootMotion;                                        // 0x8(0x40)
};


// Size 0x40
struct RepRootMotionMontage
{
public:
	Class AnimMontage*                                           AnimMontage;                                       // 0x0(0x8)
	float                                                        Position;                                          // 0x8(0x4)
	Struct Vector_NetQuantize10                                  Location;                                          // 0xc(0xc)
	Struct Rotator                                               Rotation;                                          // 0x18(0xc)
	char                                                         pad0x4_G4QLV[0x4];                                 // 0x24(0x4)
	Class PrimitiveComponent*                                    MovementBase;                                      // 0x28(0x8)
	struct FName                                                 MovementBaseBoneName;                              // 0x30(0x8)
	bool                                                         bRelativePosition;                                 // 0x38(0x1)
	bool                                                         bRelativeRotation;                                 // 0x39(0x1)
};


// Size 0x10
struct SkelMeshComponentLODInfo
{
public:
	TArray<Bool HiddenMaterials>                                 HiddenMaterials;                                   // 0x0(0x10)
};


// Size 0x10
struct ActiveVertexAnim
{
public:
	Class VertexAnimBase*                                        VertAnim;                                          // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	float                                                        Time;                                              // 0xc(0x4)
};


// Size 0x160
struct ConstraintInstance
{
public:
	Class SceneComponent*                                        OwnerComponent;                                    // 0x8(0x8)
	char                                                         pad0xc_Z9DD1[0xc];                                 // 0x10(0xc)
	struct FName                                                 JointName;                                         // 0x1c(0x8)
	struct FName                                                 ConstraintBone1;                                   // 0x24(0x8)
	struct FName                                                 ConstraintBone2;                                   // 0x2c(0x8)
	Struct Vector                                                Pos1;                                              // 0x34(0xc)
	Struct Vector                                                PriAxis1;                                          // 0x40(0xc)
	Struct Vector                                                SecAxis1;                                          // 0x4c(0xc)
	Struct Vector                                                Pos2;                                              // 0x58(0xc)
	Struct Vector                                                PriAxis2;                                          // 0x64(0xc)
	Struct Vector                                                SecAxis2;                                          // 0x70(0xc)
	bool                                                         bDisableCollision;                                 // 0x7c(0x1)
	bool                                                         bEnableProjection;                                 // 0x7c(0x1)
	char                                                         pad0x3_GFFM1[0x3];                                 // 0x7d(0x3)
	float                                                        ProjectionLinearTolerance;                         // 0x80(0x4)
	float                                                        ProjectionAngularTolerance;                        // 0x84(0x4)
	byte                                                         LinearXMotion;                                     // 0x88(0x1)
	byte                                                         LinearYMotion;                                     // 0x89(0x1)
	byte                                                         LinearZMotion;                                     // 0x8a(0x1)
	char                                                         pad0x1_P2FVW[0x1];                                 // 0x8b(0x1)
	float                                                        LinearLimitSize;                                   // 0x8c(0x4)
	bool                                                         bLinearLimitSoft;                                  // 0x90(0x1)
	char                                                         pad0x3_XAUKB[0x3];                                 // 0x91(0x3)
	float                                                        LinearLimitStiffness;                              // 0x94(0x4)
	float                                                        LinearLimitDamping;                                // 0x98(0x4)
	bool                                                         bLinearBreakable;                                  // 0x9c(0x1)
	char                                                         pad0x3_XQJNL[0x3];                                 // 0x9d(0x3)
	float                                                        LinearBreakThreshold;                              // 0xa0(0x4)
	byte                                                         AngularSwing1Motion;                               // 0xa4(0x1)
	byte                                                         AngularTwistMotion;                                // 0xa5(0x1)
	byte                                                         AngularSwing2Motion;                               // 0xa6(0x1)
	char                                                         pad0x1_RSQG0[0x1];                                 // 0xa7(0x1)
	bool                                                         bSwingLimitSoft;                                   // 0xa8(0x1)
	bool                                                         bTwistLimitSoft;                                   // 0xa8(0x1)
	char                                                         pad0x3_X8PWC[0x3];                                 // 0xa9(0x3)
	float                                                        Swing1LimitAngle;                                  // 0xac(0x4)
	float                                                        TwistLimitAngle;                                   // 0xb0(0x4)
	float                                                        Swing2LimitAngle;                                  // 0xb4(0x4)
	float                                                        SwingLimitStiffness;                               // 0xb8(0x4)
	float                                                        SwingLimitDamping;                                 // 0xbc(0x4)
	float                                                        TwistLimitStiffness;                               // 0xc0(0x4)
	float                                                        TwistLimitDamping;                                 // 0xc4(0x4)
	Struct Rotator                                               AngularRotationOffset;                             // 0xc8(0xc)
	bool                                                         bAngularBreakable;                                 // 0xd4(0x1)
	char                                                         pad0x3_GM2AJ[0x3];                                 // 0xd5(0x3)
	float                                                        AngularBreakThreshold;                             // 0xd8(0x4)
	bool                                                         bLinearXPositionDrive;                             // 0xdc(0x1)
	bool                                                         bLinearXVelocityDrive;                             // 0xdc(0x1)
	bool                                                         bLinearYPositionDrive;                             // 0xdc(0x1)
	bool                                                         bLinearYVelocityDrive;                             // 0xdc(0x1)
	bool                                                         bLinearZPositionDrive;                             // 0xdc(0x1)
	bool                                                         bLinearZVelocityDrive;                             // 0xdc(0x1)
	bool                                                         bLinearPositionDrive;                              // 0xdc(0x1)
	bool                                                         bLinearVelocityDrive;                              // 0xdc(0x1)
	char                                                         pad0x3_7S73B[0x3];                                 // 0xdd(0x3)
	Struct Vector                                                LinearPositionTarget;                              // 0xe0(0xc)
	Struct Vector                                                LinearVelocityTarget;                              // 0xec(0xc)
	float                                                        LinearDriveSpring;                                 // 0xf8(0x4)
	float                                                        LinearDriveDamping;                                // 0xfc(0x4)
	float                                                        LinearDriveForceLimit;                             // 0x100(0x4)
	bool                                                         bSwingPositionDrive;                               // 0x104(0x1)
	bool                                                         bSwingVelocityDrive;                               // 0x104(0x1)
	bool                                                         bTwistPositionDrive;                               // 0x104(0x1)
	bool                                                         bTwistVelocityDrive;                               // 0x104(0x1)
	bool                                                         bAngularSlerpDrive;                                // 0x104(0x1)
	bool                                                         bAngularOrientationDrive;                          // 0x104(0x1)
	bool                                                         bEnableSwingDrive;                                 // 0x104(0x1)
	bool                                                         bEnableTwistDrive;                                 // 0x104(0x1)
	bool                                                         bAngularVelocityDrive;                             // 0x105(0x1)
	char                                                         pad0xa_D08ON[0xa];                                 // 0x106(0xa)
	Struct Quat                                                  AngularPositionTarget;                             // 0x110(0x10)
	byte                                                         AngularDriveMode;                                  // 0x120(0x1)
	char                                                         pad0x3_83C1B[0x3];                                 // 0x121(0x3)
	Struct Rotator                                               AngularOrientationTarget;                          // 0x124(0xc)
	Struct Vector                                                AngularVelocityTarget;                             // 0x130(0xc)
	float                                                        AngularDriveSpring;                                // 0x13c(0x4)
	float                                                        AngularDriveDamping;                               // 0x140(0x4)
	float                                                        AngularDriveForceLimit;                            // 0x144(0x4)
};


// Size 0x50
struct SmartNameContainer
{
public:
};


// Size 0x68
struct SmartNameMapping
{
public:
};


// Size 0x18
struct AnimSlotGroup
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	TArray<struct FName>                                         SlotNames;                                         // 0x8(0x10)
};


// Size 0x18
struct RigConfiguration
{
public:
	Class Rig*                                                   Rig;                                               // 0x0(0x8)
	TArray<struct BoneMappingTable>                              BoneMappingTable;                                  // 0x8(0x10)
};


// Size 0x10
struct NameMapping
{
public:
	struct FName                                                 NodeName;                                          // 0x0(0x8)
	struct FName                                                 BoneName;                                          // 0x8(0x8)
};


// Size 0x10
struct BoneReductionSetting
{
public:
	TArray<struct FName>                                         BonesToRemove;                                     // 0x0(0x10)
};


// Size 0x18
struct ReferencePose
{
public:
	struct FName                                                 PoseName;                                          // 0x0(0x8)
	TArray<struct ReferencePose>                                 ReferencePose;                                     // 0x8(0x10)
};


// Size 0x1
struct BoneNode
{
public:
	byte                                                         TranslationRetargetingMode;                        // 0x0(0x1)
};


// Size 0x20
struct SkeletonToMeshLinkup
{
public:
	TArray<Int SkeletonToMeshTable>                              SkeletonToMeshTable;                               // 0x0(0x10)
	TArray<Int MeshToSkeletonTable>                              MeshToSkeletonTable;                               // 0x10(0x10)
};


// Size 0x30
struct AnimLinkableElement
{
public:
	Class AnimMontage*                                           LinkedMontage;                                     // 0x8(0x8)
	int                                                          SlotIndex;                                         // 0x10(0x4)
	int                                                          SegmentIndex;                                      // 0x14(0x4)
	byte                                                         LinkMethod;                                        // 0x18(0x1)
	byte                                                         CachedLinkMethod;                                  // 0x19(0x1)
	char                                                         pad0x2_NOK79[0x2];                                 // 0x1a(0x2)
	float                                                        SegmentBeginTime;                                  // 0x1c(0x4)
	float                                                        SegmentLength;                                     // 0x20(0x4)
	float                                                        LinkValue;                                         // 0x24(0x4)
	Class AnimSequenceBase*                                      LinkedSequence;                                    // 0x28(0x8)
};


// Size 0x28
struct AnimNotifyTrack
{
public:
	struct FName                                                 TrackName;                                         // 0x0(0x8)
	Struct LinearColor                                           TrackColor;                                        // 0x8(0x10)
};


// Size 0xb0
struct AnimNotifyEvent
{
public:
	float                                                        DisplayTime;                                       // 0x30(0x4)
	float                                                        TriggerTimeOffset;                                 // 0x34(0x4)
	float                                                        EndTriggerTimeOffset;                              // 0x38(0x4)
	float                                                        TriggerWeightThreshold;                            // 0x3c(0x4)
	struct FName                                                 NotifyName;                                        // 0x40(0x8)
	Class AnimNotify*                                            Notify;                                            // 0x48(0x8)
	Class AnimNotifyState*                                       NotifyStateClass;                                  // 0x50(0x8)
	Class AnimNotifyCondition*                                   NotifyCondition;                                   // 0x58(0x8)
	float                                                        Duration;                                          // 0x60(0x4)
	char                                                         pad0x4_SUG23[0x4];                                 // 0x64(0x4)
	Struct AnimLinkableElement                                   EndLink;                                           // 0x68(0x30)
	bool                                                         bConvertedFromBranchingPoint;                      // 0x98(0x1)
	byte                                                         MontageTickType;                                   // 0x99(0x1)
	char                                                         pad0x2_6Y93H[0x2];                                 // 0x9a(0x2)
	float                                                        NotifyTriggerChance;                               // 0x9c(0x4)
	byte                                                         NotifyFilterType;                                  // 0xa0(0x1)
	char                                                         pad0x3_SEE7C[0x3];                                 // 0xa1(0x3)
	int                                                          NotifyFilterLOD;                                   // 0xa4(0x4)
	int                                                          TrackIndex;                                        // 0xa8(0x4)
};


// Size 0x10
struct RawCurveTracks
{
public:
	TArray<struct FloatCurves>                                   FloatCurves;                                       // 0x0(0x10)
};


// Size 0x90
struct FloatCurve
{
public:
	Struct RichCurve                                             FloatCurve;                                        // 0x18(0x78)
};


// Size 0x18
struct AnimCurveBase
{
public:
	struct FName                                                 LastObservedName;                                  // 0x8(0x8)
	char                                                         pad0x4_JW73X[0x4];                                 // 0x10(0x4)
	int                                                          CurveTypeFlags;                                    // 0x14(0x4)
};


// Size 0x498
struct TransformCurve
{
public:
	Struct VectorCurve                                           TranslationCurve;                                  // 0x18(0x180)
	Struct VectorCurve                                           RotationCurve;                                     // 0x198(0x180)
	Struct VectorCurve                                           ScaleCurve;                                        // 0x318(0x180)
};


// Size 0x180
struct VectorCurve
{
public:
	Struct RichCurve                                             FloatCurves;                                       // 0x18(0x78)
};


// Size 0x50
struct SkeletalMeshComponentPreClothTickFunction
{
public:
};


// Size 0x20
struct SingleAnimationPlayData
{
public:
	Class AnimationAsset*                                        AnimToPlay;                                        // 0x0(0x8)
	Class VertexAnimation*                                       VertexAnimToPlay;                                  // 0x8(0x8)
	bool                                                         bSavedLooping;                                     // 0x10(0x1)
	bool                                                         bSavedPlaying;                                     // 0x10(0x1)
	char                                                         pad0x3_ZNT0H[0x3];                                 // 0x11(0x3)
	float                                                        SavedPosition;                                     // 0x14(0x4)
	float                                                        SavedPlayRate;                                     // 0x18(0x4)
};


// Size 0x10
struct AnimTrack
{
public:
	TArray<struct AnimSegments>                                  AnimSegments;                                      // 0x0(0x10)
};


// Size 0x20
struct AnimSegment
{
public:
	Class AnimSequenceBase*                                      AnimReference;                                     // 0x0(0x8)
	float                                                        StartPos;                                          // 0x8(0x4)
	float                                                        AnimStartTime;                                     // 0xc(0x4)
	float                                                        AnimEndTime;                                       // 0x10(0x4)
	float                                                        AnimPlayRate;                                      // 0x14(0x4)
	int                                                          LoopingCount;                                      // 0x18(0x4)
};


// Size 0x10
struct RootMotionExtractionStep
{
public:
	Class AnimSequence*                                          AnimSequence;                                      // 0x0(0x8)
	float                                                        StartPosition;                                     // 0x8(0x4)
	float                                                        EndPosition;                                       // 0xc(0x4)
};


// Size 0x30
struct AlphaBlend
{
public:
	byte                                                         BlendOption;                                       // 0x0(0x1)
	char                                                         pad0x3_3HGAG[0x3];                                 // 0x1(0x3)
	float                                                        BeginValue;                                        // 0x4(0x4)
	float                                                        DesiredValue;                                      // 0x8(0x4)
	float                                                        BlendTime;                                         // 0xc(0x4)
	Class CurveFloat*                                            CustomCurve;                                       // 0x10(0x8)
	float                                                        AlphaLerp;                                         // 0x18(0x4)
	float                                                        AlphaBlend;                                        // 0x1c(0x4)
	float                                                        AlphaTarget;                                       // 0x20(0x4)
	float                                                        BlendTimeRemaining;                                // 0x24(0x4)
	float                                                        BlendedValue;                                      // 0x28(0x4)
};


// Size 0x30
struct BakedAnimationStateMachine
{
public:
	struct FName                                                 MachineName;                                       // 0x0(0x8)
	int                                                          InitialState;                                      // 0x8(0x4)
	char                                                         pad0x4_O2K88[0x4];                                 // 0xc(0x4)
	TArray<struct States>                                        States;                                            // 0x10(0x10)
	TArray<struct Transitions>                                   Transitions;                                       // 0x20(0x10)
};


// Size 0x38
struct AnimationTransitionBetweenStates
{
public:
	int                                                          PreviousState;                                     // 0x8(0x4)
	int                                                          NextState;                                         // 0xc(0x4)
	float                                                        CrossfadeDuration;                                 // 0x10(0x4)
	int                                                          StartNotify;                                       // 0x14(0x4)
	int                                                          EndNotify;                                         // 0x18(0x4)
	int                                                          InterruptNotify;                                   // 0x1c(0x4)
	byte                                                         BlendMode;                                         // 0x20(0x1)
	char                                                         pad0x7_95FDE[0x7];                                 // 0x21(0x7)
	Class CurveFloat*                                            CustomCurve;                                       // 0x28(0x8)
	byte                                                         LogicType;                                         // 0x30(0x1)
};


// Size 0x8
struct AnimationStateBase
{
public:
	struct FName                                                 StateName;                                         // 0x0(0x8)
};


// Size 0x50
struct BakedAnimationState
{
public:
	struct FName                                                 StateName;                                         // 0x0(0x8)
	struct FName                                                 PathedStateName;                                   // 0x8(0x8)
	TArray<struct Transitions>                                   Transitions;                                       // 0x10(0x10)
	int                                                          StateRootNodeIndex;                                // 0x20(0x4)
	int                                                          StartNotify;                                       // 0x24(0x4)
	int                                                          EndNotify;                                         // 0x28(0x4)
	int                                                          FullyBlendedNotify;                                // 0x2c(0x4)
	bool                                                         bIsAConduit;                                       // 0x30(0x1)
	char                                                         pad0x3_B2OIY[0x3];                                 // 0x31(0x3)
	int                                                          EntryRuleNodeIndex;                                // 0x34(0x4)
	TArray<Int PlayerNodeIndices>                                PlayerNodeIndices;                                 // 0x38(0x10)
	bool                                                         CanBeReEntered;                                    // 0x48(0x1)
};


// Size 0x20
struct BakedStateExitTransition
{
public:
	int                                                          CanTakeDelegateIndex;                              // 0x0(0x4)
	int                                                          CustomResultNodeIndex;                             // 0x4(0x4)
	int                                                          TransitionIndex;                                   // 0x8(0x4)
	bool                                                         bDesiredTransitionReturnValue;                     // 0xc(0x1)
	bool                                                         bAutomaticRemainingTimeRule;                       // 0xd(0x1)
	char                                                         pad0x2_ZST53[0x2];                                 // 0xe(0x2)
	TArray<Int PoseEvaluatorLinks>                               PoseEvaluatorLinks;                                // 0x10(0x10)
};


// Size 0x28
struct AnimationState
{
public:
	TArray<struct Transitions>                                   Transitions;                                       // 0x8(0x10)
	int                                                          StateRootNodeIndex;                                // 0x18(0x4)
	int                                                          StartNotify;                                       // 0x1c(0x4)
	int                                                          EndNotify;                                         // 0x20(0x4)
	int                                                          FullyBlendedNotify;                                // 0x24(0x4)
};


// Size 0x10
struct AnimationTransitionRule
{
public:
	struct FName                                                 RuleToExecute;                                     // 0x0(0x8)
	bool                                                         TransitionReturnVal;                               // 0x8(0x1)
	char                                                         pad0x3_5UNM4[0x3];                                 // 0x9(0x3)
	int                                                          TransitionIndex;                                   // 0xc(0x4)
};


// Size 0x48
struct SlotEvaluationPose
{
public:
	byte                                                         AdditiveType;                                      // 0x0(0x1)
	char                                                         pad0x3_J69MK[0x3];                                 // 0x1(0x3)
	float                                                        Weight;                                            // 0x4(0x4)
};


// Size 0x10
struct PerBoneBlendWeights
{
public:
	TArray<struct BoneBlendWeights>                              BoneBlendWeights;                                  // 0x0(0x10)
};


// Size 0x8
struct PerBoneBlendWeight
{
public:
	int                                                          SourceIndex;                                       // 0x0(0x4)
	float                                                        BlendWeight;                                       // 0x4(0x4)
};


// Size 0x28
struct A2CSPose
{
public:
	TArray<Byte ComponentSpaceFlags>                             ComponentSpaceFlags;                               // 0x18(0x10)
};


// Size 0x10
struct A2Pose
{
public:
	TArray<struct Bones>                                         Bones;                                             // 0x0(0x10)
};


// Size 0xa0
struct AnimMontageInstance
{
public:
	Class AnimMontage*                                           Montage;                                           // 0x0(0x8)
	float                                                        DesiredWeight;                                     // 0x8(0x4)
	float                                                        Weight;                                            // 0xc(0x4)
	float                                                        BlendTime;                                         // 0x10(0x4)
	float                                                        DefaultBlendTimeMultiplier;                        // 0x14(0x4)
	TArray<Int NextSections>                                     NextSections;                                      // 0x18(0x10)
	TArray<Int PrevSections>                                     PrevSections;                                      // 0x28(0x10)
	bool                                                         bPlaying;                                          // 0x38(0x1)
	char                                                         pad0x2f_KPKEB[0x2f];                               // 0x39(0x2f)
	TArray<struct ActiveStateBranchingPoints>                    ActiveStateBranchingPoints;                        // 0x68(0x10)
	float                                                        Position;                                          // 0x78(0x4)
	float                                                        PlayRate;                                          // 0x7c(0x4)
};


// Size 0xc
struct BranchingPointMarker
{
public:
	int                                                          NotifyIndex;                                       // 0x0(0x4)
	float                                                        TriggerTime;                                       // 0x4(0x4)
	byte                                                         NotifyEventType;                                   // 0x8(0x1)
};


// Size 0x40
struct BranchingPoint
{
public:
	struct FName                                                 EventName;                                         // 0x30(0x8)
	float                                                        DisplayTime;                                       // 0x38(0x4)
	float                                                        TriggerTimeOffset;                                 // 0x3c(0x4)
};


// Size 0x18
struct SlotAnimationTrack
{
public:
	struct FName                                                 SlotName;                                          // 0x0(0x8)
	Struct AnimTrack                                             AnimTrack;                                         // 0x8(0x10)
};


// Size 0x58
struct CompositeSection
{
public:
	struct FName                                                 SectionName;                                       // 0x30(0x8)
	float                                                        StartTime;                                         // 0x38(0x4)
	struct FName                                                 NextSectionName;                                   // 0x3c(0x8)
	char                                                         pad0x4_BNGKK[0x4];                                 // 0x44(0x4)
	TArray<class AnimMetaData*>                                  MetaData;                                          // 0x48(0x10)
};


// Size 0x4
struct NavAvoidanceMask
{
public:
	bool                                                         bGroup0;                                           // 0x0(0x1)
	bool                                                         bGroup1;                                           // 0x0(0x1)
	bool                                                         bGroup2;                                           // 0x0(0x1)
	bool                                                         bGroup3;                                           // 0x0(0x1)
	bool                                                         bGroup4;                                           // 0x0(0x1)
	bool                                                         bGroup5;                                           // 0x0(0x1)
	bool                                                         bGroup6;                                           // 0x0(0x1)
	bool                                                         bGroup7;                                           // 0x0(0x1)
	bool                                                         bGroup8;                                           // 0x1(0x1)
	bool                                                         bGroup9;                                           // 0x1(0x1)
	bool                                                         bGroup10;                                          // 0x1(0x1)
	bool                                                         bGroup11;                                          // 0x1(0x1)
	bool                                                         bGroup12;                                          // 0x1(0x1)
	bool                                                         bGroup13;                                          // 0x1(0x1)
	bool                                                         bGroup14;                                          // 0x1(0x1)
	bool                                                         bGroup15;                                          // 0x1(0x1)
	bool                                                         bGroup16;                                          // 0x2(0x1)
	bool                                                         bGroup17;                                          // 0x2(0x1)
	bool                                                         bGroup18;                                          // 0x2(0x1)
	bool                                                         bGroup19;                                          // 0x2(0x1)
	bool                                                         bGroup20;                                          // 0x2(0x1)
	bool                                                         bGroup21;                                          // 0x2(0x1)
	bool                                                         bGroup22;                                          // 0x2(0x1)
	bool                                                         bGroup23;                                          // 0x2(0x1)
	bool                                                         bGroup24;                                          // 0x3(0x1)
	bool                                                         bGroup25;                                          // 0x3(0x1)
	bool                                                         bGroup26;                                          // 0x3(0x1)
	bool                                                         bGroup27;                                          // 0x3(0x1)
	bool                                                         bGroup28;                                          // 0x3(0x1)
	bool                                                         bGroup29;                                          // 0x3(0x1)
	bool                                                         bGroup30;                                          // 0x3(0x1)
	bool                                                         bGroup31;                                          // 0x3(0x1)
};


// Size 0x50
struct CharacterMovementComponentPreClothTickFunction
{
public:
};


// Size 0x8c
struct FindFloorResult
{
public:
	bool                                                         bBlockingHit;                                      // 0x0(0x1)
	bool                                                         bWalkableFloor;                                    // 0x0(0x1)
	bool                                                         bLineTrace;                                        // 0x0(0x1)
	char                                                         pad0x3_RMBD0[0x3];                                 // 0x1(0x3)
	float                                                        FloorDist;                                         // 0x4(0x4)
	float                                                        LineDist;                                          // 0x8(0x4)
	Struct HitResult                                             HitResult;                                         // 0xc(0x80)
};


// Size 0x2c
struct AtmospherePrecomputeParameters
{
public:
	float                                                        DensityHeight;                                     // 0x0(0x4)
	float                                                        DecayHeight;                                       // 0x4(0x4)
	int                                                          MaxScatteringOrder;                                // 0x8(0x4)
	int                                                          TransmittanceTexWidth;                             // 0xc(0x4)
	int                                                          TransmittanceTexHeight;                            // 0x10(0x4)
	int                                                          IrradianceTexWidth;                                // 0x14(0x4)
	int                                                          IrradianceTexHeight;                               // 0x18(0x4)
	int                                                          InscatterAltitudeSampleNum;                        // 0x1c(0x4)
	int                                                          InscatterMuNum;                                    // 0x20(0x4)
	int                                                          InscatterMuSNum;                                   // 0x24(0x4)
	int                                                          InscatterNuNum;                                    // 0x28(0x4)
};


// Size 0xc0
struct AttenuationSettings
{
public:
	bool                                                         bAttenuate;                                        // 0x0(0x1)
	bool                                                         bSpatialize;                                       // 0x0(0x1)
	bool                                                         bAttenuateWithLPF;                                 // 0x0(0x1)
	char                                                         pad0x3_J9580[0x3];                                 // 0x1(0x3)
	byte                                                         DistanceAlgorithm;                                 // 0x4(0x1)
	char                                                         pad0x3_ES8ZC[0x3];                                 // 0x5(0x3)
	Struct RuntimeFloatCurve                                     CustomAttenuationCurve;                            // 0x8(0x80)
	byte                                                         DistanceType;                                      // 0x88(0x1)
	byte                                                         AttenuationShape;                                  // 0x89(0x1)
	char                                                         pad0x2_33HN6[0x2];                                 // 0x8a(0x2)
	float                                                        dBAttenuationAtMax;                                // 0x8c(0x4)
	float                                                        OmniRadius;                                        // 0x90(0x4)
	byte                                                         SpatializationAlgorithm;                           // 0x94(0x1)
	char                                                         pad0x3_2GC07[0x3];                                 // 0x95(0x3)
	float                                                        RadiusMin;                                         // 0x98(0x4)
	float                                                        RadiusMax;                                         // 0x9c(0x4)
	Struct Vector                                                AttenuationShapeExtents;                           // 0xa0(0xc)
	float                                                        ConeOffset;                                        // 0xac(0x4)
	float                                                        FalloffDistance;                                   // 0xb0(0x4)
	float                                                        LPFRadiusMin;                                      // 0xb4(0x4)
	float                                                        LPFRadiusMax;                                      // 0xb8(0x4)
};


// Size 0x20
struct AudioComponentParam
{
public:
	struct FName                                                 ParamName;                                         // 0x0(0x8)
	float                                                        FloatParam;                                        // 0x8(0x4)
	bool                                                         BoolParam;                                         // 0xc(0x1)
	char                                                         pad0x3_QJ8ZS[0x3];                                 // 0xd(0x3)
	int                                                          IntParam;                                          // 0x10(0x4)
	char                                                         pad0x4_71HXY[0x4];                                 // 0x14(0x4)
	Class SoundWave*                                             SoundWaveParam;                                    // 0x18(0x8)
};


// Size 0x130
struct FogVolumeInfo
{
public:
	Class FogVolumeComponent*                                    Component;                                         // 0x0(0x8)
	char                                                         pad0xf8_VHPOL[0xf8];                               // 0x8(0xf8)
	Class Texture*                                               VolumeTexture;                                     // 0x100(0x8)
	Class Texture*                                               MeshFogVolumeTexture;                              // 0x108(0x8)
};


// Size 0x30
struct WaterSimPlane
{
public:
	class                                                        WaterId;                                           // 0x0(0x8)
	Class Object*                                                WaterOwner;                                        // 0x8(0x8)
	Struct Plane                                                 NonFFTPlane;                                       // 0x10(0x10)
	bool                                                         bUseFFT;                                           // 0x20(0x1)
	bool                                                         bActive;                                           // 0x21(0x1)
	char                                                         pad0x2_WD9GW[0x2];                                 // 0x22(0x2)
	float                                                        FFTBasePlaneHeight;                                // 0x24(0x4)
};


// Size 0x20
struct MurkyRegion
{
public:
	bool                                                         Enabled;                                           // 0x0(0x1)
	char                                                         pad0x3_6M3UF[0x3];                                 // 0x1(0x3)
	Struct Vector                                                Position;                                          // 0x4(0xc)
	float                                                        InnerRadius;                                       // 0x10(0x4)
	float                                                        OuterRadius;                                       // 0x14(0x4)
	float                                                        Density;                                           // 0x18(0x4)
	bool                                                         IsSuperHeatedWater;                                // 0x1c(0x1)
};


// Size 0x310
struct FFTWaterComponentParams
{
public:
	Struct LinearColor                                           AmbientColour;                                     // 0x0(0x10)
	Struct LinearColor                                           WaterColour;                                       // 0x10(0x10)
	Struct LinearColor                                           ShallowWaterColour;                                // 0x20(0x10)
	Struct LinearColor                                           BackLitColour;                                     // 0x30(0x10)
	Struct LinearColor                                           FoamColour;                                        // 0x40(0x10)
	Struct LinearColor                                           FoamHighlightColour;                               // 0x50(0x10)
	float                                                        FresnelPower;                                      // 0x60(0x4)
	float                                                        SpecularBrightness;                                // 0x64(0x4)
	float                                                        FoamBrightness;                                    // 0x68(0x4)
	float                                                        ReflectionBrightness;                              // 0x6c(0x4)
	float                                                        FoamFadeStart;                                     // 0x70(0x4)
	float                                                        FoamFadeEnd;                                       // 0x74(0x4)
	bool                                                         DEBUG_Wireframe;                                   // 0x78(0x1)
	char                                                         pad0x3_3NDLX[0x3];                                 // 0x79(0x3)
	float                                                        Size;                                              // 0x7c(0x4)
	float                                                        WindSpeed;                                         // 0x80(0x4)
	float                                                        WindSpeedInEditor;                                 // 0x84(0x4)
	float                                                        CarrierWaveAmplitude;                              // 0x88(0x4)
	float                                                        CarrierWaveWaveLength;                             // 0x8c(0x4)
	float                                                        CarrierWavePropagationSpeed;                       // 0x90(0x4)
	float                                                        HorizonFadeDistance;                               // 0x94(0x4)
	float                                                        HorizonDarkenStart;                                // 0x98(0x4)
	float                                                        HorizonDarkenRange;                                // 0x9c(0x4)
	float                                                        CloudShadowDarkenStart;                            // 0xa0(0x4)
	float                                                        CloudShadowDarkenRange;                            // 0xa4(0x4)
	float                                                        CausticsDepth;                                     // 0xa8(0x4)
	char                                                         pad0x4_20FLR[0x4];                                 // 0xac(0x4)
	Class Texture*                                               FoamColourTex;                                     // 0xb0(0x8)
	Struct FFTWaterComponentParticleParams                       ParticleParams;                                    // 0xb8(0x248)
	float                                                        ExtendedPlaneSize;                                 // 0x300(0x4)
	float                                                        ExtendedPlaneFadeDistance;                         // 0x304(0x4)
	Struct Vector2D                                              PositionOffset;                                    // 0x308(0x8)
};


// Size 0x248
struct FFTWaterComponentParticleParams
{
public:
	int                                                          MaxParticlesPerFrame;                              // 0x0(0x4)
	char                                                         pad0x4_XVFTS[0x4];                                 // 0x4(0x4)
	Struct FFTWaterComponentWaveParticleType                     WaveParticles;                                     // 0x8(0x38)
	char                                                         pad0xa8_C4AS3[0xa8];                               // 0x40(0xa8)
	Struct FFTWaterComponentIntersectParticleType                IntersectionParticles;                             // 0xe8(0x58)
};


// Size 0x58
struct FFTWaterComponentIntersectParticleType
{
public:
	Struct Vector2D                                              VelocityRange;                                     // 0x0(0x8)
	Struct Vector2D                                              FoamRange;                                         // 0x8(0x8)
	Struct Vector2D                                              HeightRange;                                       // 0x10(0x8)
	Struct Vector2D                                              ParticleWaveVelocityRange;                         // 0x18(0x8)
	Struct Vector2D                                              ParticleWaveAbsoluteSpeedDifferenceRange;          // 0x20(0x8)
	float                                                        Density;                                           // 0x28(0x4)
	float                                                        VolumeHorizontalVelocityWeight;                    // 0x2c(0x4)
	float                                                        HorizontalDirectionFromVolumeWeight;               // 0x30(0x4)
	float                                                        HorizontalRandomVelocityWeight;                    // 0x34(0x4)
	float                                                        VolumeVerticalVelocityWeight;                      // 0x38(0x4)
	float                                                        VerticalRandomVelocityWeight;                      // 0x3c(0x4)
	float                                                        WaterVelocityWeight;                               // 0x40(0x4)
	float                                                        VelocityScaling;                                   // 0x44(0x4)
	bool                                                         UnderwaterParticles;                               // 0x48(0x1)
	char                                                         pad0x7_L70X2[0x7];                                 // 0x49(0x7)
	Class ParticleComputeShaderData*                             ParticleComputeShaderData;                         // 0x50(0x8)
};


// Size 0x38
struct FFTWaterComponentWaveParticleType
{
public:
	Struct Vector2D                                              SpawnRadiusRange;                                  // 0x0(0x8)
	Struct Vector2D                                              FoamRange;                                         // 0x8(0x8)
	Struct Vector2D                                              HeightRange;                                       // 0x10(0x8)
	Struct Vector2D                                              AngleRange;                                        // 0x18(0x8)
	Struct Vector2D                                              CalmWaterDampeningFactorRange;                     // 0x20(0x8)
	float                                                        Density;                                           // 0x28(0x4)
	char                                                         pad0x4_Q1US1[0x4];                                 // 0x2c(0x4)
	Class ParticleComputeShaderData*                             ParticleComputeShaderData;                         // 0x30(0x8)
};


// Size 0x28
struct BatchedPoint
{
public:
	Struct Vector                                                Position;                                          // 0x0(0xc)
	Struct LinearColor                                           Color;                                             // 0xc(0x10)
	float                                                        PointSize;                                         // 0x1c(0x4)
	float                                                        RemainingLifeTime;                                 // 0x20(0x4)
	byte                                                         DepthPriority;                                     // 0x24(0x1)
};


// Size 0x34
struct BatchedLine
{
public:
	Struct Vector                                                Start;                                             // 0x0(0xc)
	Struct Vector                                                End;                                               // 0xc(0xc)
	Struct LinearColor                                           Color;                                             // 0x18(0x10)
	float                                                        Thickness;                                         // 0x28(0x4)
	float                                                        RemainingLifeTime;                                 // 0x2c(0x4)
	byte                                                         DepthPriority;                                     // 0x30(0x1)
};


// Size 0x28
struct MaterialSpriteElement
{
public:
	Class MaterialInterface*                                     Material;                                          // 0x0(0x8)
	Class CurveFloat*                                            DistanceToOpacityCurve;                            // 0x8(0x8)
	bool                                                         bSizeIsInScreenSpace;                              // 0x10(0x1)
	char                                                         pad0x3_0T6NL[0x3];                                 // 0x11(0x3)
	float                                                        BaseSizeX;                                         // 0x14(0x4)
	float                                                        BaseSizeY;                                         // 0x18(0x4)
	char                                                         pad0x4_XUPS6[0x4];                                 // 0x1c(0x4)
	Class CurveFloat*                                            DistanceToSizeCurve;                               // 0x20(0x8)
};


// Size 0x18
struct CustomProfile
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	TArray<struct CustomResponses>                               CustomResponses;                                   // 0x8(0x10)
};


// Size 0x10
struct CustomChannelSetup
{
public:
	byte                                                         Channel;                                           // 0x0(0x1)
	char                                                         pad0x3_CA1SW[0x3];                                 // 0x1(0x3)
	struct FName                                                 Name;                                              // 0x4(0x8)
	byte                                                         DefaultResponse;                                   // 0xc(0x1)
	bool                                                         bTraceType;                                        // 0xd(0x1)
	bool                                                         bStaticObject;                                     // 0xe(0x1)
};


// Size 0x60
struct CollisionResponseTemplate
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	byte                                                         CollisionEnabled;                                  // 0x8(0x1)
	char                                                         pad0x3_QX68E[0x3];                                 // 0x9(0x3)
	struct FName                                                 ObjectTypeName;                                    // 0xc(0x8)
	char                                                         pad0x4_SZJER[0x4];                                 // 0x14(0x4)
	TArray<struct CustomResponses>                               CustomResponses;                                   // 0x18(0x10)
	Struct FString                                               HelpMessage;                                       // 0x28(0x10)
	bool                                                         bCanModify;                                        // 0x38(0x1)
};


// Size 0x28
struct AssetEditorOrbitCameraPosition
{
public:
	bool                                                         bIsSet;                                            // 0x0(0x1)
	char                                                         pad0x3_XOUR3[0x3];                                 // 0x1(0x3)
	Struct Vector                                                CamOrbitPoint;                                     // 0x4(0xc)
	Struct Vector                                                CamOrbitZoom;                                      // 0x10(0xc)
	Struct Rotator                                               CamOrbitRotation;                                  // 0x1c(0xc)
};


// Size 0x50
struct MeshSectionInfoMap
{
public:
};


// Size 0x8
struct MeshSectionInfo
{
public:
	int                                                          MaterialIndex;                                     // 0x0(0x4)
	bool                                                         bEnableCollision;                                  // 0x4(0x1)
	bool                                                         bCastShadow;                                       // 0x5(0x1)
};


// Size 0xf8
struct StaticMeshSourceModel
{
public:
	Struct MeshBuildSettings                                     BuildSettings;                                     // 0x0(0x40)
	Struct MeshReductionSettings                                 ReductionSettings;                                 // 0x40(0x58)
	Struct SimplygonRemeshingSettings                            RemeshingSettings;                                 // 0x98(0x50)
	int                                                          OverriddenLightMapRes;                             // 0xe8(0x4)
	float                                                        LODDistance;                                       // 0xec(0x4)
	float                                                        ScreenSize;                                        // 0xf0(0x4)
	float                                                        MaxDeviation;                                      // 0xf4(0x4)
};


// Size 0x1c
struct StaticMeshOptimizationSettings
{
public:
	byte                                                         ReductionMethod;                                   // 0x0(0x1)
	char                                                         pad0x3_8LW69[0x3];                                 // 0x1(0x3)
	float                                                        NumOfTrianglesPercentage;                          // 0x4(0x4)
	float                                                        MaxDeviationPercentage;                            // 0x8(0x4)
	float                                                        WeldingThreshold;                                  // 0xc(0x4)
	bool                                                         bRecalcNormals;                                    // 0x10(0x1)
	char                                                         pad0x3_YGWGL[0x3];                                 // 0x11(0x3)
	float                                                        NormalsThreshold;                                  // 0x14(0x4)
	byte                                                         SilhouetteImportance;                              // 0x18(0x1)
	byte                                                         TextureImportance;                                 // 0x19(0x1)
	byte                                                         ShadingImportance;                                 // 0x1a(0x1)
};


// Size 0x40
struct MergedCollisionComponentStaticMeshInstanceData
{
public:
	Struct Transform                                             RelativeTransform;                                 // 0x0(0x30)
	Class StaticMesh*                                            StaticMesh;                                        // 0x30(0x8)
	int                                                          OwningActorCrc32;                                  // 0x38(0x4)
};


// Size 0x28
struct StaticMeshComponentLODInfo
{
public:
	TArray<struct PaintedVertices>                               PaintedVertices;                                   // 0x10(0x10)
};


// Size 0x14
struct PaintedVertex
{
public:
	Struct Vector                                                Position;                                          // 0x0(0xc)
	Struct PackedNormal                                          Normal;                                            // 0xc(0x4)
	Struct Color                                                 Color;                                             // 0x10(0x4)
};


// Size 0x28
struct TexturePlatformData
{
public:
};


// Size 0x80
struct TextureSource
{
public:
};


// Size 0x28
struct ExternalMip
{
public:
};


// Size 0x18
struct FlatWaterMeshTextureOverride
{
public:
	Class Texture*                                               Texture;                                           // 0x10(0x8)
};


// Size 0xc
struct NameIndexPair
{
public:
};


// Size 0x8
struct InstancedCoverageMeshLOD
{
public:
	float                                                        LODReduction;                                      // 0x0(0x4)
	float                                                        DistanceToLOD;                                     // 0x4(0x4)
};


// Size 0x8
struct InstancedStaticMeshMappingInfo
{
public:
};


// Size 0x50
struct InstancedStaticMeshInstanceData
{
public:
	Struct Matrix                                                Transform;                                         // 0x0(0x40)
	Struct Vector2D                                              LightmapUVBias;                                    // 0x40(0x8)
	Struct Vector2D                                              ShadowmapUVBias;                                   // 0x48(0x8)
};


// Size 0x28
struct ClusterNode
{
public:
	Struct Vector                                                BoundMin;                                          // 0x0(0xc)
	int                                                          FirstChild;                                        // 0xc(0x4)
	Struct Vector                                                BoundMax;                                          // 0x10(0xc)
	int                                                          LastChild;                                         // 0x1c(0x4)
	int                                                          FirstInstance;                                     // 0x20(0x4)
	int                                                          LastInstance;                                      // 0x24(0x4)
};


// Size 0x8
struct MobileInstancedStaticMeshLOD
{
public:
	float                                                        LODReduction;                                      // 0x0(0x4)
	float                                                        DistanceToLOD;                                     // 0x4(0x4)
};


// Size 0x58
struct SplineMeshParams
{
public:
	Struct Vector                                                StartPos;                                          // 0x0(0xc)
	Struct Vector                                                StartTangent;                                      // 0xc(0xc)
	Struct Vector2D                                              StartScale;                                        // 0x18(0x8)
	float                                                        StartRoll;                                         // 0x20(0x4)
	Struct Vector2D                                              StartOffset;                                       // 0x24(0x8)
	Struct Vector                                                EndPos;                                            // 0x2c(0xc)
	Struct Vector                                                EndTangent;                                        // 0x38(0xc)
	Struct Vector2D                                              EndScale;                                          // 0x44(0x8)
	float                                                        EndRoll;                                           // 0x4c(0x4)
	Struct Vector2D                                              EndOffset;                                         // 0x50(0x8)
};


// Size 0x18
struct EngineShowFlagsSetting
{
public:
	Struct FString                                               ShowFlagName;                                      // 0x0(0x10)
	bool                                                         Enabled;                                           // 0x10(0x1)
};


// Size 0x98
struct Timeline
{
public:
	byte                                                         LengthMode;                                        // 0x0(0x1)
	char                                                         pad0x3_CAE9U[0x3];                                 // 0x1(0x3)
	float                                                        Length;                                            // 0x4(0x4)
	bool                                                         bLooping;                                          // 0x8(0x1)
	bool                                                         bReversePlayback;                                  // 0x8(0x1)
	bool                                                         bPlaying;                                          // 0x8(0x1)
	char                                                         pad0x3_ZFT7E[0x3];                                 // 0x9(0x3)
	float                                                        PlayRate;                                          // 0xc(0x4)
	float                                                        Position;                                          // 0x10(0x4)
	char                                                         pad0x4_MO3ZP[0x4];                                 // 0x14(0x4)
	TArray<struct Events>                                        Events;                                            // 0x18(0x10)
	TArray<struct InterpVectors>                                 InterpVectors;                                     // 0x28(0x10)
	TArray<struct InterpFloats>                                  InterpFloats;                                      // 0x38(0x10)
	TArray<struct InterpLinearColors>                            InterpLinearColors;                                // 0x48(0x10)
	struct FName                                                 DirectionPropertyName;                             // 0x88(0x8)
	Class ByteProperty*                                          DirectionProperty;                                 // 0x90(0x8)
};


// Size 0x30
struct TimelineLinearColorTrack
{
public:
	Class CurveLinearColor*                                      LinearColorCurve;                                  // 0x0(0x8)
	struct FName                                                 LinearColorPropertyName;                           // 0x18(0x8)
	Class StructProperty*                                        LinearColorProperty;                               // 0x20(0x8)
};


// Size 0x30
struct TimelineFloatTrack
{
public:
	Class CurveFloat*                                            FloatCurve;                                        // 0x0(0x8)
	struct FName                                                 FloatPropertyName;                                 // 0x18(0x8)
	Class FloatProperty*                                         FloatProperty;                                     // 0x20(0x8)
};


// Size 0x30
struct TimelineVectorTrack
{
public:
	Class CurveVector*                                           VectorCurve;                                       // 0x0(0x8)
	struct FName                                                 VectorPropertyName;                                // 0x18(0x8)
	Class StructProperty*                                        VectorProperty;                                    // 0x20(0x8)
};


// Size 0x14
struct TimelineEventEntry
{
public:
	float                                                        Time;                                              // 0x0(0x4)
};


// Size 0x18
struct CompressedOffsetData
{
public:
	TArray<Int OffsetData>                                       OffsetData;                                        // 0x0(0x10)
	int                                                          StripSize;                                         // 0x10(0x4)
};


// Size 0x38
struct CompressedTrack
{
public:
	TArray<Byte ByteStream>                                      ByteStream;                                        // 0x0(0x10)
	TArray<Float Times>                                          Times;                                             // 0x10(0x10)
	float                                                        Mins;                                              // 0x20(0x4)
	char                                                         pad0x8_8L9R1[0x8];                                 // 0x24(0x8)
	float                                                        Ranges;                                            // 0x2c(0x4)
};


// Size 0x18
struct CurveTrack
{
public:
	struct FName                                                 CurveName;                                         // 0x0(0x8)
	TArray<Float CurveWeights>                                   CurveWeights;                                      // 0x8(0x10)
};


// Size 0x20
struct ScaleTrack
{
public:
	TArray<struct ScaleKeys>                                     ScaleKeys;                                         // 0x0(0x10)
	TArray<Float Times>                                          Times;                                             // 0x10(0x10)
};


// Size 0x20
struct RotationTrack
{
public:
	TArray<struct RotKeys>                                       RotKeys;                                           // 0x0(0x10)
	TArray<Float Times>                                          Times;                                             // 0x10(0x10)
};


// Size 0x20
struct TranslationTrack
{
public:
	TArray<struct PosKeys>                                       PosKeys;                                           // 0x0(0x10)
	TArray<Float Times>                                          Times;                                             // 0x10(0x10)
};


// Size 0x4
struct TrackToSkeletonMap
{
public:
	int                                                          BoneTreeIndex;                                     // 0x0(0x4)
};


// Size 0x20
struct AnimSequenceTrackContainer
{
public:
	TArray<struct AnimationTracks>                               AnimationTracks;                                   // 0x0(0x10)
	TArray<struct FName>                                         TrackNames;                                        // 0x10(0x10)
};


// Size 0x30
struct RawAnimSequenceTrack
{
public:
	TArray<struct PosKeys>                                       PosKeys;                                           // 0x0(0x10)
	TArray<struct RotKeys>                                       RotKeys;                                           // 0x10(0x10)
	TArray<struct ScaleKeys>                                     ScaleKeys;                                         // 0x20(0x10)
};


// Size 0x10
struct PerBoneInterpolation
{
public:
	Struct BoneReference                                         BoneReference;                                     // 0x0(0xc)
	float                                                        InterpolationSpeedPerSec;                          // 0xc(0x4)
};


// Size 0x1c
struct GridBlendSample
{
public:
	Struct EditorElement                                         GridElement;                                       // 0x0(0x18)
	float                                                        BlendWeight;                                       // 0x18(0x4)
};


// Size 0x18
struct EditorElement
{
public:
	int                                                          Indices;                                           // 0x0(0x4)
	char                                                         pad0x8_YMGL5[0x8];                                 // 0x4(0x8)
	float                                                        Weights;                                           // 0xc(0x4)
};


// Size 0x18
struct BlendSample
{
public:
	Class AnimSequence*                                          Animation;                                         // 0x0(0x8)
	Struct Vector                                                SampleValue;                                       // 0x8(0xc)
};


// Size 0x20
struct BlendParameter
{
public:
	Struct FString                                               DisplayName;                                       // 0x0(0x10)
	float                                                        Min;                                               // 0x10(0x4)
	float                                                        Max;                                               // 0x14(0x4)
	int                                                          GridNum;                                           // 0x18(0x4)
};


// Size 0x8
struct InterpolationParameter
{
public:
	float                                                        InterpolationTime;                                 // 0x0(0x4)
	byte                                                         InterpolationType;                                 // 0x4(0x1)
};


// Size 0x10
struct AnimSetMeshLinkup
{
public:
	TArray<Int BoneToTrackTable>                                 BoneToTrackTable;                                  // 0x0(0x10)
};


// Size 0x1
struct AssetImportInfo
{
public:
};


// Size 0x20
struct LaunchOnTestSettings
{
public:
	Struct FilePath                                              LaunchOnTestmap;                                   // 0x0(0x10)
	Struct FString                                               DeviceID;                                          // 0x10(0x10)
};


// Size 0x18
struct EditorMapPerformanceTestDefinition
{
public:
	Struct FilePath                                              PerformanceTestmap;                                // 0x0(0x10)
	int                                                          TestTimer;                                         // 0x10(0x4)
};


// Size 0x210
struct BuildPromotionTestSettings
{
public:
	Struct FilePath                                              DefaultStaticMeshAsset;                            // 0x0(0x10)
	Struct BuildPromotionImportWorkflowSettings                  ImportWorkflow;                                    // 0x10(0x150)
	Struct BuildPromotionOpenAssetSettings                       OpenAssets;                                        // 0x160(0x60)
	Struct BuildPromotionBlueprintSettings                       BlueprintSettings;                                 // 0x1c0(0x20)
	Struct BuildPromotionNewProjectSettings                      NewProjectSettings;                                // 0x1e0(0x20)
	Struct FilePath                                              SourceControlMaterial;                             // 0x200(0x10)
};


// Size 0x20
struct BuildPromotionNewProjectSettings
{
public:
	Struct DirectoryPath                                         NewProjectFolderOverride;                          // 0x0(0x10)
	Struct FString                                               NewProjectNameOverride;                            // 0x10(0x10)
};


// Size 0x20
struct BuildPromotionBlueprintSettings
{
public:
	Struct FilePath                                              FirstMeshPath;                                     // 0x0(0x10)
	Struct FilePath                                              SecondMeshPath;                                    // 0x10(0x10)
};


// Size 0x60
struct BuildPromotionOpenAssetSettings
{
public:
	Struct FilePath                                              BlueprintAsset;                                    // 0x0(0x10)
	Struct FilePath                                              MaterialAsset;                                     // 0x10(0x10)
	Struct FilePath                                              ParticleSystemAsset;                               // 0x20(0x10)
	Struct FilePath                                              SkeletalMeshAsset;                                 // 0x30(0x10)
	Struct FilePath                                              StaticMeshAsset;                                   // 0x40(0x10)
	Struct FilePath                                              TextureAsset;                                      // 0x50(0x10)
};


// Size 0x150
struct BuildPromotionImportWorkflowSettings
{
public:
	Struct EditorImportWorkflowDefinition                        Diffuse;                                           // 0x0(0x20)
	Struct EditorImportWorkflowDefinition                        Normal;                                            // 0x20(0x20)
	Struct EditorImportWorkflowDefinition                        StaticMesh;                                        // 0x40(0x20)
	Struct EditorImportWorkflowDefinition                        ReimportStaticMesh;                                // 0x60(0x20)
	Struct EditorImportWorkflowDefinition                        BlendShapeMesh;                                    // 0x80(0x20)
	Struct EditorImportWorkflowDefinition                        MorphMesh;                                         // 0xa0(0x20)
	Struct EditorImportWorkflowDefinition                        SkeletalMesh;                                      // 0xc0(0x20)
	Struct EditorImportWorkflowDefinition                        Animation;                                         // 0xe0(0x20)
	Struct EditorImportWorkflowDefinition                        Sound;                                             // 0x100(0x20)
	Struct EditorImportWorkflowDefinition                        SurroundSound;                                     // 0x120(0x20)
	TArray<struct OtherAssetsToImport>                           OtherAssetsToImport;                               // 0x140(0x10)
};


// Size 0x20
struct EditorImportWorkflowDefinition
{
public:
	Struct FilePath                                              ImportFilePath;                                    // 0x0(0x10)
	TArray<struct FactorySettings>                               FactorySettings;                                   // 0x10(0x10)
};


// Size 0x20
struct ImportFactorySettingValues
{
public:
	Struct FString                                               SettingName;                                       // 0x0(0x10)
	Struct FString                                               Value;                                             // 0x10(0x10)
};


// Size 0x10
struct ParticleEditorPromotionSettings
{
public:
	Struct FilePath                                              DefaultParticleAsset;                              // 0x0(0x10)
};


// Size 0x30
struct MaterialEditorPromotionSettings
{
public:
	Struct FilePath                                              DefaultMaterialAsset;                              // 0x0(0x10)
	Struct FilePath                                              DefaultDiffuseTexture;                             // 0x10(0x10)
	Struct FilePath                                              DefaultNormalTexture;                              // 0x20(0x10)
};


// Size 0x38
struct EditorImportExportTestDefinition
{
public:
	Struct FilePath                                              ImportFilePath;                                    // 0x0(0x10)
	Struct FString                                               ExportFileExtension;                               // 0x10(0x10)
	bool                                                         bSkipExport;                                       // 0x20(0x1)
	char                                                         pad0x7_SBYCE[0x7];                                 // 0x21(0x7)
	TArray<struct FactorySettings>                               FactorySettings;                                   // 0x28(0x10)
};


// Size 0x60
struct ExternalToolDefinition
{
public:
	Struct FString                                               ToolName;                                          // 0x0(0x10)
	Struct FilePath                                              ExecutablePath;                                    // 0x10(0x10)
	Struct FString                                               CommandLineOptions;                                // 0x20(0x10)
	Struct DirectoryPath                                         WorkingDirectory;                                  // 0x30(0x10)
	Struct FString                                               ScriptExtension;                                   // 0x40(0x10)
	Struct DirectoryPath                                         ScriptDirectory;                                   // 0x50(0x10)
};


// Size 0x18
struct OpenTestAsset
{
public:
	Struct FilePath                                              AssetToOpen;                                       // 0x0(0x10)
	bool                                                         bSkipTestWhenUnAttended;                           // 0x10(0x1)
};


// Size 0x3c
struct NavAvoidanceData
{
public:
};


// Size 0x18
struct AnimParentNodeAssetOverride
{
public:
	Class AnimationAsset*                                        NewAsset;                                          // 0x0(0x8)
	Struct Guid                                                  ParentNodeGuid;                                    // 0x8(0x10)
};


// Size 0x18
struct AnimGroupInfo
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	Struct LinearColor                                           Color;                                             // 0x8(0x10)
};


// Size 0x18
struct DataTableCategoryHandle
{
public:
	Class DataTable*                                             DataTable;                                         // 0x0(0x8)
	struct FName                                                 ColumnName;                                        // 0x8(0x8)
	struct FName                                                 RowContents;                                       // 0x10(0x8)
};


// Size 0x10
struct DataTableRowHandle
{
public:
	Class DataTable*                                             DataTable;                                         // 0x0(0x8)
	struct FName                                                 RowName;                                           // 0x8(0x8)
};


// Size 0x20
struct DialogueWaveParameter
{
public:
	Class DialogueWave*                                          DialogueWave;                                      // 0x0(0x8)
	Struct DialogueContext                                       Context;                                           // 0x8(0x18)
};


// Size 0x18
struct DialogueContext
{
public:
	Class DialogueVoice*                                         Speaker;                                           // 0x0(0x8)
	TArray<class DialogueVoice*>                                 Targets;                                           // 0x8(0x10)
};


// Size 0x70
struct FormatTextArgument
{
public:
	Struct FText                                                 ArgumentName;                                      // 0x0(0x38)
	Struct FText                                                 TextValue;                                         // 0x38(0x38)
};


// Size 0x10
struct EventGraphFastCallPair
{
public:
	Class Function*                                              FunctionToPatch;                                   // 0x0(0x8)
	int                                                          EventGraphCallOffset;                              // 0x8(0x4)
};


// Size 0x1
struct BlueprintDebugData
{
public:
};


// Size 0x8
struct PointerToUberGraphFrame
{
public:
};


// Size 0x140
struct DebuggingInfoForSingleFunction
{
public:
};


// Size 0x14
struct NodeToCodeAssociation
{
public:
};


// Size 0x1
struct AnimBlueprintDebugData
{
public:
};


// Size 0x1
struct AnimationFrameSnapshot
{
public:
};


// Size 0xb0
struct StateMachineDebugData
{
public:
};


// Size 0x20
struct KShapeElem
{
public:
};


// Size 0x50
struct KBoxElem
{
public:
	Struct Vector                                                Center;                                            // 0x20(0xc)
	char                                                         pad0x4_WMN1P[0x4];                                 // 0x2c(0x4)
	Struct Quat                                                  Orientation;                                       // 0x30(0x10)
	float                                                        X;                                                 // 0x40(0x4)
	float                                                        Y;                                                 // 0x44(0x4)
	float                                                        Z;                                                 // 0x48(0x4)
};


// Size 0x90
struct KConvexElem
{
public:
	TArray<struct VertexData>                                    VertexData;                                        // 0x20(0x10)
	Struct Box                                                   ElemBox;                                           // 0x30(0x1c)
	char                                                         pad0x4_1T4JZ[0x4];                                 // 0x4c(0x4)
	Struct Transform                                             Transform;                                         // 0x50(0x30)
};


// Size 0x30
struct KSphereElem
{
public:
	Struct Vector                                                Center;                                            // 0x20(0xc)
	float                                                        Radius;                                            // 0x2c(0x4)
};


// Size 0x50
struct KSphylElem
{
public:
	Struct Vector                                                Center;                                            // 0x20(0xc)
	char                                                         pad0x4_PNPOW[0x4];                                 // 0x2c(0x4)
	Struct Quat                                                  Orientation;                                       // 0x30(0x10)
	float                                                        Radius;                                            // 0x40(0x4)
	float                                                        Length;                                            // 0x44(0x4)
};


// Size 0x48
struct KAggregateGeom
{
public:
	TArray<struct SphereElems>                                   SphereElems;                                       // 0x0(0x10)
	TArray<struct BoxElems>                                      BoxElems;                                          // 0x10(0x10)
	TArray<struct SphylElems>                                    SphylElems;                                        // 0x20(0x10)
	TArray<struct ConvexElems>                                   ConvexElems;                                       // 0x30(0x10)
};


// Size 0x30
struct AggregateGeometry2D
{
public:
	TArray<struct CircleElements>                                CircleElements;                                    // 0x0(0x10)
	TArray<struct BoxElements>                                   BoxElements;                                       // 0x10(0x10)
	TArray<struct ConvexElements>                                ConvexElements;                                    // 0x20(0x10)
};


// Size 0x10
struct ConvexElement2D
{
public:
	TArray<struct VertexData>                                    VertexData;                                        // 0x0(0x10)
};


// Size 0x14
struct BoxElement2D
{
public:
	Struct Vector2D                                              Center;                                            // 0x0(0x8)
	float                                                        Width;                                             // 0x8(0x4)
	float                                                        Height;                                            // 0xc(0x4)
	float                                                        Angle;                                             // 0x10(0x4)
};


// Size 0xc
struct CircleElement2D
{
public:
	Struct Vector2D                                              Center;                                            // 0x0(0x8)
	float                                                        Radius;                                            // 0x8(0x4)
};


// Size 0x10
struct InputBlendPose
{
public:
	TArray<struct BranchFilters>                                 BranchFilters;                                     // 0x0(0x10)
};


// Size 0xc
struct BranchFilter
{
public:
	struct FName                                                 BoneName;                                          // 0x0(0x8)
	int                                                          BlendDepth;                                        // 0x8(0x4)
};


// Size 0x20
struct BuilderPoly
{
public:
	TArray<Int VertexIndices>                                    VertexIndices;                                     // 0x0(0x10)
	int                                                          Direction;                                         // 0x10(0x4)
	struct FName                                                 ItemName;                                          // 0x14(0x8)
	int                                                          PolyFlags;                                         // 0x1c(0x4)
};


// Size 0x18
struct WrappedStringElement
{
public:
	Struct FString                                               Value;                                             // 0x0(0x10)
	Struct Vector2D                                              LineExtent;                                        // 0x10(0x8)
};


// Size 0x28
struct TextSizingParameters
{
public:
	float                                                        DrawX;                                             // 0x0(0x4)
	float                                                        DrawY;                                             // 0x4(0x4)
	float                                                        DrawXL;                                            // 0x8(0x4)
	float                                                        DrawYL;                                            // 0xc(0x4)
	Struct Vector2D                                              Scaling;                                           // 0x10(0x8)
	Class Font*                                                  DrawFont;                                          // 0x18(0x8)
	Struct Vector2D                                              SpacingAdjust;                                     // 0x20(0x8)
};


// Size 0x48
struct TextureRenderData
{
public:
	Class Texture*                                               RenderTexture;                                     // 0x0(0x8)
	Struct Vector2D                                              ScreenPosition;                                    // 0x8(0x8)
	Struct Vector2D                                              ScreenSize;                                        // 0x10(0x8)
	Struct Vector2D                                              CoordinatePosition;                                // 0x18(0x8)
	Struct Vector2D                                              CoordinateSize;                                    // 0x20(0x8)
	Struct LinearColor                                           RenderColor;                                       // 0x28(0x10)
	byte                                                         BlendMode;                                         // 0x38(0x1)
	char                                                         pad0x3_2VA2N[0x3];                                 // 0x39(0x3)
	float                                                        Rotation;                                          // 0x3c(0x4)
	Struct Vector2D                                              PivotPoint;                                        // 0x40(0x8)
};


// Size 0x18
struct CanvasIcon
{
public:
	Class Texture*                                               Texture;                                           // 0x0(0x8)
	float                                                        U;                                                 // 0x8(0x4)
	float                                                        V;                                                 // 0xc(0x4)
	float                                                        UL;                                                // 0x10(0x4)
	float                                                        VL;                                                // 0x14(0x4)
};


// Size 0xc0
struct RPCStats
{
public:
	Struct RPCStatEntry                                          Entries;                                           // 0x0(0x60)
};


// Size 0x60
struct RPCStatEntry
{
public:
	double                                                       AccumulatedPayloadInKB;                            // 0x30(0x8)
	double                                                       TimeIntervalInSec;                                 // 0x38(0x8)
	Struct SpikeStatEntry                                        WorstSpike;                                        // 0x40(0x18)
};


// Size 0x18
struct SpikeStatEntry
{
public:
	TArray<struct WorstRPCs>                                     WorstRPCs;                                         // 0x0(0x10)
	byte                                                         SpikeDetected;                                     // 0x14(0x1)
};


// Size 0x20
struct FuncStatEntry
{
public:
	Struct FString                                               Name;                                              // 0x0(0x10)
};


// Size 0x28
struct FuncStatHolder
{
public:
};


// Size 0x28
struct AutoCompleteNode
{
public:
	int                                                          IndexChar;                                         // 0x0(0x4)
	char                                                         pad0x4_38ABB[0x4];                                 // 0x4(0x4)
	TArray<Int AutoCompleteListIndices>                          AutoCompleteListIndices;                           // 0x8(0x10)
};


// Size 0x1e8
struct RuntimeCurveLinearColor
{
public:
	Struct RichCurve                                             ColorCurves;                                       // 0x0(0x78)
	char                                                         pad0x168_RFNKH[0x168];                             // 0x78(0x168)
	Class CurveLinearColor*                                      ExternalCurve;                                     // 0x1e0(0x8)
};


// Size 0x10
struct CurveTableRowHandle
{
public:
	Class CurveTable*                                            CurveTable;                                        // 0x0(0x8)
	struct FName                                                 RowName;                                           // 0x8(0x8)
};


// Size 0x18
struct FeatureToggledStringAssetReferenceEntry
{
public:
	Struct StringAssetReference                                  Asset;                                             // 0x0(0x10)
	struct FName                                                 Feature;                                           // 0x10(0x8)
};


// Size 0x38
struct InstancedNavMesh
{
public:
	Struct Vector                                                Location;                                          // 0x20(0xc)
	struct FName                                                 NavMeshName;                                       // 0x2c(0x8)
	Struct NavAgentSelector                                      SupportedAgents;                                   // 0x34(0x4)
};


// Size 0x4
struct DestructibleChunkParameters
{
public:
	bool                                                         bIsSupportChunk;                                   // 0x0(0x1)
	bool                                                         bDoNotFracture;                                    // 0x1(0x1)
	bool                                                         bDoNotDamage;                                      // 0x2(0x1)
	bool                                                         bDoNotCrumble;                                     // 0x3(0x1)
};


// Size 0x24
struct FractureMaterial
{
public:
	Struct Vector2D                                              UVScale;                                           // 0x0(0x8)
	Struct Vector2D                                              UVOffset;                                          // 0x8(0x8)
	Struct Vector                                                Tangent;                                           // 0x10(0xc)
	float                                                        UAngle;                                            // 0x1c(0x4)
	int                                                          InteriorElementIndex;                              // 0x20(0x4)
};


// Size 0x40
struct AudioQualitySettings
{
public:
	Struct FText                                                 DisplayName;                                       // 0x0(0x38)
	int                                                          MaxChannels;                                       // 0x38(0x4)
};


// Size 0xc
struct PhysicalSurfaceName
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	char                                                         pad0x3_06GWO[0x3];                                 // 0x1(0x3)
	struct FName                                                 Name;                                              // 0x4(0x8)
};


// Size 0xc
struct DominanceGroupName
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	char                                                         pad0x3_U12H2[0x3];                                 // 0x1(0x3)
	struct FName                                                 Name;                                              // 0x4(0x8)
};


// Size 0xc
struct DominanceGroupPair
{
public:
	byte                                                         FirstGroupId;                                      // 0x0(0x1)
	byte                                                         SecondGroupId;                                     // 0x1(0x1)
	char                                                         pad0x2_U7MDW[0x2];                                 // 0x2(0x2)
	int                                                          FirstDominanceValue;                               // 0x4(0x4)
	int                                                          SecondDominanceValue;                              // 0x8(0x4)
};


// Size 0x3c
struct TextureLODGroup
{
public:
	byte                                                         Group;                                             // 0x0(0x1)
	char                                                         pad0xb_HG13J[0xb];                                 // 0x1(0xb)
	int                                                          LODBias;                                           // 0xc(0x4)
	char                                                         pad0x4_W2C38[0x4];                                 // 0x10(0x4)
	int                                                          NumStreamedMips;                                   // 0x14(0x4)
	byte                                                         MipGenSettings;                                    // 0x18(0x1)
	char                                                         pad0x3_OEWXC[0x3];                                 // 0x19(0x3)
	int                                                          MinLODSize;                                        // 0x1c(0x4)
	int                                                          MaxLODSize;                                        // 0x20(0x4)
	struct FName                                                 MinMagFilter;                                      // 0x24(0x8)
	struct FName                                                 MipFilter;                                         // 0x2c(0x8)
	int                                                          TextureQualityReduction;                           // 0x34(0x4)
	int                                                          bDisableMaxTextureResolutionOverride;              // 0x38(0x4)
};


// Size 0x28
struct DialogueContextMapping
{
public:
	Struct DialogueContext                                       Context;                                           // 0x0(0x18)
	Class SoundWave*                                             SoundWave;                                         // 0x18(0x8)
	Class DialogueSoundWaveProxy*                                Proxy;                                             // 0x20(0x8)
};


// Size 0x38
struct RawDistributionFloat
{
public:
	float                                                        MinValue;                                          // 0x28(0x4)
	float                                                        MaxValue;                                          // 0x2c(0x4)
	Class DistributionFloat*                                     Distribution;                                      // 0x30(0x8)
};


// Size 0x38
struct RawDistributionVector
{
public:
	float                                                        MinValue;                                          // 0x28(0x4)
	float                                                        MaxValue;                                          // 0x2c(0x4)
	Class DistributionVector*                                    Distribution;                                      // 0x30(0x8)
};


// Size 0x18
struct BlueprintComponentDelegateBinding
{
public:
	struct FName                                                 ComponentPropertyName;                             // 0x0(0x8)
	struct FName                                                 DelegatePropertyName;                              // 0x8(0x8)
	struct FName                                                 FunctionNameToBind;                                // 0x10(0x8)
};


// Size 0x4
struct BlueprintInputDelegateBinding
{
public:
	bool                                                         bConsumeInput;                                     // 0x0(0x1)
	bool                                                         bExecuteWhenPaused;                                // 0x0(0x1)
	bool                                                         bOverrideParentBinding;                            // 0x0(0x1)
};


// Size 0x18
struct BlueprintInputActionDelegateBinding
{
public:
	struct FName                                                 InputActionName;                                   // 0x4(0x8)
	byte                                                         InputKeyEvent;                                     // 0xc(0x1)
	char                                                         pad0x3_28X0W[0x3];                                 // 0xd(0x3)
	struct FName                                                 FunctionNameToBind;                                // 0x10(0x8)
};


// Size 0x14
struct BlueprintInputAxisDelegateBinding
{
public:
	struct FName                                                 InputAxisName;                                     // 0x4(0x8)
	struct FName                                                 FunctionNameToBind;                                // 0xc(0x8)
};


// Size 0x30
struct BlueprintInputAxisKeyDelegateBinding
{
public:
	Struct Key                                                   AxisKey;                                           // 0x8(0x20)
	struct FName                                                 FunctionNameToBind;                                // 0x28(0x8)
};


// Size 0x40
struct BlueprintInputKeyDelegateBinding
{
public:
	Struct InputChord                                            InputChord;                                        // 0x8(0x28)
	byte                                                         InputKeyEvent;                                     // 0x30(0x1)
	char                                                         pad0x3_4SZM5[0x3];                                 // 0x31(0x3)
	struct FName                                                 FunctionNameToBind;                                // 0x34(0x8)
};


// Size 0x10
struct BlueprintInputTouchDelegateBinding
{
public:
	byte                                                         InputKeyEvent;                                     // 0x4(0x1)
	char                                                         pad0x3_183AJ[0x3];                                 // 0x5(0x3)
	struct FName                                                 FunctionNameToBind;                                // 0x8(0x8)
};


// Size 0x10
struct BlueprintInstancedActorDelegateBinding
{
public:
	struct FName                                                 DelegatePropertyName;                              // 0x0(0x8)
	struct FName                                                 FunctionNameToBind;                                // 0x8(0x8)
};


// Size 0x20
struct GraphReference
{
public:
	Class EdGraph*                                               MacroGraph;                                        // 0x0(0x8)
	Class Blueprint*                                             GraphBlueprint;                                    // 0x8(0x8)
	Struct Guid                                                  GraphGuid;                                         // 0x10(0x10)
};


// Size 0xd0
struct EdGraphSchemaAction_NewNode
{
public:
	Class EdGraphNode*                                           NodeTemplate;                                      // 0xc8(0x8)
};


// Size 0xc8
struct EdGraphSchemaAction
{
public:
	Struct FText                                                 MenuDescription;                                   // 0x8(0x38)
	Struct FString                                               TooltipDescription;                                // 0x40(0x10)
	Struct FText                                                 Category;                                          // 0x50(0x38)
	Struct FText                                                 Keywords;                                          // 0x88(0x38)
	int                                                          Grouping;                                          // 0xc0(0x4)
	int                                                          SectionID;                                         // 0xc4(0x4)
};


// Size 0x20
struct PluginRedirect
{
public:
	Struct FString                                               OldPluginName;                                     // 0x0(0x10)
	Struct FString                                               NewPluginName;                                     // 0x10(0x10)
};


// Size 0x20
struct StructRedirect
{
public:
	Struct FString                                               OldStructName;                                     // 0x0(0x10)
	Struct FString                                               NewStructName;                                     // 0x10(0x10)
};


// Size 0x58
struct ClassRedirect
{
public:
	Struct FString                                               ObjectName;                                        // 0x0(0x10)
	Struct FString                                               OldClassName;                                      // 0x10(0x10)
	Struct FString                                               NewClassName;                                      // 0x20(0x10)
	Struct FString                                               OldSubobjName;                                     // 0x30(0x10)
	Struct FString                                               NewSubobjName;                                     // 0x40(0x10)
	bool                                                         InstanceOnly;                                      // 0x50(0x1)
};


// Size 0x20
struct GameNameRedirect
{
public:
	Struct FString                                               OldGameName;                                       // 0x0(0x10)
	Struct FString                                               NewGameName;                                       // 0x10(0x10)
};


// Size 0x30
struct ScreenMessageString
{
public:
	Struct FString                                               ScreenMessage;                                     // 0x8(0x10)
	Struct Color                                                 DisplayColor;                                      // 0x18(0x4)
	float                                                        TimeToDisplay;                                     // 0x1c(0x4)
	float                                                        CurrentTimeDisplayed;                              // 0x20(0x4)
};


// Size 0x28
struct DropNoteInfo
{
public:
	Struct Vector                                                Location;                                          // 0x0(0xc)
	Struct Rotator                                               Rotation;                                          // 0xc(0xc)
	Struct FString                                               Comment;                                           // 0x18(0x10)
};


// Size 0x28
struct StatColorMapping
{
public:
