#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Engine_Structs.h"


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class NavLinkDefinition: public Object
{
public:
	TArray<struct NavigationLink>                                Links;                                             // 0x28(0x10)
	TArray<struct NavigationSegmentLink>                         SegmentLinks;                                      // 0x38(0x10)
	char                                                         pad0x8_9UP93[0x8];                                 // 0x48(0x8)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class MaterialExpression: public Object
{
public:
	class Material*                                              Material;                                          // 0x28(0x8)
	class MaterialFunction*                                      Function;                                          // 0x30(0x8)
	struct FString                                               Desc;                                              // 0x38(0x10)
	struct Color                                                 BorderColor;                                       // 0x48(0x4)
	bool                                                         bRealtimePreview;                                  // 0x4c(0x1)
	bool                                                         bNeedToUpdatePreview;                              // 0x4c(0x1)
	bool                                                         bIsParameterExpression;                            // 0x4c(0x1)
	bool                                                         bCommentBubbleVisible;                             // 0x4c(0x1)
	bool                                                         bShowOutputNameOnPin;                              // 0x4c(0x1)
	bool                                                         bHidePreviewWindow;                                // 0x4c(0x1)
	bool                                                         bCollapsed;                                        // 0x4c(0x1)
	bool                                                         bShaderInputData;                                  // 0x4c(0x1)
	bool                                                         bShowInputs;                                       // 0x4d(0x1)
	bool                                                         bShowOutputs;                                      // 0x4d(0x1)
	char                                                         pad0x2_1U11W[0x2];                                 // 0x4e(0x2)
	TArray<struct Text>                                          MenuCategories;                                    // 0x50(0x10)
	TArray<struct ExpressionOutput>                              Outputs;                                           // 0x60(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class NavigationDataChunk: public Object
{
public:
	struct FName                                                 NavigationDataName;                                // 0x28(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InheritableComponentHandler: public Object
{
public:
	TArray<struct ComponentOverrideRecord>                       Records;                                           // 0x28(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ParticleSystemReplay: public Object
{
public:
	int                                                          ClipIDNumber;                                      // 0x28(0x4)
	char                                                         pad0x14_ZUB8F[0x14];                               // 0x2c(0x14)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TestInterfaceAlternative: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlendableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x0] - InheritedSize[0x0]
class Default__BlueprintGeneratedClass
{
public:
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class CheatManager: public Object
{
public:
	class DebugCameraController*                                 DebugCameraControllerRef;                          // 0x28(0x8)
	class UClass*                                                DebugCameraControllerClass;                        // 0x30(0x8)
	char                                                         pad0x40_Q6R1H[0x40];                               // 0x38(0x40)
};


// Size 0x400 (Full Size[0x428] - InheritedSize[0x28]
class PlayerInput: public Object
{
public:
	char                                                         pad0xf8_Z5A52[0xf8];                               // 0x28(0xf8)
	TArray<struct KeyBind>                                       DebugExecBindings;                                 // 0x120(0x10)
	char                                                         pad0x40_ZMK4B[0x40];                               // 0x130(0x40)
	TArray<struct Name>                                          GamepadInvertedAxes;                               // 0x170(0x10)
	TArray<struct Name>                                          MouseInvertedAxes;                                 // 0x180(0x10)
	TArray<struct Name>                                          InvertedCombinedAxisY;                             // 0x190(0x10)
	TArray<struct Name>                                          InvertedCombinedAxisX;                             // 0x1a0(0x10)
	char                                                         pad0x278_L2X64[0x278];                             // 0x1b0(0x278)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class GameInstance: public Object
{
public:
	char                                                         pad0x10_ET2EM[0x10];                               // 0x28(0x10)
	TArray<class LocalPlayer*>                                   LocalPlayers;                                      // 0x38(0x10)
	char                                                         pad0x8_5SPC5[0x8];                                 // 0x48(0x8)
	class OnlineSession*                                         OnlineSession;                                     // 0x50(0x8)
	char                                                         pad0x30_4CHHG[0x30];                               // 0x58(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_PostProcessVolume: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DPICustomScalingRule: public Object
{
public:
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class Channel: public Object
{
public:
	class NetConnection*                                         Connection;                                        // 0x28(0x8)
	char                                                         pad0x38_9CJ7J[0x38];                               // 0x30(0x38)
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class ParticleSystem: public Object
{
public:
	char                                                         SystemUpdateMode;                                  // 0x28(0x1)
	char                                                         pad0x3_TUSOL[0x3];                                 // 0x29(0x3)
	float                                                        UpdateTime_FPS;                                    // 0x2c(0x4)
	float                                                        UpdateTime_Delta;                                  // 0x30(0x4)
	float                                                        WarmUpTime;                                        // 0x34(0x4)
	float                                                        WarmupTickRate;                                    // 0x38(0x4)
	char                                                         pad0x4_U98ZT[0x4];                                 // 0x3c(0x4)
	TArray<class ParticleEmitter*>                               Emitters;                                          // 0x40(0x10)
	class ParticleSystemComponent*                               PreviewComponent;                                  // 0x50(0x8)
	class InterpCurveEdSetup*                                    CurveEdSetup;                                      // 0x58(0x8)
	bool                                                         bOrientZAxisTowardCamera;                          // 0x60(0x1)
	char                                                         pad0x3_53RHZ[0x3];                                 // 0x61(0x3)
	float                                                        LODDistanceCheckTime;                              // 0x64(0x4)
	char                                                         LODMethod;                                         // 0x68(0x1)
	char                                                         pad0x7_ZXBEA[0x7];                                 // 0x69(0x7)
	TArray<float>                                                LODDistances;                                      // 0x70(0x10)
	bool                                                         bRegenerateLODDuplicate;                           // 0x80(0x1)
	char                                                         pad0x7_3WPQ9[0x7];                                 // 0x81(0x7)
	TArray<struct ParticleSystemLOD>                             LODSettings;                                       // 0x88(0x10)
	bool                                                         bIgnoreBoundsRotation;                             // 0x98(0x1)
	bool                                                         bBoostParticleAggregationPriority;                 // 0x98(0x1)
	bool                                                         bUseFixedRelativeBoundingBox;                      // 0x98(0x1)
	char                                                         pad0x3_MGGL6[0x3];                                 // 0x99(0x3)
	struct Box                                                   FixedRelativeBoundingBox;                          // 0x9c(0x1c)
	bool                                                         bUseLowResTranslucencyBoundingBox;                 // 0xb8(0x1)
	char                                                         pad0x3_T3D7R[0x3];                                 // 0xb9(0x3)
	struct Box                                                   LowResTranslucencyBoundingBox;                     // 0xbc(0x1c)
	float                                                        SecondsBeforeInactive;                             // 0xd8(0x4)
	bool                                                         bShouldResetPeakCounts;                            // 0xdc(0x1)
	bool                                                         bHasPhysics;                                       // 0xdc(0x1)
	bool                                                         bPostPhysicsTick;                                  // 0xdc(0x1)
	bool                                                         bUseRealtimeThumbnail;                             // 0xdc(0x1)
	bool                                                         ThumbnailImageOutOfDate;                           // 0xdc(0x1)
	char                                                         pad0x3_KH5FL[0x3];                                 // 0xdd(0x3)
	float                                                        Delay;                                             // 0xe0(0x4)
	float                                                        DelayLow;                                          // 0xe4(0x4)
	bool                                                         bUseDelayRange;                                    // 0xe8(0x1)
	char                                                         pad0x3_NTHL0[0x3];                                 // 0xe9(0x3)
	struct Vector                                                MacroUVPosition;                                   // 0xec(0xc)
	float                                                        MacroUVRadius;                                     // 0xf8(0x4)
	char                                                         OcclusionBoundsMethod;                             // 0xfc(0x1)
	char                                                         pad0x3_SAZ2O[0x3];                                 // 0xfd(0x3)
	struct Box                                                   CustomOcclusionBounds;                             // 0x100(0x1c)
	char                                                         pad0x4_MQL5X[0x4];                                 // 0x11c(0x4)
	TArray<struct LODSoloTrack>                                  SoloTracking;                                      // 0x120(0x10)
	TArray<struct NamedEmitterMaterial>                          NamedMaterialSlots;                                // 0x130(0x10)
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class WorldComposition: public Object
{
public:
	char                                                         pad0x70_UN824[0x70];                               // 0x28(0x70)
	TArray<class LevelStreaming*>                                TilesStreaming;                                    // 0x98(0x10)
	double                                                       TilesStreamingTimeThreshold;                       // 0xa8(0x8)
	bool                                                         bLoadAllTilesDuringCinematic;                      // 0xb0(0x1)
	bool                                                         bRebaseOriginIn3DSpace;                            // 0xb1(0x1)
	char                                                         pad0x2_S1ZNS[0x2];                                 // 0xb2(0x2)
	float                                                        RebaseOriginDistance;                              // 0xb4(0x4)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class LightmassPrimitiveSettingsObject: public Object
{
public:
	struct LightmassPrimitiveSettings                            LightmassSettings;                                 // 0x28(0x18)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class MaybeCompressedCanvasRenderTarget2D: public Object
{
public:
	char                                                         pad0x10_H5ATV[0x10];                               // 0x28(0x10)
	int                                                          ChannelCount;                                      // 0x38(0x4)
	char                                                         pad0x4_5AEWY[0x4];                                 // 0x3c(0x4)
	class CanvasRenderTarget2D*                                  UncompressedRenderTarget;                          // 0x40(0x8)
	class CompressedCanvasRenderTarget2D*                        CompressedRenderTarget;                            // 0x48(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class VisualLoggerAutomationTests: public Object
{
public:
};


// Size 0xd0 (Full Size[0xf8] - InheritedSize[0x28]
class PhysicsAsset: public Object
{
public:
	TArray<class BodySetup*>                                     BodySetup;                                         // 0x28(0x10)
	TArray<int>                                                  BoundsBodies;                                      // 0x38(0x10)
	TArray<class PhysicsConstraintTemplate*>                     ConstraintSetup;                                   // 0x48(0x10)
	char                                                         pad0xa0_ICMUR[0xa0];                               // 0x58(0xa0)
};


// Size 0x9d8 (Full Size[0xa00] - InheritedSize[0x28]
class Engine: public Object
{
public:
	char                                                         pad0x8_2OU9H[0x8];                                 // 0x28(0x8)
	class Font*                                                  TinyFont;                                          // 0x30(0x8)
	struct StringAssetReference                                  TinyFontName;                                      // 0x38(0x10)
	class Font*                                                  SmallFont;                                         // 0x48(0x8)
	struct StringAssetReference                                  SmallFontName;                                     // 0x50(0x10)
	class Font*                                                  MediumFont;                                        // 0x60(0x8)
	struct StringAssetReference                                  MediumFontName;                                    // 0x68(0x10)
	class Font*                                                  LargeFont;                                         // 0x78(0x8)
	struct StringAssetReference                                  LargeFontName;                                     // 0x80(0x10)
	class Font*                                                  MonoFont;                                          // 0x90(0x8)
	struct StringAssetReference                                  MonoFontName;                                      // 0x98(0x10)
	class Font*                                                  SubtitleFont;                                      // 0xa8(0x8)
	struct StringAssetReference                                  SubtitleFontName;                                  // 0xb0(0x10)
	class Font*                                                  HugeFont;                                          // 0xc0(0x8)
	struct StringAssetReference                                  HugeFontName;                                      // 0xc8(0x10)
	TArray<class Font*>                                          AdditionalFonts;                                   // 0xd8(0x10)
	char                                                         pad0x8_01EPJ[0x8];                                 // 0xe8(0x8)
	TArray<String>                                               AdditionalFontNames;                               // 0xf0(0x10)
	class UClass*                                                ConsoleClass;                                      // 0x100(0x8)
	struct StringClassReference                                  ConsoleClassName;                                  // 0x108(0x10)
	class UClass*                                                GameViewportClientClass;                           // 0x118(0x8)
	struct StringClassReference                                  GameViewportClientClassName;                       // 0x120(0x10)
	class UClass*                                                LocalPlayerClass;                                  // 0x130(0x8)
	struct StringClassReference                                  LocalPlayerClassName;                              // 0x138(0x10)
	class UClass*                                                WorldSettingsClass;                                // 0x148(0x8)
	struct StringClassReference                                  WorldSettingsClassName;                            // 0x150(0x10)
	struct StringClassReference                                  NavigationSystemClassName;                         // 0x160(0x10)
	class UClass*                                                NavigationSystemClass;                             // 0x170(0x8)
	struct StringClassReference                                  AvoidanceManagerClassName;                         // 0x178(0x10)
	class UClass*                                                AvoidanceManagerClass;                             // 0x188(0x8)
	class UClass*                                                PhysicsCollisionHandlerClass;                      // 0x190(0x8)
	struct StringClassReference                                  PhysicsCollisionHandlerClassName;                  // 0x198(0x10)
	struct StringClassReference                                  GameUserSettingsClassName;                         // 0x1a8(0x10)
	class UClass*                                                GameUserSettingsClass;                             // 0x1b8(0x8)
	struct StringClassReference                                  AIControllerClassName;                             // 0x1c0(0x10)
	class GameUserSettings*                                      GameUserSettings;                                  // 0x1d0(0x8)
	class UClass*                                                LevelScriptActorClass;                             // 0x1d8(0x8)
	struct StringClassReference                                  LevelScriptActorClassName;                         // 0x1e0(0x10)
	struct StringClassReference                                  DefaultBlueprintBaseClassName;                     // 0x1f0(0x10)
	struct StringClassReference                                  GameSingletonClassName;                            // 0x200(0x10)
	class Object*                                                GameSingleton;                                     // 0x210(0x8)
	class UClass*                                                DefaultPreviewPawnClass;                           // 0x218(0x8)
	struct StringClassReference                                  DefaultPreviewPawnClassName;                       // 0x220(0x10)
	struct FString                                               PlayOnConsoleSaveDir;                              // 0x230(0x10)
	class Texture2D*                                             DefaultTexture;                                    // 0x240(0x8)
	struct StringAssetReference                                  DefaultTextureName;                                // 0x248(0x10)
	class Texture*                                               DefaultDiffuseTexture;                             // 0x258(0x8)
	struct StringAssetReference                                  DefaultDiffuseTextureName;                         // 0x260(0x10)
	class Texture2D*                                             DefaultBSPVertexTexture;                           // 0x270(0x8)
	struct StringAssetReference                                  DefaultBSPVertexTextureName;                       // 0x278(0x10)
	class Texture2D*                                             HighFrequencyNoiseTexture;                         // 0x288(0x8)
	struct StringAssetReference                                  HighFrequencyNoiseTextureName;                     // 0x290(0x10)
	class Texture2D*                                             DefaultBokehTexture;                               // 0x2a0(0x8)
	struct StringAssetReference                                  DefaultBokehTextureName;                           // 0x2a8(0x10)
	class Texture2D*                                             BlueNoiseTexture;                                  // 0x2b8(0x8)
	struct StringAssetReference                                  BlueNoiseTextureName;                              // 0x2c0(0x10)
	class Texture2D*                                             HDRCalibrationTexture;                             // 0x2d0(0x8)
	struct StringAssetReference                                  HDRCalibrationTextureName;                         // 0x2d8(0x10)
	class TextureRenderTarget2D*                                 BlurredCloudRenderTarget;                          // 0x2e8(0x8)
	struct StringAssetReference                                  BlurredCloudRenderTargetName;                      // 0x2f0(0x10)
	class Material*                                              WireframeMaterial;                                 // 0x300(0x8)
	struct FString                                               WireframeMaterialName;                             // 0x308(0x10)
	class Material*                                              DebugMeshMaterial;                                 // 0x318(0x8)
	struct StringAssetReference                                  DebugMeshMaterialName;                             // 0x320(0x10)
	class Material*                                              LevelColorationLitMaterial;                        // 0x330(0x8)
	struct FString                                               LevelColorationLitMaterialName;                    // 0x338(0x10)
	class Material*                                              LevelColorationUnlitMaterial;                      // 0x348(0x8)
	struct FString                                               LevelColorationUnlitMaterialName;                  // 0x350(0x10)
	class Material*                                              TriangleDensityScreenSpaceMaterial;                // 0x360(0x8)
	struct FString                                               TriangleDensityScreenSpaceMaterialName;            // 0x368(0x10)
	class Material*                                              TriangleDensityWorldSpaceMaterial;                 // 0x378(0x8)
	struct FString                                               TriangleDensityWorldSpaceMaterialName;             // 0x380(0x10)
	class Material*                                              LightingTexelDensityMaterial;                      // 0x390(0x8)
	struct FString                                               LightingTexelDensityName;                          // 0x398(0x10)
	class Material*                                              ShadedLevelColorationLitMaterial;                  // 0x3a8(0x8)
	struct FString                                               ShadedLevelColorationLitMaterialName;              // 0x3b0(0x10)
	class Material*                                              ShadedLevelColorationUnlitMaterial;                // 0x3c0(0x8)
	struct FString                                               ShadedLevelColorationUnlitMaterialName;            // 0x3c8(0x10)
	class Material*                                              RemoveSurfaceMaterial;                             // 0x3d8(0x8)
	struct StringAssetReference                                  RemoveSurfaceMaterialName;                         // 0x3e0(0x10)
	class Material*                                              VertexColorMaterial;                               // 0x3f0(0x8)
	struct FString                                               VertexColorMaterialName;                           // 0x3f8(0x10)
	class Material*                                              VertexColorViewModeMaterial_ColorOnly;             // 0x408(0x8)
	struct FString                                               VertexColorViewModeMaterialName_ColorOnly;         // 0x410(0x10)
	class Material*                                              VertexColorViewModeMaterial_AlphaAsColor;          // 0x420(0x8)
	struct FString                                               VertexColorViewModeMaterialName_AlphaAsColor;      // 0x428(0x10)
	class Material*                                              VertexColorViewModeMaterial_RedOnly;               // 0x438(0x8)
	struct FString                                               VertexColorViewModeMaterialName_RedOnly;           // 0x440(0x10)
	class Material*                                              VertexColorViewModeMaterial_GreenOnly;             // 0x450(0x8)
	struct FString                                               VertexColorViewModeMaterialName_GreenOnly;         // 0x458(0x10)
	class Material*                                              VertexColorViewModeMaterial_BlueOnly;              // 0x468(0x8)
	struct FString                                               VertexColorViewModeMaterialName_BlueOnly;          // 0x470(0x10)
	class Material*                                              ConstraintLimitMaterial;                           // 0x480(0x8)
	class MaterialInstanceDynamic*                               ConstraintLimitMaterialX;                          // 0x488(0x8)
	class MaterialInstanceDynamic*                               ConstraintLimitMaterialY;                          // 0x490(0x8)
	class MaterialInstanceDynamic*                               ConstraintLimitMaterialZ;                          // 0x498(0x8)
	struct StringAssetReference                                  ConstraintLimitMaterialName;                       // 0x4a0(0x10)
	class Material*                                              InvalidLightmapSettingsMaterial;                   // 0x4b0(0x8)
	struct StringAssetReference                                  InvalidLightmapSettingsMaterialName;               // 0x4b8(0x10)
	class Material*                                              PreviewShadowsIndicatorMaterial;                   // 0x4c8(0x8)
	struct StringAssetReference                                  PreviewShadowsIndicatorMaterialName;               // 0x4d0(0x10)
	class Material*                                              ArrowMaterial;                                     // 0x4e0(0x8)
	struct StringAssetReference                                  ArrowMaterialName;                                 // 0x4e8(0x10)
	struct LinearColor                                           LightingOnlyBrightness;                            // 0x4f8(0x10)
	TArray<struct Color>                                         LightComplexityColors;                             // 0x508(0x10)
	TArray<struct LinearColor>                                   ShaderComplexityColors;                            // 0x518(0x10)
	TArray<struct LinearColor>                                   StationaryLightOverlapColors;                      // 0x528(0x10)
	TArray<struct LinearColor>                                   LODColorationColors;                               // 0x538(0x10)
	float                                                        MaxPixelShaderAdditiveComplexityCount;             // 0x548(0x4)
	float                                                        MaxES2PixelShaderAdditiveComplexityCount;          // 0x54c(0x4)
	float                                                        MinLightMapDensity;                                // 0x550(0x4)
	float                                                        IdealLightMapDensity;                              // 0x554(0x4)
	float                                                        MaxLightMapDensity;                                // 0x558(0x4)
	bool                                                         bRenderLightMapDensityGrayscale;                   // 0x55c(0x1)
	char                                                         pad0x3_KKFPL[0x3];                                 // 0x55d(0x3)
	float                                                        RenderLightMapDensityGrayscaleScale;               // 0x560(0x4)
	float                                                        RenderLightMapDensityColorScale;                   // 0x564(0x4)
	struct LinearColor                                           LightMapDensityVertexMappedColor;                  // 0x568(0x10)
	struct LinearColor                                           LightMapDensitySelectedColor;                      // 0x578(0x10)
	TArray<struct StatColorMapping>                              StatColorMappings;                                 // 0x588(0x10)
	class PhysicalMaterial*                                      DefaultPhysMaterial;                               // 0x598(0x8)
	struct StringAssetReference                                  DefaultPhysMaterialName;                           // 0x5a0(0x10)
	TArray<struct GameNameRedirect>                              ActiveGameNameRedirects;                           // 0x5b0(0x10)
	TArray<struct ClassRedirect>                                 ActiveClassRedirects;                              // 0x5c0(0x10)
	TArray<struct PluginRedirect>                                ActivePluginRedirects;                             // 0x5d0(0x10)
	TArray<struct StructRedirect>                                ActiveStructRedirects;                             // 0x5e0(0x10)
	class Texture2D*                                             PreIntegratedSkinBRDFTexture;                      // 0x5f0(0x8)
	struct StringAssetReference                                  PreIntegratedSkinBRDFTextureName;                  // 0x5f8(0x10)
	class Texture2D*                                             MiniFontTexture;                                   // 0x608(0x8)
	struct StringAssetReference                                  MiniFontTextureName;                               // 0x610(0x10)
	class Texture*                                               WeightMapPlaceholderTexture;                       // 0x620(0x8)
	struct StringAssetReference                                  WeightMapPlaceholderTextureName;                   // 0x628(0x10)
	class Texture2D*                                             LightMapDensityTexture;                            // 0x638(0x8)
	struct StringAssetReference                                  LightMapDensityTextureName;                        // 0x640(0x10)
	char                                                         pad0x8_4IDAT[0x8];                                 // 0x650(0x8)
	class GameViewportClient*                                    GameViewport;                                      // 0x658(0x8)
	TArray<String>                                               DeferredCommands;                                  // 0x660(0x10)
	int                                                          TickCycles;                                        // 0x670(0x4)
	int                                                          GameCycles;                                        // 0x674(0x4)
	int                                                          ClientCycles;                                      // 0x678(0x4)
	float                                                        NearClipPlane;                                     // 0x67c(0x4)
	bool                                                         bHardwareSurveyEnabled;                            // 0x680(0x1)
	bool                                                         bSubtitlesEnabled;                                 // 0x680(0x1)
	bool                                                         bSubtitlesForcedOff;                               // 0x680(0x1)
	char                                                         pad0x3_AJ452[0x3];                                 // 0x681(0x3)
	int                                                          MaximumLoopIterationCount;                         // 0x684(0x4)
	bool                                                         bCanBlueprintsTickByDefault;                       // 0x688(0x1)
	bool                                                         bOptimizeAnimBlueprintMemberVariableAccess;        // 0x688(0x1)
	bool                                                         bEnableEditorPSysRealtimeLOD;                      // 0x688(0x1)
	bool                                                         bSmoothFrameRate;                                  // 0x688(0x1)
	bool                                                         bUseFixedFrameRate;                                // 0x688(0x1)
	char                                                         pad0x3_FBQXW[0x3];                                 // 0x689(0x3)
	float                                                        FixedFrameRate;                                    // 0x68c(0x4)
	struct FloatRange                                            SmoothedFrameRateRange;                            // 0x690(0x10)
	class EngineCustomTimeStep*                                  CustomTimeStep;                                    // 0x6a0(0x8)
	char                                                         pad0x20_QEIOT[0x20];                               // 0x6a8(0x20)
	class TimecodeProvider*                                      TimecodeProvider;                                  // 0x6c8(0x8)
	char                                                         pad0x19_TIUWO[0x19];                               // 0x6d0(0x19)
	bool                                                         bGenerateDefaultTimecode;                          // 0x6e9(0x1)
	char                                                         pad0xa_VQGFR[0xa];                                 // 0x6ea(0xa)
	float                                                        GenerateDefaultTimecodeFrameDelay;                 // 0x6f4(0x4)
	bool                                                         bCheckForMultiplePawnsSpawnedInAFrame;             // 0x6f8(0x1)
	char                                                         pad0x3_UZEDW[0x3];                                 // 0x6f9(0x3)
	int                                                          NumPawnsAllowedToBeSpawnedInAFrame;                // 0x6fc(0x4)
	bool                                                         bShouldGenerateLowQualityLightmaps;                // 0x700(0x1)
	char                                                         pad0x3_92R7T[0x3];                                 // 0x701(0x3)
	struct Color                                                 C_WorldBox;                                        // 0x704(0x4)
	struct Color                                                 C_BrushWire;                                       // 0x708(0x4)
	struct Color                                                 C_AddWire;                                         // 0x70c(0x4)
	struct Color                                                 C_SubtractWire;                                    // 0x710(0x4)
	struct Color                                                 C_SemiSolidWire;                                   // 0x714(0x4)
	struct Color                                                 C_NonSolidWire;                                    // 0x718(0x4)
	struct Color                                                 C_WireBackground;                                  // 0x71c(0x4)
	struct Color                                                 C_ScaleBoxHi;                                      // 0x720(0x4)
	struct Color                                                 C_VolumeCollision;                                 // 0x724(0x4)
	struct Color                                                 C_BSPCollision;                                    // 0x728(0x4)
	struct Color                                                 C_OrthoBackground;                                 // 0x72c(0x4)
	struct Color                                                 C_Volume;                                          // 0x730(0x4)
	struct Color                                                 C_BrushShape;                                      // 0x734(0x4)
	float                                                        StreamingDistanceFactor;                           // 0x738(0x4)
	char                                                         TransitionType;                                    // 0x73c(0x1)
	char                                                         pad0x3_9D3TX[0x3];                                 // 0x73d(0x3)
	struct FString                                               TransitionDescription;                             // 0x740(0x10)
	struct FString                                               TransitionGameMode;                                // 0x750(0x10)
	float                                                        MeshLODRange;                                      // 0x760(0x4)
	bool                                                         bAllowMatureLanguage;                              // 0x764(0x1)
	char                                                         pad0x3_GTOA1[0x3];                                 // 0x765(0x3)
	float                                                        CameraRotationThreshold;                           // 0x768(0x4)
	float                                                        CameraTranslationThreshold;                        // 0x76c(0x4)
	float                                                        PrimitiveProbablyVisibleTime;                      // 0x770(0x4)
	float                                                        MaxOcclusionPixelsFraction;                        // 0x774(0x4)
	bool                                                         bPauseOnLossOfFocus;                               // 0x778(0x1)
	char                                                         pad0x3_V0N2F[0x3];                                 // 0x779(0x3)
	int                                                          MaxParticleResize;                                 // 0x77c(0x4)
	int                                                          MaxParticleResizeWarn;                             // 0x780(0x4)
	char                                                         pad0x4_UDHZT[0x4];                                 // 0x784(0x4)
	TArray<struct DropNoteInfo>                                  PendingDroppedNotes;                               // 0x788(0x10)
	struct RigidBodyErrorCorrection                              PhysicErrorCorrection;                             // 0x798(0x1c)
	float                                                        NetClientTicksPerSecond;                           // 0x7b4(0x4)
	bool                                                         bHasPendingGlobalReregister;                       // 0x7b8(0x1)
	char                                                         pad0x3_QWUU5[0x3];                                 // 0x7b9(0x3)
	float                                                        DisplayGamma;                                      // 0x7bc(0x4)
	float                                                        MinDesiredFrameRate;                               // 0x7c0(0x4)
	struct LinearColor                                           DefaultSelectedMaterialColor;                      // 0x7c4(0x10)
	struct LinearColor                                           SelectedMaterialColor;                             // 0x7d4(0x10)
	struct LinearColor                                           SelectionOutlineColor;                             // 0x7e4(0x10)
	struct LinearColor                                           SubduedSelectionOutlineColor;                      // 0x7f4(0x10)
	struct LinearColor                                           SelectedMaterialColorOverride;                     // 0x804(0x10)
	bool                                                         bIsOverridingSelectedColor;                        // 0x814(0x1)
	char                                                         pad0x3_PQ3X6[0x3];                                 // 0x815(0x3)
	bool                                                         bEnableOnScreenDebugMessages;                      // 0x818(0x1)
	bool                                                         bEnableOnScreenDebugMessagesDisplay;               // 0x818(0x1)
	bool                                                         bSuppressMapWarnings;                              // 0x818(0x1)
	bool                                                         bCookSeparateSharedMPGameContent;                  // 0x818(0x1)
	bool                                                         bDisableAILogging;                                 // 0x818(0x1)
	char                                                         pad0x3_H0NZ2[0x3];                                 // 0x819(0x3)
	int                                                          ScreenSaverInhibitorSemaphore;                     // 0x824(0x4)
	bool                                                         bLockReadOnlyLevels;                               // 0x828(0x1)
	char                                                         pad0x7_DKCF1[0x7];                                 // 0x829(0x7)
	struct FString                                               ParticleEventManagerClassPath;                     // 0x830(0x10)
	char                                                         pad0x10_G5971[0x10];                               // 0x840(0x10)
	float                                                        SelectionHighlightIntensity;                       // 0x850(0x4)
	float                                                        BSPSelectionHighlightIntensity;                    // 0x854(0x4)
	float                                                        HoverHighlightIntensity;                           // 0x858(0x4)
	float                                                        SelectionHighlightIntensityBillboards;             // 0x85c(0x4)
	char                                                         pad0x130_VWHTT[0x130];                             // 0x860(0x130)
	TArray<struct NetDriverDefinition>                           NetDriverDefinitions;                              // 0x990(0x10)
	TArray<String>                                               ServerActors;                                      // 0x9a0(0x10)
	TArray<String>                                               RuntimeServerActors;                               // 0x9b0(0x10)
	bool                                                         bStartedLoadMapMovie;                              // 0x9c0(0x1)
	char                                                         pad0x17_SYJ28[0x17];                               // 0x9c1(0x17)
	int                                                          NextWorldContextHandle;                            // 0x9d8(0x4)
	char                                                         pad0x24_9WCCD[0x24];                               // 0x9dc(0x24)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AnimNotify: public Object
{
public:
	bool                                                         PlayedWithSequencer;                               // 0x28(0x1)
	char                                                         pad0xf_ZU579[0xf];                                 // 0x29(0xf)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class LightmappedSurfaceCollection: public Object
{
public:
	class Model*                                                 SourceModel;                                       // 0x28(0x8)
	TArray<int>                                                  Surfaces;                                          // 0x30(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class SimpleConstructionScript: public Object
{
public:
	TArray<class SCS_Node*>                                      RootNodes;                                         // 0x28(0x10)
	class SCS_Node*                                              DefaultSceneRootNode;                              // 0x38(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ExecutableAnimMetaDataInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x68] - InheritedSize[0x58]
class UserDefinedEnum: public Enum
{
public:
	TArray<struct Text>                                          DisplayNames;                                      // 0x58(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EndUserSettings: public Object
{
public:
	char                                                         pad0x8_VMZBL[0x8];                                 // 0x28(0x8)
	bool                                                         bSendAnonymousUsageDataToEpic;                     // 0x30(0x1)
	char                                                         pad0x7_V4S28[0x7];                                 // 0x31(0x7)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SoundNode: public Object
{
public:
	TArray<class SoundNode*>                                     ChildNodes;                                        // 0x28(0x10)
};


// Size 0x68 (Full Size[0x228] - InheritedSize[0x1c0]
class BlueprintGeneratedClass: public Class
{
public:
	int                                                          NumReplicatedProperties;                           // 0x1c0(0x4)
	char                                                         pad0x4_Y32FD[0x4];                                 // 0x1c4(0x4)
	TArray<class DynamicBlueprintBinding*>                       DynamicBindingObjects;                             // 0x1c8(0x10)
	TArray<class ActorComponent*>                                ComponentTemplates;                                // 0x1d8(0x10)
	TArray<class TimelineTemplate*>                              Timelines;                                         // 0x1e8(0x10)
	class SimpleConstructionScript*                              SimpleConstructionScript;                          // 0x1f8(0x8)
	class InheritableComponentHandler*                           InheritableComponentHandler;                       // 0x200(0x8)
	class StructProperty*                                        UberGraphFramePointerProperty;                     // 0x208(0x8)
	class Function*                                              UberGraphFunction;                                 // 0x210(0x8)
	TArray<struct EventGraphFastCallPair>                        FastCallPairs;                                     // 0x218(0x10)
};


// Size 0x378 (Full Size[0x3a0] - InheritedSize[0x28]
class Actor: public Object
{
public:
	struct ActorTickFunction                                     PrimaryActorTick;                                  // 0x28(0x50)
	float                                                        CustomTimeDilation;                                // 0x78(0x4)
	bool                                                         bAllowRemovalFromServerWhenCollisionMerged;        // 0x7c(0x1)
	bool                                                         bAllowRemovalFromServerWhenAutomaticallyInstanced; // 0x7c(0x1)
	bool                                                         bHidden;                                           // 0x7c(0x1)
	bool                                                         bNetTemporary;                                     // 0x7c(0x1)
	bool                                                         bNetStartup;                                       // 0x7c(0x1)
	bool                                                         bOnlyRelevantToOwner;                              // 0x7c(0x1)
	bool                                                         bAlwaysRelevant;                                   // 0x7c(0x1)
	bool                                                         bReplicateMovement;                                // 0x7c(0x1)
	bool                                                         bTearOff;                                          // 0x7d(0x1)
	bool                                                         bExchangedRoles;                                   // 0x7d(0x1)
	bool                                                         bPendingNetUpdate;                                 // 0x7d(0x1)
	bool                                                         bNetLoadOnClient;                                  // 0x7d(0x1)
	bool                                                         bNetUseOwnerRelevancy;                             // 0x7d(0x1)
	bool                                                         bBlockInput;                                       // 0x7d(0x1)
	bool                                                         bCanBeInCluster;                                   // 0x7d(0x1)
	bool                                                         bActorEnableCollision;                             // 0x7e(0x1)
	bool                                                         bReplicateAttachment;                              // 0x7e(0x1)
	bool                                                         bCollideWhenPlacing;                               // 0x7e(0x1)
	bool                                                         bFindCameraComponentWhenViewTarget;                // 0x7e(0x1)
	bool                                                         bRelevantForNetworkReplays;                        // 0x7f(0x1)
	bool                                                         bActorVisible;                                     // 0x7f(0x1)
	bool                                                         bAutoDestroyWhenFinished;                          // 0x7f(0x1)
	bool                                                         bCanBeDamaged;                                     // 0x7f(0x1)
	bool                                                         bReplicates;                                       // 0x7f(0x1)
	bool                                                         bAllowReceiveTickEventOnDedicatedServer;           // 0x7f(0x1)
	bool                                                         bActorIsBeingDestroyed;                            // 0x7f(0x1)
	char                                                         RemoteRole;                                        // 0x83(0x1)
	char                                                         Role;                                              // 0x84(0x1)
	char                                                         SpawnRestrictions;                                 // 0x85(0x1)
	char                                                         pad0x1_HLQ7L[0x1];                                 // 0x86(0x1)
	char                                                         AutoReceiveInput;                                  // 0x87(0x1)
	class Actor*                                                 Owner;                                             // 0x88(0x8)
	struct RepMovement                                           ReplicatedMovement;                                // 0x90(0x38)
	struct RepAttachment                                         AttachmentReplication;                             // 0xc8(0x48)
	char                                                         pad0x4_4NAD7[0x4];                                 // 0x110(0x4)
	int                                                          InputPriority;                                     // 0x114(0x4)
	class InputComponent*                                        InputComponent;                                    // 0x118(0x8)
	float                                                        NetCullDistanceSquared;                            // 0x120(0x4)
	char                                                         pad0x4_WXP16[0x4];                                 // 0x124(0x4)
	int                                                          NetTag;                                            // 0x128(0x4)
	float                                                        NetUpdateTime;                                     // 0x12c(0x4)
	float                                                        NetUpdateFrequency;                                // 0x130(0x4)
	float                                                        NetPriority;                                       // 0x134(0x4)
	float                                                        LastNetUpdateTime;                                 // 0x138(0x4)
	struct FName                                                 NetDriverName;                                     // 0x13c(0x8)
	char                                                         pad0x4_NJNHS[0x4];                                 // 0x144(0x4)
	class Pawn*                                                  Instigator;                                        // 0x148(0x8)
	TArray<class Actor*>                                         Children;                                          // 0x150(0x10)
	class SceneComponent*                                        RootComponent;                                     // 0x160(0x8)
	TArray<class MatineeActor*>                                  ControllingMatineeActors;                          // 0x168(0x10)
	float                                                        InitialLifeSpan;                                   // 0x178(0x4)
	char                                                         pad0x4_IS9OJ[0x4];                                 // 0x17c(0x4)
	TArray<struct Name>                                          Layers;                                            // 0x180(0x10)
	struct ActorPtr                                              ParentComponentActor;                              // 0x190(0x8)
	TArray<uintptr_t>                                            ChildComponentActors;                              // 0x198(0x10)
	bool                                                         bActorSeamlessTraveled;                            // 0x1a8(0x1)
	bool                                                         bIgnoresOriginShifting;                            // 0x1a8(0x1)
	bool                                                         bEnableAutoLODGeneration;                          // 0x1a8(0x1)
	bool                                                         InvertFeatureCheck;                                // 0x1a8(0x1)
	char                                                         pad0x3_39INR[0x3];                                 // 0x1a9(0x3)
	struct FName                                                 Feature;                                           // 0x1ac(0x8)
	char                                                         pad0x4_RXW51[0x4];                                 // 0x1b4(0x4)
	TArray<struct Name>                                          Tags;                                              // 0x1b8(0x10)
	bool                                                         bDoOverlapNotifiesOnLoad;                          // 0x1d5(0x1)
	char                                                         SpawnCollisionHandlingMethod;                      // 0x1d6(0x1)
	char                                                         pad0x129_478XC[0x129];                             // 0x1d7(0x129)
	TArray<class ActorComponent*>                                BlueprintCreatedComponents;                        // 0x300(0x10)
	TArray<class ActorComponent*>                                InstanceComponents;                                // 0x310(0x10)
	TArray<class Actor*>                                         ChildActorInterfaceProviders;                      // 0x320(0x10)
	char                                                         pad0x68_02XJO[0x68];                               // 0x330(0x68)
	double                                                       DormancyLingeringInSeconds;                        // 0x398(0x8)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class InterpTrack: public Object
{
public:
	char                                                         pad0x10_BMVP0[0x10];                               // 0x28(0x10)
	TArray<class InterpTrack*>                                   SubTracks;                                         // 0x38(0x10)
	class UClass*                                                TrackInstClass;                                    // 0x48(0x8)
	char                                                         ActiveCondition;                                   // 0x50(0x1)
	char                                                         pad0x7_U2Y7L[0x7];                                 // 0x51(0x7)
	struct FString                                               TrackTitle;                                        // 0x58(0x10)
	bool                                                         bOnePerGroup;                                      // 0x68(0x1)
	bool                                                         bDirGroupOnly;                                     // 0x68(0x1)
	bool                                                         bDisableTrack;                                     // 0x68(0x1)
	bool                                                         bIsSelected;                                       // 0x68(0x1)
	bool                                                         bIsAnimControlTrack;                               // 0x68(0x1)
	bool                                                         bSubTrackOnly;                                     // 0x68(0x1)
	bool                                                         bVisible;                                          // 0x68(0x1)
	bool                                                         bIsRecording;                                      // 0x68(0x1)
	char                                                         pad0x7_PUC9U[0x7];                                 // 0x69(0x7)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class NavArea: public Object
{
public:
	float                                                        DefaultCost;                                       // 0x28(0x4)
	float                                                        FixedAreaEnteringCost;                             // 0x2c(0x4)
	struct Color                                                 DrawColor;                                         // 0x30(0x4)
	struct NavAgentSelector                                      SupportedAgents;                                   // 0x34(0x4)
	bool                                                         bSupportsAgent0;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent1;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent2;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent3;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent4;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent5;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent6;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent7;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent8;                                   // 0x39(0x1)
	bool                                                         bSupportsAgent9;                                   // 0x39(0x1)
	bool                                                         bSupportsAgent10;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent11;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent12;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent13;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent14;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent15;                                  // 0x39(0x1)
	char                                                         pad0x6_W4N6Y[0x6];                                 // 0x3a(0x6)
};


// Size 0xb0 (Full Size[0xd8] - InheritedSize[0x28]
class FontImportOptions: public Object
{
public:
	struct FontImportOptionsData                                 Data;                                              // 0x28(0xb0)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class EdGraphNode: public Object
{
public:
	TArray<class EdGraphPin*>                                    Pins;                                              // 0x28(0x10)
	int                                                          NodePosX;                                          // 0x38(0x4)
	int                                                          NodePosY;                                          // 0x3c(0x4)
	int                                                          NodeWidth;                                         // 0x40(0x4)
	int                                                          NodeHeight;                                        // 0x44(0x4)
	bool                                                         bHasCompilerMessage;                               // 0x48(0x1)
	char                                                         pad0x7_G5DKD[0x7];                                 // 0x49(0x7)
	struct FString                                               NodeComment;                                       // 0x50(0x10)
	bool                                                         bCommentBubblePinned;                              // 0x60(0x1)
	bool                                                         bCommentBubbleVisible;                             // 0x61(0x1)
	char                                                         pad0x2_1Y4Z1[0x2];                                 // 0x62(0x2)
	int                                                          ErrorType;                                         // 0x64(0x4)
	struct FString                                               ErrorMsg;                                          // 0x68(0x10)
	struct Guid                                                  NodeGuid;                                          // 0x78(0x10)
	char                                                         AdvancedPinDisplay;                                // 0x88(0x1)
	bool                                                         bIsNodeEnabled;                                    // 0x89(0x1)
	bool                                                         bIsDebugFunction;                                  // 0x8a(0x1)
	char                                                         pad0x5_K6VFX[0x5];                                 // 0x8b(0x5)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class DataTable: public Object
{
public:
	class ScriptStruct*                                          RowStruct;                                         // 0x28(0x8)
	char                                                         pad0x50_1D5SP[0x50];                               // 0x30(0x50)
};


// Size 0x100 (Full Size[0x128] - InheritedSize[0x28]
class HapticFeedbackEffect: public Object
{
public:
	struct HapticFeedbackDetails                                 HapticDetails;                                     // 0x28(0x100)
};


// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class AvoidanceManager: public Object
{
public:
	char                                                         pad0x8_1758V[0x8];                                 // 0x28(0x8)
	float                                                        DefaultTimeToLive;                                 // 0x30(0x4)
	float                                                        LockTimeAfterAvoid;                                // 0x34(0x4)
	float                                                        LockTimeAfterClean;                                // 0x38(0x4)
	float                                                        DeltaTimeToPredict;                                // 0x3c(0x4)
	float                                                        ArtificialRadiusExpansion;                         // 0x40(0x4)
	float                                                        TestHeightDifference;                              // 0x44(0x4)
	char                                                         pad0x80_A0FHT[0x80];                               // 0x48(0x80)
};


// Size 0xc8 (Full Size[0xf0] - InheritedSize[0x28]
class Console: public Object
{
public:
	char                                                         pad0x10_OA95P[0x10];                               // 0x28(0x10)
	class LocalPlayer*                                           ConsoleTargetPlayer;                               // 0x38(0x8)
	class Texture2D*                                             DefaultTexture_Black;                              // 0x40(0x8)
	class Texture2D*                                             DefaultTexture_White;                              // 0x48(0x8)
	char                                                         pad0x18_7FHUR[0x18];                               // 0x50(0x18)
	TArray<String>                                               HistoryBuffer;                                     // 0x68(0x10)
	char                                                         pad0x78_Z9CMX[0x78];                               // 0x78(0x78)
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class ParticleEmitter: public Object
{
public:
	struct FName                                                 EmitterName;                                       // 0x28(0x8)
	char                                                         pad0x4_2K7A7[0x4];                                 // 0x30(0x4)
	int                                                          SubUVDataOffset;                                   // 0x34(0x4)
	char                                                         EmitterRenderMode;                                 // 0x38(0x1)
	char                                                         pad0x7_ZBOWM[0x7];                                 // 0x39(0x7)
	TArray<class ParticleLODLevel*>                              LODLevels;                                         // 0x40(0x10)
	bool                                                         ConvertedModules;                                  // 0x50(0x1)
	char                                                         pad0x3_B59GN[0x3];                                 // 0x51(0x3)
	int                                                          PeakActiveParticles;                               // 0x54(0x4)
	int                                                          InitialAllocationCount;                            // 0x58(0x4)
	float                                                        MediumDetailSpawnRateScale;                        // 0x5c(0x4)
	float                                                        QualityLevelSpawnRateScale;                        // 0x60(0x4)
	char                                                         DetailMode;                                        // 0x64(0x1)
	char                                                         MaxEmitterQuality;                                 // 0x65(0x1)
	char                                                         MinEmitterQuality;                                 // 0x66(0x1)
	char                                                         pad0x1_HKBE1[0x1];                                 // 0x67(0x1)
	bool                                                         bIsSoloing;                                        // 0x68(0x1)
	bool                                                         bCookedOut;                                        // 0x68(0x1)
	bool                                                         bDisabledLODsKeepEmitterAlive;                     // 0x68(0x1)
	bool                                                         bHasAnyEnabledLODs;                                // 0x68(0x1)
	bool                                                         bHasAnyEnabledLODsValid;                           // 0x68(0x1)
	char                                                         pad0x3f_OVOWD[0x3f];                               // 0x69(0x3f)
	TArray<class ParticleModule*>                                ModulesNeedingInstanceData;                        // 0xa8(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class PhysicsCollisionHandler: public Object
{
public:
	float                                                        ImpactThreshold;                                   // 0x28(0x4)
	float                                                        ImpactReFireDelay;                                 // 0x2c(0x4)
	class SoundBase*                                             DefaultImpactSound;                                // 0x30(0x8)
	float                                                        LastImpactSoundTime;                               // 0x38(0x4)
	char                                                         pad0x4_7U6R3[0x4];                                 // 0x3c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_Animatable: public Interface
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class Rig: public Object
{
public:
	TArray<struct TransformBase>                                 TransformBases;                                    // 0x28(0x10)
	TArray<struct Node>                                          Nodes;                                             // 0x38(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class NavigationQueryFilter: public Object
{
public:
	TArray<struct NavigationFilterArea>                          Areas;                                             // 0x28(0x10)
	struct NavigationFilterFlags                                 IncludeFlags;                                      // 0x38(0x4)
	struct NavigationFilterFlags                                 ExcludeFlags;                                      // 0x3c(0x4)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class InterpCurveEdSetup: public Object
{
public:
	TArray<struct CurveEdTab>                                    Tabs;                                              // 0x28(0x10)
	int                                                          ActiveTab;                                         // 0x38(0x4)
	char                                                         pad0x4_57MJN[0x4];                                 // 0x3c(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class Distribution: public Object
{
public:
	char                                                         pad0x8_E58NM[0x8];                                 // 0x28(0x8)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class Commandlet: public Object
{
public:
	struct FString                                               HelpDescription;                                   // 0x28(0x10)
	struct FString                                               HelpUsage;                                         // 0x38(0x10)
	struct FString                                               HelpWebLink;                                       // 0x48(0x10)
	TArray<String>                                               HelpParamNames;                                    // 0x58(0x10)
	TArray<String>                                               HelpParamDescriptions;                             // 0x68(0x10)
	bool                                                         IsServer;                                          // 0x78(0x1)
	bool                                                         IsClient;                                          // 0x78(0x1)
	bool                                                         IsEditor;                                          // 0x78(0x1)
	bool                                                         LogToConsole;                                      // 0x78(0x1)
	bool                                                         ShowErrorCount;                                    // 0x78(0x1)
	char                                                         pad0x7_D6G1P[0x7];                                 // 0x79(0x7)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class SoundBase: public Object
{
public:
	class SoundClass*                                            SoundClassObject;                                  // 0x28(0x8)
	bool                                                         bDebug;                                            // 0x30(0x1)
	char                                                         pad0x3_FECDB[0x3];                                 // 0x31(0x3)
	char                                                         MaxConcurrentResolutionRule;                       // 0x34(0x1)
	char                                                         pad0x3_Z0WRH[0x3];                                 // 0x35(0x3)
	int                                                          MaxConcurrentPlayCount;                            // 0x38(0x4)
	float                                                        Duration;                                          // 0x3c(0x4)
	class SoundAttenuation*                                      AttenuationSettings;                               // 0x40(0x8)
	char                                                         pad0x8_6VJHX[0x8];                                 // 0x48(0x8)
};


// Size 0x588 (Full Size[0x5b0] - InheritedSize[0x28]
class CameraAnim: public Object
{
public:
	class InterpGroup*                                           CameraInterpGroup;                                 // 0x28(0x8)
	float                                                        AnimLength;                                        // 0x30(0x4)
	struct Box                                                   BoundingBox;                                       // 0x34(0x1c)
	bool                                                         bRelativeToInitialTransform;                       // 0x50(0x1)
	char                                                         pad0x3_0XBNY[0x3];                                 // 0x51(0x3)
	float                                                        BaseFOV;                                           // 0x54(0x4)
	char                                                         pad0x8_XJ48J[0x8];                                 // 0x58(0x8)
	struct PostProcessSettings                                   BasePostProcessSettings;                           // 0x60(0x540)
	float                                                        BasePostProcessBlendWeight;                        // 0x5a0(0x4)
	char                                                         pad0xc_RPEUZ[0xc];                                 // 0x5a4(0xc)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WaterId: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EngineCustomTimeStep: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlueprintFunctionLibrary: public Object
{
public:
};


// Size 0x2a0 (Full Size[0x2c8] - InheritedSize[0x28]
class BodySetup: public Object
{
public:
	struct KAggregateGeom                                        AggGeom;                                           // 0x28(0x48)
	struct FName                                                 BoneName;                                          // 0x70(0x8)
	char                                                         PhysicsType;                                       // 0x78(0x1)
	char                                                         pad0x3_5JXZN[0x3];                                 // 0x79(0x3)
	bool                                                         bCookComplexGeometryOnServer;                      // 0x7c(0x1)
	bool                                                         bConsiderForBounds;                                // 0x7c(0x1)
	bool                                                         bMeshCollideAll;                                   // 0x7c(0x1)
	bool                                                         bDoubleSidedGeometry;                              // 0x7c(0x1)
	bool                                                         bGenerateNonMirroredCollision;                     // 0x7c(0x1)
	bool                                                         bSharedCookedData;                                 // 0x7c(0x1)
	bool                                                         bGenerateMirroredCollision;                        // 0x7c(0x1)
	char                                                         pad0x3_XDXNW[0x3];                                 // 0x7d(0x3)
	class PhysicalMaterial*                                      PhysMaterial;                                      // 0x80(0x8)
	char                                                         CollisionReponse;                                  // 0x88(0x1)
	char                                                         CollisionTraceFlag;                                // 0x89(0x1)
	char                                                         pad0x6_KA0OM[0x6];                                 // 0x8a(0x6)
	struct BodyInstance                                          DefaultInstance;                                   // 0x90(0x180)
	struct WalkableSlopeOverride                                 WalkableSlopeOverride;                             // 0x210(0x8)
	struct Vector                                                BuildScale3D;                                      // 0x218(0xc)
	char                                                         pad0xa4_9FKUB[0xa4];                               // 0x224(0xa4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NetworkPredictionInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CustomWidgetDrawerInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InterpFilter: public Object
{
public:
	struct FString                                               Caption;                                           // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AnimMetaData: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EngineTypes: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ImportantToggleSettingInterface: public Interface
{
public:
};


// Size 0x110 (Full Size[0x138] - InheritedSize[0x28]
class HIKCharacterization: public Object
{
public:
	struct FName                                                 Reference;                                         // 0x28(0x8)
	struct FName                                                 Hips;                                              // 0x30(0x8)
	struct FName                                                 LeftUpLeg;                                         // 0x38(0x8)
	struct FName                                                 LeftLeg;                                           // 0x40(0x8)
	struct FName                                                 LeftFoot;                                          // 0x48(0x8)
	struct FName                                                 RightUpLeg;                                        // 0x50(0x8)
	struct FName                                                 RightLeg;                                          // 0x58(0x8)
	struct FName                                                 RightFoot;                                         // 0x60(0x8)
	struct FName                                                 Spine;                                             // 0x68(0x8)
	struct FName                                                 LeftArm;                                           // 0x70(0x8)
	struct FName                                                 LeftForeArm;                                       // 0x78(0x8)
	struct FName                                                 LeftHand;                                          // 0x80(0x8)
	struct FName                                                 RightArm;                                          // 0x88(0x8)
	struct FName                                                 RightForeArm;                                      // 0x90(0x8)
	struct FName                                                 RightHand;                                         // 0x98(0x8)
	struct FName                                                 Head;                                              // 0xa0(0x8)
	TArray<struct HIKBoneTransform>                              BoneTransforms;                                    // 0xa8(0x10)
	bool                                                         Locked;                                            // 0xb8(0x1)
	char                                                         pad0x7_WKYFS[0x7];                                 // 0xb9(0x7)
	TArray<int>                                                  UnrealToHumanIKBoneMapping;                        // 0xc0(0x10)
	TArray<struct HIKBoneMapping>                                AdditionalBones;                                   // 0xd0(0x10)
	bool                                                         LeftElbowInverted;                                 // 0xe0(0x1)
	bool                                                         RightElbowInverted;                                // 0xe1(0x1)
	bool                                                         LeftKneeInverted;                                  // 0xe2(0x1)
	bool                                                         RightKneeInverted;                                 // 0xe3(0x1)
	bool                                                         AdjustLeftShoulder;                                // 0xe4(0x1)
	char                                                         pad0x3_C6HX7[0x3];                                 // 0xe5(0x3)
	struct Vector                                                AdjustLeftShoulder_Axis;                           // 0xe8(0xc)
	float                                                        AdjustLeftShoulder_Angle;                          // 0xf4(0x4)
	bool                                                         AdjustRightShoulder;                               // 0xf8(0x1)
	char                                                         pad0x3_OBBG5[0x3];                                 // 0xf9(0x3)
	struct Vector                                                AdjustRightShoulder_Axis;                          // 0xfc(0xc)
	float                                                        AdjustRightShoulder_Angle;                         // 0x108(0x4)
	bool                                                         SpineSquashNStretch;                               // 0x10c(0x1)
	bool                                                         NeckSquashNStretch;                                // 0x10d(0x1)
	char                                                         pad0x2_U5PPU[0x2];                                 // 0x10e(0x2)
	float                                                        SpineJointsMinSquashNStretchFactor;                // 0x110(0x4)
	float                                                        SpineJointsMaxSquashNStretchFactor;                // 0x114(0x4)
	float                                                        NeckJointsMinSquashNStretchFactor;                 // 0x118(0x4)
	float                                                        NeckJointsMaxSquashNStretchFactor;                 // 0x11c(0x4)
	bool                                                         bInitFromSkeleton;                                 // 0x120(0x1)
	char                                                         pad0x3_0KP83[0x3];                                 // 0x121(0x3)
	int                                                          InitFromSkeletonCount;                             // 0x124(0x4)
	struct Rotator                                               ImportRotator;                                     // 0x128(0xc)
	char                                                         pad0x4_LI46Q[0x4];                                 // 0x134(0x4)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class CurveTable: public Object
{
public:
	char                                                         pad0x50_CYFUW[0x50];                               // 0x28(0x50)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PlatformInterfaceBase: public Object
{
public:
	TArray<struct DelegateArray>                                 AllDelegates;                                      // 0x28(0x10)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class MaterialInterface: public Object
{
public:
	char                                                         pad0x8_2FE2G[0x8];                                 // 0x28(0x8)
	class SubsurfaceProfile*                                     SubsurfaceProfile;                                 // 0x30(0x8)
	char                                                         pad0x4_RLUH6[0x4];                                 // 0x38(0x4)
	struct LightmassMaterialInterfaceSettings                    LightmassSettings;                                 // 0x3c(0x14)
	char                                                         pad0x8_K6XM6[0x8];                                 // 0x50(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class BoneMaskFilter: public Object
{
public:
	TArray<struct InputBlendPose>                                BlendPoses;                                        // 0x28(0x10)
};


// Size 0xf8 (Full Size[0x120] - InheritedSize[0x28]
class CameraAnimInst: public Object
{
public:
	class CameraAnim*                                            CamAnim;                                           // 0x28(0x8)
	class InterpGroupInst*                                       InterpGroupInst;                                   // 0x30(0x8)
	char                                                         pad0x1c_R3JBB[0x1c];                               // 0x38(0x1c)
	float                                                        PlayRate;                                          // 0x54(0x4)
	char                                                         pad0x10_N7VUG[0x10];                               // 0x58(0x10)
	class InterpTrackMove*                                       MoveTrack;                                         // 0x68(0x8)
	class InterpTrackInstMove*                                   MoveInst;                                          // 0x70(0x8)
	class CurveFloat*                                            BlendInCurve;                                      // 0x78(0x8)
	char                                                         PlaySpace;                                         // 0x80(0x1)
	char                                                         pad0x9f_1G7DT[0x9f];                               // 0x81(0x9f)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CameraViewTargetInterface: public Interface
{
public:
};


// Size 0xd8 (Full Size[0x100] - InheritedSize[0x28]
class PendingNetGame: public Object
{
public:
	char                                                         pad0x8_ZLHXW[0x8];                                 // 0x28(0x8)
	class NetDriver*                                             NetDriver;                                         // 0x30(0x8)
	char                                                         pad0xb0_7K9XS[0xb0];                               // 0x38(0xb0)
	class Package*                                               PreLoadedMapPackage;                               // 0xe8(0x8)
	class World*                                                 PreLoadedWorld;                                    // 0xf0(0x8)
	char                                                         pad0x8_60CZR[0x8];                                 // 0xf8(0x8)
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class SlateBrushAsset: public Object
{
public:
	struct SlateBrush                                            Brush;                                             // 0x28(0x90)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class TextureLODSettings: public Object
{
public:
	TArray<struct TextureLODGroup>                               TextureLODGroups;                                  // 0x28(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class AnimNotifyState: public Object
{
public:
	bool                                                         PlayedWithSequencer;                               // 0x28(0x1)
	char                                                         pad0x7_AB4A0[0x7];                                 // 0x29(0x7)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class DialogueVoice: public Object
{
public:
	char                                                         Gender;                                            // 0x28(0x1)
	char                                                         Plurality;                                         // 0x29(0x1)
	char                                                         pad0x2_A0JRP[0x2];                                 // 0x2a(0x2)
	struct Guid                                                  LocalizationGUID;                                  // 0x2c(0x10)
	char                                                         pad0x4_B35MI[0x4];                                 // 0x3c(0x4)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class InterpData: public Object
{
public:
	float                                                        InterpLength;                                      // 0x28(0x4)
	float                                                        PathBuildTime;                                     // 0x2c(0x4)
	TArray<class InterpGroup*>                                   InterpGroups;                                      // 0x30(0x10)
	class InterpCurveEdSetup*                                    CurveEdSetup;                                      // 0x40(0x8)
	float                                                        EdSectionStart;                                    // 0x48(0x4)
	float                                                        EdSectionEnd;                                      // 0x4c(0x4)
	bool                                                         bShouldBakeAndPrune;                               // 0x50(0x1)
	char                                                         pad0x7_RMAY9[0x7];                                 // 0x51(0x7)
	class InterpGroupDirector*                                   CachedDirectorGroup;                               // 0x58(0x8)
	TArray<struct Name>                                          AllEventNames;                                     // 0x60(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavigationTypes: public Object
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class ParticleModule: public Object
{
public:
	bool                                                         bSpawnModule;                                      // 0x28(0x1)
	bool                                                         bUpdateModule;                                     // 0x28(0x1)
	bool                                                         bFinalUpdateModule;                                // 0x28(0x1)
	bool                                                         bUpdateForGPUEmitter;                              // 0x28(0x1)
	bool                                                         bCurvesAsColor;                                    // 0x28(0x1)
	bool                                                         b3DDrawMode;                                       // 0x28(0x1)
	bool                                                         bSupported3DDrawMode;                              // 0x28(0x1)
	bool                                                         bEnabled;                                          // 0x28(0x1)
	bool                                                         bEditable;                                         // 0x29(0x1)
	bool                                                         LODDuplicate;                                      // 0x29(0x1)
	bool                                                         bSupportsRandomSeed;                               // 0x29(0x1)
	bool                                                         bRequiresLoopingNotification;                      // 0x29(0x1)
	char                                                         pad0x2_YM745[0x2];                                 // 0x2a(0x2)
	char                                                         LODValidity;                                       // 0x2c(0x1)
	char                                                         pad0x3_W4VCF[0x3];                                 // 0x2d(0x3)
	TArray<int>                                                  ModuleInstanceOffsets;                             // 0x30(0x10)
	TArray<int>                                                  ModuleOffsets;                                     // 0x40(0x10)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class SCS_Node: public Object
{
public:
	class ActorComponent*                                        ComponentTemplate;                                 // 0x28(0x8)
	struct FName                                                 VariableName;                                      // 0x30(0x8)
	struct FName                                                 AttachToName;                                      // 0x38(0x8)
	struct FName                                                 ParentComponentOrVariableName;                     // 0x40(0x8)
	struct FName                                                 ParentComponentOwnerClassName;                     // 0x48(0x8)
	bool                                                         bIsParentComponentNative;                          // 0x50(0x1)
	bool                                                         ServerMigrationFlagSet;                            // 0x51(0x1)
	char                                                         pad0x6_STPUM[0x6];                                 // 0x52(0x6)
	TArray<class SCS_Node*>                                      ChildNodes;                                        // 0x58(0x10)
	TArray<struct BPVariableMetaDataEntry>                       MetaDataArray;                                     // 0x68(0x10)
	struct Guid                                                  VariableGuid;                                      // 0x78(0x10)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class MaterialParameterCollection: public Object
{
public:
	struct Guid                                                  StateId;                                           // 0x28(0x10)
	TArray<struct CollectionScalarParameter>                     ScalarParameters;                                  // 0x38(0x10)
	TArray<struct CollectionVectorParameter>                     VectorParameters;                                  // 0x48(0x10)
	char                                                         pad0x8_U7DAC[0x8];                                 // 0x58(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AggregatorInterface: public Interface
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class BlueprintCore: public Object
{
public:
	class UClass*                                                SkeletonGeneratedClass;                            // 0x28(0x8)
	class UClass*                                                GeneratedClass;                                    // 0x30(0x8)
	bool                                                         bLegacyNeedToPurgeSkelRefs;                        // 0x38(0x1)
	bool                                                         bLegacyGeneratedClassIsAuthoritative;              // 0x39(0x1)
	char                                                         pad0x2_SRGMZ[0x2];                                 // 0x3a(0x2)
	struct Guid                                                  BlueprintGuid;                                     // 0x3c(0x10)
	char                                                         pad0x4_E7807[0x4];                                 // 0x4c(0x4)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class SoundMix: public Object
{
public:
	bool                                                         bApplyEQ;                                          // 0x28(0x1)
	char                                                         pad0x3_HOHFU[0x3];                                 // 0x29(0x3)
	float                                                        EQPriority;                                        // 0x2c(0x4)
	struct AudioEQEffect                                         EQSettings;                                        // 0x30(0x28)
	TArray<struct SoundClassAdjuster>                            SoundClassEffects;                                 // 0x58(0x10)
	float                                                        InitialDelay;                                      // 0x68(0x4)
	float                                                        FadeInTime;                                        // 0x6c(0x4)
	float                                                        Duration;                                          // 0x70(0x4)
	float                                                        FadeOutTime;                                       // 0x74(0x4)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class DialogueWave: public Object
{
public:
	bool                                                         bMature;                                           // 0x28(0x1)
	char                                                         pad0x7_V06NZ[0x7];                                 // 0x29(0x7)
	struct FString                                               SpokenText;                                        // 0x30(0x10)
	TArray<struct DialogueContextMapping>                        ContextMappings;                                   // 0x40(0x10)
	struct Guid                                                  LocalizationGUID;                                  // 0x50(0x10)
};


// Size 0xa8 (Full Size[0xd0] - InheritedSize[0x28]
class TextPropertyTestObject: public Object
{
public:
	struct FText                                                 DefaultedText;                                     // 0x28(0x38)
	struct FText                                                 UndefaultedText;                                   // 0x60(0x38)
	struct FText                                                 TransientText;                                     // 0x98(0x38)
};


// Size 0x1b0 (Full Size[0x1d8] - InheritedSize[0x28]
class Font: public Object
{
public:
	char                                                         pad0x8_6Q8BT[0x8];                                 // 0x28(0x8)
	char                                                         FontCacheType;                                     // 0x30(0x1)
	char                                                         pad0x7_LYYL6[0x7];                                 // 0x31(0x7)
	TArray<struct FontCharacter>                                 Characters;                                        // 0x38(0x10)
	TArray<class Texture2D*>                                     Textures;                                          // 0x48(0x10)
	int                                                          IsRemapped;                                        // 0x58(0x4)
	float                                                        EmScale;                                           // 0x5c(0x4)
	float                                                        Ascent;                                            // 0x60(0x4)
	float                                                        Descent;                                           // 0x64(0x4)
	float                                                        Leading;                                           // 0x68(0x4)
	int                                                          Kerning;                                           // 0x6c(0x4)
	struct FontImportOptionsData                                 ImportOptions;                                     // 0x70(0xb0)
	int                                                          NumCharacters;                                     // 0x120(0x4)
	char                                                         pad0x4_AIBN2[0x4];                                 // 0x124(0x4)
	TArray<int>                                                  MaxCharHeight;                                     // 0x128(0x10)
	float                                                        ScalingFactor;                                     // 0x138(0x4)
	int                                                          LegacyFontSize;                                    // 0x13c(0x4)
	struct FName                                                 LegacyFontName;                                    // 0x140(0x8)
	struct CompositeFont                                         CompositeFont;                                     // 0x148(0x28)
	char                                                         pad0x68_CZCRR[0x68];                               // 0x170(0x68)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavNodeInterface: public Interface
{
public:
};


// Size 0xc8 (Full Size[0xf0] - InheritedSize[0x28]
class MaterialParameterCollectionInstance: public Object
{
public:
	char                                                         pad0x8_3NR5S[0x8];                                 // 0x28(0x8)
	class MaterialParameterCollection*                           Collection;                                        // 0x30(0x8)
	class World*                                                 World;                                             // 0x38(0x8)
	char                                                         pad0xb0_3A6DO[0xb0];                               // 0x40(0xb0)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class LevelActorContainer: public Object
{
public:
	TArray<class Actor*>                                         Actors;                                            // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MatineeInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class CurveBase: public Object
{
public:
	char                                                         pad0x8_GCHW3[0x8];                                 // 0x28(0x8)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class DeviceProfileManager: public Object
{
public:
	TArray<class Object*>                                        Profiles;                                          // 0x28(0x10)
	char                                                         pad0x20_9T1IJ[0x20];                               // 0x38(0x20)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class MaterialFunction: public Object
{
public:
	struct Guid                                                  StateId;                                           // 0x28(0x10)
	struct FString                                               Description;                                       // 0x38(0x10)
	bool                                                         bExposeToLibrary;                                  // 0x48(0x1)
	char                                                         pad0x7_O14XD[0x7];                                 // 0x49(0x7)
	TArray<struct Text>                                          LibraryCategoriesText;                             // 0x50(0x10)
	TArray<class MaterialExpression*>                            FunctionExpressions;                               // 0x60(0x10)
	bool                                                         bReentrantFlag;                                    // 0x70(0x1)
	char                                                         pad0x7_4YYN5[0x7];                                 // 0x71(0x7)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class GPUSortDestData: public Object
{
public:
	char                                                         pad0x8_PPLPT[0x8];                                 // 0x28(0x8)
};


// Size 0x418 (Full Size[0x440] - InheritedSize[0x28]
class AnimInstance: public Object
{
public:
	class Skeleton*                                              CurrentSkeleton;                                   // 0x28(0x8)
	TArray<struct AnimTickRecord>                                UngroupedActivePlayers;                            // 0x30(0x10)
	TArray<struct AnimGroupInstance>                             SyncGroups;                                        // 0x40(0x10)
	TArray<struct ActiveVertexAnim>                              VertexAnims;                                       // 0x50(0x10)
	char                                                         RootMotionMode;                                    // 0x60(0x1)
	bool                                                         bWarnAboutBlueprintUsage;                          // 0x61(0x1)
	char                                                         pad0x6_L17KB[0x6];                                 // 0x62(0x6)
	bool                                                         bQueueMontageEvents;                               // 0x148(0x1)
	char                                                         pad0xf7_A88CD[0xf7];                               // 0x149(0xf7)
	TArray<struct AnimNotifyEvent>                               ActiveAnimNotifyState;                             // 0x240(0x10)
	char                                                         pad0x100_U8QR2[0x100];                             // 0x250(0x100)
	bool                                                         bBoneCachesInvalidated;                            // 0x3a8(0x1)
	char                                                         pad0x8f_XDRSQ[0x8f];                               // 0x3a9(0x8f)
	bool                                                         bBlueprintAnimUpdateEnabled;                       // 0x438(0x1)
	char                                                         pad0x7_URDSW[0x7];                                 // 0x439(0x7)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class ReverbEffect: public Object
{
public:
	float                                                        Density;                                           // 0x28(0x4)
	float                                                        Diffusion;                                         // 0x2c(0x4)
	float                                                        Gain;                                              // 0x30(0x4)
	float                                                        GainHF;                                            // 0x34(0x4)
	float                                                        DecayTime;                                         // 0x38(0x4)
	float                                                        DecayHFRatio;                                      // 0x3c(0x4)
	float                                                        ReflectionsGain;                                   // 0x40(0x4)
	float                                                        ReflectionsDelay;                                  // 0x44(0x4)
	float                                                        LateGain;                                          // 0x48(0x4)
	float                                                        LateDelay;                                         // 0x4c(0x4)
	float                                                        AirAbsorptionGainHF;                               // 0x50(0x4)
	float                                                        RoomRolloffFactor;                                 // 0x54(0x4)
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class ActorComponent: public Object
{
public:
	char                                                         TargetNetDormancy;                                 // 0x28(0x1)
	char                                                         CreationMethod;                                    // 0x29(0x1)
	char                                                         pad0x6_2ALF6[0x6];                                 // 0x2a(0x6)
	struct ActorComponentTickFunction                            PrimaryComponentTick;                              // 0x30(0x50)
	TArray<struct Name>                                          ComponentTags;                                     // 0x80(0x10)
	TArray<struct SimpleMemberReference>                         UCSModifiedProperties;                             // 0x90(0x10)
	char                                                         pad0x10_VLNVW[0x10];                               // 0xa0(0x10)
	bool                                                         bReplicates;                                       // 0xb0(0x1)
	bool                                                         bNetAddressable;                                   // 0xb0(0x1)
	bool                                                         bAutoActivate;                                     // 0xb1(0x1)
	bool                                                         bIsActive;                                         // 0xb1(0x1)
	bool                                                         bEditableWhenInherited;                            // 0xb2(0x1)
	bool                                                         bNeedsLoadForClient;                               // 0xb3(0x1)
	bool                                                         bNeedsLoadForServer;                               // 0xb3(0x1)
	char                                                         pad0x4_Z68GQ[0x4];                                 // 0xb4(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavRelevantInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class CameraModifier: public Object
{
public:
	bool                                                         bDebug;                                            // 0x28(0x1)
	bool                                                         bExclusive;                                        // 0x28(0x1)
	char                                                         pad0x3_E3REM[0x3];                                 // 0x29(0x3)
	char                                                         Priority;                                          // 0x2c(0x1)
	char                                                         pad0x3_B1GD2[0x3];                                 // 0x2d(0x3)
	class PlayerCameraManager*                                   CameraOwner;                                       // 0x30(0x8)
	float                                                        AlphaInTime;                                       // 0x38(0x4)
	float                                                        AlphaOutTime;                                      // 0x3c(0x4)
	float                                                        Alpha;                                             // 0x40(0x4)
	bool                                                         bAutoDestroyOnCompletion;                          // 0x44(0x1)
	char                                                         pad0x3_GP1DC[0x3];                                 // 0x45(0x3)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EngineBaseTypes: public Object
{
public:
};


// Size 0x2d8 (Full Size[0x300] - InheritedSize[0x28]
class Level: public Object
{
public:
	char                                                         pad0xa0_NNZKT[0xa0];                               // 0x28(0xa0)
	class LevelActorContainer*                                   ActorCluster;                                      // 0xc8(0x8)
	class World*                                                 OwningWorld;                                       // 0xd0(0x8)
	class Model*                                                 Model;                                             // 0xd8(0x8)
	TArray<class ModelComponent*>                                ModelComponents;                                   // 0xe0(0x10)
	class LevelScriptActor*                                      LevelScriptActor;                                  // 0xf0(0x8)
	class NavigationObjectBase*                                  NavListStart;                                      // 0xf8(0x8)
	class NavigationObjectBase*                                  NavListEnd;                                        // 0x100(0x8)
	TArray<class NavigationDataChunk*>                           NavDataChunks;                                     // 0x108(0x10)
	float                                                        LightmapTotalSize;                                 // 0x118(0x4)
	float                                                        ShadowmapTotalSize;                                // 0x11c(0x4)
	TArray<struct Vector>                                        StaticNavigableGeometry;                           // 0x120(0x10)
	char                                                         pad0x130_LM1S9[0x130];                             // 0x130(0x130)
	bool                                                         LevelVisibility;                                   // 0x260(0x1)
	char                                                         pad0xf_6L22L[0xf];                                 // 0x261(0xf)
	bool                                                         Blocked;                                           // 0x270(0x1)
	char                                                         pad0x67_KQMFF[0x67];                               // 0x271(0x67)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x2d8(0x10)
	char                                                         pad0x18_AQ2ZE[0x18];                               // 0x2e8(0x18)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class InterpGroup: public Object
{
public:
	char                                                         pad0x8_VJWJS[0x8];                                 // 0x28(0x8)
	TArray<class InterpTrack*>                                   InterpTracks;                                      // 0x30(0x10)
	struct FName                                                 GroupName;                                         // 0x40(0x8)
	struct Color                                                 GroupColor;                                        // 0x48(0x4)
	bool                                                         bCollapsed;                                        // 0x4c(0x1)
	bool                                                         bVisible;                                          // 0x4c(0x1)
	bool                                                         bIsFolder;                                         // 0x4c(0x1)
	bool                                                         bIsParented;                                       // 0x4c(0x1)
	bool                                                         bIsSelected;                                       // 0x4c(0x1)
	char                                                         pad0x3_2TZQK[0x3];                                 // 0x4d(0x3)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EdGraphSchema: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ParticleModuleEventSendToGame: public Object
{
public:
};


// Size 0x878 (Full Size[0x8a0] - InheritedSize[0x28]
class World: public Object
{
public:
	char                                                         pad0x8_N82HR[0x8];                                 // 0x28(0x8)
	class NetDriver*                                             NetDriver;                                         // 0x30(0x8)
	class LineBatchComponent*                                    LineBatcher;                                       // 0x38(0x8)
	class GameState*                                             GameState;                                         // 0x40(0x8)
	class GameNetworkManager*                                    NetworkManager;                                    // 0x48(0x8)
	char                                                         pad0x10_QX4OZ[0x10];                               // 0x50(0x10)
	class Level*                                                 PersistentLevel;                                   // 0x60(0x8)
	char                                                         pad0x20_RBDCB[0x20];                               // 0x68(0x20)
	class PhysicsCollisionHandler*                               PhysicsCollisionHandler;                           // 0x88(0x8)
	TArray<class Object*>                                        ExtraReferencedObjects;                            // 0x90(0x10)
	class LineBatchComponent*                                    PersistentLineBatcher;                             // 0xa0(0x8)
	class LineBatchComponent*                                    ForegroundLineBatcher;                             // 0xa8(0x8)
	TArray<class Object*>                                        PerModuleDataObjects;                              // 0xb0(0x10)
	TArray<class LevelStreaming*>                                StreamingLevels;                                   // 0xc0(0x10)
	struct FString                                               StreamingLevelsPrefix;                             // 0xd0(0x10)
	class Level*                                                 CurrentLevelPendingVisibility;                     // 0xe0(0x8)
	class ParticleEventManager*                                  MyParticleEventManager;                            // 0xe8(0x8)
	class PhysicsVolume*                                         DefaultPhysicsVolume;                              // 0xf0(0x8)
	TArray<class LevelStreaming*>                                DirtyStreamingLevels;                              // 0xf8(0x10)
	char                                                         pad0x1c_9QYMR[0x1c];                               // 0x108(0x1c)
	struct FName                                                 Feature;                                           // 0x124(0x8)
	char                                                         pad0x4_2GSE9[0x4];                                 // 0x12c(0x4)
	TArray<struct Name>                                          FeatureReferences;                                 // 0x130(0x10)
	bool                                                         ParticleLOD_bUseGameThread;                        // 0x140(0x1)
	bool                                                         ParticleLOD_bUseMultipleViewportCase;              // 0x141(0x1)
	char                                                         pad0x2_PNYQ8[0x2];                                 // 0x142(0x2)
	struct Vector                                                ParticleLOD_PlayerViewpointLocation;               // 0x144(0xc)
	struct FString                                               TestMetadata;                                      // 0x150(0x10)
	class NavigationSystem*                                      NavigationSystem;                                  // 0x160(0x8)
	char                                                         pad0x20_42LPZ[0x20];                               // 0x168(0x20)
	class GameMode*                                              AuthorityGameMode;                                 // 0x188(0x8)
	class AISystemBase*                                          AISystem;                                          // 0x190(0x8)
	class AvoidanceManager*                                      AvoidanceManager;                                  // 0x198(0x8)
	TArray<class Level*>                                         Levels;                                            // 0x1a0(0x10)
	char                                                         pad0x70_OM5K1[0x70];                               // 0x1b0(0x70)
	class Level*                                                 CurrentLevel;                                      // 0x220(0x8)
	char                                                         pad0x28_KLF58[0x28];                               // 0x228(0x28)
	class GameInstance*                                          OwningGameInstance;                                // 0x250(0x8)
	char                                                         pad0x10_2OUY1[0x10];                               // 0x258(0x10)
	TArray<class MaterialParameterCollectionInstance*>           ParameterCollectionInstances;                      // 0x268(0x10)
	char                                                         pad0x550_6K19C[0x550];                             // 0x278(0x550)
	class WorldComposition*                                      WorldComposition;                                  // 0x7c8(0x8)
	char                                                         pad0x3d_TNCNU[0x3d];                               // 0x7d0(0x3d)
	bool                                                         bAreConstraintsDirty;                              // 0x80d(0x1)
	char                                                         pad0x92_O9682[0x92];                               // 0x80e(0x92)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class BrushBuilder: public Object
{
public:
	struct FString                                               BitmapFilename;                                    // 0x28(0x10)
	struct FString                                               Tooltip;                                           // 0x38(0x10)
	bool                                                         NotifyBadParams;                                   // 0x48(0x1)
	char                                                         pad0x7_T1WPN[0x7];                                 // 0x49(0x7)
	TArray<struct Vector>                                        Vertices;                                          // 0x50(0x10)
	TArray<struct BuilderPoly>                                   Polys;                                             // 0x60(0x10)
	struct FName                                                 Layer;                                             // 0x70(0x8)
	bool                                                         MergeCoplanars;                                    // 0x78(0x1)
	char                                                         pad0x7_FDM4Q[0x7];                                 // 0x79(0x7)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class SkeletalMeshSocket: public Object
{
public:
	struct FName                                                 SocketName;                                        // 0x28(0x8)
	struct FName                                                 BoneName;                                          // 0x30(0x8)
	struct Vector                                                RelativeLocation;                                  // 0x38(0xc)
	struct Rotator                                               RelativeRotation;                                  // 0x44(0xc)
	struct Vector                                                RelativeScale;                                     // 0x50(0xc)
	bool                                                         bForceAlwaysAnimated;                              // 0x5c(0x1)
	char                                                         pad0x3_PALF8[0x3];                                 // 0x5d(0x3)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_AssetUserData: public Interface
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class TimecodeProvider: public Object
{
public:
	float                                                        FrameDelay;                                        // 0x28(0x4)
	char                                                         pad0x4_0ZGRS[0x4];                                 // 0x2c(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ParticleSystemAggregateTickSettings: public Object
{
public:
	int                                                          FramesTickScaledOver;                              // 0x28(0x4)
	int                                                          MaxTicksPerFrame;                                  // 0x2c(0x4)
	float                                                        PriorityInflationPower;                            // 0x30(0x4)
	char                                                         pad0x4_S0E18[0x4];                                 // 0x34(0x4)
};


// Size 0x240 (Full Size[0x268] - InheritedSize[0x28]
class Skeleton: public Object
{
public:
	TArray<struct BoneNode>                                      BoneTree;                                          // 0x28(0x10)
	char                                                         pad0x80_V6T8K[0x80];                               // 0x38(0x80)
	TArray<struct SkeletonToMeshLinkup>                          LinkupCache;                                       // 0xb8(0x10)
	TArray<class SkeletalMeshSocket*>                            Sockets;                                           // 0xc8(0x10)
	char                                                         pad0x50_M1411[0x50];                               // 0xd8(0x50)
	struct SmartNameContainer                                    SmartNames;                                        // 0x128(0x50)
	TArray<struct AnimSlotGroup>                                 SlotGroups;                                        // 0x178(0x10)
	char                                                         pad0xe0_TT1BU[0xe0];                               // 0x188(0xe0)
};


// Size 0x98 (Full Size[0xc0] - InheritedSize[0x28]
class InputSettings: public Object
{
public:
	TArray<struct InputAxisConfigEntry>                          AxisConfig;                                        // 0x28(0x10)
	bool                                                         bAltEnterTogglesFullscreen;                        // 0x38(0x1)
	bool                                                         bUseMouseForTouch;                                 // 0x38(0x1)
	bool                                                         bEnableMouseSmoothing;                             // 0x38(0x1)
	bool                                                         bEnableFOVScaling;                                 // 0x38(0x1)
	char                                                         pad0x3_2FONP[0x3];                                 // 0x39(0x3)
	float                                                        FOVScale;                                          // 0x3c(0x4)
	float                                                        DoubleClickTime;                                   // 0x40(0x4)
	char                                                         pad0x4_6LT7T[0x4];                                 // 0x44(0x4)
	TArray<struct InputActionKeyMapping>                         ActionMappings;                                    // 0x48(0x10)
	TArray<struct InputAxisKeyMapping>                           AxisMappings;                                      // 0x58(0x10)
	TArray<struct InputCombinedAxisKeyMapping>                   CombinedAxisMappings;                              // 0x68(0x10)
	bool                                                         bAlwaysShowTouchInterface;                         // 0x78(0x1)
	bool                                                         bShowConsoleOnFourFingerTap;                       // 0x79(0x1)
	char                                                         pad0x6_N6UTA[0x6];                                 // 0x7a(0x6)
	struct StringAssetReference                                  DefaultTouchInterface;                             // 0x80(0x10)
	struct Key                                                   ConsoleKey;                                        // 0x90(0x20)
	TArray<struct Key>                                           ConsoleKeys;                                       // 0xb0(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class VertexAnimBase: public Object
{
public:
	class SkeletalMesh*                                          BaseSkelMesh;                                      // 0x28(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavLinkHostInterface: public Interface
{
public:
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class Texture: public Object
{
public:
	int                                                          LODBias;                                           // 0x28(0x4)
	int                                                          NumCinematicMipLevels;                             // 0x2c(0x4)
	bool                                                         SRGB;                                              // 0x30(0x1)
	bool                                                         NeverStream;                                       // 0x30(0x1)
	bool                                                         bNoTiling;                                         // 0x30(0x1)
	bool                                                         bUseCinematicMipLevels;                            // 0x30(0x1)
	bool                                                         CompressionNone;                                   // 0x30(0x1)
	bool                                                         bUAV;                                              // 0x30(0x1)
	char                                                         pad0x3_VTFK4[0x3];                                 // 0x31(0x3)
	int                                                          CachedCombinedLODBias;                             // 0x38(0x4)
	bool                                                         bAsyncResourceReleaseHasBeenStarted;               // 0x3c(0x1)
	char                                                         pad0x3_XGYAE[0x3];                                 // 0x3d(0x3)
	char                                                         CompressionSettings;                               // 0x40(0x1)
	char                                                         Filter;                                            // 0x41(0x1)
	char                                                         LODGroup;                                          // 0x42(0x1)
	char                                                         pad0x1_6WS0Q[0x1];                                 // 0x43(0x1)
	float                                                        StreamingPriorityBoost;                            // 0x44(0x4)
	char                                                         pad0x60_SW52W[0x60];                               // 0x48(0x60)
	TArray<struct ExternalMip>                                   ExternalMips;                                      // 0xa8(0x10)
	char                                                         pad0x88_OP6K3[0x88];                               // 0xb8(0x88)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class Breakpoint: public Object
{
public:
	bool                                                         bEnabled;                                          // 0x28(0x1)
	char                                                         pad0x7_66JOJ[0x7];                                 // 0x29(0x7)
	class EdGraphNode*                                           Node;                                              // 0x30(0x8)
	bool                                                         bStepOnce;                                         // 0x38(0x1)
	bool                                                         bStepOnce_WasPreviouslyDisabled;                   // 0x38(0x1)
	bool                                                         bStepOnce_RemoveAfterHit;                          // 0x38(0x1)
	char                                                         pad0x7_0TB9T[0x7];                                 // 0x39(0x7)
};


// Size 0x2a8 (Full Size[0x2d0] - InheritedSize[0x28]
class ButtonStyleAsset: public Object
{
public:
	struct ButtonStyle                                           ButtonStyle;                                       // 0x28(0x2a8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlueprintAsyncActionBase: public Object
{
public:
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class Exporter: public Object
{
public:
	class UClass*                                                SupportedClass;                                    // 0x28(0x8)
	class Object*                                                ExportRootScope;                                   // 0x30(0x8)
	TArray<String>                                               FormatExtension;                                   // 0x38(0x10)
	TArray<String>                                               FormatDescription;                                 // 0x48(0x10)
	int                                                          PreferredFormatIndex;                              // 0x58(0x4)
	int                                                          TextIndent;                                        // 0x5c(0x4)
	bool                                                         bText;                                             // 0x60(0x1)
	bool                                                         bSelectedOnly;                                     // 0x60(0x1)
	bool                                                         bForceFileOperations;                              // 0x60(0x1)
	char                                                         pad0x7_BIMYY[0x7];                                 // 0x61(0x7)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class DamageType: public Object
{
public:
	bool                                                         bCausedByWorld;                                    // 0x28(0x1)
	bool                                                         bScaleMomentumByMass;                              // 0x28(0x1)
	char                                                         pad0x3_I684D[0x3];                                 // 0x29(0x3)
	float                                                        DamageImpulse;                                     // 0x2c(0x4)
	bool                                                         bRadialDamageVelChange;                            // 0x30(0x1)
	char                                                         pad0x3_3WBJN[0x3];                                 // 0x31(0x3)
	float                                                        DestructibleImpulse;                               // 0x34(0x4)
	float                                                        DestructibleDamageSpreadScale;                     // 0x38(0x4)
	float                                                        DamageFalloff;                                     // 0x3c(0x4)
};


// Size 0xa8 (Full Size[0xd0] - InheritedSize[0x28]
class PhysicsSerializer: public Object
{
public:
	char                                                         pad0xa8_ASHRT[0xa8];                               // 0x28(0xa8)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class AutomationTestUserSettings: public Object
{
public:
	bool                                                         FilterTests;                                       // 0x28(0x1)
	char                                                         pad0x7_RLL7M[0x7];                                 // 0x29(0x7)
	TArray<String>                                               IncludedTestsPrefix;                               // 0x30(0x10)
	TArray<String>                                               ExcludedTestsPrefix;                               // 0x40(0x10)
	bool                                                         IncludeEpicTests;                                  // 0x50(0x1)
	char                                                         pad0x7_3O7Q4[0x7];                                 // 0x51(0x7)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class BookMark2D: public Object
{
public:
	float                                                        Zoom2D;                                            // 0x28(0x4)
	struct IntPoint                                              Location;                                          // 0x2c(0x8)
	char                                                         pad0x4_RCU79[0x4];                                 // 0x34(0x4)
};


// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class DestructibleFractureSettings: public Object
{
public:
	int                                                          CellSiteCount;                                     // 0x28(0x4)
	struct FractureMaterial                                      FractureMaterialDesc;                              // 0x2c(0x24)
	int                                                          RandomSeed;                                        // 0x50(0x4)
	char                                                         pad0x4_5763R[0x4];                                 // 0x54(0x4)
	TArray<struct Vector>                                        VoronoiSites;                                      // 0x58(0x10)
	int                                                          OriginalSubmeshCount;                              // 0x68(0x4)
	char                                                         pad0x4_12MN1[0x4];                                 // 0x6c(0x4)
	TArray<class MaterialInterface*>                             Materials;                                         // 0x70(0x10)
	TArray<struct DestructibleChunkParameters>                   ChunkParameters;                                   // 0x80(0x10)
	TArray<String>                                               MaterialNames;                                     // 0x90(0x10)
};


// Size 0x1a8 (Full Size[0x1f8] - InheritedSize[0x50]
class PackageMapClient: public PackageMap
{
public:
	char                                                         pad0x1a8_27R4Y[0x1a8];                             // 0x50(0x1a8)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class Player: public Object
{
public:
	char                                                         pad0x8_X2XTC[0x8];                                 // 0x28(0x8)
	class PlayerController*                                      PlayerController;                                  // 0x30(0x8)
	int                                                          CurrentNetSpeed;                                   // 0x38(0x4)
	int                                                          ConfiguredInternetSpeed;                           // 0x3c(0x4)
	int                                                          ConfiguredLanSpeed;                                // 0x40(0x4)
	char                                                         pad0x4_DWGNG[0x4];                                 // 0x44(0x4)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class PhysicalMaterial: public Object
{
public:
	float                                                        Friction;                                          // 0x28(0x4)
	char                                                         FrictionCombineMode;                               // 0x2c(0x1)
	bool                                                         bOverrideFrictionCombineMode;                      // 0x2d(0x1)
	char                                                         pad0x2_YEADC[0x2];                                 // 0x2e(0x2)
	float                                                        Restitution;                                       // 0x30(0x4)
	char                                                         RestitutionCombineMode;                            // 0x34(0x1)
	bool                                                         bOverrideRestitutionCombineMode;                   // 0x35(0x1)
	char                                                         pad0x2_G200I[0x2];                                 // 0x36(0x2)
	float                                                        Density;                                           // 0x38(0x4)
	float                                                        RaiseMassToPower;                                  // 0x3c(0x4)
	float                                                        DestructibleDamageThresholdScale;                  // 0x40(0x4)
	char                                                         pad0x4_QPESF[0x4];                                 // 0x44(0x4)
	class PhysicalMaterialPropertyBase*                          PhysicalMaterialProperty;                          // 0x48(0x8)
	char                                                         SurfaceType;                                       // 0x50(0x1)
	char                                                         pad0x1f_6BZKC[0x1f];                               // 0x51(0x1f)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DataAsset: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AnimStateMachineTypes: public Object
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AnimationAsset: public Object
{
public:
	class Skeleton*                                              Skeleton;                                          // 0x28(0x8)
	char                                                         pad0x10_ZXJ5U[0x10];                               // 0x30(0x10)
	TArray<class AnimMetaData*>                                  MetaData;                                          // 0x40(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class InterpTrackInst: public Object
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ReporterBase: public Object
{
public:
	char                                                         pad0x8_9QBJH[0x8];                                 // 0x28(0x8)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class EdGraph: public Object
{
public:
	class UClass*                                                Schema;                                            // 0x28(0x8)
	TArray<class EdGraphNode*>                                   Nodes;                                             // 0x30(0x10)
	bool                                                         bEditable;                                         // 0x40(0x1)
	bool                                                         bAllowDeletion;                                    // 0x40(0x1)
	bool                                                         bAllowRenaming;                                    // 0x40(0x1)
	char                                                         pad0x1f_5USNR[0x1f];                               // 0x41(0x1f)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AssetUserData: public Object
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ForceFeedbackEffect: public Object
{
public:
	TArray<struct ForceFeedbackChannelDetails>                   ChannelDetails;                                    // 0x28(0x10)
	float                                                        Duration;                                          // 0x38(0x4)
	char                                                         pad0x4_GPBR3[0x4];                                 // 0x3c(0x4)
};


// Size 0x2e0 (Full Size[0x308] - InheritedSize[0x28]
class AutomationTestSettings: public Object
{
public:
	struct FilePath                                              AutomationTestmap;                                 // 0x28(0x10)
	TArray<struct EditorMapPerformanceTestDefinition>            EditorPerformanceTestMaps;                         // 0x38(0x10)
	struct BuildPromotionTestSettings                            BuildPromotionTest;                                // 0x48(0x210)
	struct MaterialEditorPromotionSettings                       MaterialEditorPromotionTest;                       // 0x258(0x30)
	struct ParticleEditorPromotionSettings                       ParticleEditorPromotionTest;                       // 0x288(0x10)
	TArray<String>                                               EngineTestModules;                                 // 0x298(0x10)
	TArray<String>                                               EditorTestModules;                                 // 0x2a8(0x10)
	TArray<String>                                               TestLevelFolders;                                  // 0x2b8(0x10)
	TArray<struct OpenTestAsset>                                 TestAssetsToOpen;                                  // 0x2c8(0x10)
	TArray<struct ExternalToolDefinition>                        ExternalTools;                                     // 0x2d8(0x10)
	TArray<struct EditorImportExportTestDefinition>              ImportExportTestDefinitions;                       // 0x2e8(0x10)
	TArray<struct LaunchOnTestSettings>                          LaunchOnSettings;                                  // 0x2f8(0x10)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class StaticMeshSocket: public Object
{
public:
	struct FName                                                 SocketName;                                        // 0x28(0x8)
	struct Vector                                                RelativeLocation;                                  // 0x30(0xc)
	struct Rotator                                               RelativeRotation;                                  // 0x3c(0xc)
	struct Vector                                                RelativeScale;                                     // 0x48(0xc)
	char                                                         pad0x4_48W5H[0x4];                                 // 0x54(0x4)
	struct FString                                               Tag;                                               // 0x58(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DialogueTypes: public Object
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class BookMark: public Object
{
public:
	struct Vector                                                Location;                                          // 0x28(0xc)
	struct Rotator                                               Rotation;                                          // 0x34(0xc)
	TArray<String>                                               HiddenLevels;                                      // 0x40(0x10)
};


// Size 0x110 (Full Size[0x138] - InheritedSize[0x28]
class StaticMesh: public Object
{
public:
	char                                                         pad0x18_8O8R6[0x18];                               // 0x28(0x18)
	int                                                          MinLOD;                                            // 0x40(0x4)
	char                                                         pad0x4_RQKFM[0x4];                                 // 0x44(0x4)
	TArray<class MaterialInterface*>                             Materials;                                         // 0x48(0x10)
	int                                                          LightMapResolution;                                // 0x58(0x4)
	int                                                          LightMapCoordinateIndex;                           // 0x5c(0x4)
	class BodySetup*                                             BodySetup;                                         // 0x60(0x8)
	int                                                          LODForCollision;                                   // 0x68(0x4)
	bool                                                         bUseMaximumStreamingTexelRatio;                    // 0x6c(0x1)
	bool                                                         bStripComplexCollisionForConsole;                  // 0x6c(0x1)
	bool                                                         bHasNavigationData;                                // 0x6c(0x1)
	char                                                         pad0x3_FBSXX[0x3];                                 // 0x6d(0x3)
	float                                                        StreamingDistanceMultiplier;                       // 0x70(0x4)
	float                                                        LpvBiasMultiplier;                                 // 0x74(0x4)
	char                                                         pad0x30_3FZKO[0x30];                               // 0x78(0x30)
	TArray<class StaticMeshSocket*>                              Sockets;                                           // 0xa8(0x10)
	char                                                         pad0x18_S7L8A[0x18];                               // 0xb8(0x18)
	struct Vector                                                PositiveBoundsExtension;                           // 0xd0(0xc)
	struct Vector                                                NegativeBoundsExtension;                           // 0xdc(0xc)
	struct BoxSphereBounds                                       ExtendedBounds;                                    // 0xe8(0x1c)
	char                                                         pad0x4_21DX2[0x4];                                 // 0x104(0x4)
	TArray<String>                                               SourceMaterials;                                   // 0x108(0x10)
	int                                                          UVsForStreaming;                                   // 0x118(0x4)
	int                                                          ElementToIgnoreForTexFactor;                       // 0x11c(0x4)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x120(0x10)
	class NavCollision*                                          NavCollision;                                      // 0x130(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SaveGame: public Object
{
public:
};


// Size 0xe8 (Full Size[0x110] - InheritedSize[0x28]
class NavCollision: public Object
{
public:
	char                                                         pad0x50_FB58W[0x50];                               // 0x28(0x50)
	TArray<struct NavCollisionCylinder>                          CylinderCollision;                                 // 0x78(0x10)
	TArray<struct NavCollisionBox>                               BoxCollision;                                      // 0x88(0x10)
	class UClass*                                                AreaClass;                                         // 0x98(0x8)
	bool                                                         bIsDynamicObstacle;                                // 0xa0(0x1)
	bool                                                         bGatherConvexGeometry;                             // 0xa0(0x1)
	char                                                         pad0x6f_PRY6A[0x6f];                               // 0xa1(0x6f)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Scene: public Object
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AISystemBase: public Object
{
public:
	struct StringClassReference                                  AISystemClassName;                                 // 0x28(0x10)
	struct FName                                                 AISystemModuleName;                                // 0x38(0x8)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class GameUserSettings: public Object
{
public:
	bool                                                         bUseVSync;                                         // 0x28(0x1)
	char                                                         pad0x1f_8XFTO[0x1f];                               // 0x29(0x1f)
	int                                                          WindowPosX;                                        // 0x58(0x4)
	int                                                          WindowPosY;                                        // 0x5c(0x4)
	bool                                                         bUseDesktopResolutionForFullscreen;                // 0x60(0x1)
	char                                                         pad0x3_7NLL8[0x3];                                 // 0x61(0x3)
	int                                                          FullscreenMode;                                    // 0x64(0x4)
	int                                                          LastConfirmedFullscreenMode;                       // 0x68(0x4)
	int                                                          AudioQualityLevel;                                 // 0x70(0x4)
	char                                                         pad0x4_FGDKO[0x4];                                 // 0x74(0x4)
};


// Size 0x1e8 (Full Size[0x210] - InheritedSize[0x28]
class LevelStreaming: public Object
{
public:
	char                                                         pad0x28_P7UTT[0x28];                               // 0x28(0x28)
	struct FName                                                 PackageNameToLoad;                                 // 0x50(0x8)
	TArray<struct Name>                                          LODPackageNames;                                   // 0x58(0x10)
	char                                                         pad0x18_26QFC[0x18];                               // 0x68(0x18)
	struct Transform                                             LevelTransform;                                    // 0x80(0x30)
	char                                                         pad0xc_VQDWK[0xc];                                 // 0xb0(0xc)
	bool                                                         bShouldBeVisibleInEditor;                          // 0xbc(0x1)
	bool                                                         Blocked;                                           // 0xbc(0x1)
	bool                                                         bShouldBeLoaded;                                   // 0xbc(0x1)
	bool                                                         bShouldBeVisible;                                  // 0xbc(0x1)
	bool                                                         bShouldBlockOnLoad;                                // 0xbc(0x1)
	char                                                         pad0x3_PU28E[0x3];                                 // 0xbd(0x3)
	int                                                          LevelLODIndex;                                     // 0xc0(0x4)
	bool                                                         bDisableDistanceStreaming;                         // 0xc4(0x1)
	bool                                                         bDrawOnLevelStatusMap;                             // 0xc4(0x1)
	char                                                         pad0x3_OOYN1[0x3];                                 // 0xc5(0x3)
	struct LinearColor                                           LevelColor;                                        // 0xc8(0x10)
	TArray<class LevelStreamingVolume*>                          EditorStreamingVolumes;                            // 0xd8(0x10)
	float                                                        MinTimeBetweenVolumeUnloadRequests;                // 0xe8(0x4)
	char                                                         pad0x4_6ADPS[0x4];                                 // 0xec(0x4)
	TArray<String>                                               Keywords;                                          // 0xf0(0x10)
	class Level*                                                 LoadedLevel;                                       // 0x200(0x8)
	class Level*                                                 PendingUnloadLevel;                                // 0x208(0x8)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class VectorField: public Object
{
public:
	struct Box                                                   Bounds;                                            // 0x28(0x1c)
	float                                                        Intensity;                                         // 0x44(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ScriptViewportClient: public Object
{
public:
	char                                                         pad0x8_K9ORR[0x8];                                 // 0x28(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class MeshPatchAsset: public Object
{
public:
	char                                                         pad0x10_VVCN2[0x10];                               // 0x28(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class IntSerialization: public Object
{
public:
	char                                                         pad0x20_9JYVU[0x20];                               // 0x28(0x20)
	char                                                         UnsignedInt8Variable;                              // 0x48(0x1)
	char                                                         pad0x3_8FSRS[0x3];                                 // 0x49(0x3)
	int                                                          SignedInt32Variable;                               // 0x4c(0x4)
};


// Size 0x5f0 (Full Size[0x618] - InheritedSize[0x28]
class CheckBoxStyleAsset: public Object
{
public:
	struct CheckBoxStyle                                         CheckBoxStyle;                                     // 0x28(0x5f0)
};


// Size 0x550 (Full Size[0x578] - InheritedSize[0x28]
class Model: public Object
{
public:
	char                                                         pad0x550_ZLT5H[0x550];                             // 0x28(0x550)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AnimCompress: public Object
{
public:
	struct FString                                               Description;                                       // 0x28(0x10)
	bool                                                         bNeedsSkeleton;                                    // 0x38(0x1)
	char                                                         pad0x3_RHKNU[0x3];                                 // 0x39(0x3)
	char                                                         TranslationCompressionFormat;                      // 0x3c(0x1)
	char                                                         RotationCompressionFormat;                         // 0x3d(0x1)
	char                                                         ScaleCompressionFormat;                            // 0x3e(0x1)
	char                                                         pad0x1_SW850[0x1];                                 // 0x3f(0x1)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AssetImportData: public Object
{
public:
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class SoundGroups: public Object
{
public:
	TArray<struct SoundGroup>                                    SoundGroupProfiles;                                // 0x28(0x10)
	char                                                         pad0x50_G3TNR[0x50];                               // 0x38(0x50)
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class ParticleLODLevel: public Object
{
public:
	int                                                          Level;                                             // 0x28(0x4)
	bool                                                         bEnabled;                                          // 0x2c(0x1)
	char                                                         pad0x3_1S52E[0x3];                                 // 0x2d(0x3)
	class ParticleModuleRequired*                                RequiredModule;                                    // 0x30(0x8)
	TArray<class ParticleModule*>                                Modules;                                           // 0x38(0x10)
	class ParticleModule*                                        TypeDataModule;                                    // 0x48(0x8)
	class ParticleModuleSpawn*                                   SpawnModule;                                       // 0x50(0x8)
	class ParticleModuleEventGenerator*                          EventGenerator;                                    // 0x58(0x8)
	TArray<class ParticleModuleSpawnBase*>                       SpawningModules;                                   // 0x60(0x10)
	TArray<class ParticleModule*>                                SpawnModules;                                      // 0x70(0x10)
	TArray<class ParticleModule*>                                UpdateModules;                                     // 0x80(0x10)
	TArray<class ParticleModuleOrbit*>                           OrbitModules;                                      // 0x90(0x10)
	TArray<class ParticleModuleEventReceiverBase*>               EventReceiverModules;                              // 0xa0(0x10)
	bool                                                         ConvertedModules;                                  // 0xb0(0x1)
	char                                                         pad0x3_G6PHA[0x3];                                 // 0xb1(0x3)
	int                                                          PeakActiveParticles;                               // 0xb4(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DynamicBlueprintBinding: public Object
{
public:
};


// Size 0xc8 (Full Size[0xf0] - InheritedSize[0x28]
class AnimSet: public Object
{
public:
	bool                                                         bAnimRotationOnly;                                 // 0x28(0x1)
	char                                                         pad0x7_OUQ9T[0x7];                                 // 0x29(0x7)
	TArray<struct Name>                                          TrackBoneNames;                                    // 0x30(0x10)
	TArray<struct AnimSetMeshLinkup>                             LinkupCache;                                       // 0x40(0x10)
	TArray<char>                                                 BoneUseAnimTranslation;                            // 0x50(0x10)
	TArray<char>                                                 ForceUseMeshTranslation;                           // 0x60(0x10)
	TArray<struct Name>                                          UseTranslationBoneNames;                           // 0x70(0x10)
	TArray<struct Name>                                          ForceMeshTranslationBoneNames;                     // 0x80(0x10)
	struct FName                                                 PreviewSkelMeshName;                               // 0x90(0x8)
	struct FName                                                 BestRatioSkelMeshName;                             // 0x98(0x8)
	char                                                         pad0x50_YH7IQ[0x50];                               // 0xa0(0x50)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class NavigationPath: public Object
{
public:
	char                                                         pad0x10_UNICC[0x10];                               // 0x28(0x10)
	TArray<struct Vector>                                        PathPoints;                                        // 0x38(0x10)
	char                                                         RecalculateOnInvalidation;                         // 0x48(0x1)
	char                                                         pad0x3f_BD8GI[0x3f];                               // 0x49(0x3f)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ObjectReferencer: public Object
{
public:
	TArray<class Object*>                                        ReferencedObjects;                                 // 0x28(0x10)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class SoundClass: public Object
{
public:
	struct SoundClassProperties                                  Properties;                                        // 0x28(0x24)
	char                                                         pad0x4_SDZNY[0x4];                                 // 0x4c(0x4)
	TArray<class SoundClass*>                                    ChildClasses;                                      // 0x50(0x10)
	TArray<struct PassiveSoundMixModifier>                       PassiveSoundMixModifiers;                          // 0x60(0x10)
	class SoundClass*                                            ParentClass;                                       // 0x70(0x8)
};


// Size 0x88 (Full Size[0xb0] - InheritedSize[0x28]
class PlatformInterfaceWebResponse: public Object
{
public:
	struct FString                                               OriginalURL;                                       // 0x28(0x10)
	int                                                          ResponseCode;                                      // 0x38(0x4)
	int                                                          Tag;                                               // 0x3c(0x4)
	struct FString                                               StringResponse;                                    // 0x40(0x10)
	TArray<char>                                                 BinaryResponse;                                    // 0x50(0x10)
	char                                                         pad0x50_AQ9GP[0x50];                               // 0x60(0x50)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class HighLatencySettings: public Object
{
public:
	bool                                                         UseHighLatency;                                    // 0x28(0x1)
	char                                                         pad0x3_C2BLF[0x3];                                 // 0x29(0x3)
	int                                                          PktLag;                                            // 0x2c(0x4)
	int                                                          PktLagVariance;                                    // 0x30(0x4)
	bool                                                         PktOrder;                                          // 0x34(0x1)
	char                                                         pad0x3_XKH2O[0x3];                                 // 0x35(0x3)
	int                                                          PktDup;                                            // 0x38(0x4)
	int                                                          PktLoss;                                           // 0x3c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ThumbnailInfo: public Object
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class TouchInterface: public Object
{
public:
	TArray<struct TouchInputControl>                             Controls;                                          // 0x28(0x10)
	float                                                        ActiveOpacity;                                     // 0x38(0x4)
	float                                                        InactiveOpacity;                                   // 0x3c(0x4)
	float                                                        TimeUntilDeactive;                                 // 0x40(0x4)
	float                                                        TimeUntilReset;                                    // 0x44(0x4)
	float                                                        ActivationDelay;                                   // 0x48(0x4)
	bool                                                         bPreventRecenter;                                  // 0x4c(0x1)
	char                                                         pad0x3_DRUOY[0x3];                                 // 0x4d(0x3)
	float                                                        StartupDelay;                                      // 0x50(0x4)
	char                                                         pad0x4_ENHGG[0x4];                                 // 0x54(0x4)
};


// Size 0x4b8 (Full Size[0x4e0] - InheritedSize[0x28]
class NetDriver: public Object
{
public:
	char                                                         pad0x10_TRJ1V[0x10];                               // 0x28(0x10)
	struct FString                                               NetConnectionClassName;                            // 0x38(0x10)
	int                                                          MaxDownloadSize;                                   // 0x48(0x4)
	bool                                                         bClampListenServerTickRate;                        // 0x4c(0x1)
	char                                                         pad0x3_UF1KR[0x3];                                 // 0x4d(0x3)
	int                                                          NetServerMaxTickRate;                              // 0x50(0x4)
	int                                                          MaxInternetClientRate;                             // 0x54(0x4)
	int                                                          MaxClientRate;                                     // 0x58(0x4)
	float                                                        ServerTravelPause;                                 // 0x5c(0x4)
	float                                                        SpawnPrioritySeconds;                              // 0x60(0x4)
	float                                                        RelevantTimeout;                                   // 0x64(0x4)
	float                                                        KeepAliveTime;                                     // 0x68(0x4)
	float                                                        InitialConnectTimeout;                             // 0x6c(0x4)
	float                                                        ConnectionTimeout;                                 // 0x70(0x4)
	char                                                         pad0x4_7U4S3[0x4];                                 // 0x74(0x4)
	class NetConnection*                                         ServerConnection;                                  // 0x78(0x8)
	TArray<class NetConnection*>                                 ClientConnections;                                 // 0x80(0x10)
	class World*                                                 World;                                             // 0x90(0x8)
	char                                                         pad0x48_JCYUM[0x48];                               // 0x98(0x48)
	class UClass*                                                NetConnectionClass;                                // 0xe0(0x8)
	class Property*                                              RoleProperty;                                      // 0xe8(0x8)
	class Property*                                              RemoteRoleProperty;                                // 0xf0(0x8)
	struct FName                                                 NetDriverName;                                     // 0xf8(0x8)
	char                                                         pad0x3e0_K34O9[0x3e0];                             // 0x100(0x3e0)
};


// Size 0x218 (Full Size[0x240] - InheritedSize[0x28]
class PhysicsConstraintTemplate: public Object
{
public:
	struct FName                                                 JointName;                                         // 0x28(0x8)
	struct FName                                                 ConstraintBone1;                                   // 0x30(0x8)
	struct FName                                                 ConstraintBone2;                                   // 0x38(0x8)
	struct Vector                                                Pos1;                                              // 0x40(0xc)
	struct Vector                                                PriAxis1;                                          // 0x4c(0xc)
	struct Vector                                                SecAxis1;                                          // 0x58(0xc)
	struct Vector                                                Pos2;                                              // 0x64(0xc)
	struct Vector                                                PriAxis2;                                          // 0x70(0xc)
	struct Vector                                                SecAxis2;                                          // 0x7c(0xc)
	bool                                                         bEnableProjection;                                 // 0x88(0x1)
	char                                                         pad0x3_1BZR8[0x3];                                 // 0x89(0x3)
	float                                                        ProjectionLinearTolerance;                         // 0x8c(0x4)
	float                                                        ProjectionAngularTolerance;                        // 0x90(0x4)
	char                                                         LinearXMotion;                                     // 0x94(0x1)
	char                                                         LinearYMotion;                                     // 0x95(0x1)
	char                                                         LinearZMotion;                                     // 0x96(0x1)
	char                                                         pad0x1_EP4YO[0x1];                                 // 0x97(0x1)
	float                                                        LinearLimitSize;                                   // 0x98(0x4)
	bool                                                         bLinearLimitSoft;                                  // 0x9c(0x1)
	char                                                         pad0x3_AEZYK[0x3];                                 // 0x9d(0x3)
	float                                                        LinearLimitStiffness;                              // 0xa0(0x4)
	float                                                        LinearLimitDamping;                                // 0xa4(0x4)
	bool                                                         bLinearBreakable;                                  // 0xa8(0x1)
	char                                                         pad0x3_GFLT9[0x3];                                 // 0xa9(0x3)
	float                                                        LinearBreakThreshold;                              // 0xac(0x4)
	char                                                         AngularSwing1Motion;                               // 0xb0(0x1)
	char                                                         AngularSwing2Motion;                               // 0xb1(0x1)
	char                                                         AngularTwistMotion;                                // 0xb2(0x1)
	char                                                         pad0x1_N0AIF[0x1];                                 // 0xb3(0x1)
	bool                                                         bSwingLimitSoft;                                   // 0xb4(0x1)
	bool                                                         bTwistLimitSoft;                                   // 0xb4(0x1)
	char                                                         pad0x3_4KN3V[0x3];                                 // 0xb5(0x3)
	float                                                        Swing1LimitAngle;                                  // 0xb8(0x4)
	float                                                        Swing2LimitAngle;                                  // 0xbc(0x4)
	float                                                        TwistLimitAngle;                                   // 0xc0(0x4)
	float                                                        SwingLimitStiffness;                               // 0xc4(0x4)
	float                                                        SwingLimitDamping;                                 // 0xc8(0x4)
	float                                                        TwistLimitStiffness;                               // 0xcc(0x4)
	float                                                        TwistLimitDamping;                                 // 0xd0(0x4)
	bool                                                         bAngularBreakable;                                 // 0xd4(0x1)
	char                                                         pad0x3_WLK42[0x3];                                 // 0xd5(0x3)
	float                                                        AngularBreakThreshold;                             // 0xd8(0x4)
	char                                                         pad0x4_QWXK5[0x4];                                 // 0xdc(0x4)
	struct ConstraintInstance                                    DefaultInstance;                                   // 0xe0(0x160)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class Polys: public Object
{
public:
	char                                                         pad0x10_1HEMW[0x10];                               // 0x28(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class Layer: public Object
{
public:
	struct FName                                                 LayerName;                                         // 0x28(0x8)
	bool                                                         bIsVisible;                                        // 0x30(0x1)
	char                                                         pad0x7_PBDRO[0x7];                                 // 0x31(0x7)
	TArray<struct LayerActorStats>                               ActorStats;                                        // 0x38(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavPathObserverInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class InstancedNavMeshInterface: public Interface
{
public:
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class SubUVAnimation: public Object
{
public:
	class Texture2D*                                             SubUVTexture;                                      // 0x28(0x8)
	int                                                          SubImages_Horizontal;                              // 0x30(0x4)
	int                                                          SubImages_Vertical;                                // 0x34(0x4)
	char                                                         BoundingMode;                                      // 0x38(0x1)
	char                                                         OpacitySourceMode;                                 // 0x39(0x1)
	char                                                         pad0x2_9B0VS[0x2];                                 // 0x3a(0x2)
	float                                                        AlphaThreshold;                                    // 0x3c(0x4)
	float                                                        SafeMarginSize;                                    // 0x40(0x4)
	char                                                         pad0x44_WLI2P[0x44];                               // 0x44(0x44)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CurveEdPresetCurve: public Object
{
public:
};


// Size 0xc0 (Full Size[0xe8] - InheritedSize[0x28]
class SoundAttenuation: public Object
{
public:
	struct AttenuationSettings                                   Attenuation;                                       // 0x28(0xc0)
};


// Size 0x210 (Full Size[0x238] - InheritedSize[0x28]
class SkeletalMesh: public Object
{
public:
	char                                                         pad0x28_O1E5F[0x28];                               // 0x28(0x28)
	class Skeleton*                                              Skeleton;                                          // 0x50(0x8)
	struct BoxSphereBounds                                       Bounds;                                            // 0x58(0x1c)
	char                                                         pad0x4_8WJC4[0x4];                                 // 0x74(0x4)
	TArray<struct SkeletalMaterial>                              Materials;                                         // 0x78(0x10)
	TArray<struct BoneMirrorInfo>                                SkelMirrorTable;                                   // 0x88(0x10)
	char                                                         SkelMirrorAxis;                                    // 0x98(0x1)
	char                                                         SkelMirrorFlipAxis;                                // 0x99(0x1)
	char                                                         pad0x6_5MU3Q[0x6];                                 // 0x9a(0x6)
	TArray<struct SkeletalMeshLODInfo>                           LODInfo;                                           // 0xa0(0x10)
	bool                                                         bUseFullPrecisionUVs;                              // 0xb0(0x1)
	bool                                                         bHasBeenSimplified;                                // 0xb0(0x1)
	bool                                                         bHasVertexColors;                                  // 0xb0(0x1)
	char                                                         pad0x7_UPHYI[0x7];                                 // 0xb1(0x7)
	TArray<struct DeformablesSettings>                           DeformablesSettings;                               // 0xb8(0x10)
	bool                                                         bKeepTessellationAdjacency;                        // 0xc8(0x1)
	bool                                                         bKeepSkeletalMeshBuffersInMemory;                  // 0xc8(0x1)
	bool                                                         bEnablePerPolyCollision;                           // 0xc8(0x1)
	char                                                         pad0x7_LZAI2[0x7];                                 // 0xc9(0x7)
	class BodySetup*                                             BodySetup;                                         // 0xd0(0x8)
	class PhysicsAsset*                                          PhysicsAsset;                                      // 0xd8(0x8)
	class HIKCharacterization*                                   Characterization;                                  // 0xe0(0x8)
	class PhysicsAsset*                                          DeformablesPhysicsAsset;                           // 0xe8(0x8)
	float                                                        StreamingDistanceMultiplier;                       // 0xf0(0x4)
	float                                                        StreamingDiscardedTexelRatios;                     // 0xf4(0x4)
	TArray<class MorphTarget*>                                   MorphTargets;                                      // 0xf8(0x10)
	TArray<class MeshPatchAsset*>                                MeshPatchAssets;                                   // 0x108(0x10)
	char                                                         pad0xd8_F1U29[0xd8];                               // 0x118(0xd8)
	TArray<struct ClothingAssetData>                             ClothingAssets;                                    // 0x1f0(0x10)
	char                                                         pad0x10_LCMVH[0x10];                               // 0x200(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x210(0x10)
	char                                                         pad0x8_UJSNV[0x8];                                 // 0x220(0x8)
	TArray<class SkeletalMeshSocket*>                            Sockets;                                           // 0x228(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavigationPathGenerator: public Interface
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class Selection: public Object
{
public:
	char                                                         pad0x30_IBG27[0x30];                               // 0x28(0x30)
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class UserDefinedStruct: public ScriptStruct
{
public:
	struct Guid                                                  Guid;                                              // 0x98(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LocalMessage: public Object
{
public:
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class ObjectLibrary: public Object
{
public:
	class UClass*                                                ObjectBaseClass;                                   // 0x28(0x8)
	bool                                                         bHasBlueprintClasses;                              // 0x30(0x1)
	char                                                         pad0x7_PHZG1[0x7];                                 // 0x31(0x7)
	TArray<class Object*>                                        Objects;                                           // 0x38(0x10)
	TArray<uintptr_t>                                            WeakObjects;                                       // 0x48(0x10)
	bool                                                         bUseWeakReferences;                                // 0x58(0x1)
	bool                                                         bIsFullyLoaded;                                    // 0x59(0x1)
	char                                                         pad0x16_07UP5[0x16];                               // 0x5a(0x16)
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class CameraShake: public Object
{
public:
	bool                                                         bSingleInstance;                                   // 0x28(0x1)
	char                                                         pad0x3_VH3V1[0x3];                                 // 0x29(0x3)
	float                                                        OscillationDuration;                               // 0x2c(0x4)
	float                                                        OscillationBlendInTime;                            // 0x30(0x4)
	float                                                        OscillationBlendOutTime;                           // 0x34(0x4)
	struct ROscillator                                           RotOscillation;                                    // 0x38(0x24)
	struct VOscillator                                           LocOscillation;                                    // 0x5c(0x24)
	struct FOscillator                                           FOVOscillation;                                    // 0x80(0xc)
	float                                                        AnimPlayRate;                                      // 0x8c(0x4)
	float                                                        AnimScale;                                         // 0x90(0x4)
	float                                                        AnimBlendInTime;                                   // 0x94(0x4)
	float                                                        AnimBlendOutTime;                                  // 0x98(0x4)
	float                                                        RandomAnimSegmentDuration;                         // 0x9c(0x4)
	class CameraAnim*                                            Anim;                                              // 0xa0(0x8)
	bool                                                         bRandomAnimSegment;                                // 0xa8(0x1)
	char                                                         pad0x17_Z7QS8[0x17];                               // 0xa9(0x17)
	class PlayerCameraManager*                                   CameraOwner;                                       // 0xc0(0x8)
	char                                                         pad0x68_367LB[0x68];                               // 0xc8(0x68)
	float                                                        ShakeScale;                                        // 0x130(0x4)
	float                                                        OscillatorTimeRemaining;                           // 0x134(0x4)
	class CameraAnimInst*                                        AnimInst;                                          // 0x138(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavLinkCustomInterface: public Interface
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class FFTWaterSettings: public Object
{
public:
	struct StringAssetReference                                  FFTWaterMaterialName;                              // 0x28(0x10)
	struct StringAssetReference                                  FFTWaterFoamTextureName;                           // 0x38(0x10)
	int                                                          BaseMeshDetail;                                    // 0x48(0x4)
	char                                                         pad0x4_L9G2B[0x4];                                 // 0x4c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavAgentInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NetPhysicsInterpolatorInterface: public Interface
{
public:
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class TimelineTemplate: public Object
{
public:
	float                                                        TimelineLength;                                    // 0x28(0x4)
	char                                                         LengthMode;                                        // 0x2c(0x1)
	char                                                         pad0x3_RGMFE[0x3];                                 // 0x2d(0x3)
	bool                                                         bAutoPlay;                                         // 0x30(0x1)
	bool                                                         bLoop;                                             // 0x30(0x1)
	bool                                                         bReplicated;                                       // 0x30(0x1)
	bool                                                         bValidatedAsWired;                                 // 0x30(0x1)
	char                                                         pad0x7_4IZL0[0x7];                                 // 0x31(0x7)
	TArray<struct TTEventTrack>                                  EventTracks;                                       // 0x38(0x10)
	TArray<struct TTFloatTrack>                                  FloatTracks;                                       // 0x48(0x10)
	TArray<struct TTVectorTrack>                                 VectorTracks;                                      // 0x58(0x10)
	TArray<struct TTLinearColorTrack>                            LinearColorTracks;                                 // 0x68(0x10)
	TArray<struct BPVariableMetaDataEntry>                       MetaDataArray;                                     // 0x78(0x10)
	struct Guid                                                  TimelineGuid;                                      // 0x88(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OnlineSession: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MatineeAnimInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AnimNotifyCondition: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PhysicalMaterialPropertyBase: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TestInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class DeveloperSettings: public Object
{
public:
	char                                                         pad0x10_WVLJC[0x10];                               // 0x28(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class InterpGroupInst: public Object
{
public:
	class InterpGroup*                                           Group;                                             // 0x28(0x8)
	class Actor*                                                 GroupActor;                                        // 0x30(0x8)
	TArray<class InterpTrackInst*>                               TrackInst;                                         // 0x38(0x10)
};


// Size 0xc8 (Full Size[0xf0] - InheritedSize[0x28]
class Canvas: public Object
{
public:
	float                                                        OrgX;                                              // 0x28(0x4)
	float                                                        OrgY;                                              // 0x2c(0x4)
	float                                                        ClipX;                                             // 0x30(0x4)
	float                                                        ClipY;                                             // 0x34(0x4)
	struct Color                                                 DrawColor;                                         // 0x38(0x4)
	bool                                                         bCenterX;                                          // 0x3c(0x1)
	bool                                                         bCenterY;                                          // 0x3c(0x1)
	bool                                                         bNoSmooth;                                         // 0x3c(0x1)
	char                                                         pad0x3_B7Q6X[0x3];                                 // 0x3d(0x3)
	int                                                          SizeX;                                             // 0x40(0x4)
	int                                                          SizeY;                                             // 0x44(0x4)
	char                                                         pad0x8_ZFM2C[0x8];                                 // 0x48(0x8)
	struct Plane                                                 ColorModulate;                                     // 0x50(0x10)
	class Texture2D*                                             DefaultTexture;                                    // 0x60(0x8)
	class Texture2D*                                             GradientTexture0;                                  // 0x68(0x8)
	class ReporterGraph*                                         ReporterGraph;                                     // 0x70(0x8)
	char                                                         pad0x78_7OFUV[0x78];                               // 0x78(0x78)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RVOAvoidanceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_CollisionDataProvider: public Interface
{
public:
};


// Size 0x100 (Full Size[0x128] - InheritedSize[0x28]
class EdGraphPin: public Object
{
public:
	struct FString                                               PinName;                                           // 0x28(0x10)
	struct FString                                               PinToolTip;                                        // 0x38(0x10)
	char                                                         Direction;                                         // 0x48(0x1)
	char                                                         pad0x7_XHFF8[0x7];                                 // 0x49(0x7)
	struct EdGraphPinType                                        PinType;                                           // 0x50(0x50)
	struct FString                                               DefaultValue;                                      // 0xa0(0x10)
	struct FString                                               AutogeneratedDefaultValue;                         // 0xb0(0x10)
	class Object*                                                DefaultObject;                                     // 0xc0(0x8)
	struct FText                                                 DefaultTextValue;                                  // 0xc8(0x38)
	TArray<class EdGraphPin*>                                    LinkedTo;                                          // 0x100(0x10)
	TArray<class EdGraphPin*>                                    SubPins;                                           // 0x110(0x10)
	class EdGraphPin*                                            ParentPin;                                         // 0x120(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AggregatableInterface: public Interface
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class SubsurfaceProfile: public Object
{
public:
	struct SubsurfaceProfileStruct                               Settings;                                          // 0x28(0x24)
	char                                                         pad0x4_8ZFJ9[0x4];                                 // 0x4c(0x4)
};


// Size 0xf8 (Full Size[0x498] - InheritedSize[0x3a0]
class HUD: public Actor
{
public:
	struct Color                                                 WhiteColor;                                        // 0x3a0(0x4)
	struct Color                                                 GreenColor;                                        // 0x3a4(0x4)
	struct Color                                                 RedColor;                                          // 0x3a8(0x4)
	char                                                         pad0x4_AOU7Y[0x4];                                 // 0x3ac(0x4)
	class PlayerController*                                      PlayerOwner;                                       // 0x3b0(0x8)
	bool                                                         bLostFocusPaused;                                  // 0x3b8(0x1)
	bool                                                         bShowHUD;                                          // 0x3b8(0x1)
	bool                                                         bShowDebugInfo;                                    // 0x3b8(0x1)
	bool                                                         bShowHitBoxDebugInfo;                              // 0x3b8(0x1)
	bool                                                         bShowOverlays;                                     // 0x3b8(0x1)
	bool                                                         bEnableDebugTextShadow;                            // 0x3b8(0x1)
	char                                                         pad0x7_X9AB5[0x7];                                 // 0x3b9(0x7)
	TArray<class Actor*>                                         PostRenderedActors;                                // 0x3c0(0x10)
	float                                                        LastHUDRenderTime;                                 // 0x3d0(0x4)
	float                                                        RenderDelta;                                       // 0x3d4(0x4)
	TArray<struct Name>                                          DebugDisplay;                                      // 0x3d8(0x10)
	TArray<struct Name>                                          ToggledDebugCategories;                            // 0x3e8(0x10)
	class Canvas*                                                Canvas;                                            // 0x3f8(0x8)
	class Canvas*                                                DebugCanvas;                                       // 0x400(0x8)
	TArray<struct DebugTextInfo>                                 DebugTextList;                                     // 0x408(0x10)
	class UClass*                                                ShowDebugTargetDesiredClass;                       // 0x418(0x8)
	class Actor*                                                 ShowDebugTargetActor;                              // 0x420(0x8)
	char                                                         pad0x70_WXU1S[0x70];                               // 0x428(0x70)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionSceneTexelSize: public MaterialExpression
{
public:
};


// Size 0x18 (Full Size[0x68] - InheritedSize[0x50]
class DialogueSoundWaveProxy: public SoundBase
{
public:
	char                                                         pad0x18_73KEG[0x18];                               // 0x50(0x18)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class InterpFilter_Custom: public InterpFilter
{
public:
};


// Size 0xd8 (Full Size[0x110] - InheritedSize[0x38]
class RendererSettings: public DeveloperSettings
{
public:
	bool                                                         bMobileHDR;                                        // 0x38(0x1)
	char                                                         pad0x3_L47KT[0x3];                                 // 0x39(0x3)
	bool                                                         bMobileDynamicPointLightsUseStaticBranch;          // 0x40(0x1)
	bool                                                         bOcclusionCulling;                                 // 0x40(0x1)
	char                                                         pad0x3_Z58CG[0x3];                                 // 0x41(0x3)
	float                                                        MinScreenRadiusForLights;                          // 0x44(0x4)
	float                                                        MinScreenRadiusForEarlyZPass;                      // 0x48(0x4)
	float                                                        MinScreenRadiusForCSMdepth;                        // 0x4c(0x4)
	bool                                                         bPrecomputedVisibilityWarning;                     // 0x50(0x1)
	bool                                                         bTextureStreaming;                                 // 0x50(0x1)
	bool                                                         bUseDXT5NormalMaps;                                // 0x50(0x1)
	bool                                                         bAllowStaticLighting;                              // 0x50(0x1)
	bool                                                         bUseNormalMapsForStaticLighting;                   // 0x50(0x1)
	bool                                                         bGenerateMeshDistanceFields;                       // 0x50(0x1)
	bool                                                         bGenerateLandscapeGIData;                          // 0x50(0x1)
	char                                                         pad0x3_IMK3W[0x3];                                 // 0x51(0x3)
	float                                                        TessellationAdaptivePixelsPerTriangle;             // 0x54(0x4)
	bool                                                         bSeparateTranslucency;                             // 0x58(0x1)
	char                                                         pad0x3_RYG5Z[0x3];                                 // 0x59(0x3)
	char                                                         TranslucentSortPolicy;                             // 0x5c(0x1)
	char                                                         pad0x3_MJVEY[0x3];                                 // 0x5d(0x3)
	struct Vector                                                TranslucentSortAxis;                               // 0x60(0xc)
	char                                                         CustomDepthStencil;                                // 0x6c(0x1)
	char                                                         pad0x3_F6LTO[0x3];                                 // 0x6d(0x3)
	bool                                                         bDefaultFeatureBloom;                              // 0x70(0x1)
	bool                                                         bDefaultFeatureAmbientOcclusion;                   // 0x70(0x1)
	bool                                                         bDefaultFeatureAmbientOcclusionStaticFraction;     // 0x70(0x1)
	bool                                                         bDefaultFeatureAutoExposure;                       // 0x70(0x1)
	bool                                                         bDefaultFeatureMotionBlur;                         // 0x70(0x1)
	bool                                                         bDefaultFeatureLensFlare;                          // 0x70(0x1)
	char                                                         pad0x3_XJ0WQ[0x3];                                 // 0x71(0x3)
	char                                                         DefaultFeatureAntiAliasing;                        // 0x74(0x1)
	char                                                         EarlyZPass;                                        // 0x75(0x1)
	char                                                         bDepthSort;                                        // 0x76(0x1)
	char                                                         pad0x1_5382R[0x1];                                 // 0x77(0x1)
	bool                                                         bEarlyZPassMovable;                                // 0x78(0x1)
	bool                                                         bDBuffer;                                          // 0x78(0x1)
	char                                                         pad0x3_LWX0W[0x3];                                 // 0x79(0x3)
	char                                                         ClearSceneMethod;                                  // 0x7c(0x1)
	char                                                         pad0x3_NQYES[0x3];                                 // 0x7d(0x3)
	bool                                                         bBasePassOutputsVelocity;                          // 0x80(0x1)
	char                                                         pad0x3_LTK71[0x3];                                 // 0x81(0x3)
	float                                                        WireframeCullThreshold;                            // 0x84(0x4)
	char                                                         UIScaleRule;                                       // 0x88(0x1)
	char                                                         pad0x7_25FCX[0x7];                                 // 0x89(0x7)
	struct RuntimeFloatCurve                                     UIScaleCurve;                                      // 0x90(0x80)
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class LevelBounds: public Actor
{
public:
	bool                                                         bAutoUpdateBounds;                                 // 0x3a0(0x1)
	char                                                         pad0x7_H4URM[0x7];                                 // 0x3a1(0x7)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionSquareRoot: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
};


// Size 0x10 (Full Size[0x80] - InheritedSize[0x70]
class MaterialExpressionBoneMatrix: public MaterialExpression
{
public:
	int                                                          ReferenceIndex;                                    // 0x70(0x4)
	struct FName                                                 BoneName;                                          // 0x74(0x8)
	bool                                                         bPosition;                                         // 0x7c(0x1)
	char                                                         pad0x3_5WWOL[0x3];                                 // 0x7d(0x3)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class StreamingSettings: public DeveloperSettings
{
public:
	bool                                                         AsyncLoadingThreadEnabled;                         // 0x38(0x1)
	bool                                                         WarnIfTimeLimitExceeded;                           // 0x38(0x1)
	char                                                         pad0x3_3OFA6[0x3];                                 // 0x39(0x3)
	float                                                        TimeLimitExceededMultiplier;                       // 0x3c(0x4)
	float                                                        TimeLimitExceededMinTime;                          // 0x40(0x4)
	int                                                          MinBulkDataSizeForAsyncLoading;                    // 0x44(0x4)
	float                                                        AsyncIOBandwidthLimit;                             // 0x48(0x4)
	bool                                                         UseBackgroundLevelStreaming;                       // 0x4c(0x1)
	bool                                                         AsyncLoadingUseFullTimeLimit;                      // 0x4c(0x1)
	char                                                         pad0x3_B9VDF[0x3];                                 // 0x4d(0x3)
	float                                                        AsyncLoadingTimeLimit;                             // 0x50(0x4)
	float                                                        PriorityAsyncLoadingExtraTime;                     // 0x54(0x4)
	float                                                        LevelStreamingActorsUpdateTimeLimit;               // 0x58(0x4)
	int                                                          LevelStreamingComponentsRegistrationGranularity;   // 0x5c(0x4)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class SoundNodeRandom: public SoundNode
{
public:
	TArray<float>                                                Weights;                                           // 0x38(0x10)
	int                                                          PreselectAtLevelLoad;                              // 0x48(0x4)
	bool                                                         bRandomizeWithoutReplacement;                      // 0x4c(0x1)
	char                                                         pad0x3_5YSOK[0x3];                                 // 0x4d(0x3)
	TArray<bool>                                                 HasBeenUsed;                                       // 0x50(0x10)
	int                                                          NumRandomUsed;                                     // 0x60(0x4)
	char                                                         pad0x4_UNWFJ[0x4];                                 // 0x64(0x4)
};


// Size 0x0 (Full Size[0x3a0] - InheritedSize[0x3a0]
class ThreadedActor: public Actor
{
public:
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionCeil: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleWindBase: public ParticleModule
{
public:
};


// Size 0x0 (Full Size[0x40] - InheritedSize[0x40]
class NavArea_LowHeight: public NavArea
{
public:
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class MaterialExpressionStaticBool: public MaterialExpression
{
public:
	bool                                                         Value;                                             // 0x70(0x1)
	char                                                         pad0x7_V2RJ0[0x7];                                 // 0x71(0x7)
};


// Size 0x0 (Full Size[0x40] - InheritedSize[0x40]
class NavAreaMeta: public NavArea
{
public:
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class SoundNodeMixer: public SoundNode
{
public:
	TArray<float>                                                InputVolume;                                       // 0x38(0x10)
};


// Size 0x90 (Full Size[0x100] - InheritedSize[0x70]
class MaterialExpressionNoise: public MaterialExpression
{
public:
	struct ExpressionInput                                       Position;                                          // 0x70(0x38)
	struct ExpressionInput                                       FilterWidth;                                       // 0xa8(0x38)
	float                                                        Scale;                                             // 0xe0(0x4)
	int                                                          Quality;                                           // 0xe4(0x4)
	char                                                         NoiseFunction;                                     // 0xe8(0x1)
	char                                                         pad0x3_2BH58[0x3];                                 // 0xe9(0x3)
	bool                                                         bTurbulence;                                       // 0xec(0x1)
	char                                                         pad0x3_JL7F3[0x3];                                 // 0xed(0x3)
	int                                                          Levels;                                            // 0xf0(0x4)
	float                                                        OutputMin;                                         // 0xf4(0x4)
	float                                                        OutputMax;                                         // 0xf8(0x4)
	float                                                        LevelScale;                                        // 0xfc(0x4)
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class ActorWithComponentWithDerivedTestInterface: public Actor
{
public:
	class ComponentWithDerivedTestInterface*                     ComponentWithDerivedTestInterface;                 // 0x3a0(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class PostProcessEditorSettings: public DeveloperSettings
{
public:
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class ComponentWithDerivedTestInterface: public ActorComponent
{
public:
	char                                                         pad0x8_JDX4V[0x8];                                 // 0xb8(0x8)
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class ActorWithTestInterface: public Actor
{
public:
	char                                                         pad0x8_LBKOT[0x8];                                 // 0x3a0(0x8)
};


// Size 0x10 (Full Size[0x60] - InheritedSize[0x50]
class InterpGroupCamera: public InterpGroup
{
public:
	class CameraAnim*                                            CameraAnimInst;                                    // 0x50(0x8)
	float                                                        CompressTolerance;                                 // 0x58(0x4)
	char                                                         pad0x4_EAWED[0x4];                                 // 0x5c(0x4)
};


// Size 0x40 (Full Size[0xb0] - InheritedSize[0x70]
class MaterialExpressionSphericalParticleOpacity: public MaterialExpression
{
public:
	struct ExpressionInput                                       Density;                                           // 0x70(0x38)
	float                                                        ConstantDensity;                                   // 0xa8(0x4)
	char                                                         pad0x4_IHVG2[0x4];                                 // 0xac(0x4)
};


// Size 0x18 (Full Size[0x68] - InheritedSize[0x50]
class ParticleModuleParametersOverX: public ParticleModule
{
public:
	float                                                        GroupScales;                                       // 0x50(0x4)
	char                                                         pad0x14_XJL26[0x14];                               // 0x54(0x14)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionCausticTexture: public MaterialExpression
{
public:
	struct ExpressionInput                                       Coordinates;                                       // 0x70(0x38)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class RecastNavMeshDataChunk: public NavigationDataChunk
{
public:
	char                                                         pad0x10_MYM7L[0x10];                               // 0x30(0x10)
};


// Size 0x10 (Full Size[0x220] - InheritedSize[0x210]
class LevelStreamingKismet: public LevelStreaming
{
public:
	bool                                                         bInitiallyLoaded;                                  // 0x210(0x1)
	bool                                                         bInitiallyVisible;                                 // 0x210(0x1)
	char                                                         pad0xf_H8M70[0xf];                                 // 0x211(0xf)
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleAttractorBase: public ParticleModule
{
public:
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionDDY: public MaterialExpression
{
public:
	struct ExpressionInput                                       Value;                                             // 0x70(0x38)
};


// Size 0x8 (Full Size[0x58] - InheritedSize[0x50]
class ParticleModuleOrbitBase: public ParticleModule
{
public:
	bool                                                         bUseEmitterTime;                                   // 0x50(0x1)
	char                                                         pad0x7_PCXSY[0x7];                                 // 0x51(0x7)
};


// Size 0x8 (Full Size[0x148] - InheritedSize[0x140]
class TextureProxy: public Texture
{
public:
	class Texture*                                               Texture;                                           // 0x140(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GPUSortTestLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x68] - InheritedSize[0x68]
class RareNetworkProfilerExporter: public Exporter
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionPerInstanceRandom: public MaterialExpression
{
public:
};


// Size 0x70 (Full Size[0xe0] - InheritedSize[0x70]
class MaterialExpressionLightmassReplace: public MaterialExpression
{
public:
	struct ExpressionInput                                       Realtime;                                          // 0x70(0x38)
	struct ExpressionInput                                       Lightmass;                                         // 0xa8(0x38)
};


// Size 0x8 (Full Size[0x58] - InheritedSize[0x50]
class ParticleModuleAccelerationBase: public ParticleModule
{
public:
	bool                                                         bAlwaysInWorldSpace;                               // 0x50(0x1)
	char                                                         pad0x7_I9WUT[0x7];                                 // 0x51(0x7)
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class MaterialExpressionTime: public MaterialExpression
{
public:
	bool                                                         bIgnorePause;                                      // 0x70(0x1)
	bool                                                         bOverride_Period;                                  // 0x70(0x1)
	char                                                         pad0x3_UJ0YZ[0x3];                                 // 0x71(0x3)
	float                                                        Period;                                            // 0x74(0x4)
};


// Size 0xd8 (Full Size[0x5b8] - InheritedSize[0x4e0]
class DemoNetDriver: public NetDriver
{
public:
	char                                                         pad0xd8_XSQVF[0xd8];                               // 0x4e0(0xd8)
};


// Size 0x138 (Full Size[0x170] - InheritedSize[0x38]
class SoundNodeEnveloper: public SoundNode
{
public:
	float                                                        LoopStart;                                         // 0x38(0x4)
	float                                                        LoopEnd;                                           // 0x3c(0x4)
	float                                                        DurationAfterLoop;                                 // 0x40(0x4)
	int                                                          LoopCount;                                         // 0x44(0x4)
	bool                                                         bLoopIndefinitely;                                 // 0x48(0x1)
	bool                                                         bLoop;                                             // 0x48(0x1)
	char                                                         pad0x7_K4U4B[0x7];                                 // 0x49(0x7)
	class DistributionFloatConstantCurve*                        VolumeInterpCurve;                                 // 0x50(0x8)
	class DistributionFloatConstantCurve*                        PitchInterpCurve;                                  // 0x58(0x8)
	struct RuntimeFloatCurve                                     VolumeCurve;                                       // 0x60(0x80)
	struct RuntimeFloatCurve                                     PitchCurve;                                        // 0xe0(0x80)
	float                                                        PitchMin;                                          // 0x160(0x4)
	float                                                        PitchMax;                                          // 0x164(0x4)
	float                                                        VolumeMin;                                         // 0x168(0x4)
	float                                                        VolumeMax;                                         // 0x16c(0x4)
};


// Size 0x28 (Full Size[0x90] - InheritedSize[0x68]
class VoiceChannel: public Channel
{
public:
	char                                                         pad0x18_J68G0[0x18];                               // 0x68(0x18)
	int                                                          BandwidthPerSecondReservationInBytes;              // 0x80(0x4)
	char                                                         pad0x4_QJECV[0x4];                                 // 0x84(0x4)
	float                                                        SaturationCooloffPeriodInSeconds;                  // 0x88(0x4)
	char                                                         pad0x4_5YZ4O[0x4];                                 // 0x8c(0x4)
};


// Size 0x78 (Full Size[0xe8] - InheritedSize[0x70]
class MaterialExpressionAdd: public MaterialExpression
{
public:
	struct ExpressionInput                                       A;                                                 // 0x70(0x38)
	struct ExpressionInput                                       B;                                                 // 0xa8(0x38)
	float                                                        ConstA;                                            // 0xe0(0x4)
	float                                                        ConstB;                                            // 0xe4(0x4)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionFrac: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
};


// Size 0x80 (Full Size[0xf0] - InheritedSize[0x70]
class MaterialExpressionBreakMaterialAttributes: public MaterialExpression
{
public:
	struct ExpressionInput                                       Struct;                                            // 0x70(0x38)
	struct MaterialAttributesInput                               MaterialAttributes;                                // 0xa8(0x38)
	char                                                         pad0x10_6NZAZ[0x10];                               // 0xe0(0x10)
};


// Size 0x20 (Full Size[0xd8] - InheritedSize[0xb8]
class PlatformEventsComponent: public ActorComponent
{
public:
	char                                                         pad0x20_F3ZW8[0x20];                               // 0xb8(0x20)
};


// Size 0x0 (Full Size[0xb8] - InheritedSize[0xb8]
class ParticleSpriteEmitter: public ParticleEmitter
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SoundNodeMature: public SoundNode
{
public:
};


// Size 0x10 (Full Size[0x80] - InheritedSize[0x70]
class MaterialExpressionSpeedTree: public MaterialExpression
{
public:
	char                                                         GeometryType;                                      // 0x70(0x1)
	char                                                         WindType;                                          // 0x71(0x1)
	char                                                         LODType;                                           // 0x72(0x1)
	char                                                         pad0x1_6RGPJ[0x1];                                 // 0x73(0x1)
	float                                                        BillboardThreshold;                                // 0x74(0x4)
	bool                                                         bAccurateWindVelocities;                           // 0x78(0x1)
	char                                                         pad0x7_LJ7B6[0x7];                                 // 0x79(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class KismetTextLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class VectorFieldVolume: public Actor
{
public:
	class VectorFieldComponent*                                  VectorFieldComponent;                              // 0x3a0(0x8)
};


// Size 0x18 (Full Size[0x80] - InheritedSize[0x68]
class ControlChannel: public Channel
{
public:
	char                                                         pad0x18_OXK1B[0x18];                               // 0x68(0x18)
};


// Size 0x18 (Full Size[0xd0] - InheritedSize[0xb8]
class ComponentAggregatorComponent: public ActorComponent
{
public:
	char                                                         pad0x8_0BUAC[0x8];                                 // 0xb8(0x8)
	TArray<class Object*>                                        Aggregatables;                                     // 0xc0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class KismetMaterialLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionUnderwaterTranslucencyTexture: public MaterialExpression
{
public:
	struct ExpressionInput                                       Coordinates;                                       // 0x70(0x38)
};


// Size 0x20 (Full Size[0x60] - InheritedSize[0x40]
class AnimCompress_RemoveLinearKeys: public AnimCompress
{
public:
	float                                                        MaxPosDiff;                                        // 0x40(0x4)
	float                                                        MaxAngleDiff;                                      // 0x44(0x4)
	float                                                        MaxScaleDiff;                                      // 0x48(0x4)
	float                                                        MaxEffectorDiff;                                   // 0x4c(0x4)
	float                                                        MinEffectorDiff;                                   // 0x50(0x4)
	float                                                        EffectorDiffSocket;                                // 0x54(0x4)
	float                                                        ParentKeyScale;                                    // 0x58(0x4)
	bool                                                         bRetarget;                                         // 0x5c(0x1)
	bool                                                         bActuallyFilterLinearKeys;                         // 0x5c(0x1)
	char                                                         pad0x3_HOSEH[0x3];                                 // 0x5d(0x3)
};


// Size 0x80 (Full Size[0xf0] - InheritedSize[0x70]
class MaterialExpressionPanner: public MaterialExpression
{
public:
	struct ExpressionInput                                       Coordinate;                                        // 0x70(0x38)
	struct ExpressionInput                                       Time;                                              // 0xa8(0x38)
	float                                                        SpeedX;                                            // 0xe0(0x4)
	float                                                        SpeedY;                                            // 0xe4(0x4)
	bool                                                         bFractionalPart;                                   // 0xec(0x1)
	char                                                         pad0x3_ULE43[0x3];                                 // 0xed(0x3)
};


// Size 0x48 (Full Size[0x80] - InheritedSize[0x38]
class DeviceProfile: public TextureLODSettings
{
public:
	struct FString                                               DeviceType;                                        // 0x38(0x10)
	struct FString                                               BaseProfileName;                                   // 0x48(0x10)
	class Object*                                                Parent;                                            // 0x58(0x8)
	char                                                         pad0x8_E795M[0x8];                                 // 0x60(0x8)
	TArray<String>                                               CVars;                                             // 0x68(0x10)
	char                                                         pad0x8_4N5KL[0x8];                                 // 0x78(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ComponentDelegateBinding: public DynamicBlueprintBinding
{
public:
	TArray<struct BlueprintComponentDelegateBinding>             ComponentDelegateBindings;                         // 0x28(0x10)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionNormalize: public MaterialExpression
{
public:
	struct ExpressionInput                                       VectorInput;                                       // 0x70(0x38)
};


// Size 0x40 (Full Size[0xb0] - InheritedSize[0x70]
class MaterialExpressionDepthOfFieldFunction: public MaterialExpression
{
public:
	char                                                         FunctionValue;                                     // 0x70(0x1)
	char                                                         pad0x7_A5W8N[0x7];                                 // 0x71(0x7)
	struct ExpressionInput                                       Depth;                                             // 0x78(0x38)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionParticleDirection: public MaterialExpression
{
public:
};


// Size 0xb8 (Full Size[0x128] - InheritedSize[0x70]
class MaterialExpressionLinearInterpolate: public MaterialExpression
{
public:
	struct ExpressionInput                                       A;                                                 // 0x70(0x38)
	struct ExpressionInput                                       B;                                                 // 0xa8(0x38)
	struct ExpressionInput                                       Alpha;                                             // 0xe0(0x38)
	float                                                        ConstA;                                            // 0x118(0x4)
	float                                                        ConstB;                                            // 0x11c(0x4)
	float                                                        ConstAlpha;                                        // 0x120(0x4)
	char                                                         pad0x4_VQ5K0[0x4];                                 // 0x124(0x4)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionParticleRelativeTime: public MaterialExpression
{
public:
};


// Size 0x120 (Full Size[0x158] - InheritedSize[0x38]
class UserInterfaceSettings: public DeveloperSettings
{
public:
	char                                                         RenderFocusRule;                                   // 0x38(0x1)
	char                                                         pad0x7_ZICTM[0x7];                                 // 0x39(0x7)
	struct StringClassReference                                  DefaultCursor;                                     // 0x40(0x10)
	struct StringClassReference                                  TextEditBeamCursor;                                // 0x50(0x10)
	struct StringClassReference                                  CrosshairsCursor;                                  // 0x60(0x10)
	struct StringClassReference                                  GrabHandCursor;                                    // 0x70(0x10)
	struct StringClassReference                                  GrabHandClosedCursor;                              // 0x80(0x10)
	struct StringClassReference                                  SlashedCircleCursor;                               // 0x90(0x10)
	float                                                        ApplicationScale;                                  // 0xa0(0x4)
	char                                                         UIScaleRule;                                       // 0xa4(0x1)
	char                                                         pad0x3_60E05[0x3];                                 // 0xa5(0x3)
	struct StringClassReference                                  CustomScalingRuleClass;                            // 0xa8(0x10)
	struct RuntimeFloatCurve                                     UIScaleCurve;                                      // 0xb8(0x80)
	TArray<class Object*>                                        CursorClasses;                                     // 0x138(0x10)
	class UClass*                                                CustomScalingRuleClassInstance;                    // 0x148(0x8)
	class DPICustomScalingRule*                                  CustomScalingRule;                                 // 0x150(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DataTableFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class InterpTrackInstFloatParticleParam: public InterpTrackInst
{
public:
	float                                                        ResetFloat;                                        // 0x28(0x4)
	char                                                         pad0x4_9S8FD[0x4];                                 // 0x2c(0x4)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionPerInstanceFadeAmount: public MaterialExpression
{
public:
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class DistributionVector: public Distribution
{
public:
	bool                                                         bCanBeBaked;                                       // 0x30(0x1)
	bool                                                         bIsDirty;                                          // 0x30(0x1)
	char                                                         pad0x7_TIPZP[0x7];                                 // 0x31(0x7)
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class Light: public Actor
{
public:
	class LightComponent*                                        LightComponent;                                    // 0x3a0(0x8)
};


// Size 0x40 (Full Size[0xb0] - InheritedSize[0x70]
class MaterialExpressionTransform: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
	char                                                         TransformSourceType;                               // 0xa8(0x1)
	char                                                         TransformType;                                     // 0xa9(0x1)
	char                                                         pad0x6_OUQWP[0x6];                                 // 0xaa(0x6)
};


// Size 0x18 (Full Size[0x88] - InheritedSize[0x70]
class InterpTrackEvent: public InterpTrack
{
public:
	TArray<struct EventTrackKey>                                 EventTrack;                                        // 0x70(0x10)
	bool                                                         bFireEventsWhenForwards;                           // 0x80(0x1)
	bool                                                         bFireEventsWhenBackwards;                          // 0x80(0x1)
	bool                                                         bFireEventsWhenJumpingForwards;                    // 0x80(0x1)
	bool                                                         bUseCustomEventName;                               // 0x80(0x1)
	char                                                         pad0x7_8DG2H[0x7];                                 // 0x81(0x7)
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleCameraBase: public ParticleModule
{
public:
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionLogarithm2: public MaterialExpression
{
public:
	struct ExpressionInput                                       X;                                                 // 0x70(0x38)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FeatureConfigBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x40] - InheritedSize[0x40]
class AnimCompress_LeastDestructive: public AnimCompress
{
public:
};


// Size 0x50 (Full Size[0x3f0] - InheritedSize[0x3a0]
class NavLinkProxy: public Actor
{
public:
	char                                                         pad0x10_0J280[0x10];                               // 0x3a0(0x10)
	TArray<struct NavigationLink>                                PointLinks;                                        // 0x3b0(0x10)
	TArray<struct NavigationSegmentLink>                         SegmentLinks;                                      // 0x3c0(0x10)
	class NavLinkCustomComponent*                                SmartLinkComp;                                     // 0x3d0(0x8)
	bool                                                         bSmartLinkIsRelevant;                              // 0x3d8(0x1)
	char                                                         pad0x7_E2DJU[0x7];                                 // 0x3d9(0x7)
	char                                                         pad0x10_SUXBC[0x10];                               // 0x3e0(0x10)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class SoundNodeGroupControl: public SoundNode
{
public:
	TArray<int>                                                  GroupSizes;                                        // 0x38(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class KismetArrayLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x38 (Full Size[0x3d8] - InheritedSize[0x3a0]
class LODActor: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x3a0(0x8)
	TArray<class Actor*>                                         SubActors;                                         // 0x3a8(0x10)
	float                                                        LODDrawDistance;                                   // 0x3b8(0x4)
	int                                                          LodLevel;                                          // 0x3bc(0x4)
	TArray<class Object*>                                        SubObjects;                                        // 0x3c0(0x10)
	char                                                         pad0x8_WGC2P[0x8];                                 // 0x3d0(0x8)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class SoundNodeLooping: public SoundNode
{
public:
	int                                                          LoopCount;                                         // 0x38(0x4)
	bool                                                         bLoopIndefinitely;                                 // 0x3c(0x1)
	char                                                         pad0x3_HYX8B[0x3];                                 // 0x3d(0x3)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ParticleWarningFunctions: public BlueprintFunctionLibrary
{
public:
};


// Size 0x90 (Full Size[0xc8] - InheritedSize[0x38]
class PhysicsSettings: public DeveloperSettings
{
public:
	float                                                        DefaultGravityZ;                                   // 0x38(0x4)
	float                                                        DefaultTerminalVelocity;                           // 0x3c(0x4)
	float                                                        DefaultFluidFriction;                              // 0x40(0x4)
	int                                                          SimulateScratchMemorySize;                         // 0x44(0x4)
	int                                                          RagdollAggregateThreshold;                         // 0x48(0x4)
	float                                                        TriangleMeshTriangleMinAreaThreshold;              // 0x4c(0x4)
	bool                                                         bEnableAsyncScene;                                 // 0x50(0x1)
	bool                                                         bEnableShapeSharing;                               // 0x51(0x1)
	bool                                                         bEnablePCM;                                        // 0x52(0x1)
	bool                                                         bWarnMissingLocks;                                 // 0x53(0x1)
	bool                                                         bEnable2DPhysics;                                  // 0x54(0x1)
	char                                                         LockedAxis;                                        // 0x55(0x1)
	char                                                         DefaultDegreesOfFreedom;                           // 0x56(0x1)
	char                                                         pad0x1_H6ZM5[0x1];                                 // 0x57(0x1)
	float                                                        BounceThresholdVelocity;                           // 0x58(0x4)
	char                                                         FrictionCombineMode;                               // 0x5c(0x1)
	char                                                         RestitutionCombineMode;                            // 0x5d(0x1)
	char                                                         pad0x2_ZG2AB[0x2];                                 // 0x5e(0x2)
	float                                                        MaxAngularVelocity;                                // 0x60(0x4)
	float                                                        MaxDepenetrationVelocity;                          // 0x64(0x4)
	bool                                                         bSimulateSkeletalMeshOnDedicatedServer;            // 0x68(0x1)
	bool                                                         bDefaultHasComplexCollision;                       // 0x69(0x1)
	char                                                         pad0x2_P12JQ[0x2];                                 // 0x6a(0x2)
	float                                                        MaxPhysicsDeltaTime;                               // 0x6c(0x4)
	bool                                                         bSubstepping;                                      // 0x70(0x1)
	bool                                                         bSubsteppingAsync;                                 // 0x71(0x1)
	char                                                         pad0x2_VKJF6[0x2];                                 // 0x72(0x2)
	float                                                        MaxSubstepDeltaTime;                               // 0x74(0x4)
	int                                                          MaxSubsteps;                                       // 0x78(0x4)
	float                                                        SyncSceneSmoothingFactor;                          // 0x7c(0x4)
	float                                                        AsyncSceneSmoothingFactor;                         // 0x80(0x4)
	float                                                        InitialAverageFrameRate;                           // 0x84(0x4)
	TArray<struct PhysicalSurfaceName>                           PhysicalSurfaces;                                  // 0x88(0x10)
	TArray<struct DominanceGroupPair>                            DominanceGroups;                                   // 0x98(0x10)
	TArray<struct DominanceGroupName>                            DominanceGroupNames;                               // 0xa8(0x10)
	char                                                         DefaultStaticDominanceGroup;                       // 0xb8(0x1)
	char                                                         DefaultMovableDominanceGroup;                      // 0xb9(0x1)
	bool                                                         bEnableMBP;                                        // 0xba(0x1)
	char                                                         pad0x1_6NIJ2[0x1];                                 // 0xbb(0x1)
	int                                                          MBPSubdivisions;                                   // 0xbc(0x4)
	float                                                        MBPWorldHalfExtentInCM;                            // 0xc0(0x4)
	char                                                         pad0x4_AUGOU[0x4];                                 // 0xc4(0x4)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionLowResClouds: public MaterialExpression
{
public:
	struct ExpressionInput                                       Coordinates;                                       // 0x70(0x38)
};


// Size 0x1c8 (Full Size[0x218] - InheritedSize[0x50]
class SoundWave: public SoundBase
{
public:
	int                                                          CompressionQuality;                                // 0x50(0x4)
	bool                                                         bLooping;                                          // 0x54(0x1)
	bool                                                         bStreaming;                                        // 0x54(0x1)
	char                                                         pad0x3_EN228[0x3];                                 // 0x55(0x3)
	int                                                          StreamingPriority;                                 // 0x58(0x4)
	bool                                                         bMature;                                           // 0x5c(0x1)
	bool                                                         bManualWordWrap;                                   // 0x5c(0x1)
	bool                                                         bSingleLine;                                       // 0x5c(0x1)
	char                                                         pad0x3_LTLF0[0x3];                                 // 0x5d(0x3)
	char                                                         SoundGroup;                                        // 0x60(0x1)
	char                                                         pad0x7_TLFT2[0x7];                                 // 0x61(0x7)
	struct FString                                               SpokenText;                                        // 0x68(0x10)
	float                                                        Volume;                                            // 0x78(0x4)
	float                                                        Pitch;                                             // 0x7c(0x4)
	int                                                          NumChannels;                                       // 0x80(0x4)
	int                                                          SampleRate;                                        // 0x84(0x4)
	int                                                          RawPCMDataSize;                                    // 0x88(0x4)
	char                                                         pad0x4_IK2IX[0x4];                                 // 0x8c(0x4)
	TArray<struct SubtitleCue>                                   Subtitles;                                         // 0x90(0x10)
	TArray<struct LocalizedSubtitle>                             LocalizedSubtitles;                                // 0xa0(0x10)
	char                                                         pad0x168_0S3Y1[0x168];                             // 0xb0(0x168)
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleLocationBase: public ParticleModule
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InterpTrackInstSound: public InterpTrackInst
{
public:
	float                                                        LastUpdatePosition;                                // 0x28(0x4)
	char                                                         pad0x4_K64RV[0x4];                                 // 0x2c(0x4)
	class AudioComponent*                                        PlayAudioComp;                                     // 0x30(0x8)
};


// Size 0x10 (Full Size[0x3b0] - InheritedSize[0x3a0]
class TriggerBase: public Actor
{
public:
	class ShapeComponent*                                        CollisionComponent;                                // 0x3a0(0x8)
	class BillboardComponent*                                    SpriteComponent;                                   // 0x3a8(0x8)
};


// Size 0x20 (Full Size[0x3c0] - InheritedSize[0x3a0]
class DestructibleActor: public Actor
{
public:
	class DestructibleComponent*                                 DestructibleComponent;                             // 0x3a0(0x8)
	bool                                                         bAffectNavigation;                                 // 0x3a8(0x1)
	char                                                         pad0x7_OHGP6[0x7];                                 // 0x3a9(0x7)
	char                                                         pad0x10_PJAGY[0x10];                               // 0x3b0(0x10)
};


// Size 0x10 (Full Size[0x80] - InheritedSize[0x70]
class MaterialExpressionFontSample: public MaterialExpression
{
public:
	class Font*                                                  Font;                                              // 0x70(0x8)
	int                                                          FontTexturePage;                                   // 0x78(0x4)
	char                                                         pad0x4_GT8SQ[0x4];                                 // 0x7c(0x4)
};


// Size 0x570 (Full Size[0x910] - InheritedSize[0x3a0]
class CameraActor: public Actor
{
public:
	char                                                         AutoActivateForPlayer;                             // 0x3a0(0x1)
	char                                                         pad0x7_MDBBE[0x7];                                 // 0x3a1(0x7)
	class CameraComponent*                                       CameraComponent;                                   // 0x3a8(0x8)
	char                                                         pad0x8_VMY25[0x8];                                 // 0x3b0(0x8)
	bool                                                         bConstrainAspectRatio;                             // 0x3b8(0x1)
	char                                                         pad0x3_MC07E[0x3];                                 // 0x3b9(0x3)
	float                                                        AspectRatio;                                       // 0x3bc(0x4)
	float                                                        FOVAngle;                                          // 0x3c0(0x4)
	float                                                        PostProcessBlendWeight;                            // 0x3c4(0x4)
	char                                                         pad0x8_3FQXT[0x8];                                 // 0x3c8(0x8)
	struct PostProcessSettings                                   PostProcessSettings;                               // 0x3d0(0x540)
};


// Size 0x10 (Full Size[0x80] - InheritedSize[0x70]
class MaterialExpressionConstant3Vector: public MaterialExpression
{
public:
	struct LinearColor                                           Constant;                                          // 0x70(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class AnimNotify_ResetDynamics: public AnimNotify
{
public:
};


// Size 0x78 (Full Size[0xe8] - InheritedSize[0x70]
class MaterialExpressionPower: public MaterialExpression
{
public:
	struct ExpressionInput                                       Base;                                              // 0x70(0x38)
	struct ExpressionInput                                       Exponent;                                          // 0xa8(0x38)
	float                                                        ConstExponent;                                     // 0xe0(0x4)
	char                                                         pad0x4_5L8WR[0x4];                                 // 0xe4(0x4)
};


// Size 0x0 (Full Size[0x3a0] - InheritedSize[0x3a0]
class ClientOnlyTestActor: public Actor
{
public:
};


// Size 0x58 (Full Size[0x3f8] - InheritedSize[0x3a0]
class AutomaticInstancingActor: public Actor
{
public:
	class SceneComponent*                                        DummyRoot;                                         // 0x3a0(0x8)
	char                                                         pad0x50_VF6SA[0x50];                               // 0x3a8(0x50)
};


// Size 0x60 (Full Size[0x400] - InheritedSize[0x3a0]
class Controller: public Actor
{
public:
	char                                                         pad0x8_W4HEC[0x8];                                 // 0x3a0(0x8)
	class Pawn*                                                  Pawn;                                              // 0x3a8(0x8)
	char                                                         pad0x8_JFS35[0x8];                                 // 0x3b0(0x8)
	class Character*                                             Character;                                         // 0x3b8(0x8)
	class PlayerState*                                           PlayerState;                                       // 0x3c0(0x8)
	class SceneComponent*                                        TransformComponent;                                // 0x3c8(0x8)
	struct Rotator                                               ControlRotation;                                   // 0x3d0(0xc)
	bool                                                         bAttachToPawn;                                     // 0x3dc(0x1)
	char                                                         pad0xb_HW3ON[0xb];                                 // 0x3dd(0xb)
	struct FName                                                 StateName;                                         // 0x3e8(0x8)
	char                                                         pad0x10_NHOQ5[0x10];                               // 0x3f0(0x10)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class MorphTarget: public VertexAnimBase
{
public:
	char                                                         pad0x10_M9AZ0[0x10];                               // 0x30(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ContentStreamingBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InterpTrackInstProperty: public InterpTrackInst
{
public:
	class Property*                                              InterpProperty;                                    // 0x28(0x8)
	class Object*                                                PropertyOuterObjectInst;                           // 0x30(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SoundNodeAssetReferencer: public SoundNode
{
public:
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class SoundNodeModulator: public SoundNode
{
public:
	float                                                        PitchMin;                                          // 0x38(0x4)
	float                                                        PitchMax;                                          // 0x3c(0x4)
	float                                                        VolumeMin;                                         // 0x40(0x4)
	float                                                        VolumeMax;                                         // 0x44(0x4)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class MicroTransactionBase: public PlatformInterfaceBase
{
public:
	TArray<struct PurchaseInfo>                                  AvailableProducts;                                 // 0x38(0x10)
	struct FString                                               LastError;                                         // 0x48(0x10)
	struct FString                                               LastErrorSolution;                                 // 0x58(0x10)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionLumaAvg: public MaterialExpression
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SkeletalMeshMergeBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x78 (Full Size[0x418] - InheritedSize[0x3a0]
class Pawn: public Actor
{
public:
	char                                                         pad0x8_4DE8A[0x8];                                 // 0x3a0(0x8)
	bool                                                         bUseControllerRotationPitch;                       // 0x3a8(0x1)
	bool                                                         bUseControllerRotationYaw;                         // 0x3a8(0x1)
	bool                                                         bUseControllerRotationRoll;                        // 0x3a8(0x1)
	bool                                                         bCanAffectNavigationGeneration;                    // 0x3a8(0x1)
	char                                                         pad0x3_PGFO0[0x3];                                 // 0x3a9(0x3)
	float                                                        BaseEyeHeight;                                     // 0x3ac(0x4)
	char                                                         AutoPossessPlayer;                                 // 0x3b0(0x1)
	char                                                         AutoPossessAI;                                     // 0x3b1(0x1)
	char                                                         pad0x6_9VGD5[0x6];                                 // 0x3b2(0x6)
	class UClass*                                                AIControllerClass;                                 // 0x3b8(0x8)
	class PlayerState*                                           PlayerState;                                       // 0x3c0(0x8)
	char                                                         RemoteViewPitch;                                   // 0x3c8(0x1)
	char                                                         pad0x7_KRDS0[0x7];                                 // 0x3c9(0x7)
	class Controller*                                            LastHitBy;                                         // 0x3d0(0x8)
	class Controller*                                            Controller;                                        // 0x3d8(0x8)
	char                                                         pad0x18_ZA0AE[0x18];                               // 0x3e0(0x18)
	struct Vector                                                ControlInputVector;                                // 0x3f8(0xc)
	struct Vector                                                LastControlInputVector;                            // 0x404(0xc)
	char                                                         pad0x8_QPW8U[0x8];                                 // 0x410(0x8)
};


// Size 0x28 (Full Size[0x98] - InheritedSize[0x70]
class MaterialExpressionComment: public MaterialExpression
{
public:
	int                                                          SizeX;                                             // 0x70(0x4)
	int                                                          SizeY;                                             // 0x74(0x4)
	struct FString                                               Text;                                              // 0x78(0x10)
	struct LinearColor                                           CommentColor;                                      // 0x88(0x10)
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class DocumentationActor: public Actor
{
public:
	char                                                         pad0x8_YYTLZ[0x8];                                 // 0x3a0(0x8)
};


// Size 0xa8 (Full Size[0x160] - InheritedSize[0xb8]
class PhysicsHandleComponent: public ActorComponent
{
public:
	class PrimitiveComponent*                                    GrabbedComponent;                                  // 0xb8(0x8)
	char                                                         pad0x10_005IB[0x10];                               // 0xc0(0x10)
	float                                                        LinearDamping;                                     // 0xd0(0x4)
	float                                                        LinearStiffness;                                   // 0xd4(0x4)
	float                                                        AngularDamping;                                    // 0xd8(0x4)
	float                                                        AngularStiffness;                                  // 0xdc(0x4)
	char                                                         pad0x60_2N48J[0x60];                               // 0xe0(0x60)
	float                                                        InterpolationSpeed;                                // 0x140(0x4)
	char                                                         pad0x1c_0YFLM[0x1c];                               // 0x144(0x1c)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class AutomaticInstancingSettings: public DeveloperSettings
{
public:
	bool                                                         IsEnabled;                                         // 0x38(0x1)
	char                                                         pad0x7_CJIW9[0x7];                                 // 0x39(0x7)
};


// Size 0x78 (Full Size[0xe8] - InheritedSize[0x70]
class MaterialExpressionDivide: public MaterialExpression
{
public:
	struct ExpressionInput                                       A;                                                 // 0x70(0x38)
	struct ExpressionInput                                       B;                                                 // 0xa8(0x38)
	float                                                        ConstA;                                            // 0xe0(0x4)
	float                                                        ConstB;                                            // 0xe4(0x4)
};


// Size 0x20 (Full Size[0xa0] - InheritedSize[0x80]
class PluginCommandlet: public Commandlet
{
public:
	char                                                         pad0x20_EJVDH[0x20];                               // 0x80(0x20)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class InGameAdManager: public PlatformInterfaceBase
{
public:
	bool                                                         bShouldPauseWhileAdOpen;                           // 0x38(0x1)
	char                                                         pad0x7_MIEC5[0x7];                                 // 0x39(0x7)
	TArray<uintptr_t>                                            ClickedBannerDelegates;                            // 0x40(0x10)
	TArray<uintptr_t>                                            ClosedAdDelegates;                                 // 0x50(0x10)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionParticleSize: public MaterialExpression
{
public:
};


// Size 0x0 (Full Size[0x3a0] - InheritedSize[0x3a0]
class StreamingProbe: public Actor
{
public:
};


// Size 0x0 (Full Size[0x3a0] - InheritedSize[0x3a0]
class ServerOnlyTestActor: public Actor
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LoadingPerfBPFuncLib: public BlueprintFunctionLibrary
{
public:
};


// Size 0x8 (Full Size[0x58] - InheritedSize[0x50]
class ParticleModuleVelocityBase: public ParticleModule
{
public:
	bool                                                         bInWorldSpace;                                     // 0x50(0x1)
	bool                                                         bApplyOwnerScale;                                  // 0x50(0x1)
	char                                                         pad0x7_PZ2K4[0x7];                                 // 0x51(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NetPushModelHelpers: public BlueprintFunctionLibrary
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InstancedActorDelegateBinding: public DynamicBlueprintBinding
{
public:
	TArray<struct BlueprintInstancedActorDelegateBinding>        ActorDelegateBindings;                             // 0x28(0x10)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class SoundNodeSwitch: public SoundNode
{
public:
	struct FName                                                 IntParameterName;                                  // 0x38(0x8)
};


// Size 0x88 (Full Size[0xd0] - InheritedSize[0x48]
class VectorFieldStatic: public VectorField
{
public:
	int                                                          SizeX;                                             // 0x48(0x4)
	int                                                          SizeY;                                             // 0x4c(0x4)
	int                                                          SizeZ;                                             // 0x50(0x4)
	char                                                         pad0x7c_V5CK3[0x7c];                               // 0x54(0x7c)
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleColorBase: public ParticleModule
{
public:
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionDistanceFieldGradient: public MaterialExpression
{
public:
	struct ExpressionInput                                       Position;                                          // 0x70(0x38)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class SoundNodeWaveParam: public SoundNode
{
public:
	struct FName                                                 WaveParameterName;                                 // 0x38(0x8)
};


// Size 0x0 (Full Size[0x3a0] - InheritedSize[0x3a0]
class TargetPoint: public Actor
{
public:
};


// Size 0x10 (Full Size[0x3b0] - InheritedSize[0x3a0]
class MaterialInstanceActor: public Actor
{
public:
	TArray<class Actor*>                                         TargetActors;                                      // 0x3a0(0x10)
};


// Size 0x28 (Full Size[0x58] - InheritedSize[0x30]
class AnimNotifyState_Trail: public AnimNotifyState
{
public:
	class ParticleSystem*                                        PSTemplate;                                        // 0x30(0x8)
	struct FName                                                 FirstSocketName;                                   // 0x38(0x8)
	struct FName                                                 SecondSocketName;                                  // 0x40(0x8)
	char                                                         WidthScaleMode;                                    // 0x48(0x1)
	char                                                         pad0x3_OLW9A[0x3];                                 // 0x49(0x3)
	struct FName                                                 WidthScaleCurve;                                   // 0x4c(0x8)
	char                                                         pad0x4_BB9LO[0x4];                                 // 0x54(0x4)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionAtmosphericFogColor: public MaterialExpression
{
public:
	struct ExpressionInput                                       WorldPosition;                                     // 0x70(0x38)
};


// Size 0x40 (Full Size[0x88] - InheritedSize[0x48]
class VectorFieldAnimated: public VectorField
{
public:
	class Texture2D*                                             Texture;                                           // 0x48(0x8)
	char                                                         ConstructionOp;                                    // 0x50(0x1)
	char                                                         pad0x3_IXRUH[0x3];                                 // 0x51(0x3)
	int                                                          VolumeSizeX;                                       // 0x54(0x4)
	int                                                          VolumeSizeY;                                       // 0x58(0x4)
	int                                                          VolumeSizeZ;                                       // 0x5c(0x4)
	int                                                          SubImagesX;                                        // 0x60(0x4)
	int                                                          SubImagesY;                                        // 0x64(0x4)
	int                                                          FrameCount;                                        // 0x68(0x4)
	float                                                        FramesPerSecond;                                   // 0x6c(0x4)
	bool                                                         bLoop;                                             // 0x70(0x1)
	char                                                         pad0x7_BP9KC[0x7];                                 // 0x71(0x7)
	class VectorFieldStatic*                                     NoiseField;                                        // 0x78(0x8)
	float                                                        NoiseScale;                                        // 0x80(0x4)
	float                                                        NoiseMax;                                          // 0x84(0x4)
};


// Size 0x34648 (Full Size[0x34690] - InheritedSize[0x48]
class NetConnection: public Player
{
public:
	char                                                         pad0x8_F8DRQ[0x8];                                 // 0x48(0x8)
	TArray<class ChildConnection*>                               Children;                                          // 0x50(0x10)
	class NetDriver*                                             Driver;                                            // 0x60(0x8)
	class PackageMap*                                            PackageMap;                                        // 0x68(0x8)
	TArray<class Channel*>                                       OpenChannels;                                      // 0x70(0x10)
	TArray<class Actor*>                                         SentTemporaries;                                   // 0x80(0x10)
	class Actor*                                                 ViewTarget;                                        // 0x90(0x8)
	class Actor*                                                 OwningActor;                                       // 0x98(0x8)
	int                                                          MaxPacket;                                         // 0xa0(0x4)
	bool                                                         InternalAck;                                       // 0xa4(0x1)
	char                                                         pad0x2fb_Z62N7[0x2fb];                             // 0xa5(0x2fb)
	double                                                       LastReceiveTime;                                   // 0x3a0(0x8)
	char                                                         pad0x34120_56V5X[0x34120];                         // 0x3a8(0x34120)
	TArray<class Actor*>                                         ConsideredActorsList;                              // 0x344c8(0x10)
	char                                                         pad0x10_13T73[0x10];                               // 0x344d8(0x10)
	int                                                          MaxDormantActorsCheckedFromRelevancy;              // 0x344e8(0x4)
	char                                                         pad0x64_J52P9[0x64];                               // 0x344ec(0x64)
	TArray<class Channel*>                                       DeferredCloseChannels;                             // 0x34550(0x10)
	char                                                         pad0x130_DHSXX[0x130];                             // 0x34560(0x130)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class InterpTrackInstColorScale: public InterpTrackInst
{
public:
};


// Size 0x10 (Full Size[0x80] - InheritedSize[0x70]
class MaterialExpressionConstant4Vector: public MaterialExpression
{
public:
	struct LinearColor                                           Constant;                                          // 0x70(0x10)
};


// Size 0x1890 (Full Size[0x1c30] - InheritedSize[0x3a0]
class PlayerCameraManager: public Actor
{
public:
	class PlayerController*                                      PCOwner;                                           // 0x3a0(0x8)
	class SceneComponent*                                        TransformComponent;                                // 0x3a8(0x8)
	char                                                         pad0x8_9P1UO[0x8];                                 // 0x3b0(0x8)
	float                                                        DefaultFOV;                                        // 0x3b8(0x4)
	char                                                         pad0x4_E7DQM[0x4];                                 // 0x3bc(0x4)
	float                                                        DefaultOrthoWidth;                                 // 0x3c0(0x4)
	char                                                         pad0x4_JKUTW[0x4];                                 // 0x3c4(0x4)
	float                                                        DefaultAspectRatio;                                // 0x3c8(0x4)
	char                                                         pad0x44_VF4AQ[0x44];                               // 0x3cc(0x44)
	struct CameraCacheEntry                                      CameraCache;                                       // 0x410(0x5b0)
	struct CameraCacheEntry                                      LastFrameCameraCache;                              // 0x9c0(0x5b0)
	struct TViewTarget                                           ViewTarget;                                        // 0xf70(0x5c0)
	struct TViewTarget                                           PendingViewTarget;                                 // 0x1530(0x5c0)
	char                                                         pad0x30_KM1J1[0x30];                               // 0x1af0(0x30)
	TArray<class CameraModifier*>                                ModifierList;                                      // 0x1b20(0x10)
	TArray<class Class*>                                         DefaultModifiers;                                  // 0x1b30(0x10)
	float                                                        FreeCamDistance;                                   // 0x1b40(0x4)
	struct Vector                                                FreeCamOffset;                                     // 0x1b44(0xc)
	struct Vector                                                ViewTargetOffset;                                  // 0x1b50(0xc)
	char                                                         pad0x14_IYWN3[0x14];                               // 0x1b5c(0x14)
	TArray<class EmitterCameraLensEffectBase*>                   CameraLensEffects;                                 // 0x1b70(0x10)
	class CameraModifier_CameraShake*                            CachedCameraShakeMod;                              // 0x1b80(0x8)
	class CameraAnimInst*                                        AnimInstPool;                                      // 0x1b88(0x8)
	char                                                         pad0x38_H9DLS[0x38];                               // 0x1b90(0x38)
	TArray<struct PostProcessSettings>                           PostProcessBlendCache;                             // 0x1bc8(0x10)
	char                                                         pad0x10_9W13P[0x10];                               // 0x1bd8(0x10)
	TArray<class CameraAnimInst*>                                ActiveAnims;                                       // 0x1be8(0x10)
	TArray<class CameraAnimInst*>                                FreeAnims;                                         // 0x1bf8(0x10)
	class CameraActor*                                           AnimCameraActor;                                   // 0x1c08(0x8)
	bool                                                         bIsOrthographic;                                   // 0x1c10(0x1)
	bool                                                         bUseClientSideCameraUpdates;                       // 0x1c10(0x1)
	bool                                                         bFollowHmdOrientation;                             // 0x1c11(0x1)
	char                                                         pad0x2_PPFUR[0x2];                                 // 0x1c12(0x2)
	float                                                        ViewPitchMin;                                      // 0x1c14(0x4)
	float                                                        ViewPitchMax;                                      // 0x1c18(0x4)
	float                                                        ViewYawMin;                                        // 0x1c1c(0x4)
	float                                                        ViewYawMax;                                        // 0x1c20(0x4)
	float                                                        ViewRollMin;                                       // 0x1c24(0x4)
	float                                                        ViewRollMax;                                       // 0x1c28(0x4)
	char                                                         pad0x4_AXS8X[0x4];                                 // 0x1c2c(0x4)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionAbs: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class InterpTrackInstMove: public InterpTrackInst
{
public:
	struct Vector                                                ResetLocation;                                     // 0x28(0xc)
	struct Rotator                                               ResetRotation;                                     // 0x34(0xc)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionLightVector: public MaterialExpression
{
public:
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class AnotherComponentWithTestInterface: public ActorComponent
{
public:
	char                                                         pad0x8_EL168[0x8];                                 // 0xb8(0x8)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class SoundNodeDistanceCrossFade: public SoundNode
{
public:
	TArray<struct DistanceDatum>                                 CrossFadeInput;                                    // 0x38(0x10)
};


// Size 0x20 (Full Size[0x90] - InheritedSize[0x70]
class InterpTrackVectorBase: public InterpTrack
{
public:
	struct InterpCurveVector                                     VectorTrack;                                       // 0x70(0x18)
	float                                                        CurveTension;                                      // 0x88(0x4)
	char                                                         pad0x4_HMJJK[0x4];                                 // 0x8c(0x4)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionPixelDepth: public MaterialExpression
{
public:
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class NavigationInvokerComponent: public ActorComponent
{
public:
	float                                                        TileGenerationRadius;                              // 0xb8(0x4)
	float                                                        TileRemovalRadius;                                 // 0xbc(0x4)
};


// Size 0x120 (Full Size[0x158] - InheritedSize[0x38]
class CollisionProfile: public DeveloperSettings
{
public:
	TArray<struct CollisionResponseTemplate>                     Profiles;                                          // 0x38(0x10)
	TArray<struct CustomChannelSetup>                            DefaultChannelResponses;                           // 0x48(0x10)
	TArray<struct CustomProfile>                                 EditProfiles;                                      // 0x58(0x10)
	TArray<struct Redirector>                                    ProfileRedirects;                                  // 0x68(0x10)
	TArray<struct Redirector>                                    CollisionChannelRedirects;                         // 0x78(0x10)
	char                                                         pad0xd0_I5HHD[0xd0];                               // 0x88(0xd0)
};


// Size 0x18 (Full Size[0x88] - InheritedSize[0x70]
class InterpTrackDirector: public InterpTrack
{
public:
	TArray<struct DirectorTrackCut>                              CutTrack;                                          // 0x70(0x10)
	bool                                                         bSimulateCameraCutsOnClients;                      // 0x80(0x1)
	char                                                         pad0x7_UQPPC[0x7];                                 // 0x81(0x7)
};


// Size 0x0 (Full Size[0x210] - InheritedSize[0x210]
class LevelStreamingPersistent: public LevelStreaming
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionCameraVectorWS: public MaterialExpression
{
public:
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class MaterialExpressionWorldPosition: public MaterialExpression
{
public:
	char                                                         WorldPositionShaderOffset;                         // 0x70(0x1)
	char                                                         pad0x7_2JSTZ[0x7];                                 // 0x71(0x7)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionVertexID: public MaterialExpression
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class InterpTrackInstFade: public InterpTrackInst
{
public:
};


// Size 0x98 (Full Size[0x2d0] - InheritedSize[0x238]
class DestructibleMesh: public SkeletalMesh
{
public:
	struct DestructibleParameters                                DefaultDestructibleParameters;                     // 0x238(0x88)
	TArray<struct FractureEffect>                                FractureEffects;                                   // 0x2c0(0x10)
};


// Size 0x0 (Full Size[0x40] - InheritedSize[0x40]
class RecastFilter_UseDefaultArea: public NavigationQueryFilter
{
public:
};


// Size 0x160 (Full Size[0x1b8] - InheritedSize[0x58]
class MaterialInstance: public MaterialInterface
{
public:
	class PhysicalMaterial*                                      PhysMaterial;                                      // 0x58(0x8)
	class MaterialInterface*                                     Parent;                                            // 0x60(0x8)
	bool                                                         bHasStaticPermutationResource;                     // 0x68(0x1)
	bool                                                         bOverrideSubsurfaceProfile;                        // 0x68(0x1)
	char                                                         pad0x7_Z2YNP[0x7];                                 // 0x69(0x7)
	struct Guid                                                  ParentLightingGuid;                                // 0x70(0x10)
	TArray<struct FontParameterValue>                            FontParameterValues;                               // 0x80(0x10)
	TArray<struct ScalarParameterValue>                          ScalarParameterValues;                             // 0x90(0x10)
	TArray<struct TextureParameterValue>                         TextureParameterValues;                            // 0xa0(0x10)
	TArray<struct VectorParameterValue>                          VectorParameterValues;                             // 0xb0(0x10)
	struct MaterialInstanceBasePropertyOverrides                 BasePropertyOverrides;                             // 0xc0(0x84)
	char                                                         pad0x74_Z724R[0x74];                               // 0x144(0x74)
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class SplineMeshActor: public Actor
{
public:
	class SplineMeshComponent*                                   SplineMeshComponent;                               // 0x3a0(0x8)
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class LevelScriptActor: public Actor
{
public:
	bool                                                         bInputEnabled;                                     // 0x3a0(0x1)
	char                                                         pad0x7_W4H05[0x7];                                 // 0x3a1(0x7)
};


// Size 0xd0 (Full Size[0x108] - InheritedSize[0x38]
class SoundNodeAttenuation: public SoundNode
{
public:
	class SoundAttenuation*                                      AttenuationSettings;                               // 0x38(0x8)
	struct AttenuationSettings                                   AttenuationOverrides;                              // 0x40(0xc0)
	bool                                                         bOverrideAttenuation;                              // 0x100(0x1)
	char                                                         pad0x7_Y8V7X[0x7];                                 // 0x101(0x7)
};


// Size 0x10 (Full Size[0x3b0] - InheritedSize[0x3a0]
class FogVolume: public Actor
{
public:
	class SphereComponent*                                       SphereComponent;                                   // 0x3a0(0x8)
	class FogVolumeComponent*                                    FogVolumeComponent;                                // 0x3a8(0x8)
};


// Size 0x48 (Full Size[0x100] - InheritedSize[0xb8]
class MovementComponent: public ActorComponent
{
public:
	class SceneComponent*                                        UpdatedComponent;                                  // 0xb8(0x8)
	class PrimitiveComponent*                                    UpdatedPrimitive;                                  // 0xc0(0x8)
	char                                                         pad0x4_AOKIY[0x4];                                 // 0xc8(0x4)
	struct Vector                                                Velocity;                                          // 0xcc(0xc)
	bool                                                         bConstrainToPlane;                                 // 0xd8(0x1)
	bool                                                         bSnapToPlaneAtStart;                               // 0xd8(0x1)
	char                                                         pad0x3_OHRIK[0x3];                                 // 0xd9(0x3)
	char                                                         PlaneConstraintAxisSetting;                        // 0xdc(0x1)
	char                                                         pad0x3_XWEU1[0x3];                                 // 0xdd(0x3)
	struct Vector                                                PlaneConstraintNormal;                             // 0xe0(0xc)
	struct Vector                                                PlaneConstraintOrigin;                             // 0xec(0xc)
	bool                                                         bUpdateOnlyIfRendered;                             // 0xf8(0x1)
	bool                                                         bAutoUpdateTickRegistration;                       // 0xf8(0x1)
	bool                                                         bAutoRegisterUpdatedComponent;                     // 0xf8(0x1)
	char                                                         pad0x7_L1KKE[0x7];                                 // 0xf9(0x7)
};


// Size 0x88 (Full Size[0x140] - InheritedSize[0xb8]
class InputComponent: public ActorComponent
{
public:
	char                                                         pad0x88_V106I[0x88];                               // 0xb8(0x88)
};


// Size 0xe8 (Full Size[0x158] - InheritedSize[0x70]
class MaterialExpressionSphereMask: public MaterialExpression
{
public:
	struct ExpressionInput                                       A;                                                 // 0x70(0x38)
	struct ExpressionInput                                       B;                                                 // 0xa8(0x38)
	struct ExpressionInput                                       Radius;                                            // 0xe0(0x38)
	struct ExpressionInput                                       Hardness;                                          // 0x118(0x38)
	float                                                        AttenuationRadius;                                 // 0x150(0x4)
	float                                                        HardnessPercent;                                   // 0x154(0x4)
};


// Size 0x0 (Full Size[0x3a0] - InheritedSize[0x3a0]
class Info: public Actor
{
public:
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleSubUVBase: public ParticleModule
{
public:
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleCollisionBase: public ParticleModule
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionEyeAdaptation: public MaterialExpression
{
public:
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class CalmWaterZone: public Actor
{
public:
	class CalmWaterComponent*                                    CalmWaterComponent;                                // 0x3a0(0x8)
};


// Size 0xb0 (Full Size[0x120] - InheritedSize[0x70]
class MaterialExpressionStaticSwitch: public MaterialExpression
{
public:
	bool                                                         DefaultValue;                                      // 0x70(0x1)
	char                                                         pad0x7_TUNIY[0x7];                                 // 0x71(0x7)
	struct ExpressionInput                                       A;                                                 // 0x78(0x38)
	struct ExpressionInput                                       B;                                                 // 0xb0(0x38)
	struct ExpressionInput                                       Value;                                             // 0xe8(0x38)
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class MergedCollisionActor: public Actor
{
public:
	class MergedCollisionComponent*                              MergedCollisionComponent;                          // 0x3a0(0x8)
};


// Size 0x40 (Full Size[0x78] - InheritedSize[0x38]
class SoundNodeModulatorContinuous: public SoundNode
{
public:
	struct ModulatorContinuousParams                             PitchModulationParams;                             // 0x38(0x20)
	struct ModulatorContinuousParams                             VolumeModulationParams;                            // 0x58(0x20)
};


// Size 0xb8 (Full Size[0x128] - InheritedSize[0x70]
class MaterialExpressionFresnel: public MaterialExpression
{
public:
	struct ExpressionInput                                       ExponentIn;                                        // 0x70(0x38)
	float                                                        Exponent;                                          // 0xa8(0x4)
	char                                                         pad0x4_CRQ2A[0x4];                                 // 0xac(0x4)
	struct ExpressionInput                                       BaseReflectFractionIn;                             // 0xb0(0x38)
	float                                                        BaseReflectFraction;                               // 0xe8(0x4)
	char                                                         pad0x4_RNKBC[0x4];                                 // 0xec(0x4)
	struct ExpressionInput                                       Normal;                                            // 0xf0(0x38)
};


// Size 0x78 (Full Size[0xe8] - InheritedSize[0x70]
class MaterialExpressionMultiply: public MaterialExpression
{
public:
	struct ExpressionInput                                       A;                                                 // 0x70(0x38)
	struct ExpressionInput                                       B;                                                 // 0xa8(0x38)
	float                                                        ConstA;                                            // 0xe0(0x4)
	float                                                        ConstB;                                            // 0xe4(0x4)
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleBeamBase: public ParticleModule
{
public:
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class MaterialExpressionConstant: public MaterialExpression
{
public:
	float                                                        R;                                                 // 0x70(0x4)
	char                                                         pad0x4_KZU4L[0x4];                                 // 0x74(0x4)
};


// Size 0x60 (Full Size[0xa60] - InheritedSize[0xa00]
class GameEngine: public Engine
{
public:
	float                                                        MaxDeltaTime;                                      // 0xa00(0x4)
	float                                                        ServerFlushLogInterval;                            // 0xa04(0x4)
	char                                                         pad0x58_V6DXQ[0x58];                               // 0xa08(0x58)
};


// Size 0x80 (Full Size[0xf0] - InheritedSize[0x70]
class MaterialExpressionRotator: public MaterialExpression
{
public:
	struct ExpressionInput                                       Coordinate;                                        // 0x70(0x38)
	struct ExpressionInput                                       Time;                                              // 0xa8(0x38)
	float                                                        CenterX;                                           // 0xe0(0x4)
	float                                                        CenterY;                                           // 0xe4(0x4)
	float                                                        Speed;                                             // 0xe8(0x4)
	char                                                         pad0x4_HLF1Z[0x4];                                 // 0xec(0x4)
};


// Size 0x20 (Full Size[0x90] - InheritedSize[0x70]
class MaterialExpressionDynamicParameter: public MaterialExpression
{
public:
	TArray<String>                                               ParamNames;                                        // 0x70(0x10)
	struct LinearColor                                           DefaultValue;                                      // 0x80(0x10)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionObjectRadius: public MaterialExpression
{
public:
};


