// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class ActorComponent: public Object
{
public:
	char                                                         pad0x8_4HPBV[0x8];                                 // 0x28(0x8)
	struct ActorComponentTickFunction                            PrimaryComponentTick;                              // 0x30(0x50)
	TArray<struct FName>                                         ComponentTags;                                     // 0x80(0x10)
	TArray<struct SimpleMemberReference>                         UCSModifiedProperties;                             // 0x90(0x10)
	char                                                         pad0x10_EEY2H[0x10];                               // 0xa0(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0xb0(0x10)
	bool                                                         bReplicates;                                       // 0xc0(0x1)
	bool                                                         bNetAddressable;                                   // 0xc0(0x1)
	bool                                                         bCreatedByConstructionScript;                      // 0xc1(0x1)
	bool                                                         bInstanceComponent;                                // 0xc1(0x1)
	bool                                                         bAutoActivate;                                     // 0xc2(0x1)
	bool                                                         bIsActive;                                         // 0xc2(0x1)
	bool                                                         bEditableWhenInherited;                            // 0xc2(0x1)
	bool                                                         bNeedsLoadForClient;                               // 0xc3(0x1)
	bool                                                         bNeedsLoadForServer;                               // 0xc3(0x1)
	byte                                                         TargetNetDormancy;                                 // 0xc4(0x1)
	byte                                                         CreationMethod;                                    // 0xc5(0x1)
	char                                                         pad0x2_3R09Q[0x2];                                 // 0xc6(0x2)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DataAsset: public Object
{
public:
};


// Size 0x3a0 (Full Size[0x3c8] - InheritedSize[0x28]
class Actor: public Object
{
public:
	struct ActorTickFunction                                     PrimaryActorTick;                                  // 0x28(0x50)
	float                                                        CustomTimeDilation;                                // 0x78(0x4)
	bool                                                         bAllowRemovalFromServerWhenCollisionMerged;        // 0x7c(0x1)
	bool                                                         bAllowRemovalFromServerWhenAutomaticallyInstanced; // 0x7c(0x1)
	bool                                                         bHidden;                                           // 0x7c(0x1)
	bool                                                         bNetTemporary;                                     // 0x7c(0x1)
	bool                                                         bNetStartup;                                       // 0x7c(0x1)
	bool                                                         bOnlyRelevantToOwner;                              // 0x7c(0x1)
	bool                                                         bAlwaysRelevant;                                   // 0x7c(0x1)
	bool                                                         bReplicateMovement;                                // 0x7c(0x1)
	bool                                                         bTearOff;                                          // 0x7d(0x1)
	bool                                                         bExchangedRoles;                                   // 0x7d(0x1)
	bool                                                         bPendingNetUpdate;                                 // 0x7d(0x1)
	bool                                                         bNetLoadOnClient;                                  // 0x7d(0x1)
	bool                                                         bNetUseOwnerRelevancy;                             // 0x7d(0x1)
	bool                                                         bBlockInput;                                       // 0x7d(0x1)
	bool                                                         bCanBeInCluster;                                   // 0x7d(0x1)
	bool                                                         bActorEnableCollision;                             // 0x7e(0x1)
	bool                                                         bReplicateAttachment;                              // 0x7e(0x1)
	bool                                                         bReplicates;                                       // 0x7e(0x1)
	bool                                                         bActorVisible;                                     // 0x7e(0x1)
	char                                                         pad0x1_I1W2S[0x1];                                 // 0x7f(0x1)
	byte                                                         RemoteRole;                                        // 0x83(0x1)
	char                                                         pad0x4_1ILAK[0x4];                                 // 0x84(0x4)
	class Actor*                                                 Owner;                                             // 0x88(0x8)
	struct RepMovement                                           ReplicatedMovement;                                // 0x90(0x38)
	struct RepAttachment                                         AttachmentReplication;                             // 0xc8(0x48)
	byte                                                         Role;                                              // 0x110(0x1)
	char                                                         pad0x1_7E59R[0x1];                                 // 0x111(0x1)
	byte                                                         SpawnRestrictions;                                 // 0x112(0x1)
	byte                                                         AutoReceiveInput;                                  // 0x113(0x1)
	int                                                          InputPriority;                                     // 0x114(0x4)
	class InputComponent*                                        InputComponent;                                    // 0x118(0x8)
	float                                                        NetCullDistanceSquared;                            // 0x120(0x4)
	char                                                         pad0x4_RUDEN[0x4];                                 // 0x124(0x4)
	int                                                          NetTag;                                            // 0x128(0x4)
	float                                                        NetUpdateTime;                                     // 0x12c(0x4)
	float                                                        NetUpdateFrequency;                                // 0x130(0x4)
	float                                                        NetPriority;                                       // 0x134(0x4)
	float                                                        LastNetUpdateTime;                                 // 0x138(0x4)
	struct FName                                                 NetDriverName;                                     // 0x13c(0x8)
	bool                                                         bAutoDestroyWhenFinished;                          // 0x144(0x1)
	bool                                                         bCanBeDamaged;                                     // 0x144(0x1)
	bool                                                         bActorIsBeingDestroyed;                            // 0x144(0x1)
	bool                                                         bCollideWhenPlacing;                               // 0x144(0x1)
	bool                                                         bFindCameraComponentWhenViewTarget;                // 0x144(0x1)
	bool                                                         bRelevantForNetworkReplays;                        // 0x144(0x1)
	char                                                         pad0x3_LV3WR[0x3];                                 // 0x145(0x3)
	byte                                                         SpawnCollisionHandlingMethod;                      // 0x148(0x1)
	char                                                         pad0x7_S3UKN[0x7];                                 // 0x149(0x7)
	class Pawn*                                                  Instigator;                                        // 0x150(0x8)
	TArray<class Actor*>                                         Children;                                          // 0x158(0x10)
	class SceneComponent*                                        RootComponent;                                     // 0x168(0x8)
	TArray<class MatineeActor*>                                  ControllingMatineeActors;                          // 0x170(0x10)
	float                                                        InitialLifeSpan;                                   // 0x180(0x4)
	char                                                         pad0x4_IPTX0[0x4];                                 // 0x184(0x4)
	bool                                                         bAllowReceiveTickEventOnDedicatedServer;           // 0x188(0x1)
	char                                                         pad0x7_8KJ8J[0x7];                                 // 0x189(0x7)
	TArray<struct FName>                                         Layers;                                            // 0x190(0x10)
	struct ActorPtr                                              ParentComponentActor;                              // 0x1a0(0x8)
	TArray<Weakclass ChildComponentActors>                       ChildComponentActors;                              // 0x1a8(0x10)
	char                                                         pad0x8_9RZB9[0x8];                                 // 0x1b8(0x8)
	bool                                                         bActorSeamlessTraveled;                            // 0x1c0(0x1)
	bool                                                         bIgnoresOriginShifting;                            // 0x1c0(0x1)
	bool                                                         bEnableAutoLODGeneration;                          // 0x1c0(0x1)
	bool                                                         InvertFeatureCheck;                                // 0x1c0(0x1)
	char                                                         pad0x3_0ASIJ[0x3];                                 // 0x1c1(0x3)
	struct FName                                                 Feature;                                           // 0x1c4(0x8)
	char                                                         pad0x4_RVQ4W[0x4];                                 // 0x1cc(0x4)
	TArray<struct FName>                                         Tags;                                              // 0x1d0(0x10)
	bool                                                         bDoOverlapNotifiesOnLoad;                          // 0x229(0x1)
	char                                                         pad0xf6_0A0HQ[0xf6];                               // 0x22a(0xf6)
	TArray<class ActorComponent*>                                BlueprintCreatedComponents;                        // 0x320(0x10)
	TArray<class ActorComponent*>                                InstanceComponents;                                // 0x330(0x10)
	char                                                         pad0x8_M3L10[0x8];                                 // 0x340(0x8)
	TArray<class Actor*>                                         ChildActorInterfaceProviders;                      // 0x348(0x10)
	char                                                         pad0x68_Y8N79[0x68];                               // 0x358(0x68)
	double                                                       DormancyLingeringInSeconds;                        // 0x3c0(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlueprintFunctionLibrary: public Object
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class DeveloperSettings: public Object
{
public:
	char                                                         pad0x10_DSIPC[0x10];                               // 0x28(0x10)
};


// Size 0x218 (Full Size[0x2e0] - InheritedSize[0xc8]
class SceneComponent: public ActorComponent
{
public:
	TArray<class SceneComponent*>                                AttachChildren;                                    // 0xc8(0x10)
	bool                                                         bRequiresCustomLocation;                           // 0xd8(0x1)
	char                                                         pad0x7_BHLQR[0x7];                                 // 0xd9(0x7)
	class SceneComponent*                                        AttachParent;                                      // 0xe0(0x8)
	struct FName                                                 AttachSocketName;                                  // 0xe8(0x8)
	bool                                                         bAbsoluteLocation;                                 // 0xf0(0x1)
	bool                                                         bAbsoluteRotation;                                 // 0xf0(0x1)
	bool                                                         bAbsoluteScale;                                    // 0xf0(0x1)
	bool                                                         bVisible;                                          // 0xf0(0x1)
	bool                                                         bAbsoluteTranslation;                              // 0xf0(0x1)
	bool                                                         bHiddenInGame;                                     // 0xf0(0x1)
	bool                                                         bShouldUpdatePhysicsVolume;                        // 0xf0(0x1)
	bool                                                         bBoundsChangeTriggersStreamingDataRebuild;         // 0xf0(0x1)
	bool                                                         bUseAttachParentBound;                             // 0xf1(0x1)
	bool                                                         bComponentIsUnionOfChildren;                       // 0xf1(0x1)
	bool                                                         bJitterReduction;                                  // 0xf1(0x1)
	bool                                                         CacheRootVelocity;                                 // 0xf1(0x1)
	bool                                                         bWorldToComponentUpdated;                          // 0xf1(0x1)
	char                                                         pad0xe_2N1K9[0xe];                                 // 0xf2(0xe)
	struct Vector                                                RelativeLocation;                                  // 0x108(0xc)
	struct Rotator                                               RelativeRotation;                                  // 0x114(0xc)
	struct Vector                                                RelativeScale3D;                                   // 0x120(0xc)
	char                                                         pad0x104_QAU83[0x104];                             // 0x12c(0x104)
	byte                                                         Mobility;                                          // 0x230(0x1)
	byte                                                         DetailMode;                                        // 0x231(0x1)
	char                                                         pad0xa_73JHL[0xa];                                 // 0x232(0xa)
	struct Vector                                                ComponentVelocity;                                 // 0x23c(0xc)
	TArray<struct FName>                                         SocketVelocitiesToCache;                           // 0x268(0x10)
	TArray<class Actor*>                                         MovedActors;                                       // 0x278(0x10)
	char                                                         pad0x58_S0TU3[0x58];                               // 0x288(0x58)
};


// Size 0x78 (Full Size[0x440] - InheritedSize[0x3c8]
class Pawn: public Actor
{
public:
	char                                                         pad0x8_U53OK[0x8];                                 // 0x3c8(0x8)
	bool                                                         bUseControllerRotationPitch;                       // 0x3d0(0x1)
	bool                                                         bUseControllerRotationYaw;                         // 0x3d0(0x1)
	bool                                                         bUseControllerRotationRoll;                        // 0x3d0(0x1)
	bool                                                         bCanAffectNavigationGeneration;                    // 0x3d0(0x1)
	char                                                         pad0x3_DOU5A[0x3];                                 // 0x3d1(0x3)
	float                                                        BaseEyeHeight;                                     // 0x3d4(0x4)
	byte                                                         AutoPossessPlayer;                                 // 0x3d8(0x1)
	byte                                                         AutoPossessAI;                                     // 0x3d9(0x1)
	char                                                         pad0x6_7K26A[0x6];                                 // 0x3da(0x6)
	class UClass*                                                AIControllerClass;                                 // 0x3e0(0x8)
	class PlayerState*                                           PlayerState;                                       // 0x3e8(0x8)
	byte                                                         RemoteViewPitch;                                   // 0x3f0(0x1)
	char                                                         pad0x7_06OXT[0x7];                                 // 0x3f1(0x7)
	class Controller*                                            LastHitBy;                                         // 0x3f8(0x8)
	class Controller*                                            Controller;                                        // 0x400(0x8)
	char                                                         pad0x18_EZNXM[0x18];                               // 0x408(0x18)
	struct Vector                                                ControlInputVector;                                // 0x420(0xc)
	struct Vector                                                LastControlInputVector;                            // 0x42c(0xc)
	char                                                         pad0x8_JV06I[0x8];                                 // 0x438(0x8)
};


// Size 0x1a0 (Full Size[0x5e0] - InheritedSize[0x440]
class Character: public Pawn
{
public:
	class SkeletalMeshComponent*                                 Mesh;                                              // 0x440(0x8)
	class CharacterMovementComponent*                            CharacterMovement;                                 // 0x448(0x8)
	class CapsuleComponent*                                      CapsuleComponent;                                  // 0x450(0x8)
	struct BasedMovementInfo                                     BasedMovement;                                     // 0x458(0x38)
	struct BasedMovementInfo                                     ReplicatedBasedMovement;                           // 0x490(0x38)
	struct Vector                                                BaseTranslationOffset;                             // 0x4c8(0xc)
	char                                                         pad0xc_QUJ5V[0xc];                                 // 0x4d4(0xc)
	struct Quat                                                  BaseRotationOffset;                                // 0x4e0(0x10)
	byte                                                         ReplicatedMovementMode;                            // 0x4f0(0x1)
	bool                                                         bInBaseReplication;                                // 0x4f1(0x1)
	char                                                         pad0x2_COK8I[0x2];                                 // 0x4f2(0x2)
	float                                                        CrouchedEyeHeight;                                 // 0x4f4(0x4)
	bool                                                         bIsCrouched;                                       // 0x4f8(0x1)
	bool                                                         bPressedJump;                                      // 0x4f8(0x1)
	bool                                                         bClientUpdating;                                   // 0x4f8(0x1)
	bool                                                         bClientWasFalling;                                 // 0x4f8(0x1)
	bool                                                         bClientResimulateRootMotion;                       // 0x4f8(0x1)
	bool                                                         bSimGravityDisabled;                               // 0x4f8(0x1)
	bool                                                         bServerMoveIgnoreRootMotion;                       // 0x4f8(0x1)
	char                                                         pad0x3_4RNS0[0x3];                                 // 0x4f9(0x3)
	float                                                        JumpKeyHoldTime;                                   // 0x4fc(0x4)
	float                                                        JumpMaxHoldTime;                                   // 0x500(0x4)
	char                                                         pad0x4_IM1KZ[0x4];                                 // 0x504(0x4)
	struct RootMotionMovementParams                              ClientRootMotionParams;                            // 0x540(0x40)
	TArray<struct SimulatedRootMotionReplicatedMove>             RootMotionRepMoves;                                // 0x580(0x10)
	struct RepRootMotionMontage                                  RepRootMotion;                                     // 0x590(0x40)
	char                                                         pad0x10_7AX8Z[0x10];                               // 0x5d0(0x10)
};


// Size 0x88 (Full Size[0x150] - InheritedSize[0xc8]
class InputComponent: public ActorComponent
{
public:
	char                                                         pad0x88_D2TN9[0x88];                               // 0xc8(0x88)
};


// Size 0x418 (Full Size[0x440] - InheritedSize[0x28]
class AnimInstance: public Object
{
public:
	class Skeleton*                                              CurrentSkeleton;                                   // 0x28(0x8)
	TArray<struct AnimTickRecord>                                UngroupedActivePlayers;                            // 0x30(0x10)
	TArray<struct AnimGroupInstance>                             SyncGroups;                                        // 0x40(0x10)
	TArray<struct ActiveVertexAnim>                              VertexAnims;                                       // 0x50(0x10)
	byte                                                         RootMotionMode;                                    // 0x60(0x1)
	bool                                                         bWarnAboutBlueprintUsage;                          // 0x61(0x1)
	char                                                         pad0x6_IBZPO[0x6];                                 // 0x62(0x6)
	bool                                                         bQueueMontageEvents;                               // 0x148(0x1)
	char                                                         pad0xf7_H2VSC[0xf7];                               // 0x149(0xf7)
	TArray<struct AnimNotifyEvent>                               ActiveAnimNotifyState;                             // 0x240(0x10)
	char                                                         pad0x100_3UBID[0x100];                             // 0x250(0x100)
	bool                                                         bBoneCachesInvalidated;                            // 0x3a8(0x1)
	char                                                         pad0x8f_2VR1I[0x8f];                               // 0x3a9(0x8f)
	bool                                                         bBlueprintAnimUpdateEnabled;                       // 0x438(0x1)
	char                                                         pad0x7_MH7JW[0x7];                                 // 0x439(0x7)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AnimNotify: public Object
{
public:
	bool                                                         PlayedWithSequencer;                               // 0x28(0x1)
	char                                                         pad0xf_BJNA0[0xf];                                 // 0x29(0xf)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class AnimNotifyState: public Object
{
public:
	bool                                                         PlayedWithSequencer;                               // 0x28(0x1)
	char                                                         pad0x7_6A5BE[0x7];                                 // 0x29(0x7)
};


// Size 0x30 (Full Size[0x60] - InheritedSize[0x30]
class AnimNotifyState_TimedParticleEffect: public AnimNotifyState
{
public:
	class ParticleSystem*                                        PSTemplate;                                        // 0x30(0x8)
	struct FName                                                 SocketName;                                        // 0x38(0x8)
	struct Vector                                                LocationOffset;                                    // 0x40(0xc)
	struct Rotator                                               RotationOffset;                                    // 0x4c(0xc)
	bool                                                         bOwnerOnlySee;                                     // 0x58(0x1)
	bool                                                         bOwnerNoSee;                                       // 0x59(0x1)
	bool                                                         bDestroyAtEnd;                                     // 0x5a(0x1)
	bool                                                         bWorldOwnedEffect;                                 // 0x5b(0x1)
	char                                                         pad0x4_VYDW9[0x4];                                 // 0x5c(0x4)
};


// Size 0x570 (Full Size[0x850] - InheritedSize[0x2e0]
class CameraComponent: public SceneComponent
{
public:
	float                                                        FieldOfView;                                       // 0x2e0(0x4)
	float                                                        OrthoWidth;                                        // 0x2e4(0x4)
	float                                                        OrthoNearClipPlane;                                // 0x2e8(0x4)
	float                                                        OrthoFarClipPlane;                                 // 0x2ec(0x4)
	float                                                        AspectRatio;                                       // 0x2f0(0x4)
	bool                                                         bConstrainAspectRatio;                             // 0x2f4(0x1)
	bool                                                         bUseFieldOfViewForLOD;                             // 0x2f4(0x1)
	bool                                                         bUsePawnControlRotation;                           // 0x2f4(0x1)
	char                                                         pad0x3_B5ZOV[0x3];                                 // 0x2f5(0x3)
	byte                                                         ProjectionMode;                                    // 0x2f8(0x1)
	char                                                         pad0x3_ZVBTS[0x3];                                 // 0x2f9(0x3)
	float                                                        PostProcessBlendWeight;                            // 0x2fc(0x4)
	struct PostProcessSettings                                   PostProcessSettings;                               // 0x300(0x540)
	bool                                                         bUseControllerViewRotation;                        // 0x840(0x1)
	char                                                         pad0xf_0W5VA[0xf];                                 // 0x841(0xf)
};


// Size 0x48 (Full Size[0x110] - InheritedSize[0xc8]
class MovementComponent: public ActorComponent
{
public:
	class SceneComponent*                                        UpdatedComponent;                                  // 0xc8(0x8)
	class PrimitiveComponent*                                    UpdatedPrimitive;                                  // 0xd0(0x8)
	char                                                         pad0x4_6O2I9[0x4];                                 // 0xd8(0x4)
	struct Vector                                                Velocity;                                          // 0xdc(0xc)
	bool                                                         bConstrainToPlane;                                 // 0xe8(0x1)
	bool                                                         bSnapToPlaneAtStart;                               // 0xe8(0x1)
	char                                                         pad0x3_IY8LW[0x3];                                 // 0xe9(0x3)
	byte                                                         PlaneConstraintAxisSetting;                        // 0xec(0x1)
	char                                                         pad0x3_FTS7R[0x3];                                 // 0xed(0x3)
	struct Vector                                                PlaneConstraintNormal;                             // 0xf0(0xc)
	struct Vector                                                PlaneConstraintOrigin;                             // 0xfc(0xc)
	bool                                                         bUpdateOnlyIfRendered;                             // 0x108(0x1)
	bool                                                         bAutoUpdateTickRegistration;                       // 0x108(0x1)
	bool                                                         bAutoRegisterUpdatedComponent;                     // 0x108(0x1)
	char                                                         pad0x7_W96TO[0x7];                                 // 0x109(0x7)
};


// Size 0x48 (Full Size[0x158] - InheritedSize[0x110]
class NavMovementComponent: public MovementComponent
{
public:
	struct NavAgentProperties                                    NavAgentProps;                                     // 0x110(0x30)
	bool                                                         bUpdateNavAgentWithOwnersCollision;                // 0x140(0x1)
	char                                                         pad0x3_2XCYQ[0x3];                                 // 0x141(0x3)
	struct MovementProperties                                    MovementState;                                     // 0x144(0x4)
	char                                                         pad0x8_6M9GZ[0x8];                                 // 0x148(0x8)
	bool                                                         UseDefaultNavWalkingSearchRadiusScale;             // 0x150(0x1)
	bool                                                         UseDefaultNavWalkingSearchHeightScale;             // 0x151(0x1)
	char                                                         pad0x6_7UP54[0x6];                                 // 0x152(0x6)
};


// Size 0x8 (Full Size[0x160] - InheritedSize[0x158]
class PawnMovementComponent: public NavMovementComponent
{
public:
	class Pawn*                                                  PawnOwner;                                         // 0x158(0x8)
};


// Size 0x430 (Full Size[0x590] - InheritedSize[0x160]
class CharacterMovementComponent: public PawnMovementComponent
{
public:
	char                                                         pad0x18_4OHX2[0x18];                               // 0x160(0x18)
	class Character*                                             CharacterOwner;                                    // 0x178(0x8)
	float                                                        GravityScale;                                      // 0x180(0x4)
	float                                                        MaxStepHeight;                                     // 0x184(0x4)
	float                                                        JumpZVelocity;                                     // 0x188(0x4)
	float                                                        JumpOffJumpZFactor;                                // 0x18c(0x4)
	float                                                        WalkableFloorAngle;                                // 0x190(0x4)
	float                                                        WalkableFloorZ;                                    // 0x194(0x4)
	byte                                                         MovementMode;                                      // 0x198(0x1)
	byte                                                         CustomMovementMode;                                // 0x199(0x1)
	char                                                         pad0x26_XA6IE[0x26];                               // 0x19a(0x26)
	float                                                        GroundFriction;                                    // 0x1c0(0x4)
	float                                                        MaxWalkSpeed;                                      // 0x1c4(0x4)
	float                                                        MaxWalkSpeedBackwards;                             // 0x1c8(0x4)
	float                                                        WalkBackwardsMinAngle;                             // 0x1cc(0x4)
	float                                                        WalkBackwardsMaxAngle;                             // 0x1d0(0x4)
	float                                                        MaxWalkSpeedCrouched;                              // 0x1d4(0x4)
	float                                                        MaxSwimSpeed;                                      // 0x1d8(0x4)
	float                                                        MaxFlySpeed;                                       // 0x1dc(0x4)
	float                                                        MaxCustomMovementSpeed;                            // 0x1e0(0x4)
	float                                                        MaxAcceleration;                                   // 0x1e4(0x4)
	float                                                        MaxChargeAcceleration;                             // 0x1e8(0x4)
	float                                                        BrakingFrictionFactor;                             // 0x1ec(0x4)
	float                                                        BrakingFriction;                                   // 0x1f0(0x4)
	bool                                                         bUseSeparateBrakingFriction;                       // 0x1f4(0x1)
	char                                                         pad0x3_4M16Q[0x3];                                 // 0x1f5(0x3)
	float                                                        BrakingDecelerationWalking;                        // 0x1f8(0x4)
	float                                                        BrakingDecelerationFalling;                        // 0x1fc(0x4)
	float                                                        BrakingDecelerationSwimming;                       // 0x200(0x4)
	float                                                        BrakingDecelerationFlying;                         // 0x204(0x4)
	float                                                        AirControl;                                        // 0x208(0x4)
	float                                                        AirControlBoostMultiplier;                         // 0x20c(0x4)
	float                                                        AirControlBoostVelocityThreshold;                  // 0x210(0x4)
	float                                                        FallingLateralFriction;                            // 0x214(0x4)
	float                                                        CrouchedHalfHeight;                                // 0x218(0x4)
	float                                                        Buoyancy;                                          // 0x21c(0x4)
	float                                                        PerchRadiusThreshold;                              // 0x220(0x4)
	float                                                        PerchAdditionalHeight;                             // 0x224(0x4)
	struct Rotator                                               RotationRate;                                      // 0x228(0xc)
	bool                                                         bUseControllerDesiredRotation;                     // 0x234(0x1)
	bool                                                         bOrientRotationToMovement;                         // 0x234(0x1)
	bool                                                         bMovementInProgress;                               // 0x234(0x1)
	bool                                                         bEnableScopedMovementUpdates;                      // 0x234(0x1)
	bool                                                         bForceMaxAccel;                                    // 0x234(0x1)
	bool                                                         bRunPhysicsWithNoController;                       // 0x234(0x1)
	bool                                                         bForceNextFloorCheck;                              // 0x234(0x1)
	bool                                                         bShrinkProxyCapsule;                               // 0x234(0x1)
	bool                                                         bCanWalkOffLedges;                                 // 0x235(0x1)
	bool                                                         bCanWalkOffLedgesWhenCrouching;                    // 0x235(0x1)
	bool                                                         bDeferUpdateMoveComponent;                         // 0x235(0x1)
	char                                                         pad0x2_J8CB0[0x2];                                 // 0x236(0x2)
	class SceneComponent*                                        DeferredUpdatedMoveComponent;                      // 0x238(0x8)
	float                                                        MaxOutOfWaterStepHeight;                           // 0x240(0x4)
	float                                                        OutofWaterZ;                                       // 0x244(0x4)
	float                                                        Mass;                                              // 0x248(0x4)
	bool                                                         bEnablePhysicsInteraction;                         // 0x24c(0x1)
	bool                                                         bTouchForceScaledToMass;                           // 0x24d(0x1)
	bool                                                         bPushForceScaledToMass;                            // 0x24e(0x1)
	bool                                                         bScalePushForceToVelocity;                         // 0x24f(0x1)
	float                                                        StandingDownwardForceScale;                        // 0x250(0x4)
	float                                                        InitialPushForceFactor;                            // 0x254(0x4)
	float                                                        PushForceFactor;                                   // 0x258(0x4)
	float                                                        PushForcePointZOffsetFactor;                       // 0x25c(0x4)
	float                                                        TouchForceFactor;                                  // 0x260(0x4)
	float                                                        MinTouchForce;                                     // 0x264(0x4)
	float                                                        MaxTouchForce;                                     // 0x268(0x4)
	float                                                        RepulsionForce;                                    // 0x26c(0x4)
	float                                                        NetMoveDelta;                                      // 0x270(0x4)
	bool                                                         bForceBraking;                                     // 0x274(0x1)
	char                                                         pad0x3_Z4VHC[0x3];                                 // 0x275(0x3)
	float                                                        CrouchedSpeedMultiplier;                           // 0x278(0x4)
	float                                                        UpperImpactNormalScale;                            // 0x27c(0x4)
	struct Vector                                                Acceleration;                                      // 0x280(0xc)
	struct Vector                                                LastUpdateLocation;                                // 0x28c(0xc)
	struct Vector                                                PendingImpulseToApply;                             // 0x298(0xc)
	struct Vector                                                PendingForceToApply;                               // 0x2a4(0xc)
	float                                                        AnalogInputModifier;                               // 0x2b0(0x4)
	char                                                         pad0x34_B2J7G[0x34];                               // 0x2b4(0x34)
	float                                                        MaxSimulationTimeStep;                             // 0x2e8(0x4)
	int                                                          MaxSimulationIterations;                           // 0x2ec(0x4)
	float                                                        MaxSmoothNetUpdateDist;                            // 0x2f0(0x4)
	float                                                        NoSmoothNetUpdateDist;                             // 0x2f4(0x4)
	float                                                        NetworkSimulatedSmoothLocationTime;                // 0x2f8(0x4)
	float                                                        NetworkSimulatedSmoothRotationTime;                // 0x2fc(0x4)
	float                                                        LedgeCheckThreshold;                               // 0x300(0x4)
	float                                                        JumpOutOfWaterPitch;                               // 0x304(0x4)
	struct FindFloorResult                                       CurrentFloor;                                      // 0x308(0x8c)
	byte                                                         DefaultLandMovementMode;                           // 0x394(0x1)
	byte                                                         DefaultWaterMovementMode;                          // 0x395(0x1)
	byte                                                         GroundMovementMode;                                // 0x396(0x1)
	char                                                         pad0x1_0S8WD[0x1];                                 // 0x397(0x1)
	bool                                                         bMaintainHorizontalGroundVelocity;                 // 0x398(0x1)
	bool                                                         bImpartBaseVelocityX;                              // 0x398(0x1)
	bool                                                         bImpartBaseVelocityY;                              // 0x398(0x1)
	bool                                                         bImpartBaseVelocityZ;                              // 0x398(0x1)
	bool                                                         bImpartBaseAngularVelocity;                        // 0x398(0x1)
	bool                                                         bJustTeleported;                                   // 0x398(0x1)
	bool                                                         bNetworkUpdateReceived;                            // 0x398(0x1)
	bool                                                         bBasedMovementUpdateReceived;                      // 0x398(0x1)
	bool                                                         bMovementUpdateReceived;                           // 0x399(0x1)
	bool                                                         bNetworkMovementModeChanged;                       // 0x399(0x1)
	bool                                                         bNotifyApex;                                       // 0x399(0x1)
	bool                                                         bCheatFlying;                                      // 0x399(0x1)
	bool                                                         bWantsToCrouch;                                    // 0x399(0x1)
	bool                                                         bCrouchMaintainsBaseLocation;                      // 0x399(0x1)
	bool                                                         bIgnoreBaseRotation;                               // 0x399(0x1)
	bool                                                         bFastAttachedMove;                                 // 0x399(0x1)
	bool                                                         bAlwaysCheckFloor;                                 // 0x39a(0x1)
	bool                                                         bUseFlatBaseForFloorChecks;                        // 0x39a(0x1)
	bool                                                         bPerformingJumpOff;                                // 0x39a(0x1)
	bool                                                         bWantsToLeaveNavWalking;                           // 0x39a(0x1)
	bool                                                         bUseRVOAvoidance;                                  // 0x39a(0x1)
	bool                                                         bRequestedMoveUseAcceleration;                     // 0x39a(0x1)
	bool                                                         bPreventSimulatedFloorChecks;                      // 0x39a(0x1)
	bool                                                         bPreventNavMeshFalling;                            // 0x39a(0x1)
	bool                                                         bHasRequestedVelocity;                             // 0x39b(0x1)
	bool                                                         bRequestedMoveWithMaxSpeed;                        // 0x39b(0x1)
	bool                                                         bWasAvoidanceUpdated;                              // 0x39b(0x1)
	bool                                                         bProjectNavMeshWalking;                            // 0x39b(0x1)
	char                                                         pad0x14_AEQVD[0x14];                               // 0x39c(0x14)
	float                                                        SmoothingClientPositionTolerance;                  // 0x3b0(0x4)
	float                                                        AvoidanceConsiderationRadius;                      // 0x3b4(0x4)
	struct Vector                                                RequestedVelocity;                                 // 0x3b8(0xc)
	int                                                          AvoidanceUID;                                      // 0x3c4(0x4)
	struct NavAvoidanceMask                                      AvoidanceGroup;                                    // 0x3c8(0x4)
	struct NavAvoidanceMask                                      GroupsToAvoid;                                     // 0x3cc(0x4)
	struct NavAvoidanceMask                                      GroupsToIgnore;                                    // 0x3d0(0x4)
	float                                                        AvoidanceWeight;                                   // 0x3d4(0x4)
	struct Vector                                                PendingLaunchVelocity;                             // 0x3d8(0xc)
	char                                                         pad0x9c_KGW1C[0x9c];                               // 0x3e4(0x9c)
	float                                                        NavMeshProjectionInterval;                         // 0x480(0x4)
	float                                                        NavMeshProjectionTimer;                            // 0x484(0x4)
	bool                                                         bUseNavMeshProjectionTimeModifier;                 // 0x488(0x1)
	char                                                         pad0x3_KXVZD[0x3];                                 // 0x489(0x3)
	float                                                        MaxNavMeshProjectionInterval;                      // 0x48c(0x4)
	char                                                         pad0x4_4G73B[0x4];                                 // 0x490(0x4)
	float                                                        NavMeshProjectionInterpSpeed;                      // 0x494(0x4)
	bool                                                         bUsePlaneBasedNavMeshProjectionInterpSystem;       // 0x498(0x1)
	char                                                         pad0x3_13XDL[0x3];                                 // 0x499(0x3)
	float                                                        MaxAllowedZOffsetFromCurrentPlane;                 // 0x49c(0x4)
	float                                                        MaxZDiffFromPrevPlane;                             // 0x4a0(0x4)
	char                                                         pad0x1c_MDPC3[0x1c];                               // 0x4a4(0x1c)
	float                                                        NavMeshProjectionHeightScaleUp;                    // 0x4c0(0x4)
	float                                                        NavMeshProjectionHeightScaleDown;                  // 0x4c4(0x4)
	bool                                                         UseControllerRotationInNavWalkingMoveComponent;    // 0x4c8(0x1)
	char                                                         pad0x7_CASFY[0x7];                                 // 0x4c9(0x7)
	struct CharacterMovementComponentPreClothTickFunction        PreClothComponentTick;                             // 0x4d0(0x50)
	char                                                         pad0x14_6KI8Y[0x14];                               // 0x520(0x14)
	float                                                        MinTimeBetweenTimeStampResets;                     // 0x534(0x4)
	char                                                         pad0x8_K0PFC[0x8];                                 // 0x538(0x8)
	struct RootMotionMovementParams                              RootMotionParams;                                  // 0x540(0x40)
	bool                                                         bWasSimulatingRootMotion;                          // 0x580(0x1)
	char                                                         pad0xf_R2Q22[0xf];                                 // 0x581(0xf)
};


// Size 0x9a8 (Full Size[0x9d0] - InheritedSize[0x28]
class Engine: public Object
{
public:
	char                                                         pad0x8_VK86S[0x8];                                 // 0x28(0x8)
	class Font*                                                  TinyFont;                                          // 0x30(0x8)
	struct StringAssetReference                                  TinyFontName;                                      // 0x38(0x10)
	class Font*                                                  SmallFont;                                         // 0x48(0x8)
	struct StringAssetReference                                  SmallFontName;                                     // 0x50(0x10)
	class Font*                                                  MediumFont;                                        // 0x60(0x8)
	struct StringAssetReference                                  MediumFontName;                                    // 0x68(0x10)
	class Font*                                                  LargeFont;                                         // 0x78(0x8)
	struct StringAssetReference                                  LargeFontName;                                     // 0x80(0x10)
	class Font*                                                  MonoFont;                                          // 0x90(0x8)
	struct StringAssetReference                                  MonoFontName;                                      // 0x98(0x10)
	class Font*                                                  SubtitleFont;                                      // 0xa8(0x8)
	struct StringAssetReference                                  SubtitleFontName;                                  // 0xb0(0x10)
	class Font*                                                  HugeFont;                                          // 0xc0(0x8)
	struct StringAssetReference                                  HugeFontName;                                      // 0xc8(0x10)
	TArray<class Font*>                                          AdditionalFonts;                                   // 0xd8(0x10)
	char                                                         pad0x8_TFWDX[0x8];                                 // 0xe8(0x8)
	TArray<Str AdditionalFontNames>                              AdditionalFontNames;                               // 0xf0(0x10)
	class UClass*                                                ConsoleClass;                                      // 0x100(0x8)
	struct StringClassReference                                  ConsoleClassName;                                  // 0x108(0x10)
	class UClass*                                                GameViewportClientClass;                           // 0x118(0x8)
	struct StringClassReference                                  GameViewportClientClassName;                       // 0x120(0x10)
	class UClass*                                                LocalPlayerClass;                                  // 0x130(0x8)
	struct StringClassReference                                  LocalPlayerClassName;                              // 0x138(0x10)
	class UClass*                                                WorldSettingsClass;                                // 0x148(0x8)
	struct StringClassReference                                  WorldSettingsClassName;                            // 0x150(0x10)
	struct StringClassReference                                  NavigationSystemClassName;                         // 0x160(0x10)
	class UClass*                                                NavigationSystemClass;                             // 0x170(0x8)
	struct StringClassReference                                  AvoidanceManagerClassName;                         // 0x178(0x10)
	class UClass*                                                AvoidanceManagerClass;                             // 0x188(0x8)
	class UClass*                                                PhysicsCollisionHandlerClass;                      // 0x190(0x8)
	struct StringClassReference                                  PhysicsCollisionHandlerClassName;                  // 0x198(0x10)
	struct StringClassReference                                  GameUserSettingsClassName;                         // 0x1a8(0x10)
	class UClass*                                                GameUserSettingsClass;                             // 0x1b8(0x8)
	struct StringClassReference                                  AIControllerClassName;                             // 0x1c0(0x10)
	class GameUserSettings*                                      GameUserSettings;                                  // 0x1d0(0x8)
	class UClass*                                                LevelScriptActorClass;                             // 0x1d8(0x8)
	struct StringClassReference                                  LevelScriptActorClassName;                         // 0x1e0(0x10)
	struct StringClassReference                                  DefaultBlueprintBaseClassName;                     // 0x1f0(0x10)
	struct StringClassReference                                  GameSingletonClassName;                            // 0x200(0x10)
	class Object*                                                GameSingleton;                                     // 0x210(0x8)
	class UClass*                                                DefaultPreviewPawnClass;                           // 0x218(0x8)
	struct StringClassReference                                  DefaultPreviewPawnClassName;                       // 0x220(0x10)
	struct FString                                               PlayOnConsoleSaveDir;                              // 0x230(0x10)
	class Texture2D*                                             DefaultTexture;                                    // 0x240(0x8)
	struct StringAssetReference                                  DefaultTextureName;                                // 0x248(0x10)
	class Texture*                                               DefaultDiffuseTexture;                             // 0x258(0x8)
	struct StringAssetReference                                  DefaultDiffuseTextureName;                         // 0x260(0x10)
	class Texture2D*                                             DefaultBSPVertexTexture;                           // 0x270(0x8)
	struct StringAssetReference                                  DefaultBSPVertexTextureName;                       // 0x278(0x10)
	class Texture2D*                                             HighFrequencyNoiseTexture;                         // 0x288(0x8)
	struct StringAssetReference                                  HighFrequencyNoiseTextureName;                     // 0x290(0x10)
	class Texture2D*                                             DefaultBokehTexture;                               // 0x2a0(0x8)
	struct StringAssetReference                                  DefaultBokehTextureName;                           // 0x2a8(0x10)
	class Texture2D*                                             HDRCalibrationTexture;                             // 0x2b8(0x8)
	struct StringAssetReference                                  HDRCalibrationTextureName;                         // 0x2c0(0x10)
	class Material*                                              WireframeMaterial;                                 // 0x2d0(0x8)
	struct FString                                               WireframeMaterialName;                             // 0x2d8(0x10)
	class Material*                                              DebugMeshMaterial;                                 // 0x2e8(0x8)
	struct StringAssetReference                                  DebugMeshMaterialName;                             // 0x2f0(0x10)
	class Material*                                              LevelColorationLitMaterial;                        // 0x300(0x8)
	struct FString                                               LevelColorationLitMaterialName;                    // 0x308(0x10)
	class Material*                                              LevelColorationUnlitMaterial;                      // 0x318(0x8)
	struct FString                                               LevelColorationUnlitMaterialName;                  // 0x320(0x10)
	class Material*                                              TriangleDensityScreenSpaceMaterial;                // 0x330(0x8)
	struct FString                                               TriangleDensityScreenSpaceMaterialName;            // 0x338(0x10)
	class Material*                                              TriangleDensityWorldSpaceMaterial;                 // 0x348(0x8)
	struct FString                                               TriangleDensityWorldSpaceMaterialName;             // 0x350(0x10)
	class Material*                                              LightingTexelDensityMaterial;                      // 0x360(0x8)
	struct FString                                               LightingTexelDensityName;                          // 0x368(0x10)
	class Material*                                              ShadedLevelColorationLitMaterial;                  // 0x378(0x8)
	struct FString                                               ShadedLevelColorationLitMaterialName;              // 0x380(0x10)
	class Material*                                              ShadedLevelColorationUnlitMaterial;                // 0x390(0x8)
	struct FString                                               ShadedLevelColorationUnlitMaterialName;            // 0x398(0x10)
	class Material*                                              RemoveSurfaceMaterial;                             // 0x3a8(0x8)
	struct StringAssetReference                                  RemoveSurfaceMaterialName;                         // 0x3b0(0x10)
	class Material*                                              VertexColorMaterial;                               // 0x3c0(0x8)
	struct FString                                               VertexColorMaterialName;                           // 0x3c8(0x10)
	class Material*                                              VertexColorViewModeMaterial_ColorOnly;             // 0x3d8(0x8)
	struct FString                                               VertexColorViewModeMaterialName_ColorOnly;         // 0x3e0(0x10)
	class Material*                                              VertexColorViewModeMaterial_AlphaAsColor;          // 0x3f0(0x8)
	struct FString                                               VertexColorViewModeMaterialName_AlphaAsColor;      // 0x3f8(0x10)
	class Material*                                              VertexColorViewModeMaterial_RedOnly;               // 0x408(0x8)
	struct FString                                               VertexColorViewModeMaterialName_RedOnly;           // 0x410(0x10)
	class Material*                                              VertexColorViewModeMaterial_GreenOnly;             // 0x420(0x8)
	struct FString                                               VertexColorViewModeMaterialName_GreenOnly;         // 0x428(0x10)
	class Material*                                              VertexColorViewModeMaterial_BlueOnly;              // 0x438(0x8)
	struct FString                                               VertexColorViewModeMaterialName_BlueOnly;          // 0x440(0x10)
	class Material*                                              ConstraintLimitMaterial;                           // 0x450(0x8)
	class MaterialInstanceDynamic*                               ConstraintLimitMaterialX;                          // 0x458(0x8)
	class MaterialInstanceDynamic*                               ConstraintLimitMaterialY;                          // 0x460(0x8)
	class MaterialInstanceDynamic*                               ConstraintLimitMaterialZ;                          // 0x468(0x8)
	struct StringAssetReference                                  ConstraintLimitMaterialName;                       // 0x470(0x10)
	class Material*                                              InvalidLightmapSettingsMaterial;                   // 0x480(0x8)
	struct StringAssetReference                                  InvalidLightmapSettingsMaterialName;               // 0x488(0x10)
	class Material*                                              PreviewShadowsIndicatorMaterial;                   // 0x498(0x8)
	struct StringAssetReference                                  PreviewShadowsIndicatorMaterialName;               // 0x4a0(0x10)
	class Material*                                              ArrowMaterial;                                     // 0x4b0(0x8)
	struct StringAssetReference                                  ArrowMaterialName;                                 // 0x4b8(0x10)
	struct LinearColor                                           LightingOnlyBrightness;                            // 0x4c8(0x10)
	TArray<struct Color>                                         LightComplexityColors;                             // 0x4d8(0x10)
	TArray<struct LinearColor>                                   ShaderComplexityColors;                            // 0x4e8(0x10)
	TArray<struct LinearColor>                                   StationaryLightOverlapColors;                      // 0x4f8(0x10)
	TArray<struct LinearColor>                                   LODColorationColors;                               // 0x508(0x10)
	float                                                        MaxPixelShaderAdditiveComplexityCount;             // 0x518(0x4)
	float                                                        MaxES2PixelShaderAdditiveComplexityCount;          // 0x51c(0x4)
	float                                                        MinLightMapDensity;                                // 0x520(0x4)
	float                                                        IdealLightMapDensity;                              // 0x524(0x4)
	float                                                        MaxLightMapDensity;                                // 0x528(0x4)
	bool                                                         bRenderLightMapDensityGrayscale;                   // 0x52c(0x1)
	char                                                         pad0x3_5D77G[0x3];                                 // 0x52d(0x3)
	float                                                        RenderLightMapDensityGrayscaleScale;               // 0x530(0x4)
	float                                                        RenderLightMapDensityColorScale;                   // 0x534(0x4)
	struct LinearColor                                           LightMapDensityVertexMappedColor;                  // 0x538(0x10)
	struct LinearColor                                           LightMapDensitySelectedColor;                      // 0x548(0x10)
	TArray<struct StatColorMapping>                              StatColorMappings;                                 // 0x558(0x10)
	class PhysicalMaterial*                                      DefaultPhysMaterial;                               // 0x568(0x8)
	struct StringAssetReference                                  DefaultPhysMaterialName;                           // 0x570(0x10)
	TArray<struct GameNameRedirect>                              ActiveGameNameRedirects;                           // 0x580(0x10)
	TArray<struct ClassRedirect>                                 ActiveClassRedirects;                              // 0x590(0x10)
	TArray<struct PluginRedirect>                                ActivePluginRedirects;                             // 0x5a0(0x10)
	TArray<struct StructRedirect>                                ActiveStructRedirects;                             // 0x5b0(0x10)
	class Texture2D*                                             PreIntegratedSkinBRDFTexture;                      // 0x5c0(0x8)
	struct StringAssetReference                                  PreIntegratedSkinBRDFTextureName;                  // 0x5c8(0x10)
	class Texture2D*                                             MiniFontTexture;                                   // 0x5d8(0x8)
	struct StringAssetReference                                  MiniFontTextureName;                               // 0x5e0(0x10)
	class Texture*                                               WeightMapPlaceholderTexture;                       // 0x5f0(0x8)
	struct StringAssetReference                                  WeightMapPlaceholderTextureName;                   // 0x5f8(0x10)
	class Texture2D*                                             LightMapDensityTexture;                            // 0x608(0x8)
	struct StringAssetReference                                  LightMapDensityTextureName;                        // 0x610(0x10)
	char                                                         pad0x8_EET9D[0x8];                                 // 0x620(0x8)
	class GameViewportClient*                                    GameViewport;                                      // 0x628(0x8)
	TArray<Str DeferredCommands>                                 DeferredCommands;                                  // 0x630(0x10)
	int                                                          TickCycles;                                        // 0x640(0x4)
	int                                                          GameCycles;                                        // 0x644(0x4)
	int                                                          ClientCycles;                                      // 0x648(0x4)
	float                                                        NearClipPlane;                                     // 0x64c(0x4)
	bool                                                         bHardwareSurveyEnabled;                            // 0x650(0x1)
	bool                                                         bSubtitlesEnabled;                                 // 0x650(0x1)
	bool                                                         bSubtitlesForcedOff;                               // 0x650(0x1)
	char                                                         pad0x3_HVXCD[0x3];                                 // 0x651(0x3)
	int                                                          MaximumLoopIterationCount;                         // 0x654(0x4)
	bool                                                         bCanBlueprintsTickByDefault;                       // 0x658(0x1)
	bool                                                         bOptimizeAnimBlueprintMemberVariableAccess;        // 0x658(0x1)
	bool                                                         bEnableEditorPSysRealtimeLOD;                      // 0x658(0x1)
	bool                                                         bSmoothFrameRate;                                  // 0x658(0x1)
	bool                                                         bUseFixedFrameRate;                                // 0x658(0x1)
	char                                                         pad0x3_CVBPZ[0x3];                                 // 0x659(0x3)
	float                                                        FixedFrameRate;                                    // 0x65c(0x4)
	struct FloatRange                                            SmoothedFrameRateRange;                            // 0x660(0x10)
	class EngineCustomTimeStep*                                  CustomTimeStep;                                    // 0x670(0x8)
	char                                                         pad0x20_GSBUK[0x20];                               // 0x678(0x20)
	class TimecodeProvider*                                      TimecodeProvider;                                  // 0x698(0x8)
	char                                                         pad0x19_7I8ZZ[0x19];                               // 0x6a0(0x19)
	bool                                                         bGenerateDefaultTimecode;                          // 0x6b9(0x1)
	char                                                         pad0xa_MLMBV[0xa];                                 // 0x6ba(0xa)
	float                                                        GenerateDefaultTimecodeFrameDelay;                 // 0x6c4(0x4)
	bool                                                         bCheckForMultiplePawnsSpawnedInAFrame;             // 0x6c8(0x1)
	char                                                         pad0x3_A2BFM[0x3];                                 // 0x6c9(0x3)
	int                                                          NumPawnsAllowedToBeSpawnedInAFrame;                // 0x6cc(0x4)
	bool                                                         bShouldGenerateLowQualityLightmaps;                // 0x6d0(0x1)
	char                                                         pad0x3_CIRK9[0x3];                                 // 0x6d1(0x3)
	struct Color                                                 C_WorldBox;                                        // 0x6d4(0x4)
	struct Color                                                 C_BrushWire;                                       // 0x6d8(0x4)
	struct Color                                                 C_AddWire;                                         // 0x6dc(0x4)
	struct Color                                                 C_SubtractWire;                                    // 0x6e0(0x4)
	struct Color                                                 C_SemiSolidWire;                                   // 0x6e4(0x4)
	struct Color                                                 C_NonSolidWire;                                    // 0x6e8(0x4)
	struct Color                                                 C_WireBackground;                                  // 0x6ec(0x4)
	struct Color                                                 C_ScaleBoxHi;                                      // 0x6f0(0x4)
	struct Color                                                 C_VolumeCollision;                                 // 0x6f4(0x4)
	struct Color                                                 C_BSPCollision;                                    // 0x6f8(0x4)
	struct Color                                                 C_OrthoBackground;                                 // 0x6fc(0x4)
	struct Color                                                 C_Volume;                                          // 0x700(0x4)
	struct Color                                                 C_BrushShape;                                      // 0x704(0x4)
	float                                                        StreamingDistanceFactor;                           // 0x708(0x4)
	byte                                                         TransitionType;                                    // 0x70c(0x1)
	char                                                         pad0x3_R1KUB[0x3];                                 // 0x70d(0x3)
	struct FString                                               TransitionDescription;                             // 0x710(0x10)
	struct FString                                               TransitionGameMode;                                // 0x720(0x10)
	float                                                        MeshLODRange;                                      // 0x730(0x4)
	bool                                                         bAllowMatureLanguage;                              // 0x734(0x1)
	char                                                         pad0x3_W8WAM[0x3];                                 // 0x735(0x3)
	float                                                        CameraRotationThreshold;                           // 0x738(0x4)
	float                                                        CameraTranslationThreshold;                        // 0x73c(0x4)
	float                                                        PrimitiveProbablyVisibleTime;                      // 0x740(0x4)
	float                                                        MaxOcclusionPixelsFraction;                        // 0x744(0x4)
	bool                                                         bPauseOnLossOfFocus;                               // 0x748(0x1)
	char                                                         pad0x3_6YYZ5[0x3];                                 // 0x749(0x3)
	int                                                          MaxParticleResize;                                 // 0x74c(0x4)
	int                                                          MaxParticleResizeWarn;                             // 0x750(0x4)
	char                                                         pad0x4_HI7WW[0x4];                                 // 0x754(0x4)
	TArray<struct DropNoteInfo>                                  PendingDroppedNotes;                               // 0x758(0x10)
	struct RigidBodyErrorCorrection                              PhysicErrorCorrection;                             // 0x768(0x1c)
	float                                                        NetClientTicksPerSecond;                           // 0x784(0x4)
	bool                                                         bHasPendingGlobalReregister;                       // 0x788(0x1)
	char                                                         pad0x3_D9THH[0x3];                                 // 0x789(0x3)
	float                                                        DisplayGamma;                                      // 0x78c(0x4)
	float                                                        MinDesiredFrameRate;                               // 0x790(0x4)
	struct LinearColor                                           DefaultSelectedMaterialColor;                      // 0x794(0x10)
	struct LinearColor                                           SelectedMaterialColor;                             // 0x7a4(0x10)
	struct LinearColor                                           SelectionOutlineColor;                             // 0x7b4(0x10)
	struct LinearColor                                           SubduedSelectionOutlineColor;                      // 0x7c4(0x10)
	struct LinearColor                                           SelectedMaterialColorOverride;                     // 0x7d4(0x10)
	bool                                                         bIsOverridingSelectedColor;                        // 0x7e4(0x1)
	char                                                         pad0x3_FAXE9[0x3];                                 // 0x7e5(0x3)
	bool                                                         bEnableOnScreenDebugMessages;                      // 0x7e8(0x1)
	bool                                                         bEnableOnScreenDebugMessagesDisplay;               // 0x7e8(0x1)
	bool                                                         bSuppressMapWarnings;                              // 0x7e8(0x1)
	bool                                                         bCookSeparateSharedMPGameContent;                  // 0x7e8(0x1)
	bool                                                         bDisableAILogging;                                 // 0x7e8(0x1)
	char                                                         pad0x3_KKGAV[0x3];                                 // 0x7e9(0x3)
	int                                                          ScreenSaverInhibitorSemaphore;                     // 0x7f4(0x4)
	bool                                                         bLockReadOnlyLevels;                               // 0x7f8(0x1)
	char                                                         pad0x7_GKT2Y[0x7];                                 // 0x7f9(0x7)
	struct FString                                               ParticleEventManagerClassPath;                     // 0x800(0x10)
	char                                                         pad0x10_W5FK8[0x10];                               // 0x810(0x10)
	float                                                        SelectionHighlightIntensity;                       // 0x820(0x4)
	float                                                        BSPSelectionHighlightIntensity;                    // 0x824(0x4)
	float                                                        HoverHighlightIntensity;                           // 0x828(0x4)
	float                                                        SelectionHighlightIntensityBillboards;             // 0x82c(0x4)
	char                                                         pad0x130_RL010[0x130];                             // 0x830(0x130)
	TArray<struct NetDriverDefinition>                           NetDriverDefinitions;                              // 0x960(0x10)
	TArray<Str ServerActors>                                     ServerActors;                                      // 0x970(0x10)
	TArray<Str RuntimeServerActors>                              RuntimeServerActors;                               // 0x980(0x10)
	bool                                                         bStartedLoadMapMovie;                              // 0x990(0x1)
	char                                                         pad0x17_28TX6[0x17];                               // 0x991(0x17)
	int                                                          NextWorldContextHandle;                            // 0x9a8(0x4)
	char                                                         pad0x24_FRHOU[0x24];                               // 0x9ac(0x24)
};


// Size 0x60 (Full Size[0xa30] - InheritedSize[0x9d0]
class GameEngine: public Engine
{
public:
	float                                                        MaxDeltaTime;                                      // 0x9d0(0x4)
	float                                                        ServerFlushLogInterval;                            // 0x9d4(0x4)
	char                                                         pad0x58_S2F20[0x58];                               // 0x9d8(0x58)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class GameInstance: public Object
{
public:
	char                                                         pad0x10_P015U[0x10];                               // 0x28(0x10)
	TArray<class LocalPlayer*>                                   LocalPlayers;                                      // 0x38(0x10)
	char                                                         pad0x8_PQL0G[0x8];                                 // 0x48(0x8)
	class OnlineSession*                                         OnlineSession;                                     // 0x50(0x8)
	char                                                         pad0x30_GAXYI[0x30];                               // 0x58(0x30)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class Info: public Actor
{
public:
};


// Size 0xf8 (Full Size[0x4c0] - InheritedSize[0x3c8]
class GameMode: public Info
{
public:
	char                                                         pad0x8_GSLIN[0x8];                                 // 0x3c8(0x8)
	bool                                                         bDisableAsyncOcclusionChecking;                    // 0x3d0(0x1)
	bool                                                         bUseSeamlessTravel;                                // 0x3d0(0x1)
	bool                                                         bPauseable;                                        // 0x3d0(0x1)
	bool                                                         bStartPlayersAsSpectators;                         // 0x3d0(0x1)
	bool                                                         bDelayedStart;                                     // 0x3d0(0x1)
	char                                                         pad0x7_QBU5X[0x7];                                 // 0x3d1(0x7)
	struct FString                                               OptionsString;                                     // 0x3d8(0x10)
	class UClass*                                                DefaultPawnClass;                                  // 0x3e8(0x8)
	class UClass*                                                HUDClass;                                          // 0x3f0(0x8)
	int                                                          NumSpectators;                                     // 0x3f8(0x4)
	int                                                          NumPlayers;                                        // 0x3fc(0x4)
	int                                                          NumBots;                                           // 0x400(0x4)
	float                                                        MinRespawnDelay;                                   // 0x404(0x4)
	class GameSession*                                           GameSession;                                       // 0x408(0x8)
	int                                                          NumTravellingPlayers;                              // 0x410(0x4)
	char                                                         pad0x4_5C52U[0x4];                                 // 0x414(0x4)
	struct FText                                                 DefaultPlayerName;                                 // 0x418(0x38)
	class UClass*                                                EngineMessageClass;                                // 0x450(0x8)
	class UClass*                                                PlayerControllerClass;                             // 0x458(0x8)
	class UClass*                                                SpectatorClass;                                    // 0x460(0x8)
	class UClass*                                                ReplaySpectatorPlayerControllerClass;              // 0x468(0x8)
	class UClass*                                                PlayerStateClass;                                  // 0x470(0x8)
	class UClass*                                                GameStateClass;                                    // 0x478(0x8)
	class GameState*                                             GameState;                                         // 0x480(0x8)
	TArray<class PlayerState*>                                   InactivePlayerArray;                               // 0x488(0x10)
	char                                                         pad0x10_Y3Q6P[0x10];                               // 0x498(0x10)
	TArray<struct GameClassShortName>                            GameModeClassAliases;                              // 0x4a8(0x10)
	float                                                        InactivePlayerStateLifeSpan;                       // 0x4b8(0x4)
	bool                                                         bHandleDedicatedServerReplays;                     // 0x4bc(0x1)
	char                                                         pad0x3_WA1ON[0x3];                                 // 0x4bd(0x3)
};


// Size 0x2e0 (Full Size[0x5c0] - InheritedSize[0x2e0]
class PrimitiveComponent: public SceneComponent
{
public:
	char                                                         pad0x8_S3OZ0[0x8];                                 // 0x2e0(0x8)
	float                                                        MinDrawDistance;                                   // 0x2e8(0x4)
	char                                                         pad0x4_MO2SJ[0x4];                                 // 0x2ec(0x4)
	float                                                        LDMaxDrawDistance;                                 // 0x2f0(0x4)
	float                                                        CachedMaxDrawDistance;                             // 0x2f4(0x4)
	byte                                                         DepthPriorityGroup;                                // 0x2f8(0x1)
	byte                                                         ViewOwnerDepthPriorityGroup;                       // 0x2f9(0x1)
	char                                                         pad0x2_HQKS3[0x2];                                 // 0x2fa(0x2)
	bool                                                         bAlwaysCreatePhysicsState;                         // 0x2fc(0x1)
	bool                                                         bGenerateOverlapEvents;                            // 0x2fc(0x1)
	bool                                                         bMultiBodyOverlap;                                 // 0x2fc(0x1)
	bool                                                         bCheckAsyncSceneOnMove;                            // 0x2fc(0x1)
	bool                                                         bTraceComplexOnMove;                               // 0x2fc(0x1)
	bool                                                         bReturnMaterialOnMove;                             // 0x2fc(0x1)
	bool                                                         bUseViewOwnerDepthPriorityGroup;                   // 0x2fc(0x1)
	bool                                                         bAllowCullDistanceVolume;                          // 0x2fc(0x1)
	bool                                                         bHasMotionBlurVelocityMeshes;                      // 0x2fd(0x1)
	bool                                                         bRenderInMainPass;                                 // 0x2fd(0x1)
	bool                                                         bRenderInCustomPrePass;                            // 0x2fd(0x1)
	bool                                                         bReflected;                                        // 0x2fd(0x1)
	bool                                                         bReflectedOnLowQuality;                            // 0x2fd(0x1)
	bool                                                         bFFTWaterMask;                                     // 0x2fd(0x1)
	bool                                                         bVolumeFogMask;                                    // 0x2fd(0x1)
	bool                                                         bAffectsFlatWater;                                 // 0x2fe(0x1)
	bool                                                         bGPUParticlesKillPlane;                            // 0x2fe(0x1)
	bool                                                         bDontCull;                                         // 0x2fe(0x1)
	bool                                                         bDontSizeOnScreenCull;                             // 0x2fe(0x1)
	char                                                         pad0x1_LHMIS[0x1];                                 // 0x2ff(0x1)
	float                                                        OverriddenShadowMinTexelSize;                      // 0x300(0x4)
	bool                                                         bOverrideShadowMinSizeCulling;                     // 0x304(0x1)
	bool                                                         bOverrideShadowCascadesExclusion;                  // 0x305(0x1)
	byte                                                         ExcludedShadowCascades;                            // 0x306(0x1)
	char                                                         pad0x1_4LENW[0x1];                                 // 0x307(0x1)
	bool                                                         bReceivesDecals;                                   // 0x308(0x1)
	bool                                                         bOwnerNoSee;                                       // 0x308(0x1)
	bool                                                         bOnlyOwnerSee;                                     // 0x308(0x1)
	bool                                                         bTreatAsBackgroundForOcclusion;                    // 0x308(0x1)
	bool                                                         bIsACloud;                                         // 0x308(0x1)
	bool                                                         bUseAsOccluder;                                    // 0x308(0x1)
	bool                                                         bSelectable;                                       // 0x308(0x1)
	bool                                                         bForceMipStreaming;                                // 0x308(0x1)
	bool                                                         bHasPerInstanceHitProxies;                         // 0x309(0x1)
	bool                                                         CastShadow;                                        // 0x309(0x1)
	bool                                                         bAffectDynamicIndirectLighting;                    // 0x309(0x1)
	bool                                                         bUseFarCascadeLPVBiasMultiplier;                   // 0x309(0x1)
	bool                                                         bAffectDistanceFieldLighting;                      // 0x309(0x1)
	bool                                                         bCastDynamicShadow;                                // 0x309(0x1)
	bool                                                         bCastStaticShadow;                                 // 0x309(0x1)
	bool                                                         bCastVolumetricTranslucentShadow;                  // 0x309(0x1)
	bool                                                         bSelfShadowOnly;                                   // 0x30a(0x1)
	bool                                                         bCastFarShadow;                                    // 0x30a(0x1)
	bool                                                         bCastInsetShadow;                                  // 0x30a(0x1)
	bool                                                         bCastCinematicShadow;                              // 0x30a(0x1)
	bool                                                         bCastHiddenShadow;                                 // 0x30a(0x1)
	bool                                                         bCastShadowAsTwoSided;                             // 0x30a(0x1)
	bool                                                         bCastShadowOnLowQuality;                           // 0x30a(0x1)
	bool                                                         bLightAsIfStatic;                                  // 0x30a(0x1)
	bool                                                         bLightAttachmentsAsGroup;                          // 0x30b(0x1)
	byte                                                         IndirectLightingCacheQuality;                      // 0x30c(0x1)
	bool                                                         bHasCachedStaticLighting;                          // 0x30d(0x1)
	bool                                                         bStaticLightingBuildEnqueued;                      // 0x30e(0x1)
	char                                                         pad0x1_QT0R5[0x1];                                 // 0x30f(0x1)
	bool                                                         bIgnoreRadialImpulse;                              // 0x310(0x1)
	bool                                                         bIgnoreRadialForce;                                // 0x310(0x1)
	bool                                                         AlwaysLoadOnClient;                                // 0x310(0x1)
	bool                                                         AlwaysLoadOnServer;                                // 0x310(0x1)
	bool                                                         bUseEditorCompositing;                             // 0x310(0x1)
	bool                                                         bRenderCustomDepth;                                // 0x310(0x1)
	bool                                                         bAllowVelocityInMaterial;                          // 0x310(0x1)
	char                                                         pad0x3_GPKKP[0x3];                                 // 0x311(0x3)
	int                                                          CustomDepthStencilValue;                           // 0x314(0x4)
	int                                                          TranslucencySortPriority;                          // 0x318(0x4)
	int                                                          VisibilityId;                                      // 0x31c(0x4)
	char                                                         pad0x4_9STDQ[0x4];                                 // 0x320(0x4)
	float                                                        LpvBiasMultiplier;                                 // 0x324(0x4)
	float                                                        FarCascadeLPVBiasMultiplier;                       // 0x328(0x4)
	float                                                        LpvIntensityMultiplier;                            // 0x32c(0x4)
	struct CustomPrimitiveData                                   CustomPrimitiveData;                               // 0x330(0x10)
	struct BodyInstance                                          BodyInstance;                                      // 0x340(0x180)
	bool                                                         bAffectRain;                                       // 0x4c0(0x1)
	bool                                                         bCanEverAffectNavigation;                          // 0x4c0(0x1)
	bool                                                         bSkipRenderingInOuterLPVCascades;                  // 0x4c0(0x1)
	bool                                                         bEnableMergeCollisionComponents;                   // 0x4c0(0x1)
	bool                                                         bVisibleWhenAboveWaterAndPlayerUnderwater;         // 0x4c0(0x1)
	bool                                                         bVisibleWhenAboveWaterAndPlayerAbove;              // 0x4c0(0x1)
	bool                                                         bVisibleWhenUnderwaterAndPlayerAbove;              // 0x4c0(0x1)
	bool                                                         bVisibleWhenUnderwaterAndPlayerUnderwater;         // 0x4c1(0x1)
	bool                                                         bCanRenderAboveAndBelowWaterAtSameTime;            // 0x4c1(0x1)
	char                                                         pad0x6_YTPKX[0x6];                                 // 0x4c2(0x6)
	float                                                        BoundsScale;                                       // 0x4c8(0x4)
	float                                                        OcclusionBoundsScale;                              // 0x4cc(0x4)
	float                                                        LastRenderTime;                                    // 0x4d0(0x4)
	bool                                                         bGPUVisibility;                                    // 0x4d4(0x1)
	byte                                                         bHasCustomNavigableGeometry;                       // 0x4d5(0x1)
	byte                                                         CanCharacterStepUpOn;                              // 0x4d6(0x1)
	char                                                         pad0x49_YG3C8[0x49];                               // 0x4d7(0x49)
	class PrimitiveComponent*                                    LODParentPrimitive;                                // 0x558(0x8)
	struct PrimitiveComponentPostPhysicsTickFunction             PostPhysicsComponentTick;                          // 0x560(0x50)
	class PrimitiveComponent*                                    MergedCollisionComponentParent;                    // 0x5b0(0x8)
	char                                                         pad0x8_A69XP[0x8];                                 // 0x5b8(0x8)
};


// Size 0x58 (Full Size[0x420] - InheritedSize[0x3c8]
class GameState: public Info
{
public:
	class UClass*                                                GameModeClass;                                     // 0x3c8(0x8)
	class GameMode*                                              AuthorityGameMode;                                 // 0x3d0(0x8)
	class UClass*                                                SpectatorClass;                                    // 0x3d8(0x8)
	struct FName                                                 MatchState;                                        // 0x3e0(0x8)
	struct FName                                                 PreviousMatchState;                                // 0x3e8(0x8)
	int                                                          ElapsedTime;                                       // 0x3f0(0x4)
	char                                                         pad0x4_VY4HV[0x4];                                 // 0x3f4(0x4)
	TArray<class PlayerState*>                                   PlayerArray;                                       // 0x3f8(0x10)
	float                                                        ReplicatedWorldTimeSeconds;                        // 0x408(0x4)
	float                                                        ServerWorldTimeSecondsDelta;                       // 0x40c(0x4)
	float                                                        ServerWorldTimeSecondsUpdateFrequency;             // 0x410(0x4)
	char                                                         pad0xc_VR97O[0xc];                                 // 0x414(0xc)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class GameUserSettings: public Object
{
public:
	bool                                                         bUseVSync;                                         // 0x28(0x1)
	char                                                         pad0x1f_MG8TZ[0x1f];                               // 0x29(0x1f)
	int                                                          WindowPosX;                                        // 0x58(0x4)
	int                                                          WindowPosY;                                        // 0x5c(0x4)
	bool                                                         bUseDesktopResolutionForFullscreen;                // 0x60(0x1)
	char                                                         pad0x3_96YA8[0x3];                                 // 0x61(0x3)
	int                                                          FullscreenMode;                                    // 0x64(0x4)
	int                                                          LastConfirmedFullscreenMode;                       // 0x68(0x4)
	int                                                          AudioQualityLevel;                                 // 0x70(0x4)
	char                                                         pad0x4_POY5G[0x4];                                 // 0x74(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ScriptViewportClient: public Object
{
public:
	char                                                         pad0x8_Y7RHR[0x8];                                 // 0x28(0x8)
};


// Size 0x220 (Full Size[0x250] - InheritedSize[0x30]
class GameViewportClient: public ScriptViewportClient
{
public:
	char                                                         pad0x8_JJJOP[0x8];                                 // 0x30(0x8)
	class Console*                                               ViewportConsole;                                   // 0x38(0x8)
	TArray<struct DebugDisplayProperty>                          DebugProperties;                                   // 0x40(0x10)
	char                                                         pad0x30_LTYTM[0x30];                               // 0x50(0x30)
	class World*                                                 World;                                             // 0x80(0x8)
	class GameInstance*                                          GameInstance;                                      // 0x88(0x8)
	char                                                         pad0x1c0_WWY8P[0x1c0];                             // 0x90(0x1c0)
};


// Size 0x88 (Full Size[0x450] - InheritedSize[0x3c8]
class PlayerState: public Info
{
public:
	float                                                        Score;                                             // 0x3c8(0x4)
	byte                                                         Ping;                                              // 0x3cc(0x1)
	char                                                         pad0x3_YSZN2[0x3];                                 // 0x3cd(0x3)
	struct FString                                               PlayerName;                                        // 0x3d0(0x10)
	char                                                         pad0x10_BN9I7[0x10];                               // 0x3e0(0x10)
	int                                                          PlayerId;                                          // 0x3f0(0x4)
	bool                                                         bIsSpectator;                                      // 0x3f4(0x1)
	bool                                                         bOnlySpectator;                                    // 0x3f4(0x1)
	bool                                                         bIsABot;                                           // 0x3f4(0x1)
	bool                                                         bIsInactive;                                       // 0x3f4(0x1)
	bool                                                         bFromPreviousLevel;                                // 0x3f4(0x1)
	char                                                         pad0x3_7RYI5[0x3];                                 // 0x3f5(0x3)
	int                                                          StartTime;                                         // 0x3f8(0x4)
	char                                                         pad0x4_L0DUR[0x4];                                 // 0x3fc(0x4)
	class UClass*                                                EngineMessageClass;                                // 0x400(0x8)
	char                                                         pad0x18_BCHAG[0x18];                               // 0x408(0x18)
	struct UniqueNetIdRepl                                       UniqueId;                                          // 0x420(0x18)
	char                                                         pad0x18_7UJ9W[0x18];                               // 0x438(0x18)
};


// Size 0x60 (Full Size[0x428] - InheritedSize[0x3c8]
class Controller: public Actor
{
public:
	char                                                         pad0x8_U2SDX[0x8];                                 // 0x3c8(0x8)
	class Pawn*                                                  Pawn;                                              // 0x3d0(0x8)
	char                                                         pad0x8_U8PEY[0x8];                                 // 0x3d8(0x8)
	class Character*                                             Character;                                         // 0x3e0(0x8)
	class PlayerState*                                           PlayerState;                                       // 0x3e8(0x8)
	class SceneComponent*                                        TransformComponent;                                // 0x3f0(0x8)
	struct Rotator                                               ControlRotation;                                   // 0x3f8(0xc)
	bool                                                         bAttachToPawn;                                     // 0x404(0x1)
	char                                                         pad0xb_QF1H1[0xb];                                 // 0x405(0xb)
	struct FName                                                 StateName;                                         // 0x410(0x8)
	char                                                         pad0x10_V75AM[0x10];                               // 0x418(0x10)
};


// Size 0x348 (Full Size[0x770] - InheritedSize[0x428]
class PlayerController: public Controller
{
public:
	class Player*                                                Player;                                            // 0x428(0x8)
	char                                                         pad0x8_57VCK[0x8];                                 // 0x430(0x8)
	class Pawn*                                                  AcknowledgedPawn;                                  // 0x438(0x8)
	class InterpTrackInstDirector*                               ControllingDirTrackInst;                           // 0x440(0x8)
	char                                                         pad0x8_X6E2Q[0x8];                                 // 0x448(0x8)
	class HUD*                                                   MyHUD;                                             // 0x450(0x8)
	class PlayerCameraManager*                                   PlayerCameraManager;                               // 0x458(0x8)
	class UClass*                                                PlayerCameraManagerClass;                          // 0x460(0x8)
	bool                                                         bAutoManageActiveCameraTarget;                     // 0x468(0x1)
	char                                                         pad0x3_BS8W3[0x3];                                 // 0x469(0x3)
	struct Rotator                                               TargetViewRotation;                                // 0x46c(0xc)
	char                                                         pad0x10_BGZLC[0x10];                               // 0x478(0x10)
	TArray<class Actor*>                                         HiddenActors;                                      // 0x488(0x10)
	float                                                        LastSpectatorStateSynchTime;                       // 0x498(0x4)
	struct Vector                                                LastSpectatorSyncLocation;                         // 0x49c(0xc)
	struct Rotator                                               LastSpectatorSyncRotation;                         // 0x4a8(0xc)
	int                                                          ClientCap;                                         // 0x4b4(0x4)
	class CheatManager*                                          CheatManager;                                      // 0x4b8(0x8)
	class UClass*                                                CheatClass;                                        // 0x4c0(0x8)
	class PlayerInput*                                           PlayerInput;                                       // 0x4c8(0x8)
	TArray<struct ActiveForceFeedbackEffect>                     ActiveForceFeedbackEffects;                        // 0x4d0(0x10)
	char                                                         pad0x90_AWYUA[0x90];                               // 0x4e0(0x90)
	bool                                                         bPlayerIsWaiting;                                  // 0x570(0x1)
	char                                                         pad0x3_MJRJJ[0x3];                                 // 0x571(0x3)
	byte                                                         NetPlayerIndex;                                    // 0x574(0x1)
	bool                                                         bHasVoiceHandshakeCompleted;                       // 0x575(0x1)
	char                                                         pad0x2_H38NT[0x2];                                 // 0x576(0x2)
	class NetConnection*                                         PendingSwapConnection;                             // 0x578(0x8)
	class NetConnection*                                         NetConnection;                                     // 0x580(0x8)
	char                                                         pad0xc_03T88[0xc];                                 // 0x588(0xc)
	float                                                        InputYawScale;                                     // 0x594(0x4)
	float                                                        InputPitchScale;                                   // 0x598(0x4)
	float                                                        InputRollScale;                                    // 0x59c(0x4)
	bool                                                         bShowMouseCursor;                                  // 0x5a0(0x1)
	bool                                                         bEnableClickEvents;                                // 0x5a0(0x1)
	bool                                                         bEnableTouchEvents;                                // 0x5a0(0x1)
	bool                                                         bEnableMouseOverEvents;                            // 0x5a0(0x1)
	bool                                                         bEnableTouchOverEvents;                            // 0x5a0(0x1)
	bool                                                         bForceFeedbackEnabled;                             // 0x5a0(0x1)
	char                                                         pad0x3_TGBUM[0x3];                                 // 0x5a1(0x3)
	byte                                                         DefaultMouseCursor;                                // 0x5a4(0x1)
	byte                                                         CurrentMouseCursor;                                // 0x5a5(0x1)
	byte                                                         DefaultClickTraceChannel;                          // 0x5a6(0x1)
	byte                                                         CurrentClickTraceChannel;                          // 0x5a7(0x1)
	float                                                        HitResultTraceDistance;                            // 0x5a8(0x4)
	float                                                        ForceFeedbackIntensity;                            // 0x5ac(0x4)
	char                                                         pad0x88_7QL2Q[0x88];                               // 0x5b0(0x88)
	class InputComponent*                                        InactiveStateInputComponent;                       // 0x638(0x8)
	char                                                         pad0x20_K4ECP[0x20];                               // 0x640(0x20)
	class TouchInterface*                                        CurrentTouchInterface;                             // 0x660(0x8)
	char                                                         pad0x30_BI589[0x30];                               // 0x668(0x30)
	class SpectatorPawn*                                         SpectatorPawn;                                     // 0x698(0x8)
	struct Vector                                                SpawnLocation;                                     // 0x6a0(0xc)
	char                                                         pad0x4_1R3PN[0x4];                                 // 0x6ac(0x4)
	bool                                                         bIsLocalPlayerController;                          // 0x714(0x1)
	char                                                         pad0x1_P3VLT[0x1];                                 // 0x715(0x1)
	bool                                                         bInCinematicMode;                                  // 0x71a(0x1)
	char                                                         pad0x55_ZG4E9[0x55];                               // 0x71b(0x55)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class StaticMeshActor: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x3c8(0x8)
	bool                                                         bStaticMeshReplicateMovement;                      // 0x3d0(0x1)
	byte                                                         NavigationGeometryGatheringMode;                   // 0x3d1(0x1)
	char                                                         pad0x6_55X89[0x6];                                 // 0x3d2(0x6)
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class Brush: public Actor
{
public:
	byte                                                         BrushType;                                         // 0x3c8(0x1)
	char                                                         pad0x3_NWO43[0x3];                                 // 0x3c9(0x3)
	struct Color                                                 BrushColor;                                        // 0x3cc(0x4)
	int                                                          PolyFlags;                                         // 0x3d0(0x4)
	bool                                                         bColored;                                          // 0x3d4(0x1)
	bool                                                         bSolidWhenSelected;                                // 0x3d4(0x1)
	bool                                                         bPlaceableFromClassBrowser;                        // 0x3d4(0x1)
	bool                                                         bNotForClientOrServer;                             // 0x3d4(0x1)
	char                                                         pad0x3_LJSR3[0x3];                                 // 0x3d5(0x3)
	class Model*                                                 Brush;                                             // 0x3d8(0x8)
	class BrushComponent*                                        BrushComponent;                                    // 0x3e0(0x8)
	bool                                                         bInManipulation;                                   // 0x3e8(0x1)
	char                                                         pad0x7_G394L[0x7];                                 // 0x3e9(0x7)
	TArray<struct GeomSelection>                                 SavedSelections;                                   // 0x3f0(0x10)
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class Volume: public Brush
{
public:
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class BlockingVolume: public Volume
{
public:
};


// Size 0x1b8 (Full Size[0x580] - InheritedSize[0x3c8]
class WorldSettings: public Info
{
public:
	char                                                         pad0x8_QHBRB[0x8];                                 // 0x3c8(0x8)
	bool                                                         bEnableWorldBoundsChecks;                          // 0x3d0(0x1)
	bool                                                         bEnableNavigationSystem;                           // 0x3d0(0x1)
	char                                                         pad0x3_C1CGA[0x3];                                 // 0x3d1(0x3)
	byte                                                         WorldCompositionSetting;                           // 0x3d4(0x1)
	char                                                         pad0x3_F2AWK[0x3];                                 // 0x3d5(0x3)
	struct StringAssetReference                                  InstancedNavMeshesDataAssetOveride;                // 0x3d8(0x10)
	bool                                                         bEnableWorldOriginRebasing;                        // 0x3e8(0x1)
	bool                                                         bWorldGravitySet;                                  // 0x3e8(0x1)
	bool                                                         bGlobalGravitySet;                                 // 0x3e8(0x1)
	char                                                         pad0x3_28JBA[0x3];                                 // 0x3e9(0x3)
	float                                                        KillZ;                                             // 0x3ec(0x4)
	class UClass*                                                KillZDamageType;                                   // 0x3f0(0x8)
	float                                                        GlobalGravityZ;                                    // 0x3f8(0x4)
	char                                                         pad0x4_7CDEA[0x4];                                 // 0x3fc(0x4)
	class UClass*                                                DefaultPhysicsVolumeClass;                         // 0x400(0x8)
	class UClass*                                                PhysicsCollisionHandlerClass;                      // 0x408(0x8)
	class UClass*                                                DefaultGameMode;                                   // 0x410(0x8)
	TArray<struct GameModePrefix>                                DefaultMapPrefixes;                                // 0x418(0x10)
	class UClass*                                                GameNetworkManagerClass;                           // 0x428(0x8)
	int                                                          PackedLightAndShadowMapTextureSize;                // 0x430(0x4)
	bool                                                         bMinimizeBSPSections;                              // 0x434(0x1)
	char                                                         pad0x3_O6YK8[0x3];                                 // 0x435(0x3)
	struct Vector                                                DefaultColorScale;                                 // 0x438(0xc)
	bool                                                         bPrecomputeVisibility;                             // 0x444(0x1)
	bool                                                         bPlaceCellsOnlyAlongCameraTracks;                  // 0x444(0x1)
	char                                                         pad0x3_3R2EH[0x3];                                 // 0x445(0x3)
	int                                                          VisibilityCellSize;                                // 0x448(0x4)
	byte                                                         VisibilityAggressiveness;                          // 0x44c(0x1)
	char                                                         pad0x3_EXXAA[0x3];                                 // 0x44d(0x3)
	bool                                                         bForceNoPrecomputedLighting;                       // 0x450(0x1)
	char                                                         pad0x3_XDNP7[0x3];                                 // 0x451(0x3)
	struct LightmassWorldInfoSettings                            LightmassSettings;                                 // 0x454(0x44)
	byte                                                         LevelLightingQuality;                              // 0x498(0x1)
	char                                                         pad0x7_ZO3UL[0x7];                                 // 0x499(0x7)
	struct ReverbSettings                                        DefaultReverbSettings;                             // 0x4a0(0x18)
	struct InteriorSettings                                      DefaultAmbientZoneSettings;                        // 0x4b8(0x24)
	char                                                         pad0x4_Z67JH[0x4];                                 // 0x4dc(0x4)
	class SoundMix*                                              DefaultBaseSoundMix;                               // 0x4e0(0x8)
	float                                                        WorldToMeters;                                     // 0x4e8(0x4)
	char                                                         pad0x4_JO4X5[0x4];                                 // 0x4ec(0x4)
	class BookMark*                                              BookMarks;                                         // 0x4f0(0x8)
	char                                                         pad0x48_KKAIJ[0x48];                               // 0x4f8(0x48)
	float                                                        TimeDilation;                                      // 0x540(0x4)
	float                                                        MatineeTimeDilation;                               // 0x544(0x4)
	float                                                        DemoPlayTimeDilation;                              // 0x548(0x4)
	bool                                                         bHighPriorityLoading;                              // 0x54c(0x1)
	bool                                                         bHighPriorityLoadingLocal;                         // 0x54c(0x1)
	char                                                         pad0x3_LYA89[0x3];                                 // 0x54d(0x3)
	TArray<struct NetViewer>                                     ReplicationViewers;                                // 0x550(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x560(0x10)
	float                                                        WorldGravityZ;                                     // 0x570(0x4)
	char                                                         pad0x4_KFFMZ[0x4];                                 // 0x574(0x4)
	class PlayerState*                                           Pauser;                                            // 0x578(0x8)
};


// Size 0x560 (Full Size[0x840] - InheritedSize[0x2e0]
class PostProcessComponent: public SceneComponent
{
public:
	char                                                         pad0x10_RQ4I5[0x10];                               // 0x2e0(0x10)
	struct PostProcessSettings                                   Settings;                                          // 0x2f0(0x540)
	float                                                        Priority;                                          // 0x830(0x4)
	float                                                        BlendRadius;                                       // 0x834(0x4)
	float                                                        BlendWeight;                                       // 0x838(0x4)
	bool                                                         bEnabled;                                          // 0x83c(0x1)
	bool                                                         bUnbound;                                          // 0x83c(0x1)
	char                                                         pad0x3_VVH0R[0x3];                                 // 0x83d(0x3)
};


// Size 0x110 (Full Size[0x138] - InheritedSize[0x28]
class Texture: public Object
{
public:
	int                                                          LODBias;                                           // 0x28(0x4)
	int                                                          NumCinematicMipLevels;                             // 0x2c(0x4)
	bool                                                         SRGB;                                              // 0x30(0x1)
	bool                                                         NeverStream;                                       // 0x30(0x1)
	bool                                                         bNoTiling;                                         // 0x30(0x1)
	bool                                                         bUseCinematicMipLevels;                            // 0x30(0x1)
	bool                                                         CompressionNone;                                   // 0x30(0x1)
	bool                                                         bUAV;                                              // 0x30(0x1)
	char                                                         pad0x3_H2WD3[0x3];                                 // 0x31(0x3)
	int                                                          CachedCombinedLODBias;                             // 0x38(0x4)
	bool                                                         bAsyncResourceReleaseHasBeenStarted;               // 0x3c(0x1)
	char                                                         pad0x3_BFILK[0x3];                                 // 0x3d(0x3)
	byte                                                         CompressionSettings;                               // 0x40(0x1)
	byte                                                         Filter;                                            // 0x41(0x1)
	byte                                                         LODGroup;                                          // 0x42(0x1)
	char                                                         pad0x1_AY39G[0x1];                                 // 0x43(0x1)
	float                                                        StreamingPriorityBoost;                            // 0x44(0x4)
	char                                                         pad0x58_4H70G[0x58];                               // 0x48(0x58)
	TArray<struct ExternalMip>                                   ExternalMips;                                      // 0xa0(0x10)
	char                                                         pad0x88_J0LP1[0x88];                               // 0xb0(0x88)
};


// Size 0x8 (Full Size[0x140] - InheritedSize[0x138]
class TextureRenderTarget: public Texture
{
public:
	float                                                        TargetGamma;                                       // 0x138(0x4)
	char                                                         pad0x4_RGAF1[0x4];                                 // 0x13c(0x4)
};


// Size 0x28 (Full Size[0x168] - InheritedSize[0x140]
class TextureRenderTarget2D: public TextureRenderTarget
{
public:
	int                                                          SizeX;                                             // 0x140(0x4)
	int                                                          SizeY;                                             // 0x144(0x4)
	struct LinearColor                                           ClearColor;                                        // 0x148(0x10)
	byte                                                         AddressX;                                          // 0x158(0x1)
	byte                                                         AddressY;                                          // 0x159(0x1)
	char                                                         pad0x2_XATKU[0x2];                                 // 0x15a(0x2)
	bool                                                         bForceLinearGamma;                                 // 0x15c(0x1)
	bool                                                         bHDR;                                              // 0x15c(0x1)
	bool                                                         bAutoGenerateMips;                                 // 0x15c(0x1)
	char                                                         pad0x3_SPMC7[0x3];                                 // 0x15d(0x3)
	byte                                                         OverrideFormat;                                    // 0x160(0x1)
	bool                                                         bDontClearOnCreation;                              // 0x161(0x1)
	char                                                         pad0x6_UB4NT[0x6];                                 // 0x162(0x6)
};


// Size 0x50 (Full Size[0x7c0] - InheritedSize[0x770]
class DebugCameraController: public PlayerController
{
public:
	bool                                                         bUseOriginalPlayerHUD;                             // 0x770(0x1)
	bool                                                         bShowSelectedInfo;                                 // 0x770(0x1)
	bool                                                         bIsFrozenRendering;                                // 0x770(0x1)
	char                                                         pad0x7_474UB[0x7];                                 // 0x771(0x7)
	class DrawFrustumComponent*                                  DrawFrustum;                                       // 0x778(0x8)
	char                                                         pad0x10_U42O6[0x10];                               // 0x780(0x10)
	class PlayerController*                                      OriginalControllerRef;                             // 0x790(0x8)
	class Player*                                                OriginalPlayer;                                    // 0x798(0x8)
	float                                                        SpeedScale;                                        // 0x7a0(0x4)
	float                                                        InitialMaxSpeed;                                   // 0x7a4(0x4)
	float                                                        InitialAccel;                                      // 0x7a8(0x4)
	float                                                        InitialDecel;                                      // 0x7ac(0x4)
	float                                                        SpeedScaleAdjustment;                              // 0x7b0(0x4)
	float                                                        FovScaleAdjustment;                                // 0x7b4(0x4)
	char                                                         pad0x8_MFJEY[0x8];                                 // 0x7b8(0x8)
};


// Size 0xf8 (Full Size[0x4c0] - InheritedSize[0x3c8]
class HUD: public Actor
{
public:
	struct Color                                                 WhiteColor;                                        // 0x3c8(0x4)
	struct Color                                                 GreenColor;                                        // 0x3cc(0x4)
	struct Color                                                 RedColor;                                          // 0x3d0(0x4)
	char                                                         pad0x4_R23Z4[0x4];                                 // 0x3d4(0x4)
	class PlayerController*                                      PlayerOwner;                                       // 0x3d8(0x8)
	bool                                                         bLostFocusPaused;                                  // 0x3e0(0x1)
	bool                                                         bShowHUD;                                          // 0x3e0(0x1)
	bool                                                         bShowDebugInfo;                                    // 0x3e0(0x1)
	bool                                                         bShowHitBoxDebugInfo;                              // 0x3e0(0x1)
	bool                                                         bShowOverlays;                                     // 0x3e0(0x1)
	bool                                                         bEnableDebugTextShadow;                            // 0x3e0(0x1)
	char                                                         pad0x7_UK9O4[0x7];                                 // 0x3e1(0x7)
	TArray<class Actor*>                                         PostRenderedActors;                                // 0x3e8(0x10)
	float                                                        LastHUDRenderTime;                                 // 0x3f8(0x4)
	float                                                        RenderDelta;                                       // 0x3fc(0x4)
	TArray<struct FName>                                         DebugDisplay;                                      // 0x400(0x10)
	TArray<struct FName>                                         ToggledDebugCategories;                            // 0x410(0x10)
	class Canvas*                                                Canvas;                                            // 0x420(0x8)
	class Canvas*                                                DebugCanvas;                                       // 0x428(0x8)
	TArray<struct DebugTextInfo>                                 DebugTextList;                                     // 0x430(0x10)
	class UClass*                                                ShowDebugTargetDesiredClass;                       // 0x440(0x8)
	class Actor*                                                 ShowDebugTargetActor;                              // 0x448(0x8)
	char                                                         pad0x70_KCWUA[0x70];                               // 0x450(0x70)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class FeatureToggledStringAssetReference: public DataAsset
{
public:
	TArray<struct FeatureToggledStringAssetReferenceEntry>       Entries;                                           // 0x28(0x10)
	class UClass*                                                ClassType;                                         // 0x38(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class LevelScriptActor: public Actor
{
public:
	bool                                                         bInputEnabled;                                     // 0x3c8(0x1)
	char                                                         pad0x7_Q97JT[0x7];                                 // 0x3c9(0x7)
};


// Size 0x10 (Full Size[0x5d0] - InheritedSize[0x5c0]
class ArrowComponent: public PrimitiveComponent
{
public:
	struct Color                                                 ArrowColor;                                        // 0x5b8(0x4)
	float                                                        ArrowSize;                                         // 0x5bc(0x4)
	bool                                                         bIsScreenSizeScaled;                               // 0x5c0(0x1)
	char                                                         pad0x3_XRTPB[0x3];                                 // 0x5c1(0x3)
	float                                                        ScreenSize;                                        // 0x5c4(0x4)
	bool                                                         bTreatAsASprite;                                   // 0x5c8(0x1)
	char                                                         pad0x7_849ZP[0x7];                                 // 0x5c9(0x7)
};


// Size 0x10 (Full Size[0x5d0] - InheritedSize[0x5c0]
class MeshComponent: public PrimitiveComponent
{
public:
	TArray<class MaterialInterface*>                             OverrideMaterials;                                 // 0x5b8(0x10)
	char                                                         pad0x8_WX1H2[0x8];                                 // 0x5c8(0x8)
};


// Size 0x50 (Full Size[0x620] - InheritedSize[0x5d0]
class StaticMeshComponent: public MeshComponent
{
public:
	int                                                          ForcedLodModel;                                    // 0x5c8(0x4)
	bool                                                         bOverrideMinLOD;                                   // 0x5cc(0x1)
	bool                                                         bOverrideNavigationToDefaultObstacle;              // 0x5cd(0x1)
	char                                                         pad0x2_WIQCX[0x2];                                 // 0x5ce(0x2)
	int                                                          MinLOD;                                            // 0x5d0(0x4)
	char                                                         pad0x4_FG8HQ[0x4];                                 // 0x5d4(0x4)
	class StaticMesh*                                            StaticMesh;                                        // 0x5d8(0x8)
	bool                                                         bOverrideWireframeColor;                           // 0x5e0(0x1)
	char                                                         pad0x3_TKVMV[0x3];                                 // 0x5e1(0x3)
	struct Color                                                 WireframeColorOverride;                            // 0x5e4(0x4)
	bool                                                         bIgnoreInstanceForTextureStreaming;                // 0x5e8(0x1)
	bool                                                         bOverrideLightMapRes;                              // 0x5e8(0x1)
	char                                                         pad0x3_JXY7Y[0x3];                                 // 0x5e9(0x3)
	int                                                          OverriddenLightMapRes;                             // 0x5ec(0x4)
	float                                                        StreamingDistanceMultiplier;                       // 0x5f0(0x4)
	char                                                         pad0x4_NC6CV[0x4];                                 // 0x5f4(0x4)
	TArray<struct Guid>                                          IrrelevantLights;                                  // 0x5f8(0x10)
	TArray<struct StaticMeshComponentLODInfo>                    LODData;                                           // 0x608(0x10)
	class MaterialInterface*                                     CustomDepthMaterial;                               // 0x618(0x8)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class FogVolume: public Actor
{
public:
	class SphereComponent*                                       SphereComponent;                                   // 0x3c8(0x8)
	class FogVolumeComponent*                                    FogVolumeComponent;                                // 0x3d0(0x8)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class ThreadedActor: public Actor
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class MaterialInterface: public Object
{
public:
	char                                                         pad0x8_MCEBE[0x8];                                 // 0x28(0x8)
	class SubsurfaceProfile*                                     SubsurfaceProfile;                                 // 0x30(0x8)
	char                                                         pad0x4_OOHXZ[0x4];                                 // 0x38(0x4)
	struct LightmassMaterialInterfaceSettings                    LightmassSettings;                                 // 0x3c(0x14)
	char                                                         pad0x8_CINZ8[0x8];                                 // 0x50(0x8)
};


// Size 0x9c0 (Full Size[0xa18] - InheritedSize[0x58]
class Material: public MaterialInterface
{
public:
	class PhysicalMaterial*                                      PhysMaterial;                                      // 0x58(0x8)
	struct ColorMaterialInput                                    DiffuseColor;                                      // 0x60(0x40)
	struct ColorMaterialInput                                    SpecularColor;                                     // 0xa0(0x40)
	struct ColorMaterialInput                                    BaseColor;                                         // 0xe0(0x40)
	struct ScalarMaterialInput                                   Metallic;                                          // 0x120(0x40)
	struct ScalarMaterialInput                                   Specular;                                          // 0x160(0x40)
	struct ScalarMaterialInput                                   Roughness;                                         // 0x1a0(0x40)
	struct VectorMaterialInput                                   Normal;                                            // 0x1e0(0x48)
	struct ColorMaterialInput                                    EmissiveColor;                                     // 0x228(0x40)
	struct ScalarMaterialInput                                   Opacity;                                           // 0x268(0x40)
	struct ScalarMaterialInput                                   OpacityMask;                                       // 0x2a8(0x40)
	byte                                                         MaterialDomain;                                    // 0x2e8(0x1)
	byte                                                         BlendMode;                                         // 0x2e9(0x1)
	byte                                                         DecalBlendMode;                                    // 0x2ea(0x1)
	bool                                                         bDecalNoEmissiveOrRoughness;                       // 0x2eb(0x1)
	bool                                                         bDecalEnableStencil;                               // 0x2ec(0x1)
	byte                                                         MaterialDecalResponse;                             // 0x2ed(0x1)
	byte                                                         ShadingModel;                                      // 0x2ee(0x1)
	char                                                         pad0x1_U61JN[0x1];                                 // 0x2ef(0x1)
	float                                                        OpacityMaskClipValue;                              // 0x2f0(0x4)
	float                                                        DepthWeightScale;                                  // 0x2f4(0x4)
	float                                                        DepthWeightExponent;                               // 0x2f8(0x4)
	float                                                        DepthWeightBase;                                   // 0x2fc(0x4)
	bool                                                         bBlendedOITAfterTranslucency;                      // 0x300(0x1)
	bool                                                         bForceResolution;                                  // 0x300(0x1)
	char                                                         pad0x3_86HO7[0x3];                                 // 0x301(0x3)
	byte                                                         ForcedResolution;                                  // 0x304(0x1)
	char                                                         pad0x3_P35AG[0x3];                                 // 0x305(0x3)
	float                                                        FirstSplitDistance;                                // 0x308(0x4)
	float                                                        SecondSplitDistance;                               // 0x30c(0x4)
	float                                                        FullResInFrontMaxDistance;                         // 0x310(0x4)
	bool                                                         FullResInFront;                                    // 0x314(0x1)
	bool                                                         PopPerParticle;                                    // 0x314(0x1)
	char                                                         pad0x3_EHLKE[0x3];                                 // 0x315(0x3)
	struct VectorMaterialInput                                   WorldPositionOffset;                               // 0x318(0x48)
	struct VectorMaterialInput                                   WorldDisplacement;                                 // 0x360(0x48)
	struct ScalarMaterialInput                                   TessellationMultiplier;                            // 0x3a8(0x40)
	struct ColorMaterialInput                                    SubsurfaceColor;                                   // 0x3e8(0x40)
	struct ScalarMaterialInput                                   ClearCoat;                                         // 0x428(0x40)
	struct ScalarMaterialInput                                   ClearCoatRoughness;                                // 0x468(0x40)
	struct ScalarMaterialInput                                   AmbientOcclusion;                                  // 0x4a8(0x40)
	struct ScalarMaterialInput                                   Refraction;                                        // 0x4e8(0x40)
	struct ColorMaterialInput                                    BillboardColor;                                    // 0x528(0x40)
	struct VectorMaterialInput                                   BillboardParams;                                   // 0x568(0x48)
	struct Vector2MaterialInput                                  CustomizedUVs;                                     // 0x5b0(0x48)
	char                                                         pad0x1f8_FIG5O[0x1f8];                             // 0x5f8(0x1f8)
	struct MaterialAttributesInput                               MaterialAttributes;                                // 0x7f0(0x38)
	char                                                         pad0x10_EZAI7[0x10];                               // 0x828(0x10)
	struct ScalarMaterialInput                                   PixelDepthOffset;                                  // 0x838(0x40)
	bool                                                         bTranslucentBeforeTranslucency;                    // 0x878(0x1)
	bool                                                         bTranslucentBeforeVolumeFog;                       // 0x878(0x1)
	bool                                                         bTranslucentWithDepthWrite;                        // 0x878(0x1)
	bool                                                         bEnableSeparateTranslucency;                       // 0x878(0x1)
	bool                                                         bEnableResponsiveAA;                               // 0x878(0x1)
	bool                                                         bScreenSpaceReflections;                           // 0x878(0x1)
	bool                                                         TwoSided;                                          // 0x878(0x1)
	bool                                                         DitheredLODTransition;                             // 0x878(0x1)
	char                                                         pad0x3_Y6KQI[0x3];                                 // 0x879(0x3)
	byte                                                         ConstantMaterial;                                  // 0x87c(0x1)
	char                                                         pad0x3_QZQ53[0x3];                                 // 0x87d(0x3)
	float                                                        SkyLightWhenOccluded;                              // 0x880(0x4)
	float                                                        CloudShadowsInfluence;                             // 0x884(0x4)
	int                                                          NumCustomizedUVs;                                  // 0x888(0x4)
	byte                                                         TranslucencyLightingMode;                          // 0x88c(0x1)
	char                                                         pad0x3_T0HXR[0x3];                                 // 0x88d(0x3)
	float                                                        TranslucencyDirectionalLightingIntensity;          // 0x890(0x4)
	float                                                        LightColorInfluence;                               // 0x894(0x4)
	float                                                        AmbientLightColorInfluence;                        // 0x898(0x4)
	float                                                        LightIntensityInfluence;                           // 0x89c(0x4)
	float                                                        AmbientLightIntensityInfluence;                    // 0x8a0(0x4)
	float                                                        AlternativeAmbientLightColorInfluence;             // 0x8a4(0x4)
	float                                                        AlternativeAmbientLightIntensityInfluence;         // 0x8a8(0x4)
	bool                                                         bEvaluateLightningAtParticleCenter;                // 0x8ac(0x1)
	char                                                         pad0x3_N5764[0x3];                                 // 0x8ad(0x3)
	float                                                        TranslucencyScaleForReflection;                    // 0x8b0(0x4)
	bool                                                         bObjectFadeEnabled;                                // 0x8b4(0x1)
	char                                                         pad0x3_0NBZE[0x3];                                 // 0x8b5(0x3)
	float                                                        ObjectFadeRate;                                    // 0x8b8(0x4)
	float                                                        ObjectFadeDistanceThreshold;                       // 0x8bc(0x4)
	float                                                        TranslucentShadowDensityScale;                     // 0x8c0(0x4)
	float                                                        TranslucentSelfShadowDensityScale;                 // 0x8c4(0x4)
	float                                                        TranslucentSelfShadowSecondDensityScale;           // 0x8c8(0x4)
	float                                                        TranslucentSelfShadowSecondOpacity;                // 0x8cc(0x4)
	float                                                        TranslucentBackscatteringExponent;                 // 0x8d0(0x4)
	struct LinearColor                                           TranslucentMultipleScatteringExtinction;           // 0x8d4(0x10)
	float                                                        TranslucentShadowStartOffset;                      // 0x8e4(0x4)
	float                                                        VolumeFogScale;                                    // 0x8e8(0x4)
	bool                                                         DistanceFog;                                       // 0x8ec(0x1)
	bool                                                         bDisableDepthTest;                                 // 0x8ec(0x1)
	bool                                                         bGenerateSphericalParticleNormals;                 // 0x8ec(0x1)
	bool                                                         bDontRenderWhenPlayerInsideShip;                   // 0x8ec(0x1)
	bool                                                         bTangentSpaceNormal;                               // 0x8ec(0x1)
	bool                                                         bUseEmissiveForDynamicAreaLighting;                // 0x8ec(0x1)
	bool                                                         bBlockGI;                                          // 0x8ec(0x1)
	bool                                                         bUsedAsSpecialEngineMaterial;                      // 0x8ec(0x1)
	bool                                                         bUsedWithSkeletalMesh;                             // 0x8ed(0x1)
	bool                                                         bUsedWithEditorCompositing;                        // 0x8ed(0x1)
	bool                                                         bUsedWithLandscape;                                // 0x8ed(0x1)
	bool                                                         bUsedWithParticleSprites;                          // 0x8ed(0x1)
	bool                                                         bUsedWithCPUParticleSprites;                       // 0x8ed(0x1)
	bool                                                         bUsedWithStaticMesh;                               // 0x8ed(0x1)
	bool                                                         bUsedWithCoverage;                                 // 0x8ed(0x1)
	bool                                                         bUsedWithGPUInstanceCulling;                       // 0x8ed(0x1)
	bool                                                         bUsedWithBeamTrails;                               // 0x8ee(0x1)
	bool                                                         bUsedWithMeshParticles;                            // 0x8ee(0x1)
	bool                                                         bUsedWithStaticLighting;                           // 0x8ee(0x1)
	bool                                                         bUsedWithFluidSurfaces;                            // 0x8ee(0x1)
	bool                                                         bUsedWithMorphTargets;                             // 0x8ee(0x1)
	bool                                                         bUsedWithSplineMeshes;                             // 0x8ee(0x1)
	bool                                                         bUsedWithInstancedStaticMeshes;                    // 0x8ee(0x1)
	bool                                                         bUsesDistortion;                                   // 0x8ee(0x1)
	bool                                                         bUsedWithClothing;                                 // 0x8ef(0x1)
	bool                                                         bUsedWithDeformables;                              // 0x8ef(0x1)
	bool                                                         bUsedWithFFTWaterMask;                             // 0x8ef(0x1)
	bool                                                         bUsedWithVolumeFogMask;                            // 0x8ef(0x1)
	bool                                                         bUsedWithDynamicObjectFading;                      // 0x8ef(0x1)
	bool                                                         bUsedWithWaterBoundary;                            // 0x8ef(0x1)
	bool                                                         bUsedWithClouds;                                   // 0x8ef(0x1)
	bool                                                         bUsedWithInstancedRopes;                           // 0x8ef(0x1)
	bool                                                         bUsedWithPlanarReflection;                         // 0x8f0(0x1)
	bool                                                         bUsedWithPointLightShadows;                        // 0x8f0(0x1)
	bool                                                         bUsedWithMaskPass;                                 // 0x8f0(0x1)
	bool                                                         bUsedWithUI;                                       // 0x8f0(0x1)
	bool                                                         bAutomaticallySetUsageInEditor;                    // 0x8f0(0x1)
	bool                                                         bAllowEmissiveOnLandscape;                         // 0x8f0(0x1)
	bool                                                         bApplyWaterMask;                                   // 0x8f0(0x1)
	bool                                                         bUseReZ;                                           // 0x8f0(0x1)
	bool                                                         bFullyRough;                                       // 0x8f1(0x1)
	bool                                                         bUseLightmapDirectionality;                        // 0x8f1(0x1)
	char                                                         pad0x2_Q3D4W[0x2];                                 // 0x8f2(0x2)
	byte                                                         GeometryMode;                                      // 0x8f4(0x1)
	byte                                                         D3D11TessellationMode;                             // 0x8f5(0x1)
	char                                                         pad0x2_IAHG7[0x2];                                 // 0x8f6(0x2)
	bool                                                         bEnableCrackFreeDisplacement;                      // 0x8f8(0x1)
	bool                                                         bEnableAdaptiveTessellation;                       // 0x8f8(0x1)
	char                                                         pad0x3_TYZ6L[0x3];                                 // 0x8f9(0x3)
	float                                                        MaxDisplacement;                                   // 0x8fc(0x4)
	bool                                                         Wireframe;                                         // 0x900(0x1)
	bool                                                         bOutputVelocityOnBasePass;                         // 0x900(0x1)
	char                                                         pad0x3_AFQHX[0x3];                                 // 0x901(0x3)
	float                                                        NormalOffsetShadowBiasScale;                       // 0x904(0x4)
	int                                                          EditorX;                                           // 0x908(0x4)
	int                                                          EditorY;                                           // 0x90c(0x4)
	int                                                          EditorPitch;                                       // 0x910(0x4)
	int                                                          EditorYaw;                                         // 0x914(0x4)
	TArray<class MaterialExpression*>                            Expressions;                                       // 0x918(0x10)
	TArray<struct MaterialFunctionInfo>                          MaterialFunctionInfos;                             // 0x928(0x10)
	TArray<struct MaterialParameterCollectionInfo>               MaterialParameterCollectionInfos;                  // 0x938(0x10)
	bool                                                         bCanMaskedBeAssumedOpaque;                         // 0x948(0x1)
	bool                                                         bIsMasked;                                         // 0x948(0x1)
	bool                                                         bIsPreviewMaterial;                                // 0x948(0x1)
	bool                                                         bUseMaterialAttributes;                            // 0x948(0x1)
	bool                                                         bUseTranslucencyVertexFog;                         // 0x948(0x1)
	bool                                                         bUseDensityMapOnTranslucencyVertexFog;             // 0x948(0x1)
	bool                                                         bAllowDevelopmentShaderCompile;                    // 0x948(0x1)
	bool                                                         bIsMaterialEditorStatsMaterial;                    // 0x948(0x1)
	char                                                         pad0x3_AQLRJ[0x3];                                 // 0x949(0x3)
	byte                                                         BlendableLocation;                                 // 0x950(0x1)
	char                                                         pad0x3_L8TXH[0x3];                                 // 0x951(0x3)
	int                                                          BlendablePriority;                                 // 0x954(0x4)
	bool                                                         bIsAlphaBlended;                                   // 0x958(0x1)
	char                                                         pad0x3_TGH6U[0x3];                                 // 0x959(0x3)
	float                                                        RefractionDepthBias;                               // 0x95c(0x4)
	struct Guid                                                  StateId;                                           // 0x960(0x10)
	int                                                          UnwrappedUVSet;                                    // 0x970(0x4)
	char                                                         pad0x8c_R5G0B[0x8c];                               // 0x974(0x8c)
	TArray<class Texture*>                                       ExpressionTextureReferences;                       // 0xa00(0x10)
	char                                                         pad0x8_2NCC5[0x8];                                 // 0xa10(0x8)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class CameraModifier: public Object
{
public:
	bool                                                         bDebug;                                            // 0x28(0x1)
	bool                                                         bExclusive;                                        // 0x28(0x1)
	char                                                         pad0x3_OZCSI[0x3];                                 // 0x29(0x3)
	byte                                                         Priority;                                          // 0x2c(0x1)
	char                                                         pad0x3_34ZG9[0x3];                                 // 0x2d(0x3)
	class PlayerCameraManager*                                   CameraOwner;                                       // 0x30(0x8)
	float                                                        AlphaInTime;                                       // 0x38(0x4)
	float                                                        AlphaOutTime;                                      // 0x3c(0x4)
	float                                                        Alpha;                                             // 0x40(0x4)
	bool                                                         bAutoDestroyOnCompletion;                          // 0x44(0x1)
	char                                                         pad0x3_7Y11E[0x3];                                 // 0x45(0x3)
};


// Size 0x10 (Full Size[0x410] - InheritedSize[0x400]
class PhysicsVolume: public Volume
{
public:
	float                                                        TerminalVelocity;                                  // 0x400(0x4)
	int                                                          Priority;                                          // 0x404(0x4)
	float                                                        FluidFriction;                                     // 0x408(0x4)
	bool                                                         bWaterVolume;                                      // 0x40c(0x1)
	bool                                                         bPhysicsOnContact;                                 // 0x40c(0x1)
	char                                                         pad0x3_3JZFY[0x3];                                 // 0x40d(0x3)
};


// Size 0x2f0 (Full Size[0x8b0] - InheritedSize[0x5c0]
class ParticleSystemComponent: public PrimitiveComponent
{
public:
	class ParticleSystem*                                        Template;                                          // 0x5b8(0x8)
	TArray<class MaterialInterface*>                             EmitterMaterials;                                  // 0x5c0(0x10)
	TArray<class SkeletalMeshComponent*>                         SkelMeshComponents;                                // 0x5d0(0x10)
	bool                                                         bResetOnDetach;                                    // 0x5e0(0x1)
	bool                                                         bUpdateOnDedicatedServer;                          // 0x5e0(0x1)
	char                                                         pad0x7_LY5NR[0x7];                                 // 0x5e1(0x7)
	TArray<struct ParticleSysParam>                              InstanceParameters;                                // 0x5e8(0x10)
	struct ParticleSysParam                                      EmitterPointParameter;                             // 0x5f8(0x50)
	struct Vector                                                OldPosition;                                       // 0x688(0xc)
	struct Vector                                                PartSysVelocity;                                   // 0x694(0xc)
	char                                                         pad0x18_IL7CS[0x18];                               // 0x6a0(0x18)
	struct Vector                                                CustomInheritedVelocity;                           // 0x6b8(0xc)
	char                                                         pad0x14_SYHGS[0x14];                               // 0x6c4(0x14)
	float                                                        CustomParameterDrivingCurves;                      // 0x6d8(0x4)
	struct LinearColor                                           ColourTint;                                        // 0x6dc(0x10)
	float                                                        WarmUpTime;                                        // 0x6ec(0x4)
	float                                                        WarmupTickRate;                                    // 0x6f0(0x4)
	bool                                                         bWarmingUp;                                        // 0x6f4(0x1)
	char                                                         pad0x1b_P3QCJ[0x1b];                               // 0x6f5(0x1b)
	float                                                        SecondsBeforeInactive;                             // 0x710(0x4)
	char                                                         pad0x8_IVGEK[0x8];                                 // 0x714(0x8)
	float                                                        MaxTimeBeforeForceUpdateTransform;                 // 0x71c(0x4)
	char                                                         pad0x4_ZZWX9[0x4];                                 // 0x720(0x4)
	bool                                                         bOverrideLODMethod;                                // 0x724(0x1)
	char                                                         pad0x3_IVPA5[0x3];                                 // 0x725(0x3)
	byte                                                         LODMethod;                                         // 0x728(0x1)
	char                                                         pad0x3_ER740[0x3];                                 // 0x729(0x3)
	bool                                                         bSkipUpdateDynamicDataDuringTick;                  // 0x72c(0x1)
	char                                                         pad0x3_JAT5K[0x3];                                 // 0x72d(0x3)
	TArray<struct MaterialRelevance>                             CachedViewRelevanceFlags;                          // 0x730(0x10)
	char                                                         pad0x8_69QMV[0x8];                                 // 0x740(0x8)
	TArray<class ParticleSystemReplay*>                          ReplayClips;                                       // 0x748(0x10)
	char                                                         pad0x60_7JXC1[0x60];                               // 0x758(0x60)
	float                                                        CustomTimeDilation;                                // 0x7b8(0x4)
	char                                                         pad0x4_GUOC3[0x4];                                 // 0x7bc(0x4)
	bool                                                         bUnbound;                                          // 0x7d0(0x1)
	char                                                         pad0xdf_PJN7W[0xdf];                               // 0x7d1(0xdf)
};


// Size 0x80 (Full Size[0x640] - InheritedSize[0x5c0]
class SplineComponent: public PrimitiveComponent
{
public:
	struct InterpCurveVector                                     SplineInfo;                                        // 0x5b8(0x18)
	struct InterpCurveQuat                                       SplineRotInfo;                                     // 0x5d0(0x18)
	struct InterpCurveVector                                     SplineScaleInfo;                                   // 0x5e8(0x18)
	struct InterpCurveFloat                                      SplineReparamTable;                                // 0x600(0x18)
	bool                                                         bAllowSplineEditingPerInstance;                    // 0x618(0x1)
	char                                                         pad0x3_M1NO9[0x3];                                 // 0x619(0x3)
	int                                                          ReparamStepsPerSegment;                            // 0x61c(0x4)
	float                                                        Duration;                                          // 0x620(0x4)
	bool                                                         bStationaryEndpoints;                              // 0x624(0x1)
	bool                                                         bSplineHasBeenEdited;                              // 0x625(0x1)
	bool                                                         bClosedLoop;                                       // 0x626(0x1)
	char                                                         pad0x1_K91XL[0x1];                                 // 0x627(0x1)
	struct Vector                                                DefaultUpVector;                                   // 0x628(0xc)
	char                                                         pad0xc_70DOI[0xc];                                 // 0x634(0xc)
};


// Size 0x20 (Full Size[0x5e0] - InheritedSize[0x5c0]
class ShapeComponent: public PrimitiveComponent
{
public:
	struct Color                                                 ShapeColor;                                        // 0x5b8(0x4)
	char                                                         pad0x4_NSUJF[0x4];                                 // 0x5bc(0x4)
	class BodySetup*                                             ShapeBodySetup;                                    // 0x5c0(0x8)
	bool                                                         bDrawOnlyIfSelected;                               // 0x5c8(0x1)
	bool                                                         bShouldCollideWhenPlacing;                         // 0x5c8(0x1)
	bool                                                         bDynamicObstacle;                                  // 0x5c8(0x1)
	char                                                         pad0x7_QMTYG[0x7];                                 // 0x5c9(0x7)
	class UClass*                                                AreaClass;                                         // 0x5d0(0x8)
	char                                                         pad0x8_R7MWT[0x8];                                 // 0x5d8(0x8)
};


// Size 0x0 (Full Size[0x5e0] - InheritedSize[0x5e0]
class CapsuleComponent: public ShapeComponent
{
public:
	float                                                        CapsuleHalfHeight;                                 // 0x5d8(0x4)
	float                                                        CapsuleRadius;                                     // 0x5dc(0x4)
};


// Size 0x8 (Full Size[0x140] - InheritedSize[0x138]
class TextureProxy: public Texture
{
public:
	class Texture*                                               Texture;                                           // 0x138(0x8)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class Commandlet: public Object
{
public:
	struct FString                                               HelpDescription;                                   // 0x28(0x10)
	struct FString                                               HelpUsage;                                         // 0x38(0x10)
	struct FString                                               HelpWebLink;                                       // 0x48(0x10)
	TArray<Str HelpParamNames>                                   HelpParamNames;                                    // 0x58(0x10)
	TArray<Str HelpParamDescriptions>                            HelpParamDescriptions;                             // 0x68(0x10)
	bool                                                         IsServer;                                          // 0x78(0x1)
	bool                                                         IsClient;                                          // 0x78(0x1)
	bool                                                         IsEditor;                                          // 0x78(0x1)
	bool                                                         LogToConsole;                                      // 0x78(0x1)
	bool                                                         ShowErrorCount;                                    // 0x78(0x1)
	char                                                         pad0x7_7CZXO[0x7];                                 // 0x79(0x7)
};


// Size 0xb0 (Full Size[0x6d0] - InheritedSize[0x620]
class InstancedStaticMeshComponent: public StaticMeshComponent
{
public:
	TArray<struct InstancedStaticMeshInstanceData>               PerInstanceSMData;                                 // 0x620(0x10)
	int                                                          InstancingRandomSeed;                              // 0x630(0x4)
	int                                                          InstanceStartCullDistance;                         // 0x634(0x4)
	int                                                          InstanceEndCullDistance;                           // 0x638(0x4)
	char                                                         pad0x4_CBRXT[0x4];                                 // 0x63c(0x4)
	TArray<Int InstanceReorderTable>                             InstanceReorderTable;                              // 0x640(0x10)
	TArray<Int RemovedInstances>                                 RemovedInstances;                                  // 0x650(0x10)
	char                                                         pad0x48_U4Z9Z[0x48];                               // 0x660(0x48)
	class PhysicsSerializer*                                     PhysicsSerializer;                                 // 0x6a8(0x8)
	int                                                          NumPendingLightmaps;                               // 0x6b0(0x4)
	char                                                         pad0x4_9313A[0x4];                                 // 0x6b4(0x4)
	TArray<struct InstancedStaticMeshMappingInfo>                CachedMappings;                                    // 0x6b8(0x10)
	char                                                         pad0x8_P6BYW[0x8];                                 // 0x6c8(0x8)
};


// Size 0xd0 (Full Size[0x7a0] - InheritedSize[0x6d0]
class HierarchicalInstancedStaticMeshComponent: public InstancedStaticMeshComponent
{
public:
	char                                                         pad0x40_BKTBG[0x40];                               // 0x6d0(0x40)
	TArray<Int SortedInstances>                                  SortedInstances;                                   // 0x710(0x10)
	int                                                          NumBuiltInstances;                                 // 0x720(0x4)
	struct Box                                                   BuiltInstanceBounds;                               // 0x724(0x1c)
	struct Box                                                   UnbuiltInstanceBounds;                             // 0x740(0x1c)
	char                                                         pad0x4_6L1LZ[0x4];                                 // 0x75c(0x4)
	TArray<struct Box>                                           UnbuiltInstanceBoundsList;                         // 0x760(0x10)
	int                                                          OcclusionLayerNumNodes;                            // 0x770(0x4)
	char                                                         pad0x2_W8F6W[0x2];                                 // 0x774(0x2)
	bool                                                         bDisableCollision;                                 // 0x776(0x1)
	char                                                         pad0x29_1ICOK[0x29];                               // 0x777(0x29)
};


// Size 0x160 (Full Size[0x1b8] - InheritedSize[0x58]
class MaterialInstance: public MaterialInterface
{
public:
	class PhysicalMaterial*                                      PhysMaterial;                                      // 0x58(0x8)
	class MaterialInterface*                                     Parent;                                            // 0x60(0x8)
	bool                                                         bHasStaticPermutationResource;                     // 0x68(0x1)
	bool                                                         bOverrideSubsurfaceProfile;                        // 0x68(0x1)
	char                                                         pad0x7_3NZZT[0x7];                                 // 0x69(0x7)
	struct Guid                                                  ParentLightingGuid;                                // 0x70(0x10)
	TArray<struct FontParameterValue>                            FontParameterValues;                               // 0x80(0x10)
	TArray<struct ScalarParameterValue>                          ScalarParameterValues;                             // 0x90(0x10)
	TArray<struct TextureParameterValue>                         TextureParameterValues;                            // 0xa0(0x10)
	TArray<struct VectorParameterValue>                          VectorParameterValues;                             // 0xb0(0x10)
	struct MaterialInstanceBasePropertyOverrides                 BasePropertyOverrides;                             // 0xc0(0x84)
	char                                                         pad0x74_79LO1[0x74];                               // 0x144(0x74)
};


// Size 0x0 (Full Size[0x1b8] - InheritedSize[0x1b8]
class MaterialInstanceConstant: public MaterialInstance
{
public:
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class MaterialExpression: public Object
{
public:
	class Material*                                              Material;                                          // 0x28(0x8)
	class MaterialFunction*                                      Function;                                          // 0x30(0x8)
	struct FString                                               Desc;                                              // 0x38(0x10)
	struct Color                                                 BorderColor;                                       // 0x48(0x4)
	bool                                                         bRealtimePreview;                                  // 0x4c(0x1)
	bool                                                         bNeedToUpdatePreview;                              // 0x4c(0x1)
	bool                                                         bIsParameterExpression;                            // 0x4c(0x1)
	bool                                                         bCommentBubbleVisible;                             // 0x4c(0x1)
	bool                                                         bShowOutputNameOnPin;                              // 0x4c(0x1)
	bool                                                         bHidePreviewWindow;                                // 0x4c(0x1)
	bool                                                         bCollapsed;                                        // 0x4c(0x1)
	bool                                                         bShaderInputData;                                  // 0x4c(0x1)
	bool                                                         bShowInputs;                                       // 0x4d(0x1)
	bool                                                         bShowOutputs;                                      // 0x4d(0x1)
	char                                                         pad0x2_GENME[0x2];                                 // 0x4e(0x2)
	TArray<struct FText>                                         MenuCategories;                                    // 0x50(0x10)
	TArray<struct ExpressionOutput>                              Outputs;                                           // 0x60(0x10)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionCustomOutput: public MaterialExpression
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlueprintAsyncActionBase: public Object
{
public:
};


// Size 0x68 (Full Size[0x228] - InheritedSize[0x1c0]
class BlueprintGeneratedClass: public Class
{
public:
	int                                                          NumReplicatedProperties;                           // 0x1c0(0x4)
	char                                                         pad0x4_ATPMD[0x4];                                 // 0x1c4(0x4)
	TArray<class DynamicBlueprintBinding*>                       DynamicBindingObjects;                             // 0x1c8(0x10)
	TArray<class ActorComponent*>                                ComponentTemplates;                                // 0x1d8(0x10)
	TArray<class TimelineTemplate*>                              Timelines;                                         // 0x1e8(0x10)
	class SimpleConstructionScript*                              SimpleConstructionScript;                          // 0x1f8(0x8)
	class InheritableComponentHandler*                           InheritableComponentHandler;                       // 0x200(0x8)
	class StructProperty*                                        UberGraphFramePointerProperty;                     // 0x208(0x8)
	class Function*                                              UberGraphFunction;                                 // 0x210(0x8)
	TArray<struct EventGraphFastCallPair>                        FastCallPairs;                                     // 0x218(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AISystemBase: public Object
{
public:
	struct StringClassReference                                  AISystemClassName;                                 // 0x28(0x10)
	struct FName                                                 AISystemModuleName;                                // 0x38(0x8)
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class UserDefinedStruct: public ScriptStruct
{
public:
	struct Guid                                                  Guid;                                              // 0x98(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class Player: public Object
{
public:
	char                                                         pad0x8_TLO85[0x8];                                 // 0x28(0x8)
	class PlayerController*                                      PlayerController;                                  // 0x30(0x8)
	int                                                          CurrentNetSpeed;                                   // 0x38(0x4)
	int                                                          ConfiguredInternetSpeed;                           // 0x3c(0x4)
	int                                                          ConfiguredLanSpeed;                                // 0x40(0x4)
	char                                                         pad0x4_8X3QT[0x4];                                 // 0x44(0x4)
};


// Size 0x34558 (Full Size[0x345a0] - InheritedSize[0x48]
class NetConnection: public Player
{
public:
	char                                                         pad0x8_GK4Y9[0x8];                                 // 0x48(0x8)
	TArray<class ChildConnection*>                               Children;                                          // 0x50(0x10)
	class NetDriver*                                             Driver;                                            // 0x60(0x8)
	class PackageMap*                                            PackageMap;                                        // 0x68(0x8)
	TArray<class Channel*>                                       OpenChannels;                                      // 0x70(0x10)
	TArray<class Actor*>                                         SentTemporaries;                                   // 0x80(0x10)
	class Actor*                                                 ViewTarget;                                        // 0x90(0x8)
	class Actor*                                                 OwningActor;                                       // 0x98(0x8)
	int                                                          MaxPacket;                                         // 0xa0(0x4)
	bool                                                         InternalAck;                                       // 0xa4(0x1)
	char                                                         pad0x2fb_HCGPT[0x2fb];                             // 0xa5(0x2fb)
	double                                                       LastReceiveTime;                                   // 0x3a0(0x8)
	char                                                         pad0x340b0_LKXST[0x340b0];                         // 0x3a8(0x340b0)
	TArray<class Actor*>                                         ConsideredActorsList;                              // 0x34458(0x10)
	char                                                         pad0x10_N9FV9[0x10];                               // 0x34468(0x10)
	int                                                          MaxDormantActorsCheckedFromRelevancy;              // 0x34478(0x4)
	char                                                         pad0x5c_WDKI2[0x5c];                               // 0x3447c(0x5c)
	TArray<class Channel*>                                       DeferredCloseChannels;                             // 0x344d8(0x10)
	char                                                         pad0xb8_7J241[0xb8];                               // 0x344e8(0xb8)
};


// Size 0x450 (Full Size[0x478] - InheritedSize[0x28]
class NetDriver: public Object
{
public:
	char                                                         pad0x10_0VNDY[0x10];                               // 0x28(0x10)
	struct FString                                               NetConnectionClassName;                            // 0x38(0x10)
	int                                                          MaxDownloadSize;                                   // 0x48(0x4)
	bool                                                         bClampListenServerTickRate;                        // 0x4c(0x1)
	char                                                         pad0x3_3OF47[0x3];                                 // 0x4d(0x3)
	int                                                          NetServerMaxTickRate;                              // 0x50(0x4)
	int                                                          MaxInternetClientRate;                             // 0x54(0x4)
	int                                                          MaxClientRate;                                     // 0x58(0x4)
	float                                                        ServerTravelPause;                                 // 0x5c(0x4)
	float                                                        SpawnPrioritySeconds;                              // 0x60(0x4)
	float                                                        RelevantTimeout;                                   // 0x64(0x4)
	float                                                        KeepAliveTime;                                     // 0x68(0x4)
	float                                                        InitialConnectTimeout;                             // 0x6c(0x4)
	float                                                        ConnectionTimeout;                                 // 0x70(0x4)
	char                                                         pad0x4_N5XJ0[0x4];                                 // 0x74(0x4)
	class NetConnection*                                         ServerConnection;                                  // 0x78(0x8)
	TArray<class NetConnection*>                                 ClientConnections;                                 // 0x80(0x10)
	class World*                                                 World;                                             // 0x90(0x8)
	char                                                         pad0x30_EZXI3[0x30];                               // 0x98(0x30)
	class UClass*                                                NetConnectionClass;                                // 0xc8(0x8)
	class Property*                                              RoleProperty;                                      // 0xd0(0x8)
	class Property*                                              RemoteRoleProperty;                                // 0xd8(0x8)
	struct FName                                                 NetDriverName;                                     // 0xe0(0x8)
	char                                                         pad0x390_7II9M[0x390];                             // 0xe8(0x390)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OnlineSession: public Object
{
public:
};


// Size 0x550 (Full Size[0x578] - InheritedSize[0x28]
class Model: public Object
{
public:
	char                                                         pad0x550_R4A5O[0x550];                             // 0x28(0x550)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class EdGraphNode: public Object
{
public:
	TArray<class EdGraphPin*>                                    Pins;                                              // 0x28(0x10)
	int                                                          NodePosX;                                          // 0x38(0x4)
	int                                                          NodePosY;                                          // 0x3c(0x4)
	int                                                          NodeWidth;                                         // 0x40(0x4)
	int                                                          NodeHeight;                                        // 0x44(0x4)
	bool                                                         bHasCompilerMessage;                               // 0x48(0x1)
	char                                                         pad0x7_7CJMI[0x7];                                 // 0x49(0x7)
	struct FString                                               NodeComment;                                       // 0x50(0x10)
	bool                                                         bCommentBubblePinned;                              // 0x60(0x1)
	bool                                                         bCommentBubbleVisible;                             // 0x61(0x1)
	char                                                         pad0x2_V8VS1[0x2];                                 // 0x62(0x2)
	int                                                          ErrorType;                                         // 0x64(0x4)
	struct FString                                               ErrorMsg;                                          // 0x68(0x10)
	struct Guid                                                  NodeGuid;                                          // 0x78(0x10)
	byte                                                         AdvancedPinDisplay;                                // 0x88(0x1)
	bool                                                         bIsNodeEnabled;                                    // 0x89(0x1)
	bool                                                         bIsDebugFunction;                                  // 0x8a(0x1)
	char                                                         pad0x5_H29NV[0x5];                                 // 0x8b(0x5)
};


// Size 0x100 (Full Size[0x128] - InheritedSize[0x28]
class EdGraphPin: public Object
{
public:
	struct FString                                               PinName;                                           // 0x28(0x10)
	struct FString                                               PinToolTip;                                        // 0x38(0x10)
	byte                                                         Direction;                                         // 0x48(0x1)
	char                                                         pad0x7_OJ9D4[0x7];                                 // 0x49(0x7)
	struct EdGraphPinType                                        PinType;                                           // 0x50(0x50)
	struct FString                                               DefaultValue;                                      // 0xa0(0x10)
	struct FString                                               AutogeneratedDefaultValue;                         // 0xb0(0x10)
	class Object*                                                DefaultObject;                                     // 0xc0(0x8)
	struct FText                                                 DefaultTextValue;                                  // 0xc8(0x38)
	TArray<class EdGraphPin*>                                    LinkedTo;                                          // 0x100(0x10)
	TArray<class EdGraphPin*>                                    SubPins;                                           // 0x110(0x10)
	class EdGraphPin*                                            ParentPin;                                         // 0x120(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EngineBaseTypes: public Object
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class DamageType: public Object
{
public:
	bool                                                         bCausedByWorld;                                    // 0x28(0x1)
	bool                                                         bScaleMomentumByMass;                              // 0x28(0x1)
	char                                                         pad0x3_KO5DI[0x3];                                 // 0x29(0x3)
	float                                                        DamageImpulse;                                     // 0x2c(0x4)
	bool                                                         bRadialDamageVelChange;                            // 0x30(0x1)
	char                                                         pad0x3_ALHJ5[0x3];                                 // 0x31(0x3)
	float                                                        DestructibleImpulse;                               // 0x34(0x4)
	float                                                        DestructibleDamageSpreadScale;                     // 0x38(0x4)
	float                                                        DamageFalloff;                                     // 0x3c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EngineTypes: public Object
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class BlueprintCore: public Object
{
public:
	class UClass*                                                SkeletonGeneratedClass;                            // 0x28(0x8)
	class UClass*                                                GeneratedClass;                                    // 0x30(0x8)
	bool                                                         bLegacyNeedToPurgeSkelRefs;                        // 0x38(0x1)
	bool                                                         bLegacyGeneratedClassIsAuthoritative;              // 0x39(0x1)
	char                                                         pad0x2_BBJIR[0x2];                                 // 0x3a(0x2)
	struct Guid                                                  BlueprintGuid;                                     // 0x3c(0x10)
	char                                                         pad0x4_FMFAL[0x4];                                 // 0x4c(0x4)
};


// Size 0x88 (Full Size[0xd8] - InheritedSize[0x50]
class Blueprint: public BlueprintCore
{
public:
	bool                                                         bRecompileOnLoad;                                  // 0x50(0x1)
	char                                                         pad0x7_A8O6D[0x7];                                 // 0x51(0x7)
	class UClass*                                                ParentClass;                                       // 0x58(0x8)
	class Object*                                                PRIVATE_InnermostPreviousCDO;                      // 0x60(0x8)
	bool                                                         bHasBeenRegenerated;                               // 0x68(0x1)
	bool                                                         bIsRegeneratingOnLoad;                             // 0x68(0x1)
	char                                                         pad0x7_RFE8T[0x7];                                 // 0x69(0x7)
	class SimpleConstructionScript*                              SimpleConstructionScript;                          // 0x70(0x8)
	TArray<class ActorComponent*>                                ComponentTemplates;                                // 0x78(0x10)
	TArray<class TimelineTemplate*>                              Timelines;                                         // 0x88(0x10)
	class InheritableComponentHandler*                           InheritableComponentHandler;                       // 0x98(0x8)
	byte                                                         BlueprintType;                                     // 0xa0(0x1)
	char                                                         pad0x3_07ZZU[0x3];                                 // 0xa1(0x3)
	int                                                          BlueprintSystemVersion;                            // 0xa4(0x4)
	char                                                         pad0x30_656R0[0x30];                               // 0xa8(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_AssetUserData: public Interface
{
public:
};


// Size 0x20 (Full Size[0x300] - InheritedSize[0x2e0]
class ChildActorComponent: public SceneComponent
{
public:
	class UClass*                                                ChildActorClass;                                   // 0x2e0(0x8)
	class Actor*                                                 ChildActor;                                        // 0x2e8(0x8)
	char                                                         pad0x10_ERWI1[0x10];                               // 0x2f0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TestInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DerivedTestInterface: public TestInterface
{
public:
};


// Size 0x8 (Full Size[0xd0] - InheritedSize[0xc8]
class ComponentWithDerivedTestInterface: public ActorComponent
{
public:
	char                                                         pad0x8_13ZHX[0x8];                                 // 0xc8(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class ActorWithComponentWithDerivedTestInterface: public Actor
{
public:
	class ComponentWithDerivedTestInterface*                     ComponentWithDerivedTestInterface;                 // 0x3c8(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class ActorWithTestInterface: public Actor
{
public:
	char                                                         pad0x8_GYFB0[0x8];                                 // 0x3c8(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class AmbientSound: public Actor
{
public:
	class AudioComponent*                                        AudioComponent;                                    // 0x3c8(0x8)
};


// Size 0x58 (Full Size[0x420] - InheritedSize[0x3c8]
class AutomaticInstancingActor: public Actor
{
public:
	class SceneComponent*                                        DummyRoot;                                         // 0x3c8(0x8)
	char                                                         pad0x50_7C11M[0x50];                               // 0x3d0(0x50)
};


// Size 0xd8 (Full Size[0x100] - InheritedSize[0x28]
class PendingNetGame: public Object
{
public:
	char                                                         pad0x8_K0OSD[0x8];                                 // 0x28(0x8)
	class NetDriver*                                             NetDriver;                                         // 0x30(0x8)
	char                                                         pad0xb0_E7IX4[0xb0];                               // 0x38(0xb0)
	class Package*                                               PreLoadedMapPackage;                               // 0xe8(0x8)
	class World*                                                 PreLoadedWorld;                                    // 0xf0(0x8)
	char                                                         pad0x8_AU5JW[0x8];                                 // 0xf8(0x8)
};


// Size 0x7b8 (Full Size[0x7e0] - InheritedSize[0x28]
class World: public Object
{
public:
	char                                                         pad0x8_0KRR7[0x8];                                 // 0x28(0x8)
	class Level*                                                 PersistentLevel;                                   // 0x30(0x8)
	class NetDriver*                                             NetDriver;                                         // 0x38(0x8)
	class LineBatchComponent*                                    LineBatcher;                                       // 0x40(0x8)
	class LineBatchComponent*                                    PersistentLineBatcher;                             // 0x48(0x8)
	class LineBatchComponent*                                    ForegroundLineBatcher;                             // 0x50(0x8)
	class GameState*                                             GameState;                                         // 0x58(0x8)
	class GameNetworkManager*                                    NetworkManager;                                    // 0x60(0x8)
	class PhysicsCollisionHandler*                               PhysicsCollisionHandler;                           // 0x68(0x8)
	TArray<class Object*>                                        ExtraReferencedObjects;                            // 0x70(0x10)
	TArray<class Object*>                                        PerModuleDataObjects;                              // 0x80(0x10)
	TArray<class LevelStreaming*>                                StreamingLevels;                                   // 0x90(0x10)
	struct FString                                               StreamingLevelsPrefix;                             // 0xa0(0x10)
	class Level*                                                 CurrentLevelPendingVisibility;                     // 0xb0(0x8)
	class ParticleEventManager*                                  MyParticleEventManager;                            // 0xb8(0x8)
	class PhysicsVolume*                                         DefaultPhysicsVolume;                              // 0xc0(0x8)
	TArray<class LevelStreaming*>                                DirtyStreamingLevels;                              // 0xc8(0x10)
	char                                                         pad0x1c_9FOAJ[0x1c];                               // 0xd8(0x1c)
	struct FName                                                 Feature;                                           // 0xf4(0x8)
	char                                                         pad0x4_2PSDO[0x4];                                 // 0xfc(0x4)
	TArray<struct FName>                                         FeatureReferences;                                 // 0x100(0x10)
	bool                                                         ParticleLOD_bUseGameThread;                        // 0x110(0x1)
	bool                                                         ParticleLOD_bUseMultipleViewportCase;              // 0x111(0x1)
	char                                                         pad0x2_AM4DV[0x2];                                 // 0x112(0x2)
	struct Vector                                                ParticleLOD_PlayerViewpointLocation;               // 0x114(0xc)
	struct FString                                               TestMetadata;                                      // 0x120(0x10)
	class NavigationSystem*                                      NavigationSystem;                                  // 0x130(0x8)
	class GameMode*                                              AuthorityGameMode;                                 // 0x138(0x8)
	class AISystemBase*                                          AISystem;                                          // 0x140(0x8)
	class AvoidanceManager*                                      AvoidanceManager;                                  // 0x148(0x8)
	TArray<class Level*>                                         Levels;                                            // 0x150(0x10)
	char                                                         pad0x50_UK0Y1[0x50];                               // 0x160(0x50)
	class Level*                                                 CurrentLevel;                                      // 0x1b0(0x8)
	char                                                         pad0x8_I44F4[0x8];                                 // 0x1b8(0x8)
	class GameInstance*                                          OwningGameInstance;                                // 0x1c0(0x8)
	TArray<class MaterialParameterCollectionInstance*>           ParameterCollectionInstances;                      // 0x1c8(0x10)
	char                                                         pad0x538_HSZCC[0x538];                             // 0x1d8(0x538)
	class WorldComposition*                                      WorldComposition;                                  // 0x710(0x8)
	char                                                         pad0x3d_FPHOJ[0x3d];                               // 0x718(0x3d)
	bool                                                         bAreConstraintsDirty;                              // 0x755(0x1)
	char                                                         pad0x8a_6KBZW[0x8a];                               // 0x756(0x8a)
};


// Size 0x2d8 (Full Size[0x300] - InheritedSize[0x28]
class Level: public Object
{
public:
	char                                                         pad0xa0_7HSBU[0xa0];                               // 0x28(0xa0)
	class LevelActorContainer*                                   ActorCluster;                                      // 0xc8(0x8)
	class World*                                                 OwningWorld;                                       // 0xd0(0x8)
	class Model*                                                 Model;                                             // 0xd8(0x8)
	TArray<class ModelComponent*>                                ModelComponents;                                   // 0xe0(0x10)
	class LevelScriptActor*                                      LevelScriptActor;                                  // 0xf0(0x8)
	class NavigationObjectBase*                                  NavListStart;                                      // 0xf8(0x8)
	class NavigationObjectBase*                                  NavListEnd;                                        // 0x100(0x8)
	TArray<class NavigationDataChunk*>                           NavDataChunks;                                     // 0x108(0x10)
	float                                                        LightmapTotalSize;                                 // 0x118(0x4)
	float                                                        ShadowmapTotalSize;                                // 0x11c(0x4)
	TArray<struct Vector>                                        StaticNavigableGeometry;                           // 0x120(0x10)
	char                                                         pad0x130_7QK2L[0x130];                             // 0x130(0x130)
	bool                                                         LevelVisibility;                                   // 0x260(0x1)
	char                                                         pad0xf_QKPIU[0xf];                                 // 0x261(0xf)
	bool                                                         Blocked;                                           // 0x270(0x1)
	char                                                         pad0x67_QJ6QA[0x67];                               // 0x271(0x67)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x2d8(0x10)
	char                                                         pad0x18_F13GK[0x18];                               // 0x2e8(0x18)
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class BrushShape: public Brush
{
public:
};


// Size 0x50 (Full Size[0x450] - InheritedSize[0x400]
class AudioVolume: public Volume
{
public:
	float                                                        Priority;                                          // 0x400(0x4)
	bool                                                         bEnabled;                                          // 0x404(0x1)
	char                                                         pad0x3_XY32K[0x3];                                 // 0x405(0x3)
	struct ReverbSettings                                        Settings;                                          // 0x408(0x18)
	struct InteriorSettings                                      AmbientZoneSettings;                               // 0x420(0x24)
	char                                                         pad0x4_AQSIE[0x4];                                 // 0x444(0x4)
	class AudioVolume*                                           NextLowerPriorityVolume;                           // 0x448(0x8)
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class CameraBlockingVolume: public Volume
{
public:
};


// Size 0x18 (Full Size[0x418] - InheritedSize[0x400]
class CullDistanceVolume: public Volume
{
public:
	TArray<struct CullDistanceSizePair>                          CullDistances;                                     // 0x400(0x10)
	bool                                                         bEnabled;                                          // 0x410(0x1)
	char                                                         pad0x7_35NL2[0x7];                                 // 0x411(0x7)
};


// Size 0x10 (Full Size[0x410] - InheritedSize[0x400]
class FFTWater: public Volume
{
public:
	class FFTWaterComponent*                                     FFTWaterComponent;                                 // 0x400(0x8)
	class FFTWaterExtendedPlaneComponent*                        ExtendedPlaneComponent;                            // 0x408(0x8)
};


// Size 0x18 (Full Size[0x418] - InheritedSize[0x400]
class LevelStreamingVolume: public Volume
{
public:
	TArray<struct FName>                                         StreamingLevelNames;                               // 0x400(0x10)
	bool                                                         bEditorPreVisOnly;                                 // 0x410(0x1)
	bool                                                         bDisabled;                                         // 0x410(0x1)
	char                                                         pad0x3_47PV3[0x3];                                 // 0x411(0x3)
	byte                                                         StreamingUsage;                                    // 0x414(0x1)
	char                                                         pad0x3_8UYUY[0x3];                                 // 0x415(0x3)
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class LightmassCharacterIndirectDetailVolume: public Volume
{
public:
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class LightmassImportanceVolume: public Volume
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavigationTypes: public Object
{
public:
};


// Size 0x10 (Full Size[0x410] - InheritedSize[0x400]
class NavMeshBoundsVolume: public Volume
{
public:
	struct NavAgentSelector                                      SupportedAgents;                                   // 0x400(0x4)
	struct FName                                                 OriginatingLevelName;                              // 0x404(0x8)
	char                                                         pad0x4_XNEXB[0x4];                                 // 0x40c(0x4)
};


// Size 0x0 (Full Size[0x410] - InheritedSize[0x410]
class InstancedNavMeshBoundsVolume: public NavMeshBoundsVolume
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class NavArea: public Object
{
public:
	float                                                        DefaultCost;                                       // 0x28(0x4)
	float                                                        FixedAreaEnteringCost;                             // 0x2c(0x4)
	struct Color                                                 DrawColor;                                         // 0x30(0x4)
	struct NavAgentSelector                                      SupportedAgents;                                   // 0x34(0x4)
	bool                                                         bSupportsAgent0;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent1;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent2;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent3;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent4;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent5;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent6;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent7;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent8;                                   // 0x39(0x1)
	bool                                                         bSupportsAgent9;                                   // 0x39(0x1)
	bool                                                         bSupportsAgent10;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent11;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent12;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent13;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent14;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent15;                                  // 0x39(0x1)
	char                                                         pad0x6_1G4CY[0x6];                                 // 0x3a(0x6)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavRelevantInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x410] - InheritedSize[0x400]
class NavModifierVolume: public Volume
{
public:
	char                                                         pad0x8_6TIZ6[0x8];                                 // 0x400(0x8)
	class UClass*                                                AreaClass;                                         // 0x408(0x8)
};


// Size 0x0 (Full Size[0x410] - InheritedSize[0x410]
class DefaultPhysicsVolume: public PhysicsVolume
{
public:
};


// Size 0x0 (Full Size[0x410] - InheritedSize[0x410]
class KillZVolume: public PhysicsVolume
{
public:
};


// Size 0x28 (Full Size[0x438] - InheritedSize[0x410]
class PainCausingVolume: public PhysicsVolume
{
public:
	bool                                                         bPainCausing;                                      // 0x410(0x1)
	char                                                         pad0x3_BYWGO[0x3];                                 // 0x411(0x3)
	float                                                        DamagePerSec;                                      // 0x414(0x4)
	class UClass*                                                DamageType;                                        // 0x418(0x8)
	float                                                        PainInterval;                                      // 0x420(0x4)
	bool                                                         bEntryPain;                                        // 0x424(0x1)
	bool                                                         BACKUP_bPainCausing;                               // 0x424(0x1)
	char                                                         pad0x3_JHZCY[0x3];                                 // 0x425(0x3)
	class Controller*                                            DamageInstigator;                                  // 0x428(0x8)
	char                                                         pad0x8_JIW3D[0x8];                                 // 0x430(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlendableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Scene: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_PostProcessVolume: public Interface
{
public:
};


// Size 0x560 (Full Size[0x960] - InheritedSize[0x400]
class PostProcessVolume: public Volume
{
public:
	char                                                         pad0x10_ZLXTQ[0x10];                               // 0x400(0x10)
	struct PostProcessSettings                                   Settings;                                          // 0x410(0x540)
	float                                                        Priority;                                          // 0x950(0x4)
	float                                                        BlendRadius;                                       // 0x954(0x4)
	float                                                        BlendWeight;                                       // 0x958(0x4)
	bool                                                         bEnabled;                                          // 0x95c(0x1)
	bool                                                         bUnbound;                                          // 0x95c(0x1)
	char                                                         pad0x3_UYDJ8[0x3];                                 // 0x95d(0x3)
};


// Size 0x30 (Full Size[0x430] - InheritedSize[0x400]
class PrecomputedVisibilityOverrideVolume: public Volume
{
public:
	TArray<class Actor*>                                         OverrideVisibleActors;                             // 0x400(0x10)
	TArray<class Actor*>                                         OverrideInvisibleActors;                           // 0x410(0x10)
	TArray<struct FName>                                         OverrideInvisibleLevels;                           // 0x420(0x10)
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class PrecomputedVisibilityVolume: public Volume
{
public:
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class TriggerVolume: public Volume
{
public:
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class CalmWaterZone: public Actor
{
public:
	class CalmWaterComponent*                                    CalmWaterComponent;                                // 0x3c8(0x8)
};


// Size 0x568 (Full Size[0x930] - InheritedSize[0x3c8]
class CameraActor: public Actor
{
public:
	byte                                                         AutoActivateForPlayer;                             // 0x3c8(0x1)
	char                                                         pad0x7_7LNDU[0x7];                                 // 0x3c9(0x7)
	class CameraComponent*                                       CameraComponent;                                   // 0x3d0(0x8)
	char                                                         pad0x8_2LFPK[0x8];                                 // 0x3d8(0x8)
	bool                                                         bConstrainAspectRatio;                             // 0x3e0(0x1)
	char                                                         pad0x3_TIR5N[0x3];                                 // 0x3e1(0x3)
	float                                                        AspectRatio;                                       // 0x3e4(0x4)
	float                                                        FOVAngle;                                          // 0x3e8(0x4)
	float                                                        PostProcessBlendWeight;                            // 0x3ec(0x4)
	struct PostProcessSettings                                   PostProcessSettings;                               // 0x3f0(0x540)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class ClientOnlyTestActor: public Actor
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavAgentInterface: public Interface
{
public:
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class CameraShake: public Object
{
public:
	bool                                                         bSingleInstance;                                   // 0x28(0x1)
	char                                                         pad0x3_KG10S[0x3];                                 // 0x29(0x3)
	float                                                        OscillationDuration;                               // 0x2c(0x4)
	float                                                        OscillationBlendInTime;                            // 0x30(0x4)
	float                                                        OscillationBlendOutTime;                           // 0x34(0x4)
	struct ROscillator                                           RotOscillation;                                    // 0x38(0x24)
	struct VOscillator                                           LocOscillation;                                    // 0x5c(0x24)
	struct FOscillator                                           FOVOscillation;                                    // 0x80(0xc)
	float                                                        AnimPlayRate;                                      // 0x8c(0x4)
	float                                                        AnimScale;                                         // 0x90(0x4)
	float                                                        AnimBlendInTime;                                   // 0x94(0x4)
	float                                                        AnimBlendOutTime;                                  // 0x98(0x4)
	float                                                        RandomAnimSegmentDuration;                         // 0x9c(0x4)
	class CameraAnim*                                            Anim;                                              // 0xa0(0x8)
	bool                                                         bRandomAnimSegment;                                // 0xa8(0x1)
	char                                                         pad0x17_UXPPO[0x17];                               // 0xa9(0x17)
	class PlayerCameraManager*                                   CameraOwner;                                       // 0xc0(0x8)
	char                                                         pad0x68_QK7A6[0x68];                               // 0xc8(0x68)
	float                                                        ShakeScale;                                        // 0x130(0x4)
	float                                                        OscillatorTimeRemaining;                           // 0x134(0x4)
	class CameraAnimInst*                                        AnimInst;                                          // 0x138(0x8)
};


// Size 0x1898 (Full Size[0x1c60] - InheritedSize[0x3c8]
class PlayerCameraManager: public Actor
{
public:
	class PlayerController*                                      PCOwner;                                           // 0x3c8(0x8)
	class SceneComponent*                                        TransformComponent;                                // 0x3d0(0x8)
	char                                                         pad0x8_3VBT6[0x8];                                 // 0x3d8(0x8)
	float                                                        DefaultFOV;                                        // 0x3e0(0x4)
	char                                                         pad0x4_ZGYRV[0x4];                                 // 0x3e4(0x4)
	float                                                        DefaultOrthoWidth;                                 // 0x3e8(0x4)
	char                                                         pad0x4_D340M[0x4];                                 // 0x3ec(0x4)
	float                                                        DefaultAspectRatio;                                // 0x3f0(0x4)
	char                                                         pad0x4c_VFFVO[0x4c];                               // 0x3f4(0x4c)
	struct CameraCacheEntry                                      CameraCache;                                       // 0x440(0x5b0)
	struct CameraCacheEntry                                      LastFrameCameraCache;                              // 0x9f0(0x5b0)
	struct TViewTarget                                           ViewTarget;                                        // 0xfa0(0x5c0)
	struct TViewTarget                                           PendingViewTarget;                                 // 0x1560(0x5c0)
	char                                                         pad0x30_W78TT[0x30];                               // 0x1b20(0x30)
	TArray<class CameraModifier*>                                ModifierList;                                      // 0x1b50(0x10)
	TArray<class Class*>                                         DefaultModifiers;                                  // 0x1b60(0x10)
	float                                                        FreeCamDistance;                                   // 0x1b70(0x4)
	struct Vector                                                FreeCamOffset;                                     // 0x1b74(0xc)
	struct Vector                                                ViewTargetOffset;                                  // 0x1b80(0xc)
	char                                                         pad0x14_QNLG9[0x14];                               // 0x1b8c(0x14)
	TArray<class EmitterCameraLensEffectBase*>                   CameraLensEffects;                                 // 0x1ba0(0x10)
	class CameraModifier_CameraShake*                            CachedCameraShakeMod;                              // 0x1bb0(0x8)
	class CameraAnimInst*                                        AnimInstPool;                                      // 0x1bb8(0x8)
	char                                                         pad0x38_JYAJI[0x38];                               // 0x1bc0(0x38)
	TArray<struct PostProcessSettings>                           PostProcessBlendCache;                             // 0x1bf8(0x10)
	char                                                         pad0x10_RSKR8[0x10];                               // 0x1c08(0x10)
	TArray<class CameraAnimInst*>                                ActiveAnims;                                       // 0x1c18(0x10)
	TArray<class CameraAnimInst*>                                FreeAnims;                                         // 0x1c28(0x10)
	class CameraActor*                                           AnimCameraActor;                                   // 0x1c38(0x8)
	bool                                                         bIsOrthographic;                                   // 0x1c40(0x1)
	bool                                                         bUseClientSideCameraUpdates;                       // 0x1c40(0x1)
	bool                                                         bFollowHmdOrientation;                             // 0x1c41(0x1)
	char                                                         pad0x2_8Y739[0x2];                                 // 0x1c42(0x2)
	float                                                        ViewPitchMin;                                      // 0x1c44(0x4)
	float                                                        ViewPitchMax;                                      // 0x1c48(0x4)
	float                                                        ViewYawMin;                                        // 0x1c4c(0x4)
	float                                                        ViewYawMax;                                        // 0x1c50(0x4)
	float                                                        ViewRollMin;                                       // 0x1c54(0x4)
	float                                                        ViewRollMax;                                       // 0x1c58(0x4)
	char                                                         pad0x4_E62HZ[0x4];                                 // 0x1c5c(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class CurveBase: public Object
{
public:
	char                                                         pad0x8_H8Y64[0x8];                                 // 0x28(0x8)
};


// Size 0x80 (Full Size[0xb0] - InheritedSize[0x30]
class CurveFloat: public CurveBase
{
public:
	struct RichCurve                                             FloatCurve;                                        // 0x30(0x78)
	bool                                                         bIsEventCurve;                                     // 0xa8(0x1)
	char                                                         pad0x7_PDI4Y[0x7];                                 // 0xa9(0x7)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ForceFeedbackEffect: public Object
{
public:
	TArray<struct ForceFeedbackChannelDetails>                   ChannelDetails;                                    // 0x28(0x10)
	float                                                        Duration;                                          // 0x38(0x4)
	char                                                         pad0x4_9Y6U8[0x4];                                 // 0x3c(0x4)
};


// Size 0x18 (Full Size[0x7d8] - InheritedSize[0x7c0]
class LogVisualizerCameraController: public DebugCameraController
{
public:
	class Actor*                                                 PickedActor;                                       // 0x7c0(0x8)
	char                                                         pad0x10_8WV6S[0x10];                               // 0x7c8(0x10)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class DecalActor: public Actor
{
public:
	class DecalComponent*                                        Decal;                                             // 0x3c8(0x8)
};


// Size 0x20 (Full Size[0x3e8] - InheritedSize[0x3c8]
class DestructibleActor: public Actor
{
public:
	class DestructibleComponent*                                 DestructibleComponent;                             // 0x3c8(0x8)
	bool                                                         bAffectNavigation;                                 // 0x3d0(0x1)
	char                                                         pad0x7_DHE4C[0x7];                                 // 0x3d1(0x7)
	char                                                         pad0x10_T773Z[0x10];                               // 0x3d8(0x10)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class DocumentationActor: public Actor
{
public:
	char                                                         pad0x8_8MO7E[0x8];                                 // 0x3c8(0x8)
};


// Size 0x50 (Full Size[0x418] - InheritedSize[0x3c8]
class Emitter: public Actor
{
public:
	class ParticleSystemComponent*                               ParticleSystemComponent;                           // 0x3c8(0x8)
	bool                                                         bDestroyOnSystemFinish;                            // 0x3d0(0x1)
	bool                                                         bPostUpdateTickGroup;                              // 0x3d0(0x1)
	bool                                                         bCurrentlyActive;                                  // 0x3d0(0x1)
	char                                                         pad0x7_YQQ0T[0x7];                                 // 0x3d1(0x7)
	char                                                         pad0x40_E9PTR[0x40];                               // 0x3d8(0x40)
};


// Size 0x38 (Full Size[0x450] - InheritedSize[0x418]
class EmitterCameraLensEffectBase: public Emitter
{
public:
	class ParticleSystem*                                        PS_CameraEffect;                                   // 0x418(0x8)
	class ParticleSystem*                                        PS_CameraEffectNonExtremeContent;                  // 0x420(0x8)
	float                                                        BaseFOV;                                           // 0x428(0x4)
	float                                                        DistFromCamera;                                    // 0x42c(0x4)
	bool                                                         bAllowMultipleInstances;                           // 0x430(0x1)
	char                                                         pad0x7_MFSAY[0x7];                                 // 0x431(0x7)
	TArray<class Class*>                                         EmittersToTreatAsSame;                             // 0x438(0x10)
	class PlayerCameraManager*                                   BaseCamera;                                        // 0x448(0x8)
};


// Size 0x0 (Full Size[0x4c0] - InheritedSize[0x4c0]
class DebugCameraHUD: public HUD
{
public:
};


// Size 0x28 (Full Size[0x4e8] - InheritedSize[0x4c0]
class LogVisualizerHUD: public DebugCameraHUD
{
public:
	char                                                         pad0x28_YM9GL[0x28];                               // 0x4c0(0x28)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class AtmosphericFog: public Info
{
public:
	class AtmosphericFogComponent*                               AtmosphericFogComponent;                           // 0x3c8(0x8)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class ExponentialHeightFog: public Info
{
public:
	class ExponentialHeightFogComponent*                         Component;                                         // 0x3c8(0x8)
	bool                                                         bEnabled;                                          // 0x3d0(0x1)
	char                                                         pad0x7_ZC4KO[0x7];                                 // 0x3d1(0x7)
};


// Size 0x28 (Full Size[0x3f0] - InheritedSize[0x3c8]
class NavigationObjectBase: public Actor
{
public:
	char                                                         pad0x8_WG3CN[0x8];                                 // 0x3c8(0x8)
	class CapsuleComponent*                                      CapsuleComponent;                                  // 0x3d0(0x8)
	class BillboardComponent*                                    GoodSprite;                                        // 0x3d8(0x8)
	class BillboardComponent*                                    BadSprite;                                         // 0x3e0(0x8)
	bool                                                         bIsPIEPlayerStart;                                 // 0x3e8(0x1)
	char                                                         pad0x7_NYFCO[0x7];                                 // 0x3e9(0x7)
};


// Size 0x8 (Full Size[0x3f8] - InheritedSize[0x3f0]
class PlayerStart: public NavigationObjectBase
{
public:
	struct FName                                                 PlayerStartTag;                                    // 0x3f0(0x8)
};


// Size 0x70 (Full Size[0x438] - InheritedSize[0x3c8]
class GameNetworkManager: public Info
{
public:
	int                                                          AdjustedNetSpeed;                                  // 0x3c8(0x4)
	float                                                        LastNetSpeedUpdateTime;                            // 0x3cc(0x4)
	int                                                          TotalNetBandwidth;                                 // 0x3d0(0x4)
	int                                                          MinDynamicBandwidth;                               // 0x3d4(0x4)
	int                                                          MaxDynamicBandwidth;                               // 0x3d8(0x4)
	bool                                                         bIsStandbyCheckingEnabled;                         // 0x3dc(0x1)
	bool                                                         bHasStandbyCheatTriggered;                         // 0x3dc(0x1)
	char                                                         pad0x3_86NND[0x3];                                 // 0x3dd(0x3)
	float                                                        StandbyRxCheatTime;                                // 0x3e0(0x4)
	float                                                        StandbyTxCheatTime;                                // 0x3e4(0x4)
	int                                                          BadPingThreshold;                                  // 0x3e8(0x4)
	float                                                        PercentMissingForRxStandby;                        // 0x3ec(0x4)
	float                                                        PercentMissingForTxStandby;                        // 0x3f0(0x4)
	float                                                        PercentForBadPing;                                 // 0x3f4(0x4)
	float                                                        JoinInProgressStandbyWaitTime;                     // 0x3f8(0x4)
	float                                                        MoveRepSize;                                       // 0x3fc(0x4)
	float                                                        MAXPOSITIONERRORSQUARED;                           // 0x400(0x4)
	float                                                        MAXNEARZEROVELOCITYSQUARED;                        // 0x404(0x4)
	float                                                        CLIENTADJUSTUPDATECOST;                            // 0x408(0x4)
	float                                                        MAXCLIENTUPDATEINTERVAL;                           // 0x40c(0x4)
	float                                                        MaxMoveDeltaTime;                                  // 0x410(0x4)
	bool                                                         ClientAuthorativePosition;                         // 0x414(0x1)
	char                                                         pad0x3_CG2E1[0x3];                                 // 0x415(0x3)
	float                                                        ClientErrorUpdateRateLimit;                        // 0x418(0x4)
	bool                                                         bMovementTimeDiscrepancyDetection;                 // 0x41c(0x1)
	bool                                                         bMovementTimeDiscrepancyResolution;                // 0x41d(0x1)
	char                                                         pad0x2_LG7AH[0x2];                                 // 0x41e(0x2)
	float                                                        MovementTimeDiscrepancyMaxTimeMargin;              // 0x420(0x4)
	float                                                        MovementTimeDiscrepancyMinTimeMargin;              // 0x424(0x4)
	float                                                        MovementTimeDiscrepancyResolutionRate;             // 0x428(0x4)
	float                                                        MovementTimeDiscrepancyDriftAllowance;             // 0x42c(0x4)
	bool                                                         bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x430(0x1)
	bool                                                         bUseDistanceBasedRelevancy;                        // 0x431(0x1)
	char                                                         pad0x6_HMUKN[0x6];                                 // 0x432(0x6)
};


// Size 0x30 (Full Size[0x3f8] - InheritedSize[0x3c8]
class GameSession: public Info
{
public:
	int                                                          MaxSpectators;                                     // 0x3c8(0x4)
	int                                                          MaxPlayers;                                        // 0x3cc(0x4)
	byte                                                         MaxSplitscreensPerConnection;                      // 0x3d0(0x1)
	bool                                                         bRequiresPushToTalk;                               // 0x3d1(0x1)
	char                                                         pad0x2_5C3CX[0x2];                                 // 0x3d2(0x2)
	struct FName                                                 SessionName;                                       // 0x3d4(0x8)
	char                                                         pad0x1c_EG88P[0x1c];                               // 0x3dc(0x1c)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class SkyLight: public Info
{
public:
	class SkyLightComponent*                                     LightComponent;                                    // 0x3c8(0x8)
	bool                                                         bEnabled;                                          // 0x3d0(0x1)
	char                                                         pad0x7_EVWA3[0x7];                                 // 0x3d1(0x7)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class WindDirectionalSource: public Info
{
public:
	class WindDirectionalSourceComponent*                        Component;                                         // 0x3c8(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class LevelBounds: public Actor
{
public:
	bool                                                         bAutoUpdateBounds;                                 // 0x3c8(0x1)
	char                                                         pad0x7_BDYHZ[0x7];                                 // 0x3c9(0x7)
};


// Size 0x30 (Full Size[0x310] - InheritedSize[0x2e0]
class LightComponentBase: public SceneComponent
{
public:
	struct Guid                                                  LightGuid;                                         // 0x2e0(0x10)
	float                                                        Brightness;                                        // 0x2f0(0x4)
	float                                                        Intensity;                                         // 0x2f4(0x4)
	struct Color                                                 LightColor;                                        // 0x2f8(0x4)
	bool                                                         bAffectsWorld;                                     // 0x2fc(0x1)
	bool                                                         CastShadows;                                       // 0x2fc(0x1)
	bool                                                         CastStaticShadows;                                 // 0x2fc(0x1)
	bool                                                         CastDynamicShadows;                                // 0x2fc(0x1)
	bool                                                         bAffectTranslucentLighting;                        // 0x2fc(0x1)
	bool                                                         bPrecomputedLightingIsValid;                       // 0x2fc(0x1)
	bool                                                         RainOcclusion;                                     // 0x2fc(0x1)
	char                                                         pad0x3_1AK5A[0x3];                                 // 0x2fd(0x3)
	float                                                        IndirectLightingIntensity;                         // 0x300(0x4)
	float                                                        ScaleForTranslucency;                              // 0x304(0x4)
	float                                                        CapForTranslucency;                                // 0x308(0x4)
	char                                                         pad0x4_O2V74[0x4];                                 // 0x30c(0x4)
};


// Size 0x160 (Full Size[0x470] - InheritedSize[0x310]
class LightComponent: public LightComponentBase
{
public:
	float                                                        Temperature;                                       // 0x310(0x4)
	bool                                                         bUseTemperature;                                   // 0x314(0x1)
	char                                                         pad0x3_P8JSW[0x3];                                 // 0x315(0x3)
	int                                                          ShadowMapChannel;                                  // 0x318(0x4)
	char                                                         pad0x4_UYNMN[0x4];                                 // 0x31c(0x4)
	float                                                        SourceRadius;                                      // 0x320(0x4)
	float                                                        MinRoughness;                                      // 0x324(0x4)
	float                                                        ShadowBias;                                        // 0x328(0x4)
	float                                                        ShadowSharpen;                                     // 0x32c(0x4)
	float                                                        ShadowResMaxDynamicDegradation;                    // 0x330(0x4)
	bool                                                         InverseSquaredFalloff;                             // 0x334(0x1)
	bool                                                         CastTranslucentShadows;                            // 0x334(0x1)
	bool                                                         bCastShadowsFromCinematicObjectsOnly;              // 0x334(0x1)
	bool                                                         bAffectDynamicIndirectLighting;                    // 0x334(0x1)
	char                                                         pad0x3_M0DQV[0x3];                                 // 0x335(0x3)
	class MaterialInterface*                                     LightFunctionMaterial;                             // 0x338(0x8)
	struct Vector                                                LightFunctionScale;                                // 0x340(0xc)
	char                                                         pad0x4_6W17N[0x4];                                 // 0x34c(0x4)
	class TextureLightProfile*                                   IESTexture;                                        // 0x350(0x8)
	bool                                                         bUseIESBrightness;                                 // 0x358(0x1)
	char                                                         pad0x3_WCGHK[0x3];                                 // 0x359(0x3)
	float                                                        IESBrightnessScale;                                // 0x35c(0x4)
	float                                                        LightFunctionFadeDistance;                         // 0x360(0x4)
	float                                                        DisabledBrightness;                                // 0x364(0x4)
	bool                                                         bEnableLightShaftBloom;                            // 0x368(0x1)
	char                                                         pad0x3_XPZO7[0x3];                                 // 0x369(0x3)
	float                                                        BloomScale;                                        // 0x36c(0x4)
	float                                                        BloomThreshold;                                    // 0x370(0x4)
	struct Color                                                 BloomTint;                                         // 0x374(0x4)
	bool                                                         bUseRayTracedDistanceFieldShadows;                 // 0x378(0x1)
	char                                                         pad0x3_70FE5[0x3];                                 // 0x379(0x3)
	float                                                        RayStartOffsetDepthScale;                          // 0x37c(0x4)
	char                                                         pad0xf0_ZZCTE[0xf0];                               // 0x380(0xf0)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class Light: public Actor
{
public:
	class LightComponent*                                        LightComponent;                                    // 0x3c8(0x8)
};


// Size 0x8 (Full Size[0x3d8] - InheritedSize[0x3d0]
class AmbientLightSource: public Light
{
public:
	class AmbientLightSourceComponent*                           AmbientLightSourceComponent;                       // 0x3d0(0x8)
};


// Size 0x0 (Full Size[0x3d0] - InheritedSize[0x3d0]
class DirectionalLight: public Light
{
public:
};


// Size 0x8 (Full Size[0x3d8] - InheritedSize[0x3d0]
class PointLight: public Light
{
public:
	class PointLightComponent*                                   PointLightComponent;                               // 0x3d0(0x8)
};


// Size 0x8 (Full Size[0x3d8] - InheritedSize[0x3d0]
class SpotLight: public Light
{
public:
	class SpotLightComponent*                                    SpotLightComponent;                                // 0x3d0(0x8)
};


// Size 0x0 (Full Size[0x3d8] - InheritedSize[0x3d8]
class GeneratedMeshAreaLight: public SpotLight
{
public:
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class LODActor: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x3c8(0x8)
	TArray<class Actor*>                                         SubActors;                                         // 0x3d0(0x10)
	float                                                        LODDrawDistance;                                   // 0x3e0(0x4)
	int                                                          LodLevel;                                          // 0x3e4(0x4)
	TArray<class Object*>                                        SubObjects;                                        // 0x3e8(0x10)
	char                                                         pad0x8_ZLEDS[0x8];                                 // 0x3f8(0x8)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class MaterialInstanceActor: public Actor
{
public:
	TArray<class Actor*>                                         TargetActors;                                      // 0x3c8(0x10)
};


// Size 0x78 (Full Size[0x440] - InheritedSize[0x3c8]
class MatineeActor: public Actor
{
public:
	class InterpData*                                            MatineeData;                                       // 0x3c8(0x8)
	struct FName                                                 MatineeControllerName;                             // 0x3d0(0x8)
	float                                                        PlayRate;                                          // 0x3d8(0x4)
	bool                                                         bPlayOnLevelLoad;                                  // 0x3dc(0x1)
	bool                                                         bForceStartPos;                                    // 0x3dc(0x1)
	char                                                         pad0x3_32FXN[0x3];                                 // 0x3dd(0x3)
	float                                                        ForceStartPosition;                                // 0x3e0(0x4)
	bool                                                         bLooping;                                          // 0x3e4(0x1)
	bool                                                         bRewindOnPlay;                                     // 0x3e4(0x1)
	bool                                                         bNoResetOnRewind;                                  // 0x3e4(0x1)
	bool                                                         bRewindIfAlreadyPlaying;                           // 0x3e4(0x1)
	bool                                                         bDisableRadioFilter;                               // 0x3e4(0x1)
	bool                                                         bClientSideOnly;                                   // 0x3e4(0x1)
	bool                                                         bSkipUpdateIfNotVisible;                           // 0x3e4(0x1)
	bool                                                         bIsSkippable;                                      // 0x3e4(0x1)
	char                                                         pad0x3_X2IU4[0x3];                                 // 0x3e5(0x3)
	int                                                          PreferredSplitScreenNum;                           // 0x3e8(0x4)
	bool                                                         bDisableMovementInput;                             // 0x3ec(0x1)
	bool                                                         bDisableLookAtInput;                               // 0x3ec(0x1)
	bool                                                         bHidePlayer;                                       // 0x3ec(0x1)
	bool                                                         bHideHud;                                          // 0x3ec(0x1)
	char                                                         pad0x3_0KDQF[0x3];                                 // 0x3ed(0x3)
	TArray<struct InterpGroupActorInfo>                          GroupActorInfos;                                   // 0x3f0(0x10)
	bool                                                         bShouldShowGore;                                   // 0x400(0x1)
	char                                                         pad0x7_TBKRC[0x7];                                 // 0x401(0x7)
	TArray<class InterpGroupInst*>                               GroupInst;                                         // 0x408(0x10)
	TArray<struct CameraCutInfo>                                 CameraCuts;                                        // 0x418(0x10)
	bool                                                         bIsPlaying;                                        // 0x428(0x1)
	bool                                                         bReversePlayback;                                  // 0x428(0x1)
	bool                                                         bPaused;                                           // 0x428(0x1)
	bool                                                         bPendingStop;                                      // 0x428(0x1)
	char                                                         pad0x3_CHXA2[0x3];                                 // 0x429(0x3)
	float                                                        InterpPosition;                                    // 0x42c(0x4)
	char                                                         pad0x4_GRMDY[0x4];                                 // 0x430(0x4)
	byte                                                         ReplicationForceIsPlaying;                         // 0x434(0x1)
	char                                                         pad0x7_ST36I[0x7];                                 // 0x435(0x7)
	bool                                                         bServerInitialLevelStreamingComplete;              // 0x43c(0x1)
	char                                                         pad0x3_8YAG2[0x3];                                 // 0x43d(0x3)
};


// Size 0x8 (Full Size[0x448] - InheritedSize[0x440]
class MatineeActorCameraAnim: public MatineeActor
{
public:
	class CameraAnim*                                            CameraAnim;                                        // 0x440(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class MergedCollisionActor: public Actor
{
public:
	class MergedCollisionComponent*                              MergedCollisionComponent;                          // 0x3c8(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class NavigationQueryFilter: public Object
{
public:
	TArray<struct NavigationFilterArea>                          Areas;                                             // 0x28(0x10)
	struct NavigationFilterFlags                                 IncludeFlags;                                      // 0x38(0x4)
	struct NavigationFilterFlags                                 ExcludeFlags;                                      // 0x3c(0x4)
};


// Size 0x1c0 (Full Size[0x588] - InheritedSize[0x3c8]
class NavigationData: public Actor
{
public:
	class PrimitiveComponent*                                    RenderingComp;                                     // 0x3c8(0x8)
	struct NavDataConfig                                         NavDataConfig;                                     // 0x3d0(0x58)
	bool                                                         bEnableDrawing;                                    // 0x428(0x1)
	bool                                                         bRebuildAtRuntime;                                 // 0x428(0x1)
	char                                                         pad0x3_DG3JA[0x3];                                 // 0x429(0x3)
	byte                                                         RuntimeGeneration;                                 // 0x42c(0x1)
	char                                                         pad0x3_UM4SM[0x3];                                 // 0x42d(0x3)
	bool                                                         bForceRebuildOnLoad;                               // 0x430(0x1)
	char                                                         pad0x3_2GP8A[0x3];                                 // 0x431(0x3)
	float                                                        ObservedPathsTickInterval;                         // 0x434(0x4)
	char                                                         pad0xe8_Z1MNR[0xe8];                               // 0x438(0xe8)
	TArray<struct SupportedAreaData>                             SupportedAreas;                                    // 0x520(0x10)
	char                                                         pad0x58_5JWYP[0x58];                               // 0x530(0x58)
};


// Size 0x0 (Full Size[0x588] - InheritedSize[0x588]
class AbstractNavData: public NavigationData
{
public:
};


// Size 0x0 (Full Size[0x588] - InheritedSize[0x588]
class NavigationGraph: public NavigationData
{
public:
};


// Size 0xb0 (Full Size[0x638] - InheritedSize[0x588]
class RecastNavMesh: public NavigationData
{
public:
	bool                                                         bDrawTriangleEdges;                                // 0x588(0x1)
	bool                                                         bDrawPolyEdges;                                    // 0x588(0x1)
	bool                                                         bDrawFilledPolys;                                  // 0x588(0x1)
	bool                                                         bDrawNavMeshEdges;                                 // 0x588(0x1)
	bool                                                         bDrawTileBounds;                                   // 0x588(0x1)
	bool                                                         bDrawPathCollidingGeometry;                        // 0x588(0x1)
	bool                                                         bDrawTileLabels;                                   // 0x588(0x1)
	bool                                                         bDrawPolygonLabels;                                // 0x588(0x1)
	bool                                                         bDrawDefaultPolygonCost;                           // 0x589(0x1)
	bool                                                         bDrawLabelsOnPathNodes;                            // 0x589(0x1)
	bool                                                         bDrawNavLinks;                                     // 0x589(0x1)
	bool                                                         bDrawFailedNavLinks;                               // 0x589(0x1)
	bool                                                         bDrawClusters;                                     // 0x589(0x1)
	bool                                                         bDrawOctree;                                       // 0x589(0x1)
	bool                                                         bDistinctlyDrawTilesBeingBuilt;                    // 0x589(0x1)
	bool                                                         bDrawNavMesh;                                      // 0x589(0x1)
	char                                                         pad0x2_DMIZA[0x2];                                 // 0x58a(0x2)
	float                                                        DrawOffset;                                        // 0x58c(0x4)
	float                                                        BuiltTileSizeUU;                                   // 0x590(0x4)
	float                                                        BuiltCellSize;                                     // 0x594(0x4)
	bool                                                         bFixedTilePoolSize;                                // 0x598(0x1)
	char                                                         pad0x3_NX9RR[0x3];                                 // 0x599(0x3)
	int                                                          TilePoolSize;                                      // 0x59c(0x4)
	float                                                        TileSizeUU;                                        // 0x5a0(0x4)
	float                                                        CellSize;                                          // 0x5a4(0x4)
	float                                                        CellHeight;                                        // 0x5a8(0x4)
	float                                                        AgentRadius;                                       // 0x5ac(0x4)
	float                                                        AgentHeight;                                       // 0x5b0(0x4)
	float                                                        AgentMaxHeight;                                    // 0x5b4(0x4)
	float                                                        AgentMaxSlope;                                     // 0x5b8(0x4)
	float                                                        AgentMaxStepHeight;                                // 0x5bc(0x4)
	float                                                        MinRegionArea;                                     // 0x5c0(0x4)
	float                                                        MergeRegionSize;                                   // 0x5c4(0x4)
	float                                                        MaxSimplificationError;                            // 0x5c8(0x4)
	int                                                          MaxSimultaneousTileGenerationJobsCount;            // 0x5cc(0x4)
	int                                                          TileNumberHardLimit;                               // 0x5d0(0x4)
	int                                                          PolyRefTileBits;                                   // 0x5d4(0x4)
	int                                                          PolyRefNavPolyBits;                                // 0x5d8(0x4)
	int                                                          PolyRefSaltBits;                                   // 0x5dc(0x4)
	float                                                        DefaultDrawDistance;                               // 0x5e0(0x4)
	float                                                        DefaultMaxSearchNodes;                             // 0x5e4(0x4)
	float                                                        DefaultMaxHierarchicalSearchNodes;                 // 0x5e8(0x4)
	byte                                                         RegionPartitioning;                                // 0x5ec(0x1)
	byte                                                         LayerPartitioning;                                 // 0x5ed(0x1)
	char                                                         pad0x2_8GWMU[0x2];                                 // 0x5ee(0x2)
	int                                                          RegionChunkSplits;                                 // 0x5f0(0x4)
	int                                                          LayerChunkSplits;                                  // 0x5f4(0x4)
	bool                                                         bSortNavigationAreasByCost;                        // 0x5f8(0x1)
	bool                                                         bPerformVoxelFiltering;                            // 0x5f8(0x1)
	bool                                                         bMarkLowHeightAreas;                               // 0x5f8(0x1)
	bool                                                         bDoFullyAsyncNavDataGathering;                     // 0x5f8(0x1)
	bool                                                         bUseBetterOffsetsFromCorners;                      // 0x5f8(0x1)
	bool                                                         bUseVirtualFilters;                                // 0x5f8(0x1)
	bool                                                         bUseVoxelCache;                                    // 0x5f8(0x1)
	char                                                         pad0x3_3O8I4[0x3];                                 // 0x5f9(0x3)
	float                                                        TileSetUpdateInterval;                             // 0x5fc(0x4)
	float                                                        HeuristicScale;                                    // 0x600(0x4)
	float                                                        VerticalDeviationFromGroundCompensation;           // 0x604(0x4)
	char                                                         pad0x30_14HTN[0x30];                               // 0x608(0x30)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class NavigationGraphNode: public Actor
{
public:
};


// Size 0x0 (Full Size[0x3f8] - InheritedSize[0x3f8]
class PlayerStartPIE: public PlayerStart
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavPathObserverInterface: public Interface
{
public:
};


// Size 0xd0 (Full Size[0x498] - InheritedSize[0x3c8]
class NavigationTestingActor: public Actor
{
public:
	char                                                         pad0x10_IO3E5[0x10];                               // 0x3c8(0x10)
	class CapsuleComponent*                                      CapsuleComponent;                                  // 0x3d8(0x8)
	class NavigationInvokerComponent*                            InvokerComponent;                                  // 0x3e0(0x8)
	bool                                                         bActAsNavigationInvoker;                           // 0x3e8(0x1)
	char                                                         pad0x3_4S926[0x3];                                 // 0x3e9(0x3)
	struct NavAgentProperties                                    NavAgentProps;                                     // 0x3ec(0x30)
	struct Vector                                                QueryingExtent;                                    // 0x41c(0xc)
	class NavigationData*                                        MyNavData;                                         // 0x428(0x8)
	struct Vector                                                ProjectedLocation;                                 // 0x430(0xc)
	bool                                                         bProjectedLocationValid;                           // 0x43c(0x1)
	bool                                                         bSearchStart;                                      // 0x43c(0x1)
	bool                                                         bUseHierarchicalPathfinding;                       // 0x43c(0x1)
	bool                                                         bGatherDetailedInfo;                               // 0x43c(0x1)
	bool                                                         bShowNodePool;                                     // 0x43c(0x1)
	bool                                                         bShowBestPath;                                     // 0x43c(0x1)
	bool                                                         bShowDiffWithPreviousStep;                         // 0x43c(0x1)
	bool                                                         bShouldBeVisibleInGame;                            // 0x43c(0x1)
	char                                                         pad0x3_9AMO3[0x3];                                 // 0x43d(0x3)
	byte                                                         CostDisplayMode;                                   // 0x440(0x1)
	char                                                         pad0x3_U4YAR[0x3];                                 // 0x441(0x3)
	struct Vector2D                                              TextCanvasOffset;                                  // 0x444(0x8)
	bool                                                         bPathExist;                                        // 0x44c(0x1)
	bool                                                         bPathIsPartial;                                    // 0x44c(0x1)
	bool                                                         bPathSearchOutOfNodes;                             // 0x44c(0x1)
	char                                                         pad0x3_97DA6[0x3];                                 // 0x44d(0x3)
	float                                                        PathfindingTime;                                   // 0x450(0x4)
	float                                                        PathCost;                                          // 0x454(0x4)
	int                                                          PathfindingSteps;                                  // 0x458(0x4)
	char                                                         pad0x4_QBA71[0x4];                                 // 0x45c(0x4)
	class NavigationTestingActor*                                OtherActor;                                        // 0x460(0x8)
	class UClass*                                                FilterClass;                                       // 0x468(0x8)
	int                                                          ShowStepIndex;                                     // 0x470(0x4)
	float                                                        OffsetFromCornersDistance;                         // 0x474(0x4)
	char                                                         pad0x20_ZSU45[0x20];                               // 0x478(0x20)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class NavLinkDefinition: public Object
{
public:
	TArray<struct NavigationLink>                                Links;                                             // 0x28(0x10)
	TArray<struct NavigationSegmentLink>                         SegmentLinks;                                      // 0x38(0x10)
	char                                                         pad0x8_MV1XF[0x8];                                 // 0x48(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavLinkHostInterface: public Interface
{
public:
};


// Size 0x50 (Full Size[0x418] - InheritedSize[0x3c8]
class NavLinkProxy: public Actor
{
public:
	char                                                         pad0x10_195W2[0x10];                               // 0x3c8(0x10)
	TArray<struct NavigationLink>                                PointLinks;                                        // 0x3d8(0x10)
	TArray<struct NavigationSegmentLink>                         SegmentLinks;                                      // 0x3e8(0x10)
	class NavLinkCustomComponent*                                SmartLinkComp;                                     // 0x3f8(0x8)
	bool                                                         bSmartLinkIsRelevant;                              // 0x400(0x1)
	char                                                         pad0x7_8R6EU[0x7];                                 // 0x401(0x7)
	char                                                         pad0x10_KPA2G[0x10];                               // 0x408(0x10)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class Note: public Actor
{
public:
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class ParticleSystem: public Object
{
public:
	byte                                                         SystemUpdateMode;                                  // 0x28(0x1)
	char                                                         pad0x3_KLFE1[0x3];                                 // 0x29(0x3)
	float                                                        UpdateTime_FPS;                                    // 0x2c(0x4)
	float                                                        UpdateTime_Delta;                                  // 0x30(0x4)
	float                                                        WarmUpTime;                                        // 0x34(0x4)
	float                                                        WarmupTickRate;                                    // 0x38(0x4)
	char                                                         pad0x4_8UI1N[0x4];                                 // 0x3c(0x4)
	TArray<class ParticleEmitter*>                               Emitters;                                          // 0x40(0x10)
	class ParticleSystemComponent*                               PreviewComponent;                                  // 0x50(0x8)
	class InterpCurveEdSetup*                                    CurveEdSetup;                                      // 0x58(0x8)
	bool                                                         bOrientZAxisTowardCamera;                          // 0x60(0x1)
	char                                                         pad0x3_BK7S2[0x3];                                 // 0x61(0x3)
	float                                                        LODDistanceCheckTime;                              // 0x64(0x4)
	byte                                                         LODMethod;                                         // 0x68(0x1)
	char                                                         pad0x7_JXM38[0x7];                                 // 0x69(0x7)
	TArray<Float LODDistances>                                   LODDistances;                                      // 0x70(0x10)
	bool                                                         bRegenerateLODDuplicate;                           // 0x80(0x1)
	char                                                         pad0x7_XO01C[0x7];                                 // 0x81(0x7)
	TArray<struct ParticleSystemLOD>                             LODSettings;                                       // 0x88(0x10)
	bool                                                         bIgnoreBoundsRotation;                             // 0x98(0x1)
	bool                                                         bBoostParticleAggregationPriority;                 // 0x98(0x1)
	bool                                                         bUseFixedRelativeBoundingBox;                      // 0x98(0x1)
	char                                                         pad0x3_CUK5N[0x3];                                 // 0x99(0x3)
	struct Box                                                   FixedRelativeBoundingBox;                          // 0x9c(0x1c)
	bool                                                         bUseLowResTranslucencyBoundingBox;                 // 0xb8(0x1)
	char                                                         pad0x3_SUOY4[0x3];                                 // 0xb9(0x3)
	struct Box                                                   LowResTranslucencyBoundingBox;                     // 0xbc(0x1c)
	float                                                        SecondsBeforeInactive;                             // 0xd8(0x4)
	bool                                                         bShouldResetPeakCounts;                            // 0xdc(0x1)
	bool                                                         bHasPhysics;                                       // 0xdc(0x1)
	bool                                                         bPostPhysicsTick;                                  // 0xdc(0x1)
	bool                                                         bUseRealtimeThumbnail;                             // 0xdc(0x1)
	bool                                                         ThumbnailImageOutOfDate;                           // 0xdc(0x1)
	char                                                         pad0x3_053UF[0x3];                                 // 0xdd(0x3)
	float                                                        Delay;                                             // 0xe0(0x4)
	float                                                        DelayLow;                                          // 0xe4(0x4)
	bool                                                         bUseDelayRange;                                    // 0xe8(0x1)
	char                                                         pad0x3_TZ2UJ[0x3];                                 // 0xe9(0x3)
	struct Vector                                                MacroUVPosition;                                   // 0xec(0xc)
	float                                                        MacroUVRadius;                                     // 0xf8(0x4)
	byte                                                         OcclusionBoundsMethod;                             // 0xfc(0x1)
	char                                                         pad0x3_AYJD3[0x3];                                 // 0xfd(0x3)
	struct Box                                                   CustomOcclusionBounds;                             // 0x100(0x1c)
	char                                                         pad0x4_UT3IV[0x4];                                 // 0x11c(0x4)
	TArray<struct LODSoloTrack>                                  SoloTracking;                                      // 0x120(0x10)
	TArray<struct NamedEmitterMaterial>                          NamedMaterialSlots;                                // 0x130(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ParticleSystemAggregateTickSettings: public Object
{
public:
	int                                                          FramesTickScaledOver;                              // 0x28(0x4)
	int                                                          MaxTicksPerFrame;                                  // 0x2c(0x4)
	float                                                        PriorityInflationPower;                            // 0x30(0x4)
	char                                                         pad0x4_I3QWB[0x4];                                 // 0x34(0x4)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class ParticleEventManager: public Actor
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_CollisionDataProvider: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class MeshPatchAsset: public Object
{
public:
	char                                                         pad0x10_1N40A[0x10];                               // 0x28(0x10)
};


// Size 0x210 (Full Size[0x238] - InheritedSize[0x28]
class SkeletalMesh: public Object
{
public:
	char                                                         pad0x28_KLYEA[0x28];                               // 0x28(0x28)
	class Skeleton*                                              Skeleton;                                          // 0x50(0x8)
	struct BoxSphereBounds                                       Bounds;                                            // 0x58(0x1c)
	char                                                         pad0x4_162IC[0x4];                                 // 0x74(0x4)
	TArray<struct SkeletalMaterial>                              Materials;                                         // 0x78(0x10)
	TArray<struct BoneMirrorInfo>                                SkelMirrorTable;                                   // 0x88(0x10)
	byte                                                         SkelMirrorAxis;                                    // 0x98(0x1)
	byte                                                         SkelMirrorFlipAxis;                                // 0x99(0x1)
	char                                                         pad0x6_VMYGP[0x6];                                 // 0x9a(0x6)
	TArray<struct SkeletalMeshLODInfo>                           LODInfo;                                           // 0xa0(0x10)
	bool                                                         bUseFullPrecisionUVs;                              // 0xb0(0x1)
	bool                                                         bHasBeenSimplified;                                // 0xb0(0x1)
	bool                                                         bHasVertexColors;                                  // 0xb0(0x1)
	char                                                         pad0x7_RLF7J[0x7];                                 // 0xb1(0x7)
	TArray<struct DeformablesSettings>                           DeformablesSettings;                               // 0xb8(0x10)
	bool                                                         bKeepTessellationAdjacency;                        // 0xc8(0x1)
	bool                                                         bKeepSkeletalMeshBuffersInMemory;                  // 0xc8(0x1)
	bool                                                         bEnablePerPolyCollision;                           // 0xc8(0x1)
	char                                                         pad0x7_6MAG5[0x7];                                 // 0xc9(0x7)
	class BodySetup*                                             BodySetup;                                         // 0xd0(0x8)
	class PhysicsAsset*                                          PhysicsAsset;                                      // 0xd8(0x8)
	class HIKCharacterization*                                   Characterization;                                  // 0xe0(0x8)
	class PhysicsAsset*                                          DeformablesPhysicsAsset;                           // 0xe8(0x8)
	float                                                        StreamingDistanceMultiplier;                       // 0xf0(0x4)
	float                                                        StreamingDiscardedTexelRatios;                     // 0xf4(0x4)
	TArray<class MorphTarget*>                                   MorphTargets;                                      // 0xf8(0x10)
	TArray<class MeshPatchAsset*>                                MeshPatchAssets;                                   // 0x108(0x10)
	char                                                         pad0xd8_6OK4U[0xd8];                               // 0x118(0xd8)
	TArray<struct ClothingAssetData>                             ClothingAssets;                                    // 0x1f0(0x10)
	char                                                         pad0x10_WH4WO[0x10];                               // 0x200(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x210(0x10)
	char                                                         pad0x8_UMM7V[0x8];                                 // 0x220(0x8)
	TArray<class SkeletalMeshSocket*>                            Sockets;                                           // 0x228(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AnimationAsset: public Object
{
public:
	class Skeleton*                                              Skeleton;                                          // 0x28(0x8)
	char                                                         pad0x10_G63H3[0x10];                               // 0x30(0x10)
	TArray<class AnimMetaData*>                                  MetaData;                                          // 0x40(0x10)
};


// Size 0x28 (Full Size[0x468] - InheritedSize[0x440]
class DefaultPawn: public Pawn
{
public:
	float                                                        BaseTurnRate;                                      // 0x440(0x4)
	float                                                        BaseLookUpRate;                                    // 0x444(0x4)
	class PawnMovementComponent*                                 MovementComponent;                                 // 0x448(0x8)
	class SphereComponent*                                       CollisionComponent;                                // 0x450(0x8)
	class StaticMeshComponent*                                   MeshComponent;                                     // 0x458(0x8)
	bool                                                         bAddDefaultMovementBindings;                       // 0x460(0x1)
	char                                                         pad0x7_09E8A[0x7];                                 // 0x461(0x7)
};


// Size 0x0 (Full Size[0x468] - InheritedSize[0x468]
class SpectatorPawn: public DefaultPawn
{
public:
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class ReflectionCapture: public Actor
{
public:
	class ReflectionCaptureComponent*                            CaptureComponent;                                  // 0x3c8(0x8)
};


// Size 0x0 (Full Size[0x3d0] - InheritedSize[0x3d0]
class BoxReflectionCapture: public ReflectionCapture
{
public:
};


// Size 0x0 (Full Size[0x3d0] - InheritedSize[0x3d0]
class PlaneReflectionCapture: public ReflectionCapture
{
public:
};


// Size 0x8 (Full Size[0x3d8] - InheritedSize[0x3d0]
class SphereReflectionCapture: public ReflectionCapture
{
public:
	class DrawSphereComponent*                                   DrawCaptureRadius;                                 // 0x3d0(0x8)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class RigidBodyBase: public Actor
{
public:
};


// Size 0x20 (Full Size[0x3e8] - InheritedSize[0x3c8]
class PhysicsConstraintActor: public RigidBodyBase
{
public:
	class PhysicsConstraintComponent*                            ConstraintComp;                                    // 0x3c8(0x8)
	class Actor*                                                 ConstraintActor1;                                  // 0x3d0(0x8)
	class Actor*                                                 ConstraintActor2;                                  // 0x3d8(0x8)
	bool                                                         bDisableCollision;                                 // 0x3e0(0x1)
	char                                                         pad0x7_UZUN8[0x7];                                 // 0x3e1(0x7)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class PhysicsThruster: public RigidBodyBase
{
public:
	class PhysicsThrusterComponent*                              ThrusterComponent;                                 // 0x3c8(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class RadialForceActor: public RigidBodyBase
{
public:
	class RadialForceComponent*                                  ForceComponent;                                    // 0x3c8(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class SceneCapture: public Actor
{
public:
	class StaticMeshComponent*                                   MeshComp;                                          // 0x3c8(0x8)
};


// Size 0x10 (Full Size[0x3e0] - InheritedSize[0x3d0]
class SceneCapture2D: public SceneCapture
{
public:
	class SceneCaptureComponent2D*                               CaptureComponent2D;                                // 0x3d0(0x8)
	class DrawFrustumComponent*                                  DrawFrustum;                                       // 0x3d8(0x8)
};


// Size 0x10 (Full Size[0x3e0] - InheritedSize[0x3d0]
class SceneCaptureCube: public SceneCapture
{
public:
	class SceneCaptureComponentCube*                             CaptureComponentCube;                              // 0x3d0(0x8)
	class DrawFrustumComponent*                                  DrawFrustum;                                       // 0x3d8(0x8)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class ServerOnlyTestActor: public Actor
{
public:
};


// Size 0x120 (Full Size[0x6f0] - InheritedSize[0x5d0]
class SkinnedMeshComponent: public MeshComponent
{
public:
	class SkeletalMesh*                                          SkeletalMesh;                                      // 0x5c8(0x8)
	class MaterialInterface*                                     CustomDepthMaterial;                               // 0x618(0x8)
	char                                                         pad0x10_QEHR6[0x10];                               // 0x620(0x10)
	bool                                                         bUseBoundsFromMasterPoseComponent;                 // 0x630(0x1)
	char                                                         pad0x7_YC0XY[0x7];                                 // 0x631(0x7)
	TArray<struct ActiveVertexAnim>                              ActiveVertexAnims;                                 // 0x638(0x10)
	class PhysicsAsset*                                          PhysicsAssetOverride;                              // 0x648(0x8)
	int                                                          ForcedLodModel;                                    // 0x650(0x4)
	int                                                          MinLodModel;                                       // 0x654(0x4)
	int                                                          PredictedLODLevel;                                 // 0x658(0x4)
	int                                                          OldPredictedLODLevel;                              // 0x65c(0x4)
	float                                                        MaxDistanceFactor;                                 // 0x660(0x4)
	char                                                         pad0x4_Z030V[0x4];                                 // 0x664(0x4)
	TArray<struct SkelMeshComponentLODInfo>                      LODInfo;                                           // 0x668(0x10)
	float                                                        StreamingDistanceMultiplier;                       // 0x678(0x4)
	struct Color                                                 WireframeColor;                                    // 0x67c(0x4)
	bool                                                         bForceWireframe;                                   // 0x680(0x1)
	bool                                                         bDisplayBones;                                     // 0x680(0x1)
	bool                                                         bDisplayBoneCollisions;                            // 0x680(0x1)
	bool                                                         bDisableMorphTarget;                               // 0x680(0x1)
	bool                                                         bHideSkin;                                         // 0x680(0x1)
	char                                                         pad0x17_F62D7[0x17];                               // 0x681(0x17)
	bool                                                         bPerBoneMotionBlur;                                // 0x698(0x1)
	bool                                                         bComponentUseFixedSkelBounds;                      // 0x698(0x1)
	bool                                                         bConsiderAllBodiesForBounds;                       // 0x698(0x1)
	char                                                         pad0x3_6OORO[0x3];                                 // 0x699(0x3)
	byte                                                         MeshComponentUpdateFlag;                           // 0x69c(0x1)
	char                                                         pad0x3_BBF4C[0x3];                                 // 0x69d(0x3)
	bool                                                         bForceMeshObjectUpdate;                            // 0x6a0(0x1)
	bool                                                         bChartDistanceFactor;                              // 0x6a0(0x1)
	bool                                                         bCanHighlightSelectedSections;                     // 0x6a0(0x1)
	bool                                                         bRecentlyRendered;                                 // 0x6a0(0x1)
	char                                                         pad0x3_F5Q8B[0x3];                                 // 0x6a1(0x3)
	float                                                        ProgressiveDrawingFraction;                        // 0x6a4(0x4)
	byte                                                         CustomSortAlternateIndexMode;                      // 0x6a8(0x1)
	char                                                         pad0x13_U3HL4[0x13];                               // 0x6a9(0x13)
	struct BoxSphereBounds                                       CachedLocalBounds;                                 // 0x6bc(0x1c)
	bool                                                         bCachedLocalBoundsUpToDate;                        // 0x6d8(0x1)
	bool                                                         bEnableUpdateRateOptimizations;                    // 0x6d9(0x1)
	bool                                                         bDisplayDebugUpdateRateOptimizations;              // 0x6da(0x1)
	char                                                         pad0x15_DXIN5[0x15];                               // 0x6db(0x15)
};


// Size 0x1b0 (Full Size[0x490] - InheritedSize[0x2e0]
class PhysicsConstraintComponent: public SceneComponent
{
public:
	class Actor*                                                 ConstraintActor1;                                  // 0x2e0(0x8)
	struct ConstrainComponentPropName                            ComponentName1;                                    // 0x2e8(0x8)
	class Actor*                                                 ConstraintActor2;                                  // 0x2f0(0x8)
	struct ConstrainComponentPropName                            ComponentName2;                                    // 0x2f8(0x8)
	char                                                         pad0x10_8T1C9[0x10];                               // 0x300(0x10)
	class PhysicsConstraintTemplate*                             ConstraintSetup;                                   // 0x310(0x8)
	struct ConstraintInstance                                    ConstraintInstance;                                // 0x330(0x160)
};


// Size 0x240 (Full Size[0x268] - InheritedSize[0x28]
class Skeleton: public Object
{
public:
	TArray<struct BoneNode>                                      BoneTree;                                          // 0x28(0x10)
	char                                                         pad0x80_GS5JI[0x80];                               // 0x38(0x80)
	TArray<struct SkeletonToMeshLinkup>                          LinkupCache;                                       // 0xb8(0x10)
	TArray<class SkeletalMeshSocket*>                            Sockets;                                           // 0xc8(0x10)
	char                                                         pad0x50_546XB[0x50];                               // 0xd8(0x50)
	struct SmartNameContainer                                    SmartNames;                                        // 0x128(0x50)
	TArray<struct AnimSlotGroup>                                 SlotGroups;                                        // 0x178(0x10)
	char                                                         pad0xe0_4QNRO[0xe0];                               // 0x188(0xe0)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_Animatable: public Interface
{
public:
};


// Size 0x2d0 (Full Size[0x9c0] - InheritedSize[0x6f0]
class SkeletalMeshComponent: public SkinnedMeshComponent
{
public:
	char                                                         pad0x10_08PK8[0x10];                               // 0x6f0(0x10)
	byte                                                         AnimationMode;                                     // 0x700(0x1)
