#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Engine_Structs.h"


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ParticleSystemAggregateTickSettings: public Object
{
public:
	int                                                          FramesTickScaledOver;                              // 0x28(0x4)
	int                                                          MaxTicksPerFrame;                                  // 0x2c(0x4)
	float                                                        PriorityInflationPower;                            // 0x30(0x4)
	char                                                         pad0x4_3PILR[0x4];                                 // 0x34(0x4)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class Polys: public Object
{
public:
	char                                                         pad0x10_0E47H[0x10];                               // 0x28(0x10)
};


// Size 0x878 (Full Size[0x8a0] - InheritedSize[0x28]
class World: public Object
{
public:
	char                                                         pad0x8_LTKRC[0x8];                                 // 0x28(0x8)
	class NetDriver*                                             NetDriver;                                         // 0x30(0x8)
	class LineBatchComponent*                                    LineBatcher;                                       // 0x38(0x8)
	class GameState*                                             GameState;                                         // 0x40(0x8)
	class GameNetworkManager*                                    NetworkManager;                                    // 0x48(0x8)
	char                                                         pad0x10_XKV3K[0x10];                               // 0x50(0x10)
	class Level*                                                 PersistentLevel;                                   // 0x60(0x8)
	char                                                         pad0x20_Y6CTO[0x20];                               // 0x68(0x20)
	class PhysicsCollisionHandler*                               PhysicsCollisionHandler;                           // 0x88(0x8)
	TArray<class Object*>                                        ExtraReferencedObjects;                            // 0x90(0x10)
	class LineBatchComponent*                                    PersistentLineBatcher;                             // 0xa0(0x8)
	class LineBatchComponent*                                    ForegroundLineBatcher;                             // 0xa8(0x8)
	TArray<class Object*>                                        PerModuleDataObjects;                              // 0xb0(0x10)
	TArray<class LevelStreaming*>                                StreamingLevels;                                   // 0xc0(0x10)
	struct FString                                               StreamingLevelsPrefix;                             // 0xd0(0x10)
	class Level*                                                 CurrentLevelPendingVisibility;                     // 0xe0(0x8)
	class ParticleEventManager*                                  MyParticleEventManager;                            // 0xe8(0x8)
	class PhysicsVolume*                                         DefaultPhysicsVolume;                              // 0xf0(0x8)
	TArray<class LevelStreaming*>                                DirtyStreamingLevels;                              // 0xf8(0x10)
	char                                                         pad0x1c_D8PFU[0x1c];                               // 0x108(0x1c)
	struct FName                                                 Feature;                                           // 0x124(0x8)
	char                                                         pad0x4_SXJCY[0x4];                                 // 0x12c(0x4)
	TArray<struct Name>                                          FeatureReferences;                                 // 0x130(0x10)
	bool                                                         ParticleLOD_bUseGameThread;                        // 0x140(0x1)
	bool                                                         ParticleLOD_bUseMultipleViewportCase;              // 0x141(0x1)
	char                                                         pad0x2_3UR90[0x2];                                 // 0x142(0x2)
	struct Vector                                                ParticleLOD_PlayerViewpointLocation;               // 0x144(0xc)
	struct FString                                               TestMetadata;                                      // 0x150(0x10)
	class NavigationSystem*                                      NavigationSystem;                                  // 0x160(0x8)
	char                                                         pad0x20_SJ9J2[0x20];                               // 0x168(0x20)
	class GameMode*                                              AuthorityGameMode;                                 // 0x188(0x8)
	class AISystemBase*                                          AISystem;                                          // 0x190(0x8)
	class AvoidanceManager*                                      AvoidanceManager;                                  // 0x198(0x8)
	TArray<class Level*>                                         Levels;                                            // 0x1a0(0x10)
	char                                                         pad0x70_03FP9[0x70];                               // 0x1b0(0x70)
	class Level*                                                 CurrentLevel;                                      // 0x220(0x8)
	char                                                         pad0x28_HQL75[0x28];                               // 0x228(0x28)
	class GameInstance*                                          OwningGameInstance;                                // 0x250(0x8)
	char                                                         pad0x10_QPIO6[0x10];                               // 0x258(0x10)
	TArray<class MaterialParameterCollectionInstance*>           ParameterCollectionInstances;                      // 0x268(0x10)
	char                                                         pad0x550_PESLK[0x550];                             // 0x278(0x550)
	class WorldComposition*                                      WorldComposition;                                  // 0x7c8(0x8)
	char                                                         pad0x3d_Q77OU[0x3d];                               // 0x7d0(0x3d)
	bool                                                         bAreConstraintsDirty;                              // 0x80d(0x1)
	char                                                         pad0x92_KUG22[0x92];                               // 0x80e(0x92)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InterpFilter: public Object
{
public:
	struct FString                                               Caption;                                           // 0x28(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class GPUSortDestData: public Object
{
public:
	char                                                         pad0x8_GLFSY[0x8];                                 // 0x28(0x8)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class SkeletalMeshSocket: public Object
{
public:
	struct FName                                                 SocketName;                                        // 0x28(0x8)
	struct FName                                                 BoneName;                                          // 0x30(0x8)
	struct Vector                                                RelativeLocation;                                  // 0x38(0xc)
	struct Rotator                                               RelativeRotation;                                  // 0x44(0xc)
	struct Vector                                                RelativeScale;                                     // 0x50(0xc)
	bool                                                         bForceAlwaysAnimated;                              // 0x5c(0x1)
	char                                                         pad0x3_KCHIW[0x3];                                 // 0x5d(0x3)
};


// Size 0xd8 (Full Size[0x100] - InheritedSize[0x28]
class PendingNetGame: public Object
{
public:
	char                                                         pad0x8_1QBQR[0x8];                                 // 0x28(0x8)
	class NetDriver*                                             NetDriver;                                         // 0x30(0x8)
	char                                                         pad0xb0_WK576[0xb0];                               // 0x38(0xb0)
	class Package*                                               PreLoadedMapPackage;                               // 0xe8(0x8)
	class World*                                                 PreLoadedWorld;                                    // 0xf0(0x8)
	char                                                         pad0x8_GJOBL[0x8];                                 // 0xf8(0x8)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class SubUVAnimation: public Object
{
public:
	class Texture2D*                                             SubUVTexture;                                      // 0x28(0x8)
	int                                                          SubImages_Horizontal;                              // 0x30(0x4)
	int                                                          SubImages_Vertical;                                // 0x34(0x4)
	char                                                         BoundingMode;                                      // 0x38(0x1)
	char                                                         OpacitySourceMode;                                 // 0x39(0x1)
	char                                                         pad0x2_4976Q[0x2];                                 // 0x3a(0x2)
	float                                                        AlphaThreshold;                                    // 0x3c(0x4)
	float                                                        SafeMarginSize;                                    // 0x40(0x4)
	char                                                         pad0x44_9T2K3[0x44];                               // 0x44(0x44)
};


// Size 0xb0 (Full Size[0xd8] - InheritedSize[0x28]
class FontImportOptions: public Object
{
public:
	struct FontImportOptionsData                                 Data;                                              // 0x28(0xb0)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlueprintFunctionLibrary: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NetPhysicsInterpolatorInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PlatformInterfaceBase: public Object
{
public:
	TArray<struct DelegateArray>                                 AllDelegates;                                      // 0x28(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class CurveBase: public Object
{
public:
	char                                                         pad0x8_G75HK[0x8];                                 // 0x28(0x8)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class NavigationPath: public Object
{
public:
	char                                                         pad0x10_V4FNJ[0x10];                               // 0x28(0x10)
	TArray<struct Vector>                                        PathPoints;                                        // 0x38(0x10)
	char                                                         RecalculateOnInvalidation;                         // 0x48(0x1)
	char                                                         pad0x3f_6NXER[0x3f];                               // 0x49(0x3f)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class VertexAnimBase: public Object
{
public:
	class SkeletalMesh*                                          BaseSkelMesh;                                      // 0x28(0x8)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class SoundGroups: public Object
{
public:
	TArray<struct SoundGroup>                                    SoundGroupProfiles;                                // 0x28(0x10)
	char                                                         pad0x50_JB810[0x50];                               // 0x38(0x50)
};


// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class AvoidanceManager: public Object
{
public:
	char                                                         pad0x8_0DI2P[0x8];                                 // 0x28(0x8)
	float                                                        DefaultTimeToLive;                                 // 0x30(0x4)
	float                                                        LockTimeAfterAvoid;                                // 0x34(0x4)
	float                                                        LockTimeAfterClean;                                // 0x38(0x4)
	float                                                        DeltaTimeToPredict;                                // 0x3c(0x4)
	float                                                        ArtificialRadiusExpansion;                         // 0x40(0x4)
	float                                                        TestHeightDifference;                              // 0x44(0x4)
	char                                                         pad0x80_U1PIS[0x80];                               // 0x48(0x80)
};


// Size 0xd0 (Full Size[0xf8] - InheritedSize[0x28]
class PhysicsAsset: public Object
{
public:
	TArray<class BodySetup*>                                     BodySetup;                                         // 0x28(0x10)
	TArray<int>                                                  BoundsBodies;                                      // 0x38(0x10)
	TArray<class PhysicsConstraintTemplate*>                     ConstraintSetup;                                   // 0x48(0x10)
	char                                                         pad0xa0_CVFJW[0xa0];                               // 0x58(0xa0)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class GameUserSettings: public Object
{
public:
	bool                                                         bUseVSync;                                         // 0x28(0x1)
	char                                                         pad0x1f_5KBNT[0x1f];                               // 0x29(0x1f)
	int                                                          WindowPosX;                                        // 0x58(0x4)
	int                                                          WindowPosY;                                        // 0x5c(0x4)
	bool                                                         bUseDesktopResolutionForFullscreen;                // 0x60(0x1)
	char                                                         pad0x3_L3YHE[0x3];                                 // 0x61(0x3)
	int                                                          FullscreenMode;                                    // 0x64(0x4)
	int                                                          LastConfirmedFullscreenMode;                       // 0x68(0x4)
	int                                                          AudioQualityLevel;                                 // 0x70(0x4)
	char                                                         pad0x4_HBD4G[0x4];                                 // 0x74(0x4)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class Channel: public Object
{
public:
	class NetConnection*                                         Connection;                                        // 0x28(0x8)
	char                                                         pad0x38_BBALA[0x38];                               // 0x30(0x38)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class SoundMix: public Object
{
public:
	bool                                                         bApplyEQ;                                          // 0x28(0x1)
	char                                                         pad0x3_WXZ83[0x3];                                 // 0x29(0x3)
	float                                                        EQPriority;                                        // 0x2c(0x4)
	struct AudioEQEffect                                         EQSettings;                                        // 0x30(0x28)
	TArray<struct SoundClassAdjuster>                            SoundClassEffects;                                 // 0x58(0x10)
	float                                                        InitialDelay;                                      // 0x68(0x4)
	float                                                        FadeInTime;                                        // 0x6c(0x4)
	float                                                        Duration;                                          // 0x70(0x4)
	float                                                        FadeOutTime;                                       // 0x74(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_AssetUserData: public Interface
{
public:
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class GameInstance: public Object
{
public:
	char                                                         pad0x10_0PNPW[0x10];                               // 0x28(0x10)
	TArray<class LocalPlayer*>                                   LocalPlayers;                                      // 0x38(0x10)
	char                                                         pad0x8_BZ1NV[0x8];                                 // 0x48(0x8)
	class OnlineSession*                                         OnlineSession;                                     // 0x50(0x8)
	char                                                         pad0x30_5Z56Y[0x30];                               // 0x58(0x30)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EndUserSettings: public Object
{
public:
	char                                                         pad0x8_EHKT2[0x8];                                 // 0x28(0x8)
	bool                                                         bSendAnonymousUsageDataToEpic;                     // 0x30(0x1)
	char                                                         pad0x7_STAPY[0x7];                                 // 0x31(0x7)
};


// Size 0x110 (Full Size[0x138] - InheritedSize[0x28]
class HIKCharacterization: public Object
{
public:
	struct FName                                                 Reference;                                         // 0x28(0x8)
	struct FName                                                 Hips;                                              // 0x30(0x8)
	struct FName                                                 LeftUpLeg;                                         // 0x38(0x8)
	struct FName                                                 LeftLeg;                                           // 0x40(0x8)
	struct FName                                                 LeftFoot;                                          // 0x48(0x8)
	struct FName                                                 RightUpLeg;                                        // 0x50(0x8)
	struct FName                                                 RightLeg;                                          // 0x58(0x8)
	struct FName                                                 RightFoot;                                         // 0x60(0x8)
	struct FName                                                 Spine;                                             // 0x68(0x8)
	struct FName                                                 LeftArm;                                           // 0x70(0x8)
	struct FName                                                 LeftForeArm;                                       // 0x78(0x8)
	struct FName                                                 LeftHand;                                          // 0x80(0x8)
	struct FName                                                 RightArm;                                          // 0x88(0x8)
	struct FName                                                 RightForeArm;                                      // 0x90(0x8)
	struct FName                                                 RightHand;                                         // 0x98(0x8)
	struct FName                                                 Head;                                              // 0xa0(0x8)
	TArray<struct HIKBoneTransform>                              BoneTransforms;                                    // 0xa8(0x10)
	bool                                                         Locked;                                            // 0xb8(0x1)
	char                                                         pad0x7_EY072[0x7];                                 // 0xb9(0x7)
	TArray<int>                                                  UnrealToHumanIKBoneMapping;                        // 0xc0(0x10)
	TArray<struct HIKBoneMapping>                                AdditionalBones;                                   // 0xd0(0x10)
	bool                                                         LeftElbowInverted;                                 // 0xe0(0x1)
	bool                                                         RightElbowInverted;                                // 0xe1(0x1)
	bool                                                         LeftKneeInverted;                                  // 0xe2(0x1)
	bool                                                         RightKneeInverted;                                 // 0xe3(0x1)
	bool                                                         AdjustLeftShoulder;                                // 0xe4(0x1)
	char                                                         pad0x3_EDCT8[0x3];                                 // 0xe5(0x3)
	struct Vector                                                AdjustLeftShoulder_Axis;                           // 0xe8(0xc)
	float                                                        AdjustLeftShoulder_Angle;                          // 0xf4(0x4)
	bool                                                         AdjustRightShoulder;                               // 0xf8(0x1)
	char                                                         pad0x3_BJ4HA[0x3];                                 // 0xf9(0x3)
	struct Vector                                                AdjustRightShoulder_Axis;                          // 0xfc(0xc)
	float                                                        AdjustRightShoulder_Angle;                         // 0x108(0x4)
	bool                                                         SpineSquashNStretch;                               // 0x10c(0x1)
	bool                                                         NeckSquashNStretch;                                // 0x10d(0x1)
	char                                                         pad0x2_5IJXP[0x2];                                 // 0x10e(0x2)
	float                                                        SpineJointsMinSquashNStretchFactor;                // 0x110(0x4)
	float                                                        SpineJointsMaxSquashNStretchFactor;                // 0x114(0x4)
	float                                                        NeckJointsMinSquashNStretchFactor;                 // 0x118(0x4)
	float                                                        NeckJointsMaxSquashNStretchFactor;                 // 0x11c(0x4)
	bool                                                         bInitFromSkeleton;                                 // 0x120(0x1)
	char                                                         pad0x3_RQ4PW[0x3];                                 // 0x121(0x3)
	int                                                          InitFromSkeletonCount;                             // 0x124(0x4)
	struct Rotator                                               ImportRotator;                                     // 0x128(0xc)
	char                                                         pad0x4_S2PNA[0x4];                                 // 0x134(0x4)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class NavArea: public Object
{
public:
	float                                                        DefaultCost;                                       // 0x28(0x4)
	float                                                        FixedAreaEnteringCost;                             // 0x2c(0x4)
	struct Color                                                 DrawColor;                                         // 0x30(0x4)
	struct NavAgentSelector                                      SupportedAgents;                                   // 0x34(0x4)
	bool                                                         bSupportsAgent0;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent1;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent2;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent3;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent4;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent5;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent6;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent7;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent8;                                   // 0x39(0x1)
	bool                                                         bSupportsAgent9;                                   // 0x39(0x1)
	bool                                                         bSupportsAgent10;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent11;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent12;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent13;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent14;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent15;                                  // 0x39(0x1)
	char                                                         pad0x6_Z3P8F[0x6];                                 // 0x3a(0x6)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class Exporter: public Object
{
public:
	class UClass*                                                SupportedClass;                                    // 0x28(0x8)
	class Object*                                                ExportRootScope;                                   // 0x30(0x8)
	TArray<String>                                               FormatExtension;                                   // 0x38(0x10)
	TArray<String>                                               FormatDescription;                                 // 0x48(0x10)
	int                                                          PreferredFormatIndex;                              // 0x58(0x4)
	int                                                          TextIndent;                                        // 0x5c(0x4)
	bool                                                         bText;                                             // 0x60(0x1)
	bool                                                         bSelectedOnly;                                     // 0x60(0x1)
	bool                                                         bForceFileOperations;                              // 0x60(0x1)
	char                                                         pad0x7_PKKSG[0x7];                                 // 0x61(0x7)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class HighLatencySettings: public Object
{
public:
	bool                                                         UseHighLatency;                                    // 0x28(0x1)
	char                                                         pad0x3_HGINK[0x3];                                 // 0x29(0x3)
	int                                                          PktLag;                                            // 0x2c(0x4)
	int                                                          PktLagVariance;                                    // 0x30(0x4)
	bool                                                         PktOrder;                                          // 0x34(0x1)
	char                                                         pad0x3_UHHEX[0x3];                                 // 0x35(0x3)
	int                                                          PktDup;                                            // 0x38(0x4)
	int                                                          PktLoss;                                           // 0x3c(0x4)
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class ActorComponent: public Object
{
public:
	char                                                         TargetNetDormancy;                                 // 0x28(0x1)
	char                                                         CreationMethod;                                    // 0x29(0x1)
	char                                                         pad0x6_09LQW[0x6];                                 // 0x2a(0x6)
	struct ActorComponentTickFunction                            PrimaryComponentTick;                              // 0x30(0x50)
	TArray<struct Name>                                          ComponentTags;                                     // 0x80(0x10)
	TArray<struct SimpleMemberReference>                         UCSModifiedProperties;                             // 0x90(0x10)
	char                                                         pad0x10_7RVS1[0x10];                               // 0xa0(0x10)
	bool                                                         bReplicates;                                       // 0xb0(0x1)
	bool                                                         bNetAddressable;                                   // 0xb0(0x1)
	bool                                                         bAutoActivate;                                     // 0xb1(0x1)
	bool                                                         bIsActive;                                         // 0xb1(0x1)
	bool                                                         bEditableWhenInherited;                            // 0xb2(0x1)
	bool                                                         bNeedsLoadForClient;                               // 0xb3(0x1)
	bool                                                         bNeedsLoadForServer;                               // 0xb3(0x1)
	char                                                         pad0x4_BC402[0x4];                                 // 0xb4(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AssetUserData: public Object
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class DeviceProfileManager: public Object
{
public:
	TArray<class Object*>                                        Profiles;                                          // 0x28(0x10)
	char                                                         pad0x20_BHVYH[0x20];                               // 0x38(0x20)
};


// Size 0x100 (Full Size[0x128] - InheritedSize[0x28]
class HapticFeedbackEffect: public Object
{
public:
	struct HapticFeedbackDetails                                 HapticDetails;                                     // 0x28(0x100)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ForceFeedbackEffect: public Object
{
public:
	TArray<struct ForceFeedbackChannelDetails>                   ChannelDetails;                                    // 0x28(0x10)
	float                                                        Duration;                                          // 0x38(0x4)
	char                                                         pad0x4_B37PA[0x4];                                 // 0x3c(0x4)
};


// Size 0x2a0 (Full Size[0x2c8] - InheritedSize[0x28]
class BodySetup: public Object
{
public:
	struct KAggregateGeom                                        AggGeom;                                           // 0x28(0x48)
	struct FName                                                 BoneName;                                          // 0x70(0x8)
	char                                                         PhysicsType;                                       // 0x78(0x1)
	char                                                         pad0x3_K0F5L[0x3];                                 // 0x79(0x3)
	bool                                                         bCookComplexGeometryOnServer;                      // 0x7c(0x1)
	bool                                                         bConsiderForBounds;                                // 0x7c(0x1)
	bool                                                         bMeshCollideAll;                                   // 0x7c(0x1)
	bool                                                         bDoubleSidedGeometry;                              // 0x7c(0x1)
	bool                                                         bGenerateNonMirroredCollision;                     // 0x7c(0x1)
	bool                                                         bSharedCookedData;                                 // 0x7c(0x1)
	bool                                                         bGenerateMirroredCollision;                        // 0x7c(0x1)
	char                                                         pad0x3_ZJNAP[0x3];                                 // 0x7d(0x3)
	class PhysicalMaterial*                                      PhysMaterial;                                      // 0x80(0x8)
	char                                                         CollisionReponse;                                  // 0x88(0x1)
	char                                                         CollisionTraceFlag;                                // 0x89(0x1)
	char                                                         pad0x6_Q8V2D[0x6];                                 // 0x8a(0x6)
	struct BodyInstance                                          DefaultInstance;                                   // 0x90(0x180)
	struct WalkableSlopeOverride                                 WalkableSlopeOverride;                             // 0x210(0x8)
	struct Vector                                                BuildScale3D;                                      // 0x218(0xc)
	char                                                         pad0xa4_7Z4LH[0xa4];                               // 0x224(0xa4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CameraViewTargetInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DynamicBlueprintBinding: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EdGraphSchema: public Object
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class Layer: public Object
{
public:
	struct FName                                                 LayerName;                                         // 0x28(0x8)
	bool                                                         bIsVisible;                                        // 0x30(0x1)
	char                                                         pad0x7_CHWOO[0x7];                                 // 0x31(0x7)
	TArray<struct LayerActorStats>                               ActorStats;                                        // 0x38(0x10)
};


// Size 0xc8 (Full Size[0xf0] - InheritedSize[0x28]
class AnimSet: public Object
{
public:
	bool                                                         bAnimRotationOnly;                                 // 0x28(0x1)
	char                                                         pad0x7_486QO[0x7];                                 // 0x29(0x7)
	TArray<struct Name>                                          TrackBoneNames;                                    // 0x30(0x10)
	TArray<struct AnimSetMeshLinkup>                             LinkupCache;                                       // 0x40(0x10)
	TArray<char>                                                 BoneUseAnimTranslation;                            // 0x50(0x10)
	TArray<char>                                                 ForceUseMeshTranslation;                           // 0x60(0x10)
	TArray<struct Name>                                          UseTranslationBoneNames;                           // 0x70(0x10)
	TArray<struct Name>                                          ForceMeshTranslationBoneNames;                     // 0x80(0x10)
	struct FName                                                 PreviewSkelMeshName;                               // 0x90(0x8)
	struct FName                                                 BestRatioSkelMeshName;                             // 0x98(0x8)
	char                                                         pad0x50_BJ77I[0x50];                               // 0xa0(0x50)
};


// Size 0x100 (Full Size[0x128] - InheritedSize[0x28]
class EdGraphPin: public Object
{
public:
	struct FString                                               PinName;                                           // 0x28(0x10)
	struct FString                                               PinToolTip;                                        // 0x38(0x10)
	char                                                         Direction;                                         // 0x48(0x1)
	char                                                         pad0x7_NUD44[0x7];                                 // 0x49(0x7)
	struct EdGraphPinType                                        PinType;                                           // 0x50(0x50)
	struct FString                                               DefaultValue;                                      // 0xa0(0x10)
	struct FString                                               AutogeneratedDefaultValue;                         // 0xb0(0x10)
	class Object*                                                DefaultObject;                                     // 0xc0(0x8)
	struct FText                                                 DefaultTextValue;                                  // 0xc8(0x38)
	TArray<class EdGraphPin*>                                    LinkedTo;                                          // 0x100(0x10)
	TArray<class EdGraphPin*>                                    SubPins;                                           // 0x110(0x10)
	class EdGraphPin*                                            ParentPin;                                         // 0x120(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ParticleModuleEventSendToGame: public Object
{
public:
};


// Size 0x0 (Full Size[0x0] - InheritedSize[0x0]
class Default__BlueprintGeneratedClass
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AnimStateMachineTypes: public Object
{
public:
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class TimelineTemplate: public Object
{
public:
	float                                                        TimelineLength;                                    // 0x28(0x4)
	char                                                         LengthMode;                                        // 0x2c(0x1)
	char                                                         pad0x3_G3VKW[0x3];                                 // 0x2d(0x3)
	bool                                                         bAutoPlay;                                         // 0x30(0x1)
	bool                                                         bLoop;                                             // 0x30(0x1)
	bool                                                         bReplicated;                                       // 0x30(0x1)
	bool                                                         bValidatedAsWired;                                 // 0x30(0x1)
	char                                                         pad0x7_JULF0[0x7];                                 // 0x31(0x7)
	TArray<struct TTEventTrack>                                  EventTracks;                                       // 0x38(0x10)
	TArray<struct TTFloatTrack>                                  FloatTracks;                                       // 0x48(0x10)
	TArray<struct TTVectorTrack>                                 VectorTracks;                                      // 0x58(0x10)
	TArray<struct TTLinearColorTrack>                            LinearColorTracks;                                 // 0x68(0x10)
	TArray<struct BPVariableMetaDataEntry>                       MetaDataArray;                                     // 0x78(0x10)
	struct Guid                                                  TimelineGuid;                                      // 0x88(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class IntSerialization: public Object
{
public:
	char                                                         pad0x20_QDOSC[0x20];                               // 0x28(0x20)
	char                                                         UnsignedInt8Variable;                              // 0x48(0x1)
	char                                                         pad0x3_96Y82[0x3];                                 // 0x49(0x3)
	int                                                          SignedInt32Variable;                               // 0x4c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavigationTypes: public Object
{
public:
};


// Size 0x110 (Full Size[0x138] - InheritedSize[0x28]
class StaticMesh: public Object
{
public:
	char                                                         pad0x18_TPUBW[0x18];                               // 0x28(0x18)
	int                                                          MinLOD;                                            // 0x40(0x4)
	char                                                         pad0x4_W7CYU[0x4];                                 // 0x44(0x4)
	TArray<class MaterialInterface*>                             Materials;                                         // 0x48(0x10)
	int                                                          LightMapResolution;                                // 0x58(0x4)
	int                                                          LightMapCoordinateIndex;                           // 0x5c(0x4)
	class BodySetup*                                             BodySetup;                                         // 0x60(0x8)
	int                                                          LODForCollision;                                   // 0x68(0x4)
	bool                                                         bUseMaximumStreamingTexelRatio;                    // 0x6c(0x1)
	bool                                                         bStripComplexCollisionForConsole;                  // 0x6c(0x1)
	bool                                                         bHasNavigationData;                                // 0x6c(0x1)
	char                                                         pad0x3_7G3OL[0x3];                                 // 0x6d(0x3)
	float                                                        StreamingDistanceMultiplier;                       // 0x70(0x4)
	float                                                        LpvBiasMultiplier;                                 // 0x74(0x4)
	char                                                         pad0x30_SEZTF[0x30];                               // 0x78(0x30)
	TArray<class StaticMeshSocket*>                              Sockets;                                           // 0xa8(0x10)
	char                                                         pad0x18_J6GQX[0x18];                               // 0xb8(0x18)
	struct Vector                                                PositiveBoundsExtension;                           // 0xd0(0xc)
	struct Vector                                                NegativeBoundsExtension;                           // 0xdc(0xc)
	struct BoxSphereBounds                                       ExtendedBounds;                                    // 0xe8(0x1c)
	char                                                         pad0x4_8Q5PF[0x4];                                 // 0x104(0x4)
	TArray<String>                                               SourceMaterials;                                   // 0x108(0x10)
	int                                                          UVsForStreaming;                                   // 0x118(0x4)
	int                                                          ElementToIgnoreForTexFactor;                       // 0x11c(0x4)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x120(0x10)
	class NavCollision*                                          NavCollision;                                      // 0x130(0x8)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class EdGraph: public Object
{
public:
	class UClass*                                                Schema;                                            // 0x28(0x8)
	TArray<class EdGraphNode*>                                   Nodes;                                             // 0x30(0x10)
	bool                                                         bEditable;                                         // 0x40(0x1)
	bool                                                         bAllowDeletion;                                    // 0x40(0x1)
	bool                                                         bAllowRenaming;                                    // 0x40(0x1)
	char                                                         pad0x1f_RG8TO[0x1f];                               // 0x41(0x1f)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class BookMark2D: public Object
{
public:
	float                                                        Zoom2D;                                            // 0x28(0x4)
	struct IntPoint                                              Location;                                          // 0x2c(0x8)
	char                                                         pad0x4_FXTHK[0x4];                                 // 0x34(0x4)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class AutomationTestUserSettings: public Object
{
public:
	bool                                                         FilterTests;                                       // 0x28(0x1)
	char                                                         pad0x7_459C7[0x7];                                 // 0x29(0x7)
	TArray<String>                                               IncludedTestsPrefix;                               // 0x30(0x10)
	TArray<String>                                               ExcludedTestsPrefix;                               // 0x40(0x10)
	bool                                                         IncludeEpicTests;                                  // 0x50(0x1)
	char                                                         pad0x7_91PVG[0x7];                                 // 0x51(0x7)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class DeveloperSettings: public Object
{
public:
	char                                                         pad0x10_OSM7T[0x10];                               // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DialogueTypes: public Object
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class InterpGroupInst: public Object
{
public:
	class InterpGroup*                                           Group;                                             // 0x28(0x8)
	class Actor*                                                 GroupActor;                                        // 0x30(0x8)
	TArray<class InterpTrackInst*>                               TrackInst;                                         // 0x38(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class NavigationDataChunk: public Object
{
public:
	struct FName                                                 NavigationDataName;                                // 0x28(0x8)
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class ParticleSystem: public Object
{
public:
	char                                                         SystemUpdateMode;                                  // 0x28(0x1)
	char                                                         pad0x3_S403Z[0x3];                                 // 0x29(0x3)
	float                                                        UpdateTime_FPS;                                    // 0x2c(0x4)
	float                                                        UpdateTime_Delta;                                  // 0x30(0x4)
	float                                                        WarmUpTime;                                        // 0x34(0x4)
	float                                                        WarmupTickRate;                                    // 0x38(0x4)
	char                                                         pad0x4_TTO99[0x4];                                 // 0x3c(0x4)
	TArray<class ParticleEmitter*>                               Emitters;                                          // 0x40(0x10)
	class ParticleSystemComponent*                               PreviewComponent;                                  // 0x50(0x8)
	class InterpCurveEdSetup*                                    CurveEdSetup;                                      // 0x58(0x8)
	bool                                                         bOrientZAxisTowardCamera;                          // 0x60(0x1)
	char                                                         pad0x3_SQHOB[0x3];                                 // 0x61(0x3)
	float                                                        LODDistanceCheckTime;                              // 0x64(0x4)
	char                                                         LODMethod;                                         // 0x68(0x1)
	char                                                         pad0x7_CHR5G[0x7];                                 // 0x69(0x7)
	TArray<float>                                                LODDistances;                                      // 0x70(0x10)
	bool                                                         bRegenerateLODDuplicate;                           // 0x80(0x1)
	char                                                         pad0x7_GE8NO[0x7];                                 // 0x81(0x7)
	TArray<struct ParticleSystemLOD>                             LODSettings;                                       // 0x88(0x10)
	bool                                                         bIgnoreBoundsRotation;                             // 0x98(0x1)
	bool                                                         bBoostParticleAggregationPriority;                 // 0x98(0x1)
	bool                                                         bUseFixedRelativeBoundingBox;                      // 0x98(0x1)
	char                                                         pad0x3_7K4TN[0x3];                                 // 0x99(0x3)
	struct Box                                                   FixedRelativeBoundingBox;                          // 0x9c(0x1c)
	bool                                                         bUseLowResTranslucencyBoundingBox;                 // 0xb8(0x1)
	char                                                         pad0x3_CBGF3[0x3];                                 // 0xb9(0x3)
	struct Box                                                   LowResTranslucencyBoundingBox;                     // 0xbc(0x1c)
	float                                                        SecondsBeforeInactive;                             // 0xd8(0x4)
	bool                                                         bShouldResetPeakCounts;                            // 0xdc(0x1)
	bool                                                         bHasPhysics;                                       // 0xdc(0x1)
	bool                                                         bPostPhysicsTick;                                  // 0xdc(0x1)
	bool                                                         bUseRealtimeThumbnail;                             // 0xdc(0x1)
	bool                                                         ThumbnailImageOutOfDate;                           // 0xdc(0x1)
	char                                                         pad0x3_LSHM9[0x3];                                 // 0xdd(0x3)
	float                                                        Delay;                                             // 0xe0(0x4)
	float                                                        DelayLow;                                          // 0xe4(0x4)
	bool                                                         bUseDelayRange;                                    // 0xe8(0x1)
	char                                                         pad0x3_360XT[0x3];                                 // 0xe9(0x3)
	struct Vector                                                MacroUVPosition;                                   // 0xec(0xc)
	float                                                        MacroUVRadius;                                     // 0xf8(0x4)
	char                                                         OcclusionBoundsMethod;                             // 0xfc(0x1)
	char                                                         pad0x3_VEC45[0x3];                                 // 0xfd(0x3)
	struct Box                                                   CustomOcclusionBounds;                             // 0x100(0x1c)
	char                                                         pad0x4_ADV86[0x4];                                 // 0x11c(0x4)
	TArray<struct LODSoloTrack>                                  SoloTracking;                                      // 0x120(0x10)
	TArray<struct NamedEmitterMaterial>                          NamedMaterialSlots;                                // 0x130(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PhysicalMaterialPropertyBase: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LocalMessage: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_Animatable: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class InstancedNavMeshInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavLinkHostInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavLinkCustomInterface: public Interface
{
public:
};


// Size 0x5f0 (Full Size[0x618] - InheritedSize[0x28]
class CheckBoxStyleAsset: public Object
{
public:
	struct CheckBoxStyle                                         CheckBoxStyle;                                     // 0x28(0x5f0)
};


// Size 0x68 (Full Size[0x228] - InheritedSize[0x1c0]
class BlueprintGeneratedClass: public Class
{
public:
	int                                                          NumReplicatedProperties;                           // 0x1c0(0x4)
	char                                                         pad0x4_6J00R[0x4];                                 // 0x1c4(0x4)
	TArray<class DynamicBlueprintBinding*>                       DynamicBindingObjects;                             // 0x1c8(0x10)
	TArray<class ActorComponent*>                                ComponentTemplates;                                // 0x1d8(0x10)
	TArray<class TimelineTemplate*>                              Timelines;                                         // 0x1e8(0x10)
	class SimpleConstructionScript*                              SimpleConstructionScript;                          // 0x1f8(0x8)
	class InheritableComponentHandler*                           InheritableComponentHandler;                       // 0x200(0x8)
	class StructProperty*                                        UberGraphFramePointerProperty;                     // 0x208(0x8)
	class Function*                                              UberGraphFunction;                                 // 0x210(0x8)
	TArray<struct EventGraphFastCallPair>                        FastCallPairs;                                     // 0x218(0x10)
};


// Size 0x550 (Full Size[0x578] - InheritedSize[0x28]
class Model: public Object
{
public:
	char                                                         pad0x550_ADL2S[0x550];                             // 0x28(0x550)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EngineTypes: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavAgentInterface: public Interface
{
public:
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class WorldComposition: public Object
{
public:
	char                                                         pad0x70_Q5SZX[0x70];                               // 0x28(0x70)
	TArray<class LevelStreaming*>                                TilesStreaming;                                    // 0x98(0x10)
	double                                                       TilesStreamingTimeThreshold;                       // 0xa8(0x8)
	bool                                                         bLoadAllTilesDuringCinematic;                      // 0xb0(0x1)
	bool                                                         bRebaseOriginIn3DSpace;                            // 0xb1(0x1)
	char                                                         pad0x2_AKIEP[0x2];                                 // 0xb2(0x2)
	float                                                        RebaseOriginDistance;                              // 0xb4(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class InterpTrackInst: public Object
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AnimationAsset: public Object
{
public:
	class Skeleton*                                              Skeleton;                                          // 0x28(0x8)
	char                                                         pad0x10_724E9[0x10];                               // 0x30(0x10)
	TArray<class AnimMetaData*>                                  MetaData;                                          // 0x40(0x10)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class MaterialParameterCollection: public Object
{
public:
	struct Guid                                                  StateId;                                           // 0x28(0x10)
	TArray<struct CollectionScalarParameter>                     ScalarParameters;                                  // 0x38(0x10)
	TArray<struct CollectionVectorParameter>                     VectorParameters;                                  // 0x48(0x10)
	char                                                         pad0x8_0EMH8[0x8];                                 // 0x58(0x8)
};


// Size 0xc8 (Full Size[0xf0] - InheritedSize[0x28]
class Canvas: public Object
{
public:
	float                                                        OrgX;                                              // 0x28(0x4)
	float                                                        OrgY;                                              // 0x2c(0x4)
	float                                                        ClipX;                                             // 0x30(0x4)
	float                                                        ClipY;                                             // 0x34(0x4)
	struct Color                                                 DrawColor;                                         // 0x38(0x4)
	bool                                                         bCenterX;                                          // 0x3c(0x1)
	bool                                                         bCenterY;                                          // 0x3c(0x1)
	bool                                                         bNoSmooth;                                         // 0x3c(0x1)
	char                                                         pad0x3_T2SSF[0x3];                                 // 0x3d(0x3)
	int                                                          SizeX;                                             // 0x40(0x4)
	int                                                          SizeY;                                             // 0x44(0x4)
	char                                                         pad0x8_PVSZD[0x8];                                 // 0x48(0x8)
	struct Plane                                                 ColorModulate;                                     // 0x50(0x10)
	class Texture2D*                                             DefaultTexture;                                    // 0x60(0x8)
	class Texture2D*                                             GradientTexture0;                                  // 0x68(0x8)
	class ReporterGraph*                                         ReporterGraph;                                     // 0x70(0x8)
	char                                                         pad0x78_O0QP2[0x78];                               // 0x78(0x78)
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class UserDefinedStruct: public ScriptStruct
{
public:
	struct Guid                                                  Guid;                                              // 0x98(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SaveGame: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AssetImportData: public Object
{
public:
};


// Size 0x378 (Full Size[0x3a0] - InheritedSize[0x28]
class Actor: public Object
{
public:
	struct ActorTickFunction                                     PrimaryActorTick;                                  // 0x28(0x50)
	float                                                        CustomTimeDilation;                                // 0x78(0x4)
	bool                                                         bAllowRemovalFromServerWhenCollisionMerged;        // 0x7c(0x1)
	bool                                                         bAllowRemovalFromServerWhenAutomaticallyInstanced; // 0x7c(0x1)
	bool                                                         bHidden;                                           // 0x7c(0x1)
	bool                                                         bNetTemporary;                                     // 0x7c(0x1)
	bool                                                         bNetStartup;                                       // 0x7c(0x1)
	bool                                                         bOnlyRelevantToOwner;                              // 0x7c(0x1)
	bool                                                         bAlwaysRelevant;                                   // 0x7c(0x1)
	bool                                                         bReplicateMovement;                                // 0x7c(0x1)
	bool                                                         bTearOff;                                          // 0x7d(0x1)
	bool                                                         bExchangedRoles;                                   // 0x7d(0x1)
	bool                                                         bPendingNetUpdate;                                 // 0x7d(0x1)
	bool                                                         bNetLoadOnClient;                                  // 0x7d(0x1)
	bool                                                         bNetUseOwnerRelevancy;                             // 0x7d(0x1)
	bool                                                         bBlockInput;                                       // 0x7d(0x1)
	bool                                                         bCanBeInCluster;                                   // 0x7d(0x1)
	bool                                                         bActorEnableCollision;                             // 0x7e(0x1)
	bool                                                         bReplicateAttachment;                              // 0x7e(0x1)
	bool                                                         bCollideWhenPlacing;                               // 0x7e(0x1)
	bool                                                         bFindCameraComponentWhenViewTarget;                // 0x7e(0x1)
	bool                                                         bRelevantForNetworkReplays;                        // 0x7f(0x1)
	bool                                                         bActorVisible;                                     // 0x7f(0x1)
	bool                                                         bAutoDestroyWhenFinished;                          // 0x7f(0x1)
	bool                                                         bCanBeDamaged;                                     // 0x7f(0x1)
	bool                                                         bReplicates;                                       // 0x7f(0x1)
	bool                                                         bAllowReceiveTickEventOnDedicatedServer;           // 0x7f(0x1)
	bool                                                         bActorIsBeingDestroyed;                            // 0x7f(0x1)
	char                                                         RemoteRole;                                        // 0x83(0x1)
	char                                                         Role;                                              // 0x84(0x1)
	char                                                         SpawnRestrictions;                                 // 0x85(0x1)
	char                                                         pad0x1_FTAPT[0x1];                                 // 0x86(0x1)
	char                                                         AutoReceiveInput;                                  // 0x87(0x1)
	class Actor*                                                 Owner;                                             // 0x88(0x8)
	struct RepMovement                                           ReplicatedMovement;                                // 0x90(0x38)
	struct RepAttachment                                         AttachmentReplication;                             // 0xc8(0x48)
	char                                                         pad0x4_OM3EI[0x4];                                 // 0x110(0x4)
	int                                                          InputPriority;                                     // 0x114(0x4)
	class InputComponent*                                        InputComponent;                                    // 0x118(0x8)
	float                                                        NetCullDistanceSquared;                            // 0x120(0x4)
	char                                                         pad0x4_5N0DZ[0x4];                                 // 0x124(0x4)
	int                                                          NetTag;                                            // 0x128(0x4)
	float                                                        NetUpdateTime;                                     // 0x12c(0x4)
	float                                                        NetUpdateFrequency;                                // 0x130(0x4)
	float                                                        NetPriority;                                       // 0x134(0x4)
	float                                                        LastNetUpdateTime;                                 // 0x138(0x4)
	struct FName                                                 NetDriverName;                                     // 0x13c(0x8)
	char                                                         pad0x4_1XKYA[0x4];                                 // 0x144(0x4)
	class Pawn*                                                  Instigator;                                        // 0x148(0x8)
	TArray<class Actor*>                                         Children;                                          // 0x150(0x10)
	class SceneComponent*                                        RootComponent;                                     // 0x160(0x8)
	TArray<class MatineeActor*>                                  ControllingMatineeActors;                          // 0x168(0x10)
	float                                                        InitialLifeSpan;                                   // 0x178(0x4)
	char                                                         pad0x4_J7XV5[0x4];                                 // 0x17c(0x4)
	TArray<struct Name>                                          Layers;                                            // 0x180(0x10)
	struct ActorPtr                                              ParentComponentActor;                              // 0x190(0x8)
	TArray<uintptr_t>                                            ChildComponentActors;                              // 0x198(0x10)
	bool                                                         bActorSeamlessTraveled;                            // 0x1a8(0x1)
	bool                                                         bIgnoresOriginShifting;                            // 0x1a8(0x1)
	bool                                                         bEnableAutoLODGeneration;                          // 0x1a8(0x1)
	bool                                                         InvertFeatureCheck;                                // 0x1a8(0x1)
	char                                                         pad0x3_5QJEN[0x3];                                 // 0x1a9(0x3)
	struct FName                                                 Feature;                                           // 0x1ac(0x8)
	char                                                         pad0x4_7PAI8[0x4];                                 // 0x1b4(0x4)
	TArray<struct Name>                                          Tags;                                              // 0x1b8(0x10)
	bool                                                         bDoOverlapNotifiesOnLoad;                          // 0x1d5(0x1)
	char                                                         SpawnCollisionHandlingMethod;                      // 0x1d6(0x1)
	char                                                         pad0x129_3B45C[0x129];                             // 0x1d7(0x129)
	TArray<class ActorComponent*>                                BlueprintCreatedComponents;                        // 0x300(0x10)
	TArray<class ActorComponent*>                                InstanceComponents;                                // 0x310(0x10)
	TArray<class Actor*>                                         ChildActorInterfaceProviders;                      // 0x320(0x10)
	char                                                         pad0x68_9J1FP[0x68];                               // 0x330(0x68)
	double                                                       DormancyLingeringInSeconds;                        // 0x398(0x8)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class CurveTable: public Object
{
public:
	char                                                         pad0x50_C9Q46[0x50];                               // 0x28(0x50)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class LightmappedSurfaceCollection: public Object
{
public:
	class Model*                                                 SourceModel;                                       // 0x28(0x8)
	TArray<int>                                                  Surfaces;                                          // 0x30(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class PhysicsCollisionHandler: public Object
{
public:
	float                                                        ImpactThreshold;                                   // 0x28(0x4)
	float                                                        ImpactReFireDelay;                                 // 0x2c(0x4)
	class SoundBase*                                             DefaultImpactSound;                                // 0x30(0x8)
	float                                                        LastImpactSoundTime;                               // 0x38(0x4)
	char                                                         pad0x4_DHTE7[0x4];                                 // 0x3c(0x4)
};


// Size 0x418 (Full Size[0x440] - InheritedSize[0x28]
class AnimInstance: public Object
{
public:
	class Skeleton*                                              CurrentSkeleton;                                   // 0x28(0x8)
	TArray<struct AnimTickRecord>                                UngroupedActivePlayers;                            // 0x30(0x10)
	TArray<struct AnimGroupInstance>                             SyncGroups;                                        // 0x40(0x10)
	TArray<struct ActiveVertexAnim>                              VertexAnims;                                       // 0x50(0x10)
	char                                                         RootMotionMode;                                    // 0x60(0x1)
	bool                                                         bWarnAboutBlueprintUsage;                          // 0x61(0x1)
	char                                                         pad0x6_H4PDM[0x6];                                 // 0x62(0x6)
	bool                                                         bQueueMontageEvents;                               // 0x148(0x1)
	char                                                         pad0xf7_PI8JB[0xf7];                               // 0x149(0xf7)
	TArray<struct AnimNotifyEvent>                               ActiveAnimNotifyState;                             // 0x240(0x10)
	char                                                         pad0x100_EE02B[0x100];                             // 0x250(0x100)
	bool                                                         bBoneCachesInvalidated;                            // 0x3a8(0x1)
	char                                                         pad0x8f_DBD6S[0x8f];                               // 0x3a9(0x8f)
	bool                                                         bBlueprintAnimUpdateEnabled;                       // 0x438(0x1)
	char                                                         pad0x7_LEPZV[0x7];                                 // 0x439(0x7)
};


// Size 0x88 (Full Size[0xb0] - InheritedSize[0x28]
class ParticleEmitter: public Object
{
public:
	struct FName                                                 EmitterName;                                       // 0x28(0x8)
	int                                                          SubUVDataOffset;                                   // 0x30(0x4)
	char                                                         EmitterRenderMode;                                 // 0x34(0x1)
	char                                                         pad0x3_8K1NA[0x3];                                 // 0x35(0x3)
	TArray<class ParticleLODLevel*>                              LODLevels;                                         // 0x38(0x10)
	bool                                                         ConvertedModules;                                  // 0x48(0x1)
	char                                                         pad0x3_IXH5N[0x3];                                 // 0x49(0x3)
	int                                                          PeakActiveParticles;                               // 0x4c(0x4)
	int                                                          InitialAllocationCount;                            // 0x50(0x4)
	float                                                        MediumDetailSpawnRateScale;                        // 0x54(0x4)
	float                                                        QualityLevelSpawnRateScale;                        // 0x58(0x4)
	char                                                         DetailMode;                                        // 0x5c(0x1)
	char                                                         MaxEmitterQuality;                                 // 0x5d(0x1)
	char                                                         MinEmitterQuality;                                 // 0x5e(0x1)
	char                                                         pad0x1_HAB7S[0x1];                                 // 0x5f(0x1)
	bool                                                         bIsSoloing;                                        // 0x60(0x1)
	bool                                                         bCookedOut;                                        // 0x60(0x1)
	bool                                                         bDisabledLODsKeepEmitterAlive;                     // 0x60(0x1)
	bool                                                         bHasAnyEnabledLODs;                                // 0x60(0x1)
	bool                                                         bHasAnyEnabledLODsValid;                           // 0x60(0x1)
	char                                                         pad0x3f_V36HI[0x3f];                               // 0x61(0x3f)
	TArray<class ParticleModule*>                                ModulesNeedingInstanceData;                        // 0xa0(0x10)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class SCS_Node: public Object
{
public:
	class ActorComponent*                                        ComponentTemplate;                                 // 0x28(0x8)
	struct FName                                                 VariableName;                                      // 0x30(0x8)
	struct FName                                                 AttachToName;                                      // 0x38(0x8)
	struct FName                                                 ParentComponentOrVariableName;                     // 0x40(0x8)
	struct FName                                                 ParentComponentOwnerClassName;                     // 0x48(0x8)
	bool                                                         bIsParentComponentNative;                          // 0x50(0x1)
	bool                                                         ServerMigrationFlagSet;                            // 0x51(0x1)
	char                                                         pad0x6_BB7ZQ[0x6];                                 // 0x52(0x6)
	TArray<class SCS_Node*>                                      ChildNodes;                                        // 0x58(0x10)
	TArray<struct BPVariableMetaDataEntry>                       MetaDataArray;                                     // 0x68(0x10)
	struct Guid                                                  VariableGuid;                                      // 0x78(0x10)
};


// Size 0x210 (Full Size[0x238] - InheritedSize[0x28]
class SkeletalMesh: public Object
{
public:
	char                                                         pad0x28_J7AB2[0x28];                               // 0x28(0x28)
	class Skeleton*                                              Skeleton;                                          // 0x50(0x8)
	struct BoxSphereBounds                                       Bounds;                                            // 0x58(0x1c)
	char                                                         pad0x4_S76FS[0x4];                                 // 0x74(0x4)
	TArray<struct SkeletalMaterial>                              Materials;                                         // 0x78(0x10)
	TArray<struct BoneMirrorInfo>                                SkelMirrorTable;                                   // 0x88(0x10)
	char                                                         SkelMirrorAxis;                                    // 0x98(0x1)
	char                                                         SkelMirrorFlipAxis;                                // 0x99(0x1)
	char                                                         pad0x6_5TQVM[0x6];                                 // 0x9a(0x6)
	TArray<struct SkeletalMeshLODInfo>                           LODInfo;                                           // 0xa0(0x10)
	bool                                                         bUseFullPrecisionUVs;                              // 0xb0(0x1)
	bool                                                         bHasBeenSimplified;                                // 0xb0(0x1)
	bool                                                         bHasVertexColors;                                  // 0xb0(0x1)
	char                                                         pad0x7_XUDZ7[0x7];                                 // 0xb1(0x7)
	TArray<struct DeformablesSettings>                           DeformablesSettings;                               // 0xb8(0x10)
	bool                                                         bKeepTessellationAdjacency;                        // 0xc8(0x1)
	bool                                                         bKeepSkeletalMeshBuffersInMemory;                  // 0xc8(0x1)
	bool                                                         bEnablePerPolyCollision;                           // 0xc8(0x1)
	char                                                         pad0x7_L0MGI[0x7];                                 // 0xc9(0x7)
	class BodySetup*                                             BodySetup;                                         // 0xd0(0x8)
	class PhysicsAsset*                                          PhysicsAsset;                                      // 0xd8(0x8)
	class HIKCharacterization*                                   Characterization;                                  // 0xe0(0x8)
	class PhysicsAsset*                                          DeformablesPhysicsAsset;                           // 0xe8(0x8)
	float                                                        StreamingDistanceMultiplier;                       // 0xf0(0x4)
	float                                                        StreamingDiscardedTexelRatios;                     // 0xf4(0x4)
	TArray<class MorphTarget*>                                   MorphTargets;                                      // 0xf8(0x10)
	TArray<class MeshPatchAsset*>                                MeshPatchAssets;                                   // 0x108(0x10)
	char                                                         pad0xd8_JPYRD[0xd8];                               // 0x118(0xd8)
	TArray<struct ClothingAssetData>                             ClothingAssets;                                    // 0x1f0(0x10)
	char                                                         pad0x10_CFMAL[0x10];                               // 0x200(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x210(0x10)
	char                                                         pad0x8_7LF9S[0x8];                                 // 0x220(0x8)
	TArray<class SkeletalMeshSocket*>                            Sockets;                                           // 0x228(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class MeshPatchAsset: public Object
{
public:
	char                                                         pad0x10_XZ22R[0x10];                               // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlendableInterface: public Interface
{
public:
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class SoundClass: public Object
{
public:
	struct SoundClassProperties                                  Properties;                                        // 0x28(0x24)
	char                                                         pad0x4_0FS8H[0x4];                                 // 0x4c(0x4)
	TArray<class SoundClass*>                                    ChildClasses;                                      // 0x50(0x10)
	TArray<struct PassiveSoundMixModifier>                       PassiveSoundMixModifiers;                          // 0x60(0x10)
	class SoundClass*                                            ParentClass;                                       // 0x70(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_CollisionDataProvider: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavNodeInterface: public Interface
{
public:
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class CameraShake: public Object
{
public:
	bool                                                         bSingleInstance;                                   // 0x28(0x1)
	char                                                         pad0x3_MINCA[0x3];                                 // 0x29(0x3)
	float                                                        OscillationDuration;                               // 0x2c(0x4)
	float                                                        OscillationBlendInTime;                            // 0x30(0x4)
	float                                                        OscillationBlendOutTime;                           // 0x34(0x4)
	struct ROscillator                                           RotOscillation;                                    // 0x38(0x24)
	struct VOscillator                                           LocOscillation;                                    // 0x5c(0x24)
	struct FOscillator                                           FOVOscillation;                                    // 0x80(0xc)
	float                                                        AnimPlayRate;                                      // 0x8c(0x4)
	float                                                        AnimScale;                                         // 0x90(0x4)
	float                                                        AnimBlendInTime;                                   // 0x94(0x4)
	float                                                        AnimBlendOutTime;                                  // 0x98(0x4)
	float                                                        RandomAnimSegmentDuration;                         // 0x9c(0x4)
	class CameraAnim*                                            Anim;                                              // 0xa0(0x8)
	bool                                                         bRandomAnimSegment;                                // 0xa8(0x1)
	char                                                         pad0x17_8CNDA[0x17];                               // 0xa9(0x17)
	class PlayerCameraManager*                                   CameraOwner;                                       // 0xc0(0x8)
	char                                                         pad0x68_W4UH1[0x68];                               // 0xc8(0x68)
	float                                                        ShakeScale;                                        // 0x130(0x4)
	float                                                        OscillatorTimeRemaining;                           // 0x134(0x4)
	class CameraAnimInst*                                        AnimInst;                                          // 0x138(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class BoneMaskFilter: public Object
{
public:
	TArray<struct InputBlendPose>                                BlendPoses;                                        // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EngineBaseTypes: public Object
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class SubsurfaceProfile: public Object
{
public:
	struct SubsurfaceProfileStruct                               Settings;                                          // 0x28(0x24)
	char                                                         pad0x4_LWTGS[0x4];                                 // 0x4c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DataAsset: public Object
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class TimecodeProvider: public Object
{
public:
	float                                                        FrameDelay;                                        // 0x28(0x4)
	char                                                         pad0x4_SRHV3[0x4];                                 // 0x2c(0x4)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class Player: public Object
{
public:
	char                                                         pad0x8_ZX7WS[0x8];                                 // 0x28(0x8)
	class PlayerController*                                      PlayerController;                                  // 0x30(0x8)
	int                                                          CurrentNetSpeed;                                   // 0x38(0x4)
	int                                                          ConfiguredInternetSpeed;                           // 0x3c(0x4)
	int                                                          ConfiguredLanSpeed;                                // 0x40(0x4)
	char                                                         pad0x4_983XC[0x4];                                 // 0x44(0x4)
};


// Size 0x10 (Full Size[0x68] - InheritedSize[0x58]
class UserDefinedEnum: public Enum
{
public:
	TArray<struct Text>                                          DisplayNames;                                      // 0x58(0x10)
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class Texture: public Object
{
public:
	int                                                          LODBias;                                           // 0x28(0x4)
	int                                                          NumCinematicMipLevels;                             // 0x2c(0x4)
	bool                                                         SRGB;                                              // 0x30(0x1)
	bool                                                         NeverStream;                                       // 0x30(0x1)
	bool                                                         bNoTiling;                                         // 0x30(0x1)
	bool                                                         bUseCinematicMipLevels;                            // 0x30(0x1)
	bool                                                         CompressionNone;                                   // 0x30(0x1)
	bool                                                         bUAV;                                              // 0x30(0x1)
	char                                                         pad0x3_GEL2C[0x3];                                 // 0x31(0x3)
	int                                                          CachedCombinedLODBias;                             // 0x38(0x4)
	bool                                                         bAsyncResourceReleaseHasBeenStarted;               // 0x3c(0x1)
	char                                                         pad0x3_5F4ND[0x3];                                 // 0x3d(0x3)
	char                                                         CompressionSettings;                               // 0x40(0x1)
	char                                                         Filter;                                            // 0x41(0x1)
	char                                                         LODGroup;                                          // 0x42(0x1)
	char                                                         pad0x1_B4GT8[0x1];                                 // 0x43(0x1)
	float                                                        StreamingPriorityBoost;                            // 0x44(0x4)
	char                                                         pad0x60_PLAGL[0x60];                               // 0x48(0x60)
	TArray<struct ExternalMip>                                   ExternalMips;                                      // 0xa8(0x10)
	char                                                         pad0x88_M6D2K[0x88];                               // 0xb8(0x88)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class VisualLoggerAutomationTests: public Object
{
public:
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class MaterialFunction: public Object
{
public:
	struct Guid                                                  StateId;                                           // 0x28(0x10)
	struct FString                                               Description;                                       // 0x38(0x10)
	bool                                                         bExposeToLibrary;                                  // 0x48(0x1)
	char                                                         pad0x7_LHTD4[0x7];                                 // 0x49(0x7)
	TArray<struct Text>                                          LibraryCategoriesText;                             // 0x50(0x10)
	TArray<class MaterialExpression*>                            FunctionExpressions;                               // 0x60(0x10)
	bool                                                         bReentrantFlag;                                    // 0x70(0x1)
	char                                                         pad0x7_MI1JW[0x7];                                 // 0x71(0x7)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class PhysicalMaterial: public Object
{
public:
	float                                                        Friction;                                          // 0x28(0x4)
	char                                                         FrictionCombineMode;                               // 0x2c(0x1)
	bool                                                         bOverrideFrictionCombineMode;                      // 0x2d(0x1)
	char                                                         pad0x2_GC33X[0x2];                                 // 0x2e(0x2)
	float                                                        Restitution;                                       // 0x30(0x4)
	char                                                         RestitutionCombineMode;                            // 0x34(0x1)
	bool                                                         bOverrideRestitutionCombineMode;                   // 0x35(0x1)
	char                                                         pad0x2_BUA3G[0x2];                                 // 0x36(0x2)
	float                                                        Density;                                           // 0x38(0x4)
	float                                                        RaiseMassToPower;                                  // 0x3c(0x4)
	float                                                        DestructibleDamageThresholdScale;                  // 0x40(0x4)
	char                                                         pad0x4_ZESBD[0x4];                                 // 0x44(0x4)
	class PhysicalMaterialPropertyBase*                          PhysicalMaterialProperty;                          // 0x48(0x8)
	char                                                         SurfaceType;                                       // 0x50(0x1)
	char                                                         pad0x1f_SBGKV[0x1f];                               // 0x51(0x1f)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlueprintAsyncActionBase: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AggregatableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TestInterfaceAlternative: public Interface
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class NavLinkDefinition: public Object
{
public:
	TArray<struct NavigationLink>                                Links;                                             // 0x28(0x10)
	TArray<struct NavigationSegmentLink>                         SegmentLinks;                                      // 0x38(0x10)
	char                                                         pad0x8_9CPGD[0x8];                                 // 0x48(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class TextureLODSettings: public Object
{
public:
	TArray<struct TextureLODGroup>                               TextureLODGroups;                                  // 0x28(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class CameraModifier: public Object
{
public:
	bool                                                         bDebug;                                            // 0x28(0x1)
	bool                                                         bExclusive;                                        // 0x28(0x1)
	char                                                         pad0x3_XEW90[0x3];                                 // 0x29(0x3)
	char                                                         Priority;                                          // 0x2c(0x1)
	char                                                         pad0x3_U0KSZ[0x3];                                 // 0x2d(0x3)
	class PlayerCameraManager*                                   CameraOwner;                                       // 0x30(0x8)
	float                                                        AlphaInTime;                                       // 0x38(0x4)
	float                                                        AlphaOutTime;                                      // 0x3c(0x4)
	float                                                        Alpha;                                             // 0x40(0x4)
	bool                                                         bAutoDestroyOnCompletion;                          // 0x44(0x1)
	char                                                         pad0x3_VWG2V[0x3];                                 // 0x45(0x3)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ScriptViewportClient: public Object
{
public:
	char                                                         pad0x8_TW6KC[0x8];                                 // 0x28(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RVOAvoidanceInterface: public Interface
{
public:
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class BrushBuilder: public Object
{
public:
	struct FString                                               BitmapFilename;                                    // 0x28(0x10)
	struct FString                                               Tooltip;                                           // 0x38(0x10)
	bool                                                         NotifyBadParams;                                   // 0x48(0x1)
	char                                                         pad0x7_WDVJI[0x7];                                 // 0x49(0x7)
	TArray<struct Vector>                                        Vertices;                                          // 0x50(0x10)
	TArray<struct BuilderPoly>                                   Polys;                                             // 0x60(0x10)
	struct FName                                                 Layer;                                             // 0x70(0x8)
	bool                                                         MergeCoplanars;                                    // 0x78(0x1)
	char                                                         pad0x7_FIUYZ[0x7];                                 // 0x79(0x7)
};


// Size 0x9c0 (Full Size[0x9e8] - InheritedSize[0x28]
class Engine: public Object
{
public:
	char                                                         pad0x8_16L3O[0x8];                                 // 0x28(0x8)
	class Font*                                                  TinyFont;                                          // 0x30(0x8)
	struct StringAssetReference                                  TinyFontName;                                      // 0x38(0x10)
	class Font*                                                  SmallFont;                                         // 0x48(0x8)
	struct StringAssetReference                                  SmallFontName;                                     // 0x50(0x10)
	class Font*                                                  MediumFont;                                        // 0x60(0x8)
	struct StringAssetReference                                  MediumFontName;                                    // 0x68(0x10)
	class Font*                                                  LargeFont;                                         // 0x78(0x8)
	struct StringAssetReference                                  LargeFontName;                                     // 0x80(0x10)
	class Font*                                                  MonoFont;                                          // 0x90(0x8)
	struct StringAssetReference                                  MonoFontName;                                      // 0x98(0x10)
	class Font*                                                  SubtitleFont;                                      // 0xa8(0x8)
	struct StringAssetReference                                  SubtitleFontName;                                  // 0xb0(0x10)
	class Font*                                                  HugeFont;                                          // 0xc0(0x8)
	struct StringAssetReference                                  HugeFontName;                                      // 0xc8(0x10)
	TArray<class Font*>                                          AdditionalFonts;                                   // 0xd8(0x10)
	char                                                         pad0x8_RNIKP[0x8];                                 // 0xe8(0x8)
	TArray<String>                                               AdditionalFontNames;                               // 0xf0(0x10)
	class UClass*                                                ConsoleClass;                                      // 0x100(0x8)
	struct StringClassReference                                  ConsoleClassName;                                  // 0x108(0x10)
	class UClass*                                                GameViewportClientClass;                           // 0x118(0x8)
	struct StringClassReference                                  GameViewportClientClassName;                       // 0x120(0x10)
	class UClass*                                                LocalPlayerClass;                                  // 0x130(0x8)
	struct StringClassReference                                  LocalPlayerClassName;                              // 0x138(0x10)
	class UClass*                                                WorldSettingsClass;                                // 0x148(0x8)
	struct StringClassReference                                  WorldSettingsClassName;                            // 0x150(0x10)
	struct StringClassReference                                  NavigationSystemClassName;                         // 0x160(0x10)
	class UClass*                                                NavigationSystemClass;                             // 0x170(0x8)
	struct StringClassReference                                  AvoidanceManagerClassName;                         // 0x178(0x10)
	class UClass*                                                AvoidanceManagerClass;                             // 0x188(0x8)
	class UClass*                                                PhysicsCollisionHandlerClass;                      // 0x190(0x8)
	struct StringClassReference                                  PhysicsCollisionHandlerClassName;                  // 0x198(0x10)
	struct StringClassReference                                  GameUserSettingsClassName;                         // 0x1a8(0x10)
	class UClass*                                                GameUserSettingsClass;                             // 0x1b8(0x8)
	struct StringClassReference                                  AIControllerClassName;                             // 0x1c0(0x10)
	class GameUserSettings*                                      GameUserSettings;                                  // 0x1d0(0x8)
	class UClass*                                                LevelScriptActorClass;                             // 0x1d8(0x8)
	struct StringClassReference                                  LevelScriptActorClassName;                         // 0x1e0(0x10)
	struct StringClassReference                                  DefaultBlueprintBaseClassName;                     // 0x1f0(0x10)
	struct StringClassReference                                  GameSingletonClassName;                            // 0x200(0x10)
	class Object*                                                GameSingleton;                                     // 0x210(0x8)
	class UClass*                                                DefaultPreviewPawnClass;                           // 0x218(0x8)
	struct StringClassReference                                  DefaultPreviewPawnClassName;                       // 0x220(0x10)
	struct FString                                               PlayOnConsoleSaveDir;                              // 0x230(0x10)
	class Texture2D*                                             DefaultTexture;                                    // 0x240(0x8)
	struct StringAssetReference                                  DefaultTextureName;                                // 0x248(0x10)
	class Texture*                                               DefaultDiffuseTexture;                             // 0x258(0x8)
	struct StringAssetReference                                  DefaultDiffuseTextureName;                         // 0x260(0x10)
	class Texture2D*                                             DefaultBSPVertexTexture;                           // 0x270(0x8)
	struct StringAssetReference                                  DefaultBSPVertexTextureName;                       // 0x278(0x10)
	class Texture2D*                                             HighFrequencyNoiseTexture;                         // 0x288(0x8)
	struct StringAssetReference                                  HighFrequencyNoiseTextureName;                     // 0x290(0x10)
	class Texture2D*                                             DefaultBokehTexture;                               // 0x2a0(0x8)
	struct StringAssetReference                                  DefaultBokehTextureName;                           // 0x2a8(0x10)
	class Texture2D*                                             BlueNoiseTexture;                                  // 0x2b8(0x8)
	struct StringAssetReference                                  BlueNoiseTextureName;                              // 0x2c0(0x10)
	class Texture2D*                                             HDRCalibrationTexture;                             // 0x2d0(0x8)
	struct StringAssetReference                                  HDRCalibrationTextureName;                         // 0x2d8(0x10)
	class Material*                                              WireframeMaterial;                                 // 0x2e8(0x8)
	struct FString                                               WireframeMaterialName;                             // 0x2f0(0x10)
	class Material*                                              DebugMeshMaterial;                                 // 0x300(0x8)
	struct StringAssetReference                                  DebugMeshMaterialName;                             // 0x308(0x10)
	class Material*                                              LevelColorationLitMaterial;                        // 0x318(0x8)
	struct FString                                               LevelColorationLitMaterialName;                    // 0x320(0x10)
	class Material*                                              LevelColorationUnlitMaterial;                      // 0x330(0x8)
	struct FString                                               LevelColorationUnlitMaterialName;                  // 0x338(0x10)
	class Material*                                              TriangleDensityScreenSpaceMaterial;                // 0x348(0x8)
	struct FString                                               TriangleDensityScreenSpaceMaterialName;            // 0x350(0x10)
	class Material*                                              TriangleDensityWorldSpaceMaterial;                 // 0x360(0x8)
	struct FString                                               TriangleDensityWorldSpaceMaterialName;             // 0x368(0x10)
	class Material*                                              LightingTexelDensityMaterial;                      // 0x378(0x8)
	struct FString                                               LightingTexelDensityName;                          // 0x380(0x10)
	class Material*                                              ShadedLevelColorationLitMaterial;                  // 0x390(0x8)
	struct FString                                               ShadedLevelColorationLitMaterialName;              // 0x398(0x10)
	class Material*                                              ShadedLevelColorationUnlitMaterial;                // 0x3a8(0x8)
	struct FString                                               ShadedLevelColorationUnlitMaterialName;            // 0x3b0(0x10)
	class Material*                                              RemoveSurfaceMaterial;                             // 0x3c0(0x8)
	struct StringAssetReference                                  RemoveSurfaceMaterialName;                         // 0x3c8(0x10)
	class Material*                                              VertexColorMaterial;                               // 0x3d8(0x8)
	struct FString                                               VertexColorMaterialName;                           // 0x3e0(0x10)
	class Material*                                              VertexColorViewModeMaterial_ColorOnly;             // 0x3f0(0x8)
	struct FString                                               VertexColorViewModeMaterialName_ColorOnly;         // 0x3f8(0x10)
	class Material*                                              VertexColorViewModeMaterial_AlphaAsColor;          // 0x408(0x8)
	struct FString                                               VertexColorViewModeMaterialName_AlphaAsColor;      // 0x410(0x10)
	class Material*                                              VertexColorViewModeMaterial_RedOnly;               // 0x420(0x8)
	struct FString                                               VertexColorViewModeMaterialName_RedOnly;           // 0x428(0x10)
	class Material*                                              VertexColorViewModeMaterial_GreenOnly;             // 0x438(0x8)
	struct FString                                               VertexColorViewModeMaterialName_GreenOnly;         // 0x440(0x10)
	class Material*                                              VertexColorViewModeMaterial_BlueOnly;              // 0x450(0x8)
	struct FString                                               VertexColorViewModeMaterialName_BlueOnly;          // 0x458(0x10)
	class Material*                                              ConstraintLimitMaterial;                           // 0x468(0x8)
	class MaterialInstanceDynamic*                               ConstraintLimitMaterialX;                          // 0x470(0x8)
	class MaterialInstanceDynamic*                               ConstraintLimitMaterialY;                          // 0x478(0x8)
	class MaterialInstanceDynamic*                               ConstraintLimitMaterialZ;                          // 0x480(0x8)
	struct StringAssetReference                                  ConstraintLimitMaterialName;                       // 0x488(0x10)
	class Material*                                              InvalidLightmapSettingsMaterial;                   // 0x498(0x8)
	struct StringAssetReference                                  InvalidLightmapSettingsMaterialName;               // 0x4a0(0x10)
	class Material*                                              PreviewShadowsIndicatorMaterial;                   // 0x4b0(0x8)
	struct StringAssetReference                                  PreviewShadowsIndicatorMaterialName;               // 0x4b8(0x10)
	class Material*                                              ArrowMaterial;                                     // 0x4c8(0x8)
	struct StringAssetReference                                  ArrowMaterialName;                                 // 0x4d0(0x10)
	struct LinearColor                                           LightingOnlyBrightness;                            // 0x4e0(0x10)
	TArray<struct Color>                                         LightComplexityColors;                             // 0x4f0(0x10)
	TArray<struct LinearColor>                                   ShaderComplexityColors;                            // 0x500(0x10)
	TArray<struct LinearColor>                                   StationaryLightOverlapColors;                      // 0x510(0x10)
	TArray<struct LinearColor>                                   LODColorationColors;                               // 0x520(0x10)
	float                                                        MaxPixelShaderAdditiveComplexityCount;             // 0x530(0x4)
	float                                                        MaxES2PixelShaderAdditiveComplexityCount;          // 0x534(0x4)
	float                                                        MinLightMapDensity;                                // 0x538(0x4)
	float                                                        IdealLightMapDensity;                              // 0x53c(0x4)
	float                                                        MaxLightMapDensity;                                // 0x540(0x4)
	bool                                                         bRenderLightMapDensityGrayscale;                   // 0x544(0x1)
	char                                                         pad0x3_BHZQ5[0x3];                                 // 0x545(0x3)
	float                                                        RenderLightMapDensityGrayscaleScale;               // 0x548(0x4)
	float                                                        RenderLightMapDensityColorScale;                   // 0x54c(0x4)
	struct LinearColor                                           LightMapDensityVertexMappedColor;                  // 0x550(0x10)
	struct LinearColor                                           LightMapDensitySelectedColor;                      // 0x560(0x10)
	TArray<struct StatColorMapping>                              StatColorMappings;                                 // 0x570(0x10)
	class PhysicalMaterial*                                      DefaultPhysMaterial;                               // 0x580(0x8)
	struct StringAssetReference                                  DefaultPhysMaterialName;                           // 0x588(0x10)
	TArray<struct GameNameRedirect>                              ActiveGameNameRedirects;                           // 0x598(0x10)
	TArray<struct ClassRedirect>                                 ActiveClassRedirects;                              // 0x5a8(0x10)
	TArray<struct PluginRedirect>                                ActivePluginRedirects;                             // 0x5b8(0x10)
	TArray<struct StructRedirect>                                ActiveStructRedirects;                             // 0x5c8(0x10)
	class Texture2D*                                             PreIntegratedSkinBRDFTexture;                      // 0x5d8(0x8)
	struct StringAssetReference                                  PreIntegratedSkinBRDFTextureName;                  // 0x5e0(0x10)
	class Texture2D*                                             MiniFontTexture;                                   // 0x5f0(0x8)
	struct StringAssetReference                                  MiniFontTextureName;                               // 0x5f8(0x10)
	class Texture*                                               WeightMapPlaceholderTexture;                       // 0x608(0x8)
	struct StringAssetReference                                  WeightMapPlaceholderTextureName;                   // 0x610(0x10)
	class Texture2D*                                             LightMapDensityTexture;                            // 0x620(0x8)
	struct StringAssetReference                                  LightMapDensityTextureName;                        // 0x628(0x10)
	char                                                         pad0x8_ZMCRM[0x8];                                 // 0x638(0x8)
	class GameViewportClient*                                    GameViewport;                                      // 0x640(0x8)
	TArray<String>                                               DeferredCommands;                                  // 0x648(0x10)
	int                                                          TickCycles;                                        // 0x658(0x4)
	int                                                          GameCycles;                                        // 0x65c(0x4)
	int                                                          ClientCycles;                                      // 0x660(0x4)
	float                                                        NearClipPlane;                                     // 0x664(0x4)
	bool                                                         bHardwareSurveyEnabled;                            // 0x668(0x1)
	bool                                                         bSubtitlesEnabled;                                 // 0x668(0x1)
	bool                                                         bSubtitlesForcedOff;                               // 0x668(0x1)
	char                                                         pad0x3_90P4G[0x3];                                 // 0x669(0x3)
	int                                                          MaximumLoopIterationCount;                         // 0x66c(0x4)
	bool                                                         bCanBlueprintsTickByDefault;                       // 0x670(0x1)
	bool                                                         bOptimizeAnimBlueprintMemberVariableAccess;        // 0x670(0x1)
	bool                                                         bEnableEditorPSysRealtimeLOD;                      // 0x670(0x1)
	bool                                                         bSmoothFrameRate;                                  // 0x670(0x1)
	bool                                                         bUseFixedFrameRate;                                // 0x670(0x1)
	char                                                         pad0x3_V72P6[0x3];                                 // 0x671(0x3)
	float                                                        FixedFrameRate;                                    // 0x674(0x4)
	struct FloatRange                                            SmoothedFrameRateRange;                            // 0x678(0x10)
	class EngineCustomTimeStep*                                  CustomTimeStep;                                    // 0x688(0x8)
	char                                                         pad0x20_9AESF[0x20];                               // 0x690(0x20)
	class TimecodeProvider*                                      TimecodeProvider;                                  // 0x6b0(0x8)
	char                                                         pad0x19_9UM87[0x19];                               // 0x6b8(0x19)
	bool                                                         bGenerateDefaultTimecode;                          // 0x6d1(0x1)
	char                                                         pad0xa_XOKYY[0xa];                                 // 0x6d2(0xa)
	float                                                        GenerateDefaultTimecodeFrameDelay;                 // 0x6dc(0x4)
	bool                                                         bCheckForMultiplePawnsSpawnedInAFrame;             // 0x6e0(0x1)
	char                                                         pad0x3_QJLNL[0x3];                                 // 0x6e1(0x3)
	int                                                          NumPawnsAllowedToBeSpawnedInAFrame;                // 0x6e4(0x4)
	bool                                                         bShouldGenerateLowQualityLightmaps;                // 0x6e8(0x1)
	char                                                         pad0x3_KC109[0x3];                                 // 0x6e9(0x3)
	struct Color                                                 C_WorldBox;                                        // 0x6ec(0x4)
	struct Color                                                 C_BrushWire;                                       // 0x6f0(0x4)
	struct Color                                                 C_AddWire;                                         // 0x6f4(0x4)
	struct Color                                                 C_SubtractWire;                                    // 0x6f8(0x4)
	struct Color                                                 C_SemiSolidWire;                                   // 0x6fc(0x4)
	struct Color                                                 C_NonSolidWire;                                    // 0x700(0x4)
	struct Color                                                 C_WireBackground;                                  // 0x704(0x4)
	struct Color                                                 C_ScaleBoxHi;                                      // 0x708(0x4)
	struct Color                                                 C_VolumeCollision;                                 // 0x70c(0x4)
	struct Color                                                 C_BSPCollision;                                    // 0x710(0x4)
	struct Color                                                 C_OrthoBackground;                                 // 0x714(0x4)
	struct Color                                                 C_Volume;                                          // 0x718(0x4)
	struct Color                                                 C_BrushShape;                                      // 0x71c(0x4)
	float                                                        StreamingDistanceFactor;                           // 0x720(0x4)
	char                                                         TransitionType;                                    // 0x724(0x1)
	char                                                         pad0x3_NU7WI[0x3];                                 // 0x725(0x3)
	struct FString                                               TransitionDescription;                             // 0x728(0x10)
	struct FString                                               TransitionGameMode;                                // 0x738(0x10)
	float                                                        MeshLODRange;                                      // 0x748(0x4)
	bool                                                         bAllowMatureLanguage;                              // 0x74c(0x1)
	char                                                         pad0x3_787ZP[0x3];                                 // 0x74d(0x3)
	float                                                        CameraRotationThreshold;                           // 0x750(0x4)
	float                                                        CameraTranslationThreshold;                        // 0x754(0x4)
	float                                                        PrimitiveProbablyVisibleTime;                      // 0x758(0x4)
	float                                                        MaxOcclusionPixelsFraction;                        // 0x75c(0x4)
	bool                                                         bPauseOnLossOfFocus;                               // 0x760(0x1)
	char                                                         pad0x3_XLVF9[0x3];                                 // 0x761(0x3)
	int                                                          MaxParticleResize;                                 // 0x764(0x4)
	int                                                          MaxParticleResizeWarn;                             // 0x768(0x4)
	char                                                         pad0x4_VP5ZH[0x4];                                 // 0x76c(0x4)
	TArray<struct DropNoteInfo>                                  PendingDroppedNotes;                               // 0x770(0x10)
	struct RigidBodyErrorCorrection                              PhysicErrorCorrection;                             // 0x780(0x1c)
	float                                                        NetClientTicksPerSecond;                           // 0x79c(0x4)
	bool                                                         bHasPendingGlobalReregister;                       // 0x7a0(0x1)
	char                                                         pad0x3_20NTD[0x3];                                 // 0x7a1(0x3)
	float                                                        DisplayGamma;                                      // 0x7a4(0x4)
	float                                                        MinDesiredFrameRate;                               // 0x7a8(0x4)
	struct LinearColor                                           DefaultSelectedMaterialColor;                      // 0x7ac(0x10)
	struct LinearColor                                           SelectedMaterialColor;                             // 0x7bc(0x10)
	struct LinearColor                                           SelectionOutlineColor;                             // 0x7cc(0x10)
	struct LinearColor                                           SubduedSelectionOutlineColor;                      // 0x7dc(0x10)
	struct LinearColor                                           SelectedMaterialColorOverride;                     // 0x7ec(0x10)
	bool                                                         bIsOverridingSelectedColor;                        // 0x7fc(0x1)
	char                                                         pad0x3_WCMVO[0x3];                                 // 0x7fd(0x3)
	bool                                                         bEnableOnScreenDebugMessages;                      // 0x800(0x1)
	bool                                                         bEnableOnScreenDebugMessagesDisplay;               // 0x800(0x1)
	bool                                                         bSuppressMapWarnings;                              // 0x800(0x1)
	bool                                                         bCookSeparateSharedMPGameContent;                  // 0x800(0x1)
	bool                                                         bDisableAILogging;                                 // 0x800(0x1)
	char                                                         pad0x3_Y4I5I[0x3];                                 // 0x801(0x3)
	int                                                          ScreenSaverInhibitorSemaphore;                     // 0x80c(0x4)
	bool                                                         bLockReadOnlyLevels;                               // 0x810(0x1)
	char                                                         pad0x7_VJBHZ[0x7];                                 // 0x811(0x7)
	struct FString                                               ParticleEventManagerClassPath;                     // 0x818(0x10)
	char                                                         pad0x10_Y3SEC[0x10];                               // 0x828(0x10)
	float                                                        SelectionHighlightIntensity;                       // 0x838(0x4)
	float                                                        BSPSelectionHighlightIntensity;                    // 0x83c(0x4)
	float                                                        HoverHighlightIntensity;                           // 0x840(0x4)
	float                                                        SelectionHighlightIntensityBillboards;             // 0x844(0x4)
	char                                                         pad0x130_Q2LOT[0x130];                             // 0x848(0x130)
	TArray<struct NetDriverDefinition>                           NetDriverDefinitions;                              // 0x978(0x10)
	TArray<String>                                               ServerActors;                                      // 0x988(0x10)
	TArray<String>                                               RuntimeServerActors;                               // 0x998(0x10)
	bool                                                         bStartedLoadMapMovie;                              // 0x9a8(0x1)
	char                                                         pad0x17_3AK2I[0x17];                               // 0x9a9(0x17)
	int                                                          NextWorldContextHandle;                            // 0x9c0(0x4)
	char                                                         pad0x24_84XOB[0x24];                               // 0x9c4(0x24)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class InterpGroup: public Object
{
public:
	char                                                         pad0x8_7EMBE[0x8];                                 // 0x28(0x8)
	TArray<class InterpTrack*>                                   InterpTracks;                                      // 0x30(0x10)
	struct FName                                                 GroupName;                                         // 0x40(0x8)
	struct Color                                                 GroupColor;                                        // 0x48(0x4)
	bool                                                         bCollapsed;                                        // 0x4c(0x1)
	bool                                                         bVisible;                                          // 0x4c(0x1)
	bool                                                         bIsFolder;                                         // 0x4c(0x1)
	bool                                                         bIsParented;                                       // 0x4c(0x1)
	bool                                                         bIsSelected;                                       // 0x4c(0x1)
	char                                                         pad0x3_0OAQ3[0x3];                                 // 0x4d(0x3)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class VectorField: public Object
{
public:
	struct Box                                                   Bounds;                                            // 0x28(0x1c)
	float                                                        Intensity;                                         // 0x44(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavigationPathGenerator: public Interface
{
public:
};


// Size 0x588 (Full Size[0x5b0] - InheritedSize[0x28]
class CameraAnim: public Object
{
public:
	class InterpGroup*                                           CameraInterpGroup;                                 // 0x28(0x8)
	float                                                        AnimLength;                                        // 0x30(0x4)
	struct Box                                                   BoundingBox;                                       // 0x34(0x1c)
	bool                                                         bRelativeToInitialTransform;                       // 0x50(0x1)
	char                                                         pad0x3_X073F[0x3];                                 // 0x51(0x3)
	float                                                        BaseFOV;                                           // 0x54(0x4)
	char                                                         pad0x8_J9XH9[0x8];                                 // 0x58(0x8)
	struct PostProcessSettings                                   BasePostProcessSettings;                           // 0x60(0x540)
	float                                                        BasePostProcessBlendWeight;                        // 0x5a0(0x4)
	char                                                         pad0xc_JIU2J[0xc];                                 // 0x5a4(0xc)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class MaterialExpression: public Object
{
public:
	class Material*                                              Material;                                          // 0x28(0x8)
	class MaterialFunction*                                      Function;                                          // 0x30(0x8)
	struct FString                                               Desc;                                              // 0x38(0x10)
	struct Color                                                 BorderColor;                                       // 0x48(0x4)
	bool                                                         bRealtimePreview;                                  // 0x4c(0x1)
	bool                                                         bNeedToUpdatePreview;                              // 0x4c(0x1)
	bool                                                         bIsParameterExpression;                            // 0x4c(0x1)
	bool                                                         bCommentBubbleVisible;                             // 0x4c(0x1)
	bool                                                         bShowOutputNameOnPin;                              // 0x4c(0x1)
	bool                                                         bHidePreviewWindow;                                // 0x4c(0x1)
	bool                                                         bCollapsed;                                        // 0x4c(0x1)
	bool                                                         bShaderInputData;                                  // 0x4c(0x1)
	bool                                                         bShowInputs;                                       // 0x4d(0x1)
	bool                                                         bShowOutputs;                                      // 0x4d(0x1)
	char                                                         pad0x2_PP7VL[0x2];                                 // 0x4e(0x2)
	TArray<struct Text>                                          MenuCategories;                                    // 0x50(0x10)
	TArray<struct ExpressionOutput>                              Outputs;                                           // 0x60(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class SimpleConstructionScript: public Object
{
public:
	TArray<class SCS_Node*>                                      RootNodes;                                         // 0x28(0x10)
	class SCS_Node*                                              DefaultSceneRootNode;                              // 0x38(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MatineeAnimInterface: public Interface
{
public:
};


// Size 0xc0 (Full Size[0xe8] - InheritedSize[0x28]
class SoundAttenuation: public Object
{
public:
	struct AttenuationSettings                                   Attenuation;                                       // 0x28(0xc0)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DPICustomScalingRule: public Object
{
public:
};


// Size 0x400 (Full Size[0x428] - InheritedSize[0x28]
class PlayerInput: public Object
{
public:
	char                                                         pad0xf8_Q2TY7[0xf8];                               // 0x28(0xf8)
	TArray<struct KeyBind>                                       DebugExecBindings;                                 // 0x120(0x10)
	char                                                         pad0x40_KXA6W[0x40];                               // 0x130(0x40)
	TArray<struct Name>                                          GamepadInvertedAxes;                               // 0x170(0x10)
	TArray<struct Name>                                          MouseInvertedAxes;                                 // 0x180(0x10)
	TArray<struct Name>                                          InvertedCombinedAxisY;                             // 0x190(0x10)
	TArray<struct Name>                                          InvertedCombinedAxisX;                             // 0x1a0(0x10)
	char                                                         pad0x278_276K2[0x278];                             // 0x1b0(0x278)
};


// Size 0x240 (Full Size[0x268] - InheritedSize[0x28]
class Skeleton: public Object
{
public:
	TArray<struct BoneNode>                                      BoneTree;                                          // 0x28(0x10)
	char                                                         pad0x80_6TDG6[0x80];                               // 0x38(0x80)
	TArray<struct SkeletonToMeshLinkup>                          LinkupCache;                                       // 0xb8(0x10)
	TArray<class SkeletalMeshSocket*>                            Sockets;                                           // 0xc8(0x10)
	char                                                         pad0x50_BEU67[0x50];                               // 0xd8(0x50)
	struct SmartNameContainer                                    SmartNames;                                        // 0x128(0x50)
	TArray<struct AnimSlotGroup>                                 SlotGroups;                                        // 0x178(0x10)
	char                                                         pad0xe0_UCIWZ[0xe0];                               // 0x188(0xe0)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class InterpCurveEdSetup: public Object
{
public:
	TArray<struct CurveEdTab>                                    Tabs;                                              // 0x28(0x10)
	int                                                          ActiveTab;                                         // 0x38(0x4)
	char                                                         pad0x4_UUBVM[0x4];                                 // 0x3c(0x4)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class BlueprintCore: public Object
{
public:
	class UClass*                                                SkeletonGeneratedClass;                            // 0x28(0x8)
	class UClass*                                                GeneratedClass;                                    // 0x30(0x8)
	bool                                                         bLegacyNeedToPurgeSkelRefs;                        // 0x38(0x1)
	bool                                                         bLegacyGeneratedClassIsAuthoritative;              // 0x39(0x1)
	char                                                         pad0x2_X5MB0[0x2];                                 // 0x3a(0x2)
	struct Guid                                                  BlueprintGuid;                                     // 0x3c(0x10)
	char                                                         pad0x4_62YNF[0x4];                                 // 0x4c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AggregatorInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ParticleSystemReplay: public Object
{
public:
	int                                                          ClipIDNumber;                                      // 0x28(0x4)
	char                                                         pad0x14_7LQZP[0x14];                               // 0x2c(0x14)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavPathObserverInterface: public Interface
{
public:
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class InterpTrack: public Object
{
public:
	char                                                         pad0x10_SDGWM[0x10];                               // 0x28(0x10)
	TArray<class InterpTrack*>                                   SubTracks;                                         // 0x38(0x10)
	class UClass*                                                TrackInstClass;                                    // 0x48(0x8)
	char                                                         ActiveCondition;                                   // 0x50(0x1)
	char                                                         pad0x7_06C4T[0x7];                                 // 0x51(0x7)
	struct FString                                               TrackTitle;                                        // 0x58(0x10)
	bool                                                         bOnePerGroup;                                      // 0x68(0x1)
	bool                                                         bDirGroupOnly;                                     // 0x68(0x1)
	bool                                                         bDisableTrack;                                     // 0x68(0x1)
	bool                                                         bIsSelected;                                       // 0x68(0x1)
	bool                                                         bIsAnimControlTrack;                               // 0x68(0x1)
	bool                                                         bSubTrackOnly;                                     // 0x68(0x1)
	bool                                                         bVisible;                                          // 0x68(0x1)
	bool                                                         bIsRecording;                                      // 0x68(0x1)
	char                                                         pad0x7_TFDSW[0x7];                                 // 0x69(0x7)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class Breakpoint: public Object
{
public:
	bool                                                         bEnabled;                                          // 0x28(0x1)
	char                                                         pad0x7_O030Y[0x7];                                 // 0x29(0x7)
	class EdGraphNode*                                           Node;                                              // 0x30(0x8)
	bool                                                         bStepOnce;                                         // 0x38(0x1)
	bool                                                         bStepOnce_WasPreviouslyDisabled;                   // 0x38(0x1)
	bool                                                         bStepOnce_RemoveAfterHit;                          // 0x38(0x1)
	char                                                         pad0x7_9RG3M[0x7];                                 // 0x39(0x7)
};


// Size 0x2e0 (Full Size[0x308] - InheritedSize[0x28]
class AutomationTestSettings: public Object
{
public:
	struct FilePath                                              AutomationTestmap;                                 // 0x28(0x10)
	TArray<struct EditorMapPerformanceTestDefinition>            EditorPerformanceTestMaps;                         // 0x38(0x10)
	struct BuildPromotionTestSettings                            BuildPromotionTest;                                // 0x48(0x210)
	struct MaterialEditorPromotionSettings                       MaterialEditorPromotionTest;                       // 0x258(0x30)
	struct ParticleEditorPromotionSettings                       ParticleEditorPromotionTest;                       // 0x288(0x10)
	TArray<String>                                               EngineTestModules;                                 // 0x298(0x10)
	TArray<String>                                               EditorTestModules;                                 // 0x2a8(0x10)
	TArray<String>                                               TestLevelFolders;                                  // 0x2b8(0x10)
	TArray<struct OpenTestAsset>                                 TestAssetsToOpen;                                  // 0x2c8(0x10)
	TArray<struct ExternalToolDefinition>                        ExternalTools;                                     // 0x2d8(0x10)
	TArray<struct EditorImportExportTestDefinition>              ImportExportTestDefinitions;                       // 0x2e8(0x10)
	TArray<struct LaunchOnTestSettings>                          LaunchOnSettings;                                  // 0x2f8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AnimNotifyCondition: public Object
{
public:
};


// Size 0x218 (Full Size[0x240] - InheritedSize[0x28]
class PhysicsConstraintTemplate: public Object
{
public:
	struct FName                                                 JointName;                                         // 0x28(0x8)
	struct FName                                                 ConstraintBone1;                                   // 0x30(0x8)
	struct FName                                                 ConstraintBone2;                                   // 0x38(0x8)
	struct Vector                                                Pos1;                                              // 0x40(0xc)
	struct Vector                                                PriAxis1;                                          // 0x4c(0xc)
	struct Vector                                                SecAxis1;                                          // 0x58(0xc)
	struct Vector                                                Pos2;                                              // 0x64(0xc)
	struct Vector                                                PriAxis2;                                          // 0x70(0xc)
	struct Vector                                                SecAxis2;                                          // 0x7c(0xc)
	bool                                                         bEnableProjection;                                 // 0x88(0x1)
	char                                                         pad0x3_7AD4F[0x3];                                 // 0x89(0x3)
	float                                                        ProjectionLinearTolerance;                         // 0x8c(0x4)
	float                                                        ProjectionAngularTolerance;                        // 0x90(0x4)
	char                                                         LinearXMotion;                                     // 0x94(0x1)
	char                                                         LinearYMotion;                                     // 0x95(0x1)
	char                                                         LinearZMotion;                                     // 0x96(0x1)
	char                                                         pad0x1_CRFBK[0x1];                                 // 0x97(0x1)
	float                                                        LinearLimitSize;                                   // 0x98(0x4)
	bool                                                         bLinearLimitSoft;                                  // 0x9c(0x1)
	char                                                         pad0x3_KTFA6[0x3];                                 // 0x9d(0x3)
	float                                                        LinearLimitStiffness;                              // 0xa0(0x4)
	float                                                        LinearLimitDamping;                                // 0xa4(0x4)
	bool                                                         bLinearBreakable;                                  // 0xa8(0x1)
	char                                                         pad0x3_9OBY0[0x3];                                 // 0xa9(0x3)
	float                                                        LinearBreakThreshold;                              // 0xac(0x4)
	char                                                         AngularSwing1Motion;                               // 0xb0(0x1)
	char                                                         AngularSwing2Motion;                               // 0xb1(0x1)
	char                                                         AngularTwistMotion;                                // 0xb2(0x1)
	char                                                         pad0x1_XWGFQ[0x1];                                 // 0xb3(0x1)
	bool                                                         bSwingLimitSoft;                                   // 0xb4(0x1)
	bool                                                         bTwistLimitSoft;                                   // 0xb4(0x1)
	char                                                         pad0x3_WLDXN[0x3];                                 // 0xb5(0x3)
	float                                                        Swing1LimitAngle;                                  // 0xb8(0x4)
	float                                                        Swing2LimitAngle;                                  // 0xbc(0x4)
	float                                                        TwistLimitAngle;                                   // 0xc0(0x4)
	float                                                        SwingLimitStiffness;                               // 0xc4(0x4)
	float                                                        SwingLimitDamping;                                 // 0xc8(0x4)
	float                                                        TwistLimitStiffness;                               // 0xcc(0x4)
	float                                                        TwistLimitDamping;                                 // 0xd0(0x4)
	bool                                                         bAngularBreakable;                                 // 0xd4(0x1)
	char                                                         pad0x3_M77PG[0x3];                                 // 0xd5(0x3)
	float                                                        AngularBreakThreshold;                             // 0xd8(0x4)
	char                                                         pad0x4_FTT3J[0x4];                                 // 0xdc(0x4)
	struct ConstraintInstance                                    DefaultInstance;                                   // 0xe0(0x160)
};


// Size 0xc8 (Full Size[0xf0] - InheritedSize[0x28]
class Console: public Object
{
public:
	char                                                         pad0x10_5LCHF[0x10];                               // 0x28(0x10)
	class LocalPlayer*                                           ConsoleTargetPlayer;                               // 0x38(0x8)
	class Texture2D*                                             DefaultTexture_Black;                              // 0x40(0x8)
	class Texture2D*                                             DefaultTexture_White;                              // 0x48(0x8)
	char                                                         pad0x18_BMO5R[0x18];                               // 0x50(0x18)
	TArray<String>                                               HistoryBuffer;                                     // 0x68(0x10)
	char                                                         pad0x78_C3CC5[0x78];                               // 0x78(0x78)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class MaterialInterface: public Object
{
public:
	char                                                         pad0x8_COCG4[0x8];                                 // 0x28(0x8)
	class SubsurfaceProfile*                                     SubsurfaceProfile;                                 // 0x30(0x8)
	char                                                         pad0x4_LJ4D5[0x4];                                 // 0x38(0x4)
	struct LightmassMaterialInterfaceSettings                    LightmassSettings;                                 // 0x3c(0x14)
	char                                                         pad0x8_ZTNTA[0x8];                                 // 0x50(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TestInterface: public Interface
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class BookMark: public Object
{
public:
	struct Vector                                                Location;                                          // 0x28(0xc)
	struct Rotator                                               Rotation;                                          // 0x34(0xc)
	TArray<String>                                               HiddenLevels;                                      // 0x40(0x10)
};


// Size 0xa8 (Full Size[0xd0] - InheritedSize[0x28]
class TextPropertyTestObject: public Object
{
public:
	struct FText                                                 DefaultedText;                                     // 0x28(0x38)
	struct FText                                                 UndefaultedText;                                   // 0x60(0x38)
	struct FText                                                 TransientText;                                     // 0x98(0x38)
};


// Size 0xa8 (Full Size[0xd0] - InheritedSize[0x28]
class PhysicsSerializer: public Object
{
public:
	char                                                         pad0xa8_X2CXG[0xa8];                               // 0x28(0xa8)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class SoundBase: public Object
{
public:
	class SoundClass*                                            SoundClassObject;                                  // 0x28(0x8)
	bool                                                         bDebug;                                            // 0x30(0x1)
	char                                                         pad0x3_B1385[0x3];                                 // 0x31(0x3)
	char                                                         MaxConcurrentResolutionRule;                       // 0x34(0x1)
	char                                                         pad0x3_ILS0U[0x3];                                 // 0x35(0x3)
	int                                                          MaxConcurrentPlayCount;                            // 0x38(0x4)
	float                                                        Duration;                                          // 0x3c(0x4)
	class SoundAttenuation*                                      AttenuationSettings;                               // 0x40(0x8)
	char                                                         pad0x8_UBIE0[0x8];                                 // 0x48(0x8)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class EdGraphNode: public Object
{
public:
	TArray<class EdGraphPin*>                                    Pins;                                              // 0x28(0x10)
	int                                                          NodePosX;                                          // 0x38(0x4)
	int                                                          NodePosY;                                          // 0x3c(0x4)
	int                                                          NodeWidth;                                         // 0x40(0x4)
	int                                                          NodeHeight;                                        // 0x44(0x4)
	bool                                                         bHasCompilerMessage;                               // 0x48(0x1)
	char                                                         pad0x7_SEHNF[0x7];                                 // 0x49(0x7)
	struct FString                                               NodeComment;                                       // 0x50(0x10)
	bool                                                         bCommentBubblePinned;                              // 0x60(0x1)
	bool                                                         bCommentBubbleVisible;                             // 0x61(0x1)
	char                                                         pad0x2_UYE8K[0x2];                                 // 0x62(0x2)
	int                                                          ErrorType;                                         // 0x64(0x4)
	struct FString                                               ErrorMsg;                                          // 0x68(0x10)
	struct Guid                                                  NodeGuid;                                          // 0x78(0x10)
	char                                                         AdvancedPinDisplay;                                // 0x88(0x1)
	bool                                                         bIsNodeEnabled;                                    // 0x89(0x1)
	bool                                                         bIsDebugFunction;                                  // 0x8a(0x1)
	char                                                         pad0x5_28YHI[0x5];                                 // 0x8b(0x5)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class NavigationQueryFilter: public Object
{
public:
	TArray<struct NavigationFilterArea>                          Areas;                                             // 0x28(0x10)
	struct NavigationFilterFlags                                 IncludeFlags;                                      // 0x38(0x4)
	struct NavigationFilterFlags                                 ExcludeFlags;                                      // 0x3c(0x4)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class InterpData: public Object
{
public:
	float                                                        InterpLength;                                      // 0x28(0x4)
	float                                                        PathBuildTime;                                     // 0x2c(0x4)
	TArray<class InterpGroup*>                                   InterpGroups;                                      // 0x30(0x10)
	class InterpCurveEdSetup*                                    CurveEdSetup;                                      // 0x40(0x8)
	float                                                        EdSectionStart;                                    // 0x48(0x4)
	float                                                        EdSectionEnd;                                      // 0x4c(0x4)
	bool                                                         bShouldBakeAndPrune;                               // 0x50(0x1)
	char                                                         pad0x7_3UX38[0x7];                                 // 0x51(0x7)
	class InterpGroupDirector*                                   CachedDirectorGroup;                               // 0x58(0x8)
	TArray<struct Name>                                          AllEventNames;                                     // 0x60(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class LightmassPrimitiveSettingsObject: public Object
{
public:
	struct LightmassPrimitiveSettings                            LightmassSettings;                                 // 0x28(0x18)
};


// Size 0x4b8 (Full Size[0x4e0] - InheritedSize[0x28]
class NetDriver: public Object
{
public:
	char                                                         pad0x10_9FTU6[0x10];                               // 0x28(0x10)
	struct FString                                               NetConnectionClassName;                            // 0x38(0x10)
	int                                                          MaxDownloadSize;                                   // 0x48(0x4)
	bool                                                         bClampListenServerTickRate;                        // 0x4c(0x1)
	char                                                         pad0x3_WLXX4[0x3];                                 // 0x4d(0x3)
	int                                                          NetServerMaxTickRate;                              // 0x50(0x4)
	int                                                          MaxInternetClientRate;                             // 0x54(0x4)
	int                                                          MaxClientRate;                                     // 0x58(0x4)
	float                                                        ServerTravelPause;                                 // 0x5c(0x4)
	float                                                        SpawnPrioritySeconds;                              // 0x60(0x4)
	float                                                        RelevantTimeout;                                   // 0x64(0x4)
	float                                                        KeepAliveTime;                                     // 0x68(0x4)
	float                                                        InitialConnectTimeout;                             // 0x6c(0x4)
	float                                                        ConnectionTimeout;                                 // 0x70(0x4)
	char                                                         pad0x4_HBTLF[0x4];                                 // 0x74(0x4)
	class NetConnection*                                         ServerConnection;                                  // 0x78(0x8)
	TArray<class NetConnection*>                                 ClientConnections;                                 // 0x80(0x10)
	class World*                                                 World;                                             // 0x90(0x8)
	char                                                         pad0x48_DNHSH[0x48];                               // 0x98(0x48)
	class UClass*                                                NetConnectionClass;                                // 0xe0(0x8)
	class Property*                                              RoleProperty;                                      // 0xe8(0x8)
	class Property*                                              RemoteRoleProperty;                                // 0xf0(0x8)
	struct FName                                                 NetDriverName;                                     // 0xf8(0x8)
	char                                                         pad0x3e0_H2V0S[0x3e0];                             // 0x100(0x3e0)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MatineeInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AnimCompress: public Object
{
public:
	struct FString                                               Description;                                       // 0x28(0x10)
	bool                                                         bNeedsSkeleton;                                    // 0x38(0x1)
	char                                                         pad0x3_Z44MN[0x3];                                 // 0x39(0x3)
	char                                                         TranslationCompressionFormat;                      // 0x3c(0x1)
	char                                                         RotationCompressionFormat;                         // 0x3d(0x1)
	char                                                         ScaleCompressionFormat;                            // 0x3e(0x1)
	char                                                         pad0x1_GCLV6[0x1];                                 // 0x3f(0x1)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CustomWidgetDrawerInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class Selection: public Object
{
public:
	char                                                         pad0x30_TL8NM[0x30];                               // 0x28(0x30)
};


// Size 0x2a8 (Full Size[0x2d0] - InheritedSize[0x28]
class ButtonStyleAsset: public Object
{
public:
	struct ButtonStyle                                           ButtonStyle;                                       // 0x28(0x2a8)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class ObjectLibrary: public Object
{
public:
	class UClass*                                                ObjectBaseClass;                                   // 0x28(0x8)
	bool                                                         bHasBlueprintClasses;                              // 0x30(0x1)
	char                                                         pad0x7_HQRJ9[0x7];                                 // 0x31(0x7)
	TArray<class Object*>                                        Objects;                                           // 0x38(0x10)
	TArray<uintptr_t>                                            WeakObjects;                                       // 0x48(0x10)
	bool                                                         bUseWeakReferences;                                // 0x58(0x1)
	bool                                                         bIsFullyLoaded;                                    // 0x59(0x1)
	char                                                         pad0x16_U2DW3[0x16];                               // 0x5a(0x16)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class DamageType: public Object
{
public:
	bool                                                         bCausedByWorld;                                    // 0x28(0x1)
	bool                                                         bScaleMomentumByMass;                              // 0x28(0x1)
	char                                                         pad0x3_3D0UY[0x3];                                 // 0x29(0x3)
	float                                                        DamageImpulse;                                     // 0x2c(0x4)
	bool                                                         bRadialDamageVelChange;                            // 0x30(0x1)
	char                                                         pad0x3_O4BFL[0x3];                                 // 0x31(0x3)
	float                                                        DestructibleImpulse;                               // 0x34(0x4)
	float                                                        DestructibleDamageSpreadScale;                     // 0x38(0x4)
	float                                                        DamageFalloff;                                     // 0x3c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AnimMetaData: public Object
{
public:
};


// Size 0x1a8 (Full Size[0x1f8] - InheritedSize[0x50]
class PackageMapClient: public PackageMap
{
public:
	char                                                         pad0x1a8_BJE41[0x1a8];                             // 0x50(0x1a8)
};


// Size 0xe8 (Full Size[0x110] - InheritedSize[0x28]
class NavCollision: public Object
{
public:
	char                                                         pad0x50_YCJLO[0x50];                               // 0x28(0x50)
	TArray<struct NavCollisionCylinder>                          CylinderCollision;                                 // 0x78(0x10)
	TArray<struct NavCollisionBox>                               BoxCollision;                                      // 0x88(0x10)
	class UClass*                                                AreaClass;                                         // 0x98(0x8)
	bool                                                         bIsDynamicObstacle;                                // 0xa0(0x1)
	bool                                                         bGatherConvexGeometry;                             // 0xa0(0x1)
	char                                                         pad0x6f_JXRJI[0x6f];                               // 0xa1(0x6f)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ExecutableAnimMetaDataInterface: public Interface
{
public:
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class SlateBrushAsset: public Object
{
public:
	struct SlateBrush                                            Brush;                                             // 0x28(0x90)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ObjectReferencer: public Object
{
public:
	TArray<class Object*>                                        ReferencedObjects;                                 // 0x28(0x10)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class ReverbEffect: public Object
{
public:
	float                                                        Density;                                           // 0x28(0x4)
	float                                                        Diffusion;                                         // 0x2c(0x4)
	float                                                        Gain;                                              // 0x30(0x4)
	float                                                        GainHF;                                            // 0x34(0x4)
	float                                                        DecayTime;                                         // 0x38(0x4)
	float                                                        DecayHFRatio;                                      // 0x3c(0x4)
	float                                                        ReflectionsGain;                                   // 0x40(0x4)
	float                                                        ReflectionsDelay;                                  // 0x44(0x4)
	float                                                        LateGain;                                          // 0x48(0x4)
	float                                                        LateDelay;                                         // 0x4c(0x4)
	float                                                        AirAbsorptionGainHF;                               // 0x50(0x4)
	float                                                        RoomRolloffFactor;                                 // 0x54(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavRelevantInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ReporterBase: public Object
{
public:
	char                                                         pad0x8_23ZS3[0x8];                                 // 0x28(0x8)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class CheatManager: public Object
{
public:
	class DebugCameraController*                                 DebugCameraControllerRef;                          // 0x28(0x8)
	class UClass*                                                DebugCameraControllerClass;                        // 0x30(0x8)
	char                                                         pad0x40_MNSNA[0x40];                               // 0x38(0x40)
};


// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class DestructibleFractureSettings: public Object
{
public:
	int                                                          CellSiteCount;                                     // 0x28(0x4)
	struct FractureMaterial                                      FractureMaterialDesc;                              // 0x2c(0x24)
	int                                                          RandomSeed;                                        // 0x50(0x4)
	char                                                         pad0x4_5MARM[0x4];                                 // 0x54(0x4)
	TArray<struct Vector>                                        VoronoiSites;                                      // 0x58(0x10)
	int                                                          OriginalSubmeshCount;                              // 0x68(0x4)
	char                                                         pad0x4_X8TG6[0x4];                                 // 0x6c(0x4)
	TArray<class MaterialInterface*>                             Materials;                                         // 0x70(0x10)
	TArray<struct DestructibleChunkParameters>                   ChunkParameters;                                   // 0x80(0x10)
	TArray<String>                                               MaterialNames;                                     // 0x90(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EngineCustomTimeStep: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ImportantToggleSettingInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class Rig: public Object
{
public:
	TArray<struct TransformBase>                                 TransformBases;                                    // 0x28(0x10)
	TArray<struct Node>                                          Nodes;                                             // 0x38(0x10)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class StaticMeshSocket: public Object
{
public:
	struct FName                                                 SocketName;                                        // 0x28(0x8)
	struct Vector                                                RelativeLocation;                                  // 0x30(0xc)
	struct Rotator                                               RelativeRotation;                                  // 0x3c(0xc)
	struct Vector                                                RelativeScale;                                     // 0x48(0xc)
	char                                                         pad0x4_VZPNC[0x4];                                 // 0x54(0x4)
	struct FString                                               Tag;                                               // 0x58(0x10)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class TouchInterface: public Object
{
public:
	TArray<struct TouchInputControl>                             Controls;                                          // 0x28(0x10)
	float                                                        ActiveOpacity;                                     // 0x38(0x4)
	float                                                        InactiveOpacity;                                   // 0x3c(0x4)
	float                                                        TimeUntilDeactive;                                 // 0x40(0x4)
	float                                                        TimeUntilReset;                                    // 0x44(0x4)
	float                                                        ActivationDelay;                                   // 0x48(0x4)
	bool                                                         bPreventRecenter;                                  // 0x4c(0x1)
	char                                                         pad0x3_3ZP9H[0x3];                                 // 0x4d(0x3)
	float                                                        StartupDelay;                                      // 0x50(0x4)
	char                                                         pad0x4_EFHNB[0x4];                                 // 0x54(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_PostProcessVolume: public Interface
{
public:
};


// Size 0x2d8 (Full Size[0x300] - InheritedSize[0x28]
class Level: public Object
{
public:
	char                                                         pad0xa0_I20AX[0xa0];                               // 0x28(0xa0)
	class LevelActorContainer*                                   ActorCluster;                                      // 0xc8(0x8)
	class World*                                                 OwningWorld;                                       // 0xd0(0x8)
	class Model*                                                 Model;                                             // 0xd8(0x8)
	TArray<class ModelComponent*>                                ModelComponents;                                   // 0xe0(0x10)
	class LevelScriptActor*                                      LevelScriptActor;                                  // 0xf0(0x8)
	class NavigationObjectBase*                                  NavListStart;                                      // 0xf8(0x8)
	class NavigationObjectBase*                                  NavListEnd;                                        // 0x100(0x8)
	TArray<class NavigationDataChunk*>                           NavDataChunks;                                     // 0x108(0x10)
	float                                                        LightmapTotalSize;                                 // 0x118(0x4)
	float                                                        ShadowmapTotalSize;                                // 0x11c(0x4)
	TArray<struct Vector>                                        StaticNavigableGeometry;                           // 0x120(0x10)
	char                                                         pad0x130_S31ID[0x130];                             // 0x130(0x130)
	bool                                                         LevelVisibility;                                   // 0x260(0x1)
	char                                                         pad0xf_6YXBR[0xf];                                 // 0x261(0xf)
	bool                                                         Blocked;                                           // 0x270(0x1)
	char                                                         pad0x67_2ZTZ5[0x67];                               // 0x271(0x67)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x2d8(0x10)
	char                                                         pad0x18_DJSQ0[0x18];                               // 0x2e8(0x18)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class ParticleModule: public Object
{
public:
	bool                                                         bSpawnModule;                                      // 0x28(0x1)
	bool                                                         bUpdateModule;                                     // 0x28(0x1)
	bool                                                         bFinalUpdateModule;                                // 0x28(0x1)
	bool                                                         bUpdateForGPUEmitter;                              // 0x28(0x1)
	bool                                                         bCurvesAsColor;                                    // 0x28(0x1)
	bool                                                         b3DDrawMode;                                       // 0x28(0x1)
	bool                                                         bSupported3DDrawMode;                              // 0x28(0x1)
	bool                                                         bEnabled;                                          // 0x28(0x1)
	bool                                                         bEditable;                                         // 0x29(0x1)
	bool                                                         LODDuplicate;                                      // 0x29(0x1)
	bool                                                         bSupportsRandomSeed;                               // 0x29(0x1)
	bool                                                         bRequiresLoopingNotification;                      // 0x29(0x1)
	char                                                         pad0x2_9L6DZ[0x2];                                 // 0x2a(0x2)
	char                                                         LODValidity;                                       // 0x2c(0x1)
	char                                                         pad0x3_A3DOY[0x3];                                 // 0x2d(0x3)
	TArray<int>                                                  ModuleInstanceOffsets;                             // 0x30(0x10)
	TArray<int>                                                  ModuleOffsets;                                     // 0x40(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class Distribution: public Object
{
public:
	char                                                         pad0x8_O8SDS[0x8];                                 // 0x28(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ThumbnailInfo: public Object
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class DialogueVoice: public Object
{
public:
	char                                                         Gender;                                            // 0x28(0x1)
	char                                                         Plurality;                                         // 0x29(0x1)
	char                                                         pad0x2_0XFIF[0x2];                                 // 0x2a(0x2)
	struct Guid                                                  LocalizationGUID;                                  // 0x2c(0x10)
	char                                                         pad0x4_7W9AV[0x4];                                 // 0x3c(0x4)
};


// Size 0x1e8 (Full Size[0x210] - InheritedSize[0x28]
class LevelStreaming: public Object
{
public:
	char                                                         pad0x28_1Y6VN[0x28];                               // 0x28(0x28)
	struct FName                                                 PackageNameToLoad;                                 // 0x50(0x8)
	TArray<struct Name>                                          LODPackageNames;                                   // 0x58(0x10)
	char                                                         pad0x18_P55BT[0x18];                               // 0x68(0x18)
	struct Transform                                             LevelTransform;                                    // 0x80(0x30)
	char                                                         pad0xc_O6ENQ[0xc];                                 // 0xb0(0xc)
	bool                                                         bShouldBeVisibleInEditor;                          // 0xbc(0x1)
	bool                                                         Blocked;                                           // 0xbc(0x1)
	bool                                                         bShouldBeLoaded;                                   // 0xbc(0x1)
	bool                                                         bShouldBeVisible;                                  // 0xbc(0x1)
	bool                                                         bShouldBlockOnLoad;                                // 0xbc(0x1)
	char                                                         pad0x3_HN4U3[0x3];                                 // 0xbd(0x3)
	int                                                          LevelLODIndex;                                     // 0xc0(0x4)
	bool                                                         bDisableDistanceStreaming;                         // 0xc4(0x1)
	bool                                                         bDrawOnLevelStatusMap;                             // 0xc4(0x1)
	char                                                         pad0x3_73MTN[0x3];                                 // 0xc5(0x3)
	struct LinearColor                                           LevelColor;                                        // 0xc8(0x10)
	TArray<class LevelStreamingVolume*>                          EditorStreamingVolumes;                            // 0xd8(0x10)
	float                                                        MinTimeBetweenVolumeUnloadRequests;                // 0xe8(0x4)
	char                                                         pad0x4_8YS95[0x4];                                 // 0xec(0x4)
	TArray<String>                                               Keywords;                                          // 0xf0(0x10)
	class Level*                                                 LoadedLevel;                                       // 0x200(0x8)
	class Level*                                                 PendingUnloadLevel;                                // 0x208(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AnimNotify: public Object
{
public:
	bool                                                         PlayedWithSequencer;                               // 0x28(0x1)
	char                                                         pad0xf_VGNL0[0xf];                                 // 0x29(0xf)
};


// Size 0xc8 (Full Size[0xf0] - InheritedSize[0x28]
class MaterialParameterCollectionInstance: public Object
{
public:
	char                                                         pad0x8_DI3UL[0x8];                                 // 0x28(0x8)
	class MaterialParameterCollection*                           Collection;                                        // 0x30(0x8)
	class World*                                                 World;                                             // 0x38(0x8)
	char                                                         pad0xb0_G5Z4J[0xb0];                               // 0x40(0xb0)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InheritableComponentHandler: public Object
{
public:
	TArray<struct ComponentOverrideRecord>                       Records;                                           // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NetworkPredictionInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CurveEdPresetCurve: public Object
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class SoundNode: public Object
{
public:
	TArray<class SoundNode*>                                     ChildNodes;                                        // 0x28(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class FFTWaterSettings: public Object
{
public:
	struct StringAssetReference                                  FFTWaterMaterialName;                              // 0x28(0x10)
	struct StringAssetReference                                  FFTWaterFoamTextureName;                           // 0x38(0x10)
	int                                                          BaseMeshDetail;                                    // 0x48(0x4)
	char                                                         pad0x4_L8SZ3[0x4];                                 // 0x4c(0x4)
};


// Size 0xf8 (Full Size[0x120] - InheritedSize[0x28]
class CameraAnimInst: public Object
{
public:
	class CameraAnim*                                            CamAnim;                                           // 0x28(0x8)
	class InterpGroupInst*                                       InterpGroupInst;                                   // 0x30(0x8)
	char                                                         pad0x1c_HH3EX[0x1c];                               // 0x38(0x1c)
	float                                                        PlayRate;                                          // 0x54(0x4)
	char                                                         pad0x10_JYSZC[0x10];                               // 0x58(0x10)
	class InterpTrackMove*                                       MoveTrack;                                         // 0x68(0x8)
	class InterpTrackInstMove*                                   MoveInst;                                          // 0x70(0x8)
	class CurveFloat*                                            BlendInCurve;                                      // 0x78(0x8)
	char                                                         PlaySpace;                                         // 0x80(0x1)
	char                                                         pad0x9f_D7J68[0x9f];                               // 0x81(0x9f)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class DataTable: public Object
{
public:
	class ScriptStruct*                                          RowStruct;                                         // 0x28(0x8)
	char                                                         pad0x50_J39X1[0x50];                               // 0x30(0x50)
};


// Size 0x90 (Full Size[0xb8] - InheritedSize[0x28]
class ParticleLODLevel: public Object
{
public:
	int                                                          Level;                                             // 0x28(0x4)
	bool                                                         bEnabled;                                          // 0x2c(0x1)
	char                                                         pad0x3_M19KP[0x3];                                 // 0x2d(0x3)
	class ParticleModuleRequired*                                RequiredModule;                                    // 0x30(0x8)
	TArray<class ParticleModule*>                                Modules;                                           // 0x38(0x10)
	class ParticleModule*                                        TypeDataModule;                                    // 0x48(0x8)
	class ParticleModuleSpawn*                                   SpawnModule;                                       // 0x50(0x8)
	class ParticleModuleEventGenerator*                          EventGenerator;                                    // 0x58(0x8)
	TArray<class ParticleModuleSpawnBase*>                       SpawningModules;                                   // 0x60(0x10)
	TArray<class ParticleModule*>                                SpawnModules;                                      // 0x70(0x10)
	TArray<class ParticleModule*>                                UpdateModules;                                     // 0x80(0x10)
	TArray<class ParticleModuleOrbit*>                           OrbitModules;                                      // 0x90(0x10)
	TArray<class ParticleModuleEventReceiverBase*>               EventReceiverModules;                              // 0xa0(0x10)
	bool                                                         ConvertedModules;                                  // 0xb0(0x1)
	char                                                         pad0x3_SADS2[0x3];                                 // 0xb1(0x3)
	int                                                          PeakActiveParticles;                               // 0xb4(0x4)
};


// Size 0x88 (Full Size[0xb0] - InheritedSize[0x28]
class PlatformInterfaceWebResponse: public Object
{
public:
	struct FString                                               OriginalURL;                                       // 0x28(0x10)
	int                                                          ResponseCode;                                      // 0x38(0x4)
	int                                                          Tag;                                               // 0x3c(0x4)
	struct FString                                               StringResponse;                                    // 0x40(0x10)
	TArray<char>                                                 BinaryResponse;                                    // 0x50(0x10)
	char                                                         pad0x50_W1260[0x50];                               // 0x60(0x50)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class DialogueWave: public Object
{
public:
	bool                                                         bMature;                                           // 0x28(0x1)
	char                                                         pad0x7_18DB6[0x7];                                 // 0x29(0x7)
	struct FString                                               SpokenText;                                        // 0x30(0x10)
	TArray<struct DialogueContextMapping>                        ContextMappings;                                   // 0x40(0x10)
	struct Guid                                                  LocalizationGUID;                                  // 0x50(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Scene: public Object
{
public:
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class Commandlet: public Object
{
public:
	struct FString                                               HelpDescription;                                   // 0x28(0x10)
	struct FString                                               HelpUsage;                                         // 0x38(0x10)
	struct FString                                               HelpWebLink;                                       // 0x48(0x10)
	TArray<String>                                               HelpParamNames;                                    // 0x58(0x10)
	TArray<String>                                               HelpParamDescriptions;                             // 0x68(0x10)
	bool                                                         IsServer;                                          // 0x78(0x1)
	bool                                                         IsClient;                                          // 0x78(0x1)
	bool                                                         IsEditor;                                          // 0x78(0x1)
	bool                                                         LogToConsole;                                      // 0x78(0x1)
	bool                                                         ShowErrorCount;                                    // 0x78(0x1)
	char                                                         pad0x7_GNTUW[0x7];                                 // 0x79(0x7)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AISystemBase: public Object
{
public:
	struct StringClassReference                                  AISystemClassName;                                 // 0x28(0x10)
	struct FName                                                 AISystemModuleName;                                // 0x38(0x8)
};


// Size 0x98 (Full Size[0xc0] - InheritedSize[0x28]
class InputSettings: public Object
{
public:
	TArray<struct InputAxisConfigEntry>                          AxisConfig;                                        // 0x28(0x10)
	bool                                                         bAltEnterTogglesFullscreen;                        // 0x38(0x1)
	bool                                                         bUseMouseForTouch;                                 // 0x38(0x1)
	bool                                                         bEnableMouseSmoothing;                             // 0x38(0x1)
	bool                                                         bEnableFOVScaling;                                 // 0x38(0x1)
	char                                                         pad0x3_Z1M7B[0x3];                                 // 0x39(0x3)
	float                                                        FOVScale;                                          // 0x3c(0x4)
	float                                                        DoubleClickTime;                                   // 0x40(0x4)
	char                                                         pad0x4_JQN7F[0x4];                                 // 0x44(0x4)
	TArray<struct InputActionKeyMapping>                         ActionMappings;                                    // 0x48(0x10)
	TArray<struct InputAxisKeyMapping>                           AxisMappings;                                      // 0x58(0x10)
	TArray<struct InputCombinedAxisKeyMapping>                   CombinedAxisMappings;                              // 0x68(0x10)
	bool                                                         bAlwaysShowTouchInterface;                         // 0x78(0x1)
	bool                                                         bShowConsoleOnFourFingerTap;                       // 0x79(0x1)
	char                                                         pad0x6_L2POZ[0x6];                                 // 0x7a(0x6)
	struct StringAssetReference                                  DefaultTouchInterface;                             // 0x80(0x10)
	struct Key                                                   ConsoleKey;                                        // 0x90(0x20)
	TArray<struct Key>                                           ConsoleKeys;                                       // 0xb0(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class LevelActorContainer: public Object
{
public:
	TArray<class Actor*>                                         Actors;                                            // 0x28(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class MaybeCompressedCanvasRenderTarget2D: public Object
{
public:
	char                                                         pad0x10_83JTO[0x10];                               // 0x28(0x10)
	int                                                          ChannelCount;                                      // 0x38(0x4)
	char                                                         pad0x4_MC4EL[0x4];                                 // 0x3c(0x4)
	class CanvasRenderTarget2D*                                  UncompressedRenderTarget;                          // 0x40(0x8)
	class CompressedCanvasRenderTarget2D*                        CompressedRenderTarget;                            // 0x48(0x8)
};


// Size 0x1b0 (Full Size[0x1d8] - InheritedSize[0x28]
class Font: public Object
{
public:
	char                                                         pad0x8_N8WDI[0x8];                                 // 0x28(0x8)
	char                                                         FontCacheType;                                     // 0x30(0x1)
	char                                                         pad0x7_08BBL[0x7];                                 // 0x31(0x7)
	TArray<struct FontCharacter>                                 Characters;                                        // 0x38(0x10)
	TArray<class Texture2D*>                                     Textures;                                          // 0x48(0x10)
	int                                                          IsRemapped;                                        // 0x58(0x4)
	float                                                        EmScale;                                           // 0x5c(0x4)
	float                                                        Ascent;                                            // 0x60(0x4)
	float                                                        Descent;                                           // 0x64(0x4)
	float                                                        Leading;                                           // 0x68(0x4)
	int                                                          Kerning;                                           // 0x6c(0x4)
	struct FontImportOptionsData                                 ImportOptions;                                     // 0x70(0xb0)
	int                                                          NumCharacters;                                     // 0x120(0x4)
	char                                                         pad0x4_IDP40[0x4];                                 // 0x124(0x4)
	TArray<int>                                                  MaxCharHeight;                                     // 0x128(0x10)
	float                                                        ScalingFactor;                                     // 0x138(0x4)
	int                                                          LegacyFontSize;                                    // 0x13c(0x4)
	struct FName                                                 LegacyFontName;                                    // 0x140(0x8)
	struct CompositeFont                                         CompositeFont;                                     // 0x148(0x28)
	char                                                         pad0x68_JKHB0[0x68];                               // 0x170(0x68)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WaterId: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OnlineSession: public Object
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class AnimNotifyState: public Object
{
public:
	bool                                                         PlayedWithSequencer;                               // 0x28(0x1)
	char                                                         pad0x7_2ZP46[0x7];                                 // 0x29(0x7)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class MorphTarget: public VertexAnimBase
{
public:
	char                                                         pad0x10_6FOT5[0x10];                               // 0x30(0x10)
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class SplineMeshActor: public Actor
{
public:
	class SplineMeshComponent*                                   SplineMeshComponent;                               // 0x3a0(0x8)
};


// Size 0x8 (Full Size[0x58] - InheritedSize[0x50]
class ParticleModuleVelocityBase: public ParticleModule
{
public:
	bool                                                         bInWorldSpace;                                     // 0x50(0x1)
	bool                                                         bApplyOwnerScale;                                  // 0x50(0x1)
	char                                                         pad0x7_SZ1C2[0x7];                                 // 0x51(0x7)
};


// Size 0x40 (Full Size[0xb0] - InheritedSize[0x70]
class MaterialExpressionDecalMipmapLevel: public MaterialExpression
{
public:
	struct ExpressionInput                                       TextureSize;                                       // 0x70(0x38)
	float                                                        ConstWidth;                                        // 0xa8(0x4)
	float                                                        ConstHeight;                                       // 0xac(0x4)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionLocalDisturbanceTexture: public MaterialExpression
{
public:
	struct ExpressionInput                                       Coordinates;                                       // 0x70(0x38)
};


// Size 0x0 (Full Size[0x210] - InheritedSize[0x210]
class LevelStreamingPersistent: public LevelStreaming
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionParticleDirection: public MaterialExpression
{
public:
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionDDY: public MaterialExpression
{
public:
	struct ExpressionInput                                       Value;                                             // 0x70(0x38)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InterpTrackInstToggle: public InterpTrackInst
{
public:
	char                                                         Action;                                            // 0x28(0x1)
	char                                                         pad0x3_EZO81[0x3];                                 // 0x29(0x3)
	float                                                        LastUpdatePosition;                                // 0x2c(0x4)
	bool                                                         bSavedActiveState;                                 // 0x30(0x1)
	char                                                         pad0x7_73EJ7[0x7];                                 // 0x31(0x7)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class AutomaticInstancingSettings: public DeveloperSettings
{
public:
	bool                                                         IsEnabled;                                         // 0x38(0x1)
	char                                                         pad0x7_B6Y0F[0x7];                                 // 0x39(0x7)
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleMaterialBase: public ParticleModule
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class KismetArrayLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class InterpTrackInstFade: public InterpTrackInst
{
public:
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionFrac: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
};


// Size 0x18 (Full Size[0x68] - InheritedSize[0x50]
class DialogueSoundWaveProxy: public SoundBase
{
public:
	char                                                         pad0x18_NGX40[0x18];                               // 0x50(0x18)
};


// Size 0x8 (Full Size[0x58] - InheritedSize[0x50]
class ParticleModuleAccelerationBase: public ParticleModule
{
public:
	bool                                                         bAlwaysInWorldSpace;                               // 0x50(0x1)
	char                                                         pad0x7_407FS[0x7];                                 // 0x51(0x7)
};


// Size 0x80 (Full Size[0xf0] - InheritedSize[0x70]
class MaterialExpressionDesaturation: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
	struct ExpressionInput                                       Fraction;                                          // 0xa8(0x38)
	struct LinearColor                                           LuminanceFactors;                                  // 0xe0(0x10)
};


// Size 0x78 (Full Size[0xe8] - InheritedSize[0x70]
class MaterialExpressionDepthFade: public MaterialExpression
{
public:
	struct ExpressionInput                                       InOpacity;                                         // 0x70(0x38)
	struct ExpressionInput                                       FadeDistance;                                      // 0xa8(0x38)
	float                                                        OpacityDefault;                                    // 0xe0(0x4)
	float                                                        FadeDistanceDefault;                               // 0xe4(0x4)
};


// Size 0x30 (Full Size[0x60] - InheritedSize[0x30]
class AnimNotifyState_TimedParticleEffect: public AnimNotifyState
{
public:
	class ParticleSystem*                                        PSTemplate;                                        // 0x30(0x8)
	struct FName                                                 SocketName;                                        // 0x38(0x8)
	struct Vector                                                LocationOffset;                                    // 0x40(0xc)
	struct Rotator                                               RotationOffset;                                    // 0x4c(0xc)
	bool                                                         bOwnerOnlySee;                                     // 0x58(0x1)
	bool                                                         bOwnerNoSee;                                       // 0x59(0x1)
	bool                                                         bDestroyAtEnd;                                     // 0x5a(0x1)
	bool                                                         bWorldOwnedEffect;                                 // 0x5b(0x1)
	char                                                         pad0x4_J93R9[0x4];                                 // 0x5c(0x4)
};


// Size 0x48 (Full Size[0x80] - InheritedSize[0x38]
class DeviceProfile: public TextureLODSettings
{
public:
	struct FString                                               DeviceType;                                        // 0x38(0x10)
	struct FString                                               BaseProfileName;                                   // 0x48(0x10)
	class Object*                                                Parent;                                            // 0x58(0x8)
	char                                                         pad0x8_3OD8W[0x8];                                 // 0x60(0x8)
	TArray<String>                                               CVars;                                             // 0x68(0x10)
	char                                                         pad0x8_NLLF2[0x8];                                 // 0x78(0x8)
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class VertexAnimation: public VertexAnimBase
{
public:
	int                                                          NumAnimatedVerts;                                  // 0x30(0x4)
	char                                                         pad0x14_SRMUC[0x14];                               // 0x34(0x14)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class KismetNodeHelperLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class StreamingSettings: public DeveloperSettings
{
public:
	bool                                                         AsyncLoadingThreadEnabled;                         // 0x38(0x1)
	bool                                                         WarnIfTimeLimitExceeded;                           // 0x38(0x1)
	char                                                         pad0x3_J31TZ[0x3];                                 // 0x39(0x3)
	float                                                        TimeLimitExceededMultiplier;                       // 0x3c(0x4)
	float                                                        TimeLimitExceededMinTime;                          // 0x40(0x4)
	int                                                          MinBulkDataSizeForAsyncLoading;                    // 0x44(0x4)
	float                                                        AsyncIOBandwidthLimit;                             // 0x48(0x4)
	bool                                                         UseBackgroundLevelStreaming;                       // 0x4c(0x1)
	bool                                                         AsyncLoadingUseFullTimeLimit;                      // 0x4c(0x1)
	char                                                         pad0x3_GLE5N[0x3];                                 // 0x4d(0x3)
	float                                                        AsyncLoadingTimeLimit;                             // 0x50(0x4)
	float                                                        PriorityAsyncLoadingExtraTime;                     // 0x54(0x4)
	float                                                        LevelStreamingActorsUpdateTimeLimit;               // 0x58(0x4)
	int                                                          LevelStreamingComponentsRegistrationGranularity;   // 0x5c(0x4)
};


// Size 0x30 (Full Size[0x3d0] - InheritedSize[0x3a0]
class SkeletalMeshActor: public Actor
{
public:
	char                                                         pad0x8_PI6W0[0x8];                                 // 0x3a0(0x8)
	bool                                                         bShouldDoAnimNotifies;                             // 0x3a8(0x1)
	bool                                                         bWakeOnLevelStart;                                 // 0x3a8(0x1)
	char                                                         pad0x7_XQB1D[0x7];                                 // 0x3a9(0x7)
	class SkeletalMeshComponent*                                 SkeletalMeshComponent;                             // 0x3b0(0x8)
	class SkeletalMesh*                                          ReplicatedMesh;                                    // 0x3b8(0x8)
	class PhysicsAsset*                                          ReplicatedPhysAsset;                               // 0x3c0(0x8)
	char                                                         pad0x8_IE7HG[0x8];                                 // 0x3c8(0x8)
};


// Size 0x48 (Full Size[0xb8] - InheritedSize[0x70]
class MaterialExpressionCustom: public MaterialExpression
{
public:
	struct FString                                               Code;                                              // 0x70(0x10)
	char                                                         OutputType;                                        // 0x80(0x1)
	char                                                         pad0x7_44MHJ[0x7];                                 // 0x81(0x7)
	struct FString                                               Description;                                       // 0x88(0x10)
	TArray<struct CustomInput>                                   Inputs;                                            // 0x98(0x10)
	struct FString                                               DeclarationCode;                                   // 0xa8(0x10)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class InterpFilter_Custom: public InterpFilter
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionSceneTexelSize: public MaterialExpression
{
public:
};


// Size 0x8 (Full Size[0x148] - InheritedSize[0x140]
class TextureProxy: public Texture
{
public:
	class Texture*                                               Texture;                                           // 0x140(0x8)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionParticleMacroUV: public MaterialExpression
{
public:
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class MaterialExpressionStaticBool: public MaterialExpression
{
public:
	bool                                                         Value;                                             // 0x70(0x1)
	char                                                         pad0x7_N68BS[0x7];                                 // 0x71(0x7)
};


// Size 0x40 (Full Size[0xb0] - InheritedSize[0x70]
class MaterialExpressionComponentMask: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
	bool                                                         R;                                                 // 0xa8(0x1)
	bool                                                         G;                                                 // 0xa8(0x1)
	bool                                                         B;                                                 // 0xa8(0x1)
	bool                                                         A;                                                 // 0xa8(0x1)
	char                                                         pad0x7_SW84E[0x7];                                 // 0xa9(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class InterpTrackInstColorScale: public InterpTrackInst
{
public:
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class SoundNodeOscillator: public SoundNode
{
public:
	bool                                                         bModulateVolume;                                   // 0x38(0x1)
	bool                                                         bModulatePitch;                                    // 0x38(0x1)
	char                                                         pad0x3_OOHCL[0x3];                                 // 0x39(0x3)
	float                                                        AmplitudeMin;                                      // 0x3c(0x4)
	float                                                        AmplitudeMax;                                      // 0x40(0x4)
	float                                                        FrequencyMin;                                      // 0x44(0x4)
	float                                                        FrequencyMax;                                      // 0x48(0x4)
	float                                                        OffsetMin;                                         // 0x4c(0x4)
	float                                                        OffsetMax;                                         // 0x50(0x4)
	float                                                        CenterMin;                                         // 0x54(0x4)
	float                                                        CenterMax;                                         // 0x58(0x4)
	char                                                         pad0x4_851VY[0x4];                                 // 0x5c(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class InterpTrackInstDirector: public InterpTrackInst
{
public:
	class Actor*                                                 OldViewTarget;                                     // 0x28(0x8)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionBlackBody: public MaterialExpression
{
public:
	struct ExpressionInput                                       Temp;                                              // 0x70(0x38)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionDistanceToNearestSurface: public MaterialExpression
{
public:
	struct ExpressionInput                                       Position;                                          // 0x70(0x38)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionObjectBounds: public MaterialExpression
{
public:
};


// Size 0xd8 (Full Size[0x5b8] - InheritedSize[0x4e0]
class DemoNetDriver: public NetDriver
{
public:
	char                                                         pad0xd8_BZBLF[0xd8];                               // 0x4e0(0xd8)
};


// Size 0x8 (Full Size[0x58] - InheritedSize[0x50]
class ParticleModuleSpawnBase: public ParticleModule
{
public:
	bool                                                         bProcessSpawnRate;                                 // 0x50(0x1)
	bool                                                         bProcessBurstList;                                 // 0x50(0x1)
	char                                                         pad0x7_91FI3[0x7];                                 // 0x51(0x7)
};


// Size 0x8 (Full Size[0x48] - InheritedSize[0x40]
class AnimCompress_Automatic: public AnimCompress
{
public:
	float                                                        MaxEndEffectorError;                               // 0x40(0x4)
	bool                                                         bTryFixedBitwiseCompression;                       // 0x44(0x1)
	bool                                                         bTryPerTrackBitwiseCompression;                    // 0x44(0x1)
	bool                                                         bTryLinearKeyRemovalCompression;                   // 0x44(0x1)
	bool                                                         bTryIntervalKeyRemoval;                            // 0x44(0x1)
	bool                                                         bRunCurrentDefaultCompressor;                      // 0x44(0x1)
	bool                                                         bAutoReplaceIfExistingErrorTooGreat;               // 0x44(0x1)
	bool                                                         bRaiseMaxErrorToExisting;                          // 0x44(0x1)
	char                                                         pad0x3_TIOJQ[0x3];                                 // 0x45(0x3)
};


// Size 0x120 (Full Size[0x158] - InheritedSize[0x38]
class CollisionProfile: public DeveloperSettings
{
public:
	TArray<struct CollisionResponseTemplate>                     Profiles;                                          // 0x38(0x10)
	TArray<struct CustomChannelSetup>                            DefaultChannelResponses;                           // 0x48(0x10)
	TArray<struct CustomProfile>                                 EditProfiles;                                      // 0x58(0x10)
	TArray<struct Redirector>                                    ProfileRedirects;                                  // 0x68(0x10)
	TArray<struct Redirector>                                    CollisionChannelRedirects;                         // 0x78(0x10)
	char                                                         pad0xd0_IHZN2[0xd0];                               // 0x88(0xd0)
};


// Size 0x0 (Full Size[0xa8] - InheritedSize[0xa8]
class AnimDataEntryStruct: public UserDefinedStruct
{
public:
};


// Size 0x1c8 (Full Size[0x218] - InheritedSize[0x50]
class SoundWave: public SoundBase
{
public:
	int                                                          CompressionQuality;                                // 0x50(0x4)
	bool                                                         bLooping;                                          // 0x54(0x1)
	bool                                                         bStreaming;                                        // 0x54(0x1)
	char                                                         pad0x3_LC7RM[0x3];                                 // 0x55(0x3)
	int                                                          StreamingPriority;                                 // 0x58(0x4)
	bool                                                         bMature;                                           // 0x5c(0x1)
	bool                                                         bManualWordWrap;                                   // 0x5c(0x1)
	bool                                                         bSingleLine;                                       // 0x5c(0x1)
	char                                                         pad0x3_KWUF8[0x3];                                 // 0x5d(0x3)
	char                                                         SoundGroup;                                        // 0x60(0x1)
	char                                                         pad0x7_IZSND[0x7];                                 // 0x61(0x7)
	struct FString                                               SpokenText;                                        // 0x68(0x10)
	float                                                        Volume;                                            // 0x78(0x4)
	float                                                        Pitch;                                             // 0x7c(0x4)
	int                                                          NumChannels;                                       // 0x80(0x4)
	int                                                          SampleRate;                                        // 0x84(0x4)
	int                                                          RawPCMDataSize;                                    // 0x88(0x4)
	char                                                         pad0x4_ND8AI[0x4];                                 // 0x8c(0x4)
	TArray<struct SubtitleCue>                                   Subtitles;                                         // 0x90(0x10)
	TArray<struct LocalizedSubtitle>                             LocalizedSubtitles;                                // 0xa0(0x10)
	char                                                         pad0x168_FJPT4[0x168];                             // 0xb0(0x168)
};


// Size 0x220 (Full Size[0x250] - InheritedSize[0x30]
class GameViewportClient: public ScriptViewportClient
{
public:
	char                                                         pad0x8_K8MQL[0x8];                                 // 0x30(0x8)
	class Console*                                               ViewportConsole;                                   // 0x38(0x8)
	TArray<struct DebugDisplayProperty>                          DebugProperties;                                   // 0x40(0x10)
	char                                                         pad0x30_31AXF[0x30];                               // 0x50(0x30)
	class World*                                                 World;                                             // 0x80(0x8)
	class GameInstance*                                          GameInstance;                                      // 0x88(0x8)
	char                                                         pad0x1c0_O5DHT[0x1c0];                             // 0x90(0x1c0)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionScreenPosition: public MaterialExpression
{
public:
};


// Size 0x58 (Full Size[0x198] - InheritedSize[0x140]
class Texture2D: public Texture
{
public:
	int                                                          RequestedMips;                                     // 0x140(0x4)
	int                                                          ResidentMips;                                      // 0x144(0x4)
	int                                                          StreamingIndex;                                    // 0x148(0x4)
	int                                                          FirstResourceMemMip;                               // 0x14c(0x4)
	char                                                         pad0x4_Q92OE[0x4];                                 // 0x150(0x4)
	struct IntPoint                                              ImportedSize;                                      // 0x154(0x8)
	float                                                        ForceMipLevelsToBeResidentTimestamp;               // 0x15c(0x4)
	bool                                                         bTemporarilyDisableStreaming;                      // 0x160(0x1)
	bool                                                         bIsStreamable;                                     // 0x160(0x1)
	bool                                                         bHasCancelationPending;                            // 0x160(0x1)
	bool                                                         bForceMiplevelsToBeResident;                       // 0x160(0x1)
	bool                                                         bGlobalForceMipLevelsToBeResident;                 // 0x160(0x1)
	char                                                         pad0x3_49BH1[0x3];                                 // 0x161(0x3)
	char                                                         AddressX;                                          // 0x164(0x1)
	char                                                         AddressY;                                          // 0x165(0x1)
	char                                                         pad0x2_WMROD[0x2];                                 // 0x166(0x2)
	int                                                          MinimumLoadedMips;                                 // 0x168(0x4)
	char                                                         pad0x2c_OUTG2[0x2c];                               // 0x16c(0x2c)
};


// Size 0x10 (Full Size[0x3b0] - InheritedSize[0x3a0]
class StaticMeshActor: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x3a0(0x8)
	bool                                                         bStaticMeshReplicateMovement;                      // 0x3a8(0x1)
	char                                                         NavigationGeometryGatheringMode;                   // 0x3a9(0x1)
	char                                                         pad0x6_BK24T[0x6];                                 // 0x3aa(0x6)
};


// Size 0xe0 (Full Size[0x150] - InheritedSize[0x70]
class MaterialExpressionQualitySwitch: public MaterialExpression
{
public:
	struct ExpressionInput                                       Default;                                           // 0x70(0x38)
	struct ExpressionInput                                       Inputs;                                            // 0xa8(0x38)
	char                                                         pad0x70_LXMFA[0x70];                               // 0xe0(0x70)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class TwitterIntegrationBase: public PlatformInterfaceBase
{
public:
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleParameterBase: public ParticleModule
{
public:
};


// Size 0x40 (Full Size[0xb0] - InheritedSize[0x70]
class MaterialExpressionTransformPosition: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
	char                                                         TransformSourceType;                               // 0xa8(0x1)
	char                                                         TransformType;                                     // 0xa9(0x1)
	char                                                         pad0x6_L0YTA[0x6];                                 // 0xaa(0x6)
};


// Size 0xf0 (Full Size[0x160] - InheritedSize[0x70]
class MaterialExpressionIfCondition: public MaterialExpression
{
public:
	struct ExpressionInput                                       A;                                                 // 0x70(0x38)
	struct ExpressionInput                                       B;                                                 // 0xa8(0x38)
	struct ExpressionInput                                       IfTrue;                                            // 0xe0(0x38)
	struct ExpressionInput                                       IfFalse;                                           // 0x118(0x38)
	char                                                         Condition;                                         // 0x150(0x1)
	char                                                         Attribute;                                         // 0x151(0x1)
	char                                                         pad0x2_QKMWU[0x2];                                 // 0x152(0x2)
	float                                                        ConstB;                                            // 0x154(0x4)
	float                                                        ConstIfTrue;                                       // 0x158(0x4)
	float                                                        ConstIfFalse;                                      // 0x15c(0x4)
};


// Size 0x28 (Full Size[0x78] - InheritedSize[0x50]
class AnimSequenceBase: public AnimationAsset
{
public:
	TArray<struct AnimNotifyEvent>                               Notifies;                                          // 0x50(0x10)
	float                                                        SequenceLength;                                    // 0x60(0x4)
	float                                                        RateScale;                                         // 0x64(0x4)
	struct RawCurveTracks                                        RawCurveData;                                      // 0x68(0x10)
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class ComponentWithTestInterface: public ActorComponent
{
public:
	char                                                         pad0x8_23QTS[0x8];                                 // 0xb8(0x8)
};


// Size 0x10 (Full Size[0x220] - InheritedSize[0x210]
class LevelStreamingKismet: public LevelStreaming
{
public:
	bool                                                         bInitiallyLoaded;                                  // 0x210(0x1)
	bool                                                         bInitiallyVisible;                                 // 0x210(0x1)
	char                                                         pad0xf_QWUYG[0xf];                                 // 0x211(0xf)
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleOrientationBase: public ParticleModule
{
public:
};


// Size 0x20 (Full Size[0x90] - InheritedSize[0x70]
class InterpTrackFloatBase: public InterpTrack
{
public:
	struct InterpCurveFloat                                      FloatTrack;                                        // 0x70(0x18)
	float                                                        CurveTension;                                      // 0x88(0x4)
	char                                                         pad0x4_X30UZ[0x4];                                 // 0x8c(0x4)
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleEventBase: public ParticleModule
{
public:
};


// Size 0x20 (Full Size[0x90] - InheritedSize[0x70]
class InterpTrackLinearColorBase: public InterpTrack
{
public:
	struct InterpCurveLinearColor                                LinearColorTrack;                                  // 0x70(0x18)
	float                                                        CurveTension;                                      // 0x88(0x4)
	char                                                         pad0x4_E9NGI[0x4];                                 // 0x8c(0x4)
};


// Size 0x78 (Full Size[0x418] - InheritedSize[0x3a0]
class MatineeActor: public Actor
{
public:
	class InterpData*                                            MatineeData;                                       // 0x3a0(0x8)
	struct FName                                                 MatineeControllerName;                             // 0x3a8(0x8)
	float                                                        PlayRate;                                          // 0x3b0(0x4)
	bool                                                         bPlayOnLevelLoad;                                  // 0x3b4(0x1)
	bool                                                         bForceStartPos;                                    // 0x3b4(0x1)
	char                                                         pad0x3_7X612[0x3];                                 // 0x3b5(0x3)
	float                                                        ForceStartPosition;                                // 0x3b8(0x4)
	bool                                                         bLooping;                                          // 0x3bc(0x1)
	bool                                                         bRewindOnPlay;                                     // 0x3bc(0x1)
	bool                                                         bNoResetOnRewind;                                  // 0x3bc(0x1)
	bool                                                         bRewindIfAlreadyPlaying;                           // 0x3bc(0x1)
	bool                                                         bDisableRadioFilter;                               // 0x3bc(0x1)
	bool                                                         bClientSideOnly;                                   // 0x3bc(0x1)
	bool                                                         bSkipUpdateIfNotVisible;                           // 0x3bc(0x1)
	bool                                                         bIsSkippable;                                      // 0x3bc(0x1)
	char                                                         pad0x3_MDVBL[0x3];                                 // 0x3bd(0x3)
	int                                                          PreferredSplitScreenNum;                           // 0x3c0(0x4)
	bool                                                         bDisableMovementInput;                             // 0x3c4(0x1)
	bool                                                         bDisableLookAtInput;                               // 0x3c4(0x1)
	bool                                                         bHidePlayer;                                       // 0x3c4(0x1)
	bool                                                         bHideHud;                                          // 0x3c4(0x1)
	char                                                         pad0x3_LGAWU[0x3];                                 // 0x3c5(0x3)
	TArray<struct InterpGroupActorInfo>                          GroupActorInfos;                                   // 0x3c8(0x10)
	bool                                                         bShouldShowGore;                                   // 0x3d8(0x1)
	char                                                         pad0x7_WVU2R[0x7];                                 // 0x3d9(0x7)
	TArray<class InterpGroupInst*>                               GroupInst;                                         // 0x3e0(0x10)
	TArray<struct CameraCutInfo>                                 CameraCuts;                                        // 0x3f0(0x10)
	bool                                                         bIsPlaying;                                        // 0x400(0x1)
	bool                                                         bReversePlayback;                                  // 0x400(0x1)
	bool                                                         bPaused;                                           // 0x400(0x1)
	bool                                                         bPendingStop;                                      // 0x400(0x1)
	char                                                         pad0x3_MOMDZ[0x3];                                 // 0x401(0x3)
	float                                                        InterpPosition;                                    // 0x404(0x4)
	char                                                         pad0x4_DDY3J[0x4];                                 // 0x408(0x4)
	char                                                         ReplicationForceIsPlaying;                         // 0x40c(0x1)
	char                                                         pad0x7_GZPR2[0x7];                                 // 0x40d(0x7)
	bool                                                         bServerInitialLevelStreamingComplete;              // 0x414(0x1)
	char                                                         pad0x3_7Y5L1[0x3];                                 // 0x415(0x3)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class SoundNodeDoppler: public SoundNode
{
public:
	float                                                        DopplerIntensity;                                  // 0x38(0x4)
	char                                                         pad0x4_5RF0D[0x4];                                 // 0x3c(0x4)
};


// Size 0x20 (Full Size[0x90] - InheritedSize[0x70]
class MaterialExpressionDynamicParameter: public MaterialExpression
{
public:
	TArray<String>                                               ParamNames;                                        // 0x70(0x10)
	struct LinearColor                                           DefaultValue;                                      // 0x80(0x10)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionPerInstanceFadeAmount: public MaterialExpression
{
public:
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class TextRenderActor: public Actor
{
public:
	class TextRenderComponent*                                   TextRender;                                        // 0x3a0(0x8)
};


// Size 0x0 (Full Size[0x40] - InheritedSize[0x40]
class NavAreaMeta: public NavArea
{
public:
};


// Size 0x78 (Full Size[0xe8] - InheritedSize[0x70]
class MaterialExpressionFunctionOutput: public MaterialExpression
{
public:
	struct FString                                               OutputName;                                        // 0x70(0x10)
	struct FString                                               Description;                                       // 0x80(0x10)
	int                                                          SortPriority;                                      // 0x90(0x4)
	char                                                         pad0x4_2Z69F[0x4];                                 // 0x94(0x4)
	struct ExpressionInput                                       A;                                                 // 0x98(0x38)
	bool                                                         bLastPreviewed;                                    // 0xd0(0x1)
	char                                                         pad0x3_0B5G2[0x3];                                 // 0xd1(0x3)
	struct Guid                                                  Id;                                                // 0xd4(0x10)
	char                                                         pad0x4_746M8[0x4];                                 // 0xe4(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DeformablesBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class AmbientSound: public Actor
{
public:
	class AudioComponent*                                        AudioComponent;                                    // 0x3a0(0x8)
};


// Size 0x78 (Full Size[0xe8] - InheritedSize[0x70]
class MaterialExpressionPower: public MaterialExpression
{
public:
	struct ExpressionInput                                       Base;                                              // 0x70(0x38)
	struct ExpressionInput                                       Exponent;                                          // 0xa8(0x38)
	float                                                        ConstExponent;                                     // 0xe0(0x4)
	char                                                         pad0x4_B1PMS[0x4];                                 // 0xe4(0x4)
};


// Size 0x20 (Full Size[0xd8] - InheritedSize[0xb8]
class PlatformEventsComponent: public ActorComponent
{
public:
	char                                                         pad0x20_QJETV[0x20];                               // 0xb8(0x20)
};


// Size 0x1e0 (Full Size[0x228] - InheritedSize[0x48]
class LocalPlayer: public Player
{
public:
	char                                                         pad0x30_MQKV7[0x30];                               // 0x48(0x30)
	class GameViewportClient*                                    ViewportClient;                                    // 0x78(0x8)
	char                                                         pad0x40_S0RWW[0x40];                               // 0x80(0x40)
	char                                                         AspectRatioAxisConstraint;                         // 0xc0(0x1)
	char                                                         pad0x7_U1WDG[0x7];                                 // 0xc1(0x7)
	class UClass*                                                PendingLevelPlayerControllerClass;                 // 0xc8(0x8)
	bool                                                         bSentSplitJoin;                                    // 0xd0(0x1)
	char                                                         pad0x3_802JM[0x3];                                 // 0xd1(0x3)
	float                                                        MinimumAspectRatio;                                // 0xd4(0x4)
	char                                                         pad0x150_OB6CU[0x150];                             // 0xd8(0x150)
};


// Size 0x0 (Full Size[0x40] - InheritedSize[0x40]
class NavArea_Default: public NavArea
{
public:
};


// Size 0x78 (Full Size[0xe8] - InheritedSize[0x70]
class MaterialExpressionMin: public MaterialExpression
{
public:
	struct ExpressionInput                                       A;                                                 // 0x70(0x38)
	struct ExpressionInput                                       B;                                                 // 0xa8(0x38)
	float                                                        ConstA;                                            // 0xe0(0x4)
	float                                                        ConstB;                                            // 0xe4(0x4)
};


// Size 0x10 (Full Size[0x80] - InheritedSize[0x70]
class MaterialExpressionConstant3Vector: public MaterialExpression
{
public:
	struct LinearColor                                           Constant;                                          // 0x70(0x10)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionTwoSidedSign: public MaterialExpression
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class PostProcessEditorSettings: public DeveloperSettings
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionPerInstanceRandom: public MaterialExpression
{
public:
};


// Size 0xa8 (Full Size[0x118] - InheritedSize[0x70]
class MaterialExpressionGIReplace: public MaterialExpression
{
public:
	struct ExpressionInput                                       Default;                                           // 0x70(0x38)
	struct ExpressionInput                                       StaticIndirect;                                    // 0xa8(0x38)
	struct ExpressionInput                                       DynamicIndirect;                                   // 0xe0(0x38)
};


// Size 0x10 (Full Size[0x50] - InheritedSize[0x40]
class AnimCompress_RemoveTrivialKeys: public AnimCompress
{
public:
	float                                                        MaxPosDiff;                                        // 0x40(0x4)
	float                                                        MaxAngleDiff;                                      // 0x44(0x4)
	float                                                        MaxScaleDiff;                                      // 0x48(0x4)
	char                                                         pad0x4_TW1IW[0x4];                                 // 0x4c(0x4)
};


// Size 0xb8 (Full Size[0x128] - InheritedSize[0x70]
class MaterialExpressionFresnel: public MaterialExpression
{
public:
	struct ExpressionInput                                       ExponentIn;                                        // 0x70(0x38)
	float                                                        Exponent;                                          // 0xa8(0x4)
	char                                                         pad0x4_04J35[0x4];                                 // 0xac(0x4)
	struct ExpressionInput                                       BaseReflectFractionIn;                             // 0xb0(0x38)
	float                                                        BaseReflectFraction;                               // 0xe8(0x4)
	char                                                         pad0x4_4BC1R[0x4];                                 // 0xec(0x4)
	struct ExpressionInput                                       Normal;                                            // 0xf0(0x38)
};


// Size 0xe0 (Full Size[0x130] - InheritedSize[0x50]
class SoundCue: public SoundBase
{
public:
	bool                                                         bOverrideAttenuation;                              // 0x50(0x1)
	char                                                         pad0x7_DAB6G[0x7];                                 // 0x51(0x7)
	class SoundNode*                                             FirstNode;                                         // 0x58(0x8)
	float                                                        VolumeMultiplier;                                  // 0x60(0x4)
	float                                                        PitchMultiplier;                                   // 0x64(0x4)
	struct AttenuationSettings                                   AttenuationOverrides;                              // 0x68(0xc0)
	char                                                         pad0x8_91Z88[0x8];                                 // 0x128(0x8)
};


// Size 0x78 (Full Size[0x418] - InheritedSize[0x3a0]
class Pawn: public Actor
{
public:
	char                                                         pad0x8_P2IST[0x8];                                 // 0x3a0(0x8)
	bool                                                         bUseControllerRotationPitch;                       // 0x3a8(0x1)
	bool                                                         bUseControllerRotationYaw;                         // 0x3a8(0x1)
	bool                                                         bUseControllerRotationRoll;                        // 0x3a8(0x1)
	bool                                                         bCanAffectNavigationGeneration;                    // 0x3a8(0x1)
	char                                                         pad0x3_89S82[0x3];                                 // 0x3a9(0x3)
	float                                                        BaseEyeHeight;                                     // 0x3ac(0x4)
	char                                                         AutoPossessPlayer;                                 // 0x3b0(0x1)
	char                                                         AutoPossessAI;                                     // 0x3b1(0x1)
	char                                                         pad0x6_KRUDF[0x6];                                 // 0x3b2(0x6)
	class UClass*                                                AIControllerClass;                                 // 0x3b8(0x8)
	class PlayerState*                                           PlayerState;                                       // 0x3c0(0x8)
	char                                                         RemoteViewPitch;                                   // 0x3c8(0x1)
	char                                                         pad0x7_XIDOM[0x7];                                 // 0x3c9(0x7)
	class Controller*                                            LastHitBy;                                         // 0x3d0(0x8)
	class Controller*                                            Controller;                                        // 0x3d8(0x8)
	char                                                         pad0x18_7G40Y[0x18];                               // 0x3e0(0x18)
	struct Vector                                                ControlInputVector;                                // 0x3f8(0xc)
	struct Vector                                                LastControlInputVector;                            // 0x404(0xc)
	char                                                         pad0x8_6PQ0V[0x8];                                 // 0x410(0x8)
};


// Size 0x58 (Full Size[0x3f8] - InheritedSize[0x3a0]
class AutomaticInstancingActor: public Actor
{
public:
	class SceneComponent*                                        DummyRoot;                                         // 0x3a0(0x8)
	char                                                         pad0x50_YY2GX[0x50];                               // 0x3a8(0x50)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class NetworkSettings: public DeveloperSettings
{
public:
	bool                                                         bVerifyPeer;                                       // 0x38(0x1)
	char                                                         pad0x7_T5E9J[0x7];                                 // 0x39(0x7)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class InterpTrackInstAnimControl: public InterpTrackInst
{
public:
	float                                                        LastUpdatePosition;                                // 0x28(0x4)
	char                                                         pad0x4_U8Q38[0x4];                                 // 0x2c(0x4)
};


// Size 0x0 (Full Size[0x210] - InheritedSize[0x210]
class LevelStreamingAlwaysLoaded: public LevelStreaming
{
public:
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class SoundNodeDelay: public SoundNode
{
public:
	float                                                        DelayMin;                                          // 0x38(0x4)
	float                                                        DelayMax;                                          // 0x3c(0x4)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionVertexColor: public MaterialExpression
{
public:
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class SoundNodeLooping: public SoundNode
{
public:
	int                                                          LoopCount;                                         // 0x38(0x4)
	bool                                                         bLoopIndefinitely;                                 // 0x3c(0x1)
	char                                                         pad0x3_9T1P3[0x3];                                 // 0x3d(0x3)
};


// Size 0x90 (Full Size[0x100] - InheritedSize[0x70]
class MaterialExpressionFunctionInput: public MaterialExpression
{
public:
	struct ExpressionInput                                       Preview;                                           // 0x70(0x38)
	struct FString                                               InputName;                                         // 0xa8(0x10)
	struct FString                                               Description;                                       // 0xb8(0x10)
	struct Guid                                                  Id;                                                // 0xc8(0x10)
	char                                                         InputType;                                         // 0xd8(0x1)
	char                                                         pad0x7_2X8CZ[0x7];                                 // 0xd9(0x7)
	struct Vector4                                               PreviewValue;                                      // 0xe0(0x10)
	bool                                                         bUsePreviewValueAsDefault;                         // 0xf0(0x1)
	char                                                         pad0x3_U38QY[0x3];                                 // 0xf1(0x3)
	int                                                          SortPriority;                                      // 0xf4(0x4)
	bool                                                         bCompilingFunctionPreview;                         // 0xf8(0x1)
	char                                                         pad0x7_FI317[0x7];                                 // 0xf9(0x7)
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class LevelScriptActor: public Actor
{
public:
	bool                                                         bInputEnabled;                                     // 0x3a0(0x1)
	char                                                         pad0x7_052VY[0x7];                                 // 0x3a1(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class KismetMathLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x40 (Full Size[0x78] - InheritedSize[0x38]
class SoundNodeModulatorContinuous: public SoundNode
{
public:
	struct ModulatorContinuousParams                             PitchModulationParams;                             // 0x38(0x20)
	struct ModulatorContinuousParams                             VolumeModulationParams;                            // 0x58(0x20)
};


// Size 0x80 (Full Size[0xf0] - InheritedSize[0x70]
class MaterialExpressionSceneDepth: public MaterialExpression
{
public:
	char                                                         InputMode;                                         // 0x70(0x1)
	char                                                         pad0x7_K9GJ5[0x7];                                 // 0x71(0x7)
	struct ExpressionInput                                       Input;                                             // 0x78(0x38)
	struct ExpressionInput                                       Coordinates;                                       // 0xb0(0x38)
	struct Vector2D                                              ConstInput;                                        // 0xe8(0x8)
};


// Size 0x0 (Full Size[0x100] - InheritedSize[0x100]
class DemoPendingNetGame: public PendingNetGame
{
public:
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionAbs: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
};


// Size 0x1c0 (Full Size[0x560] - InheritedSize[0x3a0]
class NavigationData: public Actor
{
public:
	class PrimitiveComponent*                                    RenderingComp;                                     // 0x3a0(0x8)
	struct NavDataConfig                                         NavDataConfig;                                     // 0x3a8(0x58)
	bool                                                         bEnableDrawing;                                    // 0x400(0x1)
	bool                                                         bRebuildAtRuntime;                                 // 0x400(0x1)
	char                                                         pad0x3_5ZCR5[0x3];                                 // 0x401(0x3)
	char                                                         RuntimeGeneration;                                 // 0x404(0x1)
	char                                                         pad0x3_V4PK1[0x3];                                 // 0x405(0x3)
	bool                                                         bForceRebuildOnLoad;                               // 0x408(0x1)
	char                                                         pad0x3_6UKT4[0x3];                                 // 0x409(0x3)
	float                                                        ObservedPathsTickInterval;                         // 0x40c(0x4)
	char                                                         pad0xe8_E9QCV[0xe8];                               // 0x410(0xe8)
	TArray<struct SupportedAreaData>                             SupportedAreas;                                    // 0x4f8(0x10)
	char                                                         pad0x58_62476[0x58];                               // 0x508(0x58)
};


// Size 0x10 (Full Size[0x80] - InheritedSize[0x70]
class MaterialExpressionTextureBase: public MaterialExpression
{
public:
	class Texture*                                               Texture;                                           // 0x70(0x8)
	char                                                         SamplerType;                                       // 0x78(0x1)
	char                                                         pad0x3_FQFUQ[0x3];                                 // 0x79(0x3)
	bool                                                         IsDefaultMeshpaintTexture;                         // 0x7c(0x1)
	char                                                         pad0x3_1XHT2[0x3];                                 // 0x7d(0x3)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class SoundNodeWaveParam: public SoundNode
{
public:
	struct FName                                                 WaveParameterName;                                 // 0x38(0x8)
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleWindBase: public ParticleModule
{
public:
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleLocationBase: public ParticleModule
{
public:
};


// Size 0x78 (Full Size[0xe8] - InheritedSize[0x70]
class MaterialExpressionSubtract: public MaterialExpression
{
public:
	struct ExpressionInput                                       A;                                                 // 0x70(0x38)
	struct ExpressionInput                                       B;                                                 // 0xa8(0x38)
	float                                                        ConstA;                                            // 0xe0(0x4)
	float                                                        ConstB;                                            // 0xe4(0x4)
};


// Size 0x168 (Full Size[0x198] - InheritedSize[0x30]
class CurveVector: public CurveBase
{
public:
	struct RichCurve                                             FloatCurves;                                       // 0x30(0x78)
	char                                                         pad0xf0_VE5TA[0xf0];                               // 0xa8(0xf0)
};


// Size 0x40 (Full Size[0xb0] - InheritedSize[0x70]
class MaterialExpressionSceneTexture: public MaterialExpression
{
public:
	struct ExpressionInput                                       Coordinates;                                       // 0x70(0x38)
	char                                                         SceneTextureId;                                    // 0xa8(0x1)
	bool                                                         bClampUVs;                                         // 0xa9(0x1)
	bool                                                         bFiltered;                                         // 0xaa(0x1)
	char                                                         pad0x5_WZMN8[0x5];                                 // 0xab(0x5)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionCausticTexture: public MaterialExpression
{
public:
	struct ExpressionInput                                       Coordinates;                                       // 0x70(0x38)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class SoundNodeDistanceCrossFade: public SoundNode
{
public:
	TArray<struct DistanceDatum>                                 CrossFadeInput;                                    // 0x38(0x10)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionLumaAvg: public MaterialExpression
{
public:
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class SoundNodeSwitch: public SoundNode
{
public:
	struct FName                                                 IntParameterName;                                  // 0x38(0x8)
};


// Size 0x18 (Full Size[0x88] - InheritedSize[0x70]
class InterpTrackVisibility: public InterpTrack
{
public:
	TArray<struct VisibilityTrackKey>                            VisibilityTrack;                                   // 0x70(0x10)
	bool                                                         bFireEventsWhenForwards;                           // 0x80(0x1)
	bool                                                         bFireEventsWhenBackwards;                          // 0x80(0x1)
	bool                                                         bFireEventsWhenJumpingForwards;                    // 0x80(0x1)
	char                                                         pad0x7_YCHEI[0x7];                                 // 0x81(0x7)
};


// Size 0x70 (Full Size[0xe0] - InheritedSize[0x70]
class MaterialExpressionDotProduct: public MaterialExpression
{
public:
	struct ExpressionInput                                       A;                                                 // 0x70(0x38)
	struct ExpressionInput                                       B;                                                 // 0xa8(0x38)
};


// Size 0x10 (Full Size[0x3b0] - InheritedSize[0x3a0]
class FogVolume: public Actor
{
public:
	class SphereComponent*                                       SphereComponent;                                   // 0x3a0(0x8)
	class FogVolumeComponent*                                    FogVolumeComponent;                                // 0x3a8(0x8)
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class SoundNodeSoundClass: public SoundNode
{
public:
	class SoundClass*                                            SoundClassOverride;                                // 0x38(0x8)
};


// Size 0x20 (Full Size[0xb0] - InheritedSize[0x90]
class EdGraphNode_Documentation: public EdGraphNode
{
public:
	struct FString                                               Link;                                              // 0x90(0x10)
	struct FString                                               Excerpt;                                           // 0xa0(0x10)
};


// Size 0x8 (Full Size[0x48] - InheritedSize[0x40]
class AnimCompress_RemoveEverySecondKey: public AnimCompress
{
public:
	int                                                          MinKeys;                                           // 0x40(0x4)
	bool                                                         bStartAtSecondKey;                                 // 0x44(0x1)
	char                                                         pad0x3_OQ6QI[0x3];                                 // 0x45(0x3)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LoadingPerfBPFuncLib: public BlueprintFunctionLibrary
{
public:
};


// Size 0x60 (Full Size[0x400] - InheritedSize[0x3a0]
class Controller: public Actor
{
public:
	char                                                         pad0x8_GEB0N[0x8];                                 // 0x3a0(0x8)
	class Pawn*                                                  Pawn;                                              // 0x3a8(0x8)
	char                                                         pad0x8_4YO7D[0x8];                                 // 0x3b0(0x8)
	class Character*                                             Character;                                         // 0x3b8(0x8)
	class PlayerState*                                           PlayerState;                                       // 0x3c0(0x8)
	class SceneComponent*                                        TransformComponent;                                // 0x3c8(0x8)
	struct Rotator                                               ControlRotation;                                   // 0x3d0(0xc)
	bool                                                         bAttachToPawn;                                     // 0x3dc(0x1)
	char                                                         pad0xb_9A4A2[0xb];                                 // 0x3dd(0xb)
	struct FName                                                 StateName;                                         // 0x3e8(0x8)
	char                                                         pad0x10_4USS3[0x10];                               // 0x3f0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class InterpTrackInstAudioMaster: public InterpTrackInst
{
public:
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class SoundNodeAssetReferencer: public SoundNode
{
public:
};


// Size 0x40 (Full Size[0xb0] - InheritedSize[0x70]
class MaterialExpressionTransform: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
	char                                                         TransformSourceType;                               // 0xa8(0x1)
	char                                                         TransformType;                                     // 0xa9(0x1)
	char                                                         pad0x6_3T2F3[0x6];                                 // 0xaa(0x6)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ContentStreamingBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x80 (Full Size[0xf0] - InheritedSize[0x70]
class MaterialExpressionRotator: public MaterialExpression
{
public:
	struct ExpressionInput                                       Coordinate;                                        // 0x70(0x38)
	struct ExpressionInput                                       Time;                                              // 0xa8(0x38)
	float                                                        CenterX;                                           // 0xe0(0x4)
	float                                                        CenterY;                                           // 0xe4(0x4)
	float                                                        Speed;                                             // 0xe8(0x4)
	char                                                         pad0x4_MAD20[0x4];                                 // 0xec(0x4)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionHash: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionSquareRoot: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
};


// Size 0x50 (Full Size[0x108] - InheritedSize[0xb8]
class ApplicationLifecycleComponent: public ActorComponent
{
public:
	char                                                         pad0x50_PVAOK[0x50];                               // 0xb8(0x50)
};


// Size 0x8 (Full Size[0xc0] - InheritedSize[0xb8]
class ComponentWithDerivedTestInterface: public ActorComponent
{
public:
	char                                                         pad0x8_WCLQE[0x8];                                 // 0xb8(0x8)
};


// Size 0x20 (Full Size[0x58] - InheritedSize[0x38]
class GarbageCollectionSettings: public DeveloperSettings
{
public:
	float                                                        TimeBetweenPurgingPendingKillObjects;              // 0x38(0x4)
	bool                                                         FlushStreamingOnGC;                                // 0x3c(0x1)
	bool                                                         AllowParallelGC;                                   // 0x3c(0x1)
	bool                                                         CreateGCClusters;                                  // 0x3c(0x1)
	bool                                                         MergeGCClusters;                                   // 0x3c(0x1)
	char                                                         pad0x3_YKG01[0x3];                                 // 0x3d(0x3)
	int                                                          NumRetriesBeforeForcingGC;                         // 0x40(0x4)
	int                                                          MaxObjectsNotConsideredByGC;                       // 0x44(0x4)
	int                                                          SizeOfPermanentObjectPool;                         // 0x48(0x4)
	int                                                          MaxObjectsInGame;                                  // 0x4c(0x4)
	int                                                          MaxObjectsInEditor;                                // 0x50(0x4)
	char                                                         pad0x4_6WVCM[0x4];                                 // 0x54(0x4)
};


// Size 0x20 (Full Size[0xd8] - InheritedSize[0xb8]
class NestedWorldComposition: public WorldComposition
{
public:
	char                                                         pad0x20_QCXN1[0x20];                               // 0xb8(0x20)
};


// Size 0x70 (Full Size[0xe0] - InheritedSize[0x70]
class MaterialExpressionFmod: public MaterialExpression
{
public:
	struct ExpressionInput                                       A;                                                 // 0x70(0x38)
	struct ExpressionInput                                       B;                                                 // 0xa8(0x38)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ComponentDelegateBinding: public DynamicBlueprintBinding
{
public:
	TArray<struct BlueprintComponentDelegateBinding>             ComponentDelegateBindings;                         // 0x28(0x10)
};


// Size 0x1890 (Full Size[0x1c30] - InheritedSize[0x3a0]
class PlayerCameraManager: public Actor
{
public:
	class PlayerController*                                      PCOwner;                                           // 0x3a0(0x8)
	class SceneComponent*                                        TransformComponent;                                // 0x3a8(0x8)
	char                                                         pad0x8_5X9AH[0x8];                                 // 0x3b0(0x8)
	float                                                        DefaultFOV;                                        // 0x3b8(0x4)
	char                                                         pad0x4_QOKFC[0x4];                                 // 0x3bc(0x4)
	float                                                        DefaultOrthoWidth;                                 // 0x3c0(0x4)
	char                                                         pad0x4_FESK6[0x4];                                 // 0x3c4(0x4)
	float                                                        DefaultAspectRatio;                                // 0x3c8(0x4)
	char                                                         pad0x44_Z3WHI[0x44];                               // 0x3cc(0x44)
	struct CameraCacheEntry                                      CameraCache;                                       // 0x410(0x5b0)
	struct CameraCacheEntry                                      LastFrameCameraCache;                              // 0x9c0(0x5b0)
	struct TViewTarget                                           ViewTarget;                                        // 0xf70(0x5c0)
	struct TViewTarget                                           PendingViewTarget;                                 // 0x1530(0x5c0)
	char                                                         pad0x30_Q53SK[0x30];                               // 0x1af0(0x30)
	TArray<class CameraModifier*>                                ModifierList;                                      // 0x1b20(0x10)
	TArray<class Class*>                                         DefaultModifiers;                                  // 0x1b30(0x10)
	float                                                        FreeCamDistance;                                   // 0x1b40(0x4)
	struct Vector                                                FreeCamOffset;                                     // 0x1b44(0xc)
	struct Vector                                                ViewTargetOffset;                                  // 0x1b50(0xc)
	char                                                         pad0x14_01MH2[0x14];                               // 0x1b5c(0x14)
	TArray<class EmitterCameraLensEffectBase*>                   CameraLensEffects;                                 // 0x1b70(0x10)
	class CameraModifier_CameraShake*                            CachedCameraShakeMod;                              // 0x1b80(0x8)
	class CameraAnimInst*                                        AnimInstPool;                                      // 0x1b88(0x8)
	char                                                         pad0x38_AJX2E[0x38];                               // 0x1b90(0x38)
	TArray<struct PostProcessSettings>                           PostProcessBlendCache;                             // 0x1bc8(0x10)
	char                                                         pad0x10_CSG2F[0x10];                               // 0x1bd8(0x10)
	TArray<class CameraAnimInst*>                                ActiveAnims;                                       // 0x1be8(0x10)
	TArray<class CameraAnimInst*>                                FreeAnims;                                         // 0x1bf8(0x10)
	class CameraActor*                                           AnimCameraActor;                                   // 0x1c08(0x8)
	bool                                                         bIsOrthographic;                                   // 0x1c10(0x1)
	bool                                                         bUseClientSideCameraUpdates;                       // 0x1c10(0x1)
	bool                                                         bFollowHmdOrientation;                             // 0x1c11(0x1)
	char                                                         pad0x2_I2E8Y[0x2];                                 // 0x1c12(0x2)
	float                                                        ViewPitchMin;                                      // 0x1c14(0x4)
	float                                                        ViewPitchMax;                                      // 0x1c18(0x4)
	float                                                        ViewYawMin;                                        // 0x1c1c(0x4)
	float                                                        ViewYawMax;                                        // 0x1c20(0x4)
	float                                                        ViewRollMin;                                       // 0x1c24(0x4)
	float                                                        ViewRollMax;                                       // 0x1c28(0x4)
	char                                                         pad0x4_CJ7KI[0x4];                                 // 0x1c2c(0x4)
};


// Size 0x40 (Full Size[0xb0] - InheritedSize[0x70]
class MaterialExpressionReflectionVectorWS: public MaterialExpression
{
public:
	struct ExpressionInput                                       CustomWorldNormal;                                 // 0x70(0x38)
	bool                                                         bNormalizeCustomWorldNormal;                       // 0xa8(0x1)
	char                                                         pad0x7_4PWL9[0x7];                                 // 0xa9(0x7)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionParticleMotionBlurFade: public MaterialExpression
{
public:
};


// Size 0x0 (Full Size[0x40] - InheritedSize[0x40]
class NavArea_Obstacle: public NavArea
{
public:
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class MergedCollisionActor: public Actor
{
public:
	class MergedCollisionComponent*                              MergedCollisionComponent;                          // 0x3a0(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GPUSortTestLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x10 (Full Size[0x80] - InheritedSize[0x70]
class MaterialExpressionTextureCoordinate: public MaterialExpression
{
public:
	int                                                          CoordinateIndex;                                   // 0x70(0x4)
	float                                                        UTiling;                                           // 0x74(0x4)
	float                                                        VTiling;                                           // 0x78(0x4)
	bool                                                         UnMirrorU;                                         // 0x7c(0x1)
	bool                                                         UnMirrorV;                                         // 0x7c(0x1)
	char                                                         pad0x3_504QH[0x3];                                 // 0x7d(0x3)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionVertexID: public MaterialExpression
{
public:
};


// Size 0x70 (Full Size[0xe0] - InheritedSize[0x70]
class MaterialExpressionDistance: public MaterialExpression
{
public:
	struct ExpressionInput                                       A;                                                 // 0x70(0x38)
	struct ExpressionInput                                       B;                                                 // 0xa8(0x38)
};


// Size 0x70 (Full Size[0xe0] - InheritedSize[0x70]
class MaterialExpressionLightmassReplace: public MaterialExpression
{
public:
	struct ExpressionInput                                       Realtime;                                          // 0x70(0x38)
	struct ExpressionInput                                       Lightmass;                                         // 0xa8(0x38)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class InstancedActorDelegateBinding: public DynamicBlueprintBinding
{
public:
	TArray<struct BlueprintInstancedActorDelegateBinding>        ActorDelegateBindings;                             // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class KismetGuidLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x48 (Full Size[0x80] - InheritedSize[0x38]
class AudioSettings: public DeveloperSettings
{
public:
	struct StringAssetReference                                  DefaultSoundClassName;                             // 0x38(0x10)
	struct StringAssetReference                                  DefaultBaseSoundMix;                               // 0x48(0x10)
	struct StringAssetReference                                  VoiPSoundClass;                                    // 0x58(0x10)
	float                                                        LowPassFilterResonance;                            // 0x68(0x4)
	int                                                          MaximumConcurrentStreams;                          // 0x6c(0x4)
	TArray<struct AudioQualitySettings>                          QualityLevels;                                     // 0x70(0x10)
};


// Size 0x0 (Full Size[0x3a0] - InheritedSize[0x3a0]
class NavigationGraphNode: public Actor
{
public:
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class SoundNodeRandom: public SoundNode
{
public:
	TArray<float>                                                Weights;                                           // 0x38(0x10)
	int                                                          PreselectAtLevelLoad;                              // 0x48(0x4)
	bool                                                         bRandomizeWithoutReplacement;                      // 0x4c(0x1)
	char                                                         pad0x3_FQZ6F[0x3];                                 // 0x4d(0x3)
	TArray<bool>                                                 HasBeenUsed;                                       // 0x50(0x10)
	int                                                          NumRandomUsed;                                     // 0x60(0x4)
	char                                                         pad0x4_H223A[0x4];                                 // 0x64(0x4)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionObjectOrientation: public MaterialExpression
{
public:
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class LevelBounds: public Actor
{
public:
	bool                                                         bAutoUpdateBounds;                                 // 0x3a0(0x1)
	char                                                         pad0x7_DYA3D[0x7];                                 // 0x3a1(0x7)
};


// Size 0xb8 (Full Size[0x128] - InheritedSize[0x70]
class MaterialExpressionBumpOffset: public MaterialExpression
{
public:
	struct ExpressionInput                                       Coordinate;                                        // 0x70(0x38)
	struct ExpressionInput                                       Height;                                            // 0xa8(0x38)
	struct ExpressionInput                                       HeightRatioInput;                                  // 0xe0(0x38)
	float                                                        HeightRatio;                                       // 0x118(0x4)
	float                                                        ReferencePlane;                                    // 0x11c(0x4)
	char                                                         pad0x8_VQNZB[0x8];                                 // 0x120(0x8)
};


// Size 0x8 (Full Size[0x3a8] - InheritedSize[0x3a0]
class WaterEmissionVolume: public Actor
{
public:
	class WaterEmissionVolumeComponent*                          WaterEmissionVolumeComponent;                      // 0x3a0(0x8)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class InterpTrackInstFloatParticleParam: public InterpTrackInst
{
public:
	float                                                        ResetFloat;                                        // 0x28(0x4)
	char                                                         pad0x4_TLI90[0x4];                                 // 0x2c(0x4)
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class MaterialExpressionTranslucencyShadows: public MaterialExpression
{
public:
	int                                                          Quality;                                           // 0x70(0x4)
	char                                                         pad0x4_4VUZO[0x4];                                 // 0x74(0x4)
};


// Size 0xb8 (Full Size[0x128] - InheritedSize[0x70]
class MaterialExpressionClamp: public MaterialExpression
{
public:
	struct ExpressionInput                                       Input;                                             // 0x70(0x38)
	struct ExpressionInput                                       Min;                                               // 0xa8(0x38)
	struct ExpressionInput                                       Max;                                               // 0xe0(0x38)
	char                                                         ClampMode;                                         // 0x118(0x1)
	char                                                         pad0x3_RFXDY[0x3];                                 // 0x119(0x3)
	float                                                        MinDefault;                                        // 0x11c(0x4)
	float                                                        MaxDefault;                                        // 0x120(0x4)
	char                                                         pad0x4_UNQYG[0x4];                                 // 0x124(0x4)
};


// Size 0x8 (Full Size[0x58] - InheritedSize[0x50]
class ParticleModuleOrbitBase: public ParticleModule
{
public:
	bool                                                         bUseEmitterTime;                                   // 0x50(0x1)
	char                                                         pad0x7_RC1A0[0x7];                                 // 0x51(0x7)
};


// Size 0x0 (Full Size[0x40] - InheritedSize[0x40]
class AnimCompress_LeastDestructive: public AnimCompress
{
public:
};


// Size 0x38 (Full Size[0x3d8] - InheritedSize[0x3a0]
class LODActor: public Actor
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x3a0(0x8)
	TArray<class Actor*>                                         SubActors;                                         // 0x3a8(0x10)
	float                                                        LODDrawDistance;                                   // 0x3b8(0x4)
	int                                                          LodLevel;                                          // 0x3bc(0x4)
	TArray<class Object*>                                        SubObjects;                                        // 0x3c0(0x10)
	char                                                         pad0x8_FKDEB[0x8];                                 // 0x3d0(0x8)
};


// Size 0xd0 (Full Size[0x108] - InheritedSize[0x38]
class SoundNodeAttenuation: public SoundNode
{
public:
	class SoundAttenuation*                                      AttenuationSettings;                               // 0x38(0x8)
	struct AttenuationSettings                                   AttenuationOverrides;                              // 0x40(0xc0)
	bool                                                         bOverrideAttenuation;                              // 0x100(0x1)
	char                                                         pad0x7_ZB4RR[0x7];                                 // 0x101(0x7)
};


// Size 0x28 (Full Size[0x3c8] - InheritedSize[0x3a0]
class NavigationObjectBase: public Actor
{
public:
	char                                                         pad0x8_EC0RZ[0x8];                                 // 0x3a0(0x8)
	class CapsuleComponent*                                      CapsuleComponent;                                  // 0x3a8(0x8)
	class BillboardComponent*                                    GoodSprite;                                        // 0x3b0(0x8)
	class BillboardComponent*                                    BadSprite;                                         // 0x3b8(0x8)
	bool                                                         bIsPIEPlayerStart;                                 // 0x3c0(0x1)
	char                                                         pad0x7_75SHA[0x7];                                 // 0x3c1(0x7)
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleSubUVBase: public ParticleModule
{
public:
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionCameraPositionWS: public MaterialExpression
{
public:
};


// Size 0x10 (Full Size[0x3b0] - InheritedSize[0x3a0]
class MaterialInstanceActor: public Actor
{
public:
	TArray<class Actor*>                                         TargetActors;                                      // 0x3a0(0x10)
};


// Size 0x8 (Full Size[0x78] - InheritedSize[0x70]
class MaterialExpressionWorldPosition: public MaterialExpression
{
public:
	char                                                         WorldPositionShaderOffset;                         // 0x70(0x1)
	char                                                         pad0x7_M0AR5[0x7];                                 // 0x71(0x7)
};


// Size 0x10 (Full Size[0x80] - InheritedSize[0x70]
class InterpTrackParticleReplay: public InterpTrack
{
public:
	TArray<struct ParticleReplayTrackKey>                        TrackKeys;                                         // 0x70(0x10)
};


// Size 0xb8 (Full Size[0x108] - InheritedSize[0x50]
class BlendSpaceBase: public AnimationAsset
{
public:
	struct BlendParameter                                        BlendParameters;                                   // 0x50(0x20)
	char                                                         pad0x40_1MZDU[0x40];                               // 0x70(0x40)
	struct InterpolationParameter                                InterpolationParam;                                // 0xb0(0x8)
	char                                                         pad0x10_9TDWM[0x10];                               // 0xb8(0x10)
	float                                                        TargetWeightInterpolationSpeedPerSec;              // 0xc8(0x4)
	char                                                         NotifyTriggerMode;                                 // 0xcc(0x1)
	bool                                                         bRotationBlendInMeshSpace;                         // 0xcd(0x1)
	char                                                         pad0x2_ZI2SB[0x2];                                 // 0xce(0x2)
	int                                                          NumOfDimension;                                    // 0xd0(0x4)
	float                                                        AnimLength;                                        // 0xd4(0x4)
	TArray<struct PerBoneInterpolation>                          PerBoneBlend;                                      // 0xd8(0x10)
	TArray<struct BlendSample>                                   SampleData;                                        // 0xe8(0x10)
	TArray<struct EditorElement>                                 GridSamples;                                       // 0xf8(0x10)
};


// Size 0x18 (Full Size[0x88] - InheritedSize[0x70]
class InterpTrackEvent: public InterpTrack
{
public:
	TArray<struct EventTrackKey>                                 EventTrack;                                        // 0x70(0x10)
	bool                                                         bFireEventsWhenForwards;                           // 0x80(0x1)
	bool                                                         bFireEventsWhenBackwards;                          // 0x80(0x1)
	bool                                                         bFireEventsWhenJumpingForwards;                    // 0x80(0x1)
	bool                                                         bUseCustomEventName;                               // 0x80(0x1)
	char                                                         pad0x7_HCKK7[0x7];                                 // 0x81(0x7)
};


// Size 0x38 (Full Size[0xa8] - InheritedSize[0x70]
class MaterialExpressionDistanceFieldGradient: public MaterialExpression
{
public:
	struct ExpressionInput                                       Position;                                          // 0x70(0x38)
};


// Size 0xe0 (Full Size[0x520] - InheritedSize[0x440]
class AnimSingleNodeInstance: public AnimInstance
{
public:
	class AnimationAsset*                                        CurrentAsset;                                      // 0x440(0x8)
	class VertexAnimation*                                       CurrentVertexAnim;                                 // 0x448(0x8)
	struct Vector                                                BlendSpaceInput;                                   // 0x450(0xc)
	char                                                         pad0x4_NUE52[0x4];                                 // 0x45c(0x4)
	TArray<struct BlendSampleData>                               BlendSampleData;                                   // 0x460(0x10)
	struct BlendFilter                                           BlendFilter;                                       // 0x470(0x90)
	float                                                        CurrentTime;                                       // 0x500(0x4)
	float                                                        PlayRate;                                          // 0x504(0x4)
	bool                                                         bLooping;                                          // 0x518(0x1)
	bool                                                         bPlaying;                                          // 0x518(0x1)
	bool                                                         bReverse;                                          // 0x518(0x1)
	char                                                         pad0x7_ZPG69[0x7];                                 // 0x519(0x7)
};


// Size 0x18 (Full Size[0x60] - InheritedSize[0x48]
class CameraModifier_CameraShake: public CameraModifier
{
public:
	TArray<class CameraShake*>                                   ActiveShakes;                                      // 0x48(0x10)
	float                                                        SplitScreenShakeScale;                             // 0x58(0x4)
	char                                                         pad0x4_KQNEH[0x4];                                 // 0x5c(0x4)
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleTypeDataBase: public ParticleModule
{
public:
};


// Size 0x0 (Full Size[0x3a0] - InheritedSize[0x3a0]
class RigidBodyBase: public Actor
{
public:
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleColorBase: public ParticleModule
{
public:
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleCollisionBase: public ParticleModule
{
public:
};


// Size 0x120 (Full Size[0x158] - InheritedSize[0x38]
class UserInterfaceSettings: public DeveloperSettings
{
public:
	char                                                         RenderFocusRule;                                   // 0x38(0x1)
	char                                                         pad0x7_YSIZ8[0x7];                                 // 0x39(0x7)
	struct StringClassReference                                  DefaultCursor;                                     // 0x40(0x10)
	struct StringClassReference                                  TextEditBeamCursor;                                // 0x50(0x10)
	struct StringClassReference                                  CrosshairsCursor;                                  // 0x60(0x10)
	struct StringClassReference                                  GrabHandCursor;                                    // 0x70(0x10)
	struct StringClassReference                                  GrabHandClosedCursor;                              // 0x80(0x10)
	struct StringClassReference                                  SlashedCircleCursor;                               // 0x90(0x10)
	float                                                        ApplicationScale;                                  // 0xa0(0x4)
	char                                                         UIScaleRule;                                       // 0xa4(0x1)
	char                                                         pad0x3_TR5DB[0x3];                                 // 0xa5(0x3)
	struct StringClassReference                                  CustomScalingRuleClass;                            // 0xa8(0x10)
	struct RuntimeFloatCurve                                     UIScaleCurve;                                      // 0xb8(0x80)
	TArray<class Object*>                                        CursorClasses;                                     // 0x138(0x10)
	class UClass*                                                CustomScalingRuleClassInstance;                    // 0x148(0x8)
	class DPICustomScalingRule*                                  CustomScalingRule;                                 // 0x150(0x8)
};


// Size 0x78 (Full Size[0xa8] - InheritedSize[0x30]
class ReporterGraph: public ReporterBase
{
public:
	char                                                         pad0x78_0WOSF[0x78];                               // 0x30(0x78)
};


// Size 0x228 (Full Size[0x290] - InheritedSize[0x68]
class ActorChannel: public Channel
{
public:
	class Actor*                                                 Actor;                                             // 0x68(0x8)
	char                                                         pad0x100_4WPN7[0x100];                             // 0x70(0x100)
	TArray<class Object*>                                        ObjectsRequiredForQueuedBunches;                   // 0x170(0x10)
	char                                                         pad0x110_AHNIV[0x110];                             // 0x180(0x110)
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class ParticleModuleVectorFieldBase: public ParticleModule
{
public:
};


// Size 0x0 (Full Size[0x68] - InheritedSize[0x68]
class RareNetworkProfilerExporter: public Exporter
{
public:
};


// Size 0x9c8 (Full Size[0xa20] - InheritedSize[0x58]
class Material: public MaterialInterface
{
public:
	class PhysicalMaterial*                                      PhysMaterial;                                      // 0x58(0x8)
	struct ColorMaterialInput                                    DiffuseColor;                                      // 0x60(0x40)
	struct ColorMaterialInput                                    SpecularColor;                                     // 0xa0(0x40)
	struct ColorMaterialInput                                    BaseColor;                                         // 0xe0(0x40)
	struct ScalarMaterialInput                                   Metallic;                                          // 0x120(0x40)
	struct ScalarMaterialInput                                   Specular;                                          // 0x160(0x40)
	struct ScalarMaterialInput                                   Roughness;                                         // 0x1a0(0x40)
	struct VectorMaterialInput                                   Normal;                                            // 0x1e0(0x48)
	struct ColorMaterialInput                                    EmissiveColor;                                     // 0x228(0x40)
	struct ScalarMaterialInput                                   Opacity;                                           // 0x268(0x40)
	struct ScalarMaterialInput                                   OpacityMask;                                       // 0x2a8(0x40)
	char                                                         MaterialDomain;                                    // 0x2e8(0x1)
	char                                                         BlendMode;                                         // 0x2e9(0x1)
	char                                                         DecalBlendMode;                                    // 0x2ea(0x1)
	bool                                                         bDecalNoEmissiveOrRoughness;                       // 0x2eb(0x1)
	bool                                                         bDecalEnableStencil;                               // 0x2ec(0x1)
	char                                                         MaterialDecalResponse;                             // 0x2ed(0x1)
	char                                                         ShadingModel;                                      // 0x2ee(0x1)
	char                                                         pad0x1_PKYNR[0x1];                                 // 0x2ef(0x1)
	float                                                        OpacityMaskClipValue;                              // 0x2f0(0x4)
	float                                                        DepthWeightScale;                                  // 0x2f4(0x4)
