// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class ActorComponent: public Object
{
public:
	char                                                         pad0x8_A56G0[0x8];                                 // 0x28(0x8)
	Struct ActorComponentTickFunction                            PrimaryComponentTick;                              // 0x30(0x50)
	TArray<struct FName>                                         ComponentTags;                                     // 0x80(0x10)
	TArray<struct UCSModifiedProperties>                         UCSModifiedProperties;                             // 0x90(0x10)
	char                                                         pad0x10_8491A[0x10];                               // 0xa0(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0xb0(0x10)
	bool                                                         bReplicates;                                       // 0xc0(0x1)
	bool                                                         bNetAddressable;                                   // 0xc0(0x1)
	bool                                                         bCreatedByConstructionScript;                      // 0xc1(0x1)
	bool                                                         bInstanceComponent;                                // 0xc1(0x1)
	bool                                                         bAutoActivate;                                     // 0xc2(0x1)
	bool                                                         bIsActive;                                         // 0xc2(0x1)
	bool                                                         bEditableWhenInherited;                            // 0xc2(0x1)
	bool                                                         bNeedsLoadForClient;                               // 0xc3(0x1)
	bool                                                         bNeedsLoadForServer;                               // 0xc3(0x1)
	byte                                                         TargetNetDormancy;                                 // 0xc4(0x1)
	byte                                                         CreationMethod;                                    // 0xc5(0x1)
	char                                                         pad0x2_JM21L[0x2];                                 // 0xc6(0x2)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DataAsset: public Object
{
public:
};


// Size 0x3a0 (Full Size[0x3c8] - InheritedSize[0x28]
class Actor: public Object
{
public:
	Struct ActorTickFunction                                     PrimaryActorTick;                                  // 0x28(0x50)
	float                                                        CustomTimeDilation;                                // 0x78(0x4)
	bool                                                         bAllowRemovalFromServerWhenCollisionMerged;        // 0x7c(0x1)
	bool                                                         bAllowRemovalFromServerWhenAutomaticallyInstanced; // 0x7c(0x1)
	bool                                                         bHidden;                                           // 0x7c(0x1)
	bool                                                         bNetTemporary;                                     // 0x7c(0x1)
	bool                                                         bNetStartup;                                       // 0x7c(0x1)
	bool                                                         bOnlyRelevantToOwner;                              // 0x7c(0x1)
	bool                                                         bAlwaysRelevant;                                   // 0x7c(0x1)
	bool                                                         bReplicateMovement;                                // 0x7c(0x1)
	bool                                                         bTearOff;                                          // 0x7d(0x1)
	bool                                                         bExchangedRoles;                                   // 0x7d(0x1)
	bool                                                         bPendingNetUpdate;                                 // 0x7d(0x1)
	bool                                                         bNetLoadOnClient;                                  // 0x7d(0x1)
	bool                                                         bNetUseOwnerRelevancy;                             // 0x7d(0x1)
	bool                                                         bBlockInput;                                       // 0x7d(0x1)
	bool                                                         bCanBeInCluster;                                   // 0x7d(0x1)
	bool                                                         bActorEnableCollision;                             // 0x7e(0x1)
	bool                                                         bReplicateAttachment;                              // 0x7e(0x1)
	bool                                                         bReplicates;                                       // 0x7e(0x1)
	char                                                         pad0x1_524N6[0x1];                                 // 0x7f(0x1)
	byte                                                         RemoteRole;                                        // 0x83(0x1)
	char                                                         pad0x4_ZDEIH[0x4];                                 // 0x84(0x4)
	Class Actor*                                                 Owner;                                             // 0x88(0x8)
	Struct RepMovement                                           ReplicatedMovement;                                // 0x90(0x38)
	Struct RepAttachment                                         AttachmentReplication;                             // 0xc8(0x48)
	byte                                                         Role;                                              // 0x110(0x1)
	char                                                         pad0x1_ASKX5[0x1];                                 // 0x111(0x1)
	byte                                                         SpawnRestrictions;                                 // 0x112(0x1)
	byte                                                         AutoReceiveInput;                                  // 0x113(0x1)
	int                                                          InputPriority;                                     // 0x114(0x4)
	Class InputComponent*                                        InputComponent;                                    // 0x118(0x8)
	float                                                        NetCullDistanceSquared;                            // 0x120(0x4)
	char                                                         pad0x4_NNGAH[0x4];                                 // 0x124(0x4)
	int                                                          NetTag;                                            // 0x128(0x4)
	float                                                        NetUpdateTime;                                     // 0x12c(0x4)
	float                                                        NetUpdateFrequency;                                // 0x130(0x4)
	float                                                        NetPriority;                                       // 0x134(0x4)
	float                                                        LastNetUpdateTime;                                 // 0x138(0x4)
	struct FName                                                 NetDriverName;                                     // 0x13c(0x8)
	bool                                                         bAutoDestroyWhenFinished;                          // 0x144(0x1)
	bool                                                         bCanBeDamaged;                                     // 0x144(0x1)
	bool                                                         bActorIsBeingDestroyed;                            // 0x144(0x1)
	bool                                                         bCollideWhenPlacing;                               // 0x144(0x1)
	bool                                                         bFindCameraComponentWhenViewTarget;                // 0x144(0x1)
	bool                                                         bRelevantForNetworkReplays;                        // 0x144(0x1)
	char                                                         pad0x3_3GSXT[0x3];                                 // 0x145(0x3)
	byte                                                         SpawnCollisionHandlingMethod;                      // 0x148(0x1)
	char                                                         pad0x7_C9ZHH[0x7];                                 // 0x149(0x7)
	Class Pawn*                                                  Instigator;                                        // 0x150(0x8)
	TArray<class Actor*>                                         Children;                                          // 0x158(0x10)
	Class SceneComponent*                                        RootComponent;                                     // 0x168(0x8)
	TArray<class MatineeActor*>                                  ControllingMatineeActors;                          // 0x170(0x10)
	float                                                        InitialLifeSpan;                                   // 0x180(0x4)
	char                                                         pad0x4_DB9FG[0x4];                                 // 0x184(0x4)
	bool                                                         bAllowReceiveTickEventOnDedicatedServer;           // 0x188(0x1)
	char                                                         pad0x7_DSL3M[0x7];                                 // 0x189(0x7)
	TArray<struct FName>                                         Layers;                                            // 0x190(0x10)
	Struct ActorPtr                                              ParentComponentActor;                              // 0x1a0(0x8)
	TArray<Weakclass ChildComponentActors>                       ChildComponentActors;                              // 0x1a8(0x10)
	char                                                         pad0x8_7W7QV[0x8];                                 // 0x1b8(0x8)
	bool                                                         bActorSeamlessTraveled;                            // 0x1c0(0x1)
	bool                                                         bIgnoresOriginShifting;                            // 0x1c0(0x1)
	bool                                                         bEnableAutoLODGeneration;                          // 0x1c0(0x1)
	bool                                                         InvertFeatureCheck;                                // 0x1c0(0x1)
	char                                                         pad0x3_1D6NC[0x3];                                 // 0x1c1(0x3)
	struct FName                                                 Feature;                                           // 0x1c4(0x8)
	char                                                         pad0x4_7TTHC[0x4];                                 // 0x1cc(0x4)
	TArray<struct FName>                                         Tags;                                              // 0x1d0(0x10)
	bool                                                         bDoOverlapNotifiesOnLoad;                          // 0x229(0x1)
	char                                                         pad0xf6_H6X7Q[0xf6];                               // 0x22a(0xf6)
	TArray<class ActorComponent*>                                BlueprintCreatedComponents;                        // 0x320(0x10)
	TArray<class ActorComponent*>                                InstanceComponents;                                // 0x330(0x10)
	char                                                         pad0x8_H9V7X[0x8];                                 // 0x340(0x8)
	TArray<class Actor*>                                         ChildActorInterfaceProviders;                      // 0x348(0x10)
	char                                                         pad0x68_Y19I7[0x68];                               // 0x358(0x68)
	double                                                       DormancyLingeringInSeconds;                        // 0x3c0(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlueprintFunctionLibrary: public Object
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class DeveloperSettings: public Object
{
public:
};


// Size 0x218 (Full Size[0x2e0] - InheritedSize[0xc8]
class SceneComponent: public ActorComponent
{
public:
	TArray<class SceneComponent*>                                AttachChildren;                                    // 0xc8(0x10)
	bool                                                         bRequiresCustomLocation;                           // 0xd8(0x1)
	char                                                         pad0x7_H2EGM[0x7];                                 // 0xd9(0x7)
	Class SceneComponent*                                        AttachParent;                                      // 0xe0(0x8)
	struct FName                                                 AttachSocketName;                                  // 0xe8(0x8)
	bool                                                         bAbsoluteLocation;                                 // 0xf0(0x1)
	bool                                                         bAbsoluteRotation;                                 // 0xf0(0x1)
	bool                                                         bAbsoluteScale;                                    // 0xf0(0x1)
	bool                                                         bVisible;                                          // 0xf0(0x1)
	bool                                                         bAbsoluteTranslation;                              // 0xf0(0x1)
	bool                                                         bHiddenInGame;                                     // 0xf0(0x1)
	bool                                                         bShouldUpdatePhysicsVolume;                        // 0xf0(0x1)
	bool                                                         bBoundsChangeTriggersStreamingDataRebuild;         // 0xf0(0x1)
	bool                                                         bUseAttachParentBound;                             // 0xf1(0x1)
	bool                                                         bComponentIsUnionOfChildren;                       // 0xf1(0x1)
	bool                                                         bJitterReduction;                                  // 0xf1(0x1)
	bool                                                         CacheRootVelocity;                                 // 0xf1(0x1)
	bool                                                         bWorldToComponentUpdated;                          // 0xf1(0x1)
	char                                                         pad0xe_WNI41[0xe];                                 // 0xf2(0xe)
	Struct Vector                                                RelativeLocation;                                  // 0x108(0xc)
	Struct Rotator                                               RelativeRotation;                                  // 0x114(0xc)
	Struct Vector                                                RelativeScale3D;                                   // 0x120(0xc)
	char                                                         pad0x104_U5715[0x104];                             // 0x12c(0x104)
	byte                                                         Mobility;                                          // 0x230(0x1)
	byte                                                         DetailMode;                                        // 0x231(0x1)
	char                                                         pad0xa_BECGG[0xa];                                 // 0x232(0xa)
	Struct Vector                                                ComponentVelocity;                                 // 0x23c(0xc)
	TArray<struct FName>                                         SocketVelocitiesToCache;                           // 0x268(0x10)
	TArray<class Actor*>                                         MovedActors;                                       // 0x278(0x10)
	char                                                         pad0x58_H76L0[0x58];                               // 0x288(0x58)
};


// Size 0x78 (Full Size[0x440] - InheritedSize[0x3c8]
class Pawn: public Actor
{
public:
	char                                                         pad0x8_37F1M[0x8];                                 // 0x3c8(0x8)
	bool                                                         bUseControllerRotationPitch;                       // 0x3d0(0x1)
	bool                                                         bUseControllerRotationYaw;                         // 0x3d0(0x1)
	bool                                                         bUseControllerRotationRoll;                        // 0x3d0(0x1)
	bool                                                         bCanAffectNavigationGeneration;                    // 0x3d0(0x1)
	char                                                         pad0x3_WZV3L[0x3];                                 // 0x3d1(0x3)
	float                                                        BaseEyeHeight;                                     // 0x3d4(0x4)
	byte                                                         AutoPossessPlayer;                                 // 0x3d8(0x1)
	byte                                                         AutoPossessAI;                                     // 0x3d9(0x1)
	char                                                         pad0x6_YHG8D[0x6];                                 // 0x3da(0x6)
	class                                                        AIControllerClass;                                 // 0x3e0(0x8)
	Class PlayerState*                                           PlayerState;                                       // 0x3e8(0x8)
	byte                                                         RemoteViewPitch;                                   // 0x3f0(0x1)
	char                                                         pad0x7_2PEJK[0x7];                                 // 0x3f1(0x7)
	Class Controller*                                            LastHitBy;                                         // 0x3f8(0x8)
	Class Controller*                                            Controller;                                        // 0x400(0x8)
	char                                                         pad0x18_IJZL3[0x18];                               // 0x408(0x18)
	Struct Vector                                                ControlInputVector;                                // 0x420(0xc)
	Struct Vector                                                LastControlInputVector;                            // 0x42c(0xc)
	char                                                         pad0x8_NS0XH[0x8];                                 // 0x438(0x8)
};


// Size 0x1a0 (Full Size[0x5e0] - InheritedSize[0x440]
class Character: public Pawn
{
public:
	Class SkeletalMeshComponent*                                 Mesh;                                              // 0x440(0x8)
	Class CharacterMovementComponent*                            CharacterMovement;                                 // 0x448(0x8)
	Class CapsuleComponent*                                      CapsuleComponent;                                  // 0x450(0x8)
	Struct BasedMovementInfo                                     BasedMovement;                                     // 0x458(0x38)
	Struct BasedMovementInfo                                     ReplicatedBasedMovement;                           // 0x490(0x38)
	Struct Vector                                                BaseTranslationOffset;                             // 0x4c8(0xc)
	char                                                         pad0xc_3TR3Q[0xc];                                 // 0x4d4(0xc)
	Struct Quat                                                  BaseRotationOffset;                                // 0x4e0(0x10)
	byte                                                         ReplicatedMovementMode;                            // 0x4f0(0x1)
	bool                                                         bInBaseReplication;                                // 0x4f1(0x1)
	char                                                         pad0x2_04S4V[0x2];                                 // 0x4f2(0x2)
	float                                                        CrouchedEyeHeight;                                 // 0x4f4(0x4)
	bool                                                         bIsCrouched;                                       // 0x4f8(0x1)
	bool                                                         bPressedJump;                                      // 0x4f8(0x1)
	bool                                                         bClientUpdating;                                   // 0x4f8(0x1)
	bool                                                         bClientWasFalling;                                 // 0x4f8(0x1)
	bool                                                         bClientResimulateRootMotion;                       // 0x4f8(0x1)
	bool                                                         bSimGravityDisabled;                               // 0x4f8(0x1)
	bool                                                         bServerMoveIgnoreRootMotion;                       // 0x4f8(0x1)
	char                                                         pad0x3_0AWDQ[0x3];                                 // 0x4f9(0x3)
	float                                                        JumpKeyHoldTime;                                   // 0x4fc(0x4)
	float                                                        JumpMaxHoldTime;                                   // 0x500(0x4)
	char                                                         pad0x4_YC1FK[0x4];                                 // 0x504(0x4)
	Struct RootMotionMovementParams                              ClientRootMotionParams;                            // 0x540(0x40)
	TArray<struct RootMotionRepMoves>                            RootMotionRepMoves;                                // 0x580(0x10)
	Struct RepRootMotionMontage                                  RepRootMotion;                                     // 0x590(0x40)
	char                                                         pad0x10_0UUV2[0x10];                               // 0x5d0(0x10)
};


// Size 0x88 (Full Size[0x150] - InheritedSize[0xc8]
class InputComponent: public ActorComponent
{
public:
};


// Size 0x418 (Full Size[0x440] - InheritedSize[0x28]
class AnimInstance: public Object
{
public:
	Class Skeleton*                                              CurrentSkeleton;                                   // 0x28(0x8)
	TArray<struct UngroupedActivePlayers>                        UngroupedActivePlayers;                            // 0x30(0x10)
	TArray<struct SyncGroups>                                    SyncGroups;                                        // 0x40(0x10)
	TArray<struct VertexAnims>                                   VertexAnims;                                       // 0x50(0x10)
	byte                                                         RootMotionMode;                                    // 0x60(0x1)
	bool                                                         bWarnAboutBlueprintUsage;                          // 0x61(0x1)
	char                                                         pad0x6_4TB46[0x6];                                 // 0x62(0x6)
	bool                                                         bQueueMontageEvents;                               // 0x148(0x1)
	char                                                         pad0xf7_9MHZK[0xf7];                               // 0x149(0xf7)
	TArray<struct ActiveAnimNotifyState>                         ActiveAnimNotifyState;                             // 0x240(0x10)
	char                                                         pad0x100_QRBMA[0x100];                             // 0x250(0x100)
	bool                                                         bBoneCachesInvalidated;                            // 0x3a8(0x1)
	char                                                         pad0x8f_O2Y8K[0x8f];                               // 0x3a9(0x8f)
	bool                                                         bBlueprintAnimUpdateEnabled;                       // 0x438(0x1)
	char                                                         pad0x7_2OPJN[0x7];                                 // 0x439(0x7)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AnimNotify: public Object
{
public:
	bool                                                         PlayedWithSequencer;                               // 0x28(0x1)
	char                                                         pad0xf_GA1Y0[0xf];                                 // 0x29(0xf)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AnimNotifyState: public Object
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class AnimNotifyState_TimedParticleEffect: public AnimNotifyState
{
public:
	Class ParticleSystem*                                        PSTemplate;                                        // 0x28(0x8)
	struct FName                                                 SocketName;                                        // 0x30(0x8)
	Struct Vector                                                LocationOffset;                                    // 0x38(0xc)
	Struct Rotator                                               RotationOffset;                                    // 0x44(0xc)
	bool                                                         bOwnerOnlySee;                                     // 0x50(0x1)
	bool                                                         bOwnerNoSee;                                       // 0x51(0x1)
	bool                                                         bDestroyAtEnd;                                     // 0x52(0x1)
	bool                                                         bWorldOwnedEffect;                                 // 0x53(0x1)
	char                                                         pad0x4_BYTK3[0x4];                                 // 0x54(0x4)
};


// Size 0x570 (Full Size[0x850] - InheritedSize[0x2e0]
class CameraComponent: public SceneComponent
{
public:
	float                                                        FieldOfView;                                       // 0x2e0(0x4)
	float                                                        OrthoWidth;                                        // 0x2e4(0x4)
	float                                                        OrthoNearClipPlane;                                // 0x2e8(0x4)
	float                                                        OrthoFarClipPlane;                                 // 0x2ec(0x4)
	float                                                        AspectRatio;                                       // 0x2f0(0x4)
	bool                                                         bConstrainAspectRatio;                             // 0x2f4(0x1)
	bool                                                         bUseFieldOfViewForLOD;                             // 0x2f4(0x1)
	bool                                                         bUsePawnControlRotation;                           // 0x2f4(0x1)
	char                                                         pad0x3_Q0TVZ[0x3];                                 // 0x2f5(0x3)
	byte                                                         ProjectionMode;                                    // 0x2f8(0x1)
	char                                                         pad0x3_D7IK5[0x3];                                 // 0x2f9(0x3)
	float                                                        PostProcessBlendWeight;                            // 0x2fc(0x4)
	Struct PostProcessSettings                                   PostProcessSettings;                               // 0x300(0x540)
	bool                                                         bUseControllerViewRotation;                        // 0x840(0x1)
	char                                                         pad0xf_TSYBI[0xf];                                 // 0x841(0xf)
};


// Size 0x48 (Full Size[0x110] - InheritedSize[0xc8]
class MovementComponent: public ActorComponent
{
public:
	Class SceneComponent*                                        UpdatedComponent;                                  // 0xc8(0x8)
	Class PrimitiveComponent*                                    UpdatedPrimitive;                                  // 0xd0(0x8)
	char                                                         pad0x4_VMNJP[0x4];                                 // 0xd8(0x4)
	Struct Vector                                                Velocity;                                          // 0xdc(0xc)
	bool                                                         bConstrainToPlane;                                 // 0xe8(0x1)
	bool                                                         bSnapToPlaneAtStart;                               // 0xe8(0x1)
	char                                                         pad0x3_Y6FGQ[0x3];                                 // 0xe9(0x3)
	byte                                                         PlaneConstraintAxisSetting;                        // 0xec(0x1)
	char                                                         pad0x3_RA9CY[0x3];                                 // 0xed(0x3)
	Struct Vector                                                PlaneConstraintNormal;                             // 0xf0(0xc)
	Struct Vector                                                PlaneConstraintOrigin;                             // 0xfc(0xc)
	bool                                                         bUpdateOnlyIfRendered;                             // 0x108(0x1)
	bool                                                         bAutoUpdateTickRegistration;                       // 0x108(0x1)
	bool                                                         bAutoRegisterUpdatedComponent;                     // 0x108(0x1)
	char                                                         pad0x7_YLI03[0x7];                                 // 0x109(0x7)
};


// Size 0x48 (Full Size[0x158] - InheritedSize[0x110]
class NavMovementComponent: public MovementComponent
{
public:
	Struct NavAgentProperties                                    NavAgentProps;                                     // 0x110(0x30)
	bool                                                         bUpdateNavAgentWithOwnersCollision;                // 0x140(0x1)
	char                                                         pad0x3_1KQVA[0x3];                                 // 0x141(0x3)
	Struct MovementProperties                                    MovementState;                                     // 0x144(0x4)
	char                                                         pad0x8_KI9IN[0x8];                                 // 0x148(0x8)
	bool                                                         UseDefaultNavWalkingSearchRadiusScale;             // 0x150(0x1)
	bool                                                         UseDefaultNavWalkingSearchHeightScale;             // 0x151(0x1)
	char                                                         pad0x6_1C4PC[0x6];                                 // 0x152(0x6)
};


// Size 0x8 (Full Size[0x160] - InheritedSize[0x158]
class PawnMovementComponent: public NavMovementComponent
{
public:
	Class Pawn*                                                  PawnOwner;                                         // 0x158(0x8)
};


// Size 0x430 (Full Size[0x590] - InheritedSize[0x160]
class CharacterMovementComponent: public PawnMovementComponent
{
public:
	char                                                         pad0x18_BSESK[0x18];                               // 0x160(0x18)
	Class Character*                                             CharacterOwner;                                    // 0x178(0x8)
	float                                                        GravityScale;                                      // 0x180(0x4)
	float                                                        MaxStepHeight;                                     // 0x184(0x4)
	float                                                        JumpZVelocity;                                     // 0x188(0x4)
	float                                                        JumpOffJumpZFactor;                                // 0x18c(0x4)
	float                                                        WalkableFloorAngle;                                // 0x190(0x4)
	float                                                        WalkableFloorZ;                                    // 0x194(0x4)
	byte                                                         MovementMode;                                      // 0x198(0x1)
	byte                                                         CustomMovementMode;                                // 0x199(0x1)
	char                                                         pad0x26_OGW75[0x26];                               // 0x19a(0x26)
	float                                                        GroundFriction;                                    // 0x1c0(0x4)
	float                                                        MaxWalkSpeed;                                      // 0x1c4(0x4)
	float                                                        MaxWalkSpeedBackwards;                             // 0x1c8(0x4)
	float                                                        WalkBackwardsMinAngle;                             // 0x1cc(0x4)
	float                                                        WalkBackwardsMaxAngle;                             // 0x1d0(0x4)
	float                                                        MaxWalkSpeedCrouched;                              // 0x1d4(0x4)
	float                                                        MaxSwimSpeed;                                      // 0x1d8(0x4)
	float                                                        MaxFlySpeed;                                       // 0x1dc(0x4)
	float                                                        MaxCustomMovementSpeed;                            // 0x1e0(0x4)
	float                                                        MaxAcceleration;                                   // 0x1e4(0x4)
	float                                                        MaxChargeAcceleration;                             // 0x1e8(0x4)
	float                                                        BrakingFrictionFactor;                             // 0x1ec(0x4)
	float                                                        BrakingFriction;                                   // 0x1f0(0x4)
	bool                                                         bUseSeparateBrakingFriction;                       // 0x1f4(0x1)
	char                                                         pad0x3_JWSYF[0x3];                                 // 0x1f5(0x3)
	float                                                        BrakingDecelerationWalking;                        // 0x1f8(0x4)
	float                                                        BrakingDecelerationFalling;                        // 0x1fc(0x4)
	float                                                        BrakingDecelerationSwimming;                       // 0x200(0x4)
	float                                                        BrakingDecelerationFlying;                         // 0x204(0x4)
	float                                                        AirControl;                                        // 0x208(0x4)
	float                                                        AirControlBoostMultiplier;                         // 0x20c(0x4)
	float                                                        AirControlBoostVelocityThreshold;                  // 0x210(0x4)
	float                                                        FallingLateralFriction;                            // 0x214(0x4)
	float                                                        CrouchedHalfHeight;                                // 0x218(0x4)
	float                                                        Buoyancy;                                          // 0x21c(0x4)
	float                                                        PerchRadiusThreshold;                              // 0x220(0x4)
	float                                                        PerchAdditionalHeight;                             // 0x224(0x4)
	Struct Rotator                                               RotationRate;                                      // 0x228(0xc)
	bool                                                         bUseControllerDesiredRotation;                     // 0x234(0x1)
	bool                                                         bOrientRotationToMovement;                         // 0x234(0x1)
	bool                                                         bMovementInProgress;                               // 0x234(0x1)
	bool                                                         bEnableScopedMovementUpdates;                      // 0x234(0x1)
	bool                                                         bForceMaxAccel;                                    // 0x234(0x1)
	bool                                                         bRunPhysicsWithNoController;                       // 0x234(0x1)
	bool                                                         bForceNextFloorCheck;                              // 0x234(0x1)
	bool                                                         bShrinkProxyCapsule;                               // 0x234(0x1)
	bool                                                         bCanWalkOffLedges;                                 // 0x235(0x1)
	bool                                                         bCanWalkOffLedgesWhenCrouching;                    // 0x235(0x1)
	bool                                                         bDeferUpdateMoveComponent;                         // 0x235(0x1)
	char                                                         pad0x2_B5JY7[0x2];                                 // 0x236(0x2)
	Class SceneComponent*                                        DeferredUpdatedMoveComponent;                      // 0x238(0x8)
	float                                                        MaxOutOfWaterStepHeight;                           // 0x240(0x4)
	float                                                        OutofWaterZ;                                       // 0x244(0x4)
	float                                                        Mass;                                              // 0x248(0x4)
	bool                                                         bEnablePhysicsInteraction;                         // 0x24c(0x1)
	bool                                                         bTouchForceScaledToMass;                           // 0x24d(0x1)
	bool                                                         bPushForceScaledToMass;                            // 0x24e(0x1)
	bool                                                         bScalePushForceToVelocity;                         // 0x24f(0x1)
	float                                                        StandingDownwardForceScale;                        // 0x250(0x4)
	float                                                        InitialPushForceFactor;                            // 0x254(0x4)
	float                                                        PushForceFactor;                                   // 0x258(0x4)
	float                                                        PushForcePointZOffsetFactor;                       // 0x25c(0x4)
	float                                                        TouchForceFactor;                                  // 0x260(0x4)
	float                                                        MinTouchForce;                                     // 0x264(0x4)
	float                                                        MaxTouchForce;                                     // 0x268(0x4)
	float                                                        RepulsionForce;                                    // 0x26c(0x4)
	float                                                        NetMoveDelta;                                      // 0x270(0x4)
	bool                                                         bForceBraking;                                     // 0x274(0x1)
	char                                                         pad0x3_BOH2K[0x3];                                 // 0x275(0x3)
	float                                                        CrouchedSpeedMultiplier;                           // 0x278(0x4)
	float                                                        UpperImpactNormalScale;                            // 0x27c(0x4)
	Struct Vector                                                Acceleration;                                      // 0x280(0xc)
	Struct Vector                                                LastUpdateLocation;                                // 0x28c(0xc)
	Struct Vector                                                PendingImpulseToApply;                             // 0x298(0xc)
	Struct Vector                                                PendingForceToApply;                               // 0x2a4(0xc)
	float                                                        AnalogInputModifier;                               // 0x2b0(0x4)
	char                                                         pad0x34_G4WM1[0x34];                               // 0x2b4(0x34)
	float                                                        MaxSimulationTimeStep;                             // 0x2e8(0x4)
	int                                                          MaxSimulationIterations;                           // 0x2ec(0x4)
	float                                                        MaxSmoothNetUpdateDist;                            // 0x2f0(0x4)
	float                                                        NoSmoothNetUpdateDist;                             // 0x2f4(0x4)
	float                                                        NetworkSimulatedSmoothLocationTime;                // 0x2f8(0x4)
	float                                                        NetworkSimulatedSmoothRotationTime;                // 0x2fc(0x4)
	float                                                        LedgeCheckThreshold;                               // 0x300(0x4)
	float                                                        JumpOutOfWaterPitch;                               // 0x304(0x4)
	Struct FindFloorResult                                       CurrentFloor;                                      // 0x308(0x8c)
	byte                                                         DefaultLandMovementMode;                           // 0x394(0x1)
	byte                                                         DefaultWaterMovementMode;                          // 0x395(0x1)
	byte                                                         GroundMovementMode;                                // 0x396(0x1)
	char                                                         pad0x1_21HNM[0x1];                                 // 0x397(0x1)
	bool                                                         bMaintainHorizontalGroundVelocity;                 // 0x398(0x1)
	bool                                                         bImpartBaseVelocityX;                              // 0x398(0x1)
	bool                                                         bImpartBaseVelocityY;                              // 0x398(0x1)
	bool                                                         bImpartBaseVelocityZ;                              // 0x398(0x1)
	bool                                                         bImpartBaseAngularVelocity;                        // 0x398(0x1)
	bool                                                         bJustTeleported;                                   // 0x398(0x1)
	bool                                                         bNetworkUpdateReceived;                            // 0x398(0x1)
	bool                                                         bBasedMovementUpdateReceived;                      // 0x398(0x1)
	bool                                                         bMovementUpdateReceived;                           // 0x399(0x1)
	bool                                                         bNetworkMovementModeChanged;                       // 0x399(0x1)
	bool                                                         bNotifyApex;                                       // 0x399(0x1)
	bool                                                         bCheatFlying;                                      // 0x399(0x1)
	bool                                                         bWantsToCrouch;                                    // 0x399(0x1)
	bool                                                         bCrouchMaintainsBaseLocation;                      // 0x399(0x1)
	bool                                                         bIgnoreBaseRotation;                               // 0x399(0x1)
	bool                                                         bFastAttachedMove;                                 // 0x399(0x1)
	bool                                                         bAlwaysCheckFloor;                                 // 0x39a(0x1)
	bool                                                         bUseFlatBaseForFloorChecks;                        // 0x39a(0x1)
	bool                                                         bPerformingJumpOff;                                // 0x39a(0x1)
	bool                                                         bWantsToLeaveNavWalking;                           // 0x39a(0x1)
	bool                                                         bUseRVOAvoidance;                                  // 0x39a(0x1)
	bool                                                         bRequestedMoveUseAcceleration;                     // 0x39a(0x1)
	bool                                                         bPreventSimulatedFloorChecks;                      // 0x39a(0x1)
	bool                                                         bPreventNavMeshFalling;                            // 0x39a(0x1)
	bool                                                         bHasRequestedVelocity;                             // 0x39b(0x1)
	bool                                                         bRequestedMoveWithMaxSpeed;                        // 0x39b(0x1)
	bool                                                         bWasAvoidanceUpdated;                              // 0x39b(0x1)
	bool                                                         bProjectNavMeshWalking;                            // 0x39b(0x1)
	char                                                         pad0x14_7Q6TU[0x14];                               // 0x39c(0x14)
	float                                                        SmoothingClientPositionTolerance;                  // 0x3b0(0x4)
	float                                                        AvoidanceConsiderationRadius;                      // 0x3b4(0x4)
	Struct Vector                                                RequestedVelocity;                                 // 0x3b8(0xc)
	int                                                          AvoidanceUID;                                      // 0x3c4(0x4)
	Struct NavAvoidanceMask                                      AvoidanceGroup;                                    // 0x3c8(0x4)
	Struct NavAvoidanceMask                                      GroupsToAvoid;                                     // 0x3cc(0x4)
	Struct NavAvoidanceMask                                      GroupsToIgnore;                                    // 0x3d0(0x4)
	float                                                        AvoidanceWeight;                                   // 0x3d4(0x4)
	Struct Vector                                                PendingLaunchVelocity;                             // 0x3d8(0xc)
	char                                                         pad0x9c_NQ0EJ[0x9c];                               // 0x3e4(0x9c)
	float                                                        NavMeshProjectionInterval;                         // 0x480(0x4)
	float                                                        NavMeshProjectionTimer;                            // 0x484(0x4)
	bool                                                         bUseNavMeshProjectionTimeModifier;                 // 0x488(0x1)
	char                                                         pad0x3_4LC1J[0x3];                                 // 0x489(0x3)
	float                                                        MaxNavMeshProjectionInterval;                      // 0x48c(0x4)
	char                                                         pad0x4_JOSM0[0x4];                                 // 0x490(0x4)
	float                                                        NavMeshProjectionInterpSpeed;                      // 0x494(0x4)
	bool                                                         bUsePlaneBasedNavMeshProjectionInterpSystem;       // 0x498(0x1)
	char                                                         pad0x3_ZLVIB[0x3];                                 // 0x499(0x3)
	float                                                        MaxAllowedZOffsetFromCurrentPlane;                 // 0x49c(0x4)
	float                                                        MaxZDiffFromPrevPlane;                             // 0x4a0(0x4)
	char                                                         pad0x1c_X126O[0x1c];                               // 0x4a4(0x1c)
	float                                                        NavMeshProjectionHeightScaleUp;                    // 0x4c0(0x4)
	float                                                        NavMeshProjectionHeightScaleDown;                  // 0x4c4(0x4)
	bool                                                         UseControllerRotationInNavWalkingMoveComponent;    // 0x4c8(0x1)
	char                                                         pad0x7_9SD42[0x7];                                 // 0x4c9(0x7)
	Struct CharacterMovementComponentPreClothTickFunction        PreClothComponentTick;                             // 0x4d0(0x50)
	char                                                         pad0x14_GP7LR[0x14];                               // 0x520(0x14)
	float                                                        MinTimeBetweenTimeStampResets;                     // 0x534(0x4)
	char                                                         pad0x8_JFHKU[0x8];                                 // 0x538(0x8)
	Struct RootMotionMovementParams                              RootMotionParams;                                  // 0x540(0x40)
	bool                                                         bWasSimulatingRootMotion;                          // 0x580(0x1)
	char                                                         pad0xf_143QG[0xf];                                 // 0x581(0xf)
};


// Size 0x9a8 (Full Size[0x9d0] - InheritedSize[0x28]
class Engine: public Object
{
public:
	char                                                         pad0x8_T88HL[0x8];                                 // 0x28(0x8)
	Class Font*                                                  TinyFont;                                          // 0x30(0x8)
	Struct StringAssetReference                                  TinyFontName;                                      // 0x38(0x10)
	Class Font*                                                  SmallFont;                                         // 0x48(0x8)
	Struct StringAssetReference                                  SmallFontName;                                     // 0x50(0x10)
	Class Font*                                                  MediumFont;                                        // 0x60(0x8)
	Struct StringAssetReference                                  MediumFontName;                                    // 0x68(0x10)
	Class Font*                                                  LargeFont;                                         // 0x78(0x8)
	Struct StringAssetReference                                  LargeFontName;                                     // 0x80(0x10)
	Class Font*                                                  MonoFont;                                          // 0x90(0x8)
	Struct StringAssetReference                                  MonoFontName;                                      // 0x98(0x10)
	Class Font*                                                  SubtitleFont;                                      // 0xa8(0x8)
	Struct StringAssetReference                                  SubtitleFontName;                                  // 0xb0(0x10)
	Class Font*                                                  HugeFont;                                          // 0xc0(0x8)
	Struct StringAssetReference                                  HugeFontName;                                      // 0xc8(0x10)
	TArray<class Font*>                                          AdditionalFonts;                                   // 0xd8(0x10)
	char                                                         pad0x8_1U7M9[0x8];                                 // 0xe8(0x8)
	TArray<Str AdditionalFontNames>                              AdditionalFontNames;                               // 0xf0(0x10)
	class                                                        ConsoleClass;                                      // 0x100(0x8)
	Struct StringClassReference                                  ConsoleClassName;                                  // 0x108(0x10)
	class                                                        GameViewportClientClass;                           // 0x118(0x8)
	Struct StringClassReference                                  GameViewportClientClassName;                       // 0x120(0x10)
	class                                                        LocalPlayerClass;                                  // 0x130(0x8)
	Struct StringClassReference                                  LocalPlayerClassName;                              // 0x138(0x10)
	class                                                        WorldSettingsClass;                                // 0x148(0x8)
	Struct StringClassReference                                  WorldSettingsClassName;                            // 0x150(0x10)
	Struct StringClassReference                                  NavigationSystemClassName;                         // 0x160(0x10)
	class                                                        NavigationSystemClass;                             // 0x170(0x8)
	Struct StringClassReference                                  AvoidanceManagerClassName;                         // 0x178(0x10)
	class                                                        AvoidanceManagerClass;                             // 0x188(0x8)
	class                                                        PhysicsCollisionHandlerClass;                      // 0x190(0x8)
	Struct StringClassReference                                  PhysicsCollisionHandlerClassName;                  // 0x198(0x10)
	Struct StringClassReference                                  GameUserSettingsClassName;                         // 0x1a8(0x10)
	class                                                        GameUserSettingsClass;                             // 0x1b8(0x8)
	Struct StringClassReference                                  AIControllerClassName;                             // 0x1c0(0x10)
	Class GameUserSettings*                                      GameUserSettings;                                  // 0x1d0(0x8)
	class                                                        LevelScriptActorClass;                             // 0x1d8(0x8)
	Struct StringClassReference                                  LevelScriptActorClassName;                         // 0x1e0(0x10)
	Struct StringClassReference                                  DefaultBlueprintBaseClassName;                     // 0x1f0(0x10)
	Struct StringClassReference                                  GameSingletonClassName;                            // 0x200(0x10)
	Class Object*                                                GameSingleton;                                     // 0x210(0x8)
	class                                                        DefaultPreviewPawnClass;                           // 0x218(0x8)
	Struct StringClassReference                                  DefaultPreviewPawnClassName;                       // 0x220(0x10)
	Struct FString                                               PlayOnConsoleSaveDir;                              // 0x230(0x10)
	Class Texture2D*                                             DefaultTexture;                                    // 0x240(0x8)
	Struct StringAssetReference                                  DefaultTextureName;                                // 0x248(0x10)
	Class Texture*                                               DefaultDiffuseTexture;                             // 0x258(0x8)
	Struct StringAssetReference                                  DefaultDiffuseTextureName;                         // 0x260(0x10)
	Class Texture2D*                                             DefaultBSPVertexTexture;                           // 0x270(0x8)
	Struct StringAssetReference                                  DefaultBSPVertexTextureName;                       // 0x278(0x10)
	Class Texture2D*                                             HighFrequencyNoiseTexture;                         // 0x288(0x8)
	Struct StringAssetReference                                  HighFrequencyNoiseTextureName;                     // 0x290(0x10)
	Class Texture2D*                                             DefaultBokehTexture;                               // 0x2a0(0x8)
	Struct StringAssetReference                                  DefaultBokehTextureName;                           // 0x2a8(0x10)
	Class Texture2D*                                             HDRCalibrationTexture;                             // 0x2b8(0x8)
	Struct StringAssetReference                                  HDRCalibrationTextureName;                         // 0x2c0(0x10)
	Class Material*                                              WireframeMaterial;                                 // 0x2d0(0x8)
	Struct FString                                               WireframeMaterialName;                             // 0x2d8(0x10)
	Class Material*                                              DebugMeshMaterial;                                 // 0x2e8(0x8)
	Struct StringAssetReference                                  DebugMeshMaterialName;                             // 0x2f0(0x10)
	Class Material*                                              LevelColorationLitMaterial;                        // 0x300(0x8)
	Struct FString                                               LevelColorationLitMaterialName;                    // 0x308(0x10)
	Class Material*                                              LevelColorationUnlitMaterial;                      // 0x318(0x8)
	Struct FString                                               LevelColorationUnlitMaterialName;                  // 0x320(0x10)
	Class Material*                                              TriangleDensityScreenSpaceMaterial;                // 0x330(0x8)
	Struct FString                                               TriangleDensityScreenSpaceMaterialName;            // 0x338(0x10)
	Class Material*                                              TriangleDensityWorldSpaceMaterial;                 // 0x348(0x8)
	Struct FString                                               TriangleDensityWorldSpaceMaterialName;             // 0x350(0x10)
	Class Material*                                              LightingTexelDensityMaterial;                      // 0x360(0x8)
	Struct FString                                               LightingTexelDensityName;                          // 0x368(0x10)
	Class Material*                                              ShadedLevelColorationLitMaterial;                  // 0x378(0x8)
	Struct FString                                               ShadedLevelColorationLitMaterialName;              // 0x380(0x10)
	Class Material*                                              ShadedLevelColorationUnlitMaterial;                // 0x390(0x8)
	Struct FString                                               ShadedLevelColorationUnlitMaterialName;            // 0x398(0x10)
	Class Material*                                              RemoveSurfaceMaterial;                             // 0x3a8(0x8)
	Struct StringAssetReference                                  RemoveSurfaceMaterialName;                         // 0x3b0(0x10)
	Class Material*                                              VertexColorMaterial;                               // 0x3c0(0x8)
	Struct FString                                               VertexColorMaterialName;                           // 0x3c8(0x10)
	Class Material*                                              VertexColorViewModeMaterial_ColorOnly;             // 0x3d8(0x8)
	Struct FString                                               VertexColorViewModeMaterialName_ColorOnly;         // 0x3e0(0x10)
	Class Material*                                              VertexColorViewModeMaterial_AlphaAsColor;          // 0x3f0(0x8)
	Struct FString                                               VertexColorViewModeMaterialName_AlphaAsColor;      // 0x3f8(0x10)
	Class Material*                                              VertexColorViewModeMaterial_RedOnly;               // 0x408(0x8)
	Struct FString                                               VertexColorViewModeMaterialName_RedOnly;           // 0x410(0x10)
	Class Material*                                              VertexColorViewModeMaterial_GreenOnly;             // 0x420(0x8)
	Struct FString                                               VertexColorViewModeMaterialName_GreenOnly;         // 0x428(0x10)
	Class Material*                                              VertexColorViewModeMaterial_BlueOnly;              // 0x438(0x8)
	Struct FString                                               VertexColorViewModeMaterialName_BlueOnly;          // 0x440(0x10)
	Class Material*                                              ConstraintLimitMaterial;                           // 0x450(0x8)
	Class MaterialInstanceDynamic*                               ConstraintLimitMaterialX;                          // 0x458(0x8)
	Class MaterialInstanceDynamic*                               ConstraintLimitMaterialY;                          // 0x460(0x8)
	Class MaterialInstanceDynamic*                               ConstraintLimitMaterialZ;                          // 0x468(0x8)
	Struct StringAssetReference                                  ConstraintLimitMaterialName;                       // 0x470(0x10)
	Class Material*                                              InvalidLightmapSettingsMaterial;                   // 0x480(0x8)
	Struct StringAssetReference                                  InvalidLightmapSettingsMaterialName;               // 0x488(0x10)
	Class Material*                                              PreviewShadowsIndicatorMaterial;                   // 0x498(0x8)
	Struct StringAssetReference                                  PreviewShadowsIndicatorMaterialName;               // 0x4a0(0x10)
	Class Material*                                              ArrowMaterial;                                     // 0x4b0(0x8)
	Struct StringAssetReference                                  ArrowMaterialName;                                 // 0x4b8(0x10)
	Struct LinearColor                                           LightingOnlyBrightness;                            // 0x4c8(0x10)
	TArray<struct LightComplexityColors>                         LightComplexityColors;                             // 0x4d8(0x10)
	TArray<struct ShaderComplexityColors>                        ShaderComplexityColors;                            // 0x4e8(0x10)
	TArray<struct StationaryLightOverlapColors>                  StationaryLightOverlapColors;                      // 0x4f8(0x10)
	TArray<struct LODColorationColors>                           LODColorationColors;                               // 0x508(0x10)
	float                                                        MaxPixelShaderAdditiveComplexityCount;             // 0x518(0x4)
	float                                                        MaxES2PixelShaderAdditiveComplexityCount;          // 0x51c(0x4)
	float                                                        MinLightMapDensity;                                // 0x520(0x4)
	float                                                        IdealLightMapDensity;                              // 0x524(0x4)
	float                                                        MaxLightMapDensity;                                // 0x528(0x4)
	bool                                                         bRenderLightMapDensityGrayscale;                   // 0x52c(0x1)
	char                                                         pad0x3_FTUQ4[0x3];                                 // 0x52d(0x3)
	float                                                        RenderLightMapDensityGrayscaleScale;               // 0x530(0x4)
	float                                                        RenderLightMapDensityColorScale;                   // 0x534(0x4)
	Struct LinearColor                                           LightMapDensityVertexMappedColor;                  // 0x538(0x10)
	Struct LinearColor                                           LightMapDensitySelectedColor;                      // 0x548(0x10)
	TArray<struct StatColorMappings>                             StatColorMappings;                                 // 0x558(0x10)
	Class PhysicalMaterial*                                      DefaultPhysMaterial;                               // 0x568(0x8)
	Struct StringAssetReference                                  DefaultPhysMaterialName;                           // 0x570(0x10)
	TArray<struct ActiveGameNameRedirects>                       ActiveGameNameRedirects;                           // 0x580(0x10)
	TArray<struct ActiveClassRedirects>                          ActiveClassRedirects;                              // 0x590(0x10)
	TArray<struct ActivePluginRedirects>                         ActivePluginRedirects;                             // 0x5a0(0x10)
	TArray<struct ActiveStructRedirects>                         ActiveStructRedirects;                             // 0x5b0(0x10)
	Class Texture2D*                                             PreIntegratedSkinBRDFTexture;                      // 0x5c0(0x8)
	Struct StringAssetReference                                  PreIntegratedSkinBRDFTextureName;                  // 0x5c8(0x10)
	Class Texture2D*                                             MiniFontTexture;                                   // 0x5d8(0x8)
	Struct StringAssetReference                                  MiniFontTextureName;                               // 0x5e0(0x10)
	Class Texture*                                               WeightMapPlaceholderTexture;                       // 0x5f0(0x8)
	Struct StringAssetReference                                  WeightMapPlaceholderTextureName;                   // 0x5f8(0x10)
	Class Texture2D*                                             LightMapDensityTexture;                            // 0x608(0x8)
	Struct StringAssetReference                                  LightMapDensityTextureName;                        // 0x610(0x10)
	char                                                         pad0x8_N41YJ[0x8];                                 // 0x620(0x8)
	Class GameViewportClient*                                    GameViewport;                                      // 0x628(0x8)
	TArray<Str DeferredCommands>                                 DeferredCommands;                                  // 0x630(0x10)
	int                                                          TickCycles;                                        // 0x640(0x4)
	int                                                          GameCycles;                                        // 0x644(0x4)
	int                                                          ClientCycles;                                      // 0x648(0x4)
	float                                                        NearClipPlane;                                     // 0x64c(0x4)
	bool                                                         bHardwareSurveyEnabled;                            // 0x650(0x1)
	bool                                                         bSubtitlesEnabled;                                 // 0x650(0x1)
	bool                                                         bSubtitlesForcedOff;                               // 0x650(0x1)
	char                                                         pad0x3_SHW7L[0x3];                                 // 0x651(0x3)
	int                                                          MaximumLoopIterationCount;                         // 0x654(0x4)
	bool                                                         bCanBlueprintsTickByDefault;                       // 0x658(0x1)
	bool                                                         bOptimizeAnimBlueprintMemberVariableAccess;        // 0x658(0x1)
	bool                                                         bEnableEditorPSysRealtimeLOD;                      // 0x658(0x1)
	bool                                                         bSmoothFrameRate;                                  // 0x658(0x1)
	bool                                                         bUseFixedFrameRate;                                // 0x658(0x1)
	char                                                         pad0x3_7AXJT[0x3];                                 // 0x659(0x3)
	float                                                        FixedFrameRate;                                    // 0x65c(0x4)
	Struct FloatRange                                            SmoothedFrameRateRange;                            // 0x660(0x10)
	Class EngineCustomTimeStep*                                  CustomTimeStep;                                    // 0x670(0x8)
	char                                                         pad0x20_1NX81[0x20];                               // 0x678(0x20)
	Class TimecodeProvider*                                      TimecodeProvider;                                  // 0x698(0x8)
	char                                                         pad0x19_A85WI[0x19];                               // 0x6a0(0x19)
	bool                                                         bGenerateDefaultTimecode;                          // 0x6b9(0x1)
	char                                                         pad0xa_MHBL2[0xa];                                 // 0x6ba(0xa)
	float                                                        GenerateDefaultTimecodeFrameDelay;                 // 0x6c4(0x4)
	bool                                                         bCheckForMultiplePawnsSpawnedInAFrame;             // 0x6c8(0x1)
	char                                                         pad0x3_CWYTH[0x3];                                 // 0x6c9(0x3)
	int                                                          NumPawnsAllowedToBeSpawnedInAFrame;                // 0x6cc(0x4)
	bool                                                         bShouldGenerateLowQualityLightmaps;                // 0x6d0(0x1)
	char                                                         pad0x3_FQONL[0x3];                                 // 0x6d1(0x3)
	Struct Color                                                 C_WorldBox;                                        // 0x6d4(0x4)
	Struct Color                                                 C_BrushWire;                                       // 0x6d8(0x4)
	Struct Color                                                 C_AddWire;                                         // 0x6dc(0x4)
	Struct Color                                                 C_SubtractWire;                                    // 0x6e0(0x4)
	Struct Color                                                 C_SemiSolidWire;                                   // 0x6e4(0x4)
	Struct Color                                                 C_NonSolidWire;                                    // 0x6e8(0x4)
	Struct Color                                                 C_WireBackground;                                  // 0x6ec(0x4)
	Struct Color                                                 C_ScaleBoxHi;                                      // 0x6f0(0x4)
	Struct Color                                                 C_VolumeCollision;                                 // 0x6f4(0x4)
	Struct Color                                                 C_BSPCollision;                                    // 0x6f8(0x4)
	Struct Color                                                 C_OrthoBackground;                                 // 0x6fc(0x4)
	Struct Color                                                 C_Volume;                                          // 0x700(0x4)
	Struct Color                                                 C_BrushShape;                                      // 0x704(0x4)
	float                                                        StreamingDistanceFactor;                           // 0x708(0x4)
	byte                                                         TransitionType;                                    // 0x70c(0x1)
	char                                                         pad0x3_NJQ3S[0x3];                                 // 0x70d(0x3)
	Struct FString                                               TransitionDescription;                             // 0x710(0x10)
	Struct FString                                               TransitionGameMode;                                // 0x720(0x10)
	float                                                        MeshLODRange;                                      // 0x730(0x4)
	bool                                                         bAllowMatureLanguage;                              // 0x734(0x1)
	char                                                         pad0x3_CVNW6[0x3];                                 // 0x735(0x3)
	float                                                        CameraRotationThreshold;                           // 0x738(0x4)
	float                                                        CameraTranslationThreshold;                        // 0x73c(0x4)
	float                                                        PrimitiveProbablyVisibleTime;                      // 0x740(0x4)
	float                                                        MaxOcclusionPixelsFraction;                        // 0x744(0x4)
	bool                                                         bPauseOnLossOfFocus;                               // 0x748(0x1)
	char                                                         pad0x3_RFX66[0x3];                                 // 0x749(0x3)
	int                                                          MaxParticleResize;                                 // 0x74c(0x4)
	int                                                          MaxParticleResizeWarn;                             // 0x750(0x4)
	char                                                         pad0x4_6M44B[0x4];                                 // 0x754(0x4)
	TArray<struct PendingDroppedNotes>                           PendingDroppedNotes;                               // 0x758(0x10)
	Struct RigidBodyErrorCorrection                              PhysicErrorCorrection;                             // 0x768(0x1c)
	float                                                        NetClientTicksPerSecond;                           // 0x784(0x4)
	bool                                                         bHasPendingGlobalReregister;                       // 0x788(0x1)
	char                                                         pad0x3_1QHS6[0x3];                                 // 0x789(0x3)
	float                                                        DisplayGamma;                                      // 0x78c(0x4)
	float                                                        MinDesiredFrameRate;                               // 0x790(0x4)
	Struct LinearColor                                           DefaultSelectedMaterialColor;                      // 0x794(0x10)
	Struct LinearColor                                           SelectedMaterialColor;                             // 0x7a4(0x10)
	Struct LinearColor                                           SelectionOutlineColor;                             // 0x7b4(0x10)
	Struct LinearColor                                           SubduedSelectionOutlineColor;                      // 0x7c4(0x10)
	Struct LinearColor                                           SelectedMaterialColorOverride;                     // 0x7d4(0x10)
	bool                                                         bIsOverridingSelectedColor;                        // 0x7e4(0x1)
	char                                                         pad0x3_JBNZD[0x3];                                 // 0x7e5(0x3)
	bool                                                         bEnableOnScreenDebugMessages;                      // 0x7e8(0x1)
	bool                                                         bEnableOnScreenDebugMessagesDisplay;               // 0x7e8(0x1)
	bool                                                         bSuppressMapWarnings;                              // 0x7e8(0x1)
	bool                                                         bCookSeparateSharedMPGameContent;                  // 0x7e8(0x1)
	bool                                                         bDisableAILogging;                                 // 0x7e8(0x1)
	char                                                         pad0x3_IBN8J[0x3];                                 // 0x7e9(0x3)
	int                                                          ScreenSaverInhibitorSemaphore;                     // 0x7f4(0x4)
	bool                                                         bLockReadOnlyLevels;                               // 0x7f8(0x1)
	char                                                         pad0x7_VOOJF[0x7];                                 // 0x7f9(0x7)
	Struct FString                                               ParticleEventManagerClassPath;                     // 0x800(0x10)
	char                                                         pad0x10_YYW8L[0x10];                               // 0x810(0x10)
	float                                                        SelectionHighlightIntensity;                       // 0x820(0x4)
	float                                                        BSPSelectionHighlightIntensity;                    // 0x824(0x4)
	float                                                        HoverHighlightIntensity;                           // 0x828(0x4)
	float                                                        SelectionHighlightIntensityBillboards;             // 0x82c(0x4)
	char                                                         pad0x130_036QP[0x130];                             // 0x830(0x130)
	TArray<struct NetDriverDefinitions>                          NetDriverDefinitions;                              // 0x960(0x10)
	TArray<Str ServerActors>                                     ServerActors;                                      // 0x970(0x10)
	TArray<Str RuntimeServerActors>                              RuntimeServerActors;                               // 0x980(0x10)
	bool                                                         bStartedLoadMapMovie;                              // 0x990(0x1)
	char                                                         pad0x17_VYQQN[0x17];                               // 0x991(0x17)
	int                                                          NextWorldContextHandle;                            // 0x9a8(0x4)
	char                                                         pad0x24_U364L[0x24];                               // 0x9ac(0x24)
};


// Size 0x60 (Full Size[0xa30] - InheritedSize[0x9d0]
class GameEngine: public Engine
{
public:
	float                                                        MaxDeltaTime;                                      // 0x9d0(0x4)
	float                                                        ServerFlushLogInterval;                            // 0x9d4(0x4)
	char                                                         pad0x58_8FF1T[0x58];                               // 0x9d8(0x58)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class GameInstance: public Object
{
public:
	char                                                         pad0x10_ELE7X[0x10];                               // 0x28(0x10)
	TArray<class LocalPlayer*>                                   LocalPlayers;                                      // 0x38(0x10)
	char                                                         pad0x8_354C3[0x8];                                 // 0x48(0x8)
	Class OnlineSession*                                         OnlineSession;                                     // 0x50(0x8)
	char                                                         pad0x30_4W0OE[0x30];                               // 0x58(0x30)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class Info: public Actor
{
public:
};


// Size 0xf8 (Full Size[0x4c0] - InheritedSize[0x3c8]
class GameMode: public Info
{
public:
	char                                                         pad0x8_FOG4B[0x8];                                 // 0x3c8(0x8)
	bool                                                         bDisableAsyncOcclusionChecking;                    // 0x3d0(0x1)
	bool                                                         bUseSeamlessTravel;                                // 0x3d0(0x1)
	bool                                                         bPauseable;                                        // 0x3d0(0x1)
	bool                                                         bStartPlayersAsSpectators;                         // 0x3d0(0x1)
	bool                                                         bDelayedStart;                                     // 0x3d0(0x1)
	char                                                         pad0x7_AMT7D[0x7];                                 // 0x3d1(0x7)
	Struct FString                                               OptionsString;                                     // 0x3d8(0x10)
	class                                                        DefaultPawnClass;                                  // 0x3e8(0x8)
	class                                                        HUDClass;                                          // 0x3f0(0x8)
	int                                                          NumSpectators;                                     // 0x3f8(0x4)
	int                                                          NumPlayers;                                        // 0x3fc(0x4)
	int                                                          NumBots;                                           // 0x400(0x4)
	float                                                        MinRespawnDelay;                                   // 0x404(0x4)
	Class GameSession*                                           GameSession;                                       // 0x408(0x8)
	int                                                          NumTravellingPlayers;                              // 0x410(0x4)
	char                                                         pad0x4_BKTGJ[0x4];                                 // 0x414(0x4)
	Struct FText                                                 DefaultPlayerName;                                 // 0x418(0x38)
	class                                                        EngineMessageClass;                                // 0x450(0x8)
	class                                                        PlayerControllerClass;                             // 0x458(0x8)
	class                                                        SpectatorClass;                                    // 0x460(0x8)
	class                                                        ReplaySpectatorPlayerControllerClass;              // 0x468(0x8)
	class                                                        PlayerStateClass;                                  // 0x470(0x8)
	class                                                        GameStateClass;                                    // 0x478(0x8)
	Class GameState*                                             GameState;                                         // 0x480(0x8)
	TArray<class PlayerState*>                                   InactivePlayerArray;                               // 0x488(0x10)
	char                                                         pad0x10_VZK0S[0x10];                               // 0x498(0x10)
	TArray<struct GameModeClassAliases>                          GameModeClassAliases;                              // 0x4a8(0x10)
	float                                                        InactivePlayerStateLifeSpan;                       // 0x4b8(0x4)
	bool                                                         bHandleDedicatedServerReplays;                     // 0x4bc(0x1)
	char                                                         pad0x3_9MUV5[0x3];                                 // 0x4bd(0x3)
};


// Size 0x2e0 (Full Size[0x5c0] - InheritedSize[0x2e0]
class PrimitiveComponent: public SceneComponent
{
public:
	char                                                         pad0x8_OTRJ5[0x8];                                 // 0x2e0(0x8)
	float                                                        MinDrawDistance;                                   // 0x2e8(0x4)
	char                                                         pad0x4_EHC3G[0x4];                                 // 0x2ec(0x4)
	float                                                        LDMaxDrawDistance;                                 // 0x2f0(0x4)
	float                                                        CachedMaxDrawDistance;                             // 0x2f4(0x4)
	byte                                                         DepthPriorityGroup;                                // 0x2f8(0x1)
	byte                                                         ViewOwnerDepthPriorityGroup;                       // 0x2f9(0x1)
	char                                                         pad0x2_8K05J[0x2];                                 // 0x2fa(0x2)
	bool                                                         bAlwaysCreatePhysicsState;                         // 0x2fc(0x1)
	bool                                                         bGenerateOverlapEvents;                            // 0x2fc(0x1)
	bool                                                         bMultiBodyOverlap;                                 // 0x2fc(0x1)
	bool                                                         bCheckAsyncSceneOnMove;                            // 0x2fc(0x1)
	bool                                                         bTraceComplexOnMove;                               // 0x2fc(0x1)
	bool                                                         bReturnMaterialOnMove;                             // 0x2fc(0x1)
	bool                                                         bUseViewOwnerDepthPriorityGroup;                   // 0x2fc(0x1)
	bool                                                         bAllowCullDistanceVolume;                          // 0x2fc(0x1)
	bool                                                         bHasMotionBlurVelocityMeshes;                      // 0x2fd(0x1)
	bool                                                         bRenderInMainPass;                                 // 0x2fd(0x1)
	bool                                                         bRenderInCustomPrePass;                            // 0x2fd(0x1)
	bool                                                         bReflected;                                        // 0x2fd(0x1)
	bool                                                         bReflectedOnLowQuality;                            // 0x2fd(0x1)
	bool                                                         bFFTWaterMask;                                     // 0x2fd(0x1)
	bool                                                         bVolumeFogMask;                                    // 0x2fd(0x1)
	bool                                                         bAffectsFlatWater;                                 // 0x2fe(0x1)
	bool                                                         bGPUParticlesKillPlane;                            // 0x2fe(0x1)
	bool                                                         bDontCull;                                         // 0x2fe(0x1)
	bool                                                         bDontSizeOnScreenCull;                             // 0x2fe(0x1)
	char                                                         pad0x1_MV7XO[0x1];                                 // 0x2ff(0x1)
	float                                                        OverriddenShadowMinTexelSize;                      // 0x300(0x4)
	bool                                                         bOverrideShadowMinSizeCulling;                     // 0x304(0x1)
	bool                                                         bOverrideShadowCascadesExclusion;                  // 0x305(0x1)
	byte                                                         ExcludedShadowCascades;                            // 0x306(0x1)
	char                                                         pad0x1_PGWY4[0x1];                                 // 0x307(0x1)
	bool                                                         bReceivesDecals;                                   // 0x308(0x1)
	bool                                                         bOwnerNoSee;                                       // 0x308(0x1)
	bool                                                         bOnlyOwnerSee;                                     // 0x308(0x1)
	bool                                                         bTreatAsBackgroundForOcclusion;                    // 0x308(0x1)
	bool                                                         bIsACloud;                                         // 0x308(0x1)
	bool                                                         bUseAsOccluder;                                    // 0x308(0x1)
	bool                                                         bSelectable;                                       // 0x308(0x1)
	bool                                                         bForceMipStreaming;                                // 0x308(0x1)
	bool                                                         bHasPerInstanceHitProxies;                         // 0x309(0x1)
	bool                                                         CastShadow;                                        // 0x309(0x1)
	bool                                                         bAffectDynamicIndirectLighting;                    // 0x309(0x1)
	bool                                                         bUseFarCascadeLPVBiasMultiplier;                   // 0x309(0x1)
	bool                                                         bAffectDistanceFieldLighting;                      // 0x309(0x1)
	bool                                                         bCastDynamicShadow;                                // 0x309(0x1)
	bool                                                         bCastStaticShadow;                                 // 0x309(0x1)
	bool                                                         bCastVolumetricTranslucentShadow;                  // 0x309(0x1)
	bool                                                         bSelfShadowOnly;                                   // 0x30a(0x1)
	bool                                                         bCastFarShadow;                                    // 0x30a(0x1)
	bool                                                         bCastInsetShadow;                                  // 0x30a(0x1)
	bool                                                         bCastCinematicShadow;                              // 0x30a(0x1)
	bool                                                         bCastHiddenShadow;                                 // 0x30a(0x1)
	bool                                                         bCastShadowAsTwoSided;                             // 0x30a(0x1)
	bool                                                         bCastShadowOnLowQuality;                           // 0x30a(0x1)
	bool                                                         bLightAsIfStatic;                                  // 0x30a(0x1)
	bool                                                         bLightAttachmentsAsGroup;                          // 0x30b(0x1)
	byte                                                         IndirectLightingCacheQuality;                      // 0x30c(0x1)
	bool                                                         bHasCachedStaticLighting;                          // 0x30d(0x1)
	bool                                                         bStaticLightingBuildEnqueued;                      // 0x30e(0x1)
	char                                                         pad0x1_XN32I[0x1];                                 // 0x30f(0x1)
	bool                                                         bIgnoreRadialImpulse;                              // 0x310(0x1)
	bool                                                         bIgnoreRadialForce;                                // 0x310(0x1)
	bool                                                         AlwaysLoadOnClient;                                // 0x310(0x1)
	bool                                                         AlwaysLoadOnServer;                                // 0x310(0x1)
	bool                                                         bUseEditorCompositing;                             // 0x310(0x1)
	bool                                                         bRenderCustomDepth;                                // 0x310(0x1)
	bool                                                         bAllowVelocityInMaterial;                          // 0x310(0x1)
	char                                                         pad0x3_78VNI[0x3];                                 // 0x311(0x3)
	int                                                          CustomDepthStencilValue;                           // 0x314(0x4)
	int                                                          TranslucencySortPriority;                          // 0x318(0x4)
	int                                                          VisibilityId;                                      // 0x31c(0x4)
	char                                                         pad0x4_4ER3B[0x4];                                 // 0x320(0x4)
	float                                                        LpvBiasMultiplier;                                 // 0x324(0x4)
	float                                                        FarCascadeLPVBiasMultiplier;                       // 0x328(0x4)
	float                                                        LpvIntensityMultiplier;                            // 0x32c(0x4)
	Struct CustomPrimitiveData                                   CustomPrimitiveData;                               // 0x330(0x10)
	Struct BodyInstance                                          BodyInstance;                                      // 0x340(0x180)
	bool                                                         bAffectRain;                                       // 0x4c0(0x1)
	bool                                                         bCanEverAffectNavigation;                          // 0x4c0(0x1)
	bool                                                         bSkipRenderingInOuterLPVCascades;                  // 0x4c0(0x1)
	bool                                                         bEnableMergeCollisionComponents;                   // 0x4c0(0x1)
	bool                                                         bVisibleWhenAboveWaterAndPlayerUnderwater;         // 0x4c0(0x1)
	bool                                                         bVisibleWhenAboveWaterAndPlayerAbove;              // 0x4c0(0x1)
	bool                                                         bVisibleWhenUnderwaterAndPlayerAbove;              // 0x4c0(0x1)
	bool                                                         bVisibleWhenUnderwaterAndPlayerUnderwater;         // 0x4c1(0x1)
	bool                                                         bCanRenderAboveAndBelowWaterAtSameTime;            // 0x4c1(0x1)
	char                                                         pad0x6_F2I93[0x6];                                 // 0x4c2(0x6)
	float                                                        BoundsScale;                                       // 0x4c8(0x4)
	float                                                        OcclusionBoundsScale;                              // 0x4cc(0x4)
	float                                                        LastRenderTime;                                    // 0x4d0(0x4)
	bool                                                         bGPUVisibility;                                    // 0x4d4(0x1)
	byte                                                         bHasCustomNavigableGeometry;                       // 0x4d5(0x1)
	byte                                                         CanCharacterStepUpOn;                              // 0x4d6(0x1)
	char                                                         pad0x49_W069L[0x49];                               // 0x4d7(0x49)
	Class PrimitiveComponent*                                    LODParentPrimitive;                                // 0x558(0x8)
	Struct PrimitiveComponentPostPhysicsTickFunction             PostPhysicsComponentTick;                          // 0x560(0x50)
	Class PrimitiveComponent*                                    MergedCollisionComponentParent;                    // 0x5b0(0x8)
	char                                                         pad0x8_QC0JM[0x8];                                 // 0x5b8(0x8)
};


// Size 0x58 (Full Size[0x420] - InheritedSize[0x3c8]
class GameState: public Info
{
public:
	class                                                        GameModeClass;                                     // 0x3c8(0x8)
	Class GameMode*                                              AuthorityGameMode;                                 // 0x3d0(0x8)
	class                                                        SpectatorClass;                                    // 0x3d8(0x8)
	struct FName                                                 MatchState;                                        // 0x3e0(0x8)
	struct FName                                                 PreviousMatchState;                                // 0x3e8(0x8)
	int                                                          ElapsedTime;                                       // 0x3f0(0x4)
	char                                                         pad0x4_P1DV4[0x4];                                 // 0x3f4(0x4)
	TArray<class PlayerState*>                                   PlayerArray;                                       // 0x3f8(0x10)
	float                                                        ReplicatedWorldTimeSeconds;                        // 0x408(0x4)
	float                                                        ServerWorldTimeSecondsDelta;                       // 0x40c(0x4)
	float                                                        ServerWorldTimeSecondsUpdateFrequency;             // 0x410(0x4)
	char                                                         pad0xc_GLW4L[0xc];                                 // 0x414(0xc)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class GameUserSettings: public Object
{
public:
	bool                                                         bUseVSync;                                         // 0x28(0x1)
	char                                                         pad0x1f_L9JTM[0x1f];                               // 0x29(0x1f)
	int                                                          WindowPosX;                                        // 0x58(0x4)
	int                                                          WindowPosY;                                        // 0x5c(0x4)
	bool                                                         bUseDesktopResolutionForFullscreen;                // 0x60(0x1)
	char                                                         pad0x3_HDW5F[0x3];                                 // 0x61(0x3)
	int                                                          FullscreenMode;                                    // 0x64(0x4)
	int                                                          LastConfirmedFullscreenMode;                       // 0x68(0x4)
	int                                                          AudioQualityLevel;                                 // 0x70(0x4)
	char                                                         pad0x4_3UJ7P[0x4];                                 // 0x74(0x4)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class ScriptViewportClient: public Object
{
public:
};


// Size 0x220 (Full Size[0x250] - InheritedSize[0x30]
class GameViewportClient: public ScriptViewportClient
{
public:
	char                                                         pad0x8_4XXFT[0x8];                                 // 0x30(0x8)
	Class Console*                                               ViewportConsole;                                   // 0x38(0x8)
	TArray<struct DebugProperties>                               DebugProperties;                                   // 0x40(0x10)
	char                                                         pad0x30_98G14[0x30];                               // 0x50(0x30)
	Class World*                                                 World;                                             // 0x80(0x8)
	Class GameInstance*                                          GameInstance;                                      // 0x88(0x8)
	char                                                         pad0x1c0_R8LSB[0x1c0];                             // 0x90(0x1c0)
};


// Size 0x88 (Full Size[0x450] - InheritedSize[0x3c8]
class PlayerState: public Info
{
public:
	float                                                        Score;                                             // 0x3c8(0x4)
	byte                                                         Ping;                                              // 0x3cc(0x1)
	char                                                         pad0x3_O6TMR[0x3];                                 // 0x3cd(0x3)
	Struct FString                                               PlayerName;                                        // 0x3d0(0x10)
	char                                                         pad0x10_B8VL7[0x10];                               // 0x3e0(0x10)
	int                                                          PlayerId;                                          // 0x3f0(0x4)
	bool                                                         bIsSpectator;                                      // 0x3f4(0x1)
	bool                                                         bOnlySpectator;                                    // 0x3f4(0x1)
	bool                                                         bIsABot;                                           // 0x3f4(0x1)
	bool                                                         bIsInactive;                                       // 0x3f4(0x1)
	bool                                                         bFromPreviousLevel;                                // 0x3f4(0x1)
	char                                                         pad0x3_XLIOT[0x3];                                 // 0x3f5(0x3)
	int                                                          StartTime;                                         // 0x3f8(0x4)
	char                                                         pad0x4_2B7K2[0x4];                                 // 0x3fc(0x4)
	class                                                        EngineMessageClass;                                // 0x400(0x8)
	char                                                         pad0x18_YNOH4[0x18];                               // 0x408(0x18)
	Struct UniqueNetIdRepl                                       UniqueId;                                          // 0x420(0x18)
	char                                                         pad0x18_O70Y9[0x18];                               // 0x438(0x18)
};


// Size 0x60 (Full Size[0x428] - InheritedSize[0x3c8]
class Controller: public Actor
{
public:
	char                                                         pad0x8_UELJT[0x8];                                 // 0x3c8(0x8)
	Class Pawn*                                                  Pawn;                                              // 0x3d0(0x8)
	char                                                         pad0x8_A6GFJ[0x8];                                 // 0x3d8(0x8)
	Class Character*                                             Character;                                         // 0x3e0(0x8)
	Class PlayerState*                                           PlayerState;                                       // 0x3e8(0x8)
	Class SceneComponent*                                        TransformComponent;                                // 0x3f0(0x8)
	Struct Rotator                                               ControlRotation;                                   // 0x3f8(0xc)
	bool                                                         bAttachToPawn;                                     // 0x404(0x1)
	char                                                         pad0xb_IW953[0xb];                                 // 0x405(0xb)
	struct FName                                                 StateName;                                         // 0x410(0x8)
	char                                                         pad0x10_UX2KJ[0x10];                               // 0x418(0x10)
};


// Size 0x348 (Full Size[0x770] - InheritedSize[0x428]
class PlayerController: public Controller
{
public:
	Class Player*                                                Player;                                            // 0x428(0x8)
	char                                                         pad0x8_ISWP4[0x8];                                 // 0x430(0x8)
	Class Pawn*                                                  AcknowledgedPawn;                                  // 0x438(0x8)
	Class InterpTrackInstDirector*                               ControllingDirTrackInst;                           // 0x440(0x8)
	char                                                         pad0x8_6B7VE[0x8];                                 // 0x448(0x8)
	Class HUD*                                                   MyHUD;                                             // 0x450(0x8)
	Class PlayerCameraManager*                                   PlayerCameraManager;                               // 0x458(0x8)
	class                                                        PlayerCameraManagerClass;                          // 0x460(0x8)
	bool                                                         bAutoManageActiveCameraTarget;                     // 0x468(0x1)
	char                                                         pad0x3_BB9KZ[0x3];                                 // 0x469(0x3)
	Struct Rotator                                               TargetViewRotation;                                // 0x46c(0xc)
	char                                                         pad0x10_6ZGOR[0x10];                               // 0x478(0x10)
	TArray<class Actor*>                                         HiddenActors;                                      // 0x488(0x10)
	float                                                        LastSpectatorStateSynchTime;                       // 0x498(0x4)
	Struct Vector                                                LastSpectatorSyncLocation;                         // 0x49c(0xc)
	Struct Rotator                                               LastSpectatorSyncRotation;                         // 0x4a8(0xc)
	int                                                          ClientCap;                                         // 0x4b4(0x4)
	Class CheatManager*                                          CheatManager;                                      // 0x4b8(0x8)
	class                                                        CheatClass;                                        // 0x4c0(0x8)
	Class PlayerInput*                                           PlayerInput;                                       // 0x4c8(0x8)
	TArray<struct ActiveForceFeedbackEffects>                    ActiveForceFeedbackEffects;                        // 0x4d0(0x10)
	char                                                         pad0x90_JC7AE[0x90];                               // 0x4e0(0x90)
	bool                                                         bPlayerIsWaiting;                                  // 0x570(0x1)
	char                                                         pad0x3_Z7P8X[0x3];                                 // 0x571(0x3)
	byte                                                         NetPlayerIndex;                                    // 0x574(0x1)
	bool                                                         bHasVoiceHandshakeCompleted;                       // 0x575(0x1)
	char                                                         pad0x2_M7U49[0x2];                                 // 0x576(0x2)
	Class NetConnection*                                         PendingSwapConnection;                             // 0x578(0x8)
	Class NetConnection*                                         NetConnection;                                     // 0x580(0x8)
	char                                                         pad0xc_VB5W2[0xc];                                 // 0x588(0xc)
	float                                                        InputYawScale;                                     // 0x594(0x4)
	float                                                        InputPitchScale;                                   // 0x598(0x4)
	float                                                        InputRollScale;                                    // 0x59c(0x4)
	bool                                                         bShowMouseCursor;                                  // 0x5a0(0x1)
	bool                                                         bEnableClickEvents;                                // 0x5a0(0x1)
	bool                                                         bEnableTouchEvents;                                // 0x5a0(0x1)
	bool                                                         bEnableMouseOverEvents;                            // 0x5a0(0x1)
	bool                                                         bEnableTouchOverEvents;                            // 0x5a0(0x1)
	bool                                                         bForceFeedbackEnabled;                             // 0x5a0(0x1)
	char                                                         pad0x3_SE9QD[0x3];                                 // 0x5a1(0x3)
	byte                                                         DefaultMouseCursor;                                // 0x5a4(0x1)
	byte                                                         CurrentMouseCursor;                                // 0x5a5(0x1)
	byte                                                         DefaultClickTraceChannel;                          // 0x5a6(0x1)
	byte                                                         CurrentClickTraceChannel;                          // 0x5a7(0x1)
	float                                                        HitResultTraceDistance;                            // 0x5a8(0x4)
	float                                                        ForceFeedbackIntensity;                            // 0x5ac(0x4)
	char                                                         pad0x88_FEGF8[0x88];                               // 0x5b0(0x88)
	Class InputComponent*                                        InactiveStateInputComponent;                       // 0x638(0x8)
	char                                                         pad0x20_K6VNV[0x20];                               // 0x640(0x20)
	Class TouchInterface*                                        CurrentTouchInterface;                             // 0x660(0x8)
	char                                                         pad0x30_V0GLV[0x30];                               // 0x668(0x30)
	Class SpectatorPawn*                                         SpectatorPawn;                                     // 0x698(0x8)
	Struct Vector                                                SpawnLocation;                                     // 0x6a0(0xc)
	char                                                         pad0x4_RHNZA[0x4];                                 // 0x6ac(0x4)
	bool                                                         bIsLocalPlayerController;                          // 0x714(0x1)
	char                                                         pad0x1_LZI39[0x1];                                 // 0x715(0x1)
	bool                                                         bInCinematicMode;                                  // 0x71a(0x1)
	char                                                         pad0x55_8V4Z8[0x55];                               // 0x71b(0x55)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class StaticMeshActor: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x3c8(0x8)
	bool                                                         bStaticMeshReplicateMovement;                      // 0x3d0(0x1)
	byte                                                         NavigationGeometryGatheringMode;                   // 0x3d1(0x1)
	char                                                         pad0x6_RWRM0[0x6];                                 // 0x3d2(0x6)
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class Brush: public Actor
{
public:
	byte                                                         BrushType;                                         // 0x3c8(0x1)
	char                                                         pad0x3_FXZNZ[0x3];                                 // 0x3c9(0x3)
	Struct Color                                                 BrushColor;                                        // 0x3cc(0x4)
	int                                                          PolyFlags;                                         // 0x3d0(0x4)
	bool                                                         bColored;                                          // 0x3d4(0x1)
	bool                                                         bSolidWhenSelected;                                // 0x3d4(0x1)
	bool                                                         bPlaceableFromClassBrowser;                        // 0x3d4(0x1)
	bool                                                         bNotForClientOrServer;                             // 0x3d4(0x1)
	char                                                         pad0x3_7WN2M[0x3];                                 // 0x3d5(0x3)
	Class Model*                                                 Brush;                                             // 0x3d8(0x8)
	Class BrushComponent*                                        BrushComponent;                                    // 0x3e0(0x8)
	bool                                                         bInManipulation;                                   // 0x3e8(0x1)
	char                                                         pad0x7_TPFN7[0x7];                                 // 0x3e9(0x7)
	TArray<struct SavedSelections>                               SavedSelections;                                   // 0x3f0(0x10)
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class Volume: public Brush
{
public:
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class BlockingVolume: public Volume
{
public:
};


// Size 0x1b8 (Full Size[0x580] - InheritedSize[0x3c8]
class WorldSettings: public Info
{
public:
	char                                                         pad0x8_7CSCL[0x8];                                 // 0x3c8(0x8)
	bool                                                         bEnableWorldBoundsChecks;                          // 0x3d0(0x1)
	bool                                                         bEnableNavigationSystem;                           // 0x3d0(0x1)
	char                                                         pad0x3_AZPA1[0x3];                                 // 0x3d1(0x3)
	byte                                                         WorldCompositionSetting;                           // 0x3d4(0x1)
	char                                                         pad0x3_DZMF5[0x3];                                 // 0x3d5(0x3)
	Struct StringAssetReference                                  InstancedNavMeshesDataAssetOveride;                // 0x3d8(0x10)
	bool                                                         bEnableWorldOriginRebasing;                        // 0x3e8(0x1)
	bool                                                         bWorldGravitySet;                                  // 0x3e8(0x1)
	bool                                                         bGlobalGravitySet;                                 // 0x3e8(0x1)
	char                                                         pad0x3_8D41J[0x3];                                 // 0x3e9(0x3)
	float                                                        KillZ;                                             // 0x3ec(0x4)
	class                                                        KillZDamageType;                                   // 0x3f0(0x8)
	float                                                        GlobalGravityZ;                                    // 0x3f8(0x4)
	char                                                         pad0x4_W9DZ1[0x4];                                 // 0x3fc(0x4)
	class                                                        DefaultPhysicsVolumeClass;                         // 0x400(0x8)
	class                                                        PhysicsCollisionHandlerClass;                      // 0x408(0x8)
	class                                                        DefaultGameMode;                                   // 0x410(0x8)
	TArray<struct DefaultMapPrefixes>                            DefaultMapPrefixes;                                // 0x418(0x10)
	class                                                        GameNetworkManagerClass;                           // 0x428(0x8)
	int                                                          PackedLightAndShadowMapTextureSize;                // 0x430(0x4)
	bool                                                         bMinimizeBSPSections;                              // 0x434(0x1)
	char                                                         pad0x3_768DL[0x3];                                 // 0x435(0x3)
	Struct Vector                                                DefaultColorScale;                                 // 0x438(0xc)
	bool                                                         bPrecomputeVisibility;                             // 0x444(0x1)
	bool                                                         bPlaceCellsOnlyAlongCameraTracks;                  // 0x444(0x1)
	char                                                         pad0x3_FJ3GY[0x3];                                 // 0x445(0x3)
	int                                                          VisibilityCellSize;                                // 0x448(0x4)
	byte                                                         VisibilityAggressiveness;                          // 0x44c(0x1)
	char                                                         pad0x3_34HYR[0x3];                                 // 0x44d(0x3)
	bool                                                         bForceNoPrecomputedLighting;                       // 0x450(0x1)
	char                                                         pad0x3_H5MZ6[0x3];                                 // 0x451(0x3)
	Struct LightmassWorldInfoSettings                            LightmassSettings;                                 // 0x454(0x44)
	byte                                                         LevelLightingQuality;                              // 0x498(0x1)
	char                                                         pad0x7_OILQH[0x7];                                 // 0x499(0x7)
	Struct ReverbSettings                                        DefaultReverbSettings;                             // 0x4a0(0x18)
	Struct InteriorSettings                                      DefaultAmbientZoneSettings;                        // 0x4b8(0x24)
	char                                                         pad0x4_SDW33[0x4];                                 // 0x4dc(0x4)
	Class SoundMix*                                              DefaultBaseSoundMix;                               // 0x4e0(0x8)
	float                                                        WorldToMeters;                                     // 0x4e8(0x4)
	char                                                         pad0x4_Y76GJ[0x4];                                 // 0x4ec(0x4)
	Class BookMark*                                              BookMarks;                                         // 0x4f0(0x8)
	char                                                         pad0x48_YX5FI[0x48];                               // 0x4f8(0x48)
	float                                                        TimeDilation;                                      // 0x540(0x4)
	float                                                        MatineeTimeDilation;                               // 0x544(0x4)
	float                                                        DemoPlayTimeDilation;                              // 0x548(0x4)
	bool                                                         bHighPriorityLoading;                              // 0x54c(0x1)
	bool                                                         bHighPriorityLoadingLocal;                         // 0x54c(0x1)
	char                                                         pad0x3_5IC2S[0x3];                                 // 0x54d(0x3)
	TArray<struct ReplicationViewers>                            ReplicationViewers;                                // 0x550(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x560(0x10)
	float                                                        WorldGravityZ;                                     // 0x570(0x4)
	char                                                         pad0x4_64HCL[0x4];                                 // 0x574(0x4)
	Class PlayerState*                                           Pauser;                                            // 0x578(0x8)
};


// Size 0x560 (Full Size[0x840] - InheritedSize[0x2e0]
class PostProcessComponent: public SceneComponent
{
public:
	char                                                         pad0x10_DFCDD[0x10];                               // 0x2e0(0x10)
	Struct PostProcessSettings                                   Settings;                                          // 0x2f0(0x540)
	float                                                        Priority;                                          // 0x830(0x4)
	float                                                        BlendRadius;                                       // 0x834(0x4)
	float                                                        BlendWeight;                                       // 0x838(0x4)
	bool                                                         bEnabled;                                          // 0x83c(0x1)
	bool                                                         bUnbound;                                          // 0x83c(0x1)
	char                                                         pad0x3_Z84WO[0x3];                                 // 0x83d(0x3)
};


// Size 0x110 (Full Size[0x138] - InheritedSize[0x28]
class Texture: public Object
{
public:
	int                                                          LODBias;                                           // 0x28(0x4)
	int                                                          NumCinematicMipLevels;                             // 0x2c(0x4)
	bool                                                         SRGB;                                              // 0x30(0x1)
	bool                                                         NeverStream;                                       // 0x30(0x1)
	bool                                                         bNoTiling;                                         // 0x30(0x1)
	bool                                                         bUseCinematicMipLevels;                            // 0x30(0x1)
	bool                                                         CompressionNone;                                   // 0x30(0x1)
	bool                                                         bUAV;                                              // 0x30(0x1)
	char                                                         pad0x3_SESLY[0x3];                                 // 0x31(0x3)
	int                                                          CachedCombinedLODBias;                             // 0x38(0x4)
	bool                                                         bAsyncResourceReleaseHasBeenStarted;               // 0x3c(0x1)
	char                                                         pad0x3_MHHPD[0x3];                                 // 0x3d(0x3)
	byte                                                         CompressionSettings;                               // 0x40(0x1)
	byte                                                         Filter;                                            // 0x41(0x1)
	byte                                                         LODGroup;                                          // 0x42(0x1)
	char                                                         pad0x1_DXQLB[0x1];                                 // 0x43(0x1)
	float                                                        StreamingPriorityBoost;                            // 0x44(0x4)
	char                                                         pad0x58_XG6DS[0x58];                               // 0x48(0x58)
	TArray<struct ExternalMips>                                  ExternalMips;                                      // 0xa0(0x10)
	char                                                         pad0x88_ZDTEP[0x88];                               // 0xb0(0x88)
};


// Size 0x8 (Full Size[0x140] - InheritedSize[0x138]
class TextureRenderTarget: public Texture
{
public:
	float                                                        TargetGamma;                                       // 0x138(0x4)
	char                                                         pad0x4_EIXOE[0x4];                                 // 0x13c(0x4)
};


// Size 0x28 (Full Size[0x168] - InheritedSize[0x140]
class TextureRenderTarget2D: public TextureRenderTarget
{
public:
	int                                                          SizeX;                                             // 0x140(0x4)
	int                                                          SizeY;                                             // 0x144(0x4)
	Struct LinearColor                                           ClearColor;                                        // 0x148(0x10)
	byte                                                         AddressX;                                          // 0x158(0x1)
	byte                                                         AddressY;                                          // 0x159(0x1)
	char                                                         pad0x2_7F18G[0x2];                                 // 0x15a(0x2)
	bool                                                         bForceLinearGamma;                                 // 0x15c(0x1)
	bool                                                         bHDR;                                              // 0x15c(0x1)
	bool                                                         bAutoGenerateMips;                                 // 0x15c(0x1)
	char                                                         pad0x3_535GR[0x3];                                 // 0x15d(0x3)
	byte                                                         OverrideFormat;                                    // 0x160(0x1)
	bool                                                         bDontClearOnCreation;                              // 0x161(0x1)
	char                                                         pad0x6_LAHTA[0x6];                                 // 0x162(0x6)
};


// Size 0x50 (Full Size[0x7c0] - InheritedSize[0x770]
class DebugCameraController: public PlayerController
{
public:
	bool                                                         bUseOriginalPlayerHUD;                             // 0x770(0x1)
	bool                                                         bShowSelectedInfo;                                 // 0x770(0x1)
	bool                                                         bIsFrozenRendering;                                // 0x770(0x1)
	char                                                         pad0x7_7C8X5[0x7];                                 // 0x771(0x7)
	Class DrawFrustumComponent*                                  DrawFrustum;                                       // 0x778(0x8)
	char                                                         pad0x10_60NDQ[0x10];                               // 0x780(0x10)
	Class PlayerController*                                      OriginalControllerRef;                             // 0x790(0x8)
	Class Player*                                                OriginalPlayer;                                    // 0x798(0x8)
	float                                                        SpeedScale;                                        // 0x7a0(0x4)
	float                                                        InitialMaxSpeed;                                   // 0x7a4(0x4)
	float                                                        InitialAccel;                                      // 0x7a8(0x4)
	float                                                        InitialDecel;                                      // 0x7ac(0x4)
	float                                                        SpeedScaleAdjustment;                              // 0x7b0(0x4)
	float                                                        FovScaleAdjustment;                                // 0x7b4(0x4)
	char                                                         pad0x8_J2YSF[0x8];                                 // 0x7b8(0x8)
};


// Size 0xf8 (Full Size[0x4c0] - InheritedSize[0x3c8]
class HUD: public Actor
{
public:
	Struct Color                                                 WhiteColor;                                        // 0x3c8(0x4)
	Struct Color                                                 GreenColor;                                        // 0x3cc(0x4)
	Struct Color                                                 RedColor;                                          // 0x3d0(0x4)
	char                                                         pad0x4_BGOYY[0x4];                                 // 0x3d4(0x4)
	Class PlayerController*                                      PlayerOwner;                                       // 0x3d8(0x8)
	bool                                                         bLostFocusPaused;                                  // 0x3e0(0x1)
	bool                                                         bShowHUD;                                          // 0x3e0(0x1)
	bool                                                         bShowDebugInfo;                                    // 0x3e0(0x1)
	bool                                                         bShowHitBoxDebugInfo;                              // 0x3e0(0x1)
	bool                                                         bShowOverlays;                                     // 0x3e0(0x1)
	bool                                                         bEnableDebugTextShadow;                            // 0x3e0(0x1)
	char                                                         pad0x7_3S2TG[0x7];                                 // 0x3e1(0x7)
	TArray<class Actor*>                                         PostRenderedActors;                                // 0x3e8(0x10)
	float                                                        LastHUDRenderTime;                                 // 0x3f8(0x4)
	float                                                        RenderDelta;                                       // 0x3fc(0x4)
	TArray<struct FName>                                         DebugDisplay;                                      // 0x400(0x10)
	TArray<struct FName>                                         ToggledDebugCategories;                            // 0x410(0x10)
	Class Canvas*                                                Canvas;                                            // 0x420(0x8)
	Class Canvas*                                                DebugCanvas;                                       // 0x428(0x8)
	TArray<struct DebugTextList>                                 DebugTextList;                                     // 0x430(0x10)
	class                                                        ShowDebugTargetDesiredClass;                       // 0x440(0x8)
	Class Actor*                                                 ShowDebugTargetActor;                              // 0x448(0x8)
	char                                                         pad0x70_94K9B[0x70];                               // 0x450(0x70)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class FeatureToggledStringAssetReference: public DataAsset
{
public:
	TArray<struct Entries>                                       Entries;                                           // 0x28(0x10)
	class                                                        ClassType;                                         // 0x38(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class LevelScriptActor: public Actor
{
public:
	bool                                                         bInputEnabled;                                     // 0x3c8(0x1)
	char                                                         pad0x7_2CSXR[0x7];                                 // 0x3c9(0x7)
};


// Size 0x10 (Full Size[0x5d0] - InheritedSize[0x5c0]
class ArrowComponent: public PrimitiveComponent
{
public:
	Struct Color                                                 ArrowColor;                                        // 0x5b8(0x4)
	float                                                        ArrowSize;                                         // 0x5bc(0x4)
	bool                                                         bIsScreenSizeScaled;                               // 0x5c0(0x1)
	char                                                         pad0x3_HADX0[0x3];                                 // 0x5c1(0x3)
	float                                                        ScreenSize;                                        // 0x5c4(0x4)
	bool                                                         bTreatAsASprite;                                   // 0x5c8(0x1)
	char                                                         pad0x7_AOJ0J[0x7];                                 // 0x5c9(0x7)
};


// Size 0x10 (Full Size[0x5d0] - InheritedSize[0x5c0]
class MeshComponent: public PrimitiveComponent
{
public:
	TArray<class MaterialInterface*>                             OverrideMaterials;                                 // 0x5b8(0x10)
	char                                                         pad0x8_K7WSS[0x8];                                 // 0x5c8(0x8)
};


// Size 0x50 (Full Size[0x620] - InheritedSize[0x5d0]
class StaticMeshComponent: public MeshComponent
{
public:
	int                                                          ForcedLodModel;                                    // 0x5c8(0x4)
	bool                                                         bOverrideMinLOD;                                   // 0x5cc(0x1)
	bool                                                         bOverrideNavigationToDefaultObstacle;              // 0x5cd(0x1)
	char                                                         pad0x2_EVP77[0x2];                                 // 0x5ce(0x2)
	int                                                          MinLOD;                                            // 0x5d0(0x4)
	char                                                         pad0x4_D2YNX[0x4];                                 // 0x5d4(0x4)
	Class StaticMesh*                                            StaticMesh;                                        // 0x5d8(0x8)
	bool                                                         bOverrideWireframeColor;                           // 0x5e0(0x1)
	char                                                         pad0x3_HBVNX[0x3];                                 // 0x5e1(0x3)
	Struct Color                                                 WireframeColorOverride;                            // 0x5e4(0x4)
	bool                                                         bIgnoreInstanceForTextureStreaming;                // 0x5e8(0x1)
	bool                                                         bOverrideLightMapRes;                              // 0x5e8(0x1)
	char                                                         pad0x3_GODQ2[0x3];                                 // 0x5e9(0x3)
	int                                                          OverriddenLightMapRes;                             // 0x5ec(0x4)
	float                                                        StreamingDistanceMultiplier;                       // 0x5f0(0x4)
	char                                                         pad0x4_W20UG[0x4];                                 // 0x5f4(0x4)
	TArray<struct IrrelevantLights>                              IrrelevantLights;                                  // 0x5f8(0x10)
	TArray<struct LODData>                                       LODData;                                           // 0x608(0x10)
	Class MaterialInterface*                                     CustomDepthMaterial;                               // 0x618(0x8)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class FogVolume: public Actor
{
public:
	Class SphereComponent*                                       SphereComponent;                                   // 0x3c8(0x8)
	Class FogVolumeComponent*                                    FogVolumeComponent;                                // 0x3d0(0x8)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class ThreadedActor: public Actor
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class MaterialInterface: public Object
{
public:
	char                                                         pad0x8_YU7R9[0x8];                                 // 0x28(0x8)
	Class SubsurfaceProfile*                                     SubsurfaceProfile;                                 // 0x30(0x8)
	char                                                         pad0x4_7PKO9[0x4];                                 // 0x38(0x4)
	Struct LightmassMaterialInterfaceSettings                    LightmassSettings;                                 // 0x3c(0x14)
	char                                                         pad0x8_KVB2X[0x8];                                 // 0x50(0x8)
};


// Size 0x9c0 (Full Size[0xa18] - InheritedSize[0x58]
class Material: public MaterialInterface
{
public:
	Class PhysicalMaterial*                                      PhysMaterial;                                      // 0x58(0x8)
	Struct ColorMaterialInput                                    DiffuseColor;                                      // 0x60(0x40)
	Struct ColorMaterialInput                                    SpecularColor;                                     // 0xa0(0x40)
	Struct ColorMaterialInput                                    BaseColor;                                         // 0xe0(0x40)
	Struct ScalarMaterialInput                                   Metallic;                                          // 0x120(0x40)
	Struct ScalarMaterialInput                                   Specular;                                          // 0x160(0x40)
	Struct ScalarMaterialInput                                   Roughness;                                         // 0x1a0(0x40)
	Struct VectorMaterialInput                                   Normal;                                            // 0x1e0(0x48)
	Struct ColorMaterialInput                                    EmissiveColor;                                     // 0x228(0x40)
	Struct ScalarMaterialInput                                   Opacity;                                           // 0x268(0x40)
	Struct ScalarMaterialInput                                   OpacityMask;                                       // 0x2a8(0x40)
	byte                                                         MaterialDomain;                                    // 0x2e8(0x1)
	byte                                                         BlendMode;                                         // 0x2e9(0x1)
	byte                                                         DecalBlendMode;                                    // 0x2ea(0x1)
	bool                                                         bDecalNoEmissiveOrRoughness;                       // 0x2eb(0x1)
	bool                                                         bDecalEnableStencil;                               // 0x2ec(0x1)
	byte                                                         MaterialDecalResponse;                             // 0x2ed(0x1)
	byte                                                         ShadingModel;                                      // 0x2ee(0x1)
	char                                                         pad0x1_M20YE[0x1];                                 // 0x2ef(0x1)
	float                                                        OpacityMaskClipValue;                              // 0x2f0(0x4)
	float                                                        DepthWeightScale;                                  // 0x2f4(0x4)
	float                                                        DepthWeightExponent;                               // 0x2f8(0x4)
	float                                                        DepthWeightBase;                                   // 0x2fc(0x4)
	bool                                                         bBlendedOITAfterTranslucency;                      // 0x300(0x1)
	bool                                                         bForceResolution;                                  // 0x300(0x1)
	char                                                         pad0x3_RAEA4[0x3];                                 // 0x301(0x3)
	byte                                                         ForcedResolution;                                  // 0x304(0x1)
	char                                                         pad0x3_3UID8[0x3];                                 // 0x305(0x3)
	float                                                        FirstSplitDistance;                                // 0x308(0x4)
	float                                                        SecondSplitDistance;                               // 0x30c(0x4)
	float                                                        FullResInFrontMaxDistance;                         // 0x310(0x4)
	bool                                                         FullResInFront;                                    // 0x314(0x1)
	bool                                                         PopPerParticle;                                    // 0x314(0x1)
	char                                                         pad0x3_CGDVA[0x3];                                 // 0x315(0x3)
	Struct VectorMaterialInput                                   WorldPositionOffset;                               // 0x318(0x48)
	Struct VectorMaterialInput                                   WorldDisplacement;                                 // 0x360(0x48)
	Struct ScalarMaterialInput                                   TessellationMultiplier;                            // 0x3a8(0x40)
	Struct ColorMaterialInput                                    SubsurfaceColor;                                   // 0x3e8(0x40)
	Struct ScalarMaterialInput                                   ClearCoat;                                         // 0x428(0x40)
	Struct ScalarMaterialInput                                   ClearCoatRoughness;                                // 0x468(0x40)
	Struct ScalarMaterialInput                                   AmbientOcclusion;                                  // 0x4a8(0x40)
	Struct ScalarMaterialInput                                   Refraction;                                        // 0x4e8(0x40)
	Struct ColorMaterialInput                                    BillboardColor;                                    // 0x528(0x40)
	Struct VectorMaterialInput                                   BillboardParams;                                   // 0x568(0x48)
	Struct Vector2MaterialInput                                  CustomizedUVs;                                     // 0x5b0(0x48)
	char                                                         pad0x1f8_5M2SD[0x1f8];                             // 0x5f8(0x1f8)
	Struct MaterialAttributesInput                               MaterialAttributes;                                // 0x7f0(0x38)
	char                                                         pad0x10_VNKBP[0x10];                               // 0x828(0x10)
	Struct ScalarMaterialInput                                   PixelDepthOffset;                                  // 0x838(0x40)
	bool                                                         bTranslucentBeforeTranslucency;                    // 0x878(0x1)
	bool                                                         bTranslucentBeforeVolumeFog;                       // 0x878(0x1)
	bool                                                         bTranslucentWithDepthWrite;                        // 0x878(0x1)
	bool                                                         bEnableSeparateTranslucency;                       // 0x878(0x1)
	bool                                                         bEnableResponsiveAA;                               // 0x878(0x1)
	bool                                                         bScreenSpaceReflections;                           // 0x878(0x1)
	bool                                                         TwoSided;                                          // 0x878(0x1)
	bool                                                         DitheredLODTransition;                             // 0x878(0x1)
	char                                                         pad0x3_QR8E0[0x3];                                 // 0x879(0x3)
	byte                                                         ConstantMaterial;                                  // 0x87c(0x1)
	char                                                         pad0x3_8YG98[0x3];                                 // 0x87d(0x3)
	float                                                        SkyLightWhenOccluded;                              // 0x880(0x4)
	float                                                        CloudShadowsInfluence;                             // 0x884(0x4)
	int                                                          NumCustomizedUVs;                                  // 0x888(0x4)
	byte                                                         TranslucencyLightingMode;                          // 0x88c(0x1)
	char                                                         pad0x3_4ROYV[0x3];                                 // 0x88d(0x3)
	float                                                        TranslucencyDirectionalLightingIntensity;          // 0x890(0x4)
	float                                                        LightColorInfluence;                               // 0x894(0x4)
	float                                                        AmbientLightColorInfluence;                        // 0x898(0x4)
	float                                                        LightIntensityInfluence;                           // 0x89c(0x4)
	float                                                        AmbientLightIntensityInfluence;                    // 0x8a0(0x4)
	float                                                        AlternativeAmbientLightColorInfluence;             // 0x8a4(0x4)
	float                                                        AlternativeAmbientLightIntensityInfluence;         // 0x8a8(0x4)
	bool                                                         bEvaluateLightningAtParticleCenter;                // 0x8ac(0x1)
	char                                                         pad0x3_X4JMW[0x3];                                 // 0x8ad(0x3)
	float                                                        TranslucencyScaleForReflection;                    // 0x8b0(0x4)
	bool                                                         bObjectFadeEnabled;                                // 0x8b4(0x1)
	char                                                         pad0x3_BM5FL[0x3];                                 // 0x8b5(0x3)
	float                                                        ObjectFadeRate;                                    // 0x8b8(0x4)
	float                                                        ObjectFadeDistanceThreshold;                       // 0x8bc(0x4)
	float                                                        TranslucentShadowDensityScale;                     // 0x8c0(0x4)
	float                                                        TranslucentSelfShadowDensityScale;                 // 0x8c4(0x4)
	float                                                        TranslucentSelfShadowSecondDensityScale;           // 0x8c8(0x4)
	float                                                        TranslucentSelfShadowSecondOpacity;                // 0x8cc(0x4)
	float                                                        TranslucentBackscatteringExponent;                 // 0x8d0(0x4)
	Struct LinearColor                                           TranslucentMultipleScatteringExtinction;           // 0x8d4(0x10)
	float                                                        TranslucentShadowStartOffset;                      // 0x8e4(0x4)
	float                                                        VolumeFogScale;                                    // 0x8e8(0x4)
	bool                                                         DistanceFog;                                       // 0x8ec(0x1)
	bool                                                         bDisableDepthTest;                                 // 0x8ec(0x1)
	bool                                                         bGenerateSphericalParticleNormals;                 // 0x8ec(0x1)
	bool                                                         bDontRenderWhenPlayerInsideShip;                   // 0x8ec(0x1)
	bool                                                         bTangentSpaceNormal;                               // 0x8ec(0x1)
	bool                                                         bUseEmissiveForDynamicAreaLighting;                // 0x8ec(0x1)
	bool                                                         bBlockGI;                                          // 0x8ec(0x1)
	bool                                                         bUsedAsSpecialEngineMaterial;                      // 0x8ec(0x1)
	bool                                                         bUsedWithSkeletalMesh;                             // 0x8ed(0x1)
	bool                                                         bUsedWithEditorCompositing;                        // 0x8ed(0x1)
	bool                                                         bUsedWithLandscape;                                // 0x8ed(0x1)
	bool                                                         bUsedWithParticleSprites;                          // 0x8ed(0x1)
	bool                                                         bUsedWithCPUParticleSprites;                       // 0x8ed(0x1)
	bool                                                         bUsedWithStaticMesh;                               // 0x8ed(0x1)
	bool                                                         bUsedWithCoverage;                                 // 0x8ed(0x1)
	bool                                                         bUsedWithGPUInstanceCulling;                       // 0x8ed(0x1)
	bool                                                         bUsedWithBeamTrails;                               // 0x8ee(0x1)
	bool                                                         bUsedWithMeshParticles;                            // 0x8ee(0x1)
	bool                                                         bUsedWithStaticLighting;                           // 0x8ee(0x1)
	bool                                                         bUsedWithFluidSurfaces;                            // 0x8ee(0x1)
	bool                                                         bUsedWithMorphTargets;                             // 0x8ee(0x1)
	bool                                                         bUsedWithSplineMeshes;                             // 0x8ee(0x1)
	bool                                                         bUsedWithInstancedStaticMeshes;                    // 0x8ee(0x1)
	bool                                                         bUsesDistortion;                                   // 0x8ee(0x1)
	bool                                                         bUsedWithClothing;                                 // 0x8ef(0x1)
	bool                                                         bUsedWithDeformables;                              // 0x8ef(0x1)
	bool                                                         bUsedWithFFTWaterMask;                             // 0x8ef(0x1)
	bool                                                         bUsedWithVolumeFogMask;                            // 0x8ef(0x1)
	bool                                                         bUsedWithDynamicObjectFading;                      // 0x8ef(0x1)
	bool                                                         bUsedWithWaterBoundary;                            // 0x8ef(0x1)
	bool                                                         bUsedWithClouds;                                   // 0x8ef(0x1)
	bool                                                         bUsedWithInstancedRopes;                           // 0x8ef(0x1)
	bool                                                         bUsedWithPlanarReflection;                         // 0x8f0(0x1)
	bool                                                         bUsedWithPointLightShadows;                        // 0x8f0(0x1)
	bool                                                         bUsedWithMaskPass;                                 // 0x8f0(0x1)
	bool                                                         bUsedWithUI;                                       // 0x8f0(0x1)
	bool                                                         bAutomaticallySetUsageInEditor;                    // 0x8f0(0x1)
	bool                                                         bAllowEmissiveOnLandscape;                         // 0x8f0(0x1)
	bool                                                         bApplyWaterMask;                                   // 0x8f0(0x1)
	bool                                                         bUseReZ;                                           // 0x8f0(0x1)
	bool                                                         bFullyRough;                                       // 0x8f1(0x1)
	bool                                                         bUseLightmapDirectionality;                        // 0x8f1(0x1)
	char                                                         pad0x2_NPF1F[0x2];                                 // 0x8f2(0x2)
	byte                                                         GeometryMode;                                      // 0x8f4(0x1)
	byte                                                         D3D11TessellationMode;                             // 0x8f5(0x1)
	char                                                         pad0x2_Y7R3Y[0x2];                                 // 0x8f6(0x2)
	bool                                                         bEnableCrackFreeDisplacement;                      // 0x8f8(0x1)
	bool                                                         bEnableAdaptiveTessellation;                       // 0x8f8(0x1)
	char                                                         pad0x3_ZFPU6[0x3];                                 // 0x8f9(0x3)
	float                                                        MaxDisplacement;                                   // 0x8fc(0x4)
	bool                                                         Wireframe;                                         // 0x900(0x1)
	bool                                                         bOutputVelocityOnBasePass;                         // 0x900(0x1)
	char                                                         pad0x3_K2KD8[0x3];                                 // 0x901(0x3)
	float                                                        NormalOffsetShadowBiasScale;                       // 0x904(0x4)
	int                                                          EditorX;                                           // 0x908(0x4)
	int                                                          EditorY;                                           // 0x90c(0x4)
	int                                                          EditorPitch;                                       // 0x910(0x4)
	int                                                          EditorYaw;                                         // 0x914(0x4)
	TArray<class MaterialExpression*>                            Expressions;                                       // 0x918(0x10)
	TArray<struct MaterialFunctionInfos>                         MaterialFunctionInfos;                             // 0x928(0x10)
	TArray<struct MaterialParameterCollectionInfos>              MaterialParameterCollectionInfos;                  // 0x938(0x10)
	bool                                                         bCanMaskedBeAssumedOpaque;                         // 0x948(0x1)
	bool                                                         bIsMasked;                                         // 0x948(0x1)
	bool                                                         bIsPreviewMaterial;                                // 0x948(0x1)
	bool                                                         bUseMaterialAttributes;                            // 0x948(0x1)
	bool                                                         bUseTranslucencyVertexFog;                         // 0x948(0x1)
	bool                                                         bUseDensityMapOnTranslucencyVertexFog;             // 0x948(0x1)
	bool                                                         bAllowDevelopmentShaderCompile;                    // 0x948(0x1)
	bool                                                         bIsMaterialEditorStatsMaterial;                    // 0x948(0x1)
	char                                                         pad0x3_C9TSO[0x3];                                 // 0x949(0x3)
	byte                                                         BlendableLocation;                                 // 0x950(0x1)
	char                                                         pad0x3_2K1ID[0x3];                                 // 0x951(0x3)
	int                                                          BlendablePriority;                                 // 0x954(0x4)
	bool                                                         bIsAlphaBlended;                                   // 0x958(0x1)
	char                                                         pad0x3_0QLMI[0x3];                                 // 0x959(0x3)
	float                                                        RefractionDepthBias;                               // 0x95c(0x4)
	Struct Guid                                                  StateId;                                           // 0x960(0x10)
	int                                                          UnwrappedUVSet;                                    // 0x970(0x4)
	char                                                         pad0x8c_LZ7J3[0x8c];                               // 0x974(0x8c)
	TArray<class Texture*>                                       ExpressionTextureReferences;                       // 0xa00(0x10)
	char                                                         pad0x8_V8YM1[0x8];                                 // 0xa10(0x8)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class CameraModifier: public Object
{
public:
	bool                                                         bDebug;                                            // 0x28(0x1)
	bool                                                         bExclusive;                                        // 0x28(0x1)
	char                                                         pad0x3_P2T98[0x3];                                 // 0x29(0x3)
	byte                                                         Priority;                                          // 0x2c(0x1)
	char                                                         pad0x3_1JPPJ[0x3];                                 // 0x2d(0x3)
	Class PlayerCameraManager*                                   CameraOwner;                                       // 0x30(0x8)
	float                                                        AlphaInTime;                                       // 0x38(0x4)
	float                                                        AlphaOutTime;                                      // 0x3c(0x4)
	float                                                        Alpha;                                             // 0x40(0x4)
	bool                                                         bAutoDestroyOnCompletion;                          // 0x44(0x1)
	char                                                         pad0x3_SQH0N[0x3];                                 // 0x45(0x3)
};


// Size 0x10 (Full Size[0x410] - InheritedSize[0x400]
class PhysicsVolume: public Volume
{
public:
	float                                                        TerminalVelocity;                                  // 0x400(0x4)
	int                                                          Priority;                                          // 0x404(0x4)
	float                                                        FluidFriction;                                     // 0x408(0x4)
	bool                                                         bWaterVolume;                                      // 0x40c(0x1)
	bool                                                         bPhysicsOnContact;                                 // 0x40c(0x1)
	char                                                         pad0x3_8QC5W[0x3];                                 // 0x40d(0x3)
};


// Size 0x2f0 (Full Size[0x8b0] - InheritedSize[0x5c0]
class ParticleSystemComponent: public PrimitiveComponent
{
public:
	Class ParticleSystem*                                        Template;                                          // 0x5b8(0x8)
	TArray<class MaterialInterface*>                             EmitterMaterials;                                  // 0x5c0(0x10)
	TArray<class SkeletalMeshComponent*>                         SkelMeshComponents;                                // 0x5d0(0x10)
	bool                                                         bResetOnDetach;                                    // 0x5e0(0x1)
	bool                                                         bUpdateOnDedicatedServer;                          // 0x5e0(0x1)
	char                                                         pad0x7_36063[0x7];                                 // 0x5e1(0x7)
	TArray<struct InstanceParameters>                            InstanceParameters;                                // 0x5e8(0x10)
	Struct ParticleSysParam                                      EmitterPointParameter;                             // 0x5f8(0x50)
	Struct Vector                                                OldPosition;                                       // 0x688(0xc)
	Struct Vector                                                PartSysVelocity;                                   // 0x694(0xc)
	char                                                         pad0x18_BVK3J[0x18];                               // 0x6a0(0x18)
	Struct Vector                                                CustomInheritedVelocity;                           // 0x6b8(0xc)
	char                                                         pad0x14_Z194E[0x14];                               // 0x6c4(0x14)
	float                                                        CustomParameterDrivingCurves;                      // 0x6d8(0x4)
	Struct LinearColor                                           ColourTint;                                        // 0x6dc(0x10)
	float                                                        WarmUpTime;                                        // 0x6ec(0x4)
	float                                                        WarmupTickRate;                                    // 0x6f0(0x4)
	bool                                                         bWarmingUp;                                        // 0x6f4(0x1)
	char                                                         pad0x1b_U5DFY[0x1b];                               // 0x6f5(0x1b)
	float                                                        SecondsBeforeInactive;                             // 0x710(0x4)
	char                                                         pad0x8_Q22SN[0x8];                                 // 0x714(0x8)
	float                                                        MaxTimeBeforeForceUpdateTransform;                 // 0x71c(0x4)
	char                                                         pad0x4_4T1UE[0x4];                                 // 0x720(0x4)
	bool                                                         bOverrideLODMethod;                                // 0x724(0x1)
	char                                                         pad0x3_YCKEP[0x3];                                 // 0x725(0x3)
	byte                                                         LODMethod;                                         // 0x728(0x1)
	char                                                         pad0x3_M8UD1[0x3];                                 // 0x729(0x3)
	bool                                                         bSkipUpdateDynamicDataDuringTick;                  // 0x72c(0x1)
	char                                                         pad0x3_RW0ED[0x3];                                 // 0x72d(0x3)
	TArray<struct CachedViewRelevanceFlags>                      CachedViewRelevanceFlags;                          // 0x730(0x10)
	char                                                         pad0x8_GQMP2[0x8];                                 // 0x740(0x8)
	TArray<class ParticleSystemReplay*>                          ReplayClips;                                       // 0x748(0x10)
	char                                                         pad0x60_6FYQN[0x60];                               // 0x758(0x60)
	float                                                        CustomTimeDilation;                                // 0x7b8(0x4)
	char                                                         pad0x4_ZN9DH[0x4];                                 // 0x7bc(0x4)
	bool                                                         bUnbound;                                          // 0x7d0(0x1)
	char                                                         pad0xdf_9GCHU[0xdf];                               // 0x7d1(0xdf)
};


// Size 0x80 (Full Size[0x640] - InheritedSize[0x5c0]
class SplineComponent: public PrimitiveComponent
{
public:
	Struct InterpCurveVector                                     SplineInfo;                                        // 0x5b8(0x18)
	Struct InterpCurveQuat                                       SplineRotInfo;                                     // 0x5d0(0x18)
	Struct InterpCurveVector                                     SplineScaleInfo;                                   // 0x5e8(0x18)
	Struct InterpCurveFloat                                      SplineReparamTable;                                // 0x600(0x18)
	bool                                                         bAllowSplineEditingPerInstance;                    // 0x618(0x1)
	char                                                         pad0x3_ZXJ7H[0x3];                                 // 0x619(0x3)
	int                                                          ReparamStepsPerSegment;                            // 0x61c(0x4)
	float                                                        Duration;                                          // 0x620(0x4)
	bool                                                         bStationaryEndpoints;                              // 0x624(0x1)
	bool                                                         bSplineHasBeenEdited;                              // 0x625(0x1)
	bool                                                         bClosedLoop;                                       // 0x626(0x1)
	char                                                         pad0x1_8HJVI[0x1];                                 // 0x627(0x1)
	Struct Vector                                                DefaultUpVector;                                   // 0x628(0xc)
	char                                                         pad0xc_LGQ0M[0xc];                                 // 0x634(0xc)
};


// Size 0x20 (Full Size[0x5e0] - InheritedSize[0x5c0]
class ShapeComponent: public PrimitiveComponent
{
public:
	Struct Color                                                 ShapeColor;                                        // 0x5b8(0x4)
	char                                                         pad0x4_J9CJL[0x4];                                 // 0x5bc(0x4)
	Class BodySetup*                                             ShapeBodySetup;                                    // 0x5c0(0x8)
	bool                                                         bDrawOnlyIfSelected;                               // 0x5c8(0x1)
	bool                                                         bShouldCollideWhenPlacing;                         // 0x5c8(0x1)
	bool                                                         bDynamicObstacle;                                  // 0x5c8(0x1)
	char                                                         pad0x7_TLC93[0x7];                                 // 0x5c9(0x7)
	class                                                        AreaClass;                                         // 0x5d0(0x8)
	char                                                         pad0x8_LBLHA[0x8];                                 // 0x5d8(0x8)
};


// Size 0x0 (Full Size[0x5e0] - InheritedSize[0x5e0]
class CapsuleComponent: public ShapeComponent
{
public:
	float                                                        CapsuleHalfHeight;                                 // 0x5d8(0x4)
	float                                                        CapsuleRadius;                                     // 0x5dc(0x4)
};


// Size 0x8 (Full Size[0x140] - InheritedSize[0x138]
class TextureProxy: public Texture
{
public:
	Class Texture*                                               Texture;                                           // 0x138(0x8)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class Commandlet: public Object
{
public:
	Struct FString                                               HelpDescription;                                   // 0x28(0x10)
	Struct FString                                               HelpUsage;                                         // 0x38(0x10)
	Struct FString                                               HelpWebLink;                                       // 0x48(0x10)
	TArray<Str HelpParamNames>                                   HelpParamNames;                                    // 0x58(0x10)
	TArray<Str HelpParamDescriptions>                            HelpParamDescriptions;                             // 0x68(0x10)
	bool                                                         IsServer;                                          // 0x78(0x1)
	bool                                                         IsClient;                                          // 0x78(0x1)
	bool                                                         IsEditor;                                          // 0x78(0x1)
	bool                                                         LogToConsole;                                      // 0x78(0x1)
	bool                                                         ShowErrorCount;                                    // 0x78(0x1)
	char                                                         pad0x7_R1OD0[0x7];                                 // 0x79(0x7)
};


// Size 0xb0 (Full Size[0x6d0] - InheritedSize[0x620]
class InstancedStaticMeshComponent: public StaticMeshComponent
{
public:
	TArray<struct PerInstanceSMData>                             PerInstanceSMData;                                 // 0x620(0x10)
	int                                                          InstancingRandomSeed;                              // 0x630(0x4)
	int                                                          InstanceStartCullDistance;                         // 0x634(0x4)
	int                                                          InstanceEndCullDistance;                           // 0x638(0x4)
	char                                                         pad0x4_Q1VXX[0x4];                                 // 0x63c(0x4)
	TArray<Int InstanceReorderTable>                             InstanceReorderTable;                              // 0x640(0x10)
	TArray<Int RemovedInstances>                                 RemovedInstances;                                  // 0x650(0x10)
	char                                                         pad0x48_B7QWY[0x48];                               // 0x660(0x48)
	Class PhysicsSerializer*                                     PhysicsSerializer;                                 // 0x6a8(0x8)
	int                                                          NumPendingLightmaps;                               // 0x6b0(0x4)
	char                                                         pad0x4_S6BKK[0x4];                                 // 0x6b4(0x4)
	TArray<struct CachedMappings>                                CachedMappings;                                    // 0x6b8(0x10)
	char                                                         pad0x8_CHNXB[0x8];                                 // 0x6c8(0x8)
};


// Size 0xd0 (Full Size[0x7a0] - InheritedSize[0x6d0]
class HierarchicalInstancedStaticMeshComponent: public InstancedStaticMeshComponent
{
public:
	char                                                         pad0x40_H7YOD[0x40];                               // 0x6d0(0x40)
	TArray<Int SortedInstances>                                  SortedInstances;                                   // 0x710(0x10)
	int                                                          NumBuiltInstances;                                 // 0x720(0x4)
	Struct Box                                                   BuiltInstanceBounds;                               // 0x724(0x1c)
	Struct Box                                                   UnbuiltInstanceBounds;                             // 0x740(0x1c)
	char                                                         pad0x4_AEQ0H[0x4];                                 // 0x75c(0x4)
	TArray<struct UnbuiltInstanceBoundsList>                     UnbuiltInstanceBoundsList;                         // 0x760(0x10)
	int                                                          OcclusionLayerNumNodes;                            // 0x770(0x4)
	char                                                         pad0x2_058E6[0x2];                                 // 0x774(0x2)
	bool                                                         bDisableCollision;                                 // 0x776(0x1)
	char                                                         pad0x29_5Q2EZ[0x29];                               // 0x777(0x29)
};


// Size 0x160 (Full Size[0x1b8] - InheritedSize[0x58]
class MaterialInstance: public MaterialInterface
{
public:
	Class PhysicalMaterial*                                      PhysMaterial;                                      // 0x58(0x8)
	Class MaterialInterface*                                     Parent;                                            // 0x60(0x8)
	bool                                                         bHasStaticPermutationResource;                     // 0x68(0x1)
	bool                                                         bOverrideSubsurfaceProfile;                        // 0x68(0x1)
	char                                                         pad0x7_GSGZG[0x7];                                 // 0x69(0x7)
	Struct Guid                                                  ParentLightingGuid;                                // 0x70(0x10)
	TArray<struct FontParameterValues>                           FontParameterValues;                               // 0x80(0x10)
	TArray<struct ScalarParameterValues>                         ScalarParameterValues;                             // 0x90(0x10)
	TArray<struct TextureParameterValues>                        TextureParameterValues;                            // 0xa0(0x10)
	TArray<struct VectorParameterValues>                         VectorParameterValues;                             // 0xb0(0x10)
	Struct MaterialInstanceBasePropertyOverrides                 BasePropertyOverrides;                             // 0xc0(0x84)
	char                                                         pad0x74_1WOCB[0x74];                               // 0x144(0x74)
};


// Size 0x0 (Full Size[0x1b8] - InheritedSize[0x1b8]
class MaterialInstanceConstant: public MaterialInstance
{
public:
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class MaterialExpression: public Object
{
public:
	Class Material*                                              Material;                                          // 0x28(0x8)
	Class MaterialFunction*                                      Function;                                          // 0x30(0x8)
	Struct FString                                               Desc;                                              // 0x38(0x10)
	Struct Color                                                 BorderColor;                                       // 0x48(0x4)
	bool                                                         bRealtimePreview;                                  // 0x4c(0x1)
	bool                                                         bNeedToUpdatePreview;                              // 0x4c(0x1)
	bool                                                         bIsParameterExpression;                            // 0x4c(0x1)
	bool                                                         bCommentBubbleVisible;                             // 0x4c(0x1)
	bool                                                         bShowOutputNameOnPin;                              // 0x4c(0x1)
	bool                                                         bHidePreviewWindow;                                // 0x4c(0x1)
	bool                                                         bCollapsed;                                        // 0x4c(0x1)
	bool                                                         bShaderInputData;                                  // 0x4c(0x1)
	bool                                                         bShowInputs;                                       // 0x4d(0x1)
	bool                                                         bShowOutputs;                                      // 0x4d(0x1)
	char                                                         pad0x2_NGEAZ[0x2];                                 // 0x4e(0x2)
	TArray<struct FText>                                         MenuCategories;                                    // 0x50(0x10)
	TArray<struct Outputs>                                       Outputs;                                           // 0x60(0x10)
};


// Size 0x0 (Full Size[0x70] - InheritedSize[0x70]
class MaterialExpressionCustomOutput: public MaterialExpression
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlueprintAsyncActionBase: public Object
{
public:
};


// Size 0x68 (Full Size[0x228] - InheritedSize[0x1c0]
class BlueprintGeneratedClass: public Class
{
public:
	int                                                          NumReplicatedProperties;                           // 0x1c0(0x4)
	char                                                         pad0x4_9SB0Q[0x4];                                 // 0x1c4(0x4)
	TArray<class DynamicBlueprintBinding*>                       DynamicBindingObjects;                             // 0x1c8(0x10)
	TArray<class ActorComponent*>                                ComponentTemplates;                                // 0x1d8(0x10)
	TArray<class TimelineTemplate*>                              Timelines;                                         // 0x1e8(0x10)
	Class SimpleConstructionScript*                              SimpleConstructionScript;                          // 0x1f8(0x8)
	Class InheritableComponentHandler*                           InheritableComponentHandler;                       // 0x200(0x8)
	Class StructProperty*                                        UberGraphFramePointerProperty;                     // 0x208(0x8)
	Class Function*                                              UberGraphFunction;                                 // 0x210(0x8)
	TArray<struct FastCallPairs>                                 FastCallPairs;                                     // 0x218(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AISystemBase: public Object
{
public:
	Struct StringClassReference                                  AISystemClassName;                                 // 0x28(0x10)
	struct FName                                                 AISystemModuleName;                                // 0x38(0x8)
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class UserDefinedStruct: public ScriptStruct
{
public:
	Struct Guid                                                  Guid;                                              // 0x98(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class Player: public Object
{
public:
	char                                                         pad0x8_VBWO8[0x8];                                 // 0x28(0x8)
	Class PlayerController*                                      PlayerController;                                  // 0x30(0x8)
	int                                                          CurrentNetSpeed;                                   // 0x38(0x4)
	int                                                          ConfiguredInternetSpeed;                           // 0x3c(0x4)
	int                                                          ConfiguredLanSpeed;                                // 0x40(0x4)
	char                                                         pad0x4_B6505[0x4];                                 // 0x44(0x4)
};


// Size 0x34558 (Full Size[0x345a0] - InheritedSize[0x48]
class NetConnection: public Player
{
public:
	char                                                         pad0x8_BRFV4[0x8];                                 // 0x48(0x8)
	TArray<class ChildConnection*>                               Children;                                          // 0x50(0x10)
	Class NetDriver*                                             Driver;                                            // 0x60(0x8)
	Class PackageMap*                                            PackageMap;                                        // 0x68(0x8)
	TArray<class Channel*>                                       OpenChannels;                                      // 0x70(0x10)
	TArray<class Actor*>                                         SentTemporaries;                                   // 0x80(0x10)
	Class Actor*                                                 ViewTarget;                                        // 0x90(0x8)
	Class Actor*                                                 OwningActor;                                       // 0x98(0x8)
	int                                                          MaxPacket;                                         // 0xa0(0x4)
	bool                                                         InternalAck;                                       // 0xa4(0x1)
	char                                                         pad0x2fb_SZ6NQ[0x2fb];                             // 0xa5(0x2fb)
	double                                                       LastReceiveTime;                                   // 0x3a0(0x8)
	char                                                         pad0x340b0_VDN2K[0x340b0];                         // 0x3a8(0x340b0)
	TArray<class Actor*>                                         ConsideredActorsList;                              // 0x34458(0x10)
	char                                                         pad0x10_9MW0T[0x10];                               // 0x34468(0x10)
	int                                                          MaxDormantActorsCheckedFromRelevancy;              // 0x34478(0x4)
	char                                                         pad0x5c_8NXUR[0x5c];                               // 0x3447c(0x5c)
	TArray<class Channel*>                                       DeferredCloseChannels;                             // 0x344d8(0x10)
	char                                                         pad0xb8_5CDA7[0xb8];                               // 0x344e8(0xb8)
};


// Size 0x450 (Full Size[0x478] - InheritedSize[0x28]
class NetDriver: public Object
{
public:
	char                                                         pad0x10_L6GM4[0x10];                               // 0x28(0x10)
	Struct FString                                               NetConnectionClassName;                            // 0x38(0x10)
	int                                                          MaxDownloadSize;                                   // 0x48(0x4)
	bool                                                         bClampListenServerTickRate;                        // 0x4c(0x1)
	char                                                         pad0x3_OXWQP[0x3];                                 // 0x4d(0x3)
	int                                                          NetServerMaxTickRate;                              // 0x50(0x4)
	int                                                          MaxInternetClientRate;                             // 0x54(0x4)
	int                                                          MaxClientRate;                                     // 0x58(0x4)
	float                                                        ServerTravelPause;                                 // 0x5c(0x4)
	float                                                        SpawnPrioritySeconds;                              // 0x60(0x4)
	float                                                        RelevantTimeout;                                   // 0x64(0x4)
	float                                                        KeepAliveTime;                                     // 0x68(0x4)
	float                                                        InitialConnectTimeout;                             // 0x6c(0x4)
	float                                                        ConnectionTimeout;                                 // 0x70(0x4)
	char                                                         pad0x4_GIK37[0x4];                                 // 0x74(0x4)
	Class NetConnection*                                         ServerConnection;                                  // 0x78(0x8)
	TArray<class NetConnection*>                                 ClientConnections;                                 // 0x80(0x10)
	Class World*                                                 World;                                             // 0x90(0x8)
	char                                                         pad0x30_KBI0U[0x30];                               // 0x98(0x30)
	class                                                        NetConnectionClass;                                // 0xc8(0x8)
	Class Property*                                              RoleProperty;                                      // 0xd0(0x8)
	Class Property*                                              RemoteRoleProperty;                                // 0xd8(0x8)
	struct FName                                                 NetDriverName;                                     // 0xe0(0x8)
	char                                                         pad0x390_1JBD6[0x390];                             // 0xe8(0x390)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OnlineSession: public Object
{
public:
};


// Size 0x550 (Full Size[0x578] - InheritedSize[0x28]
class Model: public Object
{
public:
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class EdGraphNode: public Object
{
public:
	TArray<class EdGraphPin*>                                    Pins;                                              // 0x28(0x10)
	int                                                          NodePosX;                                          // 0x38(0x4)
	int                                                          NodePosY;                                          // 0x3c(0x4)
	int                                                          NodeWidth;                                         // 0x40(0x4)
	int                                                          NodeHeight;                                        // 0x44(0x4)
	bool                                                         bHasCompilerMessage;                               // 0x48(0x1)
	char                                                         pad0x7_CH4NZ[0x7];                                 // 0x49(0x7)
	Struct FString                                               NodeComment;                                       // 0x50(0x10)
	bool                                                         bCommentBubblePinned;                              // 0x60(0x1)
	bool                                                         bCommentBubbleVisible;                             // 0x61(0x1)
	char                                                         pad0x2_AG284[0x2];                                 // 0x62(0x2)
	int                                                          ErrorType;                                         // 0x64(0x4)
	Struct FString                                               ErrorMsg;                                          // 0x68(0x10)
	Struct Guid                                                  NodeGuid;                                          // 0x78(0x10)
	byte                                                         AdvancedPinDisplay;                                // 0x88(0x1)
	bool                                                         bIsNodeEnabled;                                    // 0x89(0x1)
	bool                                                         bIsDebugFunction;                                  // 0x8a(0x1)
	char                                                         pad0x5_XHNBB[0x5];                                 // 0x8b(0x5)
};


// Size 0x100 (Full Size[0x128] - InheritedSize[0x28]
class EdGraphPin: public Object
{
public:
	Struct FString                                               PinName;                                           // 0x28(0x10)
	Struct FString                                               PinToolTip;                                        // 0x38(0x10)
	byte                                                         Direction;                                         // 0x48(0x1)
	char                                                         pad0x7_JMQCD[0x7];                                 // 0x49(0x7)
	Struct EdGraphPinType                                        PinType;                                           // 0x50(0x50)
	Struct FString                                               DefaultValue;                                      // 0xa0(0x10)
	Struct FString                                               AutogeneratedDefaultValue;                         // 0xb0(0x10)
	Class Object*                                                DefaultObject;                                     // 0xc0(0x8)
	Struct FText                                                 DefaultTextValue;                                  // 0xc8(0x38)
	TArray<class EdGraphPin*>                                    LinkedTo;                                          // 0x100(0x10)
	TArray<class EdGraphPin*>                                    SubPins;                                           // 0x110(0x10)
	Class EdGraphPin*                                            ParentPin;                                         // 0x120(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EngineBaseTypes: public Object
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class DamageType: public Object
{
public:
	bool                                                         bCausedByWorld;                                    // 0x28(0x1)
	bool                                                         bScaleMomentumByMass;                              // 0x28(0x1)
	char                                                         pad0x3_E9JQB[0x3];                                 // 0x29(0x3)
	float                                                        DamageImpulse;                                     // 0x2c(0x4)
	bool                                                         bRadialDamageVelChange;                            // 0x30(0x1)
	char                                                         pad0x3_IV45F[0x3];                                 // 0x31(0x3)
	float                                                        DestructibleImpulse;                               // 0x34(0x4)
	float                                                        DestructibleDamageSpreadScale;                     // 0x38(0x4)
	float                                                        DamageFalloff;                                     // 0x3c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EngineTypes: public Object
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class BlueprintCore: public Object
{
public:
	class                                                        SkeletonGeneratedClass;                            // 0x28(0x8)
	class                                                        GeneratedClass;                                    // 0x30(0x8)
	bool                                                         bLegacyNeedToPurgeSkelRefs;                        // 0x38(0x1)
	bool                                                         bLegacyGeneratedClassIsAuthoritative;              // 0x39(0x1)
	char                                                         pad0x2_VVXTJ[0x2];                                 // 0x3a(0x2)
	Struct Guid                                                  BlueprintGuid;                                     // 0x3c(0x10)
	char                                                         pad0x4_1L3EZ[0x4];                                 // 0x4c(0x4)
};


// Size 0x88 (Full Size[0xd8] - InheritedSize[0x50]
class Blueprint: public BlueprintCore
{
public:
	bool                                                         bRecompileOnLoad;                                  // 0x50(0x1)
	char                                                         pad0x7_6JCVI[0x7];                                 // 0x51(0x7)
	class                                                        ParentClass;                                       // 0x58(0x8)
	Class Object*                                                PRIVATE_InnermostPreviousCDO;                      // 0x60(0x8)
	bool                                                         bHasBeenRegenerated;                               // 0x68(0x1)
	bool                                                         bIsRegeneratingOnLoad;                             // 0x68(0x1)
	char                                                         pad0x7_VYGPA[0x7];                                 // 0x69(0x7)
	Class SimpleConstructionScript*                              SimpleConstructionScript;                          // 0x70(0x8)
	TArray<class ActorComponent*>                                ComponentTemplates;                                // 0x78(0x10)
	TArray<class TimelineTemplate*>                              Timelines;                                         // 0x88(0x10)
	Class InheritableComponentHandler*                           InheritableComponentHandler;                       // 0x98(0x8)
	byte                                                         BlueprintType;                                     // 0xa0(0x1)
	char                                                         pad0x3_12JD6[0x3];                                 // 0xa1(0x3)
	int                                                          BlueprintSystemVersion;                            // 0xa4(0x4)
	char                                                         pad0x30_RJZL6[0x30];                               // 0xa8(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_AssetUserData: public Interface
{
public:
};


// Size 0x20 (Full Size[0x300] - InheritedSize[0x2e0]
class ChildActorComponent: public SceneComponent
{
public:
	class                                                        ChildActorClass;                                   // 0x2e0(0x8)
	Class Actor*                                                 ChildActor;                                        // 0x2e8(0x8)
	char                                                         pad0x10_WSI01[0x10];                               // 0x2f0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TestInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DerivedTestInterface: public TestInterface
{
public:
};


// Size 0x8 (Full Size[0xd0] - InheritedSize[0xc8]
class ComponentWithDerivedTestInterface: public ActorComponent
{
public:
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class ActorWithComponentWithDerivedTestInterface: public Actor
{
public:
	Class ComponentWithDerivedTestInterface*                     ComponentWithDerivedTestInterface;                 // 0x3c8(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class ActorWithTestInterface: public Actor
{
public:
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class AmbientSound: public Actor
{
public:
	Class AudioComponent*                                        AudioComponent;                                    // 0x3c8(0x8)
};


// Size 0x58 (Full Size[0x420] - InheritedSize[0x3c8]
class AutomaticInstancingActor: public Actor
{
public:
	Class SceneComponent*                                        DummyRoot;                                         // 0x3c8(0x8)
	char                                                         pad0x50_FI7RY[0x50];                               // 0x3d0(0x50)
};


// Size 0xd8 (Full Size[0x100] - InheritedSize[0x28]
class PendingNetGame: public Object
{
public:
	char                                                         pad0x8_GSS4E[0x8];                                 // 0x28(0x8)
	Class NetDriver*                                             NetDriver;                                         // 0x30(0x8)
	char                                                         pad0xb0_4SDDW[0xb0];                               // 0x38(0xb0)
	Class Package*                                               PreLoadedMapPackage;                               // 0xe8(0x8)
	Class World*                                                 PreLoadedWorld;                                    // 0xf0(0x8)
	char                                                         pad0x8_456NG[0x8];                                 // 0xf8(0x8)
};


// Size 0x7a0 (Full Size[0x7c8] - InheritedSize[0x28]
class World: public Object
{
public:
	char                                                         pad0x8_PWQ6K[0x8];                                 // 0x28(0x8)
	Class Level*                                                 PersistentLevel;                                   // 0x30(0x8)
	Class NetDriver*                                             NetDriver;                                         // 0x38(0x8)
	Class LineBatchComponent*                                    LineBatcher;                                       // 0x40(0x8)
	Class LineBatchComponent*                                    PersistentLineBatcher;                             // 0x48(0x8)
	Class LineBatchComponent*                                    ForegroundLineBatcher;                             // 0x50(0x8)
	Class GameState*                                             GameState;                                         // 0x58(0x8)
	Class GameNetworkManager*                                    NetworkManager;                                    // 0x60(0x8)
	Class PhysicsCollisionHandler*                               PhysicsCollisionHandler;                           // 0x68(0x8)
	TArray<class Object*>                                        ExtraReferencedObjects;                            // 0x70(0x10)
	TArray<class Object*>                                        PerModuleDataObjects;                              // 0x80(0x10)
	TArray<class LevelStreaming*>                                StreamingLevels;                                   // 0x90(0x10)
	Struct FString                                               StreamingLevelsPrefix;                             // 0xa0(0x10)
	Class Level*                                                 CurrentLevelPendingVisibility;                     // 0xb0(0x8)
	Class ParticleEventManager*                                  MyParticleEventManager;                            // 0xb8(0x8)
	Class PhysicsVolume*                                         DefaultPhysicsVolume;                              // 0xc0(0x8)
	TArray<class LevelStreaming*>                                DirtyStreamingLevels;                              // 0xc8(0x10)
	char                                                         pad0x1c_AWRRP[0x1c];                               // 0xd8(0x1c)
	struct FName                                                 Feature;                                           // 0xf4(0x8)
	char                                                         pad0x4_FTECJ[0x4];                                 // 0xfc(0x4)
	TArray<struct FName>                                         FeatureReferences;                                 // 0x100(0x10)
	bool                                                         ParticleLOD_bUseGameThread;                        // 0x110(0x1)
	bool                                                         ParticleLOD_bUseMultipleViewportCase;              // 0x111(0x1)
	char                                                         pad0x2_42MZ2[0x2];                                 // 0x112(0x2)
	Struct Vector                                                ParticleLOD_PlayerViewpointLocation;               // 0x114(0xc)
	Struct FString                                               TestMetadata;                                      // 0x120(0x10)
	Class NavigationSystem*                                      NavigationSystem;                                  // 0x130(0x8)
	Class GameMode*                                              AuthorityGameMode;                                 // 0x138(0x8)
	Class AISystemBase*                                          AISystem;                                          // 0x140(0x8)
	Class AvoidanceManager*                                      AvoidanceManager;                                  // 0x148(0x8)
	TArray<class Level*>                                         Levels;                                            // 0x150(0x10)
	char                                                         pad0x50_OE8K8[0x50];                               // 0x160(0x50)
	Class Level*                                                 CurrentLevel;                                      // 0x1b0(0x8)
	char                                                         pad0x8_F2QY3[0x8];                                 // 0x1b8(0x8)
	Class GameInstance*                                          OwningGameInstance;                                // 0x1c0(0x8)
	TArray<class MaterialParameterCollectionInstance*>           ParameterCollectionInstances;                      // 0x1c8(0x10)
	char                                                         pad0x520_OFK55[0x520];                             // 0x1d8(0x520)
	Class WorldComposition*                                      WorldComposition;                                  // 0x6f8(0x8)
	char                                                         pad0x3d_H8MUM[0x3d];                               // 0x700(0x3d)
	bool                                                         bAreConstraintsDirty;                              // 0x73d(0x1)
	char                                                         pad0x8a_GQHAO[0x8a];                               // 0x73e(0x8a)
};


// Size 0x2d8 (Full Size[0x300] - InheritedSize[0x28]
class Level: public Object
{
public:
	char                                                         pad0xa0_GFGSN[0xa0];                               // 0x28(0xa0)
	Class LevelActorContainer*                                   ActorCluster;                                      // 0xc8(0x8)
	Class World*                                                 OwningWorld;                                       // 0xd0(0x8)
	Class Model*                                                 Model;                                             // 0xd8(0x8)
	TArray<class ModelComponent*>                                ModelComponents;                                   // 0xe0(0x10)
	Class LevelScriptActor*                                      LevelScriptActor;                                  // 0xf0(0x8)
	Class NavigationObjectBase*                                  NavListStart;                                      // 0xf8(0x8)
	Class NavigationObjectBase*                                  NavListEnd;                                        // 0x100(0x8)
	TArray<class NavigationDataChunk*>                           NavDataChunks;                                     // 0x108(0x10)
	float                                                        LightmapTotalSize;                                 // 0x118(0x4)
	float                                                        ShadowmapTotalSize;                                // 0x11c(0x4)
	TArray<struct StaticNavigableGeometry>                       StaticNavigableGeometry;                           // 0x120(0x10)
	char                                                         pad0x130_GRTZ0[0x130];                             // 0x130(0x130)
	bool                                                         LevelVisibility;                                   // 0x260(0x1)
	char                                                         pad0xf_7OTWY[0xf];                                 // 0x261(0xf)
	bool                                                         Blocked;                                           // 0x270(0x1)
	char                                                         pad0x67_D6OZU[0x67];                               // 0x271(0x67)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x2d8(0x10)
	char                                                         pad0x18_41GXE[0x18];                               // 0x2e8(0x18)
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class BrushShape: public Brush
{
public:
};


// Size 0x50 (Full Size[0x450] - InheritedSize[0x400]
class AudioVolume: public Volume
{
public:
	float                                                        Priority;                                          // 0x400(0x4)
	bool                                                         bEnabled;                                          // 0x404(0x1)
	char                                                         pad0x3_P8RAD[0x3];                                 // 0x405(0x3)
	Struct ReverbSettings                                        Settings;                                          // 0x408(0x18)
	Struct InteriorSettings                                      AmbientZoneSettings;                               // 0x420(0x24)
	char                                                         pad0x4_H2R5T[0x4];                                 // 0x444(0x4)
	Class AudioVolume*                                           NextLowerPriorityVolume;                           // 0x448(0x8)
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class CameraBlockingVolume: public Volume
{
public:
};


// Size 0x18 (Full Size[0x418] - InheritedSize[0x400]
class CullDistanceVolume: public Volume
{
public:
	TArray<struct CullDistances>                                 CullDistances;                                     // 0x400(0x10)
	bool                                                         bEnabled;                                          // 0x410(0x1)
	char                                                         pad0x7_9WJS4[0x7];                                 // 0x411(0x7)
};


// Size 0x10 (Full Size[0x410] - InheritedSize[0x400]
class FFTWater: public Volume
{
public:
	Class FFTWaterComponent*                                     FFTWaterComponent;                                 // 0x400(0x8)
	Class FFTWaterExtendedPlaneComponent*                        ExtendedPlaneComponent;                            // 0x408(0x8)
};


// Size 0x18 (Full Size[0x418] - InheritedSize[0x400]
class LevelStreamingVolume: public Volume
{
public:
	TArray<struct FName>                                         StreamingLevelNames;                               // 0x400(0x10)
	bool                                                         bEditorPreVisOnly;                                 // 0x410(0x1)
	bool                                                         bDisabled;                                         // 0x410(0x1)
	char                                                         pad0x3_EGTYP[0x3];                                 // 0x411(0x3)
	byte                                                         StreamingUsage;                                    // 0x414(0x1)
	char                                                         pad0x3_XSBRU[0x3];                                 // 0x415(0x3)
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class LightmassCharacterIndirectDetailVolume: public Volume
{
public:
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class LightmassImportanceVolume: public Volume
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavigationTypes: public Object
{
public:
};


// Size 0x10 (Full Size[0x410] - InheritedSize[0x400]
class NavMeshBoundsVolume: public Volume
{
public:
	Struct NavAgentSelector                                      SupportedAgents;                                   // 0x400(0x4)
	struct FName                                                 OriginatingLevelName;                              // 0x404(0x8)
	char                                                         pad0x4_R4OBJ[0x4];                                 // 0x40c(0x4)
};


// Size 0x0 (Full Size[0x410] - InheritedSize[0x410]
class InstancedNavMeshBoundsVolume: public NavMeshBoundsVolume
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class NavArea: public Object
{
public:
	float                                                        DefaultCost;                                       // 0x28(0x4)
	float                                                        FixedAreaEnteringCost;                             // 0x2c(0x4)
	Struct Color                                                 DrawColor;                                         // 0x30(0x4)
	Struct NavAgentSelector                                      SupportedAgents;                                   // 0x34(0x4)
	bool                                                         bSupportsAgent0;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent1;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent2;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent3;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent4;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent5;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent6;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent7;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent8;                                   // 0x39(0x1)
	bool                                                         bSupportsAgent9;                                   // 0x39(0x1)
	bool                                                         bSupportsAgent10;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent11;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent12;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent13;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent14;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent15;                                  // 0x39(0x1)
	char                                                         pad0x6_QS8QQ[0x6];                                 // 0x3a(0x6)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavRelevantInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x410] - InheritedSize[0x400]
class NavModifierVolume: public Volume
{
public:
	char                                                         pad0x8_CSUT7[0x8];                                 // 0x400(0x8)
	class                                                        AreaClass;                                         // 0x408(0x8)
};


// Size 0x0 (Full Size[0x410] - InheritedSize[0x410]
class DefaultPhysicsVolume: public PhysicsVolume
{
public:
};


// Size 0x0 (Full Size[0x410] - InheritedSize[0x410]
class KillZVolume: public PhysicsVolume
{
public:
};


// Size 0x28 (Full Size[0x438] - InheritedSize[0x410]
class PainCausingVolume: public PhysicsVolume
{
public:
	bool                                                         bPainCausing;                                      // 0x410(0x1)
	char                                                         pad0x3_K8S5T[0x3];                                 // 0x411(0x3)
	float                                                        DamagePerSec;                                      // 0x414(0x4)
	class                                                        DamageType;                                        // 0x418(0x8)
	float                                                        PainInterval;                                      // 0x420(0x4)
	bool                                                         bEntryPain;                                        // 0x424(0x1)
	bool                                                         BACKUP_bPainCausing;                               // 0x424(0x1)
	char                                                         pad0x3_AC9CX[0x3];                                 // 0x425(0x3)
	Class Controller*                                            DamageInstigator;                                  // 0x428(0x8)
	char                                                         pad0x8_9E22T[0x8];                                 // 0x430(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlendableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Scene: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_PostProcessVolume: public Interface
{
public:
};


// Size 0x560 (Full Size[0x960] - InheritedSize[0x400]
class PostProcessVolume: public Volume
{
public:
	char                                                         pad0x10_SHZ6P[0x10];                               // 0x400(0x10)
	Struct PostProcessSettings                                   Settings;                                          // 0x410(0x540)
	float                                                        Priority;                                          // 0x950(0x4)
	float                                                        BlendRadius;                                       // 0x954(0x4)
	float                                                        BlendWeight;                                       // 0x958(0x4)
	bool                                                         bEnabled;                                          // 0x95c(0x1)
	bool                                                         bUnbound;                                          // 0x95c(0x1)
	char                                                         pad0x3_B7ZRI[0x3];                                 // 0x95d(0x3)
};


// Size 0x30 (Full Size[0x430] - InheritedSize[0x400]
class PrecomputedVisibilityOverrideVolume: public Volume
{
public:
	TArray<class Actor*>                                         OverrideVisibleActors;                             // 0x400(0x10)
	TArray<class Actor*>                                         OverrideInvisibleActors;                           // 0x410(0x10)
	TArray<struct FName>                                         OverrideInvisibleLevels;                           // 0x420(0x10)
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class PrecomputedVisibilityVolume: public Volume
{
public:
};


// Size 0x0 (Full Size[0x400] - InheritedSize[0x400]
class TriggerVolume: public Volume
{
public:
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class CalmWaterZone: public Actor
{
public:
	Class CalmWaterComponent*                                    CalmWaterComponent;                                // 0x3c8(0x8)
};


// Size 0x568 (Full Size[0x930] - InheritedSize[0x3c8]
class CameraActor: public Actor
{
public:
	byte                                                         AutoActivateForPlayer;                             // 0x3c8(0x1)
	char                                                         pad0x7_Z872Y[0x7];                                 // 0x3c9(0x7)
	Class CameraComponent*                                       CameraComponent;                                   // 0x3d0(0x8)
	char                                                         pad0x8_7XGF5[0x8];                                 // 0x3d8(0x8)
	bool                                                         bConstrainAspectRatio;                             // 0x3e0(0x1)
	char                                                         pad0x3_KKIF7[0x3];                                 // 0x3e1(0x3)
	float                                                        AspectRatio;                                       // 0x3e4(0x4)
	float                                                        FOVAngle;                                          // 0x3e8(0x4)
	float                                                        PostProcessBlendWeight;                            // 0x3ec(0x4)
	Struct PostProcessSettings                                   PostProcessSettings;                               // 0x3f0(0x540)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class ClientOnlyTestActor: public Actor
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavAgentInterface: public Interface
{
public:
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class CameraShake: public Object
{
public:
	bool                                                         bSingleInstance;                                   // 0x28(0x1)
	char                                                         pad0x3_QCIKT[0x3];                                 // 0x29(0x3)
	float                                                        OscillationDuration;                               // 0x2c(0x4)
	float                                                        OscillationBlendInTime;                            // 0x30(0x4)
	float                                                        OscillationBlendOutTime;                           // 0x34(0x4)
	Struct ROscillator                                           RotOscillation;                                    // 0x38(0x24)
	Struct VOscillator                                           LocOscillation;                                    // 0x5c(0x24)
	Struct FOscillator                                           FOVOscillation;                                    // 0x80(0xc)
	float                                                        AnimPlayRate;                                      // 0x8c(0x4)
	float                                                        AnimScale;                                         // 0x90(0x4)
	float                                                        AnimBlendInTime;                                   // 0x94(0x4)
	float                                                        AnimBlendOutTime;                                  // 0x98(0x4)
	float                                                        RandomAnimSegmentDuration;                         // 0x9c(0x4)
	Class CameraAnim*                                            Anim;                                              // 0xa0(0x8)
	bool                                                         bRandomAnimSegment;                                // 0xa8(0x1)
	char                                                         pad0x17_O4SBA[0x17];                               // 0xa9(0x17)
	Class PlayerCameraManager*                                   CameraOwner;                                       // 0xc0(0x8)
	char                                                         pad0x68_PF5CN[0x68];                               // 0xc8(0x68)
	float                                                        ShakeScale;                                        // 0x130(0x4)
	float                                                        OscillatorTimeRemaining;                           // 0x134(0x4)
	Class CameraAnimInst*                                        AnimInst;                                          // 0x138(0x8)
};


// Size 0x1888 (Full Size[0x1c50] - InheritedSize[0x3c8]
class PlayerCameraManager: public Actor
{
public:
	Class PlayerController*                                      PCOwner;                                           // 0x3c8(0x8)
	Class SceneComponent*                                        TransformComponent;                                // 0x3d0(0x8)
	char                                                         pad0x8_O8CLN[0x8];                                 // 0x3d8(0x8)
	float                                                        DefaultFOV;                                        // 0x3e0(0x4)
	char                                                         pad0x4_SV83W[0x4];                                 // 0x3e4(0x4)
	float                                                        DefaultOrthoWidth;                                 // 0x3e8(0x4)
	char                                                         pad0x4_51WC1[0x4];                                 // 0x3ec(0x4)
	float                                                        DefaultAspectRatio;                                // 0x3f0(0x4)
	char                                                         pad0x4c_MLBH2[0x4c];                               // 0x3f4(0x4c)
	Struct CameraCacheEntry                                      CameraCache;                                       // 0x440(0x5b0)
	Struct CameraCacheEntry                                      LastFrameCameraCache;                              // 0x9f0(0x5b0)
	Struct TViewTarget                                           ViewTarget;                                        // 0xfa0(0x5c0)
	Struct TViewTarget                                           PendingViewTarget;                                 // 0x1560(0x5c0)
	char                                                         pad0x18_EZ0UD[0x18];                               // 0x1b20(0x18)
	TArray<class CameraModifier*>                                ModifierList;                                      // 0x1b38(0x10)
	TArray<class Class*>                                         DefaultModifiers;                                  // 0x1b48(0x10)
	float                                                        FreeCamDistance;                                   // 0x1b58(0x4)
	Struct Vector                                                FreeCamOffset;                                     // 0x1b5c(0xc)
	Struct Vector                                                ViewTargetOffset;                                  // 0x1b68(0xc)
	char                                                         pad0x14_L1G6K[0x14];                               // 0x1b74(0x14)
	TArray<class EmitterCameraLensEffectBase*>                   CameraLensEffects;                                 // 0x1b88(0x10)
	Class CameraModifier_CameraShake*                            CachedCameraShakeMod;                              // 0x1b98(0x8)
	Class CameraAnimInst*                                        AnimInstPool;                                      // 0x1ba0(0x8)
	char                                                         pad0x38_TJ9VH[0x38];                               // 0x1ba8(0x38)
	TArray<struct PostProcessBlendCache>                         PostProcessBlendCache;                             // 0x1be0(0x10)
	char                                                         pad0x10_3DQYD[0x10];                               // 0x1bf0(0x10)
	TArray<class CameraAnimInst*>                                ActiveAnims;                                       // 0x1c00(0x10)
	TArray<class CameraAnimInst*>                                FreeAnims;                                         // 0x1c10(0x10)
	Class CameraActor*                                           AnimCameraActor;                                   // 0x1c20(0x8)
	bool                                                         bIsOrthographic;                                   // 0x1c28(0x1)
	bool                                                         bUseClientSideCameraUpdates;                       // 0x1c28(0x1)
	bool                                                         bFollowHmdOrientation;                             // 0x1c29(0x1)
	char                                                         pad0x2_7CX1Z[0x2];                                 // 0x1c2a(0x2)
	float                                                        ViewPitchMin;                                      // 0x1c2c(0x4)
	float                                                        ViewPitchMax;                                      // 0x1c30(0x4)
	float                                                        ViewYawMin;                                        // 0x1c34(0x4)
	float                                                        ViewYawMax;                                        // 0x1c38(0x4)
	float                                                        ViewRollMin;                                       // 0x1c3c(0x4)
	float                                                        ViewRollMax;                                       // 0x1c40(0x4)
	char                                                         pad0xc_AKRDR[0xc];                                 // 0x1c44(0xc)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class CurveBase: public Object
{
public:
};


// Size 0x80 (Full Size[0xb0] - InheritedSize[0x30]
class CurveFloat: public CurveBase
{
public:
	Struct RichCurve                                             FloatCurve;                                        // 0x30(0x78)
	bool                                                         bIsEventCurve;                                     // 0xa8(0x1)
	char                                                         pad0x7_6G54T[0x7];                                 // 0xa9(0x7)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ForceFeedbackEffect: public Object
{
public:
	TArray<struct ChannelDetails>                                ChannelDetails;                                    // 0x28(0x10)
	float                                                        Duration;                                          // 0x38(0x4)
	char                                                         pad0x4_UWQ7W[0x4];                                 // 0x3c(0x4)
};


// Size 0x18 (Full Size[0x7d8] - InheritedSize[0x7c0]
class LogVisualizerCameraController: public DebugCameraController
{
public:
	Class Actor*                                                 PickedActor;                                       // 0x7c0(0x8)
	char                                                         pad0x10_NTFAB[0x10];                               // 0x7c8(0x10)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class DecalActor: public Actor
{
public:
	Class DecalComponent*                                        Decal;                                             // 0x3c8(0x8)
};


// Size 0x20 (Full Size[0x3e8] - InheritedSize[0x3c8]
class DestructibleActor: public Actor
{
public:
	Class DestructibleComponent*                                 DestructibleComponent;                             // 0x3c8(0x8)
	bool                                                         bAffectNavigation;                                 // 0x3d0(0x1)
	char                                                         pad0x7_047BF[0x7];                                 // 0x3d1(0x7)
	char                                                         pad0x10_VTK76[0x10];                               // 0x3d8(0x10)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class DocumentationActor: public Actor
{
public:
};


// Size 0x50 (Full Size[0x418] - InheritedSize[0x3c8]
class Emitter: public Actor
{
public:
	Class ParticleSystemComponent*                               ParticleSystemComponent;                           // 0x3c8(0x8)
	bool                                                         bDestroyOnSystemFinish;                            // 0x3d0(0x1)
	bool                                                         bPostUpdateTickGroup;                              // 0x3d0(0x1)
	bool                                                         bCurrentlyActive;                                  // 0x3d0(0x1)
	char                                                         pad0x7_DFVFB[0x7];                                 // 0x3d1(0x7)
	char                                                         pad0x40_JLVVK[0x40];                               // 0x3d8(0x40)
};


// Size 0x38 (Full Size[0x450] - InheritedSize[0x418]
class EmitterCameraLensEffectBase: public Emitter
{
public:
	Class ParticleSystem*                                        PS_CameraEffect;                                   // 0x418(0x8)
	Class ParticleSystem*                                        PS_CameraEffectNonExtremeContent;                  // 0x420(0x8)
	float                                                        BaseFOV;                                           // 0x428(0x4)
	float                                                        DistFromCamera;                                    // 0x42c(0x4)
	bool                                                         bAllowMultipleInstances;                           // 0x430(0x1)
	char                                                         pad0x7_MOLC1[0x7];                                 // 0x431(0x7)
	TArray<class Class*>                                         EmittersToTreatAsSame;                             // 0x438(0x10)
	Class PlayerCameraManager*                                   BaseCamera;                                        // 0x448(0x8)
};


// Size 0x0 (Full Size[0x4c0] - InheritedSize[0x4c0]
class DebugCameraHUD: public HUD
{
public:
};


// Size 0x28 (Full Size[0x4e8] - InheritedSize[0x4c0]
class LogVisualizerHUD: public DebugCameraHUD
{
public:
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class AtmosphericFog: public Info
{
public:
	Class AtmosphericFogComponent*                               AtmosphericFogComponent;                           // 0x3c8(0x8)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class ExponentialHeightFog: public Info
{
public:
	Class ExponentialHeightFogComponent*                         Component;                                         // 0x3c8(0x8)
	bool                                                         bEnabled;                                          // 0x3d0(0x1)
	char                                                         pad0x7_GIS7K[0x7];                                 // 0x3d1(0x7)
};


// Size 0x28 (Full Size[0x3f0] - InheritedSize[0x3c8]
class NavigationObjectBase: public Actor
{
public:
	char                                                         pad0x8_7DM0H[0x8];                                 // 0x3c8(0x8)
	Class CapsuleComponent*                                      CapsuleComponent;                                  // 0x3d0(0x8)
	Class BillboardComponent*                                    GoodSprite;                                        // 0x3d8(0x8)
	Class BillboardComponent*                                    BadSprite;                                         // 0x3e0(0x8)
	bool                                                         bIsPIEPlayerStart;                                 // 0x3e8(0x1)
	char                                                         pad0x7_UINQP[0x7];                                 // 0x3e9(0x7)
};


// Size 0x8 (Full Size[0x3f8] - InheritedSize[0x3f0]
class PlayerStart: public NavigationObjectBase
{
public:
	struct FName                                                 PlayerStartTag;                                    // 0x3f0(0x8)
};


// Size 0x70 (Full Size[0x438] - InheritedSize[0x3c8]
class GameNetworkManager: public Info
{
public:
	int                                                          AdjustedNetSpeed;                                  // 0x3c8(0x4)
	float                                                        LastNetSpeedUpdateTime;                            // 0x3cc(0x4)
	int                                                          TotalNetBandwidth;                                 // 0x3d0(0x4)
	int                                                          MinDynamicBandwidth;                               // 0x3d4(0x4)
	int                                                          MaxDynamicBandwidth;                               // 0x3d8(0x4)
	bool                                                         bIsStandbyCheckingEnabled;                         // 0x3dc(0x1)
	bool                                                         bHasStandbyCheatTriggered;                         // 0x3dc(0x1)
	char                                                         pad0x3_R7M23[0x3];                                 // 0x3dd(0x3)
	float                                                        StandbyRxCheatTime;                                // 0x3e0(0x4)
	float                                                        StandbyTxCheatTime;                                // 0x3e4(0x4)
	int                                                          BadPingThreshold;                                  // 0x3e8(0x4)
	float                                                        PercentMissingForRxStandby;                        // 0x3ec(0x4)
	float                                                        PercentMissingForTxStandby;                        // 0x3f0(0x4)
	float                                                        PercentForBadPing;                                 // 0x3f4(0x4)
	float                                                        JoinInProgressStandbyWaitTime;                     // 0x3f8(0x4)
	float                                                        MoveRepSize;                                       // 0x3fc(0x4)
	float                                                        MAXPOSITIONERRORSQUARED;                           // 0x400(0x4)
	float                                                        MAXNEARZEROVELOCITYSQUARED;                        // 0x404(0x4)
	float                                                        CLIENTADJUSTUPDATECOST;                            // 0x408(0x4)
	float                                                        MAXCLIENTUPDATEINTERVAL;                           // 0x40c(0x4)
	float                                                        MaxMoveDeltaTime;                                  // 0x410(0x4)
	bool                                                         ClientAuthorativePosition;                         // 0x414(0x1)
	char                                                         pad0x3_GD4AX[0x3];                                 // 0x415(0x3)
	float                                                        ClientErrorUpdateRateLimit;                        // 0x418(0x4)
	bool                                                         bMovementTimeDiscrepancyDetection;                 // 0x41c(0x1)
	bool                                                         bMovementTimeDiscrepancyResolution;                // 0x41d(0x1)
	char                                                         pad0x2_JV38L[0x2];                                 // 0x41e(0x2)
	float                                                        MovementTimeDiscrepancyMaxTimeMargin;              // 0x420(0x4)
	float                                                        MovementTimeDiscrepancyMinTimeMargin;              // 0x424(0x4)
	float                                                        MovementTimeDiscrepancyResolutionRate;             // 0x428(0x4)
	float                                                        MovementTimeDiscrepancyDriftAllowance;             // 0x42c(0x4)
	bool                                                         bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x430(0x1)
	bool                                                         bUseDistanceBasedRelevancy;                        // 0x431(0x1)
	char                                                         pad0x6_CHY71[0x6];                                 // 0x432(0x6)
};


// Size 0x30 (Full Size[0x3f8] - InheritedSize[0x3c8]
class GameSession: public Info
{
public:
	int                                                          MaxSpectators;                                     // 0x3c8(0x4)
	int                                                          MaxPlayers;                                        // 0x3cc(0x4)
	byte                                                         MaxSplitscreensPerConnection;                      // 0x3d0(0x1)
	bool                                                         bRequiresPushToTalk;                               // 0x3d1(0x1)
	char                                                         pad0x2_92X8H[0x2];                                 // 0x3d2(0x2)
	struct FName                                                 SessionName;                                       // 0x3d4(0x8)
	char                                                         pad0x1c_SBYWW[0x1c];                               // 0x3dc(0x1c)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class SkyLight: public Info
{
public:
	Class SkyLightComponent*                                     LightComponent;                                    // 0x3c8(0x8)
	bool                                                         bEnabled;                                          // 0x3d0(0x1)
	char                                                         pad0x7_HGLLD[0x7];                                 // 0x3d1(0x7)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class WindDirectionalSource: public Info
{
public:
	Class WindDirectionalSourceComponent*                        Component;                                         // 0x3c8(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class LevelBounds: public Actor
{
public:
	bool                                                         bAutoUpdateBounds;                                 // 0x3c8(0x1)
	char                                                         pad0x7_GP7VN[0x7];                                 // 0x3c9(0x7)
};


// Size 0x30 (Full Size[0x310] - InheritedSize[0x2e0]
class LightComponentBase: public SceneComponent
{
public:
	Struct Guid                                                  LightGuid;                                         // 0x2e0(0x10)
	float                                                        Brightness;                                        // 0x2f0(0x4)
	float                                                        Intensity;                                         // 0x2f4(0x4)
	Struct Color                                                 LightColor;                                        // 0x2f8(0x4)
	bool                                                         bAffectsWorld;                                     // 0x2fc(0x1)
	bool                                                         CastShadows;                                       // 0x2fc(0x1)
	bool                                                         CastStaticShadows;                                 // 0x2fc(0x1)
	bool                                                         CastDynamicShadows;                                // 0x2fc(0x1)
	bool                                                         bAffectTranslucentLighting;                        // 0x2fc(0x1)
	bool                                                         bPrecomputedLightingIsValid;                       // 0x2fc(0x1)
	bool                                                         RainOcclusion;                                     // 0x2fc(0x1)
	char                                                         pad0x3_5Q9XI[0x3];                                 // 0x2fd(0x3)
	float                                                        IndirectLightingIntensity;                         // 0x300(0x4)
	float                                                        ScaleForTranslucency;                              // 0x304(0x4)
	float                                                        CapForTranslucency;                                // 0x308(0x4)
	char                                                         pad0x4_2YWUM[0x4];                                 // 0x30c(0x4)
};


// Size 0x160 (Full Size[0x470] - InheritedSize[0x310]
class LightComponent: public LightComponentBase
{
public:
	float                                                        Temperature;                                       // 0x310(0x4)
	bool                                                         bUseTemperature;                                   // 0x314(0x1)
	char                                                         pad0x3_XKJKE[0x3];                                 // 0x315(0x3)
	int                                                          ShadowMapChannel;                                  // 0x318(0x4)
	char                                                         pad0x4_N6RGF[0x4];                                 // 0x31c(0x4)
	float                                                        SourceRadius;                                      // 0x320(0x4)
	float                                                        MinRoughness;                                      // 0x324(0x4)
	float                                                        ShadowBias;                                        // 0x328(0x4)
	float                                                        ShadowSharpen;                                     // 0x32c(0x4)
	float                                                        ShadowResMaxDynamicDegradation;                    // 0x330(0x4)
	bool                                                         InverseSquaredFalloff;                             // 0x334(0x1)
	bool                                                         CastTranslucentShadows;                            // 0x334(0x1)
	bool                                                         bCastShadowsFromCinematicObjectsOnly;              // 0x334(0x1)
	bool                                                         bAffectDynamicIndirectLighting;                    // 0x334(0x1)
	char                                                         pad0x3_X0I4F[0x3];                                 // 0x335(0x3)
	Class MaterialInterface*                                     LightFunctionMaterial;                             // 0x338(0x8)
	Struct Vector                                                LightFunctionScale;                                // 0x340(0xc)
	char                                                         pad0x4_LWPQA[0x4];                                 // 0x34c(0x4)
	Class TextureLightProfile*                                   IESTexture;                                        // 0x350(0x8)
	bool                                                         bUseIESBrightness;                                 // 0x358(0x1)
	char                                                         pad0x3_DO7DO[0x3];                                 // 0x359(0x3)
	float                                                        IESBrightnessScale;                                // 0x35c(0x4)
	float                                                        LightFunctionFadeDistance;                         // 0x360(0x4)
	float                                                        DisabledBrightness;                                // 0x364(0x4)
	bool                                                         bEnableLightShaftBloom;                            // 0x368(0x1)
	char                                                         pad0x3_EG5L6[0x3];                                 // 0x369(0x3)
	float                                                        BloomScale;                                        // 0x36c(0x4)
	float                                                        BloomThreshold;                                    // 0x370(0x4)
	Struct Color                                                 BloomTint;                                         // 0x374(0x4)
	bool                                                         bUseRayTracedDistanceFieldShadows;                 // 0x378(0x1)
	char                                                         pad0x3_UN8Q0[0x3];                                 // 0x379(0x3)
	float                                                        RayStartOffsetDepthScale;                          // 0x37c(0x4)
	char                                                         pad0xf0_7E4CY[0xf0];                               // 0x380(0xf0)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class Light: public Actor
{
public:
	Class LightComponent*                                        LightComponent;                                    // 0x3c8(0x8)
};


// Size 0x8 (Full Size[0x3d8] - InheritedSize[0x3d0]
class AmbientLightSource: public Light
{
public:
	Class AmbientLightSourceComponent*                           AmbientLightSourceComponent;                       // 0x3d0(0x8)
};


// Size 0x0 (Full Size[0x3d0] - InheritedSize[0x3d0]
class DirectionalLight: public Light
{
public:
};


// Size 0x8 (Full Size[0x3d8] - InheritedSize[0x3d0]
class PointLight: public Light
{
public:
	Class PointLightComponent*                                   PointLightComponent;                               // 0x3d0(0x8)
};


// Size 0x8 (Full Size[0x3d8] - InheritedSize[0x3d0]
class SpotLight: public Light
{
public:
	Class SpotLightComponent*                                    SpotLightComponent;                                // 0x3d0(0x8)
};


// Size 0x0 (Full Size[0x3d8] - InheritedSize[0x3d8]
class GeneratedMeshAreaLight: public SpotLight
{
public:
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class LODActor: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x3c8(0x8)
	TArray<class Actor*>                                         SubActors;                                         // 0x3d0(0x10)
	float                                                        LODDrawDistance;                                   // 0x3e0(0x4)
	int                                                          LodLevel;                                          // 0x3e4(0x4)
	TArray<class Object*>                                        SubObjects;                                        // 0x3e8(0x10)
	char                                                         pad0x8_KVHCQ[0x8];                                 // 0x3f8(0x8)
};


// Size 0x10 (Full Size[0x3d8] - InheritedSize[0x3c8]
class MaterialInstanceActor: public Actor
{
public:
	TArray<class Actor*>                                         TargetActors;                                      // 0x3c8(0x10)
};


// Size 0x78 (Full Size[0x440] - InheritedSize[0x3c8]
class MatineeActor: public Actor
{
public:
	Class InterpData*                                            MatineeData;                                       // 0x3c8(0x8)
	struct FName                                                 MatineeControllerName;                             // 0x3d0(0x8)
	float                                                        PlayRate;                                          // 0x3d8(0x4)
	bool                                                         bPlayOnLevelLoad;                                  // 0x3dc(0x1)
	bool                                                         bForceStartPos;                                    // 0x3dc(0x1)
	char                                                         pad0x3_QB1PI[0x3];                                 // 0x3dd(0x3)
	float                                                        ForceStartPosition;                                // 0x3e0(0x4)
	bool                                                         bLooping;                                          // 0x3e4(0x1)
	bool                                                         bRewindOnPlay;                                     // 0x3e4(0x1)
	bool                                                         bNoResetOnRewind;                                  // 0x3e4(0x1)
	bool                                                         bRewindIfAlreadyPlaying;                           // 0x3e4(0x1)
	bool                                                         bDisableRadioFilter;                               // 0x3e4(0x1)
	bool                                                         bClientSideOnly;                                   // 0x3e4(0x1)
	bool                                                         bSkipUpdateIfNotVisible;                           // 0x3e4(0x1)
	bool                                                         bIsSkippable;                                      // 0x3e4(0x1)
	char                                                         pad0x3_29U4W[0x3];                                 // 0x3e5(0x3)
	int                                                          PreferredSplitScreenNum;                           // 0x3e8(0x4)
	bool                                                         bDisableMovementInput;                             // 0x3ec(0x1)
	bool                                                         bDisableLookAtInput;                               // 0x3ec(0x1)
	bool                                                         bHidePlayer;                                       // 0x3ec(0x1)
	bool                                                         bHideHud;                                          // 0x3ec(0x1)
	char                                                         pad0x3_XSEPO[0x3];                                 // 0x3ed(0x3)
	TArray<struct GroupActorInfos>                               GroupActorInfos;                                   // 0x3f0(0x10)
	bool                                                         bShouldShowGore;                                   // 0x400(0x1)
	char                                                         pad0x7_QZPQB[0x7];                                 // 0x401(0x7)
	TArray<class InterpGroupInst*>                               GroupInst;                                         // 0x408(0x10)
	TArray<struct CameraCuts>                                    CameraCuts;                                        // 0x418(0x10)
	bool                                                         bIsPlaying;                                        // 0x428(0x1)
	bool                                                         bReversePlayback;                                  // 0x428(0x1)
	bool                                                         bPaused;                                           // 0x428(0x1)
	bool                                                         bPendingStop;                                      // 0x428(0x1)
	char                                                         pad0x3_9R0C5[0x3];                                 // 0x429(0x3)
	float                                                        InterpPosition;                                    // 0x42c(0x4)
	char                                                         pad0x4_G9TMC[0x4];                                 // 0x430(0x4)
	byte                                                         ReplicationForceIsPlaying;                         // 0x434(0x1)
	char                                                         pad0x7_9FASQ[0x7];                                 // 0x435(0x7)
	bool                                                         bServerInitialLevelStreamingComplete;              // 0x43c(0x1)
	char                                                         pad0x3_LOIKK[0x3];                                 // 0x43d(0x3)
};


// Size 0x8 (Full Size[0x448] - InheritedSize[0x440]
class MatineeActorCameraAnim: public MatineeActor
{
public:
	Class CameraAnim*                                            CameraAnim;                                        // 0x440(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class MergedCollisionActor: public Actor
{
public:
	Class MergedCollisionComponent*                              MergedCollisionComponent;                          // 0x3c8(0x8)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class NavigationQueryFilter: public Object
{
public:
	TArray<struct Areas>                                         Areas;                                             // 0x28(0x10)
	Struct NavigationFilterFlags                                 IncludeFlags;                                      // 0x38(0x4)
	Struct NavigationFilterFlags                                 ExcludeFlags;                                      // 0x3c(0x4)
};


// Size 0x1c0 (Full Size[0x588] - InheritedSize[0x3c8]
class NavigationData: public Actor
{
public:
	Class PrimitiveComponent*                                    RenderingComp;                                     // 0x3c8(0x8)
	Struct NavDataConfig                                         NavDataConfig;                                     // 0x3d0(0x58)
	bool                                                         bEnableDrawing;                                    // 0x428(0x1)
	bool                                                         bRebuildAtRuntime;                                 // 0x428(0x1)
	char                                                         pad0x3_IP1X4[0x3];                                 // 0x429(0x3)
	byte                                                         RuntimeGeneration;                                 // 0x42c(0x1)
	char                                                         pad0x3_Q5HWB[0x3];                                 // 0x42d(0x3)
	bool                                                         bForceRebuildOnLoad;                               // 0x430(0x1)
	char                                                         pad0x3_K94FF[0x3];                                 // 0x431(0x3)
	float                                                        ObservedPathsTickInterval;                         // 0x434(0x4)
	char                                                         pad0xe8_FV9O2[0xe8];                               // 0x438(0xe8)
	TArray<struct SupportedAreas>                                SupportedAreas;                                    // 0x520(0x10)
	char                                                         pad0x58_XTG3A[0x58];                               // 0x530(0x58)
};


// Size 0x0 (Full Size[0x588] - InheritedSize[0x588]
class AbstractNavData: public NavigationData
{
public:
};


// Size 0x0 (Full Size[0x588] - InheritedSize[0x588]
class NavigationGraph: public NavigationData
{
public:
};


// Size 0xb0 (Full Size[0x638] - InheritedSize[0x588]
class RecastNavMesh: public NavigationData
{
public:
	bool                                                         bDrawTriangleEdges;                                // 0x588(0x1)
	bool                                                         bDrawPolyEdges;                                    // 0x588(0x1)
	bool                                                         bDrawFilledPolys;                                  // 0x588(0x1)
	bool                                                         bDrawNavMeshEdges;                                 // 0x588(0x1)
	bool                                                         bDrawTileBounds;                                   // 0x588(0x1)
	bool                                                         bDrawPathCollidingGeometry;                        // 0x588(0x1)
	bool                                                         bDrawTileLabels;                                   // 0x588(0x1)
	bool                                                         bDrawPolygonLabels;                                // 0x588(0x1)
	bool                                                         bDrawDefaultPolygonCost;                           // 0x589(0x1)
	bool                                                         bDrawLabelsOnPathNodes;                            // 0x589(0x1)
	bool                                                         bDrawNavLinks;                                     // 0x589(0x1)
	bool                                                         bDrawFailedNavLinks;                               // 0x589(0x1)
	bool                                                         bDrawClusters;                                     // 0x589(0x1)
	bool                                                         bDrawOctree;                                       // 0x589(0x1)
	bool                                                         bDistinctlyDrawTilesBeingBuilt;                    // 0x589(0x1)
	bool                                                         bDrawNavMesh;                                      // 0x589(0x1)
	char                                                         pad0x2_395DC[0x2];                                 // 0x58a(0x2)
	float                                                        DrawOffset;                                        // 0x58c(0x4)
	float                                                        BuiltTileSizeUU;                                   // 0x590(0x4)
	float                                                        BuiltCellSize;                                     // 0x594(0x4)
	bool                                                         bFixedTilePoolSize;                                // 0x598(0x1)
	char                                                         pad0x3_Y9137[0x3];                                 // 0x599(0x3)
	int                                                          TilePoolSize;                                      // 0x59c(0x4)
	float                                                        TileSizeUU;                                        // 0x5a0(0x4)
	float                                                        CellSize;                                          // 0x5a4(0x4)
	float                                                        CellHeight;                                        // 0x5a8(0x4)
	float                                                        AgentRadius;                                       // 0x5ac(0x4)
	float                                                        AgentHeight;                                       // 0x5b0(0x4)
	float                                                        AgentMaxHeight;                                    // 0x5b4(0x4)
	float                                                        AgentMaxSlope;                                     // 0x5b8(0x4)
	float                                                        AgentMaxStepHeight;                                // 0x5bc(0x4)
	float                                                        MinRegionArea;                                     // 0x5c0(0x4)
	float                                                        MergeRegionSize;                                   // 0x5c4(0x4)
	float                                                        MaxSimplificationError;                            // 0x5c8(0x4)
	int                                                          MaxSimultaneousTileGenerationJobsCount;            // 0x5cc(0x4)
	int                                                          TileNumberHardLimit;                               // 0x5d0(0x4)
	int                                                          PolyRefTileBits;                                   // 0x5d4(0x4)
	int                                                          PolyRefNavPolyBits;                                // 0x5d8(0x4)
	int                                                          PolyRefSaltBits;                                   // 0x5dc(0x4)
	float                                                        DefaultDrawDistance;                               // 0x5e0(0x4)
	float                                                        DefaultMaxSearchNodes;                             // 0x5e4(0x4)
	float                                                        DefaultMaxHierarchicalSearchNodes;                 // 0x5e8(0x4)
	byte                                                         RegionPartitioning;                                // 0x5ec(0x1)
	byte                                                         LayerPartitioning;                                 // 0x5ed(0x1)
	char                                                         pad0x2_ARKEN[0x2];                                 // 0x5ee(0x2)
	int                                                          RegionChunkSplits;                                 // 0x5f0(0x4)
	int                                                          LayerChunkSplits;                                  // 0x5f4(0x4)
	bool                                                         bSortNavigationAreasByCost;                        // 0x5f8(0x1)
	bool                                                         bPerformVoxelFiltering;                            // 0x5f8(0x1)
	bool                                                         bMarkLowHeightAreas;                               // 0x5f8(0x1)
	bool                                                         bDoFullyAsyncNavDataGathering;                     // 0x5f8(0x1)
	bool                                                         bUseBetterOffsetsFromCorners;                      // 0x5f8(0x1)
	bool                                                         bUseVirtualFilters;                                // 0x5f8(0x1)
	bool                                                         bUseVoxelCache;                                    // 0x5f8(0x1)
	char                                                         pad0x3_FPROW[0x3];                                 // 0x5f9(0x3)
	float                                                        TileSetUpdateInterval;                             // 0x5fc(0x4)
	float                                                        HeuristicScale;                                    // 0x600(0x4)
	float                                                        VerticalDeviationFromGroundCompensation;           // 0x604(0x4)
	char                                                         pad0x30_BXPEU[0x30];                               // 0x608(0x30)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class NavigationGraphNode: public Actor
{
public:
};


// Size 0x0 (Full Size[0x3f8] - InheritedSize[0x3f8]
class PlayerStartPIE: public PlayerStart
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavPathObserverInterface: public Interface
{
public:
};


// Size 0xd0 (Full Size[0x498] - InheritedSize[0x3c8]
class NavigationTestingActor: public Actor
{
public:
	char                                                         pad0x10_Y99VN[0x10];                               // 0x3c8(0x10)
	Class CapsuleComponent*                                      CapsuleComponent;                                  // 0x3d8(0x8)
	Class NavigationInvokerComponent*                            InvokerComponent;                                  // 0x3e0(0x8)
	bool                                                         bActAsNavigationInvoker;                           // 0x3e8(0x1)
	char                                                         pad0x3_9ZH8M[0x3];                                 // 0x3e9(0x3)
	Struct NavAgentProperties                                    NavAgentProps;                                     // 0x3ec(0x30)
	Struct Vector                                                QueryingExtent;                                    // 0x41c(0xc)
	Class NavigationData*                                        MyNavData;                                         // 0x428(0x8)
	Struct Vector                                                ProjectedLocation;                                 // 0x430(0xc)
	bool                                                         bProjectedLocationValid;                           // 0x43c(0x1)
	bool                                                         bSearchStart;                                      // 0x43c(0x1)
	bool                                                         bUseHierarchicalPathfinding;                       // 0x43c(0x1)
	bool                                                         bGatherDetailedInfo;                               // 0x43c(0x1)
	bool                                                         bShowNodePool;                                     // 0x43c(0x1)
	bool                                                         bShowBestPath;                                     // 0x43c(0x1)
	bool                                                         bShowDiffWithPreviousStep;                         // 0x43c(0x1)
	bool                                                         bShouldBeVisibleInGame;                            // 0x43c(0x1)
	char                                                         pad0x3_22QIB[0x3];                                 // 0x43d(0x3)
	byte                                                         CostDisplayMode;                                   // 0x440(0x1)
	char                                                         pad0x3_U7DYD[0x3];                                 // 0x441(0x3)
	Struct Vector2D                                              TextCanvasOffset;                                  // 0x444(0x8)
	bool                                                         bPathExist;                                        // 0x44c(0x1)
	bool                                                         bPathIsPartial;                                    // 0x44c(0x1)
	bool                                                         bPathSearchOutOfNodes;                             // 0x44c(0x1)
	char                                                         pad0x3_2Q87F[0x3];                                 // 0x44d(0x3)
	float                                                        PathfindingTime;                                   // 0x450(0x4)
	float                                                        PathCost;                                          // 0x454(0x4)
	int                                                          PathfindingSteps;                                  // 0x458(0x4)
	char                                                         pad0x4_KYH96[0x4];                                 // 0x45c(0x4)
	Class NavigationTestingActor*                                OtherActor;                                        // 0x460(0x8)
	class                                                        FilterClass;                                       // 0x468(0x8)
	int                                                          ShowStepIndex;                                     // 0x470(0x4)
	float                                                        OffsetFromCornersDistance;                         // 0x474(0x4)
	char                                                         pad0x20_OLNAC[0x20];                               // 0x478(0x20)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class NavLinkDefinition: public Object
{
public:
	TArray<struct Links>                                         Links;                                             // 0x28(0x10)
	TArray<struct SegmentLinks>                                  SegmentLinks;                                      // 0x38(0x10)
	char                                                         pad0x8_B1EP3[0x8];                                 // 0x48(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NavLinkHostInterface: public Interface
{
public:
};


// Size 0x50 (Full Size[0x418] - InheritedSize[0x3c8]
class NavLinkProxy: public Actor
{
public:
	char                                                         pad0x10_S19N1[0x10];                               // 0x3c8(0x10)
	TArray<struct PointLinks>                                    PointLinks;                                        // 0x3d8(0x10)
	TArray<struct SegmentLinks>                                  SegmentLinks;                                      // 0x3e8(0x10)
	Class NavLinkCustomComponent*                                SmartLinkComp;                                     // 0x3f8(0x8)
	bool                                                         bSmartLinkIsRelevant;                              // 0x400(0x1)
	char                                                         pad0x7_35JZJ[0x7];                                 // 0x401(0x7)
	char                                                         pad0x10_OKNKY[0x10];                               // 0x408(0x10)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class Note: public Actor
{
public:
};


// Size 0x118 (Full Size[0x140] - InheritedSize[0x28]
class ParticleSystem: public Object
{
public:
	byte                                                         SystemUpdateMode;                                  // 0x28(0x1)
	char                                                         pad0x3_LJ4A8[0x3];                                 // 0x29(0x3)
	float                                                        UpdateTime_FPS;                                    // 0x2c(0x4)
	float                                                        UpdateTime_Delta;                                  // 0x30(0x4)
	float                                                        WarmUpTime;                                        // 0x34(0x4)
	float                                                        WarmupTickRate;                                    // 0x38(0x4)
	char                                                         pad0x4_CI6YV[0x4];                                 // 0x3c(0x4)
	TArray<class ParticleEmitter*>                               Emitters;                                          // 0x40(0x10)
	Class ParticleSystemComponent*                               PreviewComponent;                                  // 0x50(0x8)
	Class InterpCurveEdSetup*                                    CurveEdSetup;                                      // 0x58(0x8)
	bool                                                         bOrientZAxisTowardCamera;                          // 0x60(0x1)
	char                                                         pad0x3_E2A8X[0x3];                                 // 0x61(0x3)
	float                                                        LODDistanceCheckTime;                              // 0x64(0x4)
	byte                                                         LODMethod;                                         // 0x68(0x1)
	char                                                         pad0x7_1K3XK[0x7];                                 // 0x69(0x7)
	TArray<Float LODDistances>                                   LODDistances;                                      // 0x70(0x10)
	bool                                                         bRegenerateLODDuplicate;                           // 0x80(0x1)
	char                                                         pad0x7_KXF4H[0x7];                                 // 0x81(0x7)
	TArray<struct LODSettings>                                   LODSettings;                                       // 0x88(0x10)
	bool                                                         bIgnoreBoundsRotation;                             // 0x98(0x1)
	bool                                                         bBoostParticleAggregationPriority;                 // 0x98(0x1)
	bool                                                         bUseFixedRelativeBoundingBox;                      // 0x98(0x1)
	char                                                         pad0x3_15LC9[0x3];                                 // 0x99(0x3)
	Struct Box                                                   FixedRelativeBoundingBox;                          // 0x9c(0x1c)
	bool                                                         bUseLowResTranslucencyBoundingBox;                 // 0xb8(0x1)
	char                                                         pad0x3_AGTG3[0x3];                                 // 0xb9(0x3)
	Struct Box                                                   LowResTranslucencyBoundingBox;                     // 0xbc(0x1c)
	float                                                        SecondsBeforeInactive;                             // 0xd8(0x4)
	bool                                                         bShouldResetPeakCounts;                            // 0xdc(0x1)
	bool                                                         bHasPhysics;                                       // 0xdc(0x1)
	bool                                                         bPostPhysicsTick;                                  // 0xdc(0x1)
	bool                                                         bUseRealtimeThumbnail;                             // 0xdc(0x1)
	bool                                                         ThumbnailImageOutOfDate;                           // 0xdc(0x1)
	char                                                         pad0x3_2COUX[0x3];                                 // 0xdd(0x3)
	float                                                        Delay;                                             // 0xe0(0x4)
	float                                                        DelayLow;                                          // 0xe4(0x4)
	bool                                                         bUseDelayRange;                                    // 0xe8(0x1)
	char                                                         pad0x3_CGKFH[0x3];                                 // 0xe9(0x3)
	Struct Vector                                                MacroUVPosition;                                   // 0xec(0xc)
	float                                                        MacroUVRadius;                                     // 0xf8(0x4)
	byte                                                         OcclusionBoundsMethod;                             // 0xfc(0x1)
	char                                                         pad0x3_Y3QX5[0x3];                                 // 0xfd(0x3)
	Struct Box                                                   CustomOcclusionBounds;                             // 0x100(0x1c)
	char                                                         pad0x4_X28R3[0x4];                                 // 0x11c(0x4)
	TArray<struct SoloTracking>                                  SoloTracking;                                      // 0x120(0x10)
	TArray<struct NamedMaterialSlots>                            NamedMaterialSlots;                                // 0x130(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ParticleSystemAggregateTickSettings: public Object
{
public:
	int                                                          FramesTickScaledOver;                              // 0x28(0x4)
	int                                                          MaxTicksPerFrame;                                  // 0x2c(0x4)
	float                                                        PriorityInflationPower;                            // 0x30(0x4)
	char                                                         pad0x4_959P7[0x4];                                 // 0x34(0x4)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class ParticleEventManager: public Actor
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_CollisionDataProvider: public Interface
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class MeshPatchAsset: public Object
{
public:
};


// Size 0x210 (Full Size[0x238] - InheritedSize[0x28]
class SkeletalMesh: public Object
{
public:
	char                                                         pad0x28_WCTQ0[0x28];                               // 0x28(0x28)
	Class Skeleton*                                              Skeleton;                                          // 0x50(0x8)
	Struct BoxSphereBounds                                       Bounds;                                            // 0x58(0x1c)
	char                                                         pad0x4_NKPJP[0x4];                                 // 0x74(0x4)
	TArray<struct Materials>                                     Materials;                                         // 0x78(0x10)
	TArray<struct SkelMirrorTable>                               SkelMirrorTable;                                   // 0x88(0x10)
	byte                                                         SkelMirrorAxis;                                    // 0x98(0x1)
	byte                                                         SkelMirrorFlipAxis;                                // 0x99(0x1)
	char                                                         pad0x6_QKGM4[0x6];                                 // 0x9a(0x6)
	TArray<struct LODInfo>                                       LODInfo;                                           // 0xa0(0x10)
	bool                                                         bUseFullPrecisionUVs;                              // 0xb0(0x1)
	bool                                                         bHasBeenSimplified;                                // 0xb0(0x1)
	bool                                                         bHasVertexColors;                                  // 0xb0(0x1)
	char                                                         pad0x7_EGJFA[0x7];                                 // 0xb1(0x7)
	TArray<struct DeformablesSettings>                           DeformablesSettings;                               // 0xb8(0x10)
	bool                                                         bKeepTessellationAdjacency;                        // 0xc8(0x1)
	bool                                                         bKeepSkeletalMeshBuffersInMemory;                  // 0xc8(0x1)
	bool                                                         bEnablePerPolyCollision;                           // 0xc8(0x1)
	char                                                         pad0x7_USILB[0x7];                                 // 0xc9(0x7)
	Class BodySetup*                                             BodySetup;                                         // 0xd0(0x8)
	Class PhysicsAsset*                                          PhysicsAsset;                                      // 0xd8(0x8)
	Class HIKCharacterization*                                   Characterization;                                  // 0xe0(0x8)
	Class PhysicsAsset*                                          DeformablesPhysicsAsset;                           // 0xe8(0x8)
	float                                                        StreamingDistanceMultiplier;                       // 0xf0(0x4)
	float                                                        StreamingDiscardedTexelRatios;                     // 0xf4(0x4)
	TArray<class MorphTarget*>                                   MorphTargets;                                      // 0xf8(0x10)
	TArray<class MeshPatchAsset*>                                MeshPatchAssets;                                   // 0x108(0x10)
	char                                                         pad0xd8_H3S70[0xd8];                               // 0x118(0xd8)
	TArray<struct ClothingAssets>                                ClothingAssets;                                    // 0x1f0(0x10)
	char                                                         pad0x10_6VW8G[0x10];                               // 0x200(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x210(0x10)
	char                                                         pad0x8_41NLB[0x8];                                 // 0x220(0x8)
	TArray<class SkeletalMeshSocket*>                            Sockets;                                           // 0x228(0x10)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class AnimationAsset: public Object
{
public:
	Class Skeleton*                                              Skeleton;                                          // 0x28(0x8)
	char                                                         pad0x10_N9ZYO[0x10];                               // 0x30(0x10)
	TArray<class AnimMetaData*>                                  MetaData;                                          // 0x40(0x10)
};


// Size 0x28 (Full Size[0x468] - InheritedSize[0x440]
class DefaultPawn: public Pawn
{
public:
	float                                                        BaseTurnRate;                                      // 0x440(0x4)
	float                                                        BaseLookUpRate;                                    // 0x444(0x4)
	Class PawnMovementComponent*                                 MovementComponent;                                 // 0x448(0x8)
	Class SphereComponent*                                       CollisionComponent;                                // 0x450(0x8)
	Class StaticMeshComponent*                                   MeshComponent;                                     // 0x458(0x8)
	bool                                                         bAddDefaultMovementBindings;                       // 0x460(0x1)
	char                                                         pad0x7_48225[0x7];                                 // 0x461(0x7)
};


// Size 0x0 (Full Size[0x468] - InheritedSize[0x468]
class SpectatorPawn: public DefaultPawn
{
public:
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class ReflectionCapture: public Actor
{
public:
	Class ReflectionCaptureComponent*                            CaptureComponent;                                  // 0x3c8(0x8)
};


// Size 0x0 (Full Size[0x3d0] - InheritedSize[0x3d0]
class BoxReflectionCapture: public ReflectionCapture
{
public:
};


// Size 0x0 (Full Size[0x3d0] - InheritedSize[0x3d0]
class PlaneReflectionCapture: public ReflectionCapture
{
public:
};


// Size 0x8 (Full Size[0x3d8] - InheritedSize[0x3d0]
class SphereReflectionCapture: public ReflectionCapture
{
public:
	Class DrawSphereComponent*                                   DrawCaptureRadius;                                 // 0x3d0(0x8)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class RigidBodyBase: public Actor
{
public:
};


// Size 0x20 (Full Size[0x3e8] - InheritedSize[0x3c8]
class PhysicsConstraintActor: public RigidBodyBase
{
public:
	Class PhysicsConstraintComponent*                            ConstraintComp;                                    // 0x3c8(0x8)
	Class Actor*                                                 ConstraintActor1;                                  // 0x3d0(0x8)
	Class Actor*                                                 ConstraintActor2;                                  // 0x3d8(0x8)
	bool                                                         bDisableCollision;                                 // 0x3e0(0x1)
	char                                                         pad0x7_MDCO2[0x7];                                 // 0x3e1(0x7)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class PhysicsThruster: public RigidBodyBase
{
public:
	Class PhysicsThrusterComponent*                              ThrusterComponent;                                 // 0x3c8(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class RadialForceActor: public RigidBodyBase
{
public:
	Class RadialForceComponent*                                  ForceComponent;                                    // 0x3c8(0x8)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class SceneCapture: public Actor
{
public:
	Class StaticMeshComponent*                                   MeshComp;                                          // 0x3c8(0x8)
};


// Size 0x10 (Full Size[0x3e0] - InheritedSize[0x3d0]
class SceneCapture2D: public SceneCapture
{
public:
	Class SceneCaptureComponent2D*                               CaptureComponent2D;                                // 0x3d0(0x8)
	Class DrawFrustumComponent*                                  DrawFrustum;                                       // 0x3d8(0x8)
};


// Size 0x10 (Full Size[0x3e0] - InheritedSize[0x3d0]
class SceneCaptureCube: public SceneCapture
{
public:
	Class SceneCaptureComponentCube*                             CaptureComponentCube;                              // 0x3d0(0x8)
	Class DrawFrustumComponent*                                  DrawFrustum;                                       // 0x3d8(0x8)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class ServerOnlyTestActor: public Actor
{
public:
};


// Size 0x120 (Full Size[0x6f0] - InheritedSize[0x5d0]
class SkinnedMeshComponent: public MeshComponent
{
public:
	Class SkeletalMesh*                                          SkeletalMesh;                                      // 0x5c8(0x8)
	Class MaterialInterface*                                     CustomDepthMaterial;                               // 0x618(0x8)
	char                                                         pad0x10_PKPYN[0x10];                               // 0x620(0x10)
	bool                                                         bUseBoundsFromMasterPoseComponent;                 // 0x630(0x1)
	char                                                         pad0x7_E7SCS[0x7];                                 // 0x631(0x7)
	TArray<struct ActiveVertexAnims>                             ActiveVertexAnims;                                 // 0x638(0x10)
	Class PhysicsAsset*                                          PhysicsAssetOverride;                              // 0x648(0x8)
	int                                                          ForcedLodModel;                                    // 0x650(0x4)
	int                                                          MinLodModel;                                       // 0x654(0x4)
	int                                                          PredictedLODLevel;                                 // 0x658(0x4)
	int                                                          OldPredictedLODLevel;                              // 0x65c(0x4)
	float                                                        MaxDistanceFactor;                                 // 0x660(0x4)
	char                                                         pad0x4_GDV1M[0x4];                                 // 0x664(0x4)
	TArray<struct LODInfo>                                       LODInfo;                                           // 0x668(0x10)
	float                                                        StreamingDistanceMultiplier;                       // 0x678(0x4)
	Struct Color                                                 WireframeColor;                                    // 0x67c(0x4)
	bool                                                         bForceWireframe;                                   // 0x680(0x1)
	bool                                                         bDisplayBones;                                     // 0x680(0x1)
	bool                                                         bDisplayBoneCollisions;                            // 0x680(0x1)
	bool                                                         bDisableMorphTarget;                               // 0x680(0x1)
	bool                                                         bHideSkin;                                         // 0x680(0x1)
	char                                                         pad0x17_089FC[0x17];                               // 0x681(0x17)
	bool                                                         bPerBoneMotionBlur;                                // 0x698(0x1)
	bool                                                         bComponentUseFixedSkelBounds;                      // 0x698(0x1)
	bool                                                         bConsiderAllBodiesForBounds;                       // 0x698(0x1)
	char                                                         pad0x3_8IOGA[0x3];                                 // 0x699(0x3)
	byte                                                         MeshComponentUpdateFlag;                           // 0x69c(0x1)
	char                                                         pad0x3_5BQ9N[0x3];                                 // 0x69d(0x3)
	bool                                                         bForceMeshObjectUpdate;                            // 0x6a0(0x1)
	bool                                                         bChartDistanceFactor;                              // 0x6a0(0x1)
	bool                                                         bCanHighlightSelectedSections;                     // 0x6a0(0x1)
	bool                                                         bRecentlyRendered;                                 // 0x6a0(0x1)
	char                                                         pad0x3_RTV56[0x3];                                 // 0x6a1(0x3)
	float                                                        ProgressiveDrawingFraction;                        // 0x6a4(0x4)
	byte                                                         CustomSortAlternateIndexMode;                      // 0x6a8(0x1)
	char                                                         pad0x13_R76WX[0x13];                               // 0x6a9(0x13)
	Struct BoxSphereBounds                                       CachedLocalBounds;                                 // 0x6bc(0x1c)
	bool                                                         bCachedLocalBoundsUpToDate;                        // 0x6d8(0x1)
	bool                                                         bEnableUpdateRateOptimizations;                    // 0x6d9(0x1)
	bool                                                         bDisplayDebugUpdateRateOptimizations;              // 0x6da(0x1)
	char                                                         pad0x15_VBCTW[0x15];                               // 0x6db(0x15)
};


// Size 0x1b0 (Full Size[0x490] - InheritedSize[0x2e0]
class PhysicsConstraintComponent: public SceneComponent
{
public:
	Class Actor*                                                 ConstraintActor1;                                  // 0x2e0(0x8)
	Struct ConstrainComponentPropName                            ComponentName1;                                    // 0x2e8(0x8)
	Class Actor*                                                 ConstraintActor2;                                  // 0x2f0(0x8)
	Struct ConstrainComponentPropName                            ComponentName2;                                    // 0x2f8(0x8)
	char                                                         pad0x10_6ATKZ[0x10];                               // 0x300(0x10)
	Class PhysicsConstraintTemplate*                             ConstraintSetup;                                   // 0x310(0x8)
	Struct ConstraintInstance                                    ConstraintInstance;                                // 0x330(0x160)
};


// Size 0x240 (Full Size[0x268] - InheritedSize[0x28]
class Skeleton: public Object
{
public:
	TArray<struct BoneTree>                                      BoneTree;                                          // 0x28(0x10)
	char                                                         pad0x80_JMDN0[0x80];                               // 0x38(0x80)
	TArray<struct LinkupCache>                                   LinkupCache;                                       // 0xb8(0x10)
	TArray<class SkeletalMeshSocket*>                            Sockets;                                           // 0xc8(0x10)
	char                                                         pad0x50_BJ8V1[0x50];                               // 0xd8(0x50)
	Struct SmartNameContainer                                    SmartNames;                                        // 0x128(0x50)
	TArray<struct SlotGroups>                                    SlotGroups;                                        // 0x178(0x10)
	char                                                         pad0xe0_0PCOZ[0xe0];                               // 0x188(0xe0)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Interface_Animatable: public Interface
{
public:
};


// Size 0x2d0 (Full Size[0x9c0] - InheritedSize[0x6f0]
class SkeletalMeshComponent: public SkinnedMeshComponent
{
public:
	char                                                         pad0x10_A4N0N[0x10];                               // 0x6f0(0x10)
	byte                                                         AnimationMode;                                     // 0x700(0x1)
	char                                                         pad0x7_S5XQJ[0x7];                                 // 0x701(0x7)
	class                                                        AnimBlueprintGeneratedClass;                       // 0x708(0x8)
	Class AnimInstance*                                          AnimScriptInstance;                                // 0x710(0x8)
	Struct SingleAnimationPlayData                               AnimationData;                                     // 0x718(0x20)
	char                                                         pad0x10_8DTK3[0x10];                               // 0x738(0x10)
	TArray<struct CachedLocalAtoms>                              CachedLocalAtoms;                                  // 0x748(0x10)
	TArray<struct CachedSpaceBases>                              CachedSpaceBases;                                  // 0x758(0x10)
	char                                                         pad0x28_8BV3I[0x28];                               // 0x768(0x28)
	float                                                        GlobalAnimRateScale;                               // 0x790(0x4)
	bool                                                         bHasValidBodies;                                   // 0x794(0x1)
	char                                                         pad0x3_AZOC2[0x3];                                 // 0x795(0x3)
	byte                                                         KinematicBonesUpdateType;                          // 0x798(0x1)
	char                                                         pad0x3_LBU6H[0x3];                                 // 0x799(0x3)
