#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x28
struct EventOnExploded
{
public:
	class Actor*                                                 RootInstigator;                                    // 0x0(0x8)
	char                                                         pad0x10_KBKT2[0x10];                               // 0x8(0x10)
	class Object*                                                ImpactProjectileId;                                // 0x18(0x8)
	class Actor*                                                 DirectHitActor;                                    // 0x20(0x8)
};


// Size 0x18
struct EventAffectedByExplosion
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
	char                                                         pad0x10_2SYJA[0x10];                               // 0x8(0x10)
};


// Size 0x10
struct EventInstigatedExplosionDamagedActors
{
public:
	TArray<class Actor*>                                         DamagedActors;                                     // 0x0(0x10)
};


// Size 0x8
struct EventExplosionOverlap
{
public:
	class UClass*                                                DamagerType;                                       // 0x0(0x8)
};


// Size 0x8
struct EventExplosionIgnitedActor
{
public:
	class Actor*                                                 IgnitedActor;                                      // 0x0(0x8)
};


