// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0
class FactionInterationInterface: public Interface
{
public:
};


// Size 0x20
class FactionInteractionVoteComponent: public SceneComponent
{
public:
	class                                                        TargetCompany;                                     // 0x2e8(0x8)
};


// Size 0x20
class FactionSettingsAsset: public DataAsset
{
public:
	TArray<Class PossibleFactions>                               PossibleFactions;                                  // 0x28(0x10)
	TArray<Class FactionsRewardingFriendlyFire>                  FactionsRewardingFriendlyFire;                     // 0x38(0x10)
};


// Size 0x48
class FactionService: public Actor
{
public:
	Class FactionSettingsAsset*                                  Settings;                                          // 0x3d8(0x8)
	TArray<Struct CrewFactionEntry>                              FactionAlignedCrews;                               // 0x408(0x10)
};


// Size 0x10
class FactionVoteConsumerBase: public VoteConsumerInlineBase
{
public:
	Class FactionVoteValidatorBase*                              Validator;                                         // 0x30(0x8)
	Class Actor*                                                 OwningActor;                                       // 0x38(0x8)
};


// Size 0x30
class FactionVoteValidatorBase: public VoteValidatorInlineBase
{
public:
	class                                                        TargetCompany;                                     // 0x30(0x8)
	Class FactionVoteConsumerBase*                               Consumer;                                          // 0x58(0x8)
};


// Size 0x0
class StartFactionVoyageVoteValidator: public FactionVoteValidatorBase
{
public:
};


// Size 0x0
class StopFactionVoyageInlineVoteValidator: public FactionVoteValidatorBase
{
public:
};


// Size 0x50
class ShipFactionCustomisation: public SceneComponent
{
public:
	Struct FigureheadFactionVFXParams                            FigureheadFactionVFX;                              // 0x2e0(0x30)
	Class ChildActorComponent*                                   BPFactionHourglass;                                // 0x320(0x8)
	Class ParticleSystemComponent*                               SpawnedFigureheadParticles;                        // 0x328(0x8)
};


// Size 0x18
class ShipSunkTrackingComponent: public ActorComponent
{
public:
	float                                                        CrewRange;                                         // 0xc8(0x4)
};


}