// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48
struct CrewFactionEntryData
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	Struct Guid                                                  SessionId;                                         // 0x10(0x10)
	class                                                        Faction;                                           // 0x20(0x8)
	int                                                          Streak;                                            // 0x28(0x4)
	int                                                          SandsOfFate;                                       // 0x2c(0x4)
	float                                                        CooldownTimeStamp;                                 // 0x30(0x4)
	bool                                                         IsInInvasion;                                      // 0x34(0x1)
};


// Size 0x30
struct CrewFactionTelemetryData
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct FName                                                 Faction;                                           // 0x10(0x8)
	int                                                          Streak;                                            // 0x18(0x4)
	int                                                          SandsOfFate;                                       // 0x1c(0x4)
	TArray<Struct Guid>                                          CrewsAlreadySunk;                                  // 0x20(0x10)
};


// Size 0x20
struct CrewsSunkShipEvent
{
public:
	TArray<Struct Guid>                                          AttackingCrewIds;                                  // 0x0(0x10)
	Struct Guid                                                  SunkShipCrewId;                                    // 0x10(0x10)
};


// Size 0x20
struct CrewLeftFaction
{
public:
	Struct Guid                                                  LeavingCrewId;                                     // 0x0(0x10)
	class                                                        FactionLeft;                                       // 0x10(0x8)
	byte                                                         FactionLeftReason;                                 // 0x18(0x1)
};


// Size 0x18
struct CrewJoinedFaction
{
public:
	Struct Guid                                                  JoiningCrewId;                                     // 0x0(0x10)
	class                                                        FactionJoined;                                     // 0x10(0x8)
};


}