// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10
struct CompanyFactionAlignment
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	class                                                        Faction;                                           // 0x8(0x8)
};


// Size 0x10
struct FactionServicePopUpData
{
public:
	class                                                        Faction;                                           // 0x0(0x8)
	Class DataAsset*                                             PopUpMessageDesc;                                  // 0x8(0x8)
};


// Size 0x8
struct FactionStreakLevelData
{
public:
	int                                                          StreakLevel;                                       // 0x0(0x4)
	int                                                          StreakCountThreshold;                              // 0x4(0x4)
};


// Size 0xc
struct SandsOfFateData
{
public:
	int                                                          SinkingCrewStreak;                                 // 0x0(0x4)
	int                                                          SunkCrewStreak;                                    // 0x4(0x4)
	int                                                          SandsOfFateReward;                                 // 0x8(0x4)
};


// Size 0x20
struct CrewFactionEntry
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	class                                                        Faction;                                           // 0x10(0x8)
	byte                                                         EnemyFactionShipRangeState;                        // 0x18(0x1)
	int                                                          CurrentLootValue;                                  // 0x1c(0x4)
};


// Size 0x70
struct CrewFactionEntryData
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	Struct Guid                                                  SessionId;                                         // 0x10(0x10)
	class                                                        Faction;                                           // 0x20(0x8)
	int                                                          Streak;                                            // 0x28(0x4)
	int                                                          SandsOfFate;                                       // 0x2c(0x4)
	float                                                        CooldownTimeStamp;                                 // 0x30(0x4)
	bool                                                         IsInInvasion;                                      // 0x34(0x1)
	TArray<Struct Guid>                                          EligibleLootBootyIds;                              // 0x38(0x10)
	int                                                          CurrentLootValue;                                  // 0x48(0x4)
	TArray<Bool HasDisplayedPromptForLootLevel>                  HasDisplayedPromptForLootLevel;                    // 0x50(0x10)
};


// Size 0x30
struct CrewFactionTelemetryData
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct FName                                                 Faction;                                           // 0x10(0x8)
	int                                                          Streak;                                            // 0x18(0x4)
	int                                                          SandsOfFate;                                       // 0x1c(0x4)
	TArray<Struct Guid>                                          CrewsAlreadySunk;                                  // 0x20(0x10)
};


// Size 0x20
struct FactionShipDefeatedEvent
{
public:
	TArray<Struct Guid>                                          VictoriousCrewIds;                                 // 0x0(0x10)
	Struct Guid                                                  DefeatedCrewId;                                    // 0x10(0x10)
};


// Size 0x14
struct CrewStreakLevelIncreased
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	int                                                          StreakLevel;                                       // 0x10(0x4)
};


// Size 0x20
struct CrewsSunkShipEvent
{
public:
	TArray<Struct Guid>                                          AttackingCrewIds;                                  // 0x0(0x10)
	Struct Guid                                                  SunkShipCrewId;                                    // 0x10(0x10)
};


// Size 0x20
struct CrewLeftFaction
{
public:
	Struct Guid                                                  LeavingCrewId;                                     // 0x0(0x10)
	class                                                        FactionLeft;                                       // 0x10(0x8)
	byte                                                         FactionLeftReason;                                 // 0x18(0x1)
};


// Size 0x20
struct CrewLeavingFaction
{
public:
	Struct Guid                                                  LeavingCrewId;                                     // 0x0(0x10)
	class                                                        FactionToLeave;                                    // 0x10(0x8)
	byte                                                         FactionLeftReason;                                 // 0x18(0x1)
};


// Size 0x18
struct CrewJoinedFactionSuccess
{
public:
	Struct Guid                                                  JoiningCrewId;                                     // 0x0(0x10)
	class                                                        FactionJoined;                                     // 0x10(0x8)
};


// Size 0x18
struct CrewJoinedFaction
{
public:
	Struct Guid                                                  JoiningCrewId;                                     // 0x0(0x10)
	class                                                        FactionJoined;                                     // 0x10(0x8)
};


// Size 0x1c
struct FactionLeftTelemetryEvent
{
public:
	Struct Guid                                                  FactionSessionId;                                  // 0x0(0x10)
	struct FName                                                 AlignedFactionName;                                // 0x10(0x8)
	byte                                                         LeftReason;                                        // 0x18(0x1)
};


// Size 0x18
struct FactionJoinedTelemetryEvent
{
public:
	Struct Guid                                                  FactionSessionId;                                  // 0x0(0x10)
	struct FName                                                 AlignedFactionName;                                // 0x10(0x8)
};


}