// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10
struct CompanyFactionAlignment
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	class                                                        Faction;                                           // 0x8(0x8)
};


// Size 0x10
struct FactionServicePopUpData
{
public:
	class                                                        Faction;                                           // 0x0(0x8)
	Class DataAsset*                                             PopUpMessageDesc;                                  // 0x8(0x8)
};


// Size 0x8
struct FactionStreakLevelData
{
public:
	int                                                          StreakLevel;                                       // 0x0(0x4)
	int                                                          StreakCountThreshold;                              // 0x4(0x4)
};


// Size 0xc
struct SandsOfFateData
{
public:
	int                                                          SinkingCrewStreakLevel;                            // 0x0(0x4)
	int                                                          SunkCrewStreakLevel;                               // 0x4(0x4)
	int                                                          SandsOfFateReward;                                 // 0x8(0x4)
};


// Size 0x30
struct CrewFactionEntry
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	class                                                        Faction;                                           // 0x10(0x8)
	byte                                                         EnemyFactionShipRangeState;                        // 0x18(0x1)
	char                                                         pad0x3_0IDO1[0x3];                                 // 0x19(0x3)
	int                                                          CurrentLootValue;                                  // 0x1c(0x4)
	int                                                          SandsOfFate;                                       // 0x20(0x4)
	char                                                         pad0x4_EG9VD[0x4];                                 // 0x24(0x4)
	double                                                       LeaveFactionCooldownTimeStamp;                     // 0x28(0x8)
};


// Size 0x78
struct CrewFactionEntryData
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	Struct Guid                                                  SessionId;                                         // 0x10(0x10)
	class                                                        Faction;                                           // 0x20(0x8)
	int                                                          Streak;                                            // 0x28(0x4)
	char                                                         pad0x4_PE5SE[0x4];                                 // 0x2c(0x4)
	double                                                       CooldownTimeStamp;                                 // 0x30(0x8)
	bool                                                         IsInInvasion;                                      // 0x38(0x1)
	char                                                         pad0x7_9AJ63[0x7];                                 // 0x39(0x7)
	TArray<Struct Guid>                                          EligibleLootBootyIds;                              // 0x40(0x10)
	int                                                          CurrentLootValue;                                  // 0x50(0x4)
	char                                                         pad0x4_7VLCK[0x4];                                 // 0x54(0x4)
	TArray<Bool HasDisplayedPromptForLootLevel>                  HasDisplayedPromptForLootLevel;                    // 0x58(0x10)
};


// Size 0x30
struct CrewFactionTelemetryData
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	Struct Guid                                                  SessionId;                                         // 0x10(0x10)
	struct FName                                                 Faction;                                           // 0x20(0x8)
	int                                                          Streak;                                            // 0x28(0x4)
	int                                                          SandsOfFate;                                       // 0x2c(0x4)
};


// Size 0x18
struct FactionServicePostMigrationEvent
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	class                                                        Faction;                                           // 0x10(0x8)
};


// Size 0x20
struct FactionShipDefeatedEvent
{
public:
	TArray<Struct Guid>                                          VictoriousCrewIds;                                 // 0x0(0x10)
	Struct Guid                                                  DefeatedCrewId;                                    // 0x10(0x10)
};


// Size 0x14
struct CrewStreakLevelIncreased
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	int                                                          StreakLevel;                                       // 0x10(0x4)
};


// Size 0x10
struct ShipDestroyedByBattleBoundsEvent
{
public:
	Struct Guid                                                  SunkShipCrewId;                                    // 0x0(0x10)
};


// Size 0x20
struct CrewsSunkShipEvent
{
public:
	TArray<Struct Guid>                                          AttackingCrewIds;                                  // 0x0(0x10)
	Struct Guid                                                  SunkShipCrewId;                                    // 0x10(0x10)
};


// Size 0x20
struct CrewLeftFaction
{
public:
	Struct Guid                                                  LeavingCrewId;                                     // 0x0(0x10)
	class                                                        FactionLeft;                                       // 0x10(0x8)
	byte                                                         FactionLeftReason;                                 // 0x18(0x1)
};


// Size 0x20
struct CrewLeavingFaction
{
public:
	Struct Guid                                                  LeavingCrewId;                                     // 0x0(0x10)
	class                                                        FactionToLeave;                                    // 0x10(0x8)
	byte                                                         FactionLeftReason;                                 // 0x18(0x1)
};


// Size 0x18
struct CrewJoinedFactionSuccess
{
public:
	Struct Guid                                                  JoiningCrewId;                                     // 0x0(0x10)
	class                                                        FactionJoined;                                     // 0x10(0x8)
};


// Size 0x18
struct CrewJoinedFaction
{
public:
	Struct Guid                                                  JoiningCrewId;                                     // 0x0(0x10)
	class                                                        FactionJoined;                                     // 0x10(0x8)
};


// Size 0x38
struct FactionCrewAttackedPreviouslySunkCrewTelemetryEvent
{
public:
	Struct Guid                                                  FactionSessionId;                                  // 0x0(0x10)
	struct FName                                                 AlignedFactionName;                                // 0x10(0x8)
	Struct Guid                                                  AttackingCrewId;                                   // 0x18(0x10)
	Struct Guid                                                  SunkCrewId;                                        // 0x28(0x10)
};


// Size 0x1c
struct FactionLeftTelemetryEvent
{
public:
	Struct Guid                                                  FactionSessionId;                                  // 0x0(0x10)
	struct FName                                                 AlignedFactionName;                                // 0x10(0x8)
	byte                                                         LeftReason;                                        // 0x18(0x1)
};


// Size 0x18
struct FactionJoinedTelemetryEvent
{
public:
	Struct Guid                                                  FactionSessionId;                                  // 0x0(0x10)
	struct FName                                                 AlignedFactionName;                                // 0x10(0x8)
};


// Size 0x10
struct FactionWaitTimesData
{
public:
	byte                                                         Faction;                                           // 0x0(0x1)
	byte                                                         SessionType;                                       // 0x1(0x1)
	char                                                         pad0x6_L9OKV[0x6];                                 // 0x2(0x6)
};


}