#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x30
struct CrewFactionEntry
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	class UClass*                                                Faction;                                           // 0x10(0x8)
	char                                                         EnemyFactionShipRangeState;                        // 0x18(0x1)
	int                                                          CurrentLootValue;                                  // 0x1c(0x4)
	int                                                          SandsOfFate;                                       // 0x20(0x4)
	int                                                          Streak;                                            // 0x24(0x4)
	double                                                       LeaveFactionCooldownTimeStamp;                     // 0x28(0x8)
};


// Size 0x20
struct CrewsSunkShipEvent
{
public:
	TArray<struct Guid>                                          AttackingCrewIds;                                  // 0x0(0x10)
	struct Guid                                                  SunkShipCrewId;                                    // 0x10(0x10)
};


// Size 0x18
struct FactionServicePostMigrationEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	class UClass*                                                Faction;                                           // 0x10(0x8)
};


// Size 0x8
struct FactionStreakLevelData
{
public:
	int                                                          StreakLevel;                                       // 0x0(0x4)
	int                                                          StreakCountThreshold;                              // 0x4(0x4)
};


// Size 0x18
struct FactionJoinedTelemetryEvent
{
public:
	struct Guid                                                  FactionSessionId;                                  // 0x0(0x10)
	struct FName                                                 AlignedFactionName;                                // 0x10(0x8)
};


// Size 0x20
struct CrewLeavingFaction
{
public:
	struct Guid                                                  LeavingCrewId;                                     // 0x0(0x10)
	class UClass*                                                FactionToLeave;                                    // 0x10(0x8)
	char                                                         FactionLeftReason;                                 // 0x18(0x1)
};


// Size 0x18
struct CrewJoinedFactionSuccess
{
public:
	struct Guid                                                  JoiningCrewId;                                     // 0x0(0x10)
	class UClass*                                                FactionJoined;                                     // 0x10(0x8)
};


// Size 0x18
struct CrewJoinedFaction
{
public:
	struct Guid                                                  JoiningCrewId;                                     // 0x0(0x10)
	class UClass*                                                FactionJoined;                                     // 0x10(0x8)
};


// Size 0xc
struct SandsOfFateData
{
public:
	int                                                          SinkingCrewStreakLevel;                            // 0x0(0x4)
	int                                                          SunkCrewStreakLevel;                               // 0x4(0x4)
	int                                                          SandsOfFateReward;                                 // 0x8(0x4)
};


// Size 0x38
struct FactionCrewAttackedPreviouslySunkCrewTelemetryEvent
{
public:
	struct Guid                                                  FactionSessionId;                                  // 0x0(0x10)
	struct FName                                                 AlignedFactionName;                                // 0x10(0x8)
	struct Guid                                                  AttackingCrewId;                                   // 0x18(0x10)
	struct Guid                                                  SunkCrewId;                                        // 0x28(0x10)
};


// Size 0x10
struct FactionServicePopUpData
{
public:
	class UClass*                                                Faction;                                           // 0x0(0x8)
	class DataAsset*                                             PopUpMessageDesc;                                  // 0x8(0x8)
};


// Size 0x10
struct CompanyFactionAlignment
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	class UClass*                                                Faction;                                           // 0x8(0x8)
};


// Size 0x10
struct ShipDestroyedByBattleBoundsEvent
{
public:
	struct Guid                                                  SunkShipCrewId;                                    // 0x0(0x10)
};


// Size 0x20
struct FactionShipDefeatedEvent
{
public:
	TArray<struct Guid>                                          VictoriousCrewIds;                                 // 0x0(0x10)
	struct Guid                                                  DefeatedCrewId;                                    // 0x10(0x10)
};


// Size 0x30
struct CrewFactionTelemetryData
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct Guid                                                  SessionId;                                         // 0x10(0x10)
	struct FName                                                 Faction;                                           // 0x20(0x8)
	int                                                          Streak;                                            // 0x28(0x4)
	int                                                          SandsOfFate;                                       // 0x2c(0x4)
};


// Size 0x20
struct CrewLeftFaction
{
public:
	struct Guid                                                  LeavingCrewId;                                     // 0x0(0x10)
	class UClass*                                                FactionLeft;                                       // 0x10(0x8)
	char                                                         FactionLeftReason;                                 // 0x18(0x1)
};


// Size 0x68
struct CrewFactionEntryData
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct Guid                                                  SessionId;                                         // 0x10(0x10)
	class UClass*                                                Faction;                                           // 0x20(0x8)
	int                                                          Streak;                                            // 0x28(0x4)
	double                                                       CooldownTimeStamp;                                 // 0x30(0x8)
	bool                                                         IsInInvasion;                                      // 0x38(0x1)
	TArray<struct Guid>                                          EligibleLootBootyIds;                              // 0x40(0x10)
	int                                                          CurrentLootValue;                                  // 0x50(0x4)
	TArray<bool>                                                 HasDisplayedPromptForLootLevel;                    // 0x58(0x10)
};


// Size 0x1c
struct FactionLeftTelemetryEvent
{
public:
	struct Guid                                                  FactionSessionId;                                  // 0x0(0x10)
	struct FName                                                 AlignedFactionName;                                // 0x10(0x8)
	char                                                         LeftReason;                                        // 0x18(0x1)
};


// Size 0x10
struct FactionWaitTimesData
{
public:
	char                                                         Faction;                                           // 0x0(0x1)
	char                                                         SessionType;                                       // 0x1(0x1)
	int64                                                        WaitTimeTicks;                                     // 0x8(0x8)
};


// Size 0x14
struct CrewStreakLevelIncreased
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	int                                                          StreakLevel;                                       // 0x10(0x4)
};


// Size 0x30
struct FactionStreakIncreasedTelemetryEvent
{
public:
	struct CrewFactionTelemetryData                              CrewFactionData;                                   // 0x0(0x30)
};


