// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x18 (Full Size[0xe0] - InheritedSize[0xc8]
class FlammableComponent: public ActorComponent
{
public:
	char                                                         pad0x10_ADO93[0x10];                               // 0xc8(0x10)
	bool                                                         OnFire;                                            // 0xd8(0x1)
	char                                                         pad0x7_GWFZC[0x7];                                 // 0xd9(0x7)
};


// Size 0x30 (Full Size[0x110] - InheritedSize[0xe0]
class ActorFlammableComponent: public FlammableComponent
{
public:
	char                                                         pad0x18_XA9T0[0x18];                               // 0xe0(0x18)
	class ParticleSystem*                                        FireVFX;                                           // 0xf8(0x8)
	class ParticleSystem*                                        SteamVFX;                                          // 0x100(0x8)
	float                                                        FireVFXIntensity;                                  // 0x108(0x4)
	char                                                         pad0x4_8A3LQ[0x4];                                 // 0x10c(0x4)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class BlownByWindStatus: public StatusBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ExtinguishableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FireDamagerType: public DamagerType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FireExplosionDamagerType: public DamagerType
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class FireStatus: public StatusBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FlammableInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0xf8] - InheritedSize[0xe0]
class FlammableWieldableComponent: public FlammableComponent
{
public:
	struct Status                                                IgnitedStatus;                                     // 0xe0(0x18)
};


// Size 0x8 (Full Size[0xe8] - InheritedSize[0xe0]
class TimedFlammableComponent: public FlammableComponent
{
public:
	bool                                                         UseExtinguishTimer;                                // 0xe0(0x1)
	bool                                                         AllowFireToBeReplenishedBeforeExtinguishTimerExpired; // 0xe1(0x1)
	char                                                         pad0x2_QHNB1[0x2];                                 // 0xe2(0x2)
	float                                                        TimeInSecondsUntilFireExtinguished;                // 0xe4(0x4)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class IgniteStatus: public StatusBase
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class StatusResponseExtinguish: public StatusResponse
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class StatusResponseIgnite: public StatusResponse
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class FireGridCellSelectionParamsDataAsset: public DataAsset
{
public:
	TArray<struct FireGridCellSelectionParams>                   FireGridCellSelectionParams;                       // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FirePropagationInterface: public Interface
{
public:
};


// Size 0x78 (Full Size[0x140] - InheritedSize[0xc8]
class CookerIgnitionComponent: public ActorComponent
{
public:
	struct CookerIgnitionParams                                  CookerIgnitionParams;                              // 0xc8(0x78)
};


// Size 0x98 (Full Size[0xc0] - InheritedSize[0x28]
class FireCellStateTimingParamsDataAsset: public DataAsset
{
public:
	struct FireCellStateTimingParams                             TimingParams;                                      // 0x28(0x94)
	char                                                         pad0x4_I9HPT[0x4];                                 // 0xbc(0x4)
};


// Size 0xa8 (Full Size[0xd0] - InheritedSize[0x28]
class FireGridAudioManager: public Object
{
public:
	struct FireCellAudioParams                                   FireAudioParams;                                   // 0x28(0x40)
	class Actor*                                                 OwningActor;                                       // 0x68(0x8)
	class FirePropagator*                                        FirePropagator;                                    // 0x70(0x8)
	char                                                         pad0x58_8584Z[0x58];                               // 0x78(0x58)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FireGridLocationInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FireGridProxyInterface: public FireGridLocationInterface
{
public:
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class FireGridVFXParamsDataAsset: public DataAsset
{
public:
	struct FireGridVFXParams                                     Params;                                            // 0x28(0x40)
};


// Size 0x1e8 (Full Size[0x210] - InheritedSize[0x28]
class FireGridVFXManager: public Object
{
public:
	class FireGridVFXParamsDataAsset*                            VFXParams;                                         // 0x28(0x8)
	TArray<struct FireParticleSystem>                            SpawnedCustomParticleSystemsForCells;              // 0x80(0x10)
	class ParticleSystemComponent*                               SpawnedExteriorSmokeParticleSystem;                // 0x130(0x8)
	class ParticleSystemComponent*                               SpawnedLowDetailParticleSystem;                    // 0x138(0x8)
	TArray<struct FireMesh>                                      DespawningMeshes;                                  // 0x140(0x10)
	TArray<struct FireGridRelativeSpawnDesc>                     InteriorSmokeSpawnDescs;                           // 0x150(0x10)
	TArray<struct FireGridLowDetailRelativeSpawnDesc>            LowDetailVFXSpawnDescs;                            // 0x160(0x10)
	TArray<struct FireParticleSpawnData>                         ParticleSpawnLODSettings;                          // 0x170(0x10)
	TArray<struct FireGridLowDetailRelativeSpawnDesc>            ExteriorSmokeVFXSpawnDescs;                        // 0x180(0x10)
	TArray<struct FireDefaultVFXSpawnData>                       VFXToSpawn;                                        // 0x190(0x10)
	char                                                         pad0x8_INHML[0x8];                                 // 0x1a0(0x8)
	TArray<struct FireParticleSpawnList>                         InterleavedSpawnLists;                             // 0x1a8(0x10)
	class FirePropagator*                                        Propagator;                                        // 0x1b8(0x8)
	char                                                         pad0x50_TU5S7[0x50];                               // 0x1c0(0x50)
};


// Size 0xf8 (Full Size[0x120] - InheritedSize[0x28]
class FirePropagator: public Object
{
public:
	char                                                         pad0x90_SDAE2[0x90];                               // 0x28(0x90)
	class FireCellStateTimingParamsDataAsset*                    CellStateTimingParams;                             // 0xb8(0x8)
	char                                                         pad0x4_6LVAQ[0x4];                                 // 0xc0(0x4)
	float                                                        WaterHeightOffsetToFloodCells;                     // 0xc4(0x4)
	char                                                         pad0x58_YRNYQ[0x58];                               // 0xc8(0x58)
};


// Size 0x28 (Full Size[0x138] - InheritedSize[0x110]
class MastFlammableComponent: public ActorFlammableComponent
{
public:
	char                                                         pad0x8_E7FWR[0x8];                                 // 0x110(0x8)
	struct Vector                                                FireGridLocation;                                  // 0x118(0xc)
	char                                                         pad0x14_7F112[0x14];                               // 0x124(0x14)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ShipFireDamageParamsDataAsset: public DataAsset
{
public:
	struct ShipFireDamageParams                                  FireDamageParams;                                  // 0x28(0x18)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class ShipFireLightParamsDataAsset: public DataAsset
{
public:
	struct ShipFireLightParams                                   Params;                                            // 0x28(0x14)
	char                                                         pad0x4_G1GF7[0x4];                                 // 0x3c(0x4)
};


// Size 0x3d8 (Full Size[0x4a0] - InheritedSize[0xc8]
class ShipFirePropagationComponent: public ActorComponent
{
public:
	char                                                         pad0x10_J0IS8[0x10];                               // 0xc8(0x10)
	struct FName                                                 FeatureToggleName;                                 // 0xd8(0x8)
	class UClass*                                                ShipSize;                                          // 0xe0(0x8)
	float                                                        CellSize;                                          // 0xe8(0x4)
	struct IntVector                                             GridDimensions;                                    // 0xec(0xc)
	struct Vector                                                GridOffset;                                        // 0xf8(0xc)
	char                                                         pad0x4_MXFB7[0x4];                                 // 0x104(0x4)
	class FirePropagator*                                        Propagator;                                        // 0x108(0x8)
	class ShipFireDamageParamsDataAsset*                         FireDamageDataAsset;                               // 0x110(0x8)
	TArray<struct FireCellDesc>                                  FireCellDescs;                                     // 0x118(0x10)
	char                                                         pad0x10_KHGOC[0x10];                               // 0x128(0x10)
	struct Status                                                BurnStatus;                                        // 0x138(0x18)
	class FireGridVFXManager*                                    VFXManager;                                        // 0x150(0x8)
	struct FireGridVfxSpawnSettings                              VfxSpawnSettings;                                  // 0x158(0x58)
	struct ShipFireLightManager                                  FireLightManager;                                  // 0x1b0(0x150)
	struct FireGridCharringManager                               FireCharringManager;                               // 0x300(0xd8)
	TArray<struct ReplicatedFireCellData>                        ReplicatedCellData;                                // 0x3d8(0x10)
	struct ReplicatedFireCellCharringData                        ReplicatedCellCharringData;                        // 0x3e8(0x18)
	class FireGridAudioManager*                                  FireAudioManager;                                  // 0x400(0x8)
	struct FireCellAudioParams                                   FireAudioParams;                                   // 0x408(0x40)
	char                                                         pad0x58_E5BRX[0x58];                               // 0x448(0x58)
};


}