#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "FireworkFramework_Structs.h"


// Size 0x98 (Full Size[0x438] - InheritedSize[0x3a0]
class FireworkService: public Actor
{
public:
	char                                                         pad0x78_9ZPFZ[0x78];                               // 0x3a0(0x78)
	int                                                          NumberOfCachedFlares;                              // 0x418(0x4)
	char                                                         pad0x1c_B7GTR[0x1c];                               // 0x41c(0x1c)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class FireworkFeedbackDataAsset: public DataAsset
{
public:
	float                                                        MaxExplosionRadius;                                // 0x28(0x4)
	char                                                         pad0x4_4AFFZ[0x4];                                 // 0x2c(0x4)
	class UClass*                                                CameraShake;                                       // 0x30(0x8)
	float                                                        CameraShakeInnerRadiusMultiplier;                  // 0x38(0x4)
	char                                                         pad0x4_40O7G[0x4];                                 // 0x3c(0x4)
	class ForceFeedbackEffect*                                   ExplosionRumble;                                   // 0x40(0x8)
};


// Size 0xd8 (Full Size[0x478] - InheritedSize[0x3a0]
class FireworkExplosion: public Actor
{
public:
	char                                                         pad0x8_702GE[0x8];                                 // 0x3a0(0x8)
	struct GeneratedFireworkData                                 GeneratedFireworkData;                             // 0x3a8(0x58)
	class SceneComponent*                                        RootSceneComponent;                                // 0x400(0x8)
	class FireworkAmbientLightComponent*                         FireworkAmbientLightComponent;                     // 0x408(0x8)
	class ParticleSystemComponent*                               SpawnedExplosionParticles;                         // 0x410(0x8)
	struct WwiseEmitter                                          AudioEmitter;                                      // 0x418(0x20)
	char                                                         pad0x40_WWGXX[0x40];                               // 0x438(0x40)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FireworkServiceInterface: public Interface
{
public:
};


// Size 0x1c8 (Full Size[0x280] - InheritedSize[0xb8]
class ProjectileAnimationComponent: public ActorComponent
{
public:
	TArray<struct WeightedProjectileMeshAnimationData>           ProjectileAnimationCurves;                         // 0xb8(0x10)
	class StaticMeshComponent*                                   MeshComponent;                                     // 0xc8(0x8)
	struct RuntimeVectorCurve                                    AnimationOffsetCurve;                              // 0xd0(0x170)
	char                                                         pad0x40_LGOUN[0x40];                               // 0x240(0x40)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FireworkDamagerType: public DamagerType
{
public:
};


// Size 0x50 (Full Size[0x4e0] - InheritedSize[0x490]
class FireworkAmbientLightComponent: public AmbientLightSourceComponent
{
public:
	char                                                         pad0x50_5LR69[0x50];                               // 0x490(0x50)
};


// Size 0x20 (Full Size[0x528] - InheritedSize[0x508]
class FireworkItemInfo: public ItemInfo
{
public:
	class LoadableFireworkComponent*                             LoadableProjectileComponent;                       // 0x508(0x8)
	struct StringAssetReference                                  FireworkDataAsset;                                 // 0x510(0x10)
	int                                                          GeneratedDataRNGSeed;                              // 0x520(0x4)
	char                                                         pad0x4_3KNZ7[0x4];                                 // 0x524(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ImpactProjectileIdFirework: public ImpactProjectileId
{
public:
};


// Size 0x108 (Full Size[0x770] - InheritedSize[0x668]
class FireworkProjectile: public LaunchableProjectile
{
public:
	char                                                         pad0x10_3DFK2[0x10];                               // 0x668(0x10)
	class SphereComponent*                                       CollisionComponent;                                // 0x678(0x8)
	class StaticMeshComponent*                                   MeshComponent;                                     // 0x680(0x8)
	class ExplosionComponent*                                    ExplosionComponent;                                // 0x688(0x8)
	class FireworkStatsComponent*                                FireworkStatsComponent;                            // 0x690(0x8)
	class SceneComponent*                                        MeshDirectionComponent;                            // 0x698(0x8)
	class ProjectileAnimationComponent*                          AnimationComponent;                                // 0x6a0(0x8)
	struct GeneratedFireworkData                                 GeneratedFireworkData;                             // 0x6a8(0x58)
	char                                                         pad0x70_RBY9J[0x70];                               // 0x700(0x70)
};


// Size 0x10 (Full Size[0x158] - InheritedSize[0x148]
class LoadableFireworkComponent: public LoadableProjectileComponent
{
public:
	bool                                                         ShouldProjectileTrailDoReflections;                // 0x148(0x1)
	bool                                                         ShouldUseGlobalOverrideFuseTimer;                  // 0x149(0x1)
	bool                                                         ShouldUseGlobalOverrideFuseSfx;                    // 0x14a(0x1)
	bool                                                         ShouldUseGlobalOverrideFuseVfx;                    // 0x14b(0x1)
	bool                                                         ShouldUseGlobalOverrideFuseMesh;                   // 0x14c(0x1)
	char                                                         pad0x3_WBLEN[0x3];                                 // 0x14d(0x3)
	class FireworksSettingsDataAsset*                            FireworksSettingsDataAsset;                        // 0x150(0x8)
};


// Size 0x18 (Full Size[0x50] - InheritedSize[0x38]
class FireworksSettings: public DeveloperSettings
{
public:
	float                                                        FlashbangRadius;                                   // 0x38(0x4)
	float                                                        FlashbangFlashTimer;                               // 0x3c(0x4)
	float                                                        FlashbangFadeOutTimer;                             // 0x40(0x4)
	float                                                        FlashbangCooldown;                                 // 0x44(0x4)
	float                                                        LoadedFuseTimer;                                   // 0x48(0x4)
	char                                                         pad0x4_KF3TL[0x4];                                 // 0x4c(0x4)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class FireworksSettingsDataAsset: public DataAsset
{
public:
	float                                                        LoadedFuseTimer;                                   // 0x28(0x4)
	char                                                         pad0x4_5A52P[0x4];                                 // 0x2c(0x4)
	class WwiseObjectPoolWrapper*                                FuseSoundWisePool;                                 // 0x30(0x8)
	class WwiseEvent*                                            FuseActivateSoundPlayEvent;                        // 0x38(0x8)
	class WwiseEvent*                                            FuseSoundPlayEvent;                                // 0x40(0x8)
	class WwiseEvent*                                            FuseSoundStopEvent;                                // 0x48(0x8)
	class Object*                                                FuseParticleSystem;                                // 0x50(0x8)
	struct StringAssetReference                                  FuseMeshAssetReference;                            // 0x58(0x10)
};


// Size 0xd0 (Full Size[0x188] - InheritedSize[0xb8]
class FireworkStatsComponent: public ActorComponent
{
public:
	float                                                        FlareRadius;                                       // 0xb8(0x4)
	char                                                         pad0x4_WC6QP[0x4];                                 // 0xbc(0x4)
	int                                                          NumberOfFireworksFiredAtNight;                     // 0xc0(0x4)
	float                                                        FireworksFiredAtNightRadius;                       // 0xc4(0x4)
	float                                                        FiredFireworksAtNightTimer;                        // 0xc8(0x4)
	char                                                         pad0xbc_8T623[0xbc];                               // 0xcc(0xbc)
};


// Size 0x128 (Full Size[0x150] - InheritedSize[0x28]
class FireworkDataAsset: public DataAsset
{
public:
	struct WeightedProbabilityRangeOfRanges                      PercentageTimeUntilTrailDisappears;                // 0x28(0x30)
	struct WeightedProbabilityRangeOfRanges                      TimeUntilExplosion;                                // 0x58(0x30)
	bool                                                         IsFlare;                                           // 0x88(0x1)
	bool                                                         ShouldCastAmbientLight;                            // 0x89(0x1)
	char                                                         pad0x2_VTT1I[0x2];                                 // 0x8a(0x2)
	struct FireworkAmbientLightData                              FireworkAmbientLightData;                          // 0x8c(0x14)
	TArray<struct WeightedFireworkVFXData>                       Explosions;                                        // 0xa0(0x10)
	struct WeightedProbabilityRange                              NumExplosions;                                     // 0xb0(0x20)
	struct WeightedProbabilityRangeOfRanges                      TimeBetweenExplosions;                             // 0xd0(0x30)
	struct WeightedProbabilityRangeOfRanges                      ExplosionLocationOffset;                           // 0x100(0x30)
	float                                                        FlashbangRadius;                                   // 0x130(0x4)
	char                                                         pad0x4_QGYYW[0x4];                                 // 0x134(0x4)
	class WwiseObjectPoolWrapper*                                ExplosionSfxPool;                                  // 0x138(0x8)
	class WwiseEvent*                                            LaunchSfx;                                         // 0x140(0x8)
	class FireworkFeedbackDataAsset*                             FireworkFeedbackData;                              // 0x148(0x8)
};


// Size 0x10 (Full Size[0x160] - InheritedSize[0x150]
class FireworkSequentialDataAsset: public FireworkDataAsset
{
public:
	TArray<struct FireworkSequentialSelectionType>               FireworkSequentialSelections;                      // 0x150(0x10)
};


