#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x1
struct EventFireballCannonIsReadyToFire
{
public:
	char                                                         pad0x1_VQ88F[0x1];                                 // 0x0(0x1)
};


// Size 0x14
struct FireballCannonDynamicMaterialParameters
{
public:
	struct FName                                                 VectorMaterialParameterName;                       // 0x0(0x8)
	float                                                        ReadyToFireValue;                                  // 0x8(0x4)
	float                                                        FiringValue;                                       // 0xc(0x4)
	float                                                        NoChargeValue;                                     // 0x10(0x4)
};


// Size 0x1
struct EventFireballCannonHasStartedToCooldown
{
public:
	char                                                         pad0x1_S2NEB[0x1];                                 // 0x0(0x1)
};


// Size 0x1c
struct FireballCannonProjectileFirePoint
{
public:
	struct Vector                                                FireFromLocation;                                  // 0x0(0xc)
	struct Rotator                                               FireFromRotation;                                  // 0xc(0xc)
	float                                                        FireDelay;                                         // 0x18(0x4)
};


// Size 0x1
struct EventShootFireballCannon
{
public:
	char                                                         pad0x1_2ZH6K[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventFireballCannonFiringStateChanged
{
public:
	char                                                         FireballCannonFiringState;                         // 0x0(0x1)
	char                                                         pad0x7_Z7I4A[0x7];                                 // 0x1(0x7)
	class Object*                                                FireballCannonObject;                              // 0x8(0x8)
};


