// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x30
struct WeightedFireworkVFXData
{
public:
	Class Object*                                                VFX;                                               // 0x0(0x8)
	Class WwiseEvent*                                            Sfx;                                               // 0x8(0x8)
	Class WwiseEvent*                                            SecondarySFX;                                      // 0x10(0x8)
	float                                                        Weight;                                            // 0x18(0x4)
	Struct LinearColor                                           AmbientLightColour;                                // 0x1c(0x10)
};


// Size 0x58
struct GeneratedFireworkData
{
public:
	Struct FireworkAmbientLightData                              FireworkAmbientLightData;                          // 0xc(0x14)
	char                                                         pad0x8_DZUW7[0x8];                                 // 0x20(0x8)
	TArray<struct ExplosionData>                                 ExplosionData;                                     // 0x28(0x10)
	Class WwiseObjectPoolWrapper*                                SfxPool;                                           // 0x38(0x8)
	Class WwiseEvent*                                            LaunchSfx;                                         // 0x40(0x8)
	char                                                         pad0x8_ZB46V[0x8];                                 // 0x48(0x8)
	Class FireworkFeedbackDataAsset*                             FireworkFeedbackData;                              // 0x50(0x8)
};


// Size 0x40
struct FireworkExplosionData
{
public:
	Class Object*                                                VFX;                                               // 0x8(0x8)
	Class WwiseEvent*                                            Sfx;                                               // 0x10(0x8)
	Class WwiseEvent*                                            SecondarySFX;                                      // 0x18(0x8)
};


// Size 0x14
struct FireworkAmbientLightData
{
public:
	float                                                        FadeInTimer;                                       // 0x0(0x4)
	float                                                        FadeOutTimer;                                      // 0x4(0x4)
	float                                                        LifetimeTimer;                                     // 0x8(0x4)
	float                                                        Radius;                                            // 0xc(0x4)
	float                                                        AmbientIntensity;                                  // 0x10(0x4)
};


// Size 0x178
struct WeightedProjectileMeshAnimationData
{
public:
	Struct RuntimeVectorCurve                                    AnimationCurve;                                    // 0x0(0x170)
	float                                                        Weight;                                            // 0x170(0x4)
};


}