#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x18
struct PlayerSetFlameOfFateEvent
{
public:
	class Character*                                             PlayerCharacter;                                   // 0x0(0x8)
	class Object*                                                Target;                                            // 0x8(0x8)
	char                                                         FlameOfFateType;                                   // 0x10(0x1)
};


// Size 0x2
struct FlameData
{
public:
	char                                                         FlameOfFateType;                                   // 0x0(0x1)
	bool                                                         SkipChangeAnimation;                               // 0x1(0x1)
};


// Size 0x10
struct SetFlameOfFateEvent
{
public:
	char                                                         FlameOfFateType;                                   // 0x0(0x1)
	class Object*                                                Source;                                            // 0x8(0x8)
};


// Size 0x18
struct PlayerTookFlameOfFateEvent
{
public:
	class Character*                                             PlayerCharacter;                                   // 0x0(0x8)
	class Object*                                                Source;                                            // 0x8(0x8)
	char                                                         FlameOfFateType;                                   // 0x10(0x1)
};


// Size 0x18
struct SetShipFlameOfFateEvent
{
public:
	char                                                         FlameOfFateType;                                   // 0x0(0x1)
	class Object*                                                Source;                                            // 0x8(0x8)
	class Object*                                                Ship;                                              // 0x10(0x8)
};


// Size 0x18
struct CycleFlameOfFateSequence
{
public:
	TArray<char>                                                 FlameTypeSequence;                                 // 0x0(0x10)
};


