// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x18
struct CycleFlameOfFateSequence
{
public:
	TArray<Byte FlameTypeSequence>                               FlameTypeSequence;                                 // 0x0(0x10)
	char                                                         pad0x8_FEWOQ[0x8];                                 // 0x10(0x8)
};


// Size 0x2
struct FlameData
{
public:
	byte                                                         FlameOfFateType;                                   // 0x0(0x1)
	bool                                                         SkipChangeAnimation;                               // 0x1(0x1)
};


// Size 0x18
struct PlayerTookFlameOfFateEvent
{
public:
	class Character*                                             PlayerCharacter;                                   // 0x0(0x8)
	class Object*                                                Source;                                            // 0x8(0x8)
	byte                                                         FlameOfFateType;                                   // 0x10(0x1)
	char                                                         pad0x7_9RRHI[0x7];                                 // 0x11(0x7)
};


// Size 0x18
struct PlayerSetFlameOfFateEvent
{
public:
	class Character*                                             PlayerCharacter;                                   // 0x0(0x8)
	class Object*                                                Target;                                            // 0x8(0x8)
	byte                                                         FlameOfFateType;                                   // 0x10(0x1)
	char                                                         pad0x7_OL67F[0x7];                                 // 0x11(0x7)
};


// Size 0x18
struct SetShipFlameOfFateEvent
{
public:
	byte                                                         FlameOfFateType;                                   // 0x0(0x1)
	char                                                         pad0x7_VIVJ5[0x7];                                 // 0x1(0x7)
	class Object*                                                Source;                                            // 0x8(0x8)
	class Object*                                                Ship;                                              // 0x10(0x8)
};


// Size 0x10
struct SetFlameOfFateEvent
{
public:
	byte                                                         FlameOfFateType;                                   // 0x0(0x1)
	char                                                         pad0x7_FFQX0[0x7];                                 // 0x1(0x7)
	class Object*                                                Source;                                            // 0x8(0x8)
};


}