// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20 (Full Size[0x7c0] - InheritedSize[0x7a0]
class FoliageInstancedStaticMeshComponent: public HierarchicalInstancedStaticMeshComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class FoliageStatistics: public BlueprintFunctionLibrary
{
public:
};


// Size 0x338 (Full Size[0x360] - InheritedSize[0x28]
class FoliageType: public Object
{
public:
	Struct Guid                                                  UpdateGuid;                                        // 0x28(0x10)
	float                                                        Density;                                           // 0x38(0x4)
	float                                                        DensityAdjustmentFactor;                           // 0x3c(0x4)
	float                                                        Radius;                                            // 0x40(0x4)
	byte                                                         Scaling;                                           // 0x44(0x1)
	char                                                         pad0x3_ZZ3SR[0x3];                                 // 0x45(0x3)
	Struct FloatInterval                                         ScaleX;                                            // 0x48(0x8)
	Struct FloatInterval                                         ScaleY;                                            // 0x50(0x8)
	Struct FloatInterval                                         ScaleZ;                                            // 0x58(0x8)
	byte                                                         VertexColorMask;                                   // 0x60(0x1)
	char                                                         pad0x3_B3O9N[0x3];                                 // 0x61(0x3)
	float                                                        VertexColorMaskThreshold;                          // 0x64(0x4)
	bool                                                         VertexColorMaskInvert;                             // 0x68(0x1)
	char                                                         pad0x3_00G45[0x3];                                 // 0x69(0x3)
	Struct FloatInterval                                         ZOffset;                                           // 0x6c(0x8)
	bool                                                         AlignToNormal;                                     // 0x74(0x1)
	char                                                         pad0x3_BBFST[0x3];                                 // 0x75(0x3)
	float                                                        AlignMaxAngle;                                     // 0x78(0x4)
	bool                                                         RandomYaw;                                         // 0x7c(0x1)
	char                                                         pad0x3_0MVLG[0x3];                                 // 0x7d(0x3)
	float                                                        RandomPitchAngle;                                  // 0x80(0x4)
	Struct FloatInterval                                         GroundSlopeAngle;                                  // 0x84(0x8)
	Struct FloatInterval                                         Height;                                            // 0x8c(0x8)
	char                                                         pad0x4_W3EI3[0x4];                                 // 0x94(0x4)
	TArray<Struct FName>                                         LandscapeLayers;                                   // 0x98(0x10)
	struct FName                                                 LandscapeLayer;                                    // 0xa8(0x8)
	bool                                                         CollisionWithWorld;                                // 0xb0(0x1)
	char                                                         pad0x3_1Q9AK[0x3];                                 // 0xb1(0x3)
	Struct Vector                                                CollisionScale;                                    // 0xb4(0xc)
	float                                                        MinimumLayerWeight;                                // 0xc0(0x4)
	Struct BoxSphereBounds                                       MeshBounds;                                        // 0xc4(0x1c)
	Struct Vector                                                LowBoundOriginRadius;                              // 0xe0(0xc)
	byte                                                         Mobility;                                          // 0xec(0x1)
	char                                                         pad0x3_WYRGD[0x3];                                 // 0xed(0x3)
	Struct Int32Interval                                         CullDistance;                                      // 0xf0(0x8)
	bool                                                         bEnableStaticLighting;                             // 0xf8(0x1)
	bool                                                         CastShadow;                                        // 0xf8(0x1)
	bool                                                         bAffectDynamicIndirectLighting;                    // 0xf8(0x1)
	bool                                                         bAffectDistanceFieldLighting;                      // 0xf8(0x1)
	bool                                                         bCastDynamicShadow;                                // 0xf8(0x1)
	bool                                                         bCastStaticShadow;                                 // 0xf8(0x1)
	bool                                                         bCastShadowAsTwoSided;                             // 0xf8(0x1)
	bool                                                         bReceivesDecals;                                   // 0xf8(0x1)
	bool                                                         bOverrideLightMapRes;                              // 0xf9(0x1)
	char                                                         pad0x2_DNUCK[0x2];                                 // 0xfa(0x2)
	int                                                          OverriddenLightMapRes;                             // 0xfc(0x4)
	bool                                                         bUseAsOccluder;                                    // 0x100(0x1)
	char                                                         pad0x7_M08BG[0x7];                                 // 0x101(0x7)
	Struct BodyInstance                                          BodyInstance;                                      // 0x108(0x180)
	byte                                                         CustomNavigableGeometry;                           // 0x288(0x1)
	char                                                         pad0x7_HQMGG[0x7];                                 // 0x289(0x7)
	bool                                                         IsSelected;                                        // 0x298(0x1)
	char                                                         pad0x3_JOXTW[0x3];                                 // 0x299(0x3)
	float                                                        CollisionRadius;                                   // 0x29c(0x4)
	float                                                        ShadeRadius;                                       // 0x2a0(0x4)
	int                                                          NumSteps;                                          // 0x2a4(0x4)
	float                                                        InitialSeedDensity;                                // 0x2a8(0x4)
	float                                                        AverageSpreadDistance;                             // 0x2ac(0x4)
	float                                                        SpreadVariance;                                    // 0x2b0(0x4)
	int                                                          SeedsPerStep;                                      // 0x2b4(0x4)
	int                                                          DistributionSeed;                                  // 0x2b8(0x4)
	float                                                        MaxInitialSeedOffset;                              // 0x2bc(0x4)
	bool                                                         bCanGrowInShade;                                   // 0x2c0(0x1)
	bool                                                         bSpawnsInShade;                                    // 0x2c1(0x1)
	char                                                         pad0x2_V6RGD[0x2];                                 // 0x2c2(0x2)
	float                                                        MaxInitialAge;                                     // 0x2c4(0x4)
	float                                                        MaxAge;                                            // 0x2c8(0x4)
	float                                                        OverlapPriority;                                   // 0x2cc(0x4)
	Struct FloatInterval                                         ProceduralScale;                                   // 0x2d0(0x8)
	Struct RuntimeFloatCurve                                     ScaleCurve;                                        // 0x2d8(0x80)
	int                                                          ChangeCount;                                       // 0x358(0x4)
	bool                                                         ReapplyDensity;                                    // 0x35c(0x1)
	bool                                                         ReapplyRadius;                                     // 0x35c(0x1)
	bool                                                         ReapplyAlignToNormal;                              // 0x35c(0x1)
	bool                                                         ReapplyRandomYaw;                                  // 0x35c(0x1)
	bool                                                         ReapplyScaling;                                    // 0x35c(0x1)
	bool                                                         ReapplyScaleX;                                     // 0x35c(0x1)
	bool                                                         ReapplyScaleY;                                     // 0x35c(0x1)
	bool                                                         ReapplyScaleZ;                                     // 0x35c(0x1)
	bool                                                         ReapplyRandomPitchAngle;                           // 0x35d(0x1)
	bool                                                         ReapplyGroundSlope;                                // 0x35d(0x1)
	bool                                                         ReapplyHeight;                                     // 0x35d(0x1)
	bool                                                         ReapplyLandscapeLayers;                            // 0x35d(0x1)
	bool                                                         ReapplyZOffset;                                    // 0x35d(0x1)
	bool                                                         ReapplyCollisionWithWorld;                         // 0x35d(0x1)
	bool                                                         ReapplyVertexColorMask;                            // 0x35d(0x1)
	char                                                         pad0x4_DCFJL[0x4];                                 // 0x35c(0x4)
};


// Size 0x20 (Full Size[0x380] - InheritedSize[0x360]
class FoliageType_InstancedStaticMesh: public FoliageType
{
public:
	Class StaticMesh*                                            Mesh;                                              // 0x360(0x8)
	TArray<class MaterialInterface*>                             OverrideMaterials;                                 // 0x368(0x10)
	class                                                        ComponentClass;                                    // 0x378(0x8)
};


// Size 0x50 (Full Size[0x418] - InheritedSize[0x3c8]
class InstancedFoliageActor: public Actor
{
public:
};


// Size 0x60 (Full Size[0x438] - InheritedSize[0x3d8]
class InteractiveFoliageActor: public StaticMeshActor
{
public:
	Class CapsuleComponent*                                      CapsuleComponent;                                  // 0x3d8(0x8)
	Struct Vector                                                TouchingActorEntryPosition;                        // 0x3e0(0xc)
	Struct Vector                                                FoliageVelocity;                                   // 0x3ec(0xc)
	Struct Vector                                                FoliageForce;                                      // 0x3f8(0xc)
	Struct Vector                                                FoliagePosition;                                   // 0x404(0xc)
	float                                                        FoliageDamageImpulseScale;                         // 0x410(0x4)
	float                                                        FoliageTouchImpulseScale;                          // 0x414(0x4)
	float                                                        FoliageStiffness;                                  // 0x418(0x4)
	float                                                        FoliageStiffnessQuadratic;                         // 0x41c(0x4)
	float                                                        FoliageDamping;                                    // 0x420(0x4)
	float                                                        MaxDamageImpulse;                                  // 0x424(0x4)
	float                                                        MaxTouchImpulse;                                   // 0x428(0x4)
	float                                                        MaxForce;                                          // 0x42c(0x4)
	float                                                        Mass;                                              // 0x430(0x4)
	char                                                         pad0xc_L1T0F[0xc];                                 // 0x432(0xc)
};


// Size 0x10 (Full Size[0x630] - InheritedSize[0x620]
class InteractiveFoliageComponent: public StaticMeshComponent
{
public:
};


// Size 0x8 (Full Size[0x408] - InheritedSize[0x400]
class ProceduralFoliageBlockingVolume: public Volume
{
public:
	Class ProceduralFoliageVolume*                               ProceduralFoliageVolume;                           // 0x400(0x8)
};


// Size 0x28 (Full Size[0xf0] - InheritedSize[0xc8]
class ProceduralFoliageComponent: public ActorComponent
{
public:
	Class ProceduralFoliageSpawner*                              FoliageSpawner;                                    // 0xc8(0x8)
	float                                                        TileOverlap;                                       // 0xd0(0x4)
	char                                                         pad0x4_O3FOH[0x4];                                 // 0xd4(0x4)
	Class Volume*                                                SpawningVolume;                                    // 0xd8(0x8)
	Struct Guid                                                  ProceduralGuid;                                    // 0xe0(0x10)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class ProceduralFoliageSpawner: public Object
{
public:
	int                                                          RandomSeed;                                        // 0x28(0x4)
	float                                                        TileSize;                                          // 0x2c(0x4)
	int                                                          NumUniqueTiles;                                    // 0x30(0x4)
	char                                                         pad0x4_RSXTI[0x4];                                 // 0x34(0x4)
	TArray<Struct FoliageTypeObject>                             FoliageTypes;                                      // 0x38(0x10)
	bool                                                         bNeedsSimulation;                                  // 0x48(0x1)
	char                                                         pad0x21_LVR0L[0x21];                               // 0x47(0x21)
};


// Size 0x128 (Full Size[0x150] - InheritedSize[0x28]
class ProceduralFoliageTile: public Object
{
public:
	Class ProceduralFoliageSpawner*                              FoliageSpawner;                                    // 0x28(0x8)
	char                                                         pad0xa0_UXCNJ[0xa0];                               // 0x30(0xa0)
	TArray<Struct ProceduralFoliageInstance>                     InstancesArray;                                    // 0xd0(0x10)
	char                                                         pad0x90_UVOV3[0x90];                               // 0xde(0x90)
};


// Size 0x8 (Full Size[0x408] - InheritedSize[0x400]
class ProceduralFoliageVolume: public Volume
{
public:
	Class ProceduralFoliageComponent*                            ProceduralComponent;                               // 0x400(0x8)
};


}