// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x88
class FotF_BellesBuoy_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3c8(0x8)
	Class PointLightComponent*                                   None;                                              // 0x3d0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	Class SceneComponent*                                        None;                                              // 0x3f0(0x8)
	Struct WwiseEmitter                                          None;                                              // 0x3f8(0x20)
	Struct WwiseEmitterCreationParams                            None;                                              // 0x418(0x28)
	Class WwiseEvent*                                            None;                                              // 0x440(0x8)
	Class WwiseObjectPoolWrapper*                                None;                                              // 0x448(0x8)
};


// Size 0x40
class FotF_BelleDialogTempEntitlement_C: public AggressiveGhostShipPortal
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x410(0x8)
	Class ParticleSystemComponent*                               Portal VFX;                                        // 0x418(0x8)
	Class WwiseEmitterComponent*                                 WwiseEmitter;                                      // 0x420(0x8)
	Class StaticMeshComponent*                                   Portal;                                            // 0x428(0x8)
	Class StaticMeshComponent*                                   shroud;                                            // 0x430(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x438(0x8)
	TArray<class DynamicMaterials*>                              DynamicMaterials;                                  // 0x440(0x10)
};


}