// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x28
struct GameplayTagContainer
{
public:
	TArray<Struct GameplayTag>                                   GameplayTags;                                      // 0x8(0x10)
	TArray<Struct FName>                                         Tags;                                              // 0x18(0x10)
};


// Size 0x8
struct GameplayTag
{
public:
	struct FName                                                 TagName;                                           // 0x0(0x8)
};


// Size 0x48
struct GameplayTagQuery
{
public:
	int                                                          TokenStreamVersion;                                // 0x0(0x4)
	TArray<Struct GameplayTag>                                   TagDictionary;                                     // 0x8(0x10)
	TArray<Byte QueryTokenStream>                                QueryTokenStream;                                  // 0x18(0x10)
	Struct FString                                               UserDescription;                                   // 0x28(0x10)
	Struct FString                                               AutoDescription;                                   // 0x38(0x10)
};


// Size 0x78
struct GameplayTagNode
{
public:
};


// Size 0x48
struct GameplayTagTableRow
{
public:
	Struct FString                                               Tag;                                               // 0x0(0x10)
	Struct FText                                                 CategoryText;                                      // 0x10(0x38)
};


}