// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class GameEventAvailabilityParamsDataAsset: public DataAsset
{
public:
	struct WeightedProbabilityRangeOfRanges                      MatchmakingCooldownRanges;                         // 0x28(0x30)
	struct WeightedProbabilityRange                              CrewsJoinedOnDemandLimitRange;                     // 0x58(0x20)
	float                                                        InitialCooldown;                                   // 0x78(0x4)
	int                                                          ProgressStateLimit;                                // 0x7c(0x4)
	bool                                                         ShouldApplyShipTypeLimit;                          // 0x80(0x1)
	bool                                                         ShouldTrackCrewsEngagingEmergently;                // 0x81(0x1)
	char                                                         pad0x2_OJRL4[0x2];                                 // 0x82(0x2)
	float                                                        EmergentCrewLeftRegionCooldown;                    // 0x84(0x4)
	bool                                                         SendCrewToLoserTunnelOnShipSinking;                // 0x88(0x1)
	bool                                                         ShouldCompletedBannersPlayAudio;                   // 0x89(0x1)
	char                                                         pad0x2_0QZOZ[0x2];                                 // 0x8a(0x2)
	float                                                        ActiveEventExclusionRadiusFromIslandDistanceRadiusModifier; // 0x8c(0x4)
};


// Size 0x100 (Full Size[0x128] - InheritedSize[0x28]
class GameEventOnDemandAvailabilityHandler: public Object
{
public:
	class GameEventAvailabilityParamsDataAsset*                  AvailabilityParamsAsset;                           // 0x28(0x8)
	class GameEventOnDemandAvailabilityStateTracker*             AvailabilityStateTracker;                          // 0x30(0x8)
	class UClass*                                                GameEventType;                                     // 0x38(0x8)
	class UClass*                                                Company;                                           // 0x40(0x8)
	char                                                         pad0x10_FI68B[0x10];                               // 0x48(0x10)
	byte                                                         CompletedState;                                    // 0x58(0x1)
	char                                                         pad0xcf_TNATZ[0xcf];                               // 0x59(0xcf)
};


// Size 0x138 (Full Size[0x160] - InheritedSize[0x28]
class GameEventOnDemandAvailabilityStateTracker: public Object
{
public:
	char                                                         pad0x88_SIFU7[0x88];                               // 0x28(0x88)
	class UClass*                                                ShipTypeLimit;                                     // 0xb0(0x8)
	TArray<struct Guid>                                          OnDemandParticipatingCrewIds;                      // 0xb8(0x10)
	TArray<struct Guid>                                          EmergentlyParticipatingCrewIds;                    // 0xc8(0x10)
	char                                                         pad0x88_63GGU[0x88];                               // 0xd8(0x88)
};


// Size 0x0 (Full Size[0x130] - InheritedSize[0x130]
class GameEventOnDemandVoyageProposalDesc: public VoyageProposalDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventsOnDemandAvailabilityServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventsOnDemandInstanceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventsOnDemandInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventsOnDemandLoserTunnelServiceInterface: public Interface
{
public:
};


// Size 0x90 (Full Size[0x128] - InheritedSize[0x98]
class WaitForGameEventOnDemandToCompleteStep: public TaleQuestStep
{
public:
	char                                                         pad0x90_OD6PM[0x90];                               // 0x98(0x90)
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class WaitForGameEventOnDemandToCompleteStepDesc: public TaleQuestStepDesc
{
public:
};


}