#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class GameplayTask: public Object
{
public:
	struct FName                                                 InstanceName;                                      // 0x28(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class GameplayTaskResource: public Object
{
public:
	int                                                          ManualResourceID;                                  // 0x28(0x4)
	bool                                                         bManuallySetID;                                    // 0x30(0x1)
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class GameplayTasksComponent: public ActorComponent
{
public:
	TArray<class GameplayTask*>                                  SimulatedTasks;                                    // 0xd0(0x10)
	TArray<class GameplayTask*>                                  TaskPriorityQueue;                                 // 0xe0(0x10)
	multicastinlinedelegate                                      OnClaimedResourcesChange;                          // 0x118(0x10)
};


// Size 0x18 (Full Size[0x70] - InheritedSize[0x58]
class GameplayTask_WaitDelay: public GameplayTask
{
public:
	multicastinlinedelegate                                      OnFinish;                                          // 0x58(0x10)
};


// Size 0x40 (Full Size[0x98] - InheritedSize[0x58]
class GameplayTask_SpawnActor: public GameplayTask
{
public:
	multicastinlinedelegate                                      Success;                                           // 0x58(0x10)
	multicastinlinedelegate                                      DidNotSpawn;                                       // 0x68(0x10)
	class UClass*                                                ClassToSpawn;                                      // 0x90(0x8)
};


