// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x230 (Full Size[0x7f0] - InheritedSize[0x5c0]
class GameplayDebuggingComponent: public PrimitiveComponent
{
public:
	Struct FString                                               DebugComponentClassName;                           // 0x5c0(0x10)
	int                                                          ShowExtendedInformatiomCounter;                    // 0x5d0(0x4)
	char                                                         pad0x4_JVOT2[0x4];                                 // 0x5d4(0x4)
	TArray<Int ReplicateViewDataCounters>                        ReplicateViewDataCounters;                         // 0x5d8(0x10)
	Struct FString                                               ControllerName;                                    // 0x5e8(0x10)
	Struct FString                                               PawnName;                                          // 0x5f8(0x10)
	Struct FString                                               PawnClass;                                         // 0x608(0x10)
	Struct FString                                               DebugIcon;                                         // 0x618(0x10)
	Struct FString                                               MovementBaseInfo;                                  // 0x628(0x10)
	Struct FString                                               MovementModeInfo;                                  // 0x638(0x10)
	Struct FString                                               PathFollowingInfo;                                 // 0x648(0x10)
	Struct FString                                               CurrentAITask;                                     // 0x658(0x10)
	Struct FString                                               CurrentAIState;                                    // 0x668(0x10)
	Struct FString                                               CurrentAIAssets;                                   // 0x678(0x10)
	Struct FString                                               GameplayTasksState;                                // 0x688(0x10)
	Struct FString                                               NavDataInfo;                                       // 0x698(0x10)
	Struct FString                                               AbilityInfo;                                       // 0x6a8(0x10)
	Struct FString                                               MontageInfo;                                       // 0x6b8(0x10)
	Struct FString                                               BrainComponentName;                                // 0x6c8(0x10)
	Struct FString                                               BrainComponentString;                              // 0x6d8(0x10)
	TArray<Byte BlackboardRepData>                               BlackboardRepData;                                 // 0x6e8(0x10)
	char                                                         pad0x10_UIRZJ[0x10];                               // 0x6f8(0x10)
	TArray<struct PathPoints>                                    PathPoints;                                        // 0x708(0x10)
	TArray<Byte PathCorridorData>                                PathCorridorData;                                  // 0x718(0x10)
	char                                                         pad0x10_UIAEU[0x10];                               // 0x728(0x10)
	TArray<Byte NavmeshRepData>                                  NavmeshRepData;                                    // 0x738(0x10)
	TArray<Byte EQSRepData>                                      EQSRepData;                                        // 0x748(0x10)
	Struct Vector                                                SensingComponentLocation;                          // 0x758(0xc)
	int                                                          NextPathPointIndex;                                // 0x764(0x4)
	bool                                                         bIsUsingPathFollowing;                             // 0x768(0x1)
	bool                                                         bIsUsingCharacter;                                 // 0x768(0x1)
	bool                                                         bIsUsingBehaviorTree;                              // 0x768(0x1)
	bool                                                         bIsUsingAbilities;                                 // 0x768(0x1)
	char                                                         pad0x7_MI9F7[0x7];                                 // 0x769(0x7)
	Class Actor*                                                 TargetActor;                                       // 0x770(0x8)
	char                                                         pad0x88_9W57K[0x88];                               // 0x776(0x88)
};


// Size 0xf0 (Full Size[0x4b8] - InheritedSize[0x3c8]
class GameplayDebuggingHUDComponent: public Actor
{
public:
	float                                                        MenuStartX;                                        // 0x3c8(0x4)
	float                                                        MenuStartY;                                        // 0x3cc(0x4)
	float                                                        DebugInfoStartX;                                   // 0x3d0(0x4)
	float                                                        DebugInfoStartY;                                   // 0x3d4(0x4)
	Class Canvas*                                                Canvas;                                            // 0x3d8(0x8)
	Class PlayerController*                                      PlayerOwner;                                       // 0x3e0(0x8)
	char                                                         pad0xe0_G1D1N[0xe0];                               // 0x3e6(0xe0)
};


// Size 0x80 (Full Size[0xa8] - InheritedSize[0x28]
class GameplayDebuggerSettings: public Object
{
public:
	Struct GDTCustomViewNames                                    CustomViewNames;                                   // 0x28(0x50)
	bool                                                         OverHead;                                          // 0x78(0x1)
	bool                                                         Basic;                                             // 0x79(0x1)
	bool                                                         BehaviorTree;                                      // 0x7a(0x1)
	bool                                                         EQS;                                               // 0x7b(0x1)
	bool                                                         EnableEQSOnHUD;                                    // 0x7c(0x1)
	char                                                         pad0x3_BE2H9[0x3];                                 // 0x7d(0x3)
	int                                                          ActiveEQSIndex;                                    // 0x80(0x4)
	bool                                                         Perception;                                        // 0x84(0x1)
	bool                                                         GameView1;                                         // 0x85(0x1)
	bool                                                         GameView2;                                         // 0x86(0x1)
	bool                                                         GameView3;                                         // 0x87(0x1)
	bool                                                         GameView4;                                         // 0x88(0x1)
	bool                                                         GameView5;                                         // 0x89(0x1)
	char                                                         pad0x20_W7ETK[0x20];                               // 0x88(0x20)
};


// Size 0x2a0 (Full Size[0x368] - InheritedSize[0xc8]
class GameplayDebuggingControllerComponent: public ActorComponent
{
public:
	Class GameplayDebuggingHUDComponent*                         OnDebugAIHUD;                                      // 0xc8(0x8)
	Class Actor*                                                 DebugAITargetActor;                                // 0xd0(0x8)
	Class InputComponent*                                        AIDebugViewInputComponent;                         // 0xd8(0x8)
	Class InputComponent*                                        DebugCameraInputComponent;                         // 0xe0(0x8)
	char                                                         pad0x28_6X042[0x28];                               // 0xe8(0x28)
	Struct InputChord                                            ActivationKey;                                     // 0x110(0x28)
	Struct InputChord                                            CategoryZeroBind;                                  // 0x138(0x28)
	Struct InputChord                                            CategoryOneBind;                                   // 0x160(0x28)
	Struct InputChord                                            CategoryTwoBind;                                   // 0x188(0x28)
	Struct InputChord                                            CategoryThreeBind;                                 // 0x1b0(0x28)
	Struct InputChord                                            CategoryFourBind;                                  // 0x1d8(0x28)
	Struct InputChord                                            CategoryFiveBind;                                  // 0x200(0x28)
	Struct InputChord                                            CategorySixBind;                                   // 0x228(0x28)
	Struct InputChord                                            CategorySevenBind;                                 // 0x250(0x28)
	Struct InputChord                                            CategoryEightBind;                                 // 0x278(0x28)
	Struct InputChord                                            CategoryNineBind;                                  // 0x2a0(0x28)
	Struct InputChord                                            CycleDetailsViewBind;                              // 0x2c8(0x28)
	Struct InputChord                                            DebugCameraBind;                                   // 0x2f0(0x28)
	Struct InputChord                                            OnScreenDebugMessagesBind;                         // 0x318(0x28)
	Struct InputChord                                            GameHUDBind;                                       // 0x340(0x28)
};


// Size 0x30 (Full Size[0x4f0] - InheritedSize[0x4c0]
class GaneplayDebuggerProxyHUD: public HUD
{
public:
};


// Size 0xb0 (Full Size[0x478] - InheritedSize[0x3c8]
class GameplayDebuggingReplicator: public Actor
{
public:
	Struct FString                                               DebugComponentClassName;                           // 0x3c8(0x10)
	Struct FString                                               DebugComponentHUDClassName;                        // 0x3d8(0x10)
	Struct FString                                               DebugComponentControllerClassName;                 // 0x3e8(0x10)
	int                                                          MaxEQSQueries;                                     // 0x3f8(0x4)
	char                                                         pad0x4_3QDZ9[0x4];                                 // 0x3fc(0x4)
	Class GameplayDebuggingComponent*                            DebugComponent;                                    // 0x400(0x8)
	Class PlayerController*                                      LocalPlayerOwner;                                  // 0x408(0x8)
	Class Actor*                                                 LastSelectedActorToDebug;                          // 0x410(0x8)
	bool                                                         bIsGlobalInWorld;                                  // 0x418(0x1)
	bool                                                         bAutoActivate;                                     // 0x419(0x1)
	bool                                                         OverHead;                                          // 0x41a(0x1)
	bool                                                         Basic;                                             // 0x41b(0x1)
	bool                                                         BehaviorTree;                                      // 0x41c(0x1)
	bool                                                         EQS;                                               // 0x41d(0x1)
	bool                                                         EnableEQSOnHUD;                                    // 0x41e(0x1)
	char                                                         pad0x1_17V9Q[0x1];                                 // 0x41f(0x1)
	int                                                          ActiveEQSIndex;                                    // 0x420(0x4)
	bool                                                         Perception;                                        // 0x424(0x1)
	bool                                                         GameView1;                                         // 0x425(0x1)
	bool                                                         GameView2;                                         // 0x426(0x1)
	bool                                                         GameView3;                                         // 0x427(0x1)
	bool                                                         GameView4;                                         // 0x428(0x1)
	bool                                                         GameView5;                                         // 0x429(0x1)
	char                                                         pad0x50_RHAB9[0x50];                               // 0x428(0x50)
};


}