// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x28
struct GameplayTagContainer
{
public:
	char                                                         pad0x8_RZE1I[0x8];                                 // 0x0(0x8)
	TArray<struct GameplayTag>                                   GameplayTags;                                      // 0x8(0x10)
	TArray<struct FName>                                         Tags;                                              // 0x18(0x10)
};


// Size 0x8
struct GameplayTag
{
public:
	struct FName                                                 TagName;                                           // 0x0(0x8)
};


// Size 0x48
struct GameplayTagQuery
{
public:
	int                                                          TokenStreamVersion;                                // 0x0(0x4)
	char                                                         pad0x4_75BQ9[0x4];                                 // 0x4(0x4)
	TArray<struct GameplayTag>                                   TagDictionary;                                     // 0x8(0x10)
	TArray<Byte QueryTokenStream>                                QueryTokenStream;                                  // 0x18(0x10)
	struct FString                                               UserDescription;                                   // 0x28(0x10)
	struct FString                                               AutoDescription;                                   // 0x38(0x10)
};


// Size 0x78
struct GameplayTagNode
{
public:
	char                                                         pad0x78_PWRZY[0x78];                               // 0x0(0x78)
};


// Size 0x48
struct GameplayTagTableRow
{
public:
	struct FString                                               Tag;                                               // 0x0(0x10)
	struct FText                                                 CategoryText;                                      // 0x10(0x38)
};


}