#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "GameEventsOnDemand_Structs.h"


// Size 0xf0 (Full Size[0x118] - InheritedSize[0x28]
class GameEventsOnDemandAvailabilityService: public Object
{
public:
	char                                                         pad0xd0_K9QY4[0xd0];                               // 0x28(0xd0)
	class World*                                                 World;                                             // 0xf8(0x8)
	char                                                         pad0x18_UCR4M[0x18];                               // 0x100(0x18)
};


// Size 0x140 (Full Size[0x4e0] - InheritedSize[0x3a0]
class GameEventsOnDemandLoserTunnelService: public Actor
{
public:
	char                                                         pad0x8_IVCSM[0x8];                                 // 0x3a0(0x8)
	class World*                                                 World;                                             // 0x3a8(0x8)
	char                                                         pad0x58_W91ES[0x58];                               // 0x3b0(0x58)
	class VoyageDescDataAsset*                                   LoserTunnelVoyageDescDataAsset;                    // 0x408(0x8)
	char                                                         pad0x50_2TT5Z[0x50];                               // 0x410(0x50)
	TArray<struct GameEventsOnDemandLoserTunnelCrewData>         TrackedCrews;                                      // 0x460(0x10)
	struct FName                                                 TemporaryBannerTag;                                // 0x470(0x8)
	char                                                         pad0x68_GMBJI[0x68];                               // 0x478(0x68)
};


