// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class GameEventAvailabilityParamsDataAsset: public DataAsset
{
public:
	Struct WeightedProbabilityRangeOfRanges                      MatchmakingCooldownRanges;                         // 0x28(0x30)
	Struct WeightedProbabilityRange                              CrewsJoinedOnDemandLimitRange;                     // 0x58(0x20)
	float                                                        InitialCooldown;                                   // 0x78(0x4)
	int                                                          ProgressStateLimit;                                // 0x7c(0x4)
	bool                                                         ShouldApplyShipTypeLimit;                          // 0x80(0x1)
	char                                                         pad0x3_LLQK4[0x3];                                 // 0x81(0x3)
	Struct FeatureFlag                                           SendCrewToLoserTunnelFeature;                      // 0x84(0xc)
};


// Size 0xb8 (Full Size[0x180] - InheritedSize[0xc8]
class GameEventOnDemandAnnouncementComponent: public ActorComponent
{
public:
	Struct FeatureFlag                                           FeatureFlag;                                       // 0xc8(0xc)
	bool                                                         ShouldFireBannerForAnyCrewEnteringIslandVicinity;  // 0xd4(0x1)
	char                                                         pad0x3_1LK98[0x3];                                 // 0xd5(0x3)
	struct FName                                                 IslandName;                                        // 0xd8(0x8)
	TArray<Weakclass CurrentTrackedPawns>                        CurrentTrackedPawns;                               // 0xe0(0x10)
	TArray<struct OnDemandParticipatingCrewIds>                  OnDemandParticipatingCrewIds;                      // 0xf0(0x10)
	TArray<struct TrackedShipCrewIds>                            TrackedShipCrewIds;                                // 0x100(0x10)
	class                                                        GameEventType;                                     // 0x110(0x8)
	char                                                         pad0x5c_MBEAT[0x5c];                               // 0x118(0x5c)
	struct FName                                                 TemporaryBannerTag;                                // 0x174(0x8)
	char                                                         pad0x4_32UQN[0x4];                                 // 0x17c(0x4)
};


// Size 0x128 (Full Size[0x150] - InheritedSize[0x28]
class GameEventOnDemandAvailabilityStateTracker: public Object
{
public:
	char                                                         pad0x88_VSWRQ[0x88];                               // 0x28(0x88)
	class                                                        ShipTypeLimit;                                     // 0xb0(0x8)
	TArray<struct ParticipatingCrewIds>                          ParticipatingCrewIds;                              // 0xb8(0x10)
	TArray<struct PreparingToJoinCrewIds>                        PreparingToJoinCrewIds;                            // 0xc8(0x10)
	char                                                         pad0x78_FQQ8H[0x78];                               // 0xd8(0x78)
};


// Size 0x0 (Full Size[0x128] - InheritedSize[0x128]
class GameEventOnDemandVoyageProposalDesc: public VoyageProposalDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventsOnDemandAvailabilityServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventsOnDemandInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventsOnDemandLoserTunnelServiceInterface: public Interface
{
public:
};


}