#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x10
struct GameplayEffectModifiedAttribute
{
public:
	struct                                                       Attribute;                                         // 0x0(0x8)
	float                                                        TotalMagnitude;                                    // 0x8(0x4)
};


// Size 0x300
struct ActiveGameplayEffect
{
public:
	struct                                                       Spec;                                              // 0x10(0x2a0)
	struct                                                       PredictionKey;                                     // 0x2b0(0x18)
	float                                                        StartServerWorldTime;                              // 0x2c8(0x4)
	float                                                        CachedStartServerWorldTime;                        // 0x2cc(0x4)
	float                                                        StartWorldTime;                                    // 0x2d0(0x4)
	bool                                                         bIsInhibited;                                      // 0x2d4(0x1)
};


// Size 0x240
struct GameplayModifierInfo
{
public:
	struct                                                       Attribute;                                         // 0x0(0x8)
	char                                                         ModifierOp;                                        // 0x8(0x1)
	struct                                                       Magnitude;                                         // 0x10(0x20)
	struct                                                       ModifierMagnitude;                                 // 0x30(0x170)
	struct                                                       SourceTags;                                        // 0x1a0(0x50)
	struct                                                       TargetTags;                                        // 0x1f0(0x50)
};


// Size 0x8
struct GameplayAttribute
{
public:
	class Property*                                              Attribute;                                         // 0x0(0x8)
};


// Size 0x50
struct GameplayTagRequirements
{
public:
	struct                                                       RequireTags;                                       // 0x0(0x28)
	struct                                                       IgnoreTags;                                        // 0x28(0x28)
};


// Size 0x30
struct ActiveGameplayCue
{
public:
	struct                                                       GameplayCueTag;                                    // 0x8(0x8)
	struct                                                       PredictionKey;                                     // 0x10(0x18)
	bool                                                         bPredictivelyRemoved;                              // 0x28(0x1)
};


// Size 0x20
struct GameplayAbilityActivationInfo
{
public:
	char                                                         ActivationMode;                                    // 0x0(0x1)
	bool                                                         bCanBeEndedByOtherInstance;                        // 0x1(0x1)
	struct                                                       PredictionKeyWhenActivated;                        // 0x8(0x18)
};


// Size 0xf0
struct GameplayAbilityTargetData_LocationInfo
{
public:
	struct                                                       SourceLocation;                                    // 0x10(0x70)
	struct                                                       TargetLocation;                                    // 0x80(0x70)
};


// Size 0xa8
struct TagContainerAggregator
{
public:
	struct                                                       CapturedActorTags;                                 // 0x0(0x28)
	struct                                                       CapturedSpecTags;                                  // 0x28(0x28)
	struct                                                       ScopedTags;                                        // 0x50(0x28)
};


// Size 0xc
struct WorldReticleParameters
{
public:
	struct                                                       AOEScale;                                          // 0x0(0xc)
};


// Size 0xd0
struct GameplayEffectQuery
{
public:
	delegate                                                     CustomMatchDelegate_BP;                            // 0x8(0x10)
	struct                                                       OwningTagQuery;                                    // 0x18(0x48)
	struct                                                       EffectTagQuery;                                    // 0x60(0x48)
	struct                                                       ModifyingAttribute;                                // 0xa8(0x8)
	class Object*                                                EffectSource;                                      // 0xb0(0x8)
	class GameplayEffect*                                        EffectDefinition;                                  // 0xb8(0x8)
};


// Size 0x4
struct ActiveGameplayEffectHandle
{
public:
	int                                                          Handle;                                            // 0x0(0x4)
};


// Size 0x68
struct CustomCalculationBasedFloat
{
public:
	class UClass*                                                CalculationClassMagnitude;                         // 0x0(0x8)
	struct                                                       Coefficient;                                       // 0x8(0x20)
	struct                                                       PreMultiplyAdditiveValue;                          // 0x28(0x20)
	struct                                                       PostMultiplyAdditiveValue;                         // 0x48(0x20)
};


// Size 0x28
struct AttributeMetaData
{
public:
	float                                                        BaseValue;                                         // 0x0(0x4)
	float                                                        MinValue;                                          // 0x4(0x4)
	float                                                        MaxValue;                                          // 0x8(0x4)
	struct FString                                               DerivedAttributeInfo;                              // 0x10(0x10)
	bool                                                         bCanStack;                                         // 0x20(0x1)
};


// Size 0xd8
struct AttributeBasedFloat
{
public:
	struct                                                       Coefficient;                                       // 0x0(0x20)
	struct                                                       PreMultiplyAdditiveValue;                          // 0x20(0x20)
	struct                                                       PostMultiplyAdditiveValue;                         // 0x40(0x20)
	struct                                                       BackingAttribute;                                  // 0x60(0x10)
	struct                                                       AttributeCurve;                                    // 0x70(0x10)
	char                                                         AttributeCalculationType;                          // 0x80(0x1)
	struct                                                       SourceTagFilter;                                   // 0x88(0x28)
	struct                                                       TargetTagFilter;                                   // 0xb0(0x28)
};


// Size 0x10
struct AttributeDefaults
{
public:
	class UClass*                                                Attributes;                                        // 0x0(0x8)
	class DataTable*                                             DefaultStartingTable;                              // 0x8(0x8)
};


// Size 0x170
struct GameplayEffectModifierMagnitude
{
public:
	char                                                         MagnitudeCalculationType;                          // 0x0(0x1)
	struct                                                       ScalableFloatMagnitude;                            // 0x8(0x20)
	struct                                                       AttributeBasedMagnitude;                           // 0x28(0xd8)
	struct                                                       CustomMagnitude;                                   // 0x100(0x68)
	struct                                                       SetByCallerMagnitude;                              // 0x168(0x8)
};


// Size 0x30
struct GameplayAbilityRepAnimMontage
{
public:
	class AnimMontage*                                           AnimMontage;                                       // 0x0(0x8)
	float                                                        PlayRate;                                          // 0x8(0x4)
	float                                                        Position;                                          // 0xc(0x4)
	float                                                        BlendTime;                                         // 0x10(0x4)
	char                                                         NextSectionID;                                     // 0x14(0x1)
	bool                                                         IsStopped;                                         // 0x15(0x1)
	bool                                                         ForcePlayBit;                                      // 0x15(0x1)
	struct                                                       PredictionKey;                                     // 0x18(0x18)
};


// Size 0x38
struct GameplayEffectCue
{
public:
	struct                                                       MagnitudeAttribute;                                // 0x0(0x8)
	float                                                        MinLevel;                                          // 0x8(0x4)
	float                                                        MaxLevel;                                          // 0xc(0x4)
	struct                                                       GameplayCueTags;                                   // 0x10(0x28)
};


// Size 0x10
struct GameplayTagReponsePair
{
public:
	struct                                                       Tag;                                               // 0x0(0x8)
	class UClass*                                                ResponseGameplayEffect;                            // 0x8(0x8)
};


// Size 0x28
struct GameplayEffectAttributeCaptureSpec
{
public:
	struct                                                       BackingDefinition;                                 // 0x0(0x10)
};


// Size 0x18
struct GameplayModifierEvaluatedData
{
public:
	struct                                                       Attribute;                                         // 0x0(0x8)
	char                                                         ModifierOp;                                        // 0x8(0x1)
	float                                                        Magnitude;                                         // 0xc(0x4)
	struct                                                       Handle;                                            // 0x10(0x4)
	bool                                                         IsValid;                                           // 0x14(0x1)
};


// Size 0x20
struct ScalableFloat
{
public:
	float                                                        Value;                                             // 0x0(0x4)
	struct                                                       Curve;                                             // 0x8(0x10)
};


// Size 0x8
struct GameplayAbilitySpecHandleAndPredictionKey
{
public:
	struct                                                       AbilityHandle;                                     // 0x0(0x4)
	int                                                          PredictionKeyAtCreation;                           // 0x4(0x4)
};


// Size 0x4
struct GameplayAbilitySpecHandle
{
public:
	int                                                          Handle;                                            // 0x0(0x4)
};


// Size 0x90
struct GameplayAbilityTargetData_ActorArray
{
public:
	struct                                                       SourceLocation;                                    // 0x10(0x70)
	TArray<uintptr_t>                                            TargetActorArray;                                  // 0x80(0x10)
};


// Size 0x78
struct InheritedTagContainer
{
public:
	struct                                                       CombinedTags;                                      // 0x0(0x28)
	struct                                                       Added;                                             // 0x28(0x28)
	struct                                                       Removed;                                           // 0x50(0x28)
};


// Size 0x228
struct GameplayEffectExecutionScopedModifierInfo
{
public:
	struct                                                       CapturedAttribute;                                 // 0x0(0x10)
	char                                                         ModifierOp;                                        // 0x10(0x1)
	struct                                                       ModifierMagnitude;                                 // 0x18(0x170)
	struct                                                       SourceTags;                                        // 0x188(0x50)
	struct                                                       TargetTags;                                        // 0x1d8(0x50)
};


// Size 0xc
struct AbilityTriggerData
{
public:
	struct                                                       TriggerTag;                                        // 0x0(0x8)
	char                                                         TriggerSource;                                     // 0x8(0x1)
};


// Size 0x88
struct GameplayCueParameters
{
public:
	float                                                        NormalizedMagnitude;                               // 0x0(0x4)
	float                                                        RawMagnitude;                                      // 0x4(0x4)
	struct                                                       EffectContext;                                     // 0x8(0x20)
	struct FName                                                 MatchedTagName;                                    // 0x28(0x8)
	struct                                                       OriginalTag;                                       // 0x30(0x8)
	struct                                                       AggregatedSourceTags;                              // 0x38(0x28)
	struct                                                       AggregatedTargetTags;                              // 0x60(0x28)
};


// Size 0x10
struct GameplayEffectAttributeCaptureDefinition
{
public:
	struct                                                       AttributeToCapture;                                // 0x0(0x8)
	char                                                         AttributeSource;                                   // 0x8(0x1)
	bool                                                         bSnapshot;                                         // 0x9(0x1)
};


// Size 0x20
struct GameplayTagResponseTableEntry
{
public:
	struct                                                       Positive;                                          // 0x0(0x10)
	struct                                                       Negative;                                          // 0x10(0x10)
};


// Size 0x18
struct PredictionKey
{
public:
	int16                                                        Current;                                           // 0x0(0x2)
	int16                                                        Base;                                              // 0x2(0x2)
	class PackageMap*                                            PredictiveConnection;                              // 0x8(0x8)
	bool                                                         bIsStale;                                          // 0x10(0x1)
	bool                                                         bIsServerInitiated;                                // 0x11(0x1)
};


// Size 0x148
struct GameplayCuePendingExecute
{
public:
	struct                                                       GameplayCueTag;                                    // 0x0(0x8)
	struct                                                       PredictionKey;                                     // 0x8(0x18)
	char                                                         PayloadType;                                       // 0x20(0x1)
	class AbilitySystemComponent*                                OwningComponent;                                   // 0x28(0x8)
	struct                                                       FromSpec;                                          // 0x30(0x90)
	struct                                                       CueParameters;                                     // 0xc0(0x88)
};


// Size 0x28
struct GameplayAbilitySpecDef
{
public:
	class UClass*                                                Ability;                                           // 0x0(0x8)
	int                                                          Level;                                             // 0x8(0x4)
	int                                                          InputID;                                           // 0xc(0x4)
	char                                                         RemovalPolicy;                                     // 0x10(0x1)
	class Object*                                                SourceObject;                                      // 0x18(0x8)
	struct                                                       AssignedHandle;                                    // 0x20(0x4)
};


// Size 0x28
struct GameplayTargetDataFilter
{
public:
	class Actor*                                                 SelfActor;                                         // 0x8(0x8)
	char                                                         SelfFilter;                                        // 0x10(0x1)
	class UClass*                                                RequiredActorClass;                                // 0x18(0x8)
	bool                                                         bReverseFilter;                                    // 0x20(0x1)
};


// Size 0x70
struct GameplayAbilityTargetingLocationInfo
{
public:
	char                                                         LocationType;                                      // 0x10(0x1)
	struct                                                       LiteralTransform;                                  // 0x20(0x30)
	class Actor*                                                 SourceActor;                                       // 0x50(0x8)
	class MeshComponent*                                         SourceComponent;                                   // 0x58(0x8)
	class GameplayAbility*                                       SourceAbility;                                     // 0x60(0x8)
	struct FName                                                 SourceSocketName;                                  // 0x68(0x8)
};


// Size 0x10
struct GameplayAbilityBindInfo
{
public:
	char                                                         Command;                                           // 0x0(0x1)
	class UClass*                                                GameplayAbilityClass;                              // 0x8(0x8)
};


// Size 0xa0
struct GameplayEventData
{
public:
	struct                                                       EventTag;                                          // 0x0(0x8)
	class Actor*                                                 Instigator;                                        // 0x8(0x8)
	class Actor*                                                 Target;                                            // 0x10(0x8)
	class Object*                                                OptionalObject;                                    // 0x18(0x8)
	class Object*                                                OptionalObject2;                                   // 0x20(0x8)
	struct                                                       ContextHandle;                                     // 0x28(0x20)
	struct                                                       InstigatorTags;                                    // 0x48(0x28)
	struct                                                       TargetTags;                                        // 0x70(0x28)
	float                                                        EventMagnitude;                                    // 0x98(0x4)
};


// Size 0x78
struct GameplayAbilitySpec
{
public:
	struct                                                       Handle;                                            // 0x8(0x4)
	class GameplayAbility*                                       Ability;                                           // 0x10(0x8)
	int                                                          Level;                                             // 0x18(0x4)
	int                                                          InputID;                                           // 0x1c(0x4)
	class Object*                                                SourceObject;                                      // 0x20(0x8)
	bool                                                         InputPressed;                                      // 0x28(0x1)
	char                                                         ActiveCount;                                       // 0x29(0x1)
	bool                                                         RemoveAfterActivation;                             // 0x2a(0x1)
	struct                                                       ActivationInfo;                                    // 0x30(0x20)
	TArray<class GameplayAbility*>                               NonReplicatedInstances;                            // 0x50(0x10)
	TArray<class GameplayAbility*>                               ReplicatedInstances;                               // 0x60(0x10)
	struct                                                       GameplayEffectHandle;                              // 0x70(0x4)
	bool                                                         PendingRemove;                                     // 0x74(0x1)
};


// Size 0x88
struct GameplayAbilityTargetData_SingleTargetHit
{
public:
	struct                                                       HitResult;                                         // 0x8(0x80)
};


// Size 0x60
struct GameplayEffectContext
{
public:
	class Actor*                                                 Instigator;                                        // 0x8(0x8)
	class Actor*                                                 EffectCauser;                                      // 0x10(0x8)
	class Object*                                                SourceObject;                                      // 0x18(0x8)
	class AbilitySystemComponent*                                InstigatorAbilitySystemComponent;                  // 0x20(0x8)
	TArray<uintptr_t>                                            Actors;                                            // 0x28(0x10)
	struct                                                       WorldOrigin;                                       // 0x50(0xc)
	bool                                                         bHasWorldOrigin;                                   // 0x5c(0x1)
};


// Size 0x8
struct SetByCallerFloat
{
public:
	struct FName                                                 DataName;                                          // 0x0(0x8)
};


// Size 0x4
struct ModifierSpec
{
public:
	float                                                        EvaluatedMagnitude;                                // 0x0(0x4)
};


// Size 0x30
struct GameplayAbilityLocalAnimMontage
{
public:
	class AnimMontage*                                           AnimMontage;                                       // 0x0(0x8)
	bool                                                         PlayBit;                                           // 0x8(0x1)
	struct                                                       PredictionKey;                                     // 0x10(0x18)
	class GameplayAbility*                                       AnimatingAbility;                                  // 0x28(0x8)
};


// Size 0x28
struct GameplayCueNotifyData
{
public:
	struct                                                       GameplayCueTag;                                    // 0x0(0x8)
	struct                                                       GameplayCueNotifyObj;                              // 0x8(0x10)
	class UClass*                                                LoadedGameplayCueClass;                            // 0x18(0x8)
};


// Size 0x38
struct GameplayAbilityActorInfo
{
public:
	class Actor*                                                 OwnerActor;                                        // 0x8(0x8)
	class Actor*                                                 AvatarActor;                                       // 0x10(0x8)
	class PlayerController*                                      PlayerController;                                  // 0x18(0x8)
	class AbilitySystemComponent*                                AbilitySystemComponent;                            // 0x20(0x8)
	class AnimInstance*                                          AnimInstance;                                      // 0x28(0x8)
	class MovementComponent*                                     MovementComponent;                                 // 0x30(0x8)
};


// Size 0x2a0
struct GameplayEffectSpec
{
public:
	class GameplayEffect*                                        Def;                                               // 0x0(0x8)
	TArray<struct GameplayEffectModifiedAttribute>               ModifiedAttributes;                                // 0x8(0x10)
	struct                                                       CapturedRelevantAttributes;                        // 0x18(0x28)
	float                                                        Duration;                                          // 0x50(0x4)
	float                                                        Period;                                            // 0x54(0x4)
	float                                                        ChanceToApplyToTarget;                             // 0x58(0x4)
	struct                                                       CapturedSourceTags;                                // 0x60(0xa8)
	struct                                                       CapturedTargetTags;                                // 0x108(0xa8)
	struct                                                       DynamicGrantedTags;                                // 0x1b0(0x28)
	struct                                                       DynamicAssetTags;                                  // 0x1d8(0x28)
	TArray<struct ModifierSpec>                                  Modifiers;                                         // 0x200(0x10)
	int                                                          StackCount;                                        // 0x210(0x4)
	bool                                                         bCompletedSourceAttributeCapture;                  // 0x214(0x1)
	bool                                                         bCompletedTargetAttributeCapture;                  // 0x214(0x1)
	bool                                                         bDurationLocked;                                   // 0x214(0x1)
	TArray<struct GameplayAbilitySpecDef>                        GrantedAbilitySpecs;                               // 0x218(0x10)
	struct                                                       EffectContext;                                     // 0x278(0x20)
	float                                                        Level;                                             // 0x298(0x4)
};


// Size 0x28
struct GameplayEffectAttributeCaptureSpecContainer
{
public:
	TArray<struct GameplayEffectAttributeCaptureSpec>            SourceAttributes;                                  // 0x0(0x10)
	TArray<struct GameplayEffectAttributeCaptureSpec>            TargetAttributes;                                  // 0x10(0x10)
	bool                                                         bHasNonSnapshottedAttributes;                      // 0x20(0x1)
};


// Size 0xc0
struct GameplayAbilitySpecContainer
{
public:
	TArray<struct GameplayAbilitySpec>                           Items;                                             // 0xa8(0x10)
};


// Size 0x18
struct GameplayEffectCustomExecutionOutput
{
public:
	TArray<struct GameplayModifierEvaluatedData>                 OutputModifiers;                                   // 0x0(0x10)
	bool                                                         bTriggerConditionalGameplayEffects;                // 0x10(0x1)
	bool                                                         bHandledStackCountManually;                        // 0x10(0x1)
	bool                                                         bHandledGameplayCuesManually;                      // 0x10(0x1)
};


// Size 0x90
struct GameplayEffectSpecForRPC
{
public:
	class GameplayEffect*                                        Def;                                               // 0x0(0x8)
	TArray<struct GameplayEffectModifiedAttribute>               ModifiedAttributes;                                // 0x8(0x10)
	struct                                                       EffectContext;                                     // 0x18(0x20)
	struct                                                       AggregatedSourceTags;                              // 0x38(0x28)
	struct                                                       AggregatedTargetTags;                              // 0x60(0x28)
	float                                                        Level;                                             // 0x88(0x4)
};


// Size 0x368
struct ActiveGameplayEffectsContainer
{
public:
	TArray<struct ActiveGameplayEffect>                          GameplayEffects_Internal;                          // 0xc8(0x10)
};


// Size 0xc0
struct ActiveGameplayCueContainer
{
public:
	TArray<struct ActiveGameplayCue>                             GameplayCues;                                      // 0xa8(0x10)
	class AbilitySystemComponent*                                Owner;                                             // 0xb8(0x8)
};


// Size 0x50
struct GameplayEffectExecutionDefinition
{
public:
	class UClass*                                                CalculationClass;                                  // 0x0(0x8)
	struct                                                       PassedInTags;                                      // 0x8(0x28)
	TArray<struct GameplayEffectExecutionScopedModifierInfo>     CalculationModifiers;                              // 0x30(0x10)
	TArray<class Class*>                                         ConditionalGameplayEffectClasses;                  // 0x40(0x10)
};


