// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x28
struct GameServerWebSocketEntityEvent
{
public:
	Struct FString                                               EventID;                                           // 0x0(0x10)
	Struct FString                                               ServerId;                                          // 0x10(0x10)
	Struct DateTime                                              ServerTimeUTC;                                     // 0x20(0x8)
};


// Size 0x20
struct EventOverMemoryThreshold
{
public:
	Struct FString                                               EventID;                                           // 0x0(0x10)
	Struct DateTime                                              ServerTimeUTC;                                     // 0x10(0x8)
	int                                                          MemoryUsedPercentage;                              // 0x18(0x4)
};


// Size 0x30
struct EntityEventSubscriptionGameServerRequestModel
{
public:
	TArray<struct EventsSwitched>                                EventsSwitched;                                    // 0x0(0x10)
	TArray<struct FName>                                         EventsWithAllIdsEnabled;                           // 0x10(0x10)
	TArray<struct FName>                                         EventsWithAllIdsDisabled;                          // 0x20(0x10)
};


// Size 0x28
struct EventEntityIdsSwitch
{
public:
	struct FName                                                 Event;                                             // 0x0(0x8)
	TArray<Int EnableEntityIds>                                  EnableEntityIds;                                   // 0x8(0x10)
	TArray<Int DisableEntityIds>                                 DisableEntityIds;                                  // 0x18(0x10)
};


// Size 0x20
struct GlobalEventSubscriptionGameServerRequestModel
{
public:
	TArray<struct FName>                                         EnableEvents;                                      // 0x0(0x10)
	TArray<struct FName>                                         DisableEvents;                                     // 0x10(0x10)
};


}