#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "GameEventsOnDemandFramework_Structs.h"


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventsOnDemandInstanceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventsOnDemandInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventsOnDemandAvailabilityServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class WaitForGameEventOnDemandToCompleteStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x158 (Full Size[0x180] - InheritedSize[0x28]
class GameEventOnDemandAvailabilityHandler: public Object
{
public:
	class GameEventAvailabilityParamsDataAsset*                  AvailabilityParamsAsset;                           // 0x28(0x8)
	class GameEventOnDemandAvailabilityStateTracker*             AvailabilityStateTracker;                          // 0x30(0x8)
	class UClass*                                                GameEventType;                                     // 0x38(0x8)
	char                                                         pad0x60_9VFTH[0x60];                               // 0x40(0x60)
	char                                                         CompletedState;                                    // 0xa0(0x1)
	char                                                         pad0xdf_631J8[0xdf];                               // 0xa1(0xdf)
};


// Size 0x0 (Full Size[0x138] - InheritedSize[0x138]
class GameEventOnDemandVoyageProposalDesc: public VoyageProposalDesc
{
public:
};


// Size 0x138 (Full Size[0x160] - InheritedSize[0x28]
class GameEventOnDemandAvailabilityStateTracker: public Object
{
public:
	char                                                         pad0x88_GPIBM[0x88];                               // 0x28(0x88)
	class UClass*                                                ShipTypeLimit;                                     // 0xb0(0x8)
	TArray<struct Guid>                                          OnDemandParticipatingCrewIds;                      // 0xb8(0x10)
	TArray<struct Guid>                                          EmergentlyParticipatingCrewIds;                    // 0xc8(0x10)
	char                                                         pad0x88_TV2EN[0x88];                               // 0xd8(0x88)
};


// Size 0x90 (Full Size[0x128] - InheritedSize[0x98]
class WaitForGameEventOnDemandToCompleteStep: public TaleQuestStep
{
public:
	char                                                         pad0x90_RABAS[0x90];                               // 0x98(0x90)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventsOnDemandLoserTunnelServiceInterface: public Interface
{
public:
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class GameEventAvailabilityParamsDataAsset: public DataAsset
{
public:
	struct WeightedProbabilityRangeOfRanges                      MatchmakingCooldownRanges;                         // 0x28(0x30)
	struct WeightedProbabilityRange                              CrewsJoinedOnDemandLimitRange;                     // 0x58(0x20)
	float                                                        InitialCooldown;                                   // 0x78(0x4)
	int                                                          ProgressStateLimit;                                // 0x7c(0x4)
	bool                                                         ShouldApplyShipTypeLimit;                          // 0x80(0x1)
	bool                                                         ShouldManageEmergentCrewsOnDeactivate;             // 0x81(0x1)
	char                                                         pad0x2_LER08[0x2];                                 // 0x82(0x2)
	float                                                        EmergentCrewLeftRegionCooldown;                    // 0x84(0x4)
	bool                                                         SendCrewToLoserTunnelOnShipSinking;                // 0x88(0x1)
	bool                                                         ShouldCompletedBannersPlayAudio;                   // 0x89(0x1)
	char                                                         pad0x2_9WFCF[0x2];                                 // 0x8a(0x2)
	float                                                        ActiveEventExclusionRadiusFromIslandDistanceRadiusModifier; // 0x8c(0x4)
};


