// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x300
struct ActiveGameplayEffect
{
public:
	Struct GameplayEffectSpec                                    Spec;                                              // 0x10(0x2a0)
	Struct PredictionKey                                         PredictionKey;                                     // 0x2b0(0x18)
	float                                                        StartServerWorldTime;                              // 0x2c8(0x4)
	float                                                        CachedStartServerWorldTime;                        // 0x2cc(0x4)
	float                                                        StartWorldTime;                                    // 0x2d0(0x4)
	bool                                                         bIsInhibited;                                      // 0x2d4(0x1)
};


// Size 0x18
struct PredictionKey
{
public:
	Class PackageMap*                                            PredictiveConnection;                              // 0x8(0x8)
	bool                                                         bIsStale;                                          // 0x10(0x1)
	bool                                                         bIsServerInitiated;                                // 0x11(0x1)
};


// Size 0x2a0
struct GameplayEffectSpec
{
public:
	Class GameplayEffect*                                        Def;                                               // 0x0(0x8)
	TArray<Struct GameplayEffectModifiedAttribute>               ModifiedAttributes;                                // 0x8(0x10)
	Struct GameplayEffectAttributeCaptureSpecContainer           CapturedRelevantAttributes;                        // 0x18(0x28)
	char                                                         pad0x10_77M90[0x10];                               // 0x40(0x10)
	float                                                        Duration;                                          // 0x50(0x4)
	float                                                        Period;                                            // 0x54(0x4)
	float                                                        ChanceToApplyToTarget;                             // 0x58(0x4)
	char                                                         pad0x4_MW5KM[0x4];                                 // 0x5c(0x4)
	Struct TagContainerAggregator                                CapturedSourceTags;                                // 0x60(0xa8)
	Struct TagContainerAggregator                                CapturedTargetTags;                                // 0x108(0xa8)
	Struct GameplayTagContainer                                  DynamicGrantedTags;                                // 0x1b0(0x28)
	Struct GameplayTagContainer                                  DynamicAssetTags;                                  // 0x1d8(0x28)
	TArray<Struct ModifierSpec>                                  Modifiers;                                         // 0x200(0x10)
	int                                                          StackCount;                                        // 0x210(0x4)
	bool                                                         bCompletedSourceAttributeCapture;                  // 0x214(0x1)
	bool                                                         bCompletedTargetAttributeCapture;                  // 0x214(0x1)
	bool                                                         bDurationLocked;                                   // 0x214(0x1)
	char                                                         pad0x3_M4IVW[0x3];                                 // 0x215(0x3)
	TArray<Struct GameplayAbilitySpecDef>                        GrantedAbilitySpecs;                               // 0x218(0x10)
	char                                                         pad0x50_2XIN1[0x50];                               // 0x228(0x50)
	Struct GameplayEffectContextHandle                           EffectContext;                                     // 0x278(0x20)
	float                                                        Level;                                             // 0x298(0x4)
};


// Size 0x20
struct GameplayEffectContextHandle
{
public:
};


// Size 0x28
struct GameplayAbilitySpecDef
{
public:
	class                                                        Ability;                                           // 0x0(0x8)
	int                                                          Level;                                             // 0x8(0x4)
	int                                                          InputID;                                           // 0xc(0x4)
	byte                                                         RemovalPolicy;                                     // 0x10(0x1)
	char                                                         pad0x7_4ZFJU[0x7];                                 // 0x11(0x7)
	Class Object*                                                SourceObject;                                      // 0x18(0x8)
	Struct GameplayAbilitySpecHandle                             AssignedHandle;                                    // 0x20(0x4)
};


// Size 0x4
struct GameplayAbilitySpecHandle
{
public:
	int                                                          Handle;                                            // 0x0(0x4)
};


// Size 0x4
struct ModifierSpec
{
public:
	float                                                        EvaluatedMagnitude;                                // 0x0(0x4)
};


// Size 0xa8
struct TagContainerAggregator
{
public:
	Struct GameplayTagContainer                                  CapturedActorTags;                                 // 0x0(0x28)
	Struct GameplayTagContainer                                  CapturedSpecTags;                                  // 0x28(0x28)
	Struct GameplayTagContainer                                  ScopedTags;                                        // 0x50(0x28)
};


// Size 0x28
struct GameplayEffectAttributeCaptureSpecContainer
{
public:
	TArray<Struct GameplayEffectAttributeCaptureSpec>            SourceAttributes;                                  // 0x0(0x10)
	TArray<Struct GameplayEffectAttributeCaptureSpec>            TargetAttributes;                                  // 0x10(0x10)
	bool                                                         bHasNonSnapshottedAttributes;                      // 0x20(0x1)
};


// Size 0x28
struct GameplayEffectAttributeCaptureSpec
{
public:
	Struct GameplayEffectAttributeCaptureDefinition              BackingDefinition;                                 // 0x0(0x10)
};


// Size 0x10
struct GameplayEffectAttributeCaptureDefinition
{
public:
	Struct GameplayAttribute                                     AttributeToCapture;                                // 0x0(0x8)
	byte                                                         AttributeSource;                                   // 0x8(0x1)
	bool                                                         bSnapshot;                                         // 0x9(0x1)
};


// Size 0x8
struct GameplayAttribute
{
public:
	Class Property*                                              Attribute;                                         // 0x0(0x8)
};


// Size 0x10
struct GameplayEffectModifiedAttribute
{
public:
	Struct GameplayAttribute                                     Attribute;                                         // 0x0(0x8)
	float                                                        TotalMagnitude;                                    // 0x8(0x4)
};


// Size 0x4
struct ActiveGameplayEffectHandle
{
public:
	int                                                          Handle;                                            // 0x0(0x4)
};


// Size 0x20
struct GameplayEffectSpecHandle
{
public:
};


// Size 0x10
struct GameplayAbilityTargetDataHandle
{
public:
};


// Size 0xa0
struct GameplayEventData
{
public:
	Struct GameplayTag                                           EventTag;                                          // 0x0(0x8)
	Class Actor*                                                 Instigator;                                        // 0x8(0x8)
	Class Actor*                                                 Target;                                            // 0x10(0x8)
	Class Object*                                                OptionalObject;                                    // 0x18(0x8)
	Class Object*                                                OptionalObject2;                                   // 0x20(0x8)
	Struct GameplayEffectContextHandle                           ContextHandle;                                     // 0x28(0x20)
	Struct GameplayTagContainer                                  InstigatorTags;                                    // 0x48(0x28)
	Struct GameplayTagContainer                                  TargetTags;                                        // 0x70(0x28)
	float                                                        EventMagnitude;                                    // 0x98(0x4)
};


// Size 0x20
struct GameplayAbilityActivationInfo
{
public:
	byte                                                         ActivationMode;                                    // 0x0(0x1)
	bool                                                         bCanBeEndedByOtherInstance;                        // 0x1(0x1)
	char                                                         pad0x6_O9VWW[0x6];                                 // 0x2(0x6)
	Struct PredictionKey                                         PredictionKeyWhenActivated;                        // 0x8(0x18)
};


// Size 0x90
struct GameplayEffectSpecForRPC
{
public:
	Class GameplayEffect*                                        Def;                                               // 0x0(0x8)
	TArray<Struct GameplayEffectModifiedAttribute>               ModifiedAttributes;                                // 0x8(0x10)
	Struct GameplayEffectContextHandle                           EffectContext;                                     // 0x18(0x20)
	Struct GameplayTagContainer                                  AggregatedSourceTags;                              // 0x38(0x28)
	Struct GameplayTagContainer                                  AggregatedTargetTags;                              // 0x60(0x28)
	float                                                        Level;                                             // 0x88(0x4)
};


// Size 0x88
struct GameplayCueParameters
{
public:
	float                                                        NormalizedMagnitude;                               // 0x0(0x4)
	float                                                        RawMagnitude;                                      // 0x4(0x4)
	Struct GameplayEffectContextHandle                           EffectContext;                                     // 0x8(0x20)
	struct FName                                                 MatchedTagName;                                    // 0x28(0x8)
	Struct GameplayTag                                           OriginalTag;                                       // 0x30(0x8)
	Struct GameplayTagContainer                                  AggregatedSourceTags;                              // 0x38(0x28)
	Struct GameplayTagContainer                                  AggregatedTargetTags;                              // 0x60(0x28)
};


// Size 0xc0
struct ActiveGameplayCueContainer
{
public:
	TArray<Struct ActiveGameplayCue>                             GameplayCues;                                      // 0xa8(0x10)
	Class AbilitySystemComponent*                                Owner;                                             // 0xb8(0x8)
};


// Size 0x30
struct ActiveGameplayCue
{
public:
	Struct GameplayTag                                           GameplayCueTag;                                    // 0x8(0x8)
	Struct PredictionKey                                         PredictionKey;                                     // 0x10(0x18)
	bool                                                         bPredictivelyRemoved;                              // 0x28(0x1)
};


// Size 0x368
struct ActiveGameplayEffectsContainer
{
public:
	TArray<Struct ActiveGameplayEffect>                          GameplayEffects_Internal;                          // 0xc8(0x10)
};


// Size 0x30
struct GameplayAbilityLocalAnimMontage
{
public:
	Class AnimMontage*                                           AnimMontage;                                       // 0x0(0x8)
	bool                                                         PlayBit;                                           // 0x8(0x1)
	char                                                         pad0x7_7XYS1[0x7];                                 // 0x9(0x7)
	Struct PredictionKey                                         PredictionKey;                                     // 0x10(0x18)
	Class GameplayAbility*                                       AnimatingAbility;                                  // 0x28(0x8)
};


// Size 0x30
struct GameplayAbilityRepAnimMontage
{
public:
	Class AnimMontage*                                           AnimMontage;                                       // 0x0(0x8)
	float                                                        PlayRate;                                          // 0x8(0x4)
	float                                                        Position;                                          // 0xc(0x4)
	float                                                        BlendTime;                                         // 0x10(0x4)
	byte                                                         NextSectionID;                                     // 0x14(0x1)
	bool                                                         IsStopped;                                         // 0x15(0x1)
	bool                                                         ForcePlayBit;                                      // 0x15(0x1)
	char                                                         pad0x2_U5HGK[0x2];                                 // 0x16(0x2)
	Struct PredictionKey                                         PredictionKey;                                     // 0x18(0x18)
};


// Size 0xc0
struct GameplayAbilitySpecContainer
{
public:
	TArray<Struct GameplayAbilitySpec>                           Items;                                             // 0xa8(0x10)
};


// Size 0x78
struct GameplayAbilitySpec
{
public:
	Struct GameplayAbilitySpecHandle                             Handle;                                            // 0x8(0x4)
	char                                                         pad0x4_JFWNP[0x4];                                 // 0xc(0x4)
	Class GameplayAbility*                                       Ability;                                           // 0x10(0x8)
	int                                                          Level;                                             // 0x18(0x4)
	int                                                          InputID;                                           // 0x1c(0x4)
	Class Object*                                                SourceObject;                                      // 0x20(0x8)
	bool                                                         InputPressed;                                      // 0x28(0x1)
	byte                                                         ActiveCount;                                       // 0x29(0x1)
	bool                                                         RemoveAfterActivation;                             // 0x2a(0x1)
	char                                                         pad0x5_T0IBX[0x5];                                 // 0x2b(0x5)
	Struct GameplayAbilityActivationInfo                         ActivationInfo;                                    // 0x30(0x20)
	TArray<class GameplayAbility*>                               NonReplicatedInstances;                            // 0x50(0x10)
	TArray<class GameplayAbility*>                               ReplicatedInstances;                               // 0x60(0x10)
	Struct ActiveGameplayEffectHandle                            GameplayEffectHandle;                              // 0x70(0x4)
	bool                                                         PendingRemove;                                     // 0x74(0x1)
};


// Size 0x10
struct AttributeDefaults
{
public:
	class                                                        Attributes;                                        // 0x0(0x8)
	Class DataTable*                                             DefaultStartingTable;                              // 0x8(0x8)
};


// Size 0x18
struct GameplayTargetDataFilterHandle
{
public:
};


// Size 0x28
struct GameplayTargetDataFilter
{
public:
	Class Actor*                                                 SelfActor;                                         // 0x8(0x8)
	byte                                                         SelfFilter;                                        // 0x10(0x1)
	char                                                         pad0x7_RI5EZ[0x7];                                 // 0x11(0x7)
	class                                                        RequiredActorClass;                                // 0x18(0x8)
	bool                                                         bReverseFilter;                                    // 0x20(0x1)
};


// Size 0x28
struct AttributeMetaData
{
public:
	float                                                        BaseValue;                                         // 0x0(0x4)
	float                                                        MinValue;                                          // 0x4(0x4)
	float                                                        MaxValue;                                          // 0x8(0x4)
	char                                                         pad0x4_GIDLF[0x4];                                 // 0xc(0x4)
	Struct FString                                               DerivedAttributeInfo;                              // 0x10(0x10)
	bool                                                         bCanStack;                                         // 0x20(0x1)
};


// Size 0x20
struct ScalableFloat
{
public:
	float                                                        Value;                                             // 0x0(0x4)
	char                                                         pad0x4_72E78[0x4];                                 // 0x4(0x4)
	Struct CurveTableRowHandle                                   Curve;                                             // 0x8(0x10)
};


// Size 0x10
struct GlobalCurveDataOverride
{
public:
};


// Size 0x50
struct GameplayTagRequirements
{
public:
	Struct GameplayTagContainer                                  RequireTags;                                       // 0x0(0x28)
	Struct GameplayTagContainer                                  IgnoreTags;                                        // 0x28(0x28)
};


// Size 0x60
struct GameplayEffectContext
{
public:
	TArray<Weakclass Actors>                                     Actors;                                            // 0x28(0x10)
	char                                                         pad0x18_841XL[0x18];                               // 0x38(0x18)
	Struct Vector                                                WorldOrigin;                                       // 0x50(0xc)
	bool                                                         bHasWorldOrigin;                                   // 0x5c(0x1)
};


// Size 0x18
struct GameplayModifierEvaluatedData
{
public:
	Struct GameplayAttribute                                     Attribute;                                         // 0x0(0x8)
	byte                                                         ModifierOp;                                        // 0x8(0x1)
	char                                                         pad0x3_ORVTZ[0x3];                                 // 0x9(0x3)
	float                                                        Magnitude;                                         // 0xc(0x4)
	Struct ActiveGameplayEffectHandle                            Handle;                                            // 0x10(0x4)
	bool                                                         IsValid;                                           // 0x14(0x1)
};


// Size 0x88
struct GameplayAbilityTargetData_SingleTargetHit
{
public:
	Struct HitResult                                             HitResult;                                         // 0x8(0x80)
};


// Size 0x8
struct GameplayAbilityTargetData
{
public:
};


// Size 0x90
struct GameplayAbilityTargetData_ActorArray
{
public:
	Struct GameplayAbilityTargetingLocationInfo                  SourceLocation;                                    // 0x10(0x70)
	TArray<Weakclass TargetActorArray>                           TargetActorArray;                                  // 0x80(0x10)
};


// Size 0x70
struct GameplayAbilityTargetingLocationInfo
{
public:
	byte                                                         LocationType;                                      // 0x10(0x1)
	char                                                         pad0xf_55TSZ[0xf];                                 // 0x11(0xf)
	Struct Transform                                             LiteralTransform;                                  // 0x20(0x30)
	Class Actor*                                                 SourceActor;                                       // 0x50(0x8)
	Class MeshComponent*                                         SourceComponent;                                   // 0x58(0x8)
	Class GameplayAbility*                                       SourceAbility;                                     // 0x60(0x8)
	struct FName                                                 SourceSocketName;                                  // 0x68(0x8)
};


// Size 0xf0
struct GameplayAbilityTargetData_LocationInfo
{
public:
	Struct GameplayAbilityTargetingLocationInfo                  SourceLocation;                                    // 0x10(0x70)
	Struct GameplayAbilityTargetingLocationInfo                  TargetLocation;                                    // 0x80(0x70)
};


// Size 0x8
struct GameplayAbilitySpecHandleAndPredictionKey
{
public:
	Struct GameplayAbilitySpecHandle                             AbilityHandle;                                     // 0x0(0x4)
	int                                                          PredictionKeyAtCreation;                           // 0x4(0x4)
};


// Size 0x38
struct GameplayAbilityActorInfo
{
public:
};


// Size 0x50
struct ActiveGameplayEffectQuery
{
public:
};


// Size 0xd0
struct GameplayEffectQuery
{
public:
	Struct GameplayTagQuery                                      OwningTagQuery;                                    // 0x18(0x48)
	Struct GameplayTagQuery                                      EffectTagQuery;                                    // 0x60(0x48)
	Struct GameplayAttribute                                     ModifyingAttribute;                                // 0xa8(0x8)
	Class Object*                                                EffectSource;                                      // 0xb0(0x8)
	Class GameplayEffect*                                        EffectDefinition;                                  // 0xb8(0x8)
};


// Size 0x78
struct InheritedTagContainer
{
public:
	Struct GameplayTagContainer                                  CombinedTags;                                      // 0x0(0x28)
	Struct GameplayTagContainer                                  Added;                                             // 0x28(0x28)
	Struct GameplayTagContainer                                  Removed;                                           // 0x50(0x28)
};


// Size 0x38
struct GameplayEffectCue
{
public:
	Struct GameplayAttribute                                     MagnitudeAttribute;                                // 0x0(0x8)
	float                                                        MinLevel;                                          // 0x8(0x4)
	float                                                        MaxLevel;                                          // 0xc(0x4)
	Struct GameplayTagContainer                                  GameplayCueTags;                                   // 0x10(0x28)
};


// Size 0x240
struct GameplayModifierInfo
{
public:
	Struct GameplayAttribute                                     Attribute;                                         // 0x0(0x8)
	byte                                                         ModifierOp;                                        // 0x8(0x1)
	char                                                         pad0x7_XA5N5[0x7];                                 // 0x9(0x7)
	Struct ScalableFloat                                         Magnitude;                                         // 0x10(0x20)
	Struct GameplayEffectModifierMagnitude                       ModifierMagnitude;                                 // 0x30(0x170)
	Struct GameplayTagRequirements                               SourceTags;                                        // 0x1a0(0x50)
	Struct GameplayTagRequirements                               TargetTags;                                        // 0x1f0(0x50)
};


// Size 0x170
struct GameplayEffectModifierMagnitude
{
public:
	byte                                                         MagnitudeCalculationType;                          // 0x0(0x1)
	char                                                         pad0x7_BFNP4[0x7];                                 // 0x1(0x7)
	Struct ScalableFloat                                         ScalableFloatMagnitude;                            // 0x8(0x20)
	Struct AttributeBasedFloat                                   AttributeBasedMagnitude;                           // 0x28(0xd8)
	Struct CustomCalculationBasedFloat                           CustomMagnitude;                                   // 0x100(0x68)
	Struct SetByCallerFloat                                      SetByCallerMagnitude;                              // 0x168(0x8)
};


// Size 0x8
struct SetByCallerFloat
{
public:
	struct FName                                                 DataName;                                          // 0x0(0x8)
};


// Size 0x68
struct CustomCalculationBasedFloat
{
public:
	class                                                        CalculationClassMagnitude;                         // 0x0(0x8)
	Struct ScalableFloat                                         Coefficient;                                       // 0x8(0x20)
	Struct ScalableFloat                                         PreMultiplyAdditiveValue;                          // 0x28(0x20)
	Struct ScalableFloat                                         PostMultiplyAdditiveValue;                         // 0x48(0x20)
};


// Size 0xd8
struct AttributeBasedFloat
{
public:
	Struct ScalableFloat                                         Coefficient;                                       // 0x0(0x20)
	Struct ScalableFloat                                         PreMultiplyAdditiveValue;                          // 0x20(0x20)
	Struct ScalableFloat                                         PostMultiplyAdditiveValue;                         // 0x40(0x20)
	Struct GameplayEffectAttributeCaptureDefinition              BackingAttribute;                                  // 0x60(0x10)
	Struct CurveTableRowHandle                                   AttributeCurve;                                    // 0x70(0x10)
	byte                                                         AttributeCalculationType;                          // 0x80(0x1)
	char                                                         pad0x7_WTXPK[0x7];                                 // 0x81(0x7)
	Struct GameplayTagContainer                                  SourceTagFilter;                                   // 0x88(0x28)
	Struct GameplayTagContainer                                  TargetTagFilter;                                   // 0xb0(0x28)
};


// Size 0x50
struct GameplayEffectExecutionDefinition
{
public:
	class                                                        CalculationClass;                                  // 0x0(0x8)
	Struct GameplayTagContainer                                  PassedInTags;                                      // 0x8(0x28)
	TArray<Struct GameplayEffectExecutionScopedModifierInfo>     CalculationModifiers;                              // 0x30(0x10)
	TArray<Class ConditionalGameplayEffectClasses>               ConditionalGameplayEffectClasses;                  // 0x40(0x10)
};


// Size 0x228
struct GameplayEffectExecutionScopedModifierInfo
{
public:
	Struct GameplayEffectAttributeCaptureDefinition              CapturedAttribute;                                 // 0x0(0x10)
	byte                                                         ModifierOp;                                        // 0x10(0x1)
	char                                                         pad0x7_8O8WS[0x7];                                 // 0x11(0x7)
	Struct GameplayEffectModifierMagnitude                       ModifierMagnitude;                                 // 0x18(0x170)
	Struct GameplayTagRequirements                               SourceTags;                                        // 0x188(0x50)
	Struct GameplayTagRequirements                               TargetTags;                                        // 0x1d8(0x50)
};


// Size 0xc
struct AbilityTriggerData
{
public:
	Struct GameplayTag                                           TriggerTag;                                        // 0x0(0x8)
	byte                                                         TriggerSource;                                     // 0x8(0x1)
};


// Size 0xc
struct WorldReticleParameters
{
public:
	Struct Vector                                                AOEScale;                                          // 0x0(0xc)
};


// Size 0x10
struct GameplayAbilityBindInfo
{
public:
	byte                                                         Command;                                           // 0x0(0x1)
	char                                                         pad0x7_MYYHL[0x7];                                 // 0x1(0x7)
	class                                                        GameplayAbilityClass;                              // 0x8(0x8)
};


// Size 0x148
struct GameplayCuePendingExecute
{
public:
	Struct GameplayTag                                           GameplayCueTag;                                    // 0x0(0x8)
	Struct PredictionKey                                         PredictionKey;                                     // 0x8(0x18)
	byte                                                         PayloadType;                                       // 0x20(0x1)
	char                                                         pad0x7_X73UW[0x7];                                 // 0x21(0x7)
	Class AbilitySystemComponent*                                OwningComponent;                                   // 0x28(0x8)
	Struct GameplayEffectSpecForRPC                              FromSpec;                                          // 0x30(0x90)
	Struct GameplayCueParameters                                 CueParameters;                                     // 0xc0(0x88)
};


// Size 0x28
struct GameplayCueNotifyData
{
public:
	Struct GameplayTag                                           GameplayCueTag;                                    // 0x0(0x8)
	Struct StringAssetReference                                  GameplayCueNotifyObj;                              // 0x8(0x10)
	class                                                        LoadedGameplayCueClass;                            // 0x18(0x8)
};


// Size 0x18
struct GameplayEffectCustomExecutionOutput
{
public:
	TArray<Struct GameplayModifierEvaluatedData>                 OutputModifiers;                                   // 0x0(0x10)
	bool                                                         bTriggerConditionalGameplayEffects;                // 0x10(0x1)
	bool                                                         bHandledStackCountManually;                        // 0x10(0x1)
	bool                                                         bHandledGameplayCuesManually;                      // 0x10(0x1)
};


// Size 0x88
struct GameplayEffectCustomExecutionParameters
{
public:
};


// Size 0x20
struct GameplayTagResponseTableEntry
{
public:
	Struct GameplayTagReponsePair                                Positive;                                          // 0x0(0x10)
	Struct GameplayTagReponsePair                                Negative;                                          // 0x10(0x10)
};


// Size 0x10
struct GameplayTagReponsePair
{
public:
	Struct GameplayTag                                           Tag;                                               // 0x0(0x8)
	class                                                        ResponseGameplayEffect;                            // 0x8(0x8)
};


}