#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x20
struct GameEventsOnDemandLoserTunnelCrewData
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	class UClass*                                                GameEventType;                                     // 0x10(0x8)
	char                                                         pad0x8_0SRUI[0x8];                                 // 0x18(0x8)
};


// Size 0x20
struct AdvertiseGameEventOnDemandAvailabilityTelemetryEvent
{
public:
	struct GameEventAvailabilityModel                            GameEventAvailability;                             // 0x0(0x20)
};


// Size 0x18
struct GameEventAvailabilityTelemetryData
{
public:
	struct FString                                               EventName;                                         // 0x0(0x10)
	char                                                         EventCategory;                                     // 0x10(0x1)
	char                                                         AvailabilityState;                                 // 0x11(0x1)
	char                                                         pad0x6_RQ0EY[0x6];                                 // 0x12(0x6)
};


// Size 0x10
struct ProcessGameEventOnDemandAvailabilityTelemetryEvent
{
public:
	TArray<struct GameEventAvailabilityTelemetryData>            GameEventAvailabilityData;                         // 0x0(0x10)
};


