// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0 (Full Size[0x58] - InheritedSize[0x58]
class EnvQueryGenerator_SeaBasedGameEventOnDemandLocations: public EnvQueryGenerator
{
public:
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class GameEventsOnDemandAvailabilityService: public Object
{
public:
	char                                                         pad0x40_3454C[0x40];                               // 0x28(0x40)
	Class World*                                                 World;                                             // 0x68(0x8)
	char                                                         pad0x18_HJ41F[0x18];                               // 0x70(0x18)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class GameEventsOnDemandLoserTunnelService: public Object
{
public:
	char                                                         pad0x8_UGT5A[0x8];                                 // 0x28(0x8)
	Class World*                                                 World;                                             // 0x30(0x8)
	Class VoyageDescDataAsset*                                   LoserTunnelVoyageDescDataAsset;                    // 0x38(0x8)
	char                                                         pad0x20_85NXC[0x20];                               // 0x40(0x20)
	TArray<struct TrackedCrews>                                  TrackedCrews;                                      // 0x60(0x10)
	char                                                         pad0x18_XJ706[0x18];                               // 0x70(0x18)
};


}