// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class EditableGameplayTagQuery: public Object
{
public:
	Struct FString                                               UserDescription;                                   // 0x28(0x10)
	char                                                         pad0x10_21CXQ[0x10];                               // 0x38(0x10)
	Class EditableGameplayTagQueryExpression*                    RootExpression;                                    // 0x48(0x8)
	Struct GameplayTagQuery                                      TagQueryExportText_Helper;                         // 0x50(0x48)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EditableGameplayTagQueryExpression: public Object
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class EditableGameplayTagQueryExpression_AnyTagsMatch: public EditableGameplayTagQueryExpression
{
public:
	Struct GameplayTagContainer                                  Tags;                                              // 0x28(0x28)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class EditableGameplayTagQueryExpression_AllTagsMatch: public EditableGameplayTagQueryExpression
{
public:
	Struct GameplayTagContainer                                  Tags;                                              // 0x28(0x28)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class EditableGameplayTagQueryExpression_NoTagsMatch: public EditableGameplayTagQueryExpression
{
public:
	Struct GameplayTagContainer                                  Tags;                                              // 0x28(0x28)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EditableGameplayTagQueryExpression_AnyExprMatch: public EditableGameplayTagQueryExpression
{
public:
	TArray<class EditableGameplayTagQueryExpression*>            Expressions;                                       // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EditableGameplayTagQueryExpression_AllExprMatch: public EditableGameplayTagQueryExpression
{
public:
	TArray<class EditableGameplayTagQueryExpression*>            Expressions;                                       // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class EditableGameplayTagQueryExpression_NoExprMatch: public EditableGameplayTagQueryExpression
{
public:
	TArray<class EditableGameplayTagQueryExpression*>            Expressions;                                       // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameplayTagAssetInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BlueprintGameplayTagLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x148 (Full Size[0x170] - InheritedSize[0x28]
class GameplayTagsManager: public Object
{
public:
	char                                                         pad0x118_MAI08[0x118];                             // 0x28(0x118)
	TArray<class DataTable*>                                     GameplayTagTables;                                 // 0x140(0x10)
	char                                                         pad0x20_70T7W[0x20];                               // 0x150(0x20)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class GameplayTagsSettings: public Object
{
public:
	TArray<Str GameplayTags>                                     GameplayTags;                                      // 0x28(0x10)
};


}