#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "GenericStatusVFX_Structs.h"


// Size 0x60 (Full Size[0x118] - InheritedSize[0xb8]
class GenericStatusVFXComponent: public ActorComponent
{
public:
	char                                                         pad0x8_EF5V6[0x8];                                 // 0xb8(0x8)
	class ParticleSystemComponent*                               VFXComponent;                                      // 0xc0(0x8)
	class World*                                                 CachedWorld;                                       // 0xc8(0x8)
	char                                                         pad0x20_GDBYA[0x20];                               // 0xd0(0x20)
	class GenericStatusVFXDataAsset*                             VFXDataAsset;                                      // 0xf0(0x8)
	char                                                         pad0x18_94BZE[0x18];                               // 0xf8(0x18)
	bool                                                         ContainsVFXSource;                                 // 0x110(0x1)
	char                                                         pad0x7_AI017[0x7];                                 // 0x111(0x7)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class GenericStatusVFXDataAsset: public DataAsset
{
public:
	struct Status                                                VFXStatus;                                         // 0x28(0x20)
	class ParticleSystem*                                        VFXSystem;                                         // 0x48(0x8)
	float                                                        VFXFalloffDuration;                                // 0x50(0x4)
	float                                                        VFXFalloffMultiplier;                              // 0x54(0x4)
	struct FName                                                 VfxSocketName;                                     // 0x58(0x8)
	struct Transform                                             SocketRelativeOffset;                              // 0x60(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GenericStatusVFXInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x40] - InheritedSize[0x38]
class GenericStatusVFXResponse: public StatusResponse
{
public:
	class GenericStatusVFXDataAsset*                             VFXDataAsset;                                      // 0x38(0x8)
};


