// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0 (Full Size[0xc8] - InheritedSize[0xc8]
class GlitterBeardEntitlementDesc: public EntitlementDesc
{
public:
};


// Size 0x98 (Full Size[0x160] - InheritedSize[0xc8]
class GlitterBeardFinaleCoordinatorComponent: public ActorComponent
{
public:
	Class WwiseEvent*                                            AudioEventToSynchronise;                           // 0xc8(0x8)
	Struct FinaleReplicationState                                ReplicationState;                                  // 0xd0(0x10)
	char                                                         pad0xa0_SR3X9[0xa0];                               // 0xde(0xa0)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class GlitterBeardIsHideoutOpenConditional: public NPCDialogConditional
{
public:
};


// Size 0x48 (Full Size[0x80] - InheritedSize[0x38]
class GlitterBeardLanternSoundEffect: public EffectBlendObjectBase
{
public:
	float                                                        TriggerThreshold;                                  // 0x38(0x4)
	char                                                         pad0x4_LJ7KP[0x4];                                 // 0x3c(0x4)
	Class WwiseObjectPoolWrapper*                                WwisePool;                                         // 0x40(0x8)
	Class WwiseEvent*                                            WwiseEvent;                                        // 0x48(0x8)
	Struct WwiseEmitter                                          Emitter;                                           // 0x50(0x20)
	char                                                         pad0x50_AL96G[0x50];                               // 0x6e(0x50)
};


// Size 0x8 (Full Size[0x548] - InheritedSize[0x540]
class GlitterbeardSlidingDoor: public SlidingDoor
{
public:
	Class EffectBlendControllerComponent*                        DecalBlendComponent;                               // 0x540(0x8)
};


// Size 0x48 (Full Size[0x110] - InheritedSize[0xc8]
class GlitterBeardTelemetryComponent: public ActorComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GlitterBeardTrustedTreeInterface: public Interface
{
public:
};


// Size 0x308 (Full Size[0x6d0] - InheritedSize[0x3c8]
class GlitterBeardTree: public Actor
{
public:
	char                                                         pad0x28_OKMQH[0x28];                               // 0x3c8(0x28)
	Class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x3f0(0x8)
	Class ActionRulesInteractableComponent*                      InteractableComponent;                             // 0x3f8(0x8)
	float                                                        LanternLightDelay;                                 // 0x400(0x4)
	char                                                         pad0x4_1070I[0x4];                                 // 0x404(0x4)
	Class GlitterBeardUnlockVFXCoordinatorComponent*             UnlockVFXCoordinatorComponent;                     // 0x408(0x8)
	Class GlitterBeardTelemetryComponent*                        TelemetryComponent;                                // 0x410(0x8)
	class                                                        VocalShanty;                                       // 0x418(0x8)
	Class WwiseEvent*                                            VocalsFadeEvent;                                   // 0x420(0x8)
	float                                                        VocalsFadeDelay;                                   // 0x428(0x4)
	float                                                        UnlockDelay;                                       // 0x42c(0x4)
	Class GlitterBeardFinaleCoordinatorComponent*                FinaleCoordinator;                                 // 0x430(0x8)
	Class LandmarkReactionTriggerComponent*                      LandmarkReactionTrigger;                           // 0x438(0x8)
	float                                                        DistanceFromTreeToPauseAISpawn;                    // 0x440(0x4)
	char                                                         pad0x234_W77S7[0x234];                             // 0x444(0x234)
	Class SlidingDoor*                                           HideoutDoor;                                       // 0x678(0x8)
	Struct WwiseEmitter                                          SoundEmitter;                                      // 0x680(0x20)
	char                                                         pad0x70_TS9FG[0x70];                               // 0x69e(0x70)
};


// Size 0x50 (Full Size[0x118] - InheritedSize[0xc8]
class GlitterBeardTreeVisualFeedbackComponent: public ActorComponent
{
public:
	TArray<Struct VisualFeedbackList>                            FeedbackActions;                                   // 0xc8(0x10)
	char                                                         pad0x10_EECA7[0x10];                               // 0xd8(0x10)
	TArray<Byte CurrentStates>                                   CurrentStates;                                     // 0xe8(0x10)
	char                                                         pad0x40_LHH8V[0x40];                               // 0xf6(0x40)
};


// Size 0x28 (Full Size[0xf0] - InheritedSize[0xc8]
class GlitterBeardUnlockVFXCoordinatorComponent: public ActorComponent
{
public:
	Struct ActorComponentSelector                                TreeActor;                                         // 0xc8(0x10)
	Class MaterialInstanceDynamic*                               TreeMaterialInstanceDynamic;                       // 0xd8(0x8)
	float                                                        TreeBlendTime;                                     // 0xe0(0x4)
	char                                                         pad0x14_E45ZQ[0x14];                               // 0xe2(0x14)
};


}