#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x70 (Full Size[0x600] - InheritedSize[0x590]
class GoalDrivenCharacterMovementComponent: public CharacterMovementComponent
{
public:
	bool                                                         CreateDisturbance;                                 // 0x5a0(0x1)
	float                                                        DisturbanceSize;                                   // 0x5a4(0x4)
	float                                                        DisturbanceVelocityScale;                          // 0x5a8(0x4)
	bool                                                         AdjustMeshPositionOnClient;                        // 0x5ac(0x1)
	float                                                        MeshAdjustmentMaximumDistance;                     // 0x5b0(0x4)
	float                                                        MeshAdjustmentInterpolationRate;                   // 0x5b4(0x4)
	float                                                        DesiredWalkSpeed;                                  // 0x5b8(0x4)
	float                                                        DesiredRunSpeed;                                   // 0x5bc(0x4)
	float                                                        MinimumMovementSpeedForRunAnimation;               // 0x5c0(0x4)
	float                                                        MinimumDistanceFromTargetToRun;                    // 0x5c4(0x4)
};


// Size 0x10 (Full Size[0x2c8] - InheritedSize[0x2b8]
class GoalDrivenPathFollowingComponent: public PathFollowingComponent
{
public:
	float                                                        ReachedGoalMaxSpeedToSlowDistanceFactor;           // 0x2b8(0x4)
	float                                                        MinSlowDownSpeed;                                  // 0x2bc(0x4)
};


