#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x10 (Full Size[0x5e0] - InheritedSize[0x5d0]
class GoalDrivenCharacter: public CharacterWithActionStateMachine
{
public:
	char                                                         pad0x10_YAMSH[0x10];                               // 0x5d0(0x10)
};


// Size 0x70 (Full Size[0x5f0] - InheritedSize[0x580]
class GoalDrivenCharacterMovementComponent: public CharacterMovementComponent
{
public:
	char                                                         pad0x10_M63NO[0x10];                               // 0x580(0x10)
	bool                                                         CreateDisturbance;                                 // 0x590(0x1)
	char                                                         pad0x3_OQF9N[0x3];                                 // 0x591(0x3)
	float                                                        DisturbanceSize;                                   // 0x594(0x4)
	float                                                        DisturbanceVelocityScale;                          // 0x598(0x4)
	bool                                                         AdjustMeshPositionOnClient;                        // 0x59c(0x1)
	char                                                         pad0x3_KNM9P[0x3];                                 // 0x59d(0x3)
	float                                                        MeshAdjustmentMaximumDistance;                     // 0x5a0(0x4)
	float                                                        MeshAdjustmentInterpolationRate;                   // 0x5a4(0x4)
	float                                                        DesiredWalkSpeed;                                  // 0x5a8(0x4)
	float                                                        DesiredRunSpeed;                                   // 0x5ac(0x4)
	float                                                        MinimumMovementSpeedForRunAnimation;               // 0x5b0(0x4)
	float                                                        MinimumDistanceFromTargetToRun;                    // 0x5b4(0x4)
	char                                                         pad0x38_SEORR[0x38];                               // 0x5b8(0x38)
};


// Size 0x0 (Full Size[0x440] - InheritedSize[0x440]
class GoalDrivenCharacterAnimInstance: public AnimInstance
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GoalDrivenCharacterWithRotationOverrideDockingPolicyDefinition: public DockingPolicyDefinition
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GoalDrivenCharacterDockingPolicyDefinition: public DockingPolicyDefinition
{
public:
};


// Size 0x10 (Full Size[0x2b8] - InheritedSize[0x2a8]
class GoalDrivenPathFollowingComponent: public PathFollowingComponent
{
public:
	float                                                        ReachedGoalMaxSpeedToSlowDistanceFactor;           // 0x2a8(0x4)
	float                                                        MinSlowDownSpeed;                                  // 0x2ac(0x4)
	char                                                         pad0x8_6BLEJ[0x8];                                 // 0x2b0(0x8)
};


// Size 0x30 (Full Size[0xe8] - InheritedSize[0xb8]
class GoalDrivenCharacterAggregationComponent: public ActorComponent
{
public:
	char                                                         pad0x30_6HOKK[0x30];                               // 0xb8(0x30)
};


// Size 0xd0 (Full Size[0x560] - InheritedSize[0x490]
class GoalDrivenAIController: public AIController
{
public:
	char                                                         pad0xd0_7KPG3[0xd0];                               // 0x490(0xd0)
};


