#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x38
struct EventPortableHarpoonProjectileImpact
{
public:
	class Actor*                                                 HitActor;                                          // 0x0(0x8)
	bool                                                         LocationIsRelative;                                // 0x8(0x1)
	char                                                         pad0x7_C526K[0x7];                                 // 0x9(0x7)
	class SceneComponent*                                        RelativeComponent;                                 // 0x10(0x8)
	struct Vector                                                HitLocation;                                       // 0x18(0xc)
	struct Vector                                                HitNormal;                                         // 0x24(0xc)
	class PhysicalMaterial*                                      HitMaterial;                                       // 0x30(0x8)
};


// Size 0x8
struct EventPortableHarpoonHarpoonedCharacter
{
public:
	class Actor*                                                 HarpoonedCharacter;                                // 0x0(0x8)
};


// Size 0xc0
struct PortableHarpoonTelemetryEvent
{
public:
	struct Guid                                                  AttackId;                                          // 0x0(0x10)
	bool                                                         WielderStartedOnShip;                              // 0x10(0x1)
	char                                                         pad0x7_074UC[0x7];                                 // 0x11(0x7)
	struct FString                                               WielderStartShipClass;                             // 0x18(0x10)
	struct Guid                                                  WielderStartShipId;                                // 0x28(0x10)
	struct Guid                                                  WielderStartShipCrew;                              // 0x38(0x10)
	bool                                                         WielderIsAirborne;                                 // 0x48(0x1)
	bool                                                         WielderIsSwimming;                                 // 0x49(0x1)
	bool                                                         WielderWasFiredFromActor;                          // 0x4a(0x1)
	char                                                         AttemptedAction;                                   // 0x4b(0x1)
	char                                                         ActionStartResult;                                 // 0x4c(0x1)
	char                                                         ActionEndResult;                                   // 0x4d(0x1)
	char                                                         pad0x2_U2L2I[0x2];                                 // 0x4e(0x2)
	struct FString                                               TargetActorClass;                                  // 0x50(0x10)
	struct FString                                               TargetActorName;                                   // 0x60(0x10)
	struct FString                                               TargetObjectId;                                    // 0x70(0x10)
	float                                                        MovedDistance;                                     // 0x80(0x4)
	bool                                                         WielderEndedOnShip;                                // 0x84(0x1)
	char                                                         pad0x3_SFYTS[0x3];                                 // 0x85(0x3)
	struct FString                                               WielderEndShipClass;                               // 0x88(0x10)
	struct Guid                                                  WielderEndShipId;                                  // 0x98(0x10)
	struct Guid                                                  WielderEndShipCrew;                                // 0xa8(0x10)
	bool                                                         GrappledToLadder;                                  // 0xb8(0x1)
	char                                                         pad0x7_TVTLK[0x7];                                 // 0xb9(0x7)
};


// Size 0x3
struct EventPortableHarpoonProjectileClientStateChanged
{
public:
	char                                                         PreviousProjectileState;                           // 0x0(0x1)
	char                                                         ProjectileState;                                   // 0x1(0x1)
	bool                                                         IsPredicted;                                       // 0x2(0x1)
};


// Size 0x14
struct PortableHarpoonTelemetryTemporaryData
{
public:
	char                                                         pad0x14_ROD3G[0x14];                               // 0x0(0x14)
};


// Size 0x8
struct EventPortableHarpoonHarpoonedItem
{
public:
	class Actor*                                                 HarpoonedItem;                                     // 0x0(0x8)
};


