#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x30
struct IncrementalActorBuilderFailedTelemetryEvent
{
public:
	struct Guid                                                  BuildId;                                           // 0x0(0x10)
	struct FString                                               ActorClassName;                                    // 0x10(0x10)
	struct FString                                               FailureReason;                                     // 0x20(0x10)
};


// Size 0x20
struct IncrementalActorBuilderCanceledTelemetryEvent
{
public:
	struct Guid                                                  BuildId;                                           // 0x0(0x10)
	struct FString                                               ActorClassName;                                    // 0x10(0x10)
};


// Size 0x40
struct PerFrameIncrementalActorBuildStepStats
{
public:
	double                                                       MinTimeSpentMs;                                    // 0x0(0x8)
	double                                                       MaxTimeSpentMs;                                    // 0x8(0x8)
	double                                                       AvgTimeSpentMs;                                    // 0x10(0x8)
	double                                                       StdDevTimeSpentMs;                                 // 0x18(0x8)
	float                                                        StdDevChildActorComponentsProcessed;               // 0x2c(0x4)
	int                                                          TotalFrames;                                       // 0x30(0x4)
	char                                                         pad0x4_KI4RS[0x4];                                 // 0x34(0x4)
	double                                                       TotalTimeMs;                                       // 0x38(0x8)
};


// Size 0x20
struct IncrementalActorBuilderStartedTelemetryEvent
{
public:
	struct Guid                                                  BuildId;                                           // 0x0(0x10)
	struct FString                                               ActorClassName;                                    // 0x10(0x10)
};


// Size 0x38
struct PerObjectIncrementalActorBuildStepStats
{
public:
	int                                                          NumChildActorComponents;                           // 0x0(0x4)
	char                                                         pad0x4_6XVUY[0x4];                                 // 0x4(0x4)
	struct FString                                               SlowestChildActorComponentName;                    // 0x8(0x10)
	double                                                       MinTimeSpentMs;                                    // 0x18(0x8)
	double                                                       MaxTimeSpentMs;                                    // 0x20(0x8)
	double                                                       AvgTimeSpentMs;                                    // 0x28(0x8)
	double                                                       StdDevTimeSpentMs;                                 // 0x30(0x8)
};


// Size 0x148
struct IncrementalActorBuilderCompletedTelemetryEvent
{
public:
	struct Guid                                                  BuildId;                                           // 0x0(0x10)
	struct FString                                               ActorClassName;                                    // 0x10(0x10)
	double                                                       TotalWallClockSpawnTimeMs;                         // 0x20(0x8)
	double                                                       TotalInternalSpawnTimeMs;                          // 0x28(0x8)
	double                                                       SpawnInitialActorSpawnMs;                          // 0x38(0x8)
	struct PerObjectIncrementalActorBuildStepStats               PerObjectSpawnChildActorsStats;                    // 0x40(0x38)
	struct PerObjectIncrementalActorBuildStepStats               PerObjectChildActorConstructionStats;              // 0x78(0x38)
	struct PerFrameIncrementalActorBuildStepStats                PerFrameSpawnChildActorsStats;                     // 0xb0(0x40)
	struct PerFrameIncrementalActorBuildStepStats                PerFrameChildActorConstructionStats;               // 0xf0(0x40)
	double                                                       AllChildActorsConstructedMs;                       // 0x130(0x8)
	int                                                          NumChildActorComponents;                           // 0x138(0x4)
	int                                                          NumComponents;                                     // 0x13c(0x4)
	double                                                       PerFrameTimeBudgetMs;                              // 0x140(0x8)
};


