#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x48
struct IsNewInteractingPlayerCondition
{
public:
	char                                                         pad0x8_BUTPF[0x8];                                 // 0x0(0x8)
	struct ConditionContextPayloadSelectorInstance               PlayerPayloadSelector;                             // 0x8(0x20)
	struct ConditionContextPayloadSelectorInstance               InteractablePayloadSelector;                       // 0x28(0x20)
};


// Size 0x18
struct InteractionEdTelemetryEvent
{
public:
	struct Vector                                                InteractorPosition;                                // 0x0(0xc)
	struct Vector                                                TargetPosition;                                    // 0xc(0xc)
};


// Size 0x28
struct InteractionDistanceCheckFailedTelemetryEvent
{
public:
	float                                                        Distance;                                          // 0x0(0x4)
	char                                                         pad0x4_W7GNC[0x4];                                 // 0x4(0x4)
	struct FString                                               DistanceRating;                                    // 0x8(0x10)
	float                                                        DistanceThreshold_Used;                            // 0x18(0x4)
	float                                                        DistanceThreshold_Config;                          // 0x1c(0x4)
	float                                                        DistanceThreshold_Settings;                        // 0x20(0x4)
	char                                                         pad0x4_9JMF6[0x4];                                 // 0x24(0x4)
};


// Size 0x2
struct EventInteractionBlockingStateChanged
{
public:
	bool                                                         IsInteractionBlocked;                              // 0x0(0x1)
	char                                                         InteractionBlockReason;                            // 0x1(0x1)
};


// Size 0x38
struct InteractLoadableValidityCheckFailedTelemetryEvent
{
public:
	struct FString                                               LoadableObject;                                    // 0x0(0x10)
	struct FString                                               InteractableObject;                                // 0x10(0x10)
	struct Vector                                                LoadablePosition;                                  // 0x20(0xc)
	float                                                        DistancePlayerToLoadable;                          // 0x2c(0x4)
	bool                                                         IsLoadableValid;                                   // 0x30(0x1)
	bool                                                         IsInteractableValid;                               // 0x31(0x1)
	char                                                         pad0x6_IRW8W[0x6];                                 // 0x32(0x6)
};


// Size 0x10
struct EventOptimalInteractionObjectChanged
{
public:
	class Object*                                                PreviousFocusObject;                               // 0x0(0x8)
	class Object*                                                NewFocusObject;                                    // 0x8(0x8)
};


// Size 0x18
struct EventInteractorChangedOptimalInteractionObject
{
public:
	class Actor*                                                 InteractingActor;                                  // 0x0(0x8)
	class Object*                                                PreviousFocusObject;                               // 0x8(0x8)
	class Object*                                                NewFocusObject;                                    // 0x10(0x8)
};


