#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x14
struct InvasionServiceMatchmakingCrewInfo
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	char                                                         CrewSessionType;                                   // 0x10(0x1)
};


// Size 0x8
struct TaleDisplayedInvasionBanner
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x70
struct InvasionBannerNetworkEvent
{
public:
	struct FText                                                 Message;                                           // 0x18(0x38)
	struct Guid                                                  CrewId;                                            // 0x50(0x10)
	char                                                         Faction;                                           // 0x60(0x1)
	struct FName                                                 Tag;                                               // 0x64(0x8)
	bool                                                         DisableMusic;                                      // 0x6c(0x1)
};


// Size 0x20
struct InvasionCrewData
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	char                                                         InvasionStatus;                                    // 0x10(0x1)
	struct FName                                                 FactionIdentifier;                                 // 0x14(0x8)
	bool                                                         ReadyForInvasion;                                  // 0x1c(0x1)
};


// Size 0x10
struct CrewStartedInvasion
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x10
struct CrewJoinedInvasionBattleTelemetryEvent
{
public:
	TArray<String>                                               ItemsBroughtToBattle;                              // 0x0(0x10)
};


// Size 0x10
struct CrewStoppedInvasion
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x28
struct ReplicatedInvasionCrewMusicState
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct TimeStampedShipDiveMusicState                         CurrentTimeStampedMusicState;                      // 0x10(0x18)
};


// Size 0x10
struct CrewMatchmakingCancelledDueToInvasion
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x78
struct InvasionParticipatingCrewData
{
public:
	TArray<struct InvasionCrewData>                              CrewIds;                                           // 0x0(0x10)
	TArray<class CrewVoyageParticipant*>                         Participants;                                      // 0x10(0x10)
};


// Size 0x50
struct InvasionEndedTelemetryEvent
{
public:
	TArray<struct InvasionCrewData>                              Participants;                                      // 0x0(0x10)
	struct InvasionCrewData                                      Winner;                                            // 0x10(0x20)
	float                                                        InvasionDurationInSeconds;                         // 0x30(0x4)
	TArray<struct CrewFactionTelemetryData>                      ParticipantFactionData;                            // 0x38(0x10)
	char                                                         InvasionEndedReason;                               // 0x48(0x1)
};


