#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x10
struct CrewStartedInvasion
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x70
struct InvasionBannerNetworkEvent
{
public:
	char                                                         pad0x18_LO4IT[0x18];                               // 0x0(0x18)
	struct FText                                                 Message;                                           // 0x18(0x38)
	struct Guid                                                  CrewId;                                            // 0x50(0x10)
	char                                                         Faction;                                           // 0x60(0x1)
	char                                                         pad0x3_Y7792[0x3];                                 // 0x61(0x3)
	struct FName                                                 Tag;                                               // 0x64(0x8)
	bool                                                         DisableMusic;                                      // 0x6c(0x1)
	char                                                         pad0x3_E1DTT[0x3];                                 // 0x6d(0x3)
};


// Size 0x28
struct MatchesTriggerStartMatchRpc
{
public:
	char                                                         pad0x18_J1W6O[0x18];                               // 0x0(0x18)
	struct FString                                               MatchID;                                           // 0x18(0x10)
};


// Size 0x30
struct InvasionBattleCrewSuppliesOnJoinTelemetryEvent
{
public:
	struct Guid                                                  TelemetryId;                                       // 0x0(0x10)
	struct JsonObjectWrapper                                     Json;                                              // 0x10(0x18)
	bool                                                         RestockCrateWasSpawned;                            // 0x28(0x1)
	char                                                         pad0x7_AUP1F[0x7];                                 // 0x29(0x7)
};


// Size 0x10
struct CrewJoinedInvasionBattleTelemetryEvent
{
public:
	TArray<String>                                               ItemsBroughtToBattle;                              // 0x0(0x10)
};


// Size 0x8
struct TaleDisplayedInvasionBanner
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x10
struct EventBoundsStartedShrinking
{
public:
	char                                                         pad0x10_COHXQ[0x10];                               // 0x0(0x10)
};


// Size 0x14
struct InvasionServiceMatchmakingCrewInfo
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	char                                                         CrewSessionType;                                   // 0x10(0x1)
	char                                                         pad0x3_N1JL8[0x3];                                 // 0x11(0x3)
};


// Size 0x10
struct CrewStoppedInvasion
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x28
struct PlayerData
{
public:
	struct FString                                               PlayerId;                                          // 0x0(0x10)
	struct FString                                               PlayerName;                                        // 0x10(0x10)
	char                                                         PlatformId;                                        // 0x20(0x1)
	char                                                         pad0x7_WVIXE[0x7];                                 // 0x21(0x7)
};


// Size 0x18
struct InvasionCrateSettingsPerShipSize
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	class UClass*                                                CrateDesc;                                         // 0x8(0x8)
	class InvasionCrateSettingsDataAsset*                        ItemLimits;                                        // 0x10(0x8)
};


// Size 0x10
struct InvasionCrateSettings
{
public:
	class UClass*                                                ItemDesc;                                          // 0x0(0x8)
	int                                                          MaxNumItems;                                       // 0x8(0x4)
	char                                                         pad0x4_DSDUB[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct InvasionBattleBoundsAudioEvent
{
public:
	int                                                          PhaseIndex;                                        // 0x0(0x4)
	char                                                         pad0x4_88A42[0x4];                                 // 0x4(0x4)
	double                                                       TimeStamp;                                         // 0x8(0x8)
};


// Size 0x10
struct EventBoundsStoppedShrinking
{
public:
	char                                                         pad0x10_0ZKNP[0x10];                               // 0x0(0x10)
};


// Size 0x28
struct ReplicatedInvasionCrewMusicState
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct TimeStampedShipDiveMusicState                         CurrentTimeStampedMusicState;                      // 0x10(0x18)
};


// Size 0x20
struct InvasionCrewData
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	char                                                         InvasionStatus;                                    // 0x10(0x1)
	char                                                         pad0x3_UB2G4[0x3];                                 // 0x11(0x3)
	struct FName                                                 FactionIdentifier;                                 // 0x14(0x8)
	bool                                                         ReadyForInvasion;                                  // 0x1c(0x1)
	char                                                         pad0x3_IF9R3[0x3];                                 // 0x1d(0x3)
};


// Size 0x28
struct InvasionBattleCrewSuppliesAfterRestockTelemetryEvent
{
public:
	struct Guid                                                  TelemetryId;                                       // 0x0(0x10)
	struct JsonObjectWrapper                                     Json;                                              // 0x10(0x18)
};


// Size 0x14
struct BoundsStartedShrinkingTelemetryEvent
{
public:
	float                                                        OldRadius;                                         // 0x0(0x4)
	struct Guid                                                  BoundsId;                                          // 0x4(0x10)
};


// Size 0x48
struct MatchesTriggerEndMatchRpc
{
public:
	char                                                         pad0x18_KFNTO[0x18];                               // 0x0(0x18)
	struct FString                                               MatchID;                                           // 0x18(0x10)
	struct FString                                               WinningTeamId;                                     // 0x28(0x10)
	struct FString                                               LosingTeamId;                                      // 0x38(0x10)
};


// Size 0x10
struct EventBoundsPreStartShrinking
{
public:
	char                                                         pad0x10_797QL[0x10];                               // 0x0(0x10)
};


// Size 0x14
struct BoundsStoppedShrinkingTelemetryEvent
{
public:
	float                                                        NewRadius;                                         // 0x0(0x4)
	struct Guid                                                  BoundsId;                                          // 0x4(0x10)
};


// Size 0xc
struct TransitionData
{
public:
	int                                                          SloopTransitionTime;                               // 0x0(0x4)
	int                                                          BrigTransitionTime;                                // 0x4(0x4)
	int                                                          GalleonTransitionTime;                             // 0x8(0x4)
};


// Size 0x28
struct MatchesCreateMatchSuccessfulRpc
{
public:
	char                                                         pad0x18_FX8AS[0x18];                               // 0x0(0x18)
	struct FString                                               MatchID;                                           // 0x18(0x10)
};


// Size 0x28
struct MatchesTriggerUpdateMatchRpc
{
public:
	char                                                         pad0x18_W5KBT[0x18];                               // 0x0(0x18)
	struct FString                                               MatchID;                                           // 0x18(0x10)
};


// Size 0x1c
struct PhaseData
{
public:
	float                                                        PhaseTime;                                         // 0x0(0x4)
	int                                                          SloopInnerRadius;                                  // 0x4(0x4)
	int                                                          SloopOuterRadius;                                  // 0x8(0x4)
	int                                                          BrigInnerRadius;                                   // 0xc(0x4)
	int                                                          BrigOuterRadius;                                   // 0x10(0x4)
	int                                                          GalleonInnerRadius;                                // 0x14(0x4)
	int                                                          GalleonOuterRadius;                                // 0x18(0x4)
};


// Size 0x10
struct CrewReadyToStartInvasion
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x10
struct CrewMatchmakingCancelledDueToInvasion
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x50
struct MatchesTriggerPlayerLeaveRpc
{
public:
	char                                                         pad0x18_L00UX[0x18];                               // 0x0(0x18)
	struct FString                                               MatchID;                                           // 0x18(0x10)
	struct PlayerData                                            PlayerData;                                        // 0x28(0x28)
};


// Size 0x50
struct InvasionEndedTelemetryEvent
{
public:
	TArray<struct InvasionCrewData>                              Participants;                                      // 0x0(0x10)
	struct InvasionCrewData                                      Winner;                                            // 0x10(0x20)
	float                                                        InvasionDurationInSeconds;                         // 0x30(0x4)
	char                                                         pad0x4_M4SI3[0x4];                                 // 0x34(0x4)
	TArray<struct CrewFactionTelemetryData>                      ParticipantFactionData;                            // 0x38(0x10)
	char                                                         InvasionEndedReason;                               // 0x48(0x1)
	char                                                         pad0x7_N1F5U[0x7];                                 // 0x49(0x7)
};


// Size 0x78
struct MatchesTriggerCreateMatchRpc
{
public:
	char                                                         pad0x18_QUM6W[0x18];                               // 0x0(0x18)
	struct FString                                               ActivityId;                                        // 0x18(0x10)
	int                                                          InactivityExpirationTimeSeconds;                   // 0x28(0x4)
	char                                                         pad0x4_H0HXM[0x4];                                 // 0x2c(0x4)
	TArray<struct PlayerData>                                    PlayersTeamA;                                      // 0x30(0x10)
	TArray<struct PlayerData>                                    PlayersTeamB;                                      // 0x40(0x10)
	char                                                         TypeTeamA;                                         // 0x50(0x1)
	char                                                         TypeTeamB;                                         // 0x51(0x1)
	char                                                         pad0x6_OG7OG[0x6];                                 // 0x52(0x6)
	struct FString                                               IdTeamA;                                           // 0x58(0x10)
	struct FString                                               IdTeamB;                                           // 0x68(0x10)
};


// Size 0x78
struct InvasionParticipatingCrewData
{
public:
	TArray<struct InvasionCrewData>                              CrewIds;                                           // 0x0(0x10)
	TArray<class CrewVoyageParticipant*>                         Participants;                                      // 0x10(0x10)
	char                                                         pad0x58_828BJ[0x58];                               // 0x20(0x58)
};


// Size 0x18
struct InvasionCrateSettingsPerFaction
{
public:
	class UClass*                                                Faction;                                           // 0x0(0x8)
	TArray<struct InvasionCrateSettingsPerShipSize>              CrateSettings;                                     // 0x8(0x10)
};


// Size 0x60
struct MatchesTriggerPlayerJoinRpc
{
public:
	char                                                         pad0x18_86UWG[0x18];                               // 0x0(0x18)
	struct FString                                               MatchID;                                           // 0x18(0x10)
	struct PlayerData                                            PlayerData;                                        // 0x28(0x28)
	struct Guid                                                  CrewId;                                            // 0x50(0x10)
};


