// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x18
struct TimeStampedInvasionMusicState
{
public:
	Class Company*                                               Faction;                                           // 0x0(0x8)
	byte                                                         InvasionMusicState;                                // 0x8(0x1)
	char                                                         pad0x7_0RD9J[0x7];                                 // 0x9(0x7)
	double                                                       EnteredStateServerTimeStamp;                       // 0x10(0x8)
};


// Size 0x20
struct InvasionCrewData
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	byte                                                         InvasionStatus;                                    // 0x10(0x1)
	char                                                         pad0x3_HW44T[0x3];                                 // 0x11(0x3)
	struct FName                                                 FactionIdentifier;                                 // 0x14(0x8)
	bool                                                         ReadyForInvasion;                                  // 0x1c(0x1)
};


// Size 0x28
struct ReplicatedInvasionCrewMusicState
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	Struct TimeStampedInvasionMusicState                         CurrentTimeStampedMusicState;                      // 0x10(0x18)
};


// Size 0x68
struct InvasionBannerNetworkEvent
{
public:
	Struct FText                                                 Message;                                           // 0x10(0x38)
	Struct Guid                                                  CrewId;                                            // 0x48(0x10)
	byte                                                         Faction;                                           // 0x58(0x1)
	char                                                         pad0x3_Z83F4[0x3];                                 // 0x59(0x3)
	struct FName                                                 Tag;                                               // 0x5c(0x8)
	bool                                                         DisableMusic;                                      // 0x64(0x1)
};


// Size 0x8
struct TaleDisplayedInvasionBanner
{
public:
	Class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x10
struct CrewMatchmakingCancelledDueToInvasion
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x10
struct CrewStoppedInvasion
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x10
struct CrewStartedInvasion
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x18
struct InvasionCrewMusicStateChangedClientEvent
{
public:
	Struct TimeStampedInvasionMusicState                         InvasionCrewMusicState;                            // 0x0(0x18)
};


// Size 0x78
struct InvasionParticipatingCrewData
{
public:
	TArray<struct CrewIds>                                       CrewIds;                                           // 0x0(0x10)
	TArray<class CrewVoyageParticipant*>                         Participants;                                      // 0x10(0x10)
};


// Size 0x50
struct InvasionEndedTelemetryEvent
{
public:
	TArray<struct Participants>                                  Participants;                                      // 0x0(0x10)
	Struct InvasionCrewData                                      Winner;                                            // 0x10(0x20)
	float                                                        InvasionDurationInSeconds;                         // 0x30(0x4)
	char                                                         pad0x4_NIZ1Y[0x4];                                 // 0x34(0x4)
	TArray<struct ParticipantFactionData>                        ParticipantFactionData;                            // 0x38(0x10)
	byte                                                         InvasionEndedReason;                               // 0x48(0x1)
};


// Size 0x10
struct CrewJoinedInvasionBattleTelemetryEvent
{
public:
	TArray<Str ItemsBroughtToBattle>                             ItemsBroughtToBattle;                              // 0x0(0x10)
};


// Size 0x14
struct InvasionServiceMatchmakingCrewInfo
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	byte                                                         CrewSessionType;                                   // 0x10(0x1)
};


}