// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10
struct PerComanyItemQualityEntry
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	byte                                                         Quality;                                           // 0x8(0x1)
};


// Size 0x18
struct PerComanyComplexItemQualityEntry
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	TArray<struct QualityData>                                   QualityData;                                       // 0x8(0x10)
};


// Size 0x10
struct ComplexItemQualityEntry
{
public:
	byte                                                         OnTime;                                            // 0x0(0x1)
	byte                                                         HealthLevel;                                       // 0x1(0x1)
	byte                                                         IsComissioned;                                     // 0x2(0x1)
	byte                                                         IsStolen;                                          // 0x3(0x1)
	byte                                                         QueryReason;                                       // 0x4(0x1)
	byte                                                         QualityLevel;                                      // 0x5(0x1)
	char                                                         pad0x2_ZNBAA[0x2];                                 // 0x6(0x2)
	struct FName                                                 Rarity;                                            // 0x8(0x8)
};


}