#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "ItemQuality_Structs.h"


// Size 0x60 (Full Size[0x118] - InheritedSize[0xb8]
class ItemQualityComponent: public ActorComponent
{
public:
	char                                                         pad0x8_OUU4U[0x8];                                 // 0xb8(0x8)
	char                                                         ItemQualityLevel;                                  // 0xc0(0x1)
	char                                                         pad0x7_B4XU1[0x7];                                 // 0xc1(0x7)
	TArray<struct PerComanyItemQualityEntry>                     CompanySpecificItemQualityLevels;                  // 0xc8(0x10)
	TArray<struct PerComanyComplexItemQualityEntry>              CompanySpecificComplexItemQualityLevels;           // 0xd8(0x10)
	TArray<struct PerComanyComplexItemQualityEntry>              CompanySpecificComplexItemQualityLevelsHandin;     // 0xe8(0x10)
	TArray<struct CompanySpecificComplexItemQualityOverrides>    CompanySpecificComplexItemQualityOverrideList;     // 0xf8(0x10)
	class GuildSettings*                                         GuildSettings;                                     // 0x108(0x8)
	char                                                         pad0x8_Q6IWH[0x8];                                 // 0x110(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ItemQualityInterface: public Interface
{
public:
};


