#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x10
struct ComplexItemQualityEntry
{
public:
	char                                                         OnTime;                                            // 0x0(0x1)
	char                                                         HealthLevel;                                       // 0x1(0x1)
	char                                                         IsComissioned;                                     // 0x2(0x1)
	char                                                         IsStolen;                                          // 0x3(0x1)
	char                                                         QueryReason;                                       // 0x4(0x1)
	char                                                         QualityLevel;                                      // 0x5(0x1)
	char                                                         pad0x2_P5M0E[0x2];                                 // 0x6(0x2)
	struct FName                                                 Rarity;                                            // 0x8(0x8)
};


// Size 0x10
struct PerComanyItemQualityEntry
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	char                                                         Quality;                                           // 0x8(0x1)
	char                                                         pad0x7_0X12Z[0x7];                                 // 0x9(0x7)
};


// Size 0x18
struct PerComanyComplexItemQualityEntry
{
public:
	class UClass*                                                Company;                                           // 0x0(0x8)
	TArray<struct ComplexItemQualityEntry>                       QualityData;                                       // 0x8(0x10)
};


