// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class KnockbackInterface: public Interface
{
public:
};


// Size 0x80 (Full Size[0x670] - InheritedSize[0x5f0]
class KnockbackColliderComponent: public BoxComponent
{
public:
	struct CollisionProfileName                                  SolidCollisionProfile;                             // 0x5e8(0x8)
	struct CollisionProfileName                                  KnockbackTraceProfile;                             // 0x5f0(0x8)
	byte                                                         KnockbackType;                                     // 0x5f8(0x1)
	char                                                         pad0x3_2T8B7[0x3];                                 // 0x5f9(0x3)
	struct KnockBackInfo                                         KnockbackParams;                                   // 0x5fc(0x50)
	class UClass*                                                KnockbackDamageType;                               // 0x658(0x8)
	float                                                        KnockbackInterval;                                 // 0x660(0x4)
	char                                                         pad0x4_BKWIA[0x4];                                 // 0x664(0x4)
	byte                                                         SolidState;                                        // 0x668(0x1)
	char                                                         pad0x7_J7DFB[0x7];                                 // 0x669(0x7)
};


}