#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x80 (Full Size[0x680] - InheritedSize[0x600]
class KnockbackColliderComponent: public BoxComponent
{
public:
	struct CollisionProfileName                                  SolidCollisionProfile;                             // 0x5f8(0x8)
	struct CollisionProfileName                                  KnockbackTraceProfile;                             // 0x600(0x8)
	char                                                         KnockbackType;                                     // 0x608(0x1)
	struct KnockBackInfo                                         KnockbackParams;                                   // 0x60c(0x50)
	class Actor*                                                 ActorToTarget;                                     // 0x65c(0x8)
	class UClass*                                                KnockbackDamageType;                               // 0x668(0x8)
	float                                                        KnockbackInterval;                                 // 0x670(0x4)
	char                                                         SolidState;                                        // 0x678(0x1)
};


