// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc
struct CoordinatedKrakenExplosionEvent
{
public:
	int                                                          ExplosionPointIndex;                               // 0x0(0x4)
	float                                                        TimeOffset;                                        // 0x4(0x4)
	char                                                         pad0x4_JK95Z[0x4];                                 // 0x8(0x4)
};


// Size 0x10
struct CoordinatedKrakenHeadAction
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	float                                                        TimeOffset;                                        // 0x8(0x4)
	char                                                         pad0x4_BVV03[0x4];                                 // 0xc(0x4)
};


// Size 0xc
struct CoordinatedKrakenSpecialEvent
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	char                                                         pad0x3_TURXY[0x3];                                 // 0x1(0x3)
	float                                                        TimeOffset;                                        // 0x4(0x4)
	char                                                         pad0x4_UXS8N[0x4];                                 // 0x8(0x4)
};


// Size 0x18
struct CoordinatedKrakenTentacleAction
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	int                                                          TentacleIndex;                                     // 0x8(0x4)
	float                                                        TimeOffset;                                        // 0xc(0x4)
	char                                                         pad0x8_F7O5Z[0x8];                                 // 0x10(0x8)
};


// Size 0x330
struct CoordinatedKrakenAction
{
public:
	struct FName                                                 ActionName;                                        // 0x0(0x8)
	float                                                        ActionLength;                                      // 0x8(0x4)
	byte                                                         ActionType;                                        // 0xc(0x1)
	char                                                         pad0x3_7F6GM[0x3];                                 // 0xd(0x3)
	TArray<struct CoordinatedKrakenSpecialEvent>                 SpecialEvents;                                     // 0x10(0x10)
	TArray<struct CoordinatedKrakenTentacleAction>               TentacleActions;                                   // 0x20(0x10)
	TArray<struct CoordinatedKrakenHeadAction>                   HeadActions;                                       // 0x30(0x10)
	TArray<struct CoordinatedKrakenExplosionEvent>               ExplosionEvents;                                   // 0x40(0x10)
	struct RuntimeVectorCurve                                    TargetActorLocationAnimation;                      // 0x50(0x170)
	struct RuntimeVectorCurve                                    TargetActorRotationAnimation;                      // 0x1c0(0x170)
};


// Size 0x10
struct KrakenShipHittingBehaviourParamsCollection
{
public:
	TArray<class KrakenShipHittingBehaviourParamsDataAsset*>     Params;                                            // 0x0(0x10)
};


// Size 0x60
struct KrakenShipHittingBehaviourParams
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	class UClass*                                                TentacleType;                                      // 0x8(0x8)
	struct WeightedProbabilityRangeOfRanges                      DamageRequiredToCancelImpact;                      // 0x10(0x30)
	float                                                        CancellationThreshold;                             // 0x40(0x4)
	float                                                        ImpactTime;                                        // 0x44(0x4)
	int                                                          LevelsOfDamage;                                    // 0x48(0x4)
	char                                                         pad0x4_WMEDO[0x4];                                 // 0x4c(0x4)
	TArray<struct KrakenShipHittingBehaviourImpactParams>        Configurations;                                    // 0x50(0x10)
};


// Size 0xa0
struct KrakenShipHittingBehaviourImpactParams
{
public:
	int                                                          Weight;                                            // 0x0(0x4)
	char                                                         pad0xc_3AKQF[0xc];                                 // 0x4(0xc)
	struct Transform                                             TentacleTransform;                                 // 0x10(0x30)
	struct Vector                                                ImpactLocation;                                    // 0x40(0xc)
	struct Vector                                                ImpactForce;                                       // 0x4c(0xc)
	struct Vector                                                DamageLocation;                                    // 0x58(0xc)
	char                                                         pad0x4_BPLKB[0x4];                                 // 0x64(0x4)
	struct WeightedProbabilityRangeOfRanges                      NumZonesToDamage;                                  // 0x68(0x30)
	char                                                         pad0x8_AHCO8[0x8];                                 // 0x98(0x8)
};


// Size 0xf0
struct KrakenShipWrappingTentacleParams
{
public:
	struct KrakenShipWrappingTentacleAnimationPhaseCollection    AnimationStates;                                   // 0x0(0x80)
	float                                                        TimeIntoWrappingToDisableInteractables;            // 0x80(0x4)
	float                                                        TimeIntoUnwrappingToEnableInteractables;           // 0x84(0x4)
	float                                                        TimeIntoWrappingToEnableCollisions;                // 0x88(0x4)
	float                                                        TimeIntoUnwrappingToDisableCollisions;             // 0x8c(0x4)
	float                                                        TimeIntoEnteringShakeAttackToEnableCollisions;     // 0x90(0x4)
	float                                                        TimeIntoExitingShakeAttackToDisableCollisions;     // 0x94(0x4)
	float                                                        HighDetailAnimationStreamingDistance;              // 0x98(0x4)
	char                                                         pad0x4_54GOH[0x4];                                 // 0x9c(0x4)
	struct KrakenShipWrappingTentacleVFXParams                   WrappingOutOfWaterSplashVFX;                       // 0xa0(0x28)
	struct KrakenShipWrappingTentacleVFXParams                   WrappingIntoWaterSplashVFX;                        // 0xc8(0x28)
};


// Size 0x28
struct KrakenShipWrappingTentacleVFXParams
{
public:
	class ParticleSystem*                                        VFX;                                               // 0x0(0x8)
	float                                                        TriggerTime;                                       // 0x8(0x4)
	struct Vector                                                Location;                                          // 0xc(0xc)
	struct Rotator                                               Rotation;                                          // 0x18(0xc)
	char                                                         pad0x4_N56VD[0x4];                                 // 0x24(0x4)
};


// Size 0x80
struct KrakenShipWrappingTentacleAnimationPhaseCollection
{
public:
	struct KrakenShipWrappingTentacleAnimationStateParams        Dormant;                                           // 0x0(0x10)
	struct KrakenShipWrappingTentacleAnimationStateParams        Wrapping;                                          // 0x10(0x10)
	struct KrakenShipWrappingTentacleAnimationStateParams        AmbientWobble;                                     // 0x20(0x10)
	struct KrakenShipWrappingTentacleAnimationStateParams        EnteringShakeAttack;                               // 0x30(0x10)
	struct KrakenShipWrappingTentacleAnimationStateParams        ShakeAttack;                                       // 0x40(0x10)
	struct KrakenShipWrappingTentacleAnimationStateParams        ExitingShakeAttack;                                // 0x50(0x10)
	struct KrakenShipWrappingTentacleAnimationStateParams        HeavyAttack;                                       // 0x60(0x10)
	struct KrakenShipWrappingTentacleAnimationStateParams        Unwrapping;                                        // 0x70(0x10)
};


// Size 0x10
struct KrakenShipWrappingTentacleAnimationStateParams
{
public:
	bool                                                         Visible;                                           // 0x0(0x1)
	char                                                         pad0x3_NPSKU[0x3];                                 // 0x1(0x3)
	int                                                          StartFrame;                                        // 0x4(0x4)
	int                                                          EndFrame;                                          // 0x8(0x4)
	float                                                        Duration;                                          // 0xc(0x4)
};


// Size 0x10
struct KrakenShipWrappingTentacleAnimationState
{
public:
	char                                                         pad0x4_7GF29[0x4];                                 // 0x0(0x4)
	byte                                                         State;                                             // 0x4(0x1)
	char                                                         pad0x3_ZB7VO[0x3];                                 // 0x5(0x3)
	double                                                       EndTime;                                           // 0x8(0x8)
};


// Size 0x28
struct KrakenAnchorDynamicsParams
{
public:
	char                                                         pad0x28_9D8L1[0x28];                               // 0x0(0x28)
};


// Size 0x50
struct KrakenDynamicsParams
{
public:
	struct KrakenDynamicsStateParams                             AmbientWobble;                                     // 0x0(0x10)
	struct KrakenDynamicsStateParams                             EnteringShakeAttack;                               // 0x10(0x10)
	struct KrakenDynamicsStateParams                             ShakeAttack;                                       // 0x20(0x10)
	struct KrakenDynamicsStateParams                             ExitingShakeAttack;                                // 0x30(0x10)
	struct KrakenDynamicsStateParams                             HeavyAttack;                                       // 0x40(0x10)
};


// Size 0x10
struct KrakenDynamicsStateParams
{
public:
	TArray<struct KrakenDynamicsStateFragmentParams>             FragmentParams;                                    // 0x0(0x10)
};


// Size 0x20
struct KrakenDynamicsStateFragmentParams
{
public:
	class CurveVector*                                           TorqueCurve;                                       // 0x0(0x8)
	float                                                        BaselineTorque;                                    // 0x8(0x4)
	char                                                         pad0x4_AHLYW[0x4];                                 // 0xc(0x4)
	TArray<struct KrakenDynamicsStateEvent>                      Events;                                            // 0x10(0x10)
};


// Size 0xc
struct KrakenDynamicsStateEvent
{
public:
	byte                                                         Event;                                             // 0x0(0x1)
	char                                                         pad0x3_7BACN[0x3];                                 // 0x1(0x3)
	float                                                        Time;                                              // 0x4(0x4)
	float                                                        Value;                                             // 0x8(0x4)
};


// Size 0x10
struct KrakenShipWrappingBehaviourParamsCollection
{
public:
	TArray<class KrakenShipWrappingBehaviourParamsDataAsset*>    Params;                                            // 0x0(0x10)
};


// Size 0x420
struct KrakenShipWrappingBehaviourParams
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	char                                                         pad0x8_OSS0T[0x8];                                 // 0x8(0x8)
	struct KrakenShipWrappingBehaviourWarningParams              WarningParams;                                     // 0x10(0xa0)
	struct KrakenShipWrappingBehaviourWrapParams                 WrapParams;                                        // 0xb0(0x140)
	struct KrakenShipWrappingBehaviourTentacleHeadParams         TentacleHeadParams;                                // 0x1f0(0x48)
	struct KrakenShipWrappingBehaviourShakeAttackParams          ShakeAttackParams;                                 // 0x238(0x68)
	struct KrakenShipWrappingBehaviourHeavyAttackParams          HeavyAttackParams;                                 // 0x2a0(0xd8)
	struct KrakenShipWrappingBehaviourDamageParams               DamageParams;                                      // 0x378(0x70)
	struct KrakenShipWrappingBehaviourHealthParams               HealthParams;                                      // 0x3e8(0x38)
};


// Size 0x38
struct KrakenShipWrappingBehaviourHealthParams
{
public:
	struct WeightedProbabilityRangeOfRanges                      HealthReductionRequiredToUnwrapTheShipRange;       // 0x0(0x30)
	char                                                         pad0x8_RYXS4[0x8];                                 // 0x30(0x8)
};


// Size 0x70
struct KrakenShipWrappingBehaviourDamageParams
{
public:
	float                                                        ChanceOfDamagingBottomDeckDamageHoles;             // 0x0(0x4)
	float                                                        ChanceThatExistingHolesWillBeDamaged;              // 0x4(0x4)
	int                                                          LevelsOfDamage;                                    // 0x8(0x4)
	char                                                         pad0x4_DYL0K[0x4];                                 // 0xc(0x4)
	struct WeightedProbabilityRangeOfRanges                      NumHolesToDamageRange;                             // 0x10(0x30)
	struct WeightedProbabilityRangeOfRanges                      DamageIntervalRange;                               // 0x40(0x30)
};


// Size 0xd8
struct KrakenShipWrappingBehaviourHeavyAttackParams
{
public:
	struct WeightedProbabilityRangeOfRanges                      AttackDuration;                                    // 0x0(0x30)
	float                                                        ChanceOfEnteringHeavyAttack;                       // 0x30(0x4)
	struct KnockBackInfo                                         ExteriorKnockbackParams;                           // 0x34(0x50)
	struct KnockBackInfo                                         InteriorKnockbackParams;                           // 0x84(0x50)
	char                                                         pad0x4_Q1KQB[0x4];                                 // 0xd4(0x4)
};


// Size 0x68
struct KrakenShipWrappingBehaviourShakeAttackParams
{
public:
	struct WeightedProbabilityRangeOfRanges                      TimeBetweenShakeAttackAttempts;                    // 0x0(0x30)
	struct WeightedProbabilityRangeOfRanges                      AttackDuration;                                    // 0x30(0x30)
	float                                                        ChanceOfShake;                                     // 0x64(0x4)
};


// Size 0x48
struct KrakenShipWrappingBehaviourTentacleHeadParams
{
public:
	class UClass*                                                TentacleType;                                      // 0x0(0x8)
	struct WeightedProbabilityRangeOfRanges                      DamageRequiredToRelocate;                          // 0x8(0x30)
	float                                                        RelocationThreshold;                               // 0x38(0x4)
	float                                                        ChanceOfSwitchingSides;                            // 0x3c(0x4)
	float                                                        ChanceOfSelectingNearLocationAfterSwitchingSides;  // 0x40(0x4)
	float                                                        ChanceOfSelectingSelectingDifferentDistanceFromShipWhenRemaningOnSameSide; // 0x44(0x4)
};


// Size 0x140
struct KrakenShipWrappingBehaviourWrapParams
{
public:
	struct FloatRange                                            WrapTimeBeforeGivingUpRange;                       // 0x0(0x10)
	float                                                        ShipInternalWaterLevelToTriggerUnwrap;             // 0x10(0x4)
	char                                                         pad0x4_SUO2I[0x4];                                 // 0x14(0x4)
	struct KrakenAnchorDynamicsParams                            AnchorDynamicsParams;                              // 0x18(0x28)
	TArray<struct KrakenShipWrappingBehaviourWrapLocationWeightedParams> WrapLocations;                                     // 0x40(0x10)
	float                                                        WrapTimeBeforeGivingUp;                            // 0x50(0x4)
	char                                                         pad0xc_S1JBA[0xc];                                 // 0x54(0xc)
	struct KrakenShipWrappingBehaviourWrapLocationParams         WrapLocation;                                      // 0x60(0xe0)
};


// Size 0xe0
struct KrakenShipWrappingBehaviourWrapLocationParams
{
public:
	class UClass*                                                TentacleType;                                      // 0x0(0x8)
	struct Vector                                                WrapLocationAnchorPoint;                           // 0x8(0xc)
	char                                                         pad0xc_HRSSA[0xc];                                 // 0x14(0xc)
	struct Transform                                             TentacleHeadHoldShipLocation;                      // 0x20(0x30)
	struct KrakenShipWrappingBehaviourTentacleHeadLocations      PortTentacleHeadLocations;                         // 0x50(0x20)
	struct KrakenShipWrappingBehaviourTentacleHeadLocations      StarboardTentacleHeadLocations;                    // 0x70(0x20)
	struct KrakenDynamicsParams                                  DynamicsParams;                                    // 0x90(0x50)
};


// Size 0x20
struct KrakenShipWrappingBehaviourTentacleHeadLocations
{
public:
	TArray<struct KrakenShipWrappingBehaviourNamedTransform>     Near;                                              // 0x0(0x10)
	TArray<struct KrakenShipWrappingBehaviourNamedTransform>     Far;                                               // 0x10(0x10)
};


// Size 0x40
struct KrakenShipWrappingBehaviourNamedTransform
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	char                                                         pad0x8_W01ZG[0x8];                                 // 0x8(0x8)
	struct Transform                                             Transform;                                         // 0x10(0x30)
};


// Size 0xf0
struct KrakenShipWrappingBehaviourWrapLocationWeightedParams
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	char                                                         pad0xc_S9TTD[0xc];                                 // 0x4(0xc)
	struct KrakenShipWrappingBehaviourWrapLocationParams         Params;                                            // 0x10(0xe0)
};


// Size 0xa0
struct KrakenShipWrappingBehaviourWarningParams
{
public:
	class UClass*                                                TentacleType;                                      // 0x0(0x8)
	float                                                        TickDuration;                                      // 0x8(0x4)
	struct FloatRange                                            TentacleTimeoutRange;                              // 0xc(0x10)
	char                                                         pad0x4_OZM3N[0x4];                                 // 0x1c(0x4)
	struct WeightedProbabilityRangeOfRanges                      TentacleHealthRange;                               // 0x20(0x30)
	TArray<struct KrakenShipWrappingBehaviourNamedTransform>     TentacleLocations;                                 // 0x50(0x10)
	float                                                        TentacleTimeout;                                   // 0x60(0x4)
	float                                                        TentacleHealth;                                    // 0x64(0x4)
	char                                                         pad0x8_F4TY4[0x8];                                 // 0x68(0x8)
	struct Transform                                             TentacleLocation;                                  // 0x70(0x30)
};


// Size 0x68
struct KrakenBehaviourParams
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	char                                                         pad0x3_9YNS1[0x3];                                 // 0x1(0x3)
	struct WeightedProbabilityRangeOfRanges                      TargetTimeout;                                     // 0x8(0x30)
	class KrakenIdleBehaviourParamsDataAsset*                    IdleParams;                                        // 0x38(0x8)
	struct KrakenShipWrappingBehaviourParamsCollection           ShipWrappingParams;                                // 0x40(0x10)
	struct KrakenShipHittingBehaviourParamsCollection            ShipHittingParams;                                 // 0x50(0x10)
	class KrakenPlayerGrabbingBehaviourParamsDataAsset*          PlayerGrabbingParams;                              // 0x60(0x8)
};


// Size 0x160
struct KrakenParams
{
public:
	class UClass*                                                MurkClass;                                         // 0x0(0x8)
	class GeneratedLocationsDataAsset*                           PotentialTentacleSpawnLocations;                   // 0x8(0x8)
	struct WeightedProbabilityRange                              NumberOfTentaclesToSpawn;                          // 0x10(0x20)
	TArray<struct KrakenTentaclesChanceParams>                   TentaclesRequiredToDismissKraken;                  // 0x30(0x10)
	float                                                        TickFrequencyToLookForNewBehaviours;               // 0x40(0x4)
	float                                                        OperatingAreaRadius;                               // 0x44(0x4)
	float                                                        MinimumOperatingAreaMovementDeltaToInvalidateLocations; // 0x48(0x4)
	float                                                        RadiusToleranceBeforeOperatingAreaDespawn;         // 0x4c(0x4)
	TArray<struct KrakenTentaclesChanceParams>                   NumTentacleInstancesToAssignToShip;                // 0x50(0x10)
	float                                                        GlobalPlayRateScale;                               // 0x60(0x4)
	struct FloatRange                                            NewTargetTimeout;                                  // 0x64(0x10)
	struct FloatRange                                            UnavailableTargetTimeout;                          // 0x74(0x10)
	char                                                         pad0x4_3KOGQ[0x4];                                 // 0x84(0x4)
	struct KrakenTentacleParams                                  TentacleParams;                                    // 0x88(0x50)
	struct WeightedProbabilityRangeOfRanges                      DismissTimeoutWhenNoTargets;                       // 0xd8(0x30)
	struct WeightedProbabilityRangeOfRanges                      DismissTimeoutWithNewTarget;                       // 0x108(0x30)
	TArray<struct KrakenWeightedBehaviour>                       ShipInteractingBehaviourWeights;                   // 0x138(0x10)
	TArray<struct KrakenBehaviourParams>                         Behaviours;                                        // 0x148(0x10)
	float                                                        DamageAmountToTriggerAudioComponentNotification;   // 0x158(0x4)
	char                                                         pad0x4_VWA9A[0x4];                                 // 0x15c(0x4)
};


// Size 0x8
struct KrakenWeightedBehaviour
{
public:
	int                                                          Weight;                                            // 0x0(0x4)
	byte                                                         BehaviourType;                                     // 0x4(0x1)
	char                                                         pad0x3_1NDGX[0x3];                                 // 0x5(0x3)
};


// Size 0x50
struct KrakenTentacleParams
{
public:
	struct WeightedProbabilityRangeOfRanges                      TentacleHealth;                                    // 0x0(0x30)
	struct FloatRange                                            InactiveToActiveTentacleTimeout;                   // 0x30(0x10)
	float                                                        InactiveToActiveTentacleTimeoutThresholdInSeconds; // 0x40(0x4)
	float                                                        ChanceOfInactiveToActiveTentacle;                  // 0x44(0x4)
	float                                                        ChanceOfInactiveToActiveTentacleOnDeathOrFlee;     // 0x48(0x4)
	char                                                         pad0x4_TK872[0x4];                                 // 0x4c(0x4)
};


// Size 0x28
struct KrakenTentaclesChanceParams
{
public:
	int                                                          NumberOfTentaclesSpawned;                          // 0x0(0x4)
	char                                                         pad0x4_EB16G[0x4];                                 // 0x4(0x4)
	struct WeightedProbabilityRange                              ProbabilityRange;                                  // 0x8(0x20)
};


// Size 0x10
struct KrakenAnimatedTentacleAnimationBoneTrack
{
public:
	TArray<struct KrakenAnimatedTentacleAnimationBoneFrame>      Frames;                                            // 0x0(0x10)
};


// Size 0xc
struct KrakenAnimatedTentacleAnimationBoneFrame
{
public:
	struct Vector                                                BoneLocation;                                      // 0x0(0xc)
};


// Size 0x10
struct KrakenAnimatedTentacleMappedAnimation
{
public:
	class AnimSequence*                                          ClientAnimation;                                   // 0x0(0x8)
	class KrakenAnimatedTentacleAnimationDataAsset*              AnimationAsset;                                    // 0x8(0x8)
};


// Size 0x8
struct KrakenAnimatedTentacleAnimationSpecBone
{
public:
	struct FName                                                 BoneName;                                          // 0x0(0x8)
};


// Size 0x28
struct KrakenAnimatedTentacleStateAnimationMapping
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	class AnimSequence*                                          Animation;                                         // 0x8(0x8)
	bool                                                         Loop;                                              // 0x10(0x1)
	char                                                         pad0x7_1Q325[0x7];                                 // 0x11(0x7)
	TArray<struct KrakenAnimatedTentacleTransitionAnimation>     Transitions;                                       // 0x18(0x10)
};


// Size 0x20
struct KrakenAnimatedTentacleTransitionAnimation
{
public:
	class UClass*                                                FromState;                                         // 0x0(0x8)
	float                                                        BranchAnimationTimeRemaining;                      // 0x8(0x4)
	char                                                         pad0x4_46ZS5[0x4];                                 // 0xc(0x4)
	TArray<class AnimSequence*>                                  TransitionAnimations;                              // 0x10(0x10)
};


// Size 0x18
struct HeadStateChangeRequest
{
public:
	class UClass*                                                RequestedState;                                    // 0x0(0x8)
	struct Guid                                                  StateChangeID;                                     // 0x8(0x10)
};


// Size 0x28
struct KrakenHeadStateAnimationMapping
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	class AnimSequence*                                          Animation;                                         // 0x8(0x8)
	bool                                                         Loop;                                              // 0x10(0x1)
	char                                                         pad0x7_0DZ1C[0x7];                                 // 0x11(0x7)
	TArray<struct KrakenHeadTransitionAnimation>                 Transitions;                                       // 0x18(0x10)
};


// Size 0x10
struct KrakenHeadTransitionAnimation
{
public:
	class UClass*                                                FromState;                                         // 0x0(0x8)
	class AnimSequence*                                          TransitionAnimation;                               // 0x8(0x8)
};


// Size 0x8
struct KrakenHeadHealthPair
{
public:
	int                                                          PlayerCount;                                       // 0x0(0x4)
	float                                                        KrakenHeadHealth;                                  // 0x4(0x4)
};


// Size 0x10
struct KrakenHeadHitReactAnimations
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	char                                                         pad0x4_LC7RL[0x4];                                 // 0x4(0x4)
	class AnimSequence*                                          HitReactAnimation;                                 // 0x8(0x8)
};


// Size 0xc0
struct KrakenTentacleBehaviourParams
{
public:
	class EnvQuery*                                              InactiveSpawnQueryTemplate;                        // 0x0(0x8)
	float                                                        ChanceOfCannonSideSpawn;                           // 0x8(0x4)
	char                                                         pad0x4_5N0V2[0x4];                                 // 0xc(0x4)
	class EnvQuery*                                              ActiveCannonSideSpawnQueryTemplate;                // 0x10(0x8)
	class EnvQuery*                                              ActiveNonCannonSideSpawnQueryTemplate;             // 0x18(0x8)
	class UClass*                                                TentacleClass;                                     // 0x20(0x8)
	float                                                        MinScale;                                          // 0x28(0x4)
	float                                                        MaxScale;                                          // 0x2c(0x4)
	float                                                        MinPlayRateScale;                                  // 0x30(0x4)
	float                                                        MaxPlayRateScale;                                  // 0x34(0x4)
	float                                                        PanicDespawnShipRangeRadius;                       // 0x38(0x4)
	float                                                        PanicDespawnWatercraftRangeRadius;                 // 0x3c(0x4)
	float                                                        PanicDespawnTentacleRadius;                        // 0x40(0x4)
	float                                                        PanicDespawnAnimationPlayRateScale;                // 0x44(0x4)
	float                                                        PreDeathAnimationPlayRateScale;                    // 0x48(0x4)
	char                                                         pad0x4_5AVEB[0x4];                                 // 0x4c(0x4)
	TArray<struct KrakenTentacleBehaviourActionChances>          OnDamageActionChances;                             // 0x50(0x10)
	struct WeightedProbabilityRangeOfRanges                      TimeToSpendInInactiveState;                        // 0x60(0x30)
	struct WeightedProbabilityRangeOfRanges                      TimeToSpendInActiveState;                          // 0x90(0x30)
};


// Size 0x8
struct KrakenTentacleBehaviourActionChances
{
public:
	byte                                                         ActionToTransitionTo;                              // 0x0(0x1)
	char                                                         pad0x3_1BL17[0x3];                                 // 0x1(0x3)
	float                                                        WeightedChance;                                    // 0x4(0x4)
};


// Size 0xc0
struct KrakenIdleBehaviourParams
{
public:
	char                                                         pad0xc0_CI64M[0xc0];                               // 0x0(0xc0)
};


// Size 0xe8
struct KrakenPlayerGrabbingBehaviourParams
{
public:
	char                                                         pad0xc0_XTO0C[0xc0];                               // 0x0(0xc0)
	float                                                        MinUnsuccessfulTargetTimeout;                      // 0xc0(0x4)
	float                                                        MaxUnsuccessfulTargetTimeout;                      // 0xc4(0x4)
	TArray<struct KrakenPlayerGrabbingHoldingStateTransitionChance> HoldingTransitionChances;                          // 0xc8(0x10)
	float                                                        MinTargetHoldingTime;                              // 0xd8(0x4)
	float                                                        MaxTargetHoldingTime;                              // 0xdc(0x4)
	float                                                        TargetThrowingSpeed;                               // 0xe0(0x4)
	char                                                         pad0x4_WWORY[0x4];                                 // 0xe4(0x4)
};


// Size 0x10
struct KrakenPlayerGrabbingHoldingStateTransitionChance
{
public:
	float                                                        WeightedChance;                                    // 0x0(0x4)
	char                                                         pad0x4_BQ54M[0x4];                                 // 0x4(0x4)
	class UClass*                                                StateToTransitionTo;                               // 0x8(0x8)
};


// Size 0x38
struct KrakenServiceParams
{
public:
	class UClass*                                                KrakenType;                                        // 0x0(0x8)
	struct KrakenServiceSpawnParams                              SpawnParams;                                       // 0x8(0x18)
	class KrakenParamsDataAsset*                                 DefaultKrakenParams;                               // 0x20(0x8)
	TArray<struct KrakenServiceShipParams>                       KrakenParams;                                      // 0x28(0x10)
};


// Size 0x20
struct KrakenServiceShipParams
{
public:
	struct FName                                                 Feature;                                           // 0x0(0x8)
	TArray<class Class*>                                         ValidShipTypes;                                    // 0x8(0x10)
	class KrakenParamsDataAsset*                                 KrakenParams;                                      // 0x18(0x8)
};


// Size 0x18
struct KrakenServiceSpawnParams
{
public:
	float                                                        SpawnLocationDistributionRadius;                   // 0x0(0x4)
	float                                                        SpawnLocationDistributionMinDistanceBetweenPoints; // 0x4(0x4)
	float                                                        SpawnDistanceInFrontOfShip;                        // 0x8(0x4)
	char                                                         pad0x4_AGXAZ[0x4];                                 // 0xc(0x4)
	class EnvQuery*                                              SpawnLocationQuery;                                // 0x10(0x8)
};


// Size 0x1
struct KrakenWorldSettingsParams
{
public:
	bool                                                         KrakenEnabled;                                     // 0x0(0x1)
};


// Size 0x40
struct CoordinatedKrakenPhaseAssetEntry
{
public:
	struct Transform                                             RelativeAnimationOrigin;                           // 0x0(0x30)
	class CoordinatedKrakenPhaseActionsDataAsset*                Asset;                                             // 0x30(0x8)
	char                                                         pad0x8_5RTZ9[0x8];                                 // 0x38(0x8)
};


// Size 0x4
struct EventKrakenAnimatedTentacleTriggerHitReaction
{
public:
	int                                                          CollisionBoneIndex;                                // 0x0(0x4)
};


// Size 0x4
struct EventKrakenAnimatedTentacleTentacleDead
{
public:
	int                                                          TentacleIndex;                                     // 0x0(0x4)
};


// Size 0x4
struct EventKrakenAnimatedTentacleTakenDamage
{
public:
	int                                                          TentacleIndex;                                     // 0x0(0x4)
};


// Size 0x4
struct EventKrakenAnimatedTentacleTargetVomit
{
public:
	char                                                         pad0x4_UOSU6[0x4];                                 // 0x0(0x4)
};


// Size 0x1
struct EventKrakenAnimatedTentaclePlayerInMouthEnd
{
public:
	char                                                         pad0x1_G5EJT[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventKrakenAnimatedTentaclePlayerInMouthBegin
{
public:
	char                                                         pad0x1_AXPU4[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventKrakenAnimatedTentacleSuckingEnd
{
public:
	char                                                         pad0x1_YLEZS[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventKrakenAnimatedTentacleSuckingStart
{
public:
	char                                                         pad0x1_IT7RN[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventKrakenWrappingTentacleTellEnd
{
public:
	char                                                         pad0x1_K9W13[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventKrakenWrappingTentacleTellBegin
{
public:
	char                                                         pad0x1_HLMPT[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventKrakenAnimatedTentacleSuckingTellEnd
{
public:
	char                                                         pad0x1_MO2KR[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventKrakenAnimatedTentacleSuckingTellBegin
{
public:
	char                                                         pad0x1_9PO9T[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventKrakenAnimatedTentacleSuckingTell
{
public:
	char                                                         pad0x1_5RYDK[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventKrakenAnimatedTentacleSubmerge
{
public:
	char                                                         pad0x1_CGJ5I[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventKrakenAnimatedTentacleEmerge
{
public:
	char                                                         pad0x1_9T4NJ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventKrakenTentacleEndPlay
{
public:
	char                                                         pad0x1_6WXKE[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventKrakenAnimatedTentacleAnimationStopped
{
public:
	char                                                         pad0x1_IS0PI[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventKrakenAnimatedTentacleAnimationStarted
{
public:
	class AnimSequence*                                          Animation;                                         // 0x0(0x8)
	char                                                         pad0x8_5T7L7[0x8];                                 // 0x8(0x8)
};


// Size 0x4
struct EventKrakenAnimatedTentacleAuthoritativeAnimationTime
{
public:
	char                                                         pad0x4_2SM7V[0x4];                                 // 0x0(0x4)
};


// Size 0x18
struct EventKrakenAnimatedTentacleStateEntered
{
public:
	class UClass*                                                State;                                             // 0x0(0x8)
	class UClass*                                                PreviousState;                                     // 0x8(0x8)
	bool                                                         SkipTransitions;                                   // 0x10(0x1)
	char                                                         pad0x7_UH728[0x7];                                 // 0x11(0x7)
};


// Size 0x1
struct EventKrakenHeadHit
{
public:
	char                                                         pad0x1_4KFY1[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventCoordinatedKrakenPhaseEnded
{
public:
	char                                                         pad0x1_UJEMS[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventKrakenTentacleDestroyed
{
public:
	class Actor*                                                 KillingBlowInstigator;                             // 0x0(0x8)
};


// Size 0x1
struct EventKrakenDespawned
{
public:
	byte                                                         DespawnReason;                                     // 0x0(0x1)
};


// Size 0x18
struct EventKrakenSpawned
{
public:
	class Ship*                                                  PrimaryShipTarget;                                 // 0x0(0x8)
	struct Guid                                                  ConfigSpawnId;                                     // 0x8(0x10)
};


// Size 0x2
struct EventKrakenShipWrappingTentacleStateChanged
{
public:
	byte                                                         PreviousState;                                     // 0x0(0x1)
	byte                                                         NewState;                                          // 0x1(0x1)
};


// Size 0x1
struct EventKrakenTentaclePreUninitializeComponents
{
public:
	char                                                         pad0x1_J5CRY[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct KrakenTentacleDestroyedTelemetryEvent
{
public:
	struct FString                                               KrakenId;                                          // 0x0(0x10)
};


// Size 0x18
struct KrakenDespawnTelemetryEvent
{
public:
	struct FString                                               KrakenId;                                          // 0x0(0x10)
	byte                                                         KrakenDespawnReason;                               // 0x10(0x1)
	char                                                         pad0x7_R4XHB[0x7];                                 // 0x11(0x7)
};


// Size 0x30
struct KrakenSpawnTelemetryEvent
{
public:
	struct FString                                               KrakenId;                                          // 0x0(0x10)
	struct Vector                                                SpawnLocation;                                     // 0x10(0xc)
	struct Guid                                                  ConfigSpawnId;                                     // 0x1c(0x10)
	char                                                         pad0x4_6294O[0x4];                                 // 0x2c(0x4)
};


}