#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x98
struct LayerBlendInput
{
public:
	struct FName                                                 LayerName;                                         // 0x0(0x8)
	char                                                         BlendType;                                         // 0x8(0x1)
	char                                                         pad0x7_TDN8Q[0x7];                                 // 0x9(0x7)
	struct ExpressionInput                                       LayerInput;                                        // 0x10(0x38)
	struct ExpressionInput                                       HeightInput;                                       // 0x48(0x38)
	float                                                        PreviewWeight;                                     // 0x80(0x4)
	struct Vector                                                ConstLayerInput;                                   // 0x84(0xc)
	float                                                        ConstHeightInput;                                  // 0x90(0x4)
	char                                                         pad0x4_JFK3L[0x4];                                 // 0x94(0x4)
};


// Size 0x20
struct LandscapeWeightmapUsage
{
public:
	class LandscapeComponent*                                    ChannelUsage;                                      // 0x0(0x8)
	char                                                         pad0x18_J0M3M[0x18];                               // 0x8(0x18)
};


// Size 0x1
struct LandscapeImportLayerInfo
{
public:
	char                                                         pad0x1_0DLSV[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct LandscapeSplineConnection
{
public:
	class LandscapeSplineSegment*                                Segment;                                           // 0x0(0x8)
	bool                                                         End;                                               // 0x8(0x1)
	char                                                         pad0x7_5ITKG[0x7];                                 // 0x9(0x7)
};


// Size 0x1
struct LandscapeEditorLayerSettings
{
public:
	char                                                         pad0x1_Z3Y1I[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ForeignWorldSplineData
{
public:
	char                                                         pad0x1_2A0CU[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct ForeignControlPointData
{
public:
	char                                                         pad0x1_RRQCO[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct LandscapeInfoLayerSettings
{
public:
	class LandscapeLayerInfoObject*                              LayerInfoObj;                                      // 0x0(0x8)
	struct FName                                                 LayerName;                                         // 0x8(0x8)
};


// Size 0x30
struct GrassVariety
{
public:
	class StaticMesh*                                            GrassMesh;                                         // 0x0(0x8)
	float                                                        GrassDensity;                                      // 0x8(0x4)
	bool                                                         bUseGrid;                                          // 0xc(0x1)
	char                                                         pad0x3_FYZ16[0x3];                                 // 0xd(0x3)
	float                                                        PlacementJitter;                                   // 0x10(0x4)
	int                                                          StartCullDistance;                                 // 0x14(0x4)
	int                                                          EndCullDistance;                                   // 0x18(0x4)
	int                                                          MinLOD;                                            // 0x1c(0x4)
	bool                                                         RandomRotation;                                    // 0x20(0x1)
	char                                                         pad0x3_XRNT8[0x3];                                 // 0x21(0x3)
	float                                                        AlignToSurface;                                    // 0x24(0x4)
	float                                                        ScaleVariationMin;                                 // 0x28(0x4)
	float                                                        ScaleVariationMax;                                 // 0x2c(0x4)
};


// Size 0x50
struct GizmoSelectData
{
public:
	char                                                         pad0x50_ZPFA4[0x50];                               // 0x0(0x50)
};


// Size 0x8
struct LandscapeLayerStruct
{
public:
	class LandscapeLayerInfoObject*                              LayerInfoObj;                                      // 0x0(0x8)
};


// Size 0x1
struct ForeignSplineSegmentData
{
public:
	char                                                         pad0x1_9INFP[0x1];                                 // 0x0(0x1)
};


// Size 0x38
struct LandscapeSplineMeshEntry
{
public:
	class StaticMesh*                                            Mesh;                                              // 0x0(0x8)
	TArray<class MaterialInterface*>                             MaterialOverrides;                                 // 0x8(0x10)
	bool                                                         bCenterH;                                          // 0x18(0x1)
	char                                                         pad0x3_5UO7K[0x3];                                 // 0x19(0x3)
	struct Vector2D                                              CenterAdjust;                                      // 0x1c(0x8)
	bool                                                         bScaleToWidth;                                     // 0x24(0x1)
	char                                                         pad0x3_L6R5I[0x3];                                 // 0x25(0x3)
	struct Vector                                                Scale;                                             // 0x28(0xc)
	char                                                         Orientation;                                       // 0x34(0x1)
	char                                                         ForwardAxis;                                       // 0x35(0x1)
	char                                                         UpAxis;                                            // 0x36(0x1)
	char                                                         pad0x1_YKX06[0x1];                                 // 0x37(0x1)
};


// Size 0x18
struct LandscapeSplineSegmentConnection
{
public:
	class LandscapeSplineControlPoint*                           ControlPoint;                                      // 0x0(0x8)
	float                                                        TangentLen;                                        // 0x8(0x4)
	struct FName                                                 SocketName;                                        // 0xc(0x8)
	char                                                         pad0x4_IUPVZ[0x4];                                 // 0x14(0x4)
};


// Size 0x48
struct GrassInput
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	class LandscapeGrassType*                                    GrassType;                                         // 0x8(0x8)
	struct ExpressionInput                                       Input;                                             // 0x10(0x38)
};


// Size 0x40
struct LandscapeSplineInterpPoint
{
public:
	struct Vector                                                Center;                                            // 0x0(0xc)
	struct Vector                                                Left;                                              // 0xc(0xc)
	struct Vector                                                Right;                                             // 0x18(0xc)
	struct Vector                                                FalloffLeft;                                       // 0x24(0xc)
	struct Vector                                                FalloffRight;                                      // 0x30(0xc)
	float                                                        StartEndFalloff;                                   // 0x3c(0x4)
};


// Size 0x10
struct WeightmapLayerAllocationInfo
{
public:
	class LandscapeLayerInfoObject*                              LayerInfo;                                         // 0x0(0x8)
	char                                                         WeightmapTextureIndex;                             // 0x8(0x1)
	char                                                         WeightmapTextureChannel;                           // 0x9(0x1)
	char                                                         GrassMapChannelIndex;                              // 0xa(0x1)
	char                                                         pad0x5_KC8UR[0x5];                                 // 0xb(0x5)
};


