// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10
struct LandscapeInfoLayerSettings
{
public:
	Class LandscapeLayerInfoObject*                              LayerInfoObj;                                      // 0x0(0x8)
	struct FName                                                 LayerName;                                         // 0x8(0x8)
};


// Size 0x10
struct WeightmapLayerAllocationInfo
{
public:
	Class LandscapeLayerInfoObject*                              LayerInfo;                                         // 0x0(0x8)
	byte                                                         WeightmapTextureIndex;                             // 0x8(0x1)
	byte                                                         WeightmapTextureChannel;                           // 0x9(0x1)
	byte                                                         GrassMapChannelIndex;                              // 0xa(0x1)
};


// Size 0x50
struct GizmoSelectData
{
public:
};


// Size 0x30
struct GrassVariety
{
public:
	Class StaticMesh*                                            GrassMesh;                                         // 0x0(0x8)
	float                                                        GrassDensity;                                      // 0x8(0x4)
	bool                                                         bUseGrid;                                          // 0xc(0x1)
	char                                                         pad0x3_FMHKN[0x3];                                 // 0xd(0x3)
	float                                                        PlacementJitter;                                   // 0x10(0x4)
	int                                                          StartCullDistance;                                 // 0x14(0x4)
	int                                                          EndCullDistance;                                   // 0x18(0x4)
	int                                                          MinLOD;                                            // 0x1c(0x4)
	bool                                                         RandomRotation;                                    // 0x20(0x1)
	char                                                         pad0x3_KXYQ5[0x3];                                 // 0x21(0x3)
	float                                                        AlignToSurface;                                    // 0x24(0x4)
	float                                                        ScaleVariationMin;                                 // 0x28(0x4)
	float                                                        ScaleVariationMax;                                 // 0x2c(0x4)
};


// Size 0x1
struct LandscapeImportLayerInfo
{
public:
};


// Size 0x8
struct LandscapeLayerStruct
{
public:
	Class LandscapeLayerInfoObject*                              LayerInfoObj;                                      // 0x0(0x8)
};


// Size 0x1
struct LandscapeEditorLayerSettings
{
public:
};


// Size 0x20
struct LandscapeWeightmapUsage
{
public:
	Class LandscapeComponent*                                    ChannelUsage;                                      // 0x0(0x8)
};


// Size 0x38
struct LandscapeSplineMeshEntry
{
public:
	Class StaticMesh*                                            Mesh;                                              // 0x0(0x8)
	TArray<class MaterialInterface*>                             MaterialOverrides;                                 // 0x8(0x10)
	bool                                                         bCenterH;                                          // 0x18(0x1)
	char                                                         pad0x3_ZEE9H[0x3];                                 // 0x19(0x3)
	Struct Vector2D                                              CenterAdjust;                                      // 0x1c(0x8)
	bool                                                         bScaleToWidth;                                     // 0x24(0x1)
	char                                                         pad0x3_QAMG8[0x3];                                 // 0x25(0x3)
	Struct Vector                                                Scale;                                             // 0x28(0xc)
	byte                                                         Orientation;                                       // 0x34(0x1)
	byte                                                         ForwardAxis;                                       // 0x35(0x1)
	byte                                                         UpAxis;                                            // 0x36(0x1)
};


// Size 0x18
struct LandscapeSplineSegmentConnection
{
public:
	Class LandscapeSplineControlPoint*                           ControlPoint;                                      // 0x0(0x8)
	float                                                        TangentLen;                                        // 0x8(0x4)
	struct FName                                                 SocketName;                                        // 0xc(0x8)
};


// Size 0x40
struct LandscapeSplineInterpPoint
{
public:
	Struct Vector                                                Center;                                            // 0x0(0xc)
	Struct Vector                                                Left;                                              // 0xc(0xc)
	Struct Vector                                                Right;                                             // 0x18(0xc)
	Struct Vector                                                FalloffLeft;                                       // 0x24(0xc)
	Struct Vector                                                FalloffRight;                                      // 0x30(0xc)
	float                                                        StartEndFalloff;                                   // 0x3c(0x4)
};


// Size 0x10
struct LandscapeSplineConnection
{
public:
	Class LandscapeSplineSegment*                                Segment;                                           // 0x0(0x8)
	bool                                                         End;                                               // 0x8(0x1)
};


// Size 0x1
struct ForeignWorldSplineData
{
public:
};


// Size 0x1
struct ForeignSplineSegmentData
{
public:
};


// Size 0x1
struct ForeignControlPointData
{
public:
};


// Size 0x48
struct GrassInput
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	Class LandscapeGrassType*                                    GrassType;                                         // 0x8(0x8)
	Struct ExpressionInput                                       Input;                                             // 0x10(0x38)
};


// Size 0x98
struct LayerBlendInput
{
public:
	struct FName                                                 LayerName;                                         // 0x0(0x8)
	byte                                                         BlendType;                                         // 0x8(0x1)
	char                                                         pad0x7_JM0PO[0x7];                                 // 0x9(0x7)
	Struct ExpressionInput                                       LayerInput;                                        // 0x10(0x38)
	Struct ExpressionInput                                       HeightInput;                                       // 0x48(0x38)
	float                                                        PreviewWeight;                                     // 0x80(0x4)
	Struct Vector                                                ConstLayerInput;                                   // 0x84(0xc)
	float                                                        ConstHeightInput;                                  // 0x90(0x4)
};


}