#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x8
struct LevelSequenceSnapshotSettings
{
public:
	char                                                         ZeroPadAmount;                                     // 0x0(0x1)
	float                                                        FrameRate;                                         // 0x4(0x4)
};


// Size 0x38
struct LevelSequenceObject
{
public:
	lazyobject                                                   ObjectOrOwner;                                     // 0x0(0x1c)
	struct FString                                               ComponentName;                                     // 0x20(0x10)
	class Object*                                                CachedComponent;                                   // 0x30(0x8)
};


// Size 0x90
struct LevelSequencePlayerSnapshot
{
public:
	struct FText                                                 MasterName;                                        // 0x0(0x38)
	float                                                        MasterTime;                                        // 0x38(0x4)
	struct FText                                                 CurrentShotName;                                   // 0x40(0x38)
	float                                                        CurrentShotLocalTime;                              // 0x78(0x4)
	class CameraComponent*                                       CameraComponent;                                   // 0x80(0x8)
	struct LevelSequenceSnapshotSettings                         Settings;                                          // 0x88(0x8)
};


