// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x38
struct LevelSequenceObject
{
public:
	Struct FString                                               ComponentName;                                     // 0x20(0x10)
};


// Size 0xa0
struct LevelSequenceObjectReferenceMap
{
public:
};


// Size 0x20
struct LevelSequenceObjectReference
{
public:
};


// Size 0x90
struct LevelSequencePlayerSnapshot
{
public:
	Struct FText                                                 MasterName;                                        // 0x0(0x38)
	float                                                        MasterTime;                                        // 0x38(0x4)
	char                                                         pad0x4_0EERC[0x4];                                 // 0x3c(0x4)
	Struct FText                                                 CurrentShotName;                                   // 0x40(0x38)
	float                                                        CurrentShotLocalTime;                              // 0x78(0x4)
	char                                                         pad0x4_BP5L4[0x4];                                 // 0x7c(0x4)
	Class CameraComponent*                                       CameraComponent;                                   // 0x80(0x8)
	Struct LevelSequenceSnapshotSettings                         Settings;                                          // 0x88(0x8)
};


// Size 0x8
struct LevelSequenceSnapshotSettings
{
public:
	byte                                                         ZeroPadAmount;                                     // 0x0(0x1)
	char                                                         pad0x3_BIE69[0x3];                                 // 0x1(0x3)
	float                                                        FrameRate;                                         // 0x4(0x4)
};


// Size 0x28
struct LevelSequencePlaybackSettings
{
public:
};


// Size 0x1
struct BoundActorProxy
{
public:
};


}