#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "LiquidContainer_Structs.h"


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class LiquidContainerComponent: public ActorComponent
{
public:
	struct FName                                                 LiquidMaterialName;                                // 0xc8(0x8)
	struct FName                                                 LiquidMaterialParameterName;                       // 0xd0(0x8)
	TArray<struct LiquidTypeParams>                              LiquidTypeParams;                                  // 0xd8(0x10)
	float                                                        StartingLiquidLevelNormalised;                     // 0xe8(0x4)
	class CurveFloat*                                            TransitionCurve;                                   // 0xf0(0x8)
	float                                                        TransitionSpeedDecrease;                           // 0xf8(0x4)
	float                                                        TransitionSpeedIncrease;                           // 0xfc(0x4)
	TArray<class MaterialInstanceDynamic*>                       LiquidMaterials;                                   // 0x100(0x10)
};


