#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x54
struct LiquidTypeParams
{
public:
	char                                                         LiquidType;                                        // 0x0(0x1)
	struct                                                       FogColour;                                         // 0x4(0xc)
	struct                                                       LiquidColour;                                      // 0x10(0xc)
	struct                                                       ScumColour;                                        // 0x1c(0xc)
	float                                                        EdgeScumStart;                                     // 0x28(0x4)
	float                                                        EdgeScumEnd;                                       // 0x2c(0x4)
	float                                                        FogFadeDistance;                                   // 0x30(0x4)
	float                                                        RefractionScale;                                   // 0x34(0x4)
	float                                                        RippleFrequency;                                   // 0x38(0x4)
	float                                                        Slosh;                                             // 0x3c(0x4)
	float                                                        SurfaceThickness;                                  // 0x40(0x4)
	float                                                        Viscosity;                                         // 0x44(0x4)
	float                                                        BubbleBrightness;                                  // 0x48(0x4)
	float                                                        BillboardScale;                                    // 0x4c(0x4)
	float                                                        EmissiveScale;                                     // 0x50(0x4)
};


