// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x240 (Full Size[0x608] - InheritedSize[0x3c8]
class LostSandsRowboatGunpowderBarrel: public Actor
{
public:
	char                                                         pad0xb8_6M6UF[0xb8];                               // 0x3c8(0xb8)
	class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x480(0x8)
	class InteractableComponent*                                 InteractableComponent;                             // 0x488(0x8)
	class StaticMeshMemoryConstraintComponent*                   StaticMeshComponent;                               // 0x490(0x8)
	class FlammableWieldableComponent*                           FlammableComponent;                                // 0x498(0x8)
	class LightWeightStatusEffectManagerComponent*               StatusEffectComponent;                             // 0x4a0(0x8)
	class ItemHealthComponent*                                   ItemHealthComponent;                               // 0x4a8(0x8)
	class ExplosionComponent*                                    ExplosionComponent;                                // 0x4b0(0x8)
	class RewindComponent*                                       RewindComponent;                                   // 0x4b8(0x8)
	class UClass*                                                ToggleFuseInputId;                                 // 0x4c0(0x8)
	struct FText                                                 LightFuseDescription;                              // 0x4c8(0x38)
	struct FText                                                 ExtinguishFuseDescription;                         // 0x500(0x38)
	struct FName                                                 NamedPointsGroupName;                              // 0x538(0x8)
	TArray<Float DistanceFromNamedPoints>                        DistanceFromNamedPoints;                           // 0x560(0x10)
	struct PlayerStat                                            RowboatDestroyedAtGoldenSandsStat;                 // 0x570(0x4)
	struct PlayerStat                                            RowboatDestroyedAwayFromGoldenSandsStat;           // 0x574(0x4)
	char                                                         pad0x90_PL3KS[0x90];                               // 0x578(0x90)
};


}