// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x28
struct ClueDestinationToTextIndex
{
public:
	class                                                        DestinationType;                                   // 0x0(0x8)
};


// Size 0x10
struct ClueDestinationChoice
{
public:
	Class ClueDestinationDescriptor*                             Destination;                                       // 0x0(0x8)
};


// Size 0x70
struct GenderSpecificTextPairings
{
public:
	Struct FText                                                 MasculineClueDestinationDescription;               // 0x0(0x38)
	Struct FText                                                 FeminineClueDestinationDescription;                // 0x38(0x38)
};


// Size 0x78
struct TextEntryWithLayout
{
public:
	Struct FText                                                 TextEntry;                                         // 0x0(0x38)
	Struct TreasureMapWidgetText                                 TextLayout;                                        // 0x38(0x3c)
};


// Size 0x18
struct MapRadialIconData
{
public:
	Struct StringAssetReference                                  AssetReference;                                    // 0x0(0x10)
	float                                                        Rotation;                                          // 0x10(0x4)
};


// Size 0x40
struct ExistingNPCToPhasedNPC
{
public:
};


}