// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20
struct ClueSite
{
public:
	class UClass*                                                SiteType;                                          // 0x0(0x8)
	class ClueSiteData*                                          SiteData;                                          // 0x8(0x8)
	struct Vector                                                Location;                                          // 0x10(0xc)
	char                                                         pad0x4_ANIJI[0x4];                                 // 0x1c(0x4)
};


// Size 0x18
struct LandClueCreationChoice
{
public:
	class UClass*                                                ClueSiteType;                                      // 0x0(0x8)
	struct FName                                                 IslandIdentifier;                                  // 0x8(0x8)
	class LandClueCreator*                                       ClueCreator;                                       // 0x10(0x8)
};


// Size 0x20
struct SeaClueCreationChoice
{
public:
	class UClass*                                                SiteType;                                          // 0x0(0x8)
	class SeaClueCreator*                                        ClueCreator;                                       // 0x8(0x8)
	char                                                         pad0x10_I2X5R[0x10];                               // 0x10(0x10)
};


// Size 0x18
struct WeightedClueDestinationDescriptor
{
public:
	class UClass*                                                DestinationType;                                   // 0x0(0x8)
	TArray<Float DifficultyWeightings>                           DifficultyWeightings;                              // 0x8(0x10)
};


// Size 0x18
struct ClueSiteTypeSupportedDescribedByEntry
{
public:
	class UClass*                                                SiteType;                                          // 0x0(0x8)
	TArray<struct WeightedClueDescriptor>                        SupportedDescriptors;                              // 0x8(0x10)
};


// Size 0x18
struct WeightedClueDescriptor
{
public:
	class UClass*                                                Descriptor;                                        // 0x0(0x8)
	TArray<Float DifficultyWeightings>                           DifficultyWeightings;                              // 0x8(0x10)
};


// Size 0x10
struct RestrictedClueType
{
public:
	class UClass*                                                Type;                                              // 0x0(0x8)
	int                                                          Max;                                               // 0x8(0x4)
	char                                                         pad0x4_CLU7K[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct ClueSiteLootRestriction
{
public:
	class UClass*                                                SiteType;                                          // 0x0(0x8)
	int                                                          LootMax;                                           // 0x8(0x4)
	char                                                         pad0x4_WYECQ[0x4];                                 // 0xc(0x4)
};


// Size 0x28
struct DebrisToRangeDist
{
public:
	struct WeightedProbabilityRange                              NumberOfDebrisItemsToSpawn;                        // 0x0(0x20)
	class WeightedDebrisDataAsset*                               WeightedDebrisTypeAsset;                           // 0x20(0x8)
};


// Size 0x28
struct LootToRangeDist
{
public:
	struct WeightedProbabilityRange                              NumberOfLootItemsToSpawn;                          // 0x0(0x20)
	class WeightedTreasureChestDescAsset*                        WeightedLootDescAsset;                             // 0x20(0x8)
};


// Size 0x30
struct QuestVariableClueSiteArray
{
public:
	char                                                         pad0x30_Z2WWS[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableClueSite
{
public:
	char                                                         pad0x30_3M5VZ[0x30];                               // 0x0(0x30)
};


// Size 0x10
struct ClueSiteLootHistory
{
public:
	TArray<struct LootSpawnedAtClueSite>                         History;                                           // 0x0(0x10)
};


// Size 0x18
struct LootSpawnedAtClueSite
{
public:
	class UClass*                                                SiteType;                                          // 0x0(0x8)
	struct Vector                                                SiteLocation;                                      // 0x8(0xc)
	int                                                          NumLoot;                                           // 0x14(0x4)
};


// Size 0x30
struct QuestVariableClueDescriptor
{
public:
	char                                                         pad0x30_B6H7T[0x30];                               // 0x0(0x30)
};


// Size 0x28
struct WeightedDebris
{
public:
	char                                                         pad0x20_LJ9VX[0x20];                               // 0x0(0x20)
	float                                                        Weight;                                            // 0x20(0x4)
	char                                                         pad0x4_U4C4N[0x4];                                 // 0x24(0x4)
};


// Size 0x20
struct EventClueObtained
{
public:
	class ClueDescriptor*                                        ObtainedClue;                                      // 0x0(0x8)
	class UClass*                                                ObtainedSiteType;                                  // 0x8(0x8)
	char                                                         pad0x10_KXR5B[0x10];                               // 0x10(0x10)
};


}