#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "LostShipmentsClueVariants_Structs.h"


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AbandonedNoteClueTextAsset: public DataAsset
{
public:
	TArray<struct Text>                                          Descriptions;                                      // 0x28(0x10)
	class UClass*                                                DestinationType;                                   // 0x38(0x8)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestGetPhasedVersionOfActorFromAssetMapStep: public TaleQuestStep
{
public:
	class ExistingToPhasedNPCIndexAssetMap*                      NPCIndexAssetMap;                                  // 0x98(0x8)
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class InteractableGrammaticalGenderComponent: public ActorComponent
{
public:
	char                                                         GrammaticalGender;                                 // 0xd0(0x1)
};


// Size 0xc8 (Full Size[0x148] - InheritedSize[0x80]
class TaleQuestSpawnWashedUpSkeletonClueStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableClueSite                                 ClueSite;                                          // 0x80(0x30)
	struct QuestVariableClueDescriptor                           ClueDescriptor;                                    // 0xb0(0x30)
	struct QuestVariableActor                                    SkeletonActor;                                     // 0xe0(0x30)
	struct QuestVariableItemInfo                                 ClueItem;                                          // 0x110(0x30)
	struct FName                                                 SkeletonClueSocketName;                            // 0x140(0x8)
};


// Size 0x38 (Full Size[0x70] - InheritedSize[0x38]
class BarrelsOfPlentyClueSiteData: public ClueSiteData
{
public:
	struct Vector                                                SpawnLocation;                                     // 0x38(0xc)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AbandonedNoteClueTextIndexAssetMap: public DataAsset
{
public:
	TArray<struct ClueDestinationToTextIndex>                    TextIndexMappings;                                 // 0x28(0x10)
};


// Size 0x10 (Full Size[0x50] - InheritedSize[0x40]
class SeaLocationByGridSquareClueDestinationDescriptor: public ClueDestinationDescriptor
{
public:
	struct Vector                                                SeaLocationIdentifier;                             // 0x40(0xc)
};


// Size 0xe8 (Full Size[0x120] - InheritedSize[0x38]
class NPCHintDialogueClueSiteData: public ClueSiteData
{
public:
	struct NPCData                                               NPCData;                                           // 0x38(0xb8)
};


// Size 0xa8 (Full Size[0xe0] - InheritedSize[0x38]
class WashedUpMessageInABottleClueSiteData: public ClueSiteData
{
public:
	class UClass*                                                BottleItemType;                                    // 0x38(0x8)
	struct FName                                                 IslandNameToSpawnOn;                               // 0x40(0x8)
	struct Guid                                                  IslandSpawnLocationReservationId;                  // 0x48(0x10)
	struct Transform                                             SpawnTransform;                                    // 0x60(0x30)
	TArray<class Class*>                                         SinkIntoSandItems;                                 // 0x90(0x10)
};


// Size 0xb8 (Full Size[0xe0] - InheritedSize[0x28]
class AbandonedNoteClueTextChoiceSource: public Object
{
public:
	map                                                          ExistingDestinations;                              // 0x40(0x50)
};


// Size 0x18 (Full Size[0x160] - InheritedSize[0x148]
class ObtainClueOnWieldComponent: public OnItemWieldedComponent
{
public:
	class ClueDescriptor*                                        ClueToObtain;                                      // 0x150(0x8)
	class UClass*                                                ClueSiteType;                                      // 0x158(0x8)
};


// Size 0xa8 (Full Size[0x140] - InheritedSize[0x98]
class WaitForClueCollectedStep: public TaleQuestStep
{
public:
	class ClueDescriptor*                                        ClueDesc;                                          // 0x98(0x8)
	class Actor*                                                 ClueActor;                                         // 0xa0(0x8)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class BarrelsOfPlentySeaClueCreator: public SeaClueCreator
{
public:
	int                                                          LootItemSpawnXYDistanceFromClueIncrementMin;       // 0x30(0x4)
	int                                                          LootItemSpawnXYDistanceFromClueIncrementMax;       // 0x34(0x4)
};


// Size 0x88 (Full Size[0xc0] - InheritedSize[0x38]
class WashedUpSkeletonClueSiteData: public ClueSiteData
{
public:
	class UClass*                                                SkeletonPoseType;                                  // 0x38(0x8)
	class UClass*                                                ClueItemType;                                      // 0x40(0x8)
	struct FName                                                 IslandNameToSpawnOn;                               // 0x48(0x8)
	struct Guid                                                  IslandSpawnLocationReservationId;                  // 0x50(0x10)
	struct Transform                                             SpawnTransform;                                    // 0x60(0x30)
};


// Size 0x98 (Full Size[0x160] - InheritedSize[0xc8]
class CircleMapClueDestinationContainerComponent: public ActorComponent
{
public:
	class UClass*                                                MapMarkId;                                         // 0xd8(0x8)
	float                                                        MapMarkArea;                                       // 0xe0(0x4)
	float                                                        MapMarkScaleMin;                                   // 0xe4(0x4)
	float                                                        MapMarkScaleMax;                                   // 0xe8(0x4)
	float                                                        MapMarkNoiseModifier;                              // 0xec(0x4)
	char                                                         MapMarkBlendMode;                                  // 0xf0(0x1)
	class UClass*                                                DebugCrossId;                                      // 0xf8(0x8)
	bool                                                         ShowCluePositionOnMap;                             // 0x100(0x1)
	TArray<struct MapTextureRenderData>                          ClueRenderData;                                    // 0x108(0x10)
};


// Size 0x228 (Full Size[0x288] - InheritedSize[0x60]
class TaleQuestClueInventoryService: public TaleQuestService
{
public:
	TArray<class ClueDescriptor*>                                ObtainedClues;                                     // 0x78(0x10)
	map                                                          DiscovererMap;                                     // 0xd8(0x50)
	struct FText                                                 TitleText;                                         // 0x248(0x38)
	class AbandonedNoteClueTextChoiceSource*                     ClueTextChoiceSource;                              // 0x280(0x8)
};


// Size 0x40 (Full Size[0x830] - InheritedSize[0x7f0]
class AbandonedNoteWieldable: public SkeletalMeshWieldableItem
{
public:
	class WieldableItemCanvasRenderingComponent*                 WieldableItemCanvasRenderingComponent;             // 0x800(0x8)
	class AbandonedNoteWieldableRenderingComponent*              AbandonedNoteRenderingComponent;                   // 0x808(0x8)
	class InventoryItemComponent*                                InventoryItemComponent;                            // 0x810(0x8)
	class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x818(0x8)
	char                                                         QuestMapIcon;                                      // 0x820(0x1)
};


// Size 0x10 (Full Size[0x50] - InheritedSize[0x40]
class NPCByNameClueDestinationDescriptor: public ClueDestinationDescriptor
{
public:
	struct Guid                                                  NPCIdentifier;                                     // 0x40(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AbandonedNoteClueGenderSpecificTextIndexAsset: public AbandonedNoteClueTextIndexAssetBase
{
public:
	TArray<class AbandonedNoteClueGenderSpecificTextAsset*>      ClueDestinationDescriptions;                       // 0x28(0x10)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class AbandonedNoteClueDescriptor: public ClueDescriptor
{
public:
	class ClueDestinationDescriptor*                             DestinationDescriptor;                             // 0x28(0x8)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class TaleQuestClueInventoryServiceDesc: public TaleQuestServiceDesc
{
public:
	assetclass                                                   AbandonedNoteItem;                                 // 0x28(0x20)
	assetclass                                                   CircleMapItem;                                     // 0x48(0x20)
};


// Size 0x50 (Full Size[0x80] - InheritedSize[0x30]
class WashedUpMessageInABottleClueCreator: public LandClueCreator
{
public:
	assetclass                                                   MessageInABottleItem;                              // 0x30(0x20)
	int                                                          LootItemSpawnXYDistanceFromClueIncrementMin;       // 0x50(0x4)
	int                                                          LootItemSpawnXYDistanceFromClueIncrementMax;       // 0x54(0x4)
	int                                                          LootItemSpawnZOffset;                              // 0x58(0x4)
	float                                                        LootItemSinkIntoSandZDistanceMin;                  // 0x5c(0x4)
	float                                                        LootItemSinkIntoSandZDistanceMax;                  // 0x60(0x4)
	float                                                        LootItemSinkIntoSandRotationMin;                   // 0x64(0x4)
	float                                                        LootItemSinkIntoSandRotationMax;                   // 0x68(0x4)
	TArray<Class>                                                SinkIntoSandItems;                                 // 0x70(0x10)
};


// Size 0x98 (Full Size[0x118] - InheritedSize[0x80]
class TaleQuestGetPhasedVersionOfActorFromAssetMapStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    ExistingNPCActor;                                  // 0x80(0x30)
	struct QuestVariableActorAssetType                           ObtainedPhasedNPCActorType;                        // 0xb0(0x30)
	struct QuestVariableActor                                    PhasingSourceActor;                                // 0xe0(0x30)
	class ExistingToPhasedNPCIndexAssetMap*                      IndexAssetMap;                                     // 0x110(0x8)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class FloatingMessageInABottleSeaClueCreator: public SeaClueCreator
{
public:
	int                                                          LootItemSpawnXYDistanceFromClueIncrementMin;       // 0x30(0x4)
	int                                                          LootItemSpawnXYDistanceFromClueIncrementMax;       // 0x34(0x4)
};


// Size 0x90 (Full Size[0x110] - InheritedSize[0x80]
class WaitForClueCollectedStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableClueDescriptor                           Clue;                                              // 0x80(0x30)
	struct QuestVariableActor                                    ClueActor;                                         // 0xb0(0x30)
	struct QuestVariableActor                                    Discoverer;                                        // 0xe0(0x30)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class CircleMapClueDescriptor: public ClueDescriptor
{
public:
	class ClueDestinationDescriptor*                             DestinationDescriptor;                             // 0x28(0x8)
};


// Size 0x40 (Full Size[0x8e0] - InheritedSize[0x8a0]
class ClueSiteCircleMapWieldable: public RenderToTextureMapBase
{
public:
	assetobject                                                  InventoryRadialBackgroundTexture;                  // 0x8a0(0x20)
	struct MapRadialIconData                                     MapRadialIconData;                                 // 0x8c0(0x18)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class TaleQuestGetNPCActorFromClueSiteStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableClueSite                                 ClueSite;                                          // 0x80(0x30)
	struct QuestVariableActor                                    NPCFromClueSite;                                   // 0xb0(0x30)
};


// Size 0xf8 (Full Size[0x1c0] - InheritedSize[0xc8]
class AbandonedNoteWieldableRenderingComponent: public ActorComponent
{
public:
	int                                                          CanvasWidth;                                       // 0xc8(0x4)
	int                                                          CanvasHeight;                                      // 0xcc(0x4)
	class Font*                                                  BodyTextFont;                                      // 0xd0(0x8)
	class Font*                                                  TitleTextFont;                                     // 0xd8(0x8)
	float                                                        FontLineSpacing;                                   // 0xe0(0x4)
	float                                                        FontScale;                                         // 0xe4(0x4)
	struct TreasureMapWidgetText                                 BodyTextLayout;                                    // 0xe8(0x3c)
	struct TreasureMapWidgetText                                 TitleTextLayout;                                   // 0x124(0x3c)
	TArray<struct TextEntryWithLayout>                           ExtraTextFields;                                   // 0x160(0x10)
	interface                                                    WieldableRenderingInterface;                       // 0x170(0x10)
};


// Size 0x38 (Full Size[0x70] - InheritedSize[0x38]
class FloatingMessageInABottleClueSiteData: public ClueSiteData
{
public:
	struct Vector                                                SpawnLocation;                                     // 0x38(0xc)
};


// Size 0x10 (Full Size[0x50] - InheritedSize[0x40]
class CompositeClueDestinationDescriptor: public ClueDestinationDescriptor
{
public:
	class ClueDestinationDescriptor*                             PrimaryClueDestDescriptor;                         // 0x40(0x8)
	class ClueDestinationDescriptor*                             SecondaryClueDestDescriptor;                       // 0x48(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ExistingToPhasedNPCIndexAssetMap: public DataAsset
{
public:
	TArray<struct ExistingNPCToPhasedNPC>                        NPCIndexMappings;                                  // 0x28(0x10)
};


// Size 0x8 (Full Size[0x48] - InheritedSize[0x40]
class IslandByNameClueDestinationDescriptor: public ClueDestinationDescriptor
{
public:
	struct FName                                                 IslandIdentifier;                                  // 0x40(0x8)
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class NPCHintDialogueClueCreator: public LandClueCreator
{
public:
	class ExistingToPhasedNPCIndexAssetMap*                      NPCMappingAsset;                                   // 0x30(0x8)
	int                                                          LootItemSpawnXYDistanceFromClueIncrementMin;       // 0x38(0x4)
	int                                                          LootItemSpawnXYDistanceFromClueIncrementMax;       // 0x3c(0x4)
	int                                                          LootItemSpawnZOffset;                              // 0x40(0x4)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class TaleQuestRetrieveSpawnedMerchantCaptainFromShipwreckStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableShipwreck                                ShipwreckSpawnedOn;                                // 0x80(0x30)
	struct QuestVariableActor                                    SpawnedMerchantCaptain;                            // 0xb0(0x30)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AbandonedNoteClueTextIndexAsset: public AbandonedNoteClueTextIndexAssetBase
{
public:
	TArray<class AbandonedNoteClueTextAsset*>                    ClueDestinationDescriptions;                       // 0x28(0x10)
};


// Size 0x90 (Full Size[0x110] - InheritedSize[0x80]
class TaleQuestSpawnWashedUpMessageInABottleClueStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableClueSite                                 ClueSite;                                          // 0x80(0x30)
	struct QuestVariableClueDescriptor                           ClueDescriptor;                                    // 0xb0(0x30)
	struct QuestVariableActor                                    MessageInABottle;                                  // 0xe0(0x30)
};


// Size 0x40 (Full Size[0x70] - InheritedSize[0x30]
class WashedUpSkeletonLandClueCreator: public LandClueCreator
{
public:
	TArray<Class>                                                SkeletonPoses;                                     // 0x30(0x10)
	assetclass                                                   ClueItemDesc;                                      // 0x40(0x20)
	int                                                          LootItemSpawnXYDistanceFromClueIncrementMin;       // 0x60(0x4)
	int                                                          LootItemSpawnXYDistanceFromClueIncrementMax;       // 0x64(0x4)
	int                                                          LootItemSpawnZOffset;                              // 0x68(0x4)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AbandonedNoteClueGenderSpecificTextAsset: public DataAsset
{
public:
	TArray<struct GenderSpecificTextPairings>                    Descriptions;                                      // 0x28(0x10)
	class UClass*                                                DestinationType;                                   // 0x38(0x8)
};


// Size 0x18 (Full Size[0x58] - InheritedSize[0x40]
class LocationOnIslandClueDestinationDescriptor: public ClueDestinationDescriptor
{
public:
	struct FName                                                 IslandIdentifier;                                  // 0x40(0x8)
	struct Vector                                                WorldPosition;                                     // 0x48(0xc)
};


// Size 0x8 (Full Size[0x48] - InheritedSize[0x40]
class IslandNameForNPCContextDestinationDescriptor: public ClueDestinationDescriptor
{
public:
	struct FName                                                 IslandIdentifier;                                  // 0x40(0x8)
};


// Size 0x108 (Full Size[0x1d0] - InheritedSize[0xc8]
class AbandonedNoteClueDestinationContainerComponent: public ActorComponent
{
public:
	class AbandonedNoteClueTextIndexAssetMap*                    ClueTextIndexAssetMap;                             // 0xe8(0x8)
	struct FString                                               CompositeFormatString;                             // 0xf0(0x10)
	struct ClueDestinationChoice                                 CurrentClueDestination;                            // 0x100(0x10)
	struct FText                                                 CurrentTitleText;                                  // 0x110(0x38)
	class AbandonedNoteClueTextChoiceSource*                     ClueTextChoiceSource;                              // 0x148(0x8)
};


// Size 0x8 (Full Size[0x48] - InheritedSize[0x40]
class IslandByCompassBearingClueDestinationDescriptor: public ClueDestinationDescriptor
{
public:
	char                                                         CompassDirection;                                  // 0x40(0x1)
};


