#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x65 (Full Size[0x815] - InheritedSize[0x7b0]
class MapTable_C: public MapTable
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x7b0(0x8)
	class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x7b8(0x8)
	class BoxComponent*                                          NavBlocker;                                        // 0x7c0(0x8)
	class ChildActorComponent*                                   ControlPoint;                                      // 0x7c8(0x8)
	class ChildActorComponent*                                   ControlPoint;                                      // 0x7d0(0x8)
	class ChildActorComponent*                                   ControlPoint;                                      // 0x7d8(0x8)
	class ChildActorComponent*                                   ControlPoint;                                      // 0x7e0(0x8)
	class ChildActorComponent*                                   ControlPoint;                                      // 0x7e8(0x8)
	class ChildActorComponent*                                   ControlPoint;                                      // 0x7f0(0x8)
	class TextureFeedbackComponent*                              TextureFeedback;                                   // 0x7f8(0x8)
	class StaticMeshComponent*                                   Cube;                                              // 0x800(0x8)
	class StaticMeshComponent*                                   Map;                                               // 0x808(0x8)
	float                                                        ActiveRange;                                       // 0x810(0x4)
	bool                                                         IsActive;                                          // 0x814(0x1)
};


