// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x65 (Full Size[0x80d] - InheritedSize[0x7a8]
class MapTable_C: public MapTable
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x7a8(0x8)
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* None;                                              // 0x7b0(0x8)
	Class BoxComponent*                                          None;                                              // 0x7b8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x7c0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x7c8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x7d0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x7d8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x7e0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x7e8(0x8)
	Class TextureFeedbackComponent*                              None;                                              // 0x7f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x800(0x8)
	float                                                        None;                                              // 0x808(0x4)
	bool                                                         None;                                              // 0x80c(0x1)
};


}