#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x24
struct MercenaryBuriableActorConversionTelemetryEvent
{
public:
	struct FName                                                 MercenaryBuriableName;                             // 0x0(0x8)
	struct FName                                                 ActionSourceName;                                  // 0x8(0x8)
	struct FName                                                 IslandName;                                        // 0x10(0x8)
	struct Vector                                                Location;                                          // 0x18(0xc)
};


// Size 0x28
struct TakeItemFromAITelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	char                                                         BootyType;                                         // 0x10(0x1)
	char                                                         pad0x7_70LN7[0x7];                                 // 0x11(0x7)
	struct FString                                               BootyName;                                         // 0x18(0x10)
};


// Size 0x28
struct GiveItemToAITelemetryEvent
{
public:
	struct Guid                                                  BootyId;                                           // 0x0(0x10)
	char                                                         BootyType;                                         // 0x10(0x1)
	char                                                         pad0x7_57C87[0x7];                                 // 0x11(0x7)
	struct FString                                               BootyName;                                         // 0x18(0x10)
};


