// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x78
struct MovieScene3DTransformKeyStruct
{
public:
	char                                                         pad0x8_LAERX[0x8];                                 // 0x0(0x8)
	struct Vector                                                Location;                                          // 0x8(0xc)
	struct Rotator                                               Rotation;                                          // 0x14(0xc)
	struct Vector                                                Scale;                                             // 0x20(0xc)
	char                                                         pad0x4c_BKP07[0x4c];                               // 0x2c(0x4c)
};


// Size 0x30
struct MovieScene3DScaleKeyStruct
{
public:
	char                                                         pad0x8_SB95X[0x8];                                 // 0x0(0x8)
	struct Vector                                                Scale;                                             // 0x8(0xc)
	char                                                         pad0x1c_NNAAC[0x1c];                               // 0x14(0x1c)
};


// Size 0x30
struct MovieScene3DRotationKeyStruct
{
public:
	char                                                         pad0x8_CCOTW[0x8];                                 // 0x0(0x8)
	struct Rotator                                               Rotation;                                          // 0x8(0xc)
	char                                                         pad0x1c_4RJSO[0x1c];                               // 0x14(0x1c)
};


// Size 0x30
struct MovieScene3DLocationKeyStruct
{
public:
	char                                                         pad0x8_GG0ZF[0x8];                                 // 0x0(0x8)
	struct Vector                                                Location;                                          // 0x8(0xc)
	char                                                         pad0x1c_Y1DNB[0x1c];                               // 0x14(0x1c)
};


// Size 0x20
struct MovieSceneCameraAnimSectionData
{
public:
	class CameraAnim*                                            CameraAnim;                                        // 0x0(0x8)
	float                                                        PlayRate;                                          // 0x8(0x4)
	float                                                        PlayScale;                                         // 0xc(0x4)
	float                                                        BlendInTime;                                       // 0x10(0x4)
	float                                                        BlendOutTime;                                      // 0x14(0x4)
	bool                                                         bLooping;                                          // 0x18(0x1)
	char                                                         pad0x7_INXH0[0x7];                                 // 0x19(0x7)
};


// Size 0x20
struct MovieSceneCameraShakeSectionData
{
public:
	class UClass*                                                ShakeClass;                                        // 0x0(0x8)
	float                                                        PlayScale;                                         // 0x8(0x4)
	byte                                                         PlaySpace;                                         // 0xc(0x1)
	char                                                         pad0x3_1BNXD[0x3];                                 // 0xd(0x3)
	struct Rotator                                               UserDefinedPlaySpace;                              // 0x10(0xc)
	char                                                         pad0x4_6NB1H[0x4];                                 // 0x1c(0x4)
};


// Size 0x58
struct MovieSceneColorKeyStruct
{
public:
	char                                                         pad0x8_GQVZI[0x8];                                 // 0x0(0x8)
	struct LinearColor                                           Color;                                             // 0x8(0x10)
	char                                                         pad0x40_EZK4Z[0x40];                               // 0x18(0x40)
};


// Size 0x20
struct MovieSceneEventSectionData
{
public:
	TArray<Float KeyTimes>                                       KeyTimes;                                          // 0x0(0x10)
	TArray<struct EventPayload>                                  KeyValues;                                         // 0x10(0x10)
};


// Size 0x30
struct EventPayload
{
public:
	struct FName                                                 EventName;                                         // 0x0(0x8)
	bool                                                         IsSubtitleEvent;                                   // 0x8(0x1)
	char                                                         pad0x3_SRDP7[0x3];                                 // 0x9(0x3)
	int                                                          ActorNumber;                                       // 0xc(0x4)
	int                                                          SubtitleIndex;                                     // 0x10(0x4)
	char                                                         pad0x4_JWKW5[0x4];                                 // 0x14(0x4)
	struct MovieSceneEventParameters                             Parameters;                                        // 0x18(0x18)
};


// Size 0x18
struct MovieSceneEventParameters
{
public:
	char                                                         pad0x18_RI542[0x18];                               // 0x0(0x18)
};


// Size 0x1f0
struct ColorParameterNameAndCurves
{
public:
	struct FName                                                 ParameterName;                                     // 0x0(0x8)
	int                                                          Index;                                             // 0x8(0x4)
	char                                                         pad0x4_T46LC[0x4];                                 // 0xc(0x4)
	struct RichCurve                                             RedCurve;                                          // 0x10(0x78)
	struct RichCurve                                             GreenCurve;                                        // 0x88(0x78)
	struct RichCurve                                             BlueCurve;                                         // 0x100(0x78)
	struct RichCurve                                             AlphaCurve;                                        // 0x178(0x78)
};


// Size 0x178
struct VectorParameterNameAndCurves
{
public:
	struct FName                                                 ParameterName;                                     // 0x0(0x8)
	int                                                          Index;                                             // 0x8(0x4)
	char                                                         pad0x4_BJC52[0x4];                                 // 0xc(0x4)
	struct RichCurve                                             XCurve;                                            // 0x10(0x78)
	struct RichCurve                                             YCurve;                                            // 0x88(0x78)
	struct RichCurve                                             ZCurve;                                            // 0x100(0x78)
};


// Size 0x88
struct ScalarParameterNameAndCurve
{
public:
	struct FName                                                 ParameterName;                                     // 0x0(0x8)
	int                                                          Index;                                             // 0x8(0x4)
	char                                                         pad0x4_E4BU5[0x4];                                 // 0xc(0x4)
	struct RichCurve                                             ParameterCurve;                                    // 0x10(0x78)
};


// Size 0x98
struct MovieSceneSkeletalAnimationParams
{
public:
	class AnimSequenceBase*                                      Animation;                                         // 0x0(0x8)
	float                                                        StartOffset;                                       // 0x8(0x4)
	float                                                        EndOffset;                                         // 0xc(0x4)
	float                                                        PlayRate;                                          // 0x10(0x4)
	bool                                                         bReverse;                                          // 0x14(0x1)
	char                                                         pad0x3_TBS3J[0x3];                                 // 0x15(0x3)
	struct FName                                                 SlotName;                                          // 0x18(0x8)
	struct RichCurve                                             Weight;                                            // 0x20(0x78)
};


// Size 0x60
struct MovieSceneVector4KeyStruct
{
public:
	char                                                         pad0x50_QTMXB[0x50];                               // 0x0(0x50)
	struct Vector4                                               Vector;                                            // 0x50(0x10)
};


// Size 0x48
struct MovieSceneVectorKeyStructBase
{
public:
	char                                                         pad0x48_U2KR0[0x48];                               // 0x0(0x48)
};


// Size 0x58
struct MovieSceneVectorKeyStruct
{
public:
	char                                                         pad0x48_M5I2U[0x48];                               // 0x0(0x48)
	struct Vector                                                Vector;                                            // 0x48(0xc)
	char                                                         pad0x4_JHY86[0x4];                                 // 0x54(0x4)
};


// Size 0x50
struct MovieSceneVector2DKeyStruct
{
public:
	char                                                         pad0x48_E0351[0x48];                               // 0x0(0x48)
	struct Vector2D                                              Vector;                                            // 0x48(0x8)
};


// Size 0x50
struct MovieSceneComponentMaterialSectionTemplate
{
public:
	char                                                         pad0x48_348LF[0x48];                               // 0x0(0x48)
	int                                                          MaterialIndex;                                     // 0x48(0x4)
	char                                                         pad0x4_YGZLB[0x4];                                 // 0x4c(0x4)
};


// Size 0x48
struct MovieSceneParameterSectionTemplate
{
public:
	char                                                         pad0x18_4FUD7[0x18];                               // 0x0(0x18)
	TArray<struct ScalarParameterNameAndCurve>                   Scalars;                                           // 0x18(0x10)
	TArray<struct VectorParameterNameAndCurves>                  Vectors;                                           // 0x28(0x10)
	TArray<struct ColorParameterNameAndCurves>                   Colors;                                            // 0x38(0x10)
};


// Size 0x88
struct MovieSceneSpawnSectionTemplate
{
public:
	char                                                         pad0x18_D8XWC[0x18];                               // 0x0(0x18)
	struct IntegralCurve                                         Curve;                                             // 0x18(0x70)
};


// Size 0x38
struct MovieScene3DAttachSectionTemplate
{
public:
	char                                                         pad0x18_1N0G3[0x18];                               // 0x0(0x18)
	struct Guid                                                  AttachGuid;                                        // 0x18(0x10)
	struct FName                                                 AttachSocketName;                                  // 0x28(0x8)
	struct FName                                                 AttachComponentName;                               // 0x30(0x8)
};


// Size 0xa8
struct MovieScene3DPathSectionTemplate
{
public:
	char                                                         pad0x18_AE0IG[0x18];                               // 0x0(0x18)
	struct Guid                                                  PathGuid;                                          // 0x18(0x10)
	struct RichCurve                                             TimingCurve;                                       // 0x28(0x78)
	byte                                                         FrontAxisEnum;                                     // 0xa0(0x1)
	byte                                                         UpAxisEnum;                                        // 0xa1(0x1)
	char                                                         pad0x2_P6L6H[0x2];                                 // 0xa2(0x2)
	bool                                                         bFollow;                                           // 0xa4(0x1)
	bool                                                         bReverse;                                          // 0xa4(0x1)
	bool                                                         bForceUpright;                                     // 0xa4(0x1)
	char                                                         pad0x3_HCRL4[0x3];                                 // 0xa5(0x3)
};


// Size 0x450
struct MovieScene3DTransformSectionTemplate
{
public:
	char                                                         pad0x18_I6QZQ[0x18];                               // 0x0(0x18)
	struct RichCurve                                             TranslationCurve;                                  // 0x18(0x78)
	char                                                         pad0xf0_2A59W[0xf0];                               // 0x90(0xf0)
	struct RichCurve                                             RotationCurve;                                     // 0x180(0x78)
	char                                                         pad0xf0_DK71U[0xf0];                               // 0x1f8(0xf0)
	struct RichCurve                                             ScaleCurve;                                        // 0x2e8(0x78)
	char                                                         pad0xf0_3KRN5[0xf0];                               // 0x360(0xf0)
};


// Size 0xb8
struct MovieSceneActorReferenceSectionTemplate
{
public:
	char                                                         pad0x18_4I56A[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         ActorGuidIndexCurve;                               // 0x38(0x70)
	TArray<struct Guid>                                          ActorGuids;                                        // 0xa8(0x10)
};


// Size 0x130
struct MovieSceneAudioSectionTemplate
{
public:
	char                                                         pad0x18_TYJJO[0x18];                               // 0x0(0x18)
	struct MovieSceneAudioSectionTemplateData                    AudioData;                                         // 0x18(0x118)
};


// Size 0x118
struct MovieSceneAudioSectionTemplateData
{
public:
	class SoundBase*                                             Sound;                                             // 0x0(0x8)
	float                                                        AudioStartOffset;                                  // 0x8(0x4)
	struct FloatRange                                            AudioRange;                                        // 0xc(0x10)
	char                                                         pad0x4_B2BNU[0x4];                                 // 0x1c(0x4)
	struct RichCurve                                             AudioPitchMultiplierCurve;                         // 0x20(0x78)
	struct RichCurve                                             AudioVolumeCurve;                                  // 0x98(0x78)
	int                                                          RowIndex;                                          // 0x110(0x4)
	char                                                         pad0x4_Z7W3J[0x4];                                 // 0x114(0x4)
};


// Size 0x18
struct MovieSceneAdditiveCameraAnimationTrackTemplate
{
public:
	char                                                         pad0x18_9DYAG[0x18];                               // 0x0(0x18)
};


// Size 0x40
struct MovieSceneCameraShakeSectionTemplate
{
public:
	char                                                         pad0x18_7CIWM[0x18];                               // 0x0(0x18)
	struct MovieSceneCameraShakeSectionData                      SourceData;                                        // 0x18(0x20)
	float                                                        SectionStartTime;                                  // 0x38(0x4)
	char                                                         pad0x4_VOB3P[0x4];                                 // 0x3c(0x4)
};


// Size 0x18
struct MovieSceneAdditiveCameraAnimationTemplate
{
public:
	char                                                         pad0x18_XJJ2E[0x18];                               // 0x0(0x18)
};


// Size 0x40
struct MovieSceneCameraAnimSectionTemplate
{
public:
	char                                                         pad0x18_CGF46[0x18];                               // 0x0(0x18)
	struct MovieSceneCameraAnimSectionData                       SourceData;                                        // 0x18(0x20)
	float                                                        SectionStartTime;                                  // 0x38(0x4)
	char                                                         pad0x4_AM6WE[0x4];                                 // 0x3c(0x4)
};


// Size 0x28
struct MovieSceneCameraCutSectionTemplate
{
public:
	char                                                         pad0x18_HME3L[0x18];                               // 0x0(0x18)
	struct Guid                                                  CameraGuid;                                        // 0x18(0x10)
};


// Size 0x210
struct MovieSceneColorSectionTemplate
{
public:
	char                                                         pad0x18_2RAF7[0x18];                               // 0x0(0x18)
	struct FName                                                 PropertyName;                                      // 0x18(0x8)
	struct FString                                               PropertyPath;                                      // 0x20(0x10)
	struct RichCurve                                             Curves;                                            // 0x30(0x78)
	char                                                         pad0x168_G085I[0x168];                             // 0xa8(0x168)
};


// Size 0x40
struct MovieSceneEventSectionTemplate
{
public:
	char                                                         pad0x18_4WJSE[0x18];                               // 0x0(0x18)
	struct MovieSceneEventSectionData                            EventData;                                         // 0x18(0x20)
	bool                                                         bFireEventsWhenForwards;                           // 0x38(0x1)
	bool                                                         bFireEventsWhenBackwards;                          // 0x38(0x1)
	char                                                         pad0x7_EKTMJ[0x7];                                 // 0x39(0x7)
};


// Size 0xa8
struct MovieSceneFadeSectionTemplate
{
public:
	char                                                         pad0x18_LOC8Y[0x18];                               // 0x0(0x18)
	struct RichCurve                                             FadeCurve;                                         // 0x18(0x78)
	struct LinearColor                                           FadeColor;                                         // 0x90(0x10)
	bool                                                         bFadeAudio;                                        // 0xa0(0x1)
	char                                                         pad0x7_J9RC9[0x7];                                 // 0xa1(0x7)
};


// Size 0x18
struct MovieSceneLevelVisibilitySharedTrack
{
public:
	char                                                         pad0x18_WIBR4[0x18];                               // 0x0(0x18)
};


// Size 0x30
struct MovieSceneLevelVisibilitySectionTemplate
{
public:
	char                                                         pad0x18_9HTX9[0x18];                               // 0x0(0x18)
	byte                                                         Visibility;                                        // 0x18(0x1)
	char                                                         pad0x7_8T443[0x7];                                 // 0x19(0x7)
	TArray<struct FName>                                         LevelNames;                                        // 0x20(0x10)
};


// Size 0x48
struct MovieSceneParticleParameterSectionTemplate
{
public:
	char                                                         pad0x48_QHIV2[0x48];                               // 0x0(0x48)
};


// Size 0x88
struct MovieSceneParticleSectionTemplate
{
public:
	char                                                         pad0x18_P7ULR[0x18];                               // 0x0(0x18)
	struct IntegralCurve                                         ParticleKeys;                                      // 0x18(0x70)
};


// Size 0x220
struct MovieSceneVectorPropertySectionTemplate
{
public:
	char                                                         pad0x18_XIRC9[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct RichCurve                                             ComponentCurves;                                   // 0x38(0x78)
	char                                                         pad0x168_GDNIU[0x168];                             // 0xb0(0x168)
	int                                                          NumChannelsUsed;                                   // 0x218(0x4)
	char                                                         pad0x4_WVJRD[0x4];                                 // 0x21c(0x4)
};


// Size 0xb0
struct MovieSceneStringPropertySectionTemplate
{
public:
	char                                                         pad0x18_5A2WL[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct StringCurve                                           StringCurve;                                       // 0x38(0x78)
};


// Size 0xa8
struct MovieSceneIntegerPropertySectionTemplate
{
public:
	char                                                         pad0x18_CNVK6[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         IntegerCurve;                                      // 0x38(0x70)
};


// Size 0xa8
struct MovieSceneEnumPropertySectionTemplate
{
public:
	char                                                         pad0x18_NK43V[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         EnumCurve;                                         // 0x38(0x70)
};


// Size 0xa8
struct MovieSceneBytePropertySectionTemplate
{
public:
	char                                                         pad0x18_ZTJNV[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         ByteCurve;                                         // 0x38(0x70)
};


// Size 0xb0
struct MovieSceneFloatPropertySectionTemplate
{
public:
	char                                                         pad0x18_K0R0D[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct RichCurve                                             FloatCurve;                                        // 0x38(0x78)
};


// Size 0xa8
struct MovieSceneBoolPropertySectionTemplate
{
public:
	char                                                         pad0x18_3TACV[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         BoolCurve;                                         // 0x38(0x70)
};


// Size 0x18
struct MovieSceneSkeletalAnimationSharedTrack
{
public:
	char                                                         pad0x18_FSXHU[0x18];                               // 0x0(0x18)
};


// Size 0xc0
struct MovieSceneSkeletalAnimationSectionTemplate
{
public:
	char                                                         pad0x18_SW9VO[0x18];                               // 0x0(0x18)
	struct MovieSceneSkeletalAnimationSectionTemplateParameters  Params;                                            // 0x18(0xa0)
	byte                                                         AnimationSubtype;                                  // 0xb8(0x1)
	char                                                         pad0x7_XW8PV[0x7];                                 // 0xb9(0x7)
};


// Size 0xa0
struct MovieSceneSkeletalAnimationSectionTemplateParameters
{
public:
	char                                                         pad0x98_4ZDJ6[0x98];                               // 0x0(0x98)
	float                                                        SectionStartTime;                                  // 0x98(0x4)
	float                                                        SectionEndTime;                                    // 0x9c(0x4)
};


// Size 0x90
struct MovieSceneSlomoSectionTemplate
{
public:
	char                                                         pad0x18_HNU9Q[0x18];                               // 0x0(0x18)
	struct RichCurve                                             SlomoCurve;                                        // 0x18(0x78)
};


// Size 0xb0
struct MovieSceneVisibilitySectionTemplate
{
public:
	char                                                         pad0xa8_F4QFN[0xa8];                               // 0x0(0xa8)
	bool                                                         bTemporarilyHiddenInGame;                          // 0xa8(0x1)
	char                                                         pad0x7_BOKXD[0x7];                                 // 0xa9(0x7)
};


}