#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xb0
struct MovieSceneFloatPropertySectionTemplate
{
public:
	char                                                         pad0x18_0L7EZ[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct RichCurve                                             FloatCurve;                                        // 0x38(0x78)
};


// Size 0x20
struct MovieSceneCameraShakeSectionData
{
public:
	class UClass*                                                ShakeClass;                                        // 0x0(0x8)
	float                                                        PlayScale;                                         // 0x8(0x4)
	char                                                         PlaySpace;                                         // 0xc(0x1)
	char                                                         pad0x3_JQ4BD[0x3];                                 // 0xd(0x3)
	struct Rotator                                               UserDefinedPlaySpace;                              // 0x10(0xc)
	char                                                         pad0x4_0MGJX[0x4];                                 // 0x1c(0x4)
};


// Size 0x50
struct MovieSceneComponentMaterialSectionTemplate
{
public:
	char                                                         pad0x48_FWOD2[0x48];                               // 0x0(0x48)
	int                                                          MaterialIndex;                                     // 0x48(0x4)
	char                                                         pad0x4_AHUVX[0x4];                                 // 0x4c(0x4)
};


// Size 0x90
struct MovieSceneSlomoSectionTemplate
{
public:
	char                                                         pad0x18_DKWRE[0x18];                               // 0x0(0x18)
	struct RichCurve                                             SlomoCurve;                                        // 0x18(0x78)
};


// Size 0x18
struct MovieSceneSkeletalAnimationSharedTrack
{
public:
	char                                                         pad0x18_HI5F9[0x18];                               // 0x0(0x18)
};


// Size 0x118
struct MovieSceneAudioSectionTemplateData
{
public:
	class SoundBase*                                             Sound;                                             // 0x0(0x8)
	float                                                        AudioStartOffset;                                  // 0x8(0x4)
	struct FloatRange                                            AudioRange;                                        // 0xc(0x10)
	char                                                         pad0x4_JPRS6[0x4];                                 // 0x1c(0x4)
	struct RichCurve                                             AudioPitchMultiplierCurve;                         // 0x20(0x78)
	struct RichCurve                                             AudioVolumeCurve;                                  // 0x98(0x78)
	int                                                          RowIndex;                                          // 0x110(0x4)
	char                                                         pad0x4_NSR6Y[0x4];                                 // 0x114(0x4)
};


// Size 0x88
struct ScalarParameterNameAndCurve
{
public:
	struct FName                                                 ParameterName;                                     // 0x0(0x8)
	int                                                          Index;                                             // 0x8(0x4)
	char                                                         pad0x4_K697V[0x4];                                 // 0xc(0x4)
	struct RichCurve                                             ParameterCurve;                                    // 0x10(0x78)
};


// Size 0x30
struct MovieScene3DScaleKeyStruct
{
public:
	char                                                         pad0x8_N5P8O[0x8];                                 // 0x0(0x8)
	struct Vector                                                Scale;                                             // 0x8(0xc)
	char                                                         pad0x1c_GUDLG[0x1c];                               // 0x14(0x1c)
};


// Size 0xa8
struct MovieSceneFadeSectionTemplate
{
public:
	char                                                         pad0x18_GKQ89[0x18];                               // 0x0(0x18)
	struct RichCurve                                             FadeCurve;                                         // 0x18(0x78)
	struct LinearColor                                           FadeColor;                                         // 0x90(0x10)
	bool                                                         bFadeAudio;                                        // 0xa0(0x1)
	char                                                         pad0x7_THYGY[0x7];                                 // 0xa1(0x7)
};


// Size 0x178
struct VectorParameterNameAndCurves
{
public:
	struct FName                                                 ParameterName;                                     // 0x0(0x8)
	int                                                          Index;                                             // 0x8(0x4)
	char                                                         pad0x4_DL00A[0x4];                                 // 0xc(0x4)
	struct RichCurve                                             XCurve;                                            // 0x10(0x78)
	struct RichCurve                                             YCurve;                                            // 0x88(0x78)
	struct RichCurve                                             ZCurve;                                            // 0x100(0x78)
};


// Size 0x450
struct MovieScene3DTransformSectionTemplate
{
public:
	char                                                         pad0x18_705RL[0x18];                               // 0x0(0x18)
	struct RichCurve                                             TranslationCurve;                                  // 0x18(0x78)
	char                                                         pad0xf0_B9AD7[0xf0];                               // 0x90(0xf0)
	struct RichCurve                                             RotationCurve;                                     // 0x180(0x78)
	char                                                         pad0xf0_O3FB6[0xf0];                               // 0x1f8(0xf0)
	struct RichCurve                                             ScaleCurve;                                        // 0x2e8(0x78)
	char                                                         pad0xf0_R7CBX[0xf0];                               // 0x360(0xf0)
};


// Size 0x88
struct MovieSceneSpawnSectionTemplate
{
public:
	char                                                         pad0x18_2J606[0x18];                               // 0x0(0x18)
	struct IntegralCurve                                         Curve;                                             // 0x18(0x70)
};


// Size 0x20
struct MovieSceneCameraAnimSectionData
{
public:
	class CameraAnim*                                            CameraAnim;                                        // 0x0(0x8)
	float                                                        PlayRate;                                          // 0x8(0x4)
	float                                                        PlayScale;                                         // 0xc(0x4)
	float                                                        BlendInTime;                                       // 0x10(0x4)
	float                                                        BlendOutTime;                                      // 0x14(0x4)
	bool                                                         bLooping;                                          // 0x18(0x1)
	char                                                         pad0x7_R6S86[0x7];                                 // 0x19(0x7)
};


// Size 0x30
struct MovieSceneLevelVisibilitySectionTemplate
{
public:
	char                                                         pad0x18_9XVAX[0x18];                               // 0x0(0x18)
	char                                                         Visibility;                                        // 0x18(0x1)
	char                                                         pad0x7_FK97X[0x7];                                 // 0x19(0x7)
	TArray<struct Name>                                          LevelNames;                                        // 0x20(0x10)
};


// Size 0xa8
struct MovieSceneBytePropertySectionTemplate
{
public:
	char                                                         pad0x18_RH78H[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         ByteCurve;                                         // 0x38(0x70)
};


// Size 0x18
struct MovieSceneEventParameters
{
public:
	char                                                         pad0x18_XNX3H[0x18];                               // 0x0(0x18)
};


// Size 0x48
struct MovieSceneVectorKeyStructBase
{
public:
	char                                                         pad0x48_T6B2R[0x48];                               // 0x0(0x48)
};


// Size 0x28
struct MovieSceneCameraCutSectionTemplate
{
public:
	char                                                         pad0x18_L09BN[0x18];                               // 0x0(0x18)
	struct Guid                                                  CameraGuid;                                        // 0x18(0x10)
};


// Size 0x48
struct MovieSceneParticleParameterSectionTemplate
{
public:
	char                                                         pad0x48_QEE43[0x48];                               // 0x0(0x48)
};


// Size 0x18
struct MovieSceneAdditiveCameraAnimationTemplate
{
public:
	char                                                         pad0x18_9R3U9[0x18];                               // 0x0(0x18)
};


// Size 0x1f0
struct ColorParameterNameAndCurves
{
public:
	struct FName                                                 ParameterName;                                     // 0x0(0x8)
	int                                                          Index;                                             // 0x8(0x4)
	char                                                         pad0x4_VI0TC[0x4];                                 // 0xc(0x4)
	struct RichCurve                                             RedCurve;                                          // 0x10(0x78)
	struct RichCurve                                             GreenCurve;                                        // 0x88(0x78)
	struct RichCurve                                             BlueCurve;                                         // 0x100(0x78)
	struct RichCurve                                             AlphaCurve;                                        // 0x178(0x78)
};


// Size 0x38
struct MovieScene3DAttachSectionTemplate
{
public:
	char                                                         pad0x18_0S078[0x18];                               // 0x0(0x18)
	struct Guid                                                  AttachGuid;                                        // 0x18(0x10)
	struct FName                                                 AttachSocketName;                                  // 0x28(0x8)
	struct FName                                                 AttachComponentName;                               // 0x30(0x8)
};


// Size 0xa8
struct MovieSceneBoolPropertySectionTemplate
{
public:
	char                                                         pad0x18_WZS0V[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         BoolCurve;                                         // 0x38(0x70)
};


// Size 0x58
struct MovieSceneVectorKeyStruct
{
public:
	char                                                         pad0x48_7NZRH[0x48];                               // 0x0(0x48)
	struct Vector                                                Vector;                                            // 0x48(0xc)
	char                                                         pad0x4_HZ2CK[0x4];                                 // 0x54(0x4)
};


// Size 0x30
struct MovieScene3DRotationKeyStruct
{
public:
	char                                                         pad0x8_ILDMQ[0x8];                                 // 0x0(0x8)
	struct Rotator                                               Rotation;                                          // 0x8(0xc)
	char                                                         pad0x1c_8TC9T[0x1c];                               // 0x14(0x1c)
};


// Size 0xa0
struct MovieSceneSkeletalAnimationSectionTemplateParameters
{
public:
	char                                                         pad0x98_L116B[0x98];                               // 0x0(0x98)
	float                                                        SectionStartTime;                                  // 0x98(0x4)
	float                                                        SectionEndTime;                                    // 0x9c(0x4)
};


// Size 0x18
struct MovieSceneLevelVisibilitySharedTrack
{
public:
	char                                                         pad0x18_PYHZD[0x18];                               // 0x0(0x18)
};


// Size 0x220
struct MovieSceneVectorPropertySectionTemplate
{
public:
	char                                                         pad0x18_0V7XO[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct RichCurve                                             ComponentCurves;                                   // 0x38(0x78)
	char                                                         pad0x168_NTUKQ[0x168];                             // 0xb0(0x168)
	int                                                          NumChannelsUsed;                                   // 0x218(0x4)
	char                                                         pad0x4_MHI3R[0x4];                                 // 0x21c(0x4)
};


// Size 0xa8
struct MovieSceneEnumPropertySectionTemplate
{
public:
	char                                                         pad0x18_OJCT5[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         EnumCurve;                                         // 0x38(0x70)
};


// Size 0x18
struct MovieSceneAdditiveCameraAnimationTrackTemplate
{
public:
	char                                                         pad0x18_Q0600[0x18];                               // 0x0(0x18)
};


// Size 0x98
struct MovieSceneSkeletalAnimationParams
{
public:
	class AnimSequenceBase*                                      Animation;                                         // 0x0(0x8)
	float                                                        StartOffset;                                       // 0x8(0x4)
	float                                                        EndOffset;                                         // 0xc(0x4)
	float                                                        PlayRate;                                          // 0x10(0x4)
	bool                                                         bReverse;                                          // 0x14(0x1)
	char                                                         pad0x3_N39TC[0x3];                                 // 0x15(0x3)
	struct FName                                                 SlotName;                                          // 0x18(0x8)
	struct RichCurve                                             Weight;                                            // 0x20(0x78)
};


// Size 0xa8
struct MovieSceneIntegerPropertySectionTemplate
{
public:
	char                                                         pad0x18_ORH2N[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         IntegerCurve;                                      // 0x38(0x70)
};


// Size 0x50
struct MovieSceneVector2DKeyStruct
{
public:
	char                                                         pad0x48_06G59[0x48];                               // 0x0(0x48)
	struct Vector2D                                              Vector;                                            // 0x48(0x8)
};


// Size 0x210
struct MovieSceneColorSectionTemplate
{
public:
	char                                                         pad0x18_DJPJS[0x18];                               // 0x0(0x18)
	struct FName                                                 PropertyName;                                      // 0x18(0x8)
	struct FString                                               PropertyPath;                                      // 0x20(0x10)
	struct RichCurve                                             Curves;                                            // 0x30(0x78)
	char                                                         pad0x168_1KGQV[0x168];                             // 0xa8(0x168)
};


// Size 0x58
struct MovieSceneColorKeyStruct
{
public:
	char                                                         pad0x8_1E4JV[0x8];                                 // 0x0(0x8)
	struct LinearColor                                           Color;                                             // 0x8(0x10)
	char                                                         pad0x40_3S8ZH[0x40];                               // 0x18(0x40)
};


// Size 0xb0
struct MovieSceneStringPropertySectionTemplate
{
public:
	char                                                         pad0x18_2EUZI[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct StringCurve                                           StringCurve;                                       // 0x38(0x78)
};


// Size 0x30
struct MovieScene3DLocationKeyStruct
{
public:
	char                                                         pad0x8_9I75A[0x8];                                 // 0x0(0x8)
	struct Vector                                                Location;                                          // 0x8(0xc)
	char                                                         pad0x1c_3YKRA[0x1c];                               // 0x14(0x1c)
};


// Size 0xb8
struct MovieSceneActorReferenceSectionTemplate
{
public:
	char                                                         pad0x18_O1422[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         ActorGuidIndexCurve;                               // 0x38(0x70)
	TArray<struct Guid>                                          ActorGuids;                                        // 0xa8(0x10)
};


// Size 0x78
struct MovieScene3DTransformKeyStruct
{
public:
	char                                                         pad0x8_M90F7[0x8];                                 // 0x0(0x8)
	struct Vector                                                Location;                                          // 0x8(0xc)
	struct Rotator                                               Rotation;                                          // 0x14(0xc)
	struct Vector                                                Scale;                                             // 0x20(0xc)
	char                                                         pad0x4c_QTZW5[0x4c];                               // 0x2c(0x4c)
};


// Size 0x88
struct MovieSceneParticleSectionTemplate
{
public:
	char                                                         pad0x18_9MAPU[0x18];                               // 0x0(0x18)
	struct IntegralCurve                                         ParticleKeys;                                      // 0x18(0x70)
};


// Size 0xb0
struct MovieSceneVisibilitySectionTemplate
{
public:
	char                                                         pad0xa8_C39B7[0xa8];                               // 0x0(0xa8)
	bool                                                         bTemporarilyHiddenInGame;                          // 0xa8(0x1)
	char                                                         pad0x7_MKUWI[0x7];                                 // 0xa9(0x7)
};


// Size 0x60
struct MovieSceneVector4KeyStruct
{
public:
	char                                                         pad0x50_EU62L[0x50];                               // 0x0(0x50)
	struct Vector4                                               Vector;                                            // 0x50(0x10)
};


// Size 0xa8
struct MovieScene3DPathSectionTemplate
{
public:
	char                                                         pad0x18_1KHFJ[0x18];                               // 0x0(0x18)
	struct Guid                                                  PathGuid;                                          // 0x18(0x10)
	struct RichCurve                                             TimingCurve;                                       // 0x28(0x78)
	char                                                         FrontAxisEnum;                                     // 0xa0(0x1)
	char                                                         UpAxisEnum;                                        // 0xa1(0x1)
	char                                                         pad0x2_IAO0K[0x2];                                 // 0xa2(0x2)
	bool                                                         bFollow;                                           // 0xa4(0x1)
	bool                                                         bReverse;                                          // 0xa4(0x1)
	bool                                                         bForceUpright;                                     // 0xa4(0x1)
	char                                                         pad0x3_G7DJP[0x3];                                 // 0xa5(0x3)
};


// Size 0x130
struct MovieSceneAudioSectionTemplate
{
public:
	char                                                         pad0x18_QIS9I[0x18];                               // 0x0(0x18)
	struct MovieSceneAudioSectionTemplateData                    AudioData;                                         // 0x18(0x118)
};


// Size 0xc0
struct MovieSceneSkeletalAnimationSectionTemplate
{
public:
	char                                                         pad0x18_JFEOI[0x18];                               // 0x0(0x18)
	struct MovieSceneSkeletalAnimationSectionTemplateParameters  Params;                                            // 0x18(0xa0)
	char                                                         AnimationSubtype;                                  // 0xb8(0x1)
	char                                                         pad0x7_1EJ09[0x7];                                 // 0xb9(0x7)
};


// Size 0x30
struct EventPayload
{
public:
	struct FName                                                 EventName;                                         // 0x0(0x8)
	bool                                                         IsSubtitleEvent;                                   // 0x8(0x1)
	char                                                         pad0x3_TLBOI[0x3];                                 // 0x9(0x3)
	int                                                          ActorNumber;                                       // 0xc(0x4)
	int                                                          SubtitleIndex;                                     // 0x10(0x4)
	char                                                         pad0x4_WTQBT[0x4];                                 // 0x14(0x4)
	struct MovieSceneEventParameters                             Parameters;                                        // 0x18(0x18)
};


// Size 0x40
struct MovieSceneCameraShakeSectionTemplate
{
public:
	char                                                         pad0x18_FJPXH[0x18];                               // 0x0(0x18)
	struct MovieSceneCameraShakeSectionData                      SourceData;                                        // 0x18(0x20)
	float                                                        SectionStartTime;                                  // 0x38(0x4)
	char                                                         pad0x4_RP2RM[0x4];                                 // 0x3c(0x4)
};


// Size 0x40
struct MovieSceneCameraAnimSectionTemplate
{
public:
	char                                                         pad0x18_A21AC[0x18];                               // 0x0(0x18)
	struct MovieSceneCameraAnimSectionData                       SourceData;                                        // 0x18(0x20)
	float                                                        SectionStartTime;                                  // 0x38(0x4)
	char                                                         pad0x4_B5V74[0x4];                                 // 0x3c(0x4)
};


// Size 0x48
struct MovieSceneParameterSectionTemplate
{
public:
	char                                                         pad0x18_0L44V[0x18];                               // 0x0(0x18)
	TArray<struct ScalarParameterNameAndCurve>                   Scalars;                                           // 0x18(0x10)
	TArray<struct VectorParameterNameAndCurves>                  Vectors;                                           // 0x28(0x10)
	TArray<struct ColorParameterNameAndCurves>                   Colors;                                            // 0x38(0x10)
};


// Size 0x20
struct MovieSceneEventSectionData
{
public:
	TArray<float>                                                KeyTimes;                                          // 0x0(0x10)
	TArray<struct EventPayload>                                  KeyValues;                                         // 0x10(0x10)
};


// Size 0x40
struct MovieSceneEventSectionTemplate
{
public:
	char                                                         pad0x18_TQPD4[0x18];                               // 0x0(0x18)
	struct MovieSceneEventSectionData                            EventData;                                         // 0x18(0x20)
	bool                                                         bFireEventsWhenForwards;                           // 0x38(0x1)
	bool                                                         bFireEventsWhenBackwards;                          // 0x38(0x1)
	char                                                         pad0x7_IVEA3[0x7];                                 // 0x39(0x7)
};


