#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x20
struct MovieSceneCameraAnimSectionData
{
public:
	class CameraAnim*                                            CameraAnim;                                        // 0x0(0x8)
	float                                                        PlayRate;                                          // 0x8(0x4)
	float                                                        PlayScale;                                         // 0xc(0x4)
	float                                                        BlendInTime;                                       // 0x10(0x4)
	float                                                        BlendOutTime;                                      // 0x14(0x4)
	bool                                                         bLooping;                                          // 0x18(0x1)
	char                                                         pad0x7_9M8X5[0x7];                                 // 0x19(0x7)
};


// Size 0xb0
struct MovieSceneStringPropertySectionTemplate
{
public:
	char                                                         pad0x18_4A4ZL[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct StringCurve                                           StringCurve;                                       // 0x38(0x78)
};


// Size 0x98
struct MovieSceneSkeletalAnimationParams
{
public:
	class AnimSequenceBase*                                      Animation;                                         // 0x0(0x8)
	float                                                        StartOffset;                                       // 0x8(0x4)
	float                                                        EndOffset;                                         // 0xc(0x4)
	float                                                        PlayRate;                                          // 0x10(0x4)
	bool                                                         bReverse;                                          // 0x14(0x1)
	char                                                         pad0x3_98A7W[0x3];                                 // 0x15(0x3)
	struct FName                                                 SlotName;                                          // 0x18(0x8)
	struct RichCurve                                             Weight;                                            // 0x20(0x78)
};


// Size 0x88
struct ScalarParameterNameAndCurve
{
public:
	struct FName                                                 ParameterName;                                     // 0x0(0x8)
	int                                                          Index;                                             // 0x8(0x4)
	char                                                         pad0x4_KRZ86[0x4];                                 // 0xc(0x4)
	struct RichCurve                                             ParameterCurve;                                    // 0x10(0x78)
};


// Size 0x88
struct MovieSceneParticleSectionTemplate
{
public:
	char                                                         pad0x18_KXKC8[0x18];                               // 0x0(0x18)
	struct IntegralCurve                                         ParticleKeys;                                      // 0x18(0x70)
};


// Size 0x90
struct MovieSceneSlomoSectionTemplate
{
public:
	char                                                         pad0x18_NW4U1[0x18];                               // 0x0(0x18)
	struct RichCurve                                             SlomoCurve;                                        // 0x18(0x78)
};


// Size 0x18
struct MovieSceneAdditiveCameraAnimationTemplate
{
public:
	char                                                         pad0x18_VYH3O[0x18];                               // 0x0(0x18)
};


// Size 0x28
struct MovieSceneCameraCutSectionTemplate
{
public:
	char                                                         pad0x18_YIIEJ[0x18];                               // 0x0(0x18)
	struct Guid                                                  CameraGuid;                                        // 0x18(0x10)
};


// Size 0xa8
struct MovieSceneFadeSectionTemplate
{
public:
	char                                                         pad0x18_0VHPF[0x18];                               // 0x0(0x18)
	struct RichCurve                                             FadeCurve;                                         // 0x18(0x78)
	struct LinearColor                                           FadeColor;                                         // 0x90(0x10)
	bool                                                         bFadeAudio;                                        // 0xa0(0x1)
	char                                                         pad0x7_0MA0N[0x7];                                 // 0xa1(0x7)
};


// Size 0x38
struct MovieScene3DAttachSectionTemplate
{
public:
	char                                                         pad0x18_IX0ZU[0x18];                               // 0x0(0x18)
	struct Guid                                                  AttachGuid;                                        // 0x18(0x10)
	struct FName                                                 AttachSocketName;                                  // 0x28(0x8)
	struct FName                                                 AttachComponentName;                               // 0x30(0x8)
};


// Size 0x30
struct MovieSceneLevelVisibilitySectionTemplate
{
public:
	char                                                         pad0x18_FBTIB[0x18];                               // 0x0(0x18)
	char                                                         Visibility;                                        // 0x18(0x1)
	char                                                         pad0x7_1C2KX[0x7];                                 // 0x19(0x7)
	TArray<struct Name>                                          LevelNames;                                        // 0x20(0x10)
};


// Size 0xb8
struct MovieSceneActorReferenceSectionTemplate
{
public:
	char                                                         pad0x18_KY80I[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         ActorGuidIndexCurve;                               // 0x38(0x70)
	TArray<struct Guid>                                          ActorGuids;                                        // 0xa8(0x10)
};


// Size 0xa8
struct MovieSceneBoolPropertySectionTemplate
{
public:
	char                                                         pad0x18_2F2NA[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         BoolCurve;                                         // 0x38(0x70)
};


// Size 0xa0
struct MovieSceneSkeletalAnimationSectionTemplateParameters
{
public:
	char                                                         pad0x98_1U7XB[0x98];                               // 0x0(0x98)
	float                                                        SectionStartTime;                                  // 0x98(0x4)
	float                                                        SectionEndTime;                                    // 0x9c(0x4)
};


// Size 0x1f0
struct ColorParameterNameAndCurves
{
public:
	struct FName                                                 ParameterName;                                     // 0x0(0x8)
	int                                                          Index;                                             // 0x8(0x4)
	char                                                         pad0x4_ISB2A[0x4];                                 // 0xc(0x4)
	struct RichCurve                                             RedCurve;                                          // 0x10(0x78)
	struct RichCurve                                             GreenCurve;                                        // 0x88(0x78)
	struct RichCurve                                             BlueCurve;                                         // 0x100(0x78)
	struct RichCurve                                             AlphaCurve;                                        // 0x178(0x78)
};


// Size 0x20
struct MovieSceneCameraShakeSectionData
{
public:
	class UClass*                                                ShakeClass;                                        // 0x0(0x8)
	float                                                        PlayScale;                                         // 0x8(0x4)
	char                                                         PlaySpace;                                         // 0xc(0x1)
	char                                                         pad0x3_PQFLN[0x3];                                 // 0xd(0x3)
	struct Rotator                                               UserDefinedPlaySpace;                              // 0x10(0xc)
	char                                                         pad0x4_Y04AB[0x4];                                 // 0x1c(0x4)
};


// Size 0x18
struct MovieSceneEventParameters
{
public:
	char                                                         pad0x18_4VHU2[0x18];                               // 0x0(0x18)
};


// Size 0x88
struct MovieSceneSpawnSectionTemplate
{
public:
	char                                                         pad0x18_76OEW[0x18];                               // 0x0(0x18)
	struct IntegralCurve                                         Curve;                                             // 0x18(0x70)
};


// Size 0x220
struct MovieSceneVectorPropertySectionTemplate
{
public:
	char                                                         pad0x18_7CODA[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct RichCurve                                             ComponentCurves;                                   // 0x38(0x78)
	char                                                         pad0x168_PF4XI[0x168];                             // 0xb0(0x168)
	int                                                          NumChannelsUsed;                                   // 0x218(0x4)
	char                                                         pad0x4_OCOQ0[0x4];                                 // 0x21c(0x4)
};


// Size 0xb0
struct MovieSceneFloatPropertySectionTemplate
{
public:
	char                                                         pad0x18_Q4235[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct RichCurve                                             FloatCurve;                                        // 0x38(0x78)
};


// Size 0xa8
struct MovieSceneEnumPropertySectionTemplate
{
public:
	char                                                         pad0x18_6DH6B[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         EnumCurve;                                         // 0x38(0x70)
};


// Size 0x30
struct MovieScene3DLocationKeyStruct
{
public:
	char                                                         pad0x8_T3T8D[0x8];                                 // 0x0(0x8)
	struct Vector                                                Location;                                          // 0x8(0xc)
	char                                                         pad0x1c_XJTQK[0x1c];                               // 0x14(0x1c)
};


// Size 0xa8
struct MovieSceneIntegerPropertySectionTemplate
{
public:
	char                                                         pad0x18_TAVG8[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         IntegerCurve;                                      // 0x38(0x70)
};


// Size 0x18
struct MovieSceneLevelVisibilitySharedTrack
{
public:
	char                                                         pad0x18_2UP4O[0x18];                               // 0x0(0x18)
};


// Size 0x48
struct MovieSceneParticleParameterSectionTemplate
{
public:
	char                                                         pad0x48_NNWPN[0x48];                               // 0x0(0x48)
};


// Size 0x450
struct MovieScene3DTransformSectionTemplate
{
public:
	char                                                         pad0x18_2YVIJ[0x18];                               // 0x0(0x18)
	struct RichCurve                                             TranslationCurve;                                  // 0x18(0x78)
	char                                                         pad0xf0_9AGXH[0xf0];                               // 0x90(0xf0)
	struct RichCurve                                             RotationCurve;                                     // 0x180(0x78)
	char                                                         pad0xf0_PCH4M[0xf0];                               // 0x1f8(0xf0)
	struct RichCurve                                             ScaleCurve;                                        // 0x2e8(0x78)
	char                                                         pad0xf0_A26T6[0xf0];                               // 0x360(0xf0)
};


// Size 0x30
struct MovieScene3DRotationKeyStruct
{
public:
	char                                                         pad0x8_1TUT2[0x8];                                 // 0x0(0x8)
	struct Rotator                                               Rotation;                                          // 0x8(0xc)
	char                                                         pad0x1c_YI4B0[0x1c];                               // 0x14(0x1c)
};


// Size 0xa8
struct MovieSceneBytePropertySectionTemplate
{
public:
	char                                                         pad0x18_FXFLM[0x18];                               // 0x0(0x18)
	struct MovieScenePropertySectionData                         PropertyData;                                      // 0x18(0x20)
	struct IntegralCurve                                         ByteCurve;                                         // 0x38(0x70)
};


// Size 0x48
struct MovieSceneVectorKeyStructBase
{
public:
	char                                                         pad0x48_V41FG[0x48];                               // 0x0(0x48)
};


// Size 0x78
struct MovieScene3DTransformKeyStruct
{
public:
	char                                                         pad0x8_CPNCH[0x8];                                 // 0x0(0x8)
	struct Vector                                                Location;                                          // 0x8(0xc)
	struct Rotator                                               Rotation;                                          // 0x14(0xc)
	struct Vector                                                Scale;                                             // 0x20(0xc)
	char                                                         pad0x4c_DIZLH[0x4c];                               // 0x2c(0x4c)
};


// Size 0x60
struct MovieSceneVector4KeyStruct
{
public:
	char                                                         pad0x50_WPYTJ[0x50];                               // 0x0(0x50)
	struct Vector4                                               Vector;                                            // 0x50(0x10)
};


// Size 0x18
struct MovieSceneSkeletalAnimationSharedTrack
{
public:
	char                                                         pad0x18_IGLX0[0x18];                               // 0x0(0x18)
};


// Size 0xa8
struct MovieScene3DPathSectionTemplate
{
public:
	char                                                         pad0x18_H9FOS[0x18];                               // 0x0(0x18)
	struct Guid                                                  PathGuid;                                          // 0x18(0x10)
	struct RichCurve                                             TimingCurve;                                       // 0x28(0x78)
	char                                                         FrontAxisEnum;                                     // 0xa0(0x1)
	char                                                         UpAxisEnum;                                        // 0xa1(0x1)
	char                                                         pad0x2_7350O[0x2];                                 // 0xa2(0x2)
	bool                                                         bFollow;                                           // 0xa4(0x1)
	bool                                                         bReverse;                                          // 0xa4(0x1)
	bool                                                         bForceUpright;                                     // 0xa4(0x1)
	char                                                         pad0x3_F4TYV[0x3];                                 // 0xa5(0x3)
};


// Size 0x58
struct MovieSceneVectorKeyStruct
{
public:
	char                                                         pad0x48_PL7P9[0x48];                               // 0x0(0x48)
	struct Vector                                                Vector;                                            // 0x48(0xc)
	char                                                         pad0x4_53GJN[0x4];                                 // 0x54(0x4)
};


// Size 0x58
struct MovieSceneColorKeyStruct
{
public:
	char                                                         pad0x8_DOHB5[0x8];                                 // 0x0(0x8)
	struct LinearColor                                           Color;                                             // 0x8(0x10)
	char                                                         pad0x40_YU76B[0x40];                               // 0x18(0x40)
};


// Size 0x50
struct MovieSceneVector2DKeyStruct
{
public:
	char                                                         pad0x48_PVQ6P[0x48];                               // 0x0(0x48)
	struct Vector2D                                              Vector;                                            // 0x48(0x8)
};


// Size 0x18
struct MovieSceneAdditiveCameraAnimationTrackTemplate
{
public:
	char                                                         pad0x18_C9D0K[0x18];                               // 0x0(0x18)
};


// Size 0x50
struct MovieSceneComponentMaterialSectionTemplate
{
public:
	char                                                         pad0x48_XO5SV[0x48];                               // 0x0(0x48)
	int                                                          MaterialIndex;                                     // 0x48(0x4)
	char                                                         pad0x4_JD7C2[0x4];                                 // 0x4c(0x4)
};


// Size 0xb0
struct MovieSceneVisibilitySectionTemplate
{
public:
	char                                                         pad0xa8_VG4X9[0xa8];                               // 0x0(0xa8)
	bool                                                         bTemporarilyHiddenInGame;                          // 0xa8(0x1)
	char                                                         pad0x7_3K2JC[0x7];                                 // 0xa9(0x7)
};


// Size 0x210
struct MovieSceneColorSectionTemplate
{
public:
	char                                                         pad0x18_YSL9J[0x18];                               // 0x0(0x18)
	struct FName                                                 PropertyName;                                      // 0x18(0x8)
	struct FString                                               PropertyPath;                                      // 0x20(0x10)
	struct RichCurve                                             Curves;                                            // 0x30(0x78)
	char                                                         pad0x168_1PNAV[0x168];                             // 0xa8(0x168)
};


// Size 0x118
struct MovieSceneAudioSectionTemplateData
{
public:
	class SoundBase*                                             Sound;                                             // 0x0(0x8)
	float                                                        AudioStartOffset;                                  // 0x8(0x4)
	struct FloatRange                                            AudioRange;                                        // 0xc(0x10)
	char                                                         pad0x4_QR5QL[0x4];                                 // 0x1c(0x4)
	struct RichCurve                                             AudioPitchMultiplierCurve;                         // 0x20(0x78)
	struct RichCurve                                             AudioVolumeCurve;                                  // 0x98(0x78)
	int                                                          RowIndex;                                          // 0x110(0x4)
	char                                                         pad0x4_JT3MT[0x4];                                 // 0x114(0x4)
};


// Size 0x30
struct MovieScene3DScaleKeyStruct
{
public:
	char                                                         pad0x8_8H0M5[0x8];                                 // 0x0(0x8)
	struct Vector                                                Scale;                                             // 0x8(0xc)
	char                                                         pad0x1c_HK7SI[0x1c];                               // 0x14(0x1c)
};


// Size 0x178
struct VectorParameterNameAndCurves
{
public:
	struct FName                                                 ParameterName;                                     // 0x0(0x8)
	int                                                          Index;                                             // 0x8(0x4)
	char                                                         pad0x4_0WDE9[0x4];                                 // 0xc(0x4)
	struct RichCurve                                             XCurve;                                            // 0x10(0x78)
	struct RichCurve                                             YCurve;                                            // 0x88(0x78)
	struct RichCurve                                             ZCurve;                                            // 0x100(0x78)
};


// Size 0xc0
struct MovieSceneSkeletalAnimationSectionTemplate
{
public:
	char                                                         pad0x18_63P4N[0x18];                               // 0x0(0x18)
	struct MovieSceneSkeletalAnimationSectionTemplateParameters  Params;                                            // 0x18(0xa0)
	char                                                         AnimationSubtype;                                  // 0xb8(0x1)
	char                                                         pad0x7_I2K0A[0x7];                                 // 0xb9(0x7)
};


// Size 0x40
struct MovieSceneCameraAnimSectionTemplate
{
public:
	char                                                         pad0x18_P9SDO[0x18];                               // 0x0(0x18)
	struct MovieSceneCameraAnimSectionData                       SourceData;                                        // 0x18(0x20)
	float                                                        SectionStartTime;                                  // 0x38(0x4)
	char                                                         pad0x4_HVMJC[0x4];                                 // 0x3c(0x4)
};


// Size 0x30
struct EventPayload
{
public:
	struct FName                                                 EventName;                                         // 0x0(0x8)
	bool                                                         IsSubtitleEvent;                                   // 0x8(0x1)
	char                                                         pad0x3_GTUY5[0x3];                                 // 0x9(0x3)
	int                                                          ActorNumber;                                       // 0xc(0x4)
	int                                                          SubtitleIndex;                                     // 0x10(0x4)
	char                                                         pad0x4_EVR1N[0x4];                                 // 0x14(0x4)
	struct MovieSceneEventParameters                             Parameters;                                        // 0x18(0x18)
};


// Size 0x48
struct MovieSceneParameterSectionTemplate
{
public:
	char                                                         pad0x18_WPTY2[0x18];                               // 0x0(0x18)
	TArray<struct ScalarParameterNameAndCurve>                   Scalars;                                           // 0x18(0x10)
	TArray<struct VectorParameterNameAndCurves>                  Vectors;                                           // 0x28(0x10)
	TArray<struct ColorParameterNameAndCurves>                   Colors;                                            // 0x38(0x10)
};


// Size 0x130
struct MovieSceneAudioSectionTemplate
{
public:
	char                                                         pad0x18_WFH12[0x18];                               // 0x0(0x18)
	struct MovieSceneAudioSectionTemplateData                    AudioData;                                         // 0x18(0x118)
};


// Size 0x40
struct MovieSceneCameraShakeSectionTemplate
{
public:
	char                                                         pad0x18_SSC2T[0x18];                               // 0x0(0x18)
	struct MovieSceneCameraShakeSectionData                      SourceData;                                        // 0x18(0x20)
	float                                                        SectionStartTime;                                  // 0x38(0x4)
	char                                                         pad0x4_58DPQ[0x4];                                 // 0x3c(0x4)
};


// Size 0x20
struct MovieSceneEventSectionData
{
public:
	TArray<float>                                                KeyTimes;                                          // 0x0(0x10)
	TArray<struct EventPayload>                                  KeyValues;                                         // 0x10(0x10)
};


// Size 0x40
struct MovieSceneEventSectionTemplate
{
public:
	char                                                         pad0x18_IAN8O[0x18];                               // 0x0(0x18)
	struct MovieSceneEventSectionData                            EventData;                                         // 0x18(0x20)
	bool                                                         bFireEventsWhenForwards;                           // 0x38(0x1)
	bool                                                         bFireEventsWhenBackwards;                          // 0x38(0x1)
	char                                                         pad0x7_A7950[0x7];                                 // 0x39(0x7)
};


