#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "MovieScene_Structs.h"


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class MovieSceneSignedObject: public Object
{
public:
	struct Guid                                                  Signature;                                         // 0x28(0x10)
	char                                                         pad0x48_HRMNR[0x48];                               // 0x38(0x48)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class MovieSceneFolder: public Object
{
public:
	struct FName                                                 FolderName;                                        // 0x28(0x8)
	TArray<class MovieSceneFolder*>                              ChildFolders;                                      // 0x30(0x10)
	TArray<class MovieSceneTrack*>                               ChildMasterTracks;                                 // 0x40(0x10)
	TArray<String>                                               ChildObjectBindingStrings;                         // 0x50(0x10)
	char                                                         pad0x10_NA51Q[0x10];                               // 0x60(0x10)
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class MovieSceneBindingOverrides: public Object
{
public:
	char                                                         pad0x8_9D3N5[0x8];                                 // 0x28(0x8)
	TArray<struct MovieSceneBindingOverrideData>                 BindingData;                                       // 0x30(0x10)
	char                                                         pad0x58_P1S1W[0x58];                               // 0x40(0x58)
};


// Size 0x5e0 (Full Size[0x608] - InheritedSize[0x28]
class MovieSceneSequencePlayer: public Object
{
public:
	char                                                         pad0x398_SF7M2[0x398];                             // 0x28(0x398)
	bool                                                         bIsPlaying;                                        // 0x3c0(0x1)
	bool                                                         bReversePlayback;                                  // 0x3c0(0x1)
	bool                                                         bPendingFirstUpdate;                               // 0x3c0(0x1)
	char                                                         pad0x7_KHC3P[0x7];                                 // 0x3c1(0x7)
	class MovieSceneSequence*                                    Sequence;                                          // 0x3c8(0x8)
	float                                                        TimeCursorPosition;                                // 0x3d0(0x4)
	float                                                        StartTime;                                         // 0x3d4(0x4)
	float                                                        EndTime;                                           // 0x3d8(0x4)
	int                                                          CurrentNumLoops;                                   // 0x3dc(0x4)
	char                                                         pad0x10_O8IVC[0x10];                               // 0x3e0(0x10)
	struct MovieSceneSequencePlaybackSettings                    PlaybackSettings;                                  // 0x3f0(0x28)
	char                                                         pad0x1d0_UZS2L[0x1d0];                             // 0x418(0x1d0)
	class Character*                                             InteractingCharacter;                              // 0x5e8(0x8)
	char                                                         pad0x18_44FD4[0x18];                               // 0x5f0(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MovieSceneCameraDockingInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MovieSceneBindingOverridesInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MovieSceneBindingOwnerInterface: public Interface
{
public:
};


// Size 0x80 (Full Size[0x100] - InheritedSize[0x80]
class MovieScene: public MovieSceneSignedObject
{
public:
	TArray<struct MovieSceneSpawnable>                           Spawnables;                                        // 0x80(0x10)
	TArray<struct MovieScenePossessable>                         Possessables;                                      // 0x90(0x10)
	TArray<struct MovieSceneBinding>                             ObjectBindings;                                    // 0xa0(0x10)
	TArray<class MovieSceneTrack*>                               MasterTracks;                                      // 0xb0(0x10)
	class MovieSceneTrack*                                       CameraCutTrack;                                    // 0xc0(0x8)
	struct FloatRange                                            SelectionRange;                                    // 0xc8(0x10)
	struct FloatRange                                            PlaybackRange;                                     // 0xd8(0x10)
	bool                                                         bForceFixedFrameIntervalPlayback;                  // 0xe8(0x1)
	char                                                         pad0x3_LD53C[0x3];                                 // 0xe9(0x3)
	float                                                        FixedFrameInterval;                                // 0xec(0x4)
	float                                                        InTime;                                            // 0xf0(0x4)
	float                                                        OutTime;                                           // 0xf4(0x4)
	float                                                        StartTime;                                         // 0xf8(0x4)
	float                                                        EndTime;                                           // 0xfc(0x4)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class MovieSceneTrack: public MovieSceneSignedObject
{
public:
	struct MovieSceneTrackEvalOptions                            EvalOptions;                                       // 0x80(0x4)
	char                                                         pad0x4_JHCVN[0x4];                                 // 0x84(0x4)
};


// Size 0x18 (Full Size[0x98] - InheritedSize[0x80]
class MovieSceneSection: public MovieSceneSignedObject
{
public:
	struct MovieSceneSectionEvalOptions                          EvalOptions;                                       // 0x80(0x2)
	char                                                         pad0x2_5TV5G[0x2];                                 // 0x82(0x2)
	float                                                        StartTime;                                         // 0x84(0x4)
	float                                                        EndTime;                                           // 0x88(0x4)
	int                                                          RowIndex;                                          // 0x8c(0x4)
	int                                                          OverlapPriority;                                   // 0x90(0x4)
	bool                                                         bIsActive;                                         // 0x94(0x1)
	bool                                                         bIsLocked;                                         // 0x94(0x1)
	bool                                                         bIsInfinite;                                       // 0x94(0x1)
	char                                                         pad0x3_7BHFM[0x3];                                 // 0x95(0x3)
};


// Size 0x228 (Full Size[0x2a8] - InheritedSize[0x80]
class MovieSceneSequence: public MovieSceneSignedObject
{
public:
	struct CachedMovieSceneEvaluationTemplate                    EvaluationTemplate;                                // 0x80(0x220)
	struct MovieSceneTrackCompilationParams                      TemplateParameters;                                // 0x2a0(0x1)
	bool                                                         bParentContextsAreSignificant;                     // 0x2a1(0x1)
	char                                                         pad0x6_CNUFA[0x6];                                 // 0x2a2(0x6)
};


// Size 0x0 (Full Size[0x88] - InheritedSize[0x88]
class MovieSceneNameableTrack: public MovieSceneTrack
{
public:
};


