// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class MovieScene3DConstraintSection: public MovieSceneSection
{
public:
	Struct Guid                                                  ConstraintId;                                      // 0x98(0x10)
};


// Size 0x18 (Full Size[0xc0] - InheritedSize[0xa8]
class MovieScene3DAttachSection: public MovieScene3DConstraintSection
{
public:
	struct FName                                                 AttachSocketName;                                  // 0xa8(0x8)
	struct FName                                                 AttachComponentName;                               // 0xb0(0x8)
	bool                                                         bConstrainTx;                                      // 0xb8(0x1)
	bool                                                         bConstrainTy;                                      // 0xb8(0x1)
	bool                                                         bConstrainTz;                                      // 0xb8(0x1)
	bool                                                         bConstrainRx;                                      // 0xb8(0x1)
	bool                                                         bConstrainRy;                                      // 0xb8(0x1)
	bool                                                         bConstrainRz;                                      // 0xb8(0x1)
	char                                                         pad0x9_6UQ90[0x9];                                 // 0xb7(0x9)
};


// Size 0x80 (Full Size[0x128] - InheritedSize[0xa8]
class MovieScene3DPathSection: public MovieScene3DConstraintSection
{
public:
	Struct RichCurve                                             TimingCurve;                                       // 0xa8(0x78)
	byte                                                         FrontAxisEnum;                                     // 0x120(0x1)
	byte                                                         UpAxisEnum;                                        // 0x121(0x1)
	char                                                         pad0x2_4MWLP[0x2];                                 // 0x122(0x2)
	bool                                                         bFollow;                                           // 0x124(0x1)
	bool                                                         bReverse;                                          // 0x124(0x1)
	bool                                                         bForceUpright;                                     // 0x124(0x1)
	char                                                         pad0x5_1W9RV[0x5];                                 // 0x123(0x5)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class MovieScene3DConstraintTrack: public MovieSceneTrack
{
public:
	TArray<class MovieSceneSection*>                             ConstraintSections;                                // 0x88(0x10)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class MovieScene3DAttachTrack: public MovieScene3DConstraintTrack
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class MovieScene3DPathTrack: public MovieScene3DConstraintTrack
{
public:
};


// Size 0x440 (Full Size[0x4d8] - InheritedSize[0x98]
class MovieScene3DTransformSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_IJHHM[0x8];                                 // 0x98(0x8)
	Struct RichCurve                                             Translation;                                       // 0xa0(0x78)
	char                                                         pad0xf0_8ELCB[0xf0];                               // 0x118(0xf0)
	Struct RichCurve                                             Rotation;                                          // 0x208(0x78)
	char                                                         pad0xf0_1AA53[0xf0];                               // 0x280(0xf0)
	Struct RichCurve                                             Scale;                                             // 0x370(0x78)
	char                                                         pad0x1e0_MQM9N[0x1e0];                             // 0x3e6(0x1e0)
};


// Size 0x98 (Full Size[0x130] - InheritedSize[0x98]
class MovieSceneActorReferenceSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_7JZAZ[0x8];                                 // 0x98(0x8)
	Struct IntegralCurve                                         ActorGuidIndexCurve;                               // 0xa0(0x70)
	char                                                         pad0x10_L4RW8[0x10];                               // 0x110(0x10)
	TArray<Str ActorGuidStrings>                                 ActorGuidStrings;                                  // 0x120(0x10)
};


// Size 0x110 (Full Size[0x1a8] - InheritedSize[0x98]
class MovieSceneAudioSection: public MovieSceneSection
{
public:
	Class SoundBase*                                             Sound;                                             // 0x98(0x8)
	float                                                        StartOffset;                                       // 0xa0(0x4)
	float                                                        AudioStartTime;                                    // 0xa4(0x4)
	float                                                        AudioDilationFactor;                               // 0xa8(0x4)
	float                                                        AudioVolume;                                       // 0xac(0x4)
	Struct RichCurve                                             SoundVolume;                                       // 0xb0(0x78)
	Struct RichCurve                                             PitchMultiplier;                                   // 0x128(0x78)
	bool                                                         bSuppressSubtitles;                                // 0x1a0(0x1)
	char                                                         pad0x9_CAUCT[0x9];                                 // 0x19f(0x9)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class MovieSceneAudioTrack: public MovieSceneNameableTrack
{
public:
	TArray<class MovieSceneSection*>                             AudioSections;                                     // 0x88(0x10)
};


// Size 0x80 (Full Size[0x118] - InheritedSize[0x98]
class MovieSceneBoolSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_NH73M[0x8];                                 // 0x98(0x8)
	bool                                                         DefaultValue;                                      // 0xa0(0x1)
	char                                                         pad0x7_N6SAR[0x7];                                 // 0xa1(0x7)
	Struct IntegralCurve                                         BoolCurve;                                         // 0xa8(0x70)
};


// Size 0x0 (Full Size[0x118] - InheritedSize[0x118]
class MovieSceneSpawnSection: public MovieSceneBoolSection
{
public:
};


// Size 0x78 (Full Size[0x110] - InheritedSize[0x98]
class MovieSceneByteSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_85A9B[0x8];                                 // 0x98(0x8)
	Struct IntegralCurve                                         ByteCurve;                                         // 0xa0(0x70)
};


// Size 0x40 (Full Size[0xd8] - InheritedSize[0x98]
class MovieSceneCameraAnimSection: public MovieSceneSection
{
public:
	Struct MovieSceneCameraAnimSectionData                       AnimData;                                          // 0x98(0x20)
	Class CameraAnim*                                            CameraAnim;                                        // 0xb8(0x8)
	float                                                        PlayRate;                                          // 0xc0(0x4)
	float                                                        PlayScale;                                         // 0xc4(0x4)
	float                                                        BlendInTime;                                       // 0xc8(0x4)
	float                                                        BlendOutTime;                                      // 0xcc(0x4)
	bool                                                         bLooping;                                          // 0xd0(0x1)
	char                                                         pad0x9_9PHVT[0x9];                                 // 0xcf(0x9)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class MovieSceneCameraAnimTrack: public MovieSceneNameableTrack
{
public:
	TArray<class MovieSceneSection*>                             CameraAnimSections;                                // 0x88(0x10)
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class MovieSceneCameraCutSection: public MovieSceneSection
{
public:
	Struct Guid                                                  CameraGuid;                                        // 0x98(0x10)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class MovieSceneCameraCutTrack: public MovieSceneNameableTrack
{
public:
	TArray<class MovieSceneSection*>                             Sections;                                          // 0x88(0x10)
};


// Size 0x40 (Full Size[0xd8] - InheritedSize[0x98]
class MovieSceneCameraShakeSection: public MovieSceneSection
{
public:
	Struct MovieSceneCameraShakeSectionData                      ShakeData;                                         // 0x98(0x20)
	class                                                        ShakeClass;                                        // 0xb8(0x8)
	float                                                        PlayScale;                                         // 0xc0(0x4)
	byte                                                         PlaySpace;                                         // 0xc4(0x1)
	char                                                         pad0x3_DK1DS[0x3];                                 // 0xc5(0x3)
	Struct Rotator                                               UserDefinedPlaySpace;                              // 0xc8(0xc)
	char                                                         pad0x1c_KP4J7[0x1c];                               // 0xd2(0x1c)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class MovieSceneCameraShakeTrack: public MovieSceneNameableTrack
{
public:
	TArray<class MovieSceneSection*>                             CameraShakeSections;                               // 0x88(0x10)
};


// Size 0x1e8 (Full Size[0x280] - InheritedSize[0x98]
class MovieSceneColorSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_3Y1W5[0x8];                                 // 0x98(0x8)
	Struct RichCurve                                             RedCurve;                                          // 0xa0(0x78)
	Struct RichCurve                                             GreenCurve;                                        // 0x118(0x78)
	Struct RichCurve                                             BlueCurve;                                         // 0x190(0x78)
	Struct RichCurve                                             AlphaCurve;                                        // 0x208(0x78)
};


// Size 0x78 (Full Size[0x110] - InheritedSize[0x98]
class MovieSceneEnumSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_N3WS4[0x8];                                 // 0x98(0x8)
	Struct IntegralCurve                                         EnumCurve;                                         // 0xa0(0x70)
};


// Size 0x110 (Full Size[0x1a8] - InheritedSize[0x98]
class MovieSceneEventSection: public MovieSceneSection
{
public:
	Struct NameCurve                                             Events;                                            // 0x98(0x68)
	Struct MovieSceneEventSectionData                            EventData;                                         // 0x100(0x20)
	char                                                         pad0xc8_3UT0M[0xc8];                               // 0x11e(0xc8)
};


// Size 0x20 (Full Size[0xa8] - InheritedSize[0x88]
class MovieSceneSpawnTrack: public MovieSceneTrack
{
public:
	TArray<class MovieSceneSection*>                             Sections;                                          // 0x88(0x10)
	Struct Guid                                                  ObjectGuid;                                        // 0x98(0x10)
};


// Size 0x18 (Full Size[0xa0] - InheritedSize[0x88]
class MovieSceneEventTrack: public MovieSceneNameableTrack
{
public:
	bool                                                         bFireEventsWhenForwards;                           // 0x88(0x1)
	bool                                                         bFireEventsWhenBackwards;                          // 0x88(0x1)
	char                                                         pad0x7_0Y37F[0x7];                                 // 0x89(0x7)
	TArray<class MovieSceneSection*>                             Sections;                                          // 0x90(0x10)
};


// Size 0x80 (Full Size[0x118] - InheritedSize[0x98]
class MovieSceneFloatSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_6QTIL[0x8];                                 // 0x98(0x8)
	Struct RichCurve                                             FloatCurve;                                        // 0xa0(0x78)
};


// Size 0x18 (Full Size[0x130] - InheritedSize[0x118]
class MovieSceneFadeSection: public MovieSceneFloatSection
{
public:
	Struct LinearColor                                           FadeColor;                                         // 0x118(0x10)
	bool                                                         bFadeAudio;                                        // 0x128(0x1)
	char                                                         pad0x9_YIQTP[0x9];                                 // 0x127(0x9)
};


// Size 0x0 (Full Size[0x118] - InheritedSize[0x118]
class MovieSceneSlomoSection: public MovieSceneFloatSection
{
public:
};


// Size 0x78 (Full Size[0x110] - InheritedSize[0x98]
class MovieSceneIntegerSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_9JKW2[0x8];                                 // 0x98(0x8)
	Struct IntegralCurve                                         IntegerCurve;                                      // 0xa0(0x70)
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class MovieSceneLevelVisibilitySection: public MovieSceneSection
{
public:
	byte                                                         Visibility;                                        // 0x98(0x1)
	char                                                         pad0x7_TYL39[0x7];                                 // 0x99(0x7)
	TArray<struct FName>                                         LevelNames;                                        // 0xa0(0x10)
};


// Size 0x28 (Full Size[0xb0] - InheritedSize[0x88]
class MovieScenePropertyTrack: public MovieSceneNameableTrack
{
public:
	struct FName                                                 PropertyName;                                      // 0x88(0x8)
	Struct FString                                               PropertyPath;                                      // 0x90(0x10)
	TArray<class MovieSceneSection*>                             Sections;                                          // 0xa0(0x10)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class MovieSceneLevelVisibilityTrack: public MovieSceneNameableTrack
{
public:
	TArray<class MovieSceneSection*>                             Sections;                                          // 0x88(0x10)
};


// Size 0x30 (Full Size[0xc8] - InheritedSize[0x98]
class MovieSceneParameterSection: public MovieSceneSection
{
public:
	TArray<struct ScalarParameterNamesAndCurves>                 ScalarParameterNamesAndCurves;                     // 0x98(0x10)
	TArray<struct VectorParameterNamesAndCurves>                 VectorParameterNamesAndCurves;                     // 0xa8(0x10)
	TArray<struct ColorParameterNamesAndCurves>                  ColorParameterNamesAndCurves;                      // 0xb8(0x10)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class MovieSceneMaterialTrack: public MovieSceneNameableTrack
{
public:
	TArray<class MovieSceneSection*>                             Sections;                                          // 0x88(0x10)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class MovieSceneComponentMaterialTrack: public MovieSceneMaterialTrack
{
public:
	int                                                          MaterialIndex;                                     // 0x98(0x4)
	char                                                         pad0xc_9NHQW[0xc];                                 // 0x9a(0xc)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class MovieSceneParticleParameterTrack: public MovieSceneNameableTrack
{
public:
	TArray<class MovieSceneSection*>                             Sections;                                          // 0x88(0x10)
};


// Size 0x70 (Full Size[0x108] - InheritedSize[0x98]
class MovieSceneParticleSection: public MovieSceneSection
{
public:
	Struct IntegralCurve                                         ParticleKeys;                                      // 0x98(0x70)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class MovieSceneParticleTrack: public MovieSceneNameableTrack
{
public:
	TArray<class MovieSceneSection*>                             ParticleSections;                                  // 0x88(0x10)
};


// Size 0x0 (Full Size[0xb0] - InheritedSize[0xb0]
class MovieScene3DTransformTrack: public MovieScenePropertyTrack
{
public:
};


// Size 0x0 (Full Size[0xb0] - InheritedSize[0xb0]
class MovieSceneActorReferenceTrack: public MovieScenePropertyTrack
{
public:
};


// Size 0x0 (Full Size[0xb0] - InheritedSize[0xb0]
class MovieSceneBoolTrack: public MovieScenePropertyTrack
{
public:
};


// Size 0x0 (Full Size[0xb0] - InheritedSize[0xb0]
class MovieSceneVisibilityTrack: public MovieSceneBoolTrack
{
public:
};


// Size 0x8 (Full Size[0xb8] - InheritedSize[0xb0]
class MovieSceneByteTrack: public MovieScenePropertyTrack
{
public:
	Class Enum*                                                  Enum;                                              // 0xb0(0x8)
};


// Size 0x8 (Full Size[0xb8] - InheritedSize[0xb0]
class MovieSceneColorTrack: public MovieScenePropertyTrack
{
public:
	bool                                                         bIsSlateColor;                                     // 0xb0(0x1)
	char                                                         pad0x9_23SLH[0x9];                                 // 0xaf(0x9)
};


// Size 0x8 (Full Size[0xb8] - InheritedSize[0xb0]
class MovieSceneEnumTrack: public MovieScenePropertyTrack
{
public:
	Class Enum*                                                  Enum;                                              // 0xb0(0x8)
};


// Size 0x0 (Full Size[0xb0] - InheritedSize[0xb0]
class MovieSceneFloatTrack: public MovieScenePropertyTrack
{
public:
};


// Size 0x0 (Full Size[0xb0] - InheritedSize[0xb0]
class MovieSceneFadeTrack: public MovieSceneFloatTrack
{
public:
};


// Size 0x0 (Full Size[0xb0] - InheritedSize[0xb0]
class MovieSceneSlomoTrack: public MovieSceneFloatTrack
{
public:
};


// Size 0x0 (Full Size[0xb0] - InheritedSize[0xb0]
class MovieSceneIntegerTrack: public MovieScenePropertyTrack
{
public:
};


// Size 0x0 (Full Size[0xb0] - InheritedSize[0xb0]
class MovieSceneStringTrack: public MovieScenePropertyTrack
{
public:
};


// Size 0x8 (Full Size[0xb8] - InheritedSize[0xb0]
class MovieSceneVectorTrack: public MovieScenePropertyTrack
{
public:
	int                                                          NumChannelsUsed;                                   // 0xb0(0x4)
	char                                                         pad0xc_10JM2[0xc];                                 // 0xb2(0xc)
};


// Size 0xc0 (Full Size[0x158] - InheritedSize[0x98]
class MovieSceneSkeletalAnimationSection: public MovieSceneSection
{
public:
	Struct MovieSceneSkeletalAnimationParams                     Params;                                            // 0x98(0x98)
	Class AnimSequence*                                          AnimSequence;                                      // 0x130(0x8)
	Class AnimSequenceBase*                                      Animation;                                         // 0x138(0x8)
	float                                                        StartOffset;                                       // 0x140(0x4)
	float                                                        EndOffset;                                         // 0x144(0x4)
	float                                                        PlayRate;                                          // 0x148(0x4)
	bool                                                         bReverse;                                          // 0x14c(0x1)
	char                                                         pad0x3_27WGP[0x3];                                 // 0x14d(0x3)
	struct FName                                                 SlotName;                                          // 0x150(0x8)
};


// Size 0x18 (Full Size[0xa0] - InheritedSize[0x88]
class MovieSceneSkeletalAnimationTrack: public MovieSceneNameableTrack
{
public:
	byte                                                         TrackSubtype;                                      // 0x88(0x1)
	char                                                         pad0x7_3C888[0x7];                                 // 0x89(0x7)
	TArray<class MovieSceneSection*>                             AnimationSections;                                 // 0x90(0x10)
};


// Size 0x80 (Full Size[0x118] - InheritedSize[0x98]
class MovieSceneStringSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_Y6B6O[0x8];                                 // 0x98(0x8)
	Struct StringCurve                                           StringCurve;                                       // 0xa0(0x78)
};


// Size 0x68 (Full Size[0x100] - InheritedSize[0x98]
class MovieSceneSubSection: public MovieSceneSection
{
public:
	Struct MovieSceneSectionParameters                           Parameters;                                        // 0x98(0x10)
	float                                                        StartOffset;                                       // 0xa8(0x4)
	float                                                        TimeScale;                                         // 0xac(0x4)
	float                                                        PrerollTime;                                       // 0xb0(0x4)
	char                                                         pad0x4_HRB7M[0x4];                                 // 0xb4(0x4)
	Class MovieSceneSequence*                                    SubSequence;                                       // 0xb8(0x8)
	Struct FString                                               TargetSequenceName;                                // 0xe0(0x10)
	Struct DirectoryPath                                         TargetPathToRecordTo;                              // 0xf0(0x10)
};


// Size 0x38 (Full Size[0x138] - InheritedSize[0x100]
class MovieSceneCinematicShotSection: public MovieSceneSubSection
{
public:
	Struct FText                                                 DisplayName;                                       // 0x100(0x38)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class MovieSceneSubTrack: public MovieSceneNameableTrack
{
public:
	TArray<class MovieSceneSection*>                             Sections;                                          // 0x88(0x10)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class MovieSceneCinematicShotTrack: public MovieSceneSubTrack
{
public:
};


// Size 0x1f0 (Full Size[0x288] - InheritedSize[0x98]
class MovieSceneVectorSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_3FI4Y[0x8];                                 // 0x98(0x8)
	Struct RichCurve                                             Curves;                                            // 0xa0(0x78)
	char                                                         pad0x168_V387Z[0x168];                             // 0x118(0x168)
	int                                                          ChannelsUsed;                                      // 0x280(0x4)
	char                                                         pad0xc_GBIRY[0xc];                                 // 0x282(0xc)
};


}