#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x30
struct SubModeSessionCrewData
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	TArray<String>                                               UserIds;                                           // 0x10(0x10)
	int                                                          Ranking;                                           // 0x20(0x4)
	bool                                                         IsParticipating;                                   // 0x24(0x1)
	char                                                         pad0x3_V2YB8[0x3];                                 // 0x25(0x3)
	int                                                          SkillRating;                                       // 0x28(0x4)
	char                                                         pad0x4_AHMA7[0x4];                                 // 0x2c(0x4)
};


// Size 0x18
struct SubModeSessionData
{
public:
	TArray<struct SubModeSessionCrewData>                        CrewsInEvent;                                      // 0x0(0x10)
	int                                                          CrewCount;                                         // 0x10(0x4)
	char                                                         Status;                                            // 0x14(0x1)
	char                                                         pad0x3_ZYMNP[0x3];                                 // 0x15(0x3)
};


