#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "MultiCrewSubModes_Structs.h"


// Size 0x1a8 (Full Size[0x548] - InheritedSize[0x3a0]
class MultiCrewSubModesService: public Actor
{
public:
	char                                                         pad0x50_XS62W[0x50];                               // 0x3a0(0x50)
	struct SubModeSessionData                                    ActiveSessionData;                                 // 0x3f0(0x18)
	char                                                         pad0x140_QMF1P[0x140];                             // 0x408(0x140)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class MultiCrewSubModesServiceParamsDataAsset: public DataAsset
{
public:
	int                                                          MaxCrews;                                          // 0x28(0x4)
	int                                                          MinCrews;                                          // 0x2c(0x4)
	float                                                        WaitToStartTime;                                   // 0x30(0x4)
	char                                                         pad0x4_GM97H[0x4];                                 // 0x34(0x4)
	TArray<struct Transform>                                     SpawnLocations;                                    // 0x38(0x10)
};


// Size 0x50 (Full Size[0x6d0] - InheritedSize[0x680]
class MultiCrewSubModesArrivalTunnel: public ClientDestinationPreLoadingArrivalTunnelOfTheDamned
{
public:
	char                                                         pad0x50_BO2XF[0x50];                               // 0x680(0x50)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MultiCrewSubModesServiceInterface: public Interface
{
public:
};


