// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0
class MusicZoneInterface: public Interface
{
public:
};


// Size 0xc0
class MusicZoneComponent: public SceneComponent
{
public:
	float                                                        InnerRadius;                                       // 0x2e8(0x4)
	float                                                        OuterRadius;                                       // 0x2ec(0x4)
	struct FName                                                 LocationRTPC;                                      // 0x2f0(0x8)
	bool                                                         LocalRTPC;                                         // 0x2f8(0x1)
	Class WwiseEvent*                                            PlayEvent;                                         // 0x300(0x8)
	Class WwiseEvent*                                            StopEvent;                                         // 0x308(0x8)
	TArray<class WwiseEvent*>                                    OneShotEvents;                                     // 0x310(0x10)
	Class WwiseObjectPoolWrapper*                                EmitterPool;                                       // 0x320(0x8)
	bool                                                         DisableAfterPlayThrough;                           // 0x328(0x1)
	bool                                                         ActivateOnBeginPlay;                               // 0x329(0x1)
};


// Size 0x30
class AISpawnerMusicZoneComponent: public MusicZoneComponent
{
public:
	Class WwiseEvent*                                            BattleWonEvent;                                    // 0x3a0(0x8)
	Class AISpawner*                                             AISpawner;                                         // 0x3a8(0x8)
	TArray<class Pawn*>                                          SpawnerPawns;                                      // 0x3b0(0x10)
	byte                                                         SpawnerState;                                      // 0x3c0(0x1)
};


// Size 0x30
class SynchedMusicZoneComponent: public MusicZoneComponent
{
public:
	float                                                        StartDelayTime;                                    // 0x3a0(0x4)
	int                                                          PlayFromStartTimeMS;                               // 0x3a4(0x4)
};


// Size 0x0
class MusicZoneServiceInterface: public Interface
{
public:
};


// Size 0xa8
class MusicZoneService: public Actor
{
public:
};


}