#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Music_Structs.h"


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class NetMusicZoneActor: public Actor
{
public:
	class MusicZoneComponent*                                    MusicZone;                                         // 0x3c8(0x8)
};


// Size 0xf0 (Full Size[0x3d0] - InheritedSize[0x2e0]
class MusicZoneComponent: public SceneComponent
{
public:
	float                                                        InnerRadius;                                       // 0x2e8(0x4)
	float                                                        OuterRadius;                                       // 0x2ec(0x4)
	struct FName                                                 LocationRTPC;                                      // 0x2f0(0x8)
	struct FName                                                 PlaybackPositionRTPC;                              // 0x2f8(0x8)
	bool                                                         LocalRTPC;                                         // 0x300(0x1)
	class WwiseEvent*                                            PlayEvent;                                         // 0x308(0x8)
	class WwiseEvent*                                            StopEvent;                                         // 0x310(0x8)
	TArray<class WwiseEvent*>                                    OneShotEvents;                                     // 0x318(0x10)
	class WwiseObjectPoolWrapper*                                EmitterPool;                                       // 0x328(0x8)
	bool                                                         DisableAfterPlayThrough;                           // 0x330(0x1)
	bool                                                         ActivateOnBeginPlay;                               // 0x331(0x1)
	multicastinlinedelegate                                      OnMusicZoneStarted;                                // 0x338(0x10)
	struct MusicZoneRemoteValues                                 EmitterRemoteValues;                               // 0x370(0x20)
};


// Size 0x30 (Full Size[0x400] - InheritedSize[0x3d0]
class SynchedMusicZoneComponent: public MusicZoneComponent
{
public:
	float                                                        StartDelayTime;                                    // 0x3c8(0x4)
	int                                                          PlayFromStartTimeMS;                               // 0x3cc(0x4)
};


// Size 0x20 (Full Size[0x3f0] - InheritedSize[0x3d0]
class AISpawnerMusicZoneComponent: public MusicZoneComponent
{
public:
	class WwiseEvent*                                            BattleWonEvent;                                    // 0x3c8(0x8)
	class AISpawner*                                             AISpawner;                                         // 0x3d0(0x8)
	TArray<class Pawn*>                                          SpawnerPawns;                                      // 0x3d8(0x10)
	char                                                         SpawnerState;                                      // 0x3e8(0x1)
};


