// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x8
struct MysteriousNotesCompletionEventsModel
{
public:
	struct FName                                                 CompletionIdent;                                   // 0x0(0x8)
};


// Size 0x8
struct MysteriousNotesCompletionEventsModelEntry
{
public:
	struct FName                                                 CompletionIdent;                                   // 0x0(0x8)
};


// Size 0x1
struct EventListenForCinematicEndEvent
{
public:
	char                                                         pad0x1_KQYL5[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventTriggerMysteriousNotesPopup
{
public:
	class PlayerController*                                      PlayerController;                                  // 0x0(0x8)
	bool                                                         CinematicSkipped;                                  // 0x8(0x1)
	char                                                         pad0x7_II7X6[0x7];                                 // 0x9(0x7)
};


// Size 0x18
struct EventMarkNoteDeleted
{
public:
	class PlayerController*                                      PlayerController;                                  // 0x0(0x8)
	struct Guid                                                  NoteId;                                            // 0x8(0x10)
};


// Size 0x10
struct EventNoteClientCompletionStep
{
public:
	class PlayerController*                                      PlayerController;                                  // 0x0(0x8)
	struct FName                                                 CompletionStepID;                                  // 0x8(0x8)
};


// Size 0x10
struct EventNoteCompletionStep
{
public:
	class PlayerController*                                      PlayerController;                                  // 0x0(0x8)
	struct FName                                                 CompletionStepID;                                  // 0x8(0x8)
};


// Size 0x1
struct EventNotesUpdated
{
public:
	char                                                         pad0x1_LK0CX[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct EventMarkNoteRead
{
public:
	class PlayerController*                                      PlayerController;                                  // 0x0(0x8)
	struct Guid                                                  NoteId;                                            // 0x8(0x10)
};


// Size 0x8
struct EventOnlineAthenaPlayerControllerUnpossessed
{
public:
	class PlayerController*                                      PlayerController;                                  // 0x0(0x8)
};


// Size 0x10
struct EventMysteriousNoteContentUpdated
{
public:
	char                                                         pad0x10_M6HON[0x10];                               // 0x0(0x10)
};


// Size 0x1
struct EventMysteriousNoteSettingsLoaded
{
public:
	char                                                         pad0x1_S3IBV[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventMysteriousNoteCustomContentUpdate
{
public:
	char                                                         pad0x1_OZI7W[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct EventMysteriousNoteRemoved
{
public:
	char                                                         pad0x10_JCACZ[0x10];                               // 0x0(0x10)
};


// Size 0x14
struct MysteriousNoteInfo
{
public:
	struct Guid                                                  NoteId;                                            // 0x0(0x10)
	bool                                                         NoteRead;                                          // 0x10(0x1)
	bool                                                         ShowNoteAnimation;                                 // 0x11(0x1)
	char                                                         pad0x2_J9TAX[0x2];                                 // 0x12(0x2)
};


// Size 0x10
struct MysteriousNoteTheme
{
public:
	struct FString                                               NoteType;                                          // 0x0(0x10)
};


// Size 0xe0
struct WieldableMysteriousNoteLayoutItem
{
public:
	struct FString                                               Theme;                                             // 0x0(0x10)
	class Font*                                                  Font;                                              // 0x10(0x8)
	struct TreasureMapWidgetStreamedTexture                      Image;                                             // 0x18(0x38)
	struct StringAssetReference                                  RadialIcon;                                        // 0x50(0x10)
	struct TreasureMapWidgetText                                 NoteTitleWidgetText;                               // 0x60(0x3c)
	struct TreasureMapWidgetText                                 NoteBodyWidgetText;                                // 0x9c(0x3c)
	float                                                        NoteWidth;                                         // 0xd8(0x4)
	float                                                        NoteLineSpacingMultiplier;                         // 0xdc(0x4)
};


// Size 0x30
struct ActiveNoteData
{
public:
	TArray<struct NotesRemoteServiceNoteModel>                   NotesRemoteServiceNoteModels;                      // 0x0(0x10)
	TArray<struct NoteCompletionEntry>                           PendingCompletionEntries;                          // 0x10(0x10)
	TArray<struct Guid>                                          PendingDetailRequestIDs;                           // 0x20(0x10)
};


// Size 0x20
struct NoteCompletionEntry
{
public:
	struct Guid                                                  NoteId;                                            // 0x0(0x10)
	TArray<Str CompletionEventIds>                               CompletionEventIds;                                // 0x10(0x10)
};


// Size 0x80
struct MysteriousNoteRequest
{
public:
	class PlayerController*                                      PlayerController;                                  // 0x0(0x8)
	struct PirateIdentity                                        PirateIdentity;                                    // 0x8(0x78)
};


// Size 0x48
struct PlayerMysteriousNoteItem
{
public:
	struct Guid                                                  OriginalNoteID;                                    // 0x0(0x10)
	struct FString                                               LocalisedTitle;                                    // 0x10(0x10)
	struct FString                                               LocalisedBody;                                     // 0x20(0x10)
	struct FString                                               NoteType;                                          // 0x30(0x10)
	char                                                         pad0x8_Y9NN0[0x8];                                 // 0x40(0x8)
};


// Size 0x18
struct ClientNoteData
{
public:
	bool                                                         NotifyArrival;                                     // 0x0(0x1)
	char                                                         pad0x7_4CFU2[0x7];                                 // 0x1(0x7)
	TArray<struct MysteriousNoteInfo>                            PendingNotes;                                      // 0x8(0x10)
};


// Size 0x4
struct PlayerSentNotesTelemetryEvent
{
public:
	int                                                          NoteCount;                                         // 0x0(0x4)
};


// Size 0x20
struct PlayerNoteStateChangeTelemetryEvent
{
public:
	struct Guid                                                  NoteId;                                            // 0x0(0x10)
	struct FString                                               NoteState;                                         // 0x10(0x10)
};


}