// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class AbandonedNoteWeightedTextDataAsset: public DataAsset
{
public:
	TArray<struct Entries>                                       Entries;                                           // 0x28(0x10)
};


// Size 0xe0 (Full Size[0x1a8] - InheritedSize[0xc8]
class AbandonedNoteWeightedTextSourceComponent: public ActorComponent
{
public:
	char                                                         pad0x40_CV16G[0x40];                               // 0xc8(0x40)
	Struct FText                                                 ClueText;                                          // 0x108(0x38)
	Struct FText                                                 TitleText;                                         // 0x140(0x38)
	char                                                         pad0x30_HTYB3[0x30];                               // 0x178(0x30)
};


// Size 0x80 (Full Size[0x4e8] - InheritedSize[0x468]
class OneShotRewardableObjectBase: public InteractableObject
{
public:
	Class InteractableComponent*                                 InteractableComponent;                             // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x470(0x8)
	Struct RewardId                                              Reward;                                            // 0x478(0x8)
	class                                                        RewardEntitlement;                                 // 0x480(0x8)
	float                                                        InteractionHoldTime;                               // 0x488(0x4)
	float                                                        InteractionRadius;                                 // 0x48c(0x4)
	Struct FText                                                 DisplayName;                                       // 0x490(0x38)
	char                                                         pad0x20_D131K[0x20];                               // 0x4c8(0x20)
};


// Size 0x20 (Full Size[0x168] - InheritedSize[0x148]
class PopUpNotificationOnItemWieldedComponent: public OnItemWieldedComponent
{
public:
	Class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x148(0x8)
	char                                                         pad0x18_85AXN[0x18];                               // 0x150(0x18)
};


// Size 0xf0 (Full Size[0x4b8] - InheritedSize[0x3c8]
class SirenPuzzleContext: public Actor
{
public:
	char                                                         pad0x8_M671U[0x8];                                 // 0x3c8(0x8)
	Class SceneComponent*                                        Root;                                              // 0x3d0(0x8)
	TArray<struct PuzzleLocks>                                   PuzzleLocks;                                       // 0x3d8(0x10)
	TArray<struct UnlockCompleteReactions>                       UnlockCompleteReactions;                           // 0x3e8(0x10)
	TArray<struct ResetLocksReactions>                           ResetLocksReactions;                               // 0x3f8(0x10)
	TArray<Byte LockStates>                                      LockStates;                                        // 0x408(0x10)
	char                                                         pad0xa0_COEA1[0xa0];                               // 0x418(0xa0)
};


}