// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class AshenLordAshCloudSetupDataAsset: public DataAsset
{
public:
	Struct WeightedProbabilityRangeOfRanges                      AshCloudRadiusInMetres;                            // 0x28(0x30)
	float                                                        AshCloudHeightCoefficient;                         // 0x58(0x4)
	char                                                         pad0x4_FHHY4[0x4];                                 // 0x5c(0x4)
	Struct WeightedProbabilityRangeOfRanges                      AshCloudLifetime;                                  // 0x60(0x30)
	Class CurveFloat*                                            ScaleUpSpeedCurve;                                 // 0x90(0x8)
	Class CurveFloat*                                            DissipationCurve;                                  // 0x98(0x8)
};


// Size 0x88 (Full Size[0x450] - InheritedSize[0x3c8]
class AshenLordAshCloud: public Actor
{
public:
	Class StaticMeshComponent*                                   CloudMesh;                                         // 0x3c8(0x8)
	Class AshenLordAshCloudSetupDataAsset*                       SetupData;                                         // 0x3d0(0x8)
	float                                                        InnerRangeStartOffset;                             // 0x3d8(0x4)
	float                                                        OuterRangeStart;                                   // 0x3dc(0x4)
	struct FName                                                 NormalisedEngulfedRTPC;                            // 0x3e0(0x8)
	float                                                        RTPCSecondsBetweenUpdates;                         // 0x3e8(0x4)
	char                                                         pad0x4_0ALXB[0x4];                                 // 0x3ec(0x4)
	float                                                        LifeTime;                                          // 0x3f0(0x4)
	float                                                        StartTime;                                         // 0x3f4(0x4)
	float                                                        TimeOffset;                                        // 0x3f8(0x4)
	byte                                                         CloudState;                                        // 0x3fc(0x1)
	char                                                         pad0x37_XHZLW[0x37];                               // 0x3fd(0x37)
	float                                                        MaxRadiusMultiplier;                               // 0x434(0x4)
	char                                                         pad0x18_8A0XK[0x18];                               // 0x438(0x18)
};


// Size 0x70 (Full Size[0x438] - InheritedSize[0x3c8]
class AshenLordVolcano: public Actor
{
public:
	Class AshenLordVolcanoSetupDataAsset*                        VolcanoSetupData;                                  // 0x3c8(0x8)
	char                                                         pad0x68_Y34IJ[0x68];                               // 0x3d0(0x68)
};


// Size 0x420 (Full Size[0x448] - InheritedSize[0x28]
class VolcanoSetupDataAsset: public DataAsset
{
public:
	bool                                                         IsEnabled;                                         // 0x28(0x1)
	char                                                         pad0x7_5QREA[0x7];                                 // 0x29(0x7)
	Struct WeightedProbabilityRangeOfRanges                      WarmUpDuration;                                    // 0x30(0x30)
	Struct WeightedProbabilityRangeOfRanges                      EruptionDuration;                                  // 0x60(0x30)
	Struct WeightedProbabilityRangeOfRanges                      DormantDuration;                                   // 0x90(0x30)
	float                                                        MinimumDurationForTheEffects;                      // 0xc0(0x4)
	char                                                         pad0x4_8WUD6[0x4];                                 // 0xc4(0x4)
	Struct WeightedProbabilityRangeOfRanges                      GroundAndWaterStayHotDurationAfterVolcanoFinishesDuration; // 0xc8(0x30)
	Struct WeightedProbabilityRangeOfRanges                      ProjectileTriggerFrequency;                        // 0xf8(0x30)
	Struct WeightedProbabilityRangeOfRanges                      PercentageOfMaxTargetingRange;                     // 0x128(0x30)
	int                                                          MinNumProjectilesToTrigger;                        // 0x158(0x4)
	int                                                          MaxNumProjectilesToTrigger;                        // 0x15c(0x4)
	int                                                          ExtraProjectilePoolNumProjectiles;                 // 0x160(0x4)
	char                                                         pad0x4_UGBWF[0x4];                                 // 0x164(0x4)
	Struct VolcanoTargetChances                                  ChanceToTargetPlayers;                             // 0x168(0x58)
	Struct VolcanoTargetChances                                  ChanceToTargetShips;                               // 0x1c0(0x58)
	Struct VolcanoTargetChances                                  ChanceToTargetWatercraft;                          // 0x218(0x58)
	Struct WeightedProbabilityRangeOfRanges                      PlayerNearMissDistanceInMetres;                    // 0x270(0x30)
	float                                                        InnerShipNearMissRadiusInMetres;                   // 0x2a0(0x4)
	float                                                        OuterShipNearMissRadiusInMetres;                   // 0x2a4(0x4)
	float                                                        InnerWatercraftNearMissRadiusInMetres;             // 0x2a8(0x4)
	float                                                        OuterWatercraftNearMissRadiusInMetres;             // 0x2ac(0x4)
	TArray<struct Projectiles>                                   Projectiles;                                       // 0x2b0(0x10)
	TArray<struct ForceFeedbackIgnitionEffect>                   ForceFeedbackIgnitionEffect;                       // 0x2c0(0x10)
	class                                                        LocalMiniProjectilesClass;                         // 0x2d0(0x8)
	Struct WeightedProbabilityRangeOfRanges                      LocalMiniProjectilesSpawnHeightAbovePlayerInMetres; // 0x2d8(0x30)
	Struct WeightedProbabilityRangeOfRanges                      LocalMiniProjectilesSpawnDistanceFromPlayerInMetres; // 0x308(0x30)
	Struct WeightedProbabilityRangeOfRanges                      LocalMiniProjectilesTimeBetweenSpawns;             // 0x338(0x30)
	Struct WeightedProbabilityRange                              NumLocalMiniProjectilesToTrigger;                  // 0x368(0x20)
	Struct WeightedProbabilityRangeOfRanges                      LocalMiniProjectilesSpeed;                         // 0x388(0x30)
	float                                                        LocalMiniProjectilesGravityScale;                  // 0x3b8(0x4)
	char                                                         pad0x4_ZPKXK[0x4];                                 // 0x3bc(0x4)
	Struct WeightedProbabilityRangeOfRanges                      LocalMiniProjectilesSpawnAngleRange;               // 0x3c0(0x30)
	Struct WeightedProbabilityRangeOfRanges                      LocalMiniProjectilesSpawnStartPositionOffsetInMetres; // 0x3f0(0x30)
	float                                                        LocalMiniProjectilesSpawnDistanceSpeedScalar;      // 0x420(0x4)
	float                                                        LocalMiniProjectilesSpawnDistanceMaxPlayerSpeed;   // 0x424(0x4)
	float                                                        TimeBetweenLocalEmbers;                            // 0x428(0x4)
	char                                                         pad0x4_JDUJ9[0x4];                                 // 0x42c(0x4)
	TArray<struct LocalEmbers>                                   LocalEmbers;                                       // 0x430(0x10)
	float                                                        EmbersSpawnOffsetInMetres;                         // 0x440(0x4)
	float                                                        ServerMigrationDistanceAsMultipleOfOuterTargetRadius; // 0x444(0x4)
};


// Size 0x150 (Full Size[0x178] - InheritedSize[0x28]
class AshenLordVolcanoSetupDataAsset: public DataAsset
{
public:
	Struct WeightedProbabilityRangeOfRanges                      ProjectileTriggerFrequency;                        // 0x28(0x30)
	Struct WeightedProbabilityRange                              NumProjectilesToTrigger;                           // 0x58(0x20)
	Struct WeightedProbabilityRangeOfRanges                      SpawnHeightInMetres;                               // 0x78(0x30)
	Struct WeightedProbabilityRangeOfRanges                      TargetDistanceFromCenterInMetres;                  // 0xa8(0x30)
	Struct WeightedProbabilityRangeOfRanges                      TimeBetweenSpawns;                                 // 0xd8(0x30)
	Struct WeightedProbabilityRangeOfRanges                      StartPositionOffsetInMetres;                       // 0x108(0x30)
	TArray<struct Projectiles>                                   Projectiles;                                       // 0x138(0x10)
	Struct PoolableCollectionMapConfiguration                    PoolableProjectilesConfig;                         // 0x148(0x18)
	Struct VolcanoSetupDataEmbersEntry                           Embers;                                            // 0x160(0x10)
	float                                                        EmberSpawnHeightInMeters;                          // 0x170(0x4)
	float                                                        TimeBetweenEmbers;                                 // 0x174(0x4)
};


// Size 0x18 (Full Size[0x3e0] - InheritedSize[0x3c8]
class AshenLordWorldEndCloud: public Actor
{
public:
	float                                                        SelfDestructDelayOnComplete;                       // 0x3c8(0x4)
	byte                                                         CloudState;                                        // 0x3cc(0x1)
	char                                                         pad0x3_PXHIC[0x3];                                 // 0x3cd(0x3)
	Struct AshenLordWorldEndCloudAnimation                       CurrentCloudAnimation;                             // 0x3d0(0x8)
	char                                                         pad0x8_FNT4N[0x8];                                 // 0x3d8(0x8)
};


// Size 0xf0 (Full Size[0x4b8] - InheritedSize[0x3c8]
class Geyser: public Actor
{
public:
	char                                                         pad0x10_7K49N[0x10];                               // 0x3c8(0x10)
	Class GeyserSetupDataAsset*                                  SetupData;                                         // 0x3d8(0x8)
	Class GeyserSetupDataAsset*                                  GeyserSetupDataOverride;                           // 0x3e0(0x8)
	Class GeyserSetupDataAsset*                                  SelectedGeyserForNextActivation;                   // 0x3e8(0x8)
	TArray<struct StoryCustomisationData>                        StoryCustomisationData;                            // 0x3f0(0x10)
	char                                                         pad0x18_FZPIL[0x18];                               // 0x400(0x18)
	byte                                                         GeyserState;                                       // 0x418(0x1)
	char                                                         pad0x7_OYV1E[0x7];                                 // 0x419(0x7)
	Class WwiseObjectPoolWrapper*                                GeyserBuildUpPool;                                 // 0x420(0x8)
	Class WwiseObjectPoolWrapper*                                GeyserBlowPool;                                    // 0x428(0x8)
	Class WwiseEvent*                                            StartActiveAudioLoopEvent;                         // 0x430(0x8)
	Class WwiseEvent*                                            StopActiveAudioLoopEvent;                          // 0x438(0x8)
	Class WwiseEvent*                                            PlayEruptingAudioEvent;                            // 0x440(0x8)
	Class ExplosionComponent*                                    ExplosionComponent;                                // 0x448(0x8)
	Class ParticleSystemComponent*                               ActiveParticlesComponent;                          // 0x450(0x8)
	Class ParticleSystemComponent*                               EruptingParticlesComponent;                        // 0x458(0x8)
	byte                                                         HitTestTraceChannel;                               // 0x460(0x1)
	char                                                         pad0x7_F5LW7[0x7];                                 // 0x461(0x7)
	class                                                        GeyserHoleClass;                                   // 0x468(0x8)
	Class Hole*                                                  GeyserHole;                                        // 0x470(0x8)
	char                                                         pad0x40_RKDBI[0x40];                               // 0x478(0x40)
};


// Size 0x18 (Full Size[0x3e0] - InheritedSize[0x3c8]
class DisableGeyserMechanismAction: public Actor
{
public:
	Class MechanismActionComponent*                              MechanismActionComponent;                          // 0x3c8(0x8)
	TArray<class Geyser*>                                        GeysersToDisable;                                  // 0x3d0(0x10)
};


// Size 0x300 (Full Size[0x328] - InheritedSize[0x28]
class EarthquakeSetupDataAsset: public DataAsset
{
public:
	bool                                                         IsEnabled;                                         // 0x28(0x1)
	char                                                         pad0x7_KYCV7[0x7];                                 // 0x29(0x7)
	Struct WeightedProbabilityRangeOfRanges                      WarmUpDuration;                                    // 0x30(0x30)
	Struct WeightedProbabilityRangeOfRanges                      EarthquakeDuration;                                // 0x60(0x30)
	Struct WeightedProbabilityRangeOfRanges                      CoolDownDuration;                                  // 0x90(0x30)
	Struct WeightedProbabilityRangeOfRanges                      DormantDuration;                                   // 0xc0(0x30)
	float                                                        ChanceOfTriggeringAVolcano;                        // 0xf0(0x4)
	Struct FloatRange                                            PercentageThroughEarthquakeToStartVolcano;         // 0xf4(0x10)
	char                                                         pad0x4_8TTG4[0x4];                                 // 0x104(0x4)
	Struct PlayerFeedback                                        WarmupPlayerFeedback;                              // 0x108(0x80)
	Struct PlayerFeedback                                        ActivePlayerFeedback;                              // 0x188(0x80)
	Struct WeightedProbabilityRangeOfRanges                      StaggerStrengthDuration;                           // 0x208(0x30)
	float                                                        StaggerStrengthModifierWhenOnAShip;                // 0x238(0x4)
	Struct FloatRange                                            PercentageThroughCameraShakeToStartNextOne;        // 0x23c(0x10)
	Struct FloatRange                                            TimeToShipPush;                                    // 0x24c(0x10)
	char                                                         pad0x4_YJEQP[0x4];                                 // 0x25c(0x4)
	Struct WeightedProbabilityRangeOfRanges                      ForceToApplyToShip;                                // 0x260(0x30)
	float                                                        MaximumShipSpeedToBePushed;                        // 0x290(0x4)
	float                                                        ChanceEarthquakeTriggersGeysers;                   // 0x294(0x4)
	Struct WeightedProbabilityRangeOfRanges                      TimeBetweenLocalEffects;                           // 0x298(0x30)
	Struct WeightedProbabilityRange                              NumberOfLocalEffectsToTrigger;                     // 0x2c8(0x20)
	float                                                        EffectConeAngle;                                   // 0x2e8(0x4)
	float                                                        EffectRaycastDistanceInMetres;                     // 0x2ec(0x4)
	Struct DistanceThrottledRandomParticleSystemPicker           EarthquakeEffects;                                 // 0x2f0(0x10)
	float                                                        WarmupWindTurbulence;                              // 0x300(0x4)
	Struct FloatRange                                            WarmupGustPower;                                   // 0x304(0x10)
	float                                                        ActiveWindTurbulence;                              // 0x314(0x4)
	Struct FloatRange                                            ActiveGustPower;                                   // 0x318(0x10)
};


// Size 0x1f0 (Full Size[0x5b8] - InheritedSize[0x3c8]
class Earthquake: public Actor
{
public:
	char                                                         pad0x10_LUR21[0x10];                               // 0x3c8(0x10)
	Class EarthquakeSetupDataAsset*                              EarthquakeSetupData;                               // 0x3d8(0x8)
	Class EarthquakeSetupDataAsset*                              EarthquakeSetupDataOverride;                       // 0x3e0(0x8)
	Class EarthquakeSetupDataAsset*                              SelectedEarthquakeDataForNextQuake;                // 0x3e8(0x8)
	TArray<struct StoryCustomisationData>                        StoryCustomisationData;                            // 0x3f0(0x10)
	Class Volcano*                                               AssociatedVolcano;                                 // 0x400(0x8)
	Class GeyserManager*                                         AssociatedGeyserManager;                           // 0x408(0x8)
	float                                                        EarthquakeEffectInnerRadiusOffsetInMetres;         // 0x410(0x4)
	char                                                         pad0x4_FKKEC[0x4];                                 // 0x414(0x4)
	Class WwiseObjectPoolWrapper*                                AudioPool;                                         // 0x418(0x8)
	Class WwiseEvent*                                            PlayEarthquakeLarge;                               // 0x420(0x8)
	Class WwiseEvent*                                            StopEarthquakeLarge;                               // 0x428(0x8)
	Class WwiseEvent*                                            PlayEarthquakeSmall;                               // 0x430(0x8)
	Class WwiseEvent*                                            StopEarthquakeSmall;                               // 0x438(0x8)
	struct FName                                                 EarthquakeRtpcName;                                // 0x440(0x8)
	float                                                        EarthquakeRtpcMin;                                 // 0x448(0x4)
	float                                                        EarthquakeRtpcMax;                                 // 0x44c(0x4)
	float                                                        EarthquakeSizeToUseLargeAttenuation;               // 0x450(0x4)
	char                                                         pad0x4_SF05L[0x4];                                 // 0x454(0x4)
	Class CapsuleComponent*                                      HitDetectionVolume;                                // 0x458(0x8)
	Class WindZoneComponent*                                     WindZone;                                          // 0x460(0x8)
	byte                                                         EarthquakeState;                                   // 0x468(0x1)
	char                                                         pad0x14f_L5M6O[0x14f];                             // 0x469(0x14f)
};


// Size 0x10 (Full Size[0x4c8] - InheritedSize[0x4b8]
class MechanismGeyser: public Geyser
{
public:
	byte                                                         GeyserStateWhenMechanismIsInactive;                // 0x4b8(0x1)
	char                                                         pad0x7_GC3T2[0x7];                                 // 0x4b9(0x7)
	Class MechanismActionComponent*                              MechanismActionComponent;                          // 0x4c0(0x8)
};


// Size 0x198 (Full Size[0x1c0] - InheritedSize[0x28]
class GeyserManagerSetupDataAsset: public DataAsset
{
public:
	bool                                                         IsEnabled;                                         // 0x28(0x1)
	char                                                         pad0x7_8NKHH[0x7];                                 // 0x29(0x7)
	Struct WeightedProbabilityRangeOfRanges                      DormantDuration;                                   // 0x30(0x30)
	Struct WeightedProbabilityRangeOfRanges                      ActiveDuration;                                    // 0x60(0x30)
	Struct WeightedProbabilityRangeOfRanges                      DelayBetweenGeyserGroupsDuringGeyserEvent;         // 0x90(0x30)
	bool                                                         StartInactive;                                     // 0xc0(0x1)
	bool                                                         NoRestartAfterGeyserSpurtComplete;                 // 0xc1(0x1)
	bool                                                         UseUniqueLocationsForEachGeyser;                   // 0xc2(0x1)
	char                                                         pad0x1_W3XGZ[0x1];                                 // 0xc3(0x1)
	float                                                        MinDistanceFromPlayerInMetres;                     // 0xc4(0x4)
	float                                                        MinGeyserSequenceSpacing;                          // 0xc8(0x4)
	char                                                         pad0x4_5QQZ2[0x4];                                 // 0xcc(0x4)
	class                                                        GeyserToSpawn;                                     // 0xd0(0x8)
	Struct WeightedProbabilityRange                              NumGeyserGroupsToSpawn;                            // 0xd8(0x20)
	Struct WeightedProbabilityRange                              NumGeysersToSpawnPerGroup;                         // 0xf8(0x20)
	Struct WeightedProbabilityRangeOfRanges                      SpawnDistanceFromPlayerInMetres;                   // 0x118(0x30)
	Struct WeightedProbabilityRangeOfRanges                      SpawnRadiusInMetres;                               // 0x148(0x30)
	TArray<struct SpawnAngleRelativeToPlayerDirection>           SpawnAngleRelativeToPlayerDirection;               // 0x178(0x10)
	Struct WeightedProbabilityRangeOfRanges                      DelayBetweenEachGeyserSpawningInAGroup;            // 0x188(0x30)
	float                                                        MaximumDensityRadiusInMetres;                      // 0x1b8(0x4)
	int                                                          MaximumDensityMaxNumGeysersWithinRadius;           // 0x1bc(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NaturalDisasterRegistryInterface: public Interface
{
public:
};


// Size 0x80 (Full Size[0x448] - InheritedSize[0x3c8]
class GeyserManager: public Actor
{
public:
	Class GeyserManagerSetupDataAsset*                           GeyserManagerSetupData;                            // 0x3c8(0x8)
	Class GeyserManagerSetupDataAsset*                           GeyserManagerSetupDataOverride;                    // 0x3d0(0x8)
	Class GeyserManagerSetupDataAsset*                           SelectedGeyserManagerForNextActivation;            // 0x3d8(0x8)
	TArray<struct StoryCustomisationData>                        StoryCustomisationData;                            // 0x3e0(0x10)
	Class SceneComponent*                                        Root;                                              // 0x3f0(0x8)
	byte                                                         State;                                             // 0x3f8(0x1)
	char                                                         pad0x4f_PD97A[0x4f];                               // 0x3f9(0x4f)
};


// Size 0x20 (Full Size[0x460] - InheritedSize[0x440]
class GeyserItemSpawnComponent: public ItemSpawnComponent
{
public:
};


// Size 0xc0 (Full Size[0xe8] - InheritedSize[0x28]
class GeyserSetupDataAsset: public DataAsset
{
public:
	bool                                                         IsEnabled;                                         // 0x28(0x1)
	char                                                         pad0x7_D4USV[0x7];                                 // 0x29(0x7)
	Struct WeightedProbabilityRangeOfRanges                      DormantDuration;                                   // 0x30(0x30)
	Struct WeightedProbabilityRangeOfRanges                      InitialWarningDuration;                            // 0x60(0x30)
	Struct WeightedProbabilityRange                              NumSpurtsPerActivation;                            // 0x90(0x20)
	Struct WeightedProbabilityRangeOfRanges                      TimeBetweenSpurts;                                 // 0xb0(0x30)
	bool                                                         ShouldDestroyOnDeactivation;                       // 0xe0(0x1)
	char                                                         pad0x3_BRORT[0x3];                                 // 0xe1(0x3)
	float                                                        DestroyAfterDeactivationDelay;                     // 0xe4(0x4)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class LavaStatus: public StatusBase
{
public:
};


// Size 0xa8 (Full Size[0x470] - InheritedSize[0x3c8]
class LavaZone: public Actor
{
public:
	Struct WeightedProbabilityRangeOfRanges                      TimeBetweenActivations;                            // 0x3c8(0x30)
	Struct WeightedProbabilityRangeOfRanges                      ActiveDuration;                                    // 0x3f8(0x30)
	Struct StoryFlag                                             StoryFlag;                                         // 0x428(0x8)
	Class PhysicalMaterial*                                      LavaMaterial;                                      // 0x430(0x8)
	TArray<class Actor*>                                         ActorsInZone;                                      // 0x438(0x10)
	bool                                                         Active;                                            // 0x448(0x1)
	bool                                                         InitializeFromGlobalState;                         // 0x449(0x1)
	bool                                                         SelfActivating;                                    // 0x44a(0x1)
	char                                                         pad0x5_0KVD8[0x5];                                 // 0x44b(0x5)
	char                                                         pad0x20_XRCK6[0x20];                               // 0x450(0x20)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class VolcanoInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class VolcanoServiceInterface: public Interface
{
public:
};


// Size 0x78 (Full Size[0xc0] - InheritedSize[0x48]
class SeatStat_IslandVolcanoActive: public SeatStat
{
public:
	struct FName                                                 VolcanoIslandName;                                 // 0x48(0x8)
	char                                                         pad0x70_FN9EN[0x70];                               // 0x50(0x70)
};


// Size 0xc0 (Full Size[0xe8] - InheritedSize[0x28]
class SuperheatedWaterSetupDataAsset: public DataAsset
{
public:
	float                                                        TimeBetweenHealthReduction;                        // 0x28(0x4)
	float                                                        MinimumWaterDepthToCauseDamage;                    // 0x2c(0x4)
	Struct WeightedProbabilityRangeOfRanges                      TimeBetweenLargeSurfaceEffects;                    // 0x30(0x30)
	float                                                        LargeSurfaceEffectMinimumDistanceInMetres;         // 0x60(0x4)
	char                                                         pad0x4_7O242[0x4];                                 // 0x64(0x4)
	Struct RandomParticleSystemPicker                            LargeSurfaceEffects;                               // 0x68(0x10)
	float                                                        EffectSpawnHeight;                                 // 0x78(0x4)
	float                                                        MurkStrengthToStartEffects;                        // 0x7c(0x4)
	Struct WeightedProbabilityRangeOfRanges                      TimeBetweenSmallSurfaceEffects;                    // 0x80(0x30)
	Struct WeightedProbabilityRange                              NumSmallSurfaceEffects;                            // 0xb0(0x20)
	Struct DistanceThrottledRandomParticleSystemPicker           SmallSurfaceEffects;                               // 0xd0(0x10)
	float                                                        SmallSurfaceEffectNearbyPlayerRadiusInMetres;      // 0xe0(0x4)
	float                                                        SmallSurfaceEffectOffsetRadiusInMetres;            // 0xe4(0x4)
};


// Size 0x108 (Full Size[0x570] - InheritedSize[0x468]
class SuperheatedWater: public Murk
{
public:
	char                                                         pad0x10_PCNMH[0x10];                               // 0x468(0x10)
	Class SuperheatedWaterSetupDataAsset*                        SetupData;                                         // 0x478(0x8)
	Class CapsuleComponent*                                      HitDetectionVolume;                                // 0x480(0x8)
	float                                                        FakeUnderwaterLocationsMinDistanceInMetres;        // 0x488(0x4)
	float                                                        FakeUnderwaterLocationsDistanceBetweenPointsInMetres; // 0x48c(0x4)
	TArray<Weakclass PlayersInZone>                              PlayersInZone;                                     // 0x490(0x10)
	char                                                         pad0xd0_WQEEM[0xd0];                               // 0x4a0(0xd0)
};


// Size 0x228 (Full Size[0x5f0] - InheritedSize[0x3c8]
class Volcano: public Actor
{
public:
	char                                                         pad0x18_C0HLX[0x18];                               // 0x3c8(0x18)
	Class VolcanoSetupDataAsset*                                 VolcanoSetupDataOverride;                          // 0x3e0(0x8)
	Class VolcanoSetupDataAsset*                                 SelectedVolcanoDataForNextEruption;                // 0x3e8(0x8)
	TArray<struct StoryCustomisationData>                        StoryCustomisationData;                            // 0x3f0(0x10)
	Class CapsuleComponent*                                      HitDetectionVolume;                                // 0x400(0x8)
	bool                                                         UseDormantDuration;                                // 0x408(0x1)
	char                                                         pad0x7_RNRXB[0x7];                                 // 0x409(0x7)
	Class VolcanoSetupDataAsset*                                 VolcanoSetupData;                                  // 0x410(0x8)
	Class Murk*                                                  AssociatedSuperheatedWater;                        // 0x418(0x8)
	Class LavaZone*                                              AssociatedLavaZone;                                // 0x420(0x8)
	float                                                        InnerTargetRadiusInMetres;                         // 0x428(0x4)
	float                                                        OuterTargetRadiusInMetres;                         // 0x42c(0x4)
	float                                                        NearbyPlayerRangeToFireProjectilesInMetres;        // 0x430(0x4)
	float                                                        RandomShipPositionScale;                           // 0x434(0x4)
	Class ParticleSystemComponent*                               WarmingUpEmitter;                                  // 0x438(0x8)
	Class ParticleSystemComponent*                               EruptingEmitter;                                   // 0x440(0x8)
	Class BlendedLightingZoneComponent*                          BlendedLightingZoneComponent;                      // 0x448(0x8)
	Class BlendedAtmosphericPressureZoneComponent*               BlendedAtmosphericPressureZoneComponent;           // 0x450(0x8)
	Class BlendedPostProcessingRainZoneComponent*                BlendedPostProcessingRainZoneComponent;            // 0x458(0x8)
	Struct Vector                                                ProjectileLaunchOffset;                            // 0x460(0xc)
	char                                                         pad0x4_7S6M7[0x4];                                 // 0x46c(0x4)
	Class WwiseObjectPoolWrapper*                                AudioPool;                                         // 0x470(0x8)
	Class WwiseEvent*                                            WarmupAudioPlayEvent;                              // 0x478(0x8)
	Class WwiseEvent*                                            WarmupAudioStopEvent;                              // 0x480(0x8)
	Class WwiseEvent*                                            EruptingAudioPlayEvent;                            // 0x488(0x8)
	Class WwiseEvent*                                            EruptingAudioStopEvent;                            // 0x490(0x8)
	Class CapsuleComponent*                                      InstantKillZone;                                   // 0x498(0x8)
	float                                                        InstantKillZoneTestInterval;                       // 0x4a0(0x4)
	Struct VolcanoStateData                                      StateData;                                         // 0x4a4(0xc)
	struct FName                                                 AssociatedIslandName;                              // 0x4b0(0x8)
	char                                                         pad0x138_NE0RG[0x138];                             // 0x4b8(0x138)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class VolcanoService: public Object
{
public:
};


}