#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x150
struct NavalBattleTelemetryFragmentInput
{
public:
	struct NavalBattleShipData                                   NavalBattleShipData;                               // 0x0(0x150)
};


// Size 0x1
struct NavalBattleShipSunkTelemetry
{
public:
	char                                                         pad0x1_6ZISJ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct NavalBattleShipDamagerTelemetry
{
public:
	char                                                         pad0x1_WJKTM[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct NavalBattleCrewDestroyedTelemetry
{
public:
	char                                                         pad0x1_O3A7X[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct NavalBattleShipDamagedTelemetry
{
public:
	char                                                         pad0x1_L893F[0x1];                                 // 0x0(0x1)
};


// Size 0xc8
struct NavalBattleTelemetryFragment
{
public:
	struct Guid                                                  Id;                                                // 0x0(0x10)
	struct Guid                                                  ShipCrewId;                                        // 0x10(0x10)
	struct FString                                               ShipName;                                          // 0x20(0x10)
	TArray<struct Guid>                                          AttackerIds;                                       // 0x30(0x10)
	TArray<Double LastTimeAttackedArray>                         LastTimeAttackedArray;                             // 0x40(0x10)
	TArray<struct Guid>                                          CrewAttackedIds;                                   // 0x50(0x10)
	TArray<Double LastTimeAttackedCrewArray>                     LastTimeAttackedCrewArray;                         // 0x60(0x10)
	TArray<struct Guid>                                          SunkByIds;                                         // 0x70(0x10)
	TArray<char>                                                 SunkByCounters;                                    // 0x80(0x10)
	struct Guid                                                  LastAttackerCrewID;                                // 0x90(0x10)
	struct Guid                                                  LastAttackedCrewID;                                // 0xa0(0x10)
	double                                                       TimeLastDamaged;                                   // 0xb0(0x8)
	double                                                       TimeLastAttackedAnotherCrew;                       // 0xb8(0x8)
	double                                                       TimeLastSunk;                                      // 0xc0(0x8)
};


// Size 0x1
struct NavalBattleShipForcedMigratedTelemetry
{
public:
	char                                                         pad0x1_02UAB[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct NavalBattleCrewTradedSinksTelemetry
{
public:
	struct Guid                                                  ShipSunkId;                                        // 0x0(0x10)
};


// Size 0x1
struct NavalBattleSinkTimerElapsedTelemetry
{
public:
	char                                                         pad0x1_FCXR0[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct NavalBattleShipAddedTelemetry
{
public:
	char                                                         pad0x1_49T6N[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct NavalBattleCrewNoLongerAttackerTelemetry
{
public:
	struct Guid                                                  CrewIdRemoved;                                     // 0x0(0x10)
};


