// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20
struct NudgeInterpolationParams
{
public:
	float                                                        MinAngle;                                          // 0x0(0x4)
	float                                                        MaxAngle;                                          // 0x4(0x4)
	Class CurveFloat*                                            AngleCurveOut;                                     // 0x8(0x8)
	Class CurveFloat*                                            AngleCurveIn;                                      // 0x10(0x8)
	byte                                                         Axis;                                              // 0x18(0x1)
};


// Size 0x30
struct TrinketNudgeProgress
{
public:
	Class SceneComponent*                                        TrinketRoot;                                       // 0x8(0x8)
	char                                                         pad0x10_M5LHO[0x10];                               // 0x10(0x10)
	Class CurveFloat*                                            Curve;                                             // 0x20(0x8)
};


}