// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20
struct NudgeInterpolationParams
{
public:
	float                                                        MinAngle;                                          // 0x0(0x4)
	float                                                        MaxAngle;                                          // 0x4(0x4)
	class CurveFloat*                                            AngleCurveOut;                                     // 0x8(0x8)
	class CurveFloat*                                            AngleCurveIn;                                      // 0x10(0x8)
	byte                                                         Axis;                                              // 0x18(0x1)
	char                                                         pad0x7_AAR2T[0x7];                                 // 0x19(0x7)
};


// Size 0x30
struct TrinketNudgeProgress
{
public:
	char                                                         pad0x8_UK6CT[0x8];                                 // 0x0(0x8)
	class SceneComponent*                                        TrinketRoot;                                       // 0x8(0x8)
	char                                                         pad0x10_QXGUX[0x10];                               // 0x10(0x10)
	class CurveFloat*                                            Curve;                                             // 0x20(0x8)
	char                                                         pad0x8_HV9UU[0x8];                                 // 0x28(0x8)
};


}