// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10
class NudgeFromExplosionsPolicy: public NudgePolicy
{
public:
	TArray<Struct NudgeChancePerDamagerType>                     AcceptedDamagerTypes;                              // 0xc8(0x10)
};


// Size 0x8
class NudgeFromShipCollisionPolicy: public NudgePolicy
{
public:
	int                                                          DamageAmountRequiredToNudge;                       // 0xc8(0x4)
	float                                                        ChanceOfNudge;                                     // 0xcc(0x4)
};


// Size 0x90
class NudgeFromStormPolicy: public NudgePolicy
{
public:
	float                                                        ChanceOfNudge;                                     // 0xc8(0x4)
	Struct WeightedProbabilityRangeOfRanges                      WeightedTimers;                                    // 0xd0(0x30)
};


// Size 0x28
class NudgeFromWaterLevelPolicy: public NudgePolicy
{
public:
	float                                                        ChanceOfNudge;                                     // 0xc8(0x4)
	float                                                        WaterLevelDifferenceBetweenUpdates;                // 0xe0(0x4)
	float                                                        ZOffsetFromWaterToMountpoint;                      // 0xe4(0x4)
};


}