#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x18
struct OceanCrawlerSporeBreathAnimationData
{
public:
	class BlendSpace1D*                                          Into;                                              // 0x0(0x8)
	class BlendSpace1D*                                          Locomotion;                                        // 0x8(0x8)
	class BlendSpace1D*                                          Outof;                                             // 0x10(0x8)
};


// Size 0x30
struct OceanCrawlerLocomotionAnimationDataStructure
{
public:
	class BlendSpace1D*                                          LocomotionIntoAsBlendspace;                        // 0x0(0x8)
	class AnimSequence*                                          Idle;                                              // 0x8(0x8)
	class AnimSequence*                                          LocomotionOutOf;                                   // 0x10(0x8)
	class BlendSpace1D*                                          LocomotionOutOfAsBlendspace;                       // 0x18(0x8)
	class BlendSpace*                                            Locomotion;                                        // 0x20(0x8)
	float                                                        IntoDeadZone;                                      // 0x28(0x4)
	float                                                        OutOfDeadZone;                                     // 0x2c(0x4)
};


// Size 0x90
struct OceanCrawlerAnimationDataStructure
{
public:
	struct OceanCrawlerLocomotionAnimationDataStructure          LocomotionData;                                    // 0x0(0x30)
	class CustomAnimationMontageDefinitionListingDataAsset*      MontageData;                                       // 0x30(0x8)
	class AthenaAnimationWeaponDataAsset*                        AttackAnimations;                                  // 0x38(0x8)
	struct HitReactionAnimationData                              HitReactionData;                                   // 0x40(0x8)
	struct OceanCrawlerSporeBreathAnimationData                  SporeBreathData;                                   // 0x48(0x18)
	TArray<struct CustomAnimationMontageId>                      AttackInterruptMontages;                           // 0x60(0x10)
	struct CustomAnimationMontageId                              DeathMontageId;                                    // 0x70(0x8)
	struct CustomAnimationMontageId                              SpawnMontageId;                                    // 0x78(0x8)
	struct CustomAnimationMontageId                              SpawnOnShipMontageId;                              // 0x80(0x8)
	struct CustomAnimationMontageId                              SpawnBoardedMontageId;                             // 0x88(0x8)
};


