#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "OceanCrawlers_Structs.h"


// Size 0x130 (Full Size[0x1f8] - InheritedSize[0xc8]
class OceanCrawlerAudioBroadcaster: public ActorComponent
{
public:
	assetclass                                                   AudioDataAsset;                                    // 0xc8(0x20)
	class Actor*                                                 CachedOwner;                                       // 0xe8(0x8)
	class OceanCrawlerAudioParamsDataAsset*                      LoadedAudioDataAsset;                              // 0x1f0(0x8)
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class BTTask_BroadcastOceanCrawlerAbilityAudioEvent: public BTTaskNode
{
public:
	char                                                         OceanCrawlerAudioKeyToBroadcast;                   // 0x60(0x1)
};


// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class OceanCrawlerAudioParamsDataAsset: public DataAsset
{
public:
	class WwiseObjectPoolWrapper*                                WwiseObjectPoolWrapper;                            // 0x28(0x8)
	TArray<struct OceanCrawlerAudioKeyPair>                      AudioKeyPairs;                                     // 0x30(0x10)
	struct WeightedProbabilityRangeOfRanges                      BuffThankDelay;                                    // 0x40(0x30)
	struct OceanCrawlerBuffAudioSettings                         CrabBuffAudioSettings;                             // 0x70(0x10)
	struct OceanCrawlerBuffAudioSettings                         EelBuffAudioSettings;                              // 0x80(0x10)
	struct OceanCrawlerBuffAudioSettings                         HermitBuffAudioSettings;                           // 0x90(0x10)
};


