// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class BTTask_BroadcastOceanCrawlerAbilityAudioEvent: public BTTaskNode
{
public:
	byte                                                         OceanCrawlerAudioKeyToBroadcast;                   // 0x60(0x1)
	char                                                         pad0x9_PPWCW[0x9];                                 // 0x5f(0x9)
};


// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class OceanCrawlerAudioParamsDataAsset: public DataAsset
{
public:
	Class WwiseObjectPoolWrapper*                                WwiseObjectPoolWrapper;                            // 0x28(0x8)
	TArray<struct AudioKeyPairs>                                 AudioKeyPairs;                                     // 0x30(0x10)
	Struct WeightedProbabilityRangeOfRanges                      BuffThankDelay;                                    // 0x40(0x30)
	Struct OceanCrawlerBuffAudioSettings                         CrabBuffAudioSettings;                             // 0x70(0x10)
	Struct OceanCrawlerBuffAudioSettings                         EelBuffAudioSettings;                              // 0x80(0x10)
	Struct OceanCrawlerBuffAudioSettings                         HermitBuffAudioSettings;                           // 0x90(0x10)
};


// Size 0xd8 (Full Size[0x1a0] - InheritedSize[0xc8]
class OceanCrawlerAudioBroadcaster: public ActorComponent
{
public:
	Class OceanCrawlerAudioParamsDataAsset*                      AudioDataAsset;                                    // 0xc8(0x8)
	Class Actor*                                                 CachedOwner;                                       // 0xd0(0x8)
	char                                                         pad0xd8_UGGGO[0xd8];                               // 0xd6(0xd8)
};


}