#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "OnlineSubsystemUtils_Structs.h"


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class InAppPurchaseCallbackProxy: public Object
{
public:
	char                                                         pad0x60_HQ9V4[0x60];                               // 0x28(0x60)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class AchievementBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class LeaderboardQueryCallbackProxy: public Object
{
public:
	char                                                         pad0x68_VD36J[0x68];                               // 0x28(0x68)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class LeaderboardFlushCallbackProxy: public Object
{
public:
	char                                                         pad0x38_QUCTM[0x38];                               // 0x28(0x38)
};


// Size 0x150 (Full Size[0x178] - InheritedSize[0x28]
class OnlineSessionClient: public OnlineSession
{
public:
	char                                                         pad0x148_AVU8Z[0x148];                             // 0x28(0x148)
	bool                                                         bIsFromInvite;                                     // 0x170(0x1)
	bool                                                         bHandlingDisconnect;                               // 0x171(0x1)
	char                                                         pad0x6_O0SEA[0x6];                                 // 0x172(0x6)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class LeaderboardBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class InAppPurchaseRestoreCallbackProxy: public Object
{
public:
	char                                                         pad0x70_1AIPE[0x70];                               // 0x28(0x70)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class ShowLoginUICallbackProxy: public BlueprintAsyncActionBase
{
public:
	char                                                         pad0x30_TSSVR[0x30];                               // 0x28(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class OnlineBlueprintCallProxyBase: public Object
{
public:
};


// Size 0x28 (Full Size[0x3c8] - InheritedSize[0x3a0]
class OnlineBeaconHostObject: public Actor
{
public:
	struct FString                                               BeaconTypeName;                                    // 0x3a0(0x10)
	class UClass*                                                ClientBeaconActorClass;                            // 0x3b0(0x8)
	TArray<class OnlineBeaconClient*>                            ClientActors;                                      // 0x3b8(0x10)
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class InAppPurchaseQueryCallbackProxy: public Object
{
public:
	char                                                         pad0x70_YABC2[0x70];                               // 0x28(0x70)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class PartyBeaconState: public Object
{
public:
	struct FName                                                 SessionName;                                       // 0x28(0x8)
	int                                                          NumConsumedReservations;                           // 0x30(0x4)
	int                                                          MaxReservations;                                   // 0x34(0x4)
	int                                                          NumTeams;                                          // 0x38(0x4)
	int                                                          NumPlayersPerTeam;                                 // 0x3c(0x4)
	int                                                          ReservedHostTeamNum;                               // 0x40(0x4)
	int                                                          ForceTeamNum;                                      // 0x44(0x4)
	TArray<struct PartyReservation>                              Reservations;                                      // 0x48(0x10)
	char                                                         pad0x10_GACPD[0x10];                               // 0x58(0x10)
};


// Size 0x50 (Full Size[0x530] - InheritedSize[0x4e0]
class IpNetDriver: public NetDriver
{
public:
	bool                                                         LogPortUnreach;                                    // 0x4e0(0x1)
	bool                                                         AllowPlayerPortUnreach;                            // 0x4e0(0x1)
	char                                                         pad0x3_S7GPE[0x3];                                 // 0x4e1(0x3)
	char                                                         pad0x4c_J7M0I[0x4c];                               // 0x4e4(0x4c)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class LogoutCallbackProxy: public BlueprintAsyncActionBase
{
public:
	char                                                         pad0x38_5Q8VI[0x38];                               // 0x28(0x38)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TurnBasedBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x28 (Full Size[0x3c8] - InheritedSize[0x3a0]
class OnlineBeacon: public Actor
{
public:
	char                                                         pad0x8_ZC10H[0x8];                                 // 0x3a0(0x8)
	float                                                        BeaconConnectionInitialTimeout;                    // 0x3a8(0x4)
	float                                                        BeaconConnectionTimeout;                           // 0x3ac(0x4)
	class NetDriver*                                             NetDriver;                                         // 0x3b0(0x8)
	char                                                         pad0x10_JO7MU[0x10];                               // 0x3b8(0x10)
};


// Size 0x50 (Full Size[0x346e0] - InheritedSize[0x34690]
class IpConnection: public NetConnection
{
public:
	char                                                         pad0x50_6RLHD[0x50];                               // 0x34690(0x50)
};


// Size 0x38 (Full Size[0x400] - InheritedSize[0x3c8]
class PartyBeaconHost: public OnlineBeaconHostObject
{
public:
	class PartyBeaconState*                                      State;                                             // 0x3c8(0x8)
	char                                                         pad0x28_UVDLA[0x28];                               // 0x3d0(0x28)
	float                                                        SessionTimeoutSecs;                                // 0x3f8(0x4)
	float                                                        TravelSessionTimeoutSecs;                          // 0x3fc(0x4)
};


// Size 0x28 (Full Size[0x3f0] - InheritedSize[0x3c8]
class OnlineBeaconClient: public OnlineBeacon
{
public:
	class OnlineBeaconHostObject*                                BeaconOwner;                                       // 0x3c8(0x8)
	class NetConnection*                                         BeaconConnection;                                  // 0x3d0(0x8)
	char                                                         ConnectionState;                                   // 0x3d8(0x1)
	char                                                         pad0x17_KTPBE[0x17];                               // 0x3d9(0x17)
};


// Size 0xb8 (Full Size[0x480] - InheritedSize[0x3c8]
class OnlineBeaconHost: public OnlineBeacon
{
public:
	int                                                          ListenPort;                                        // 0x3c8(0x4)
	char                                                         pad0x4_JJMXL[0x4];                                 // 0x3cc(0x4)
	TArray<class OnlineBeaconClient*>                            ClientActors;                                      // 0x3d0(0x10)
	char                                                         pad0xa0_P2HB0[0xa0];                               // 0x3e0(0xa0)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class AchievementWriteCallbackProxy: public OnlineBlueprintCallProxyBase
{
public:
	char                                                         pad0x58_QUMKV[0x58];                               // 0x28(0x58)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class DestroySessionCallbackProxy: public OnlineBlueprintCallProxyBase
{
public:
	char                                                         pad0x40_N7YHD[0x40];                               // 0x28(0x40)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class EndTurnCallbackProxy: public OnlineBlueprintCallProxyBase
{
public:
	char                                                         pad0x48_YL9ES[0x48];                               // 0x28(0x48)
};


// Size 0x0 (Full Size[0x3c8] - InheritedSize[0x3c8]
class TestBeaconHost: public OnlineBeaconHostObject
{
public:
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class EndMatchCallbackProxy: public OnlineBlueprintCallProxyBase
{
public:
	char                                                         pad0x50_Y1F0V[0x50];                               // 0x28(0x50)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class QuitMatchCallbackProxy: public OnlineBlueprintCallProxyBase
{
public:
	char                                                         pad0x48_UT10F[0x48];                               // 0x28(0x48)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class FindTurnBasedMatchCallbackProxy: public OnlineBlueprintCallProxyBase
{
public:
	char                                                         pad0x60_KK0TD[0x60];                               // 0x28(0x60)
};


// Size 0x130 (Full Size[0x158] - InheritedSize[0x28]
class JoinSessionCallbackProxy: public OnlineBlueprintCallProxyBase
{
public:
	char                                                         pad0x130_ZMCRK[0x130];                             // 0x28(0x130)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class AchievementQueryCallbackProxy: public OnlineBlueprintCallProxyBase
{
public:
	char                                                         pad0x38_F5U4W[0x38];                               // 0x28(0x38)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class ConnectionCallbackProxy: public OnlineBlueprintCallProxyBase
{
public:
	char                                                         pad0x40_BNLBO[0x40];                               // 0x28(0x40)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class CreateSessionCallbackProxy: public OnlineBlueprintCallProxyBase
{
public:
	char                                                         pad0x58_MOLBT[0x58];                               // 0x28(0x58)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class FindSessionsCallbackProxy: public OnlineBlueprintCallProxyBase
{
public:
	char                                                         pad0x60_7R0CQ[0x60];                               // 0x28(0x60)
};


// Size 0x0 (Full Size[0x3f0] - InheritedSize[0x3f0]
class TestBeaconClient: public OnlineBeaconClient
{
public:
};


// Size 0x58 (Full Size[0x448] - InheritedSize[0x3f0]
class PartyBeaconClient: public OnlineBeaconClient
{
public:
	char                                                         pad0x10_LAXR9[0x10];                               // 0x3f0(0x10)
	struct FString                                               DestSessionId;                                     // 0x400(0x10)
	struct PartyReservation                                      PendingReservation;                                // 0x410(0x30)
	char                                                         RequestType;                                       // 0x440(0x1)
	bool                                                         bPendingReservationSent;                           // 0x441(0x1)
	bool                                                         bCancelReservation;                                // 0x442(0x1)
	char                                                         pad0x5_RM264[0x5];                                 // 0x443(0x5)
};


