// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x18
class BP_OutpostCrate_bld_shop_wood_box_03_a_C: public StorageContainer
{
public:
	Class ReplenishableComponent*                                Replenishable;                                     // 0x4c8(0x8)
	Class IslandTelemetrySubjectComponent*                       IslandTelemetrySubject;                            // 0x4d0(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x4d8(0x8)
};


// Size 0x18
class BP_OutpostCrate_bld_shop_wood_box_02_a_C: public StorageContainer
{
public:
	Class ReplenishableComponent*                                Replenishable;                                     // 0x4c8(0x8)
	Class IslandTelemetrySubjectComponent*                       IslandTelemetrySubject;                            // 0x4d0(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x4d8(0x8)
};


// Size 0x18
class BP_OutpostCrate_bld_shop_wood_box_01_a_C: public StorageContainer
{
public:
	Class ReplenishableComponent*                                Replenishable;                                     // 0x4c8(0x8)
	Class IslandTelemetrySubjectComponent*                       IslandTelemetrySubject;                            // 0x4d0(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x4d8(0x8)
};


}