#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x30
struct HeatUpOverheatingTelemetryEvent
{
public:
	struct FString                                               HeatUpInstigatorName;                              // 0x0(0x10)
	struct Guid                                                  BootyId;                                           // 0x10(0x10)
	float                                                        HeatUpByNumber;                                    // 0x20(0x4)
	float                                                        CurrentOverheatingSum;                             // 0x24(0x4)
	char                                                         HeatUpReason;                                      // 0x28(0x1)
	char                                                         pad0x7_F8VNL[0x7];                                 // 0x29(0x7)
};


// Size 0x8
struct OverheatingDamageTableEntry
{
public:
	char                                                         Reason;                                            // 0x0(0x1)
	char                                                         pad0x3_WCJJW[0x3];                                 // 0x1(0x3)
	float                                                        TimeToAdd;                                         // 0x4(0x4)
};


// Size 0x30
struct CooldownOverheatingTelemetryEvent
{
public:
	struct FString                                               CooldownInstigatorActorName;                       // 0x0(0x10)
	struct Guid                                                  BootyId;                                           // 0x10(0x10)
	float                                                        CooldownByNumber;                                  // 0x20(0x4)
	float                                                        CurrentOverheatingSum;                             // 0x24(0x4)
	char                                                         CooldownReason;                                    // 0x28(0x1)
	char                                                         pad0x7_P1MG0[0x7];                                 // 0x29(0x7)
};


