#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x1
struct PetDroppedTelemetryEvent
{
public:
	char                                                         pad0x1_CVTQ6[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct WieldablePetFoodSourceEntry
{
public:
	class Actor*                                                 FoodSourceActor;                                   // 0x0(0x8)
	float                                                        TimeUntilConsumption;                              // 0x8(0x4)
	char                                                         pad0x4_FCO0X[0x4];                                 // 0xc(0x4)
};


// Size 0x1
struct EventPetPerchSpotEnabledStateChanged
{
public:
	char                                                         pad0x1_5FDGQ[0x1];                                 // 0x0(0x1)
};


// Size 0x14
struct PetReactedToFoodTelemetryEvent
{
public:
	struct Guid                                                  FeedingInteractionId;                              // 0x0(0x10)
	char                                                         FeedingReaction;                                   // 0x10(0x1)
	char                                                         pad0x3_KKWJ0[0x3];                                 // 0x11(0x3)
};


// Size 0x1
struct EventPetUGCBlockStateChanged
{
public:
	bool                                                         IsPetUGCBlocked;                                   // 0x0(0x1)
};


// Size 0x14
struct EventPetReactedToFood
{
public:
	char                                                         pad0x10_11W2U[0x10];                               // 0x0(0x10)
	char                                                         ReactionType;                                      // 0x10(0x1)
	char                                                         pad0x3_0X1UW[0x3];                                 // 0x11(0x3)
};


// Size 0x8
struct EventPetInfoAssigned
{
public:
	class ItemInfo*                                              PetInfo;                                           // 0x0(0x8)
};


// Size 0x8
struct HangoutSpotId
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
};


// Size 0x8
struct EventPetOwnerAssigned
{
public:
	class Actor*                                                 Owner;                                             // 0x0(0x8)
};


// Size 0x50
struct EventHangoutSpotMadeUnavailable
{
public:
	char                                                         pad0x50_5TJNZ[0x50];                               // 0x0(0x50)
};


// Size 0x40
struct PetDespawnActionStateParams
{
public:
	float                                                        TakeOffHeight;                                     // 0x0(0x4)
	float                                                        TakeOffTime;                                       // 0x4(0x4)
	float                                                        TotalGhostShaderTime;                              // 0x8(0x4)
	float                                                        TimeToTriggerVFX;                                  // 0xc(0x4)
	class Object*                                                DespawnVFX;                                        // 0x10(0x8)
	struct LinearColor                                           DespawnVFXColour;                                  // 0x18(0x10)
	class WwiseEvent*                                            DespawnSFX;                                        // 0x28(0x8)
	class WwiseEvent*                                            StopDespawnSFX;                                    // 0x30(0x8)
	float                                                        TotalDespawningTime;                               // 0x38(0x4)
	char                                                         pad0x4_KZJUM[0x4];                                 // 0x3c(0x4)
};


// Size 0x10
struct EventPetCustomisationReady
{
public:
	char                                                         pad0x10_R1UQE[0x10];                               // 0x0(0x10)
};


// Size 0x8
struct EventPetDismissed
{
public:
	class Actor*                                                 DismissingActor;                                   // 0x0(0x8)
};


// Size 0x8
struct EventPetLeftHangout
{
public:
	class Actor*                                                 Pet;                                               // 0x0(0x8)
};


// Size 0x20
struct PetRelationship
{
public:
	class PetItemInfo*                                           PetInfo;                                           // 0x0(0x8)
	char                                                         pad0x18_E8A0J[0x18];                               // 0x8(0x18)
};


// Size 0x10
struct EventPetSpawnedForShip
{
public:
	class Pawn*                                                  LinkedPet;                                         // 0x0(0x8)
	class Actor*                                                 LinkedShip;                                        // 0x8(0x8)
};


// Size 0x1
struct EventPetSadnessEnd
{
public:
	char                                                         pad0x1_VM2U8[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct PetFeedingAnimationData
{
public:
	char                                                         AnimationState;                                    // 0x0(0x1)
	char                                                         pad0x3_3IXSA[0x3];                                 // 0x1(0x3)
	float                                                        AnimationTimeout;                                  // 0x4(0x4)
};


// Size 0x20
struct PetRefusedFoodTelemetryEvent
{
public:
	struct FString                                               TryingToFeedPlayerId;                              // 0x0(0x10)
	struct Guid                                                  FeedingInteractionId;                              // 0x10(0x10)
};


// Size 0x1
struct EventWieldablePetPendingDrop
{
public:
	char                                                         DropRequestReason;                                 // 0x0(0x1)
};


// Size 0x40
struct PetSpawnActionStateParams
{
public:
	float                                                        LandingHeight;                                     // 0x0(0x4)
	float                                                        LandingTime;                                       // 0x4(0x4)
	float                                                        TotalGhostShaderTime;                              // 0x8(0x4)
	float                                                        TimeToTriggerVFX;                                  // 0xc(0x4)
	class Object*                                                SpawnVFX;                                          // 0x10(0x8)
	struct LinearColor                                           SpawnVFXColour;                                    // 0x18(0x10)
	class WwiseEvent*                                            SpawnSFX;                                          // 0x28(0x8)
	class WwiseEvent*                                            StopSpawnSFX;                                      // 0x30(0x8)
	float                                                        TotalSpawningTime;                                 // 0x38(0x4)
	char                                                         pad0x4_21VPZ[0x4];                                 // 0x3c(0x4)
};


// Size 0x2
struct EventPetEnteredHangout
{
public:
	char                                                         pad0x2_E40SI[0x2];                                 // 0x0(0x2)
};


// Size 0x8
struct WieldablePetDropTimeout
{
public:
	char                                                         RequestReason;                                     // 0x0(0x1)
	char                                                         pad0x3_0I05A[0x3];                                 // 0x1(0x3)
	float                                                        DropDelay;                                         // 0x4(0x4)
};


// Size 0x20
struct EventPetFed
{
public:
	char                                                         pad0x10_2G2PP[0x10];                               // 0x0(0x10)
	class Actor*                                                 FedWithActor;                                      // 0x10(0x8)
	class Actor*                                                 FeedingActor;                                      // 0x18(0x8)
};


// Size 0x18
struct PetReactedTelemetryEvent
{
public:
	struct FString                                               ReactId;                                           // 0x0(0x10)
	char                                                         AnimationState;                                    // 0x10(0x1)
	char                                                         pad0x7_YM61R[0x7];                                 // 0x11(0x7)
};


// Size 0x20
struct PetNotFedTelemetryEvent
{
public:
	struct FString                                               IgnoringPlayerId;                                  // 0x0(0x10)
	struct Guid                                                  FeedingInteractionId;                              // 0x10(0x10)
};


// Size 0x10
struct EventPetReactRequest
{
public:
	class Actor*                                                 ReactSource;                                       // 0x0(0x8)
	struct FName                                                 ReactId;                                           // 0x8(0x8)
};


// Size 0x28
struct WieldablePetPutOnPerchTelemetryEvent
{
public:
	struct FString                                               HangoutSpotName;                                   // 0x0(0x10)
	struct FString                                               WieldingActorTelemetrySubjectId;                   // 0x18(0x10)
};


// Size 0x18
struct EventPetNotFed
{
public:
	char                                                         pad0x10_T3LG4[0x10];                               // 0x0(0x10)
	class Actor*                                                 FeedingActor;                                      // 0x10(0x8)
};


// Size 0x20
struct EventWieldablePetPutOnPerch
{
public:
	class Actor*                                                 Pet;                                               // 0x0(0x8)
	struct FName                                                 HangoutSpotName;                                   // 0x8(0x8)
	char                                                         pad0x10_2LCXJ[0x10];                               // 0x10(0x10)
};


// Size 0x20
struct PetTurnToFaceData
{
public:
	struct Quat                                                  EndRotation;                                       // 0x0(0x10)
	float                                                        RotationTime;                                      // 0x10(0x4)
	char                                                         pad0xc_2ROTD[0xc];                                 // 0x14(0xc)
};


// Size 0x1
struct EventWieldablePetHungerStateUpdated
{
public:
	char                                                         NewState;                                          // 0x0(0x1)
};


// Size 0x30
struct PetFedTelemetryEvent
{
public:
	struct FString                                               FedWithItemId;                                     // 0x0(0x10)
	struct FString                                               FeedingPlayerId;                                   // 0x10(0x10)
	struct Guid                                                  FeedingInteractionId;                              // 0x20(0x10)
};


// Size 0x38
struct PetListingTypeEntry
{
public:
	struct StringAssetReference                                  PetPartsCategory;                                  // 0x0(0x10)
	struct StringClassReference                                  PetType;                                           // 0x10(0x10)
	struct FName                                                 FeatureToggleName;                                 // 0x20(0x8)
	struct FString                                               PetListingName;                                    // 0x28(0x10)
};


// Size 0x28
struct PetCustomisation
{
public:
	struct FString                                               DefaultPetName;                                    // 0x0(0x10)
	struct FString                                               PetName;                                           // 0x10(0x10)
	struct AIPartId                                              PetPartId;                                         // 0x20(0x8)
};


// Size 0x1
struct DismissPetNotificationEvent
{
public:
	char                                                         pad0x1_0I7B3[0x1];                                 // 0x0(0x1)
};


// Size 0x3
struct PetDangerHearingThreatResponse
{
public:
	char                                                         Type;                                              // 0x0(0x1)
	char                                                         IgnoredTarget;                                     // 0x1(0x1)
	bool                                                         InvertIgnoredTarget;                               // 0x2(0x1)
};


// Size 0xb8
struct PetHangoutSpotParams
{
public:
	class UClass*                                                PetType;                                           // 0x0(0x8)
	struct FloatRange                                            HangoutTime;                                       // 0x8(0x10)
	struct WeightedPetAnimationSelector                          AnimationSelector;                                 // 0x18(0xa0)
};


// Size 0x38
struct PetsServiceParams
{
public:
	char                                                         pad0x8_LEQ4T[0x8];                                 // 0x0(0x8)
	int                                                          MaxPetsInProximity;                                // 0x8(0x4)
	float                                                        RespawnRequestTimeout;                             // 0xc(0x4)
	float                                                        SpawnTimeDelay;                                    // 0x10(0x4)
	float                                                        MinPetProximityLifespan;                           // 0x14(0x4)
	float                                                        MaxPetProximityLifespan;                           // 0x18(0x4)
	float                                                        MinPetProximityRespawnDelay;                       // 0x1c(0x4)
	float                                                        MaxPetProximityRespawnDelay;                       // 0x20(0x4)
	float                                                        HeldPetDespawnDelay;                               // 0x24(0x4)
	TArray<class Class*>                                         IllegalShipsSizesForSpawn;                         // 0x28(0x10)
};


// Size 0x8
struct EventPetDropped
{
public:
	char                                                         pad0x8_KJ4TM[0x8];                                 // 0x0(0x8)
};


// Size 0x1
struct PetPickedUpTelemetryEvent
{
public:
	bool                                                         IsOnPerch;                                         // 0x0(0x1)
};


// Size 0xc
struct EventPerchHangoutSpotSetEnabledState
{
public:
	char                                                         pad0xc_41UD8[0xc];                                 // 0x0(0xc)
};


// Size 0x18
struct PetCustomiationOverrideMappingEntry
{
public:
	struct FString                                               Identifier;                                        // 0x0(0x10)
	class PetCustomisationOverrideDataAsset*                     OverrideAsset;                                     // 0x10(0x8)
};


// Size 0x10
struct EventPetReactCancellation
{
public:
	class Actor*                                                 ReactSource;                                       // 0x0(0x8)
	struct FName                                                 ReactId;                                           // 0x8(0x8)
};


// Size 0x50
struct EventHangoutSpotMadeAvailable
{
public:
	char                                                         pad0x50_IFRMK[0x50];                               // 0x0(0x50)
};


// Size 0x8
struct PetBaseTelemetryFragmentInput
{
public:
	char                                                         pad0x8_TPGJW[0x8];                                 // 0x0(0x8)
};


// Size 0x18
struct EventPetRefusedFood
{
public:
	char                                                         pad0x10_J3Q45[0x10];                               // 0x0(0x10)
	class Actor*                                                 FeedingActor;                                      // 0x10(0x8)
};


// Size 0x8
struct WieldablePetHungerAnimationData
{
public:
	char                                                         AnimState;                                         // 0x0(0x1)
	char                                                         pad0x3_ST1U0[0x3];                                 // 0x1(0x3)
	float                                                        AnimTimeout;                                       // 0x4(0x4)
};


// Size 0xd8
struct ReactStateMapping
{
public:
	struct FName                                                 AnimationID;                                       // 0x0(0x8)
	bool                                                         CanTimeout;                                        // 0x8(0x1)
	char                                                         pad0x3_UU2BV[0x3];                                 // 0x9(0x3)
	float                                                        AnimationTimeout;                                  // 0xc(0x4)
	struct WeightedPetAnimationSelector                          PetStateSelector;                                  // 0x10(0xa0)
	float                                                        AnimationChance;                                   // 0xb0(0x4)
	struct FloatRange                                            AnimationDelay;                                    // 0xb4(0x10)
	char                                                         pad0x4_WMKYR[0x4];                                 // 0xc4(0x4)
	TArray<class Class*>                                         IgnoringStrategies;                                // 0xc8(0x10)
};


// Size 0x1
struct EventPetSadnessBegin
{
public:
	char                                                         pad0x1_OLOAI[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct PetDismissedTelemetryEvent
{
public:
	char                                                         pad0x1_3BJDO[0x1];                                 // 0x0(0x1)
};


// Size 0xc
struct EventPetPickedUp
{
public:
	bool                                                         IsOnPerch;                                         // 0x0(0x1)
	char                                                         pad0x3_KB9O7[0x3];                                 // 0x1(0x3)
	char                                                         pad0x8_T7EGY[0x8];                                 // 0x4(0x8)
};


// Size 0xc
struct EventPetReactBegun
{
public:
	struct FName                                                 ReactId;                                           // 0x0(0x8)
	char                                                         ReactState;                                        // 0x8(0x1)
	char                                                         pad0x3_YOQKQ[0x3];                                 // 0x9(0x3)
};


// Size 0x10
struct EventPetFoodBase
{
public:
	struct Guid                                                  FeedingInteractionId;                              // 0x0(0x10)
};


// Size 0x8
struct RespawnPetEvent
{
public:
	class Actor*                                                 PetOwner;                                          // 0x0(0x8)
};


// Size 0x30
struct PetBaseTelemetryFragment
{
public:
	struct FString                                               OwnerId;                                           // 0x0(0x10)
	struct FString                                               PetPartId;                                         // 0x10(0x10)
	char                                                         CurrentPetRepresentation;                          // 0x20(0x1)
	char                                                         pad0x3_GVXJH[0x3];                                 // 0x21(0x3)
	struct Vector                                                PetLocation;                                       // 0x24(0xc)
};


// Size 0x8
struct PetControllerSetTickOrderEvent
{
public:
	class Actor*                                                 Actor;                                             // 0x0(0x8)
};


// Size 0x48
struct PetSpawnActionStateConstructionInfo
{
public:
	char                                                         pad0x48_GJOAV[0x48];                               // 0x0(0x48)
};


// Size 0x8
struct EventPetEndPlay
{
public:
	class Pawn*                                                  LinkedPet;                                         // 0x0(0x8)
};


// Size 0x1
struct EventPetCustomisationComplete
{
public:
	char                                                         pad0x1_DYUV0[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventNewPetThreatDetected
{
public:
	char                                                         pad0x1_M39PE[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct PetDangerHearingThreat
{
public:
	struct FName                                                 SoundTag;                                          // 0x0(0x8)
	float                                                        TimeBeforeForgotten;                               // 0x8(0x4)
	char                                                         pad0x4_K2GJI[0x4];                                 // 0xc(0x4)
	TArray<struct PetDangerHearingThreatResponse>                Responses;                                         // 0x10(0x10)
};


// Size 0x38
struct PetFeedingParams
{
public:
	struct PetFeedingAnimationData                               EatingAnimData;                                    // 0x0(0x8)
	struct PetFeedingAnimationData                               FedAnimData;                                       // 0x8(0x8)
	struct PetFeedingAnimationData                               NotFedAnimData;                                    // 0x10(0x8)
	struct PetFeedingAnimationData                               SickAnimData;                                      // 0x18(0x8)
	struct PetFeedingAnimationData                               RefusalAnimData;                                   // 0x20(0x8)
	float                                                        TimeToStartEating;                                 // 0x28(0x4)
	float                                                        TimeUntilGivingUp;                                 // 0x2c(0x4)
	float                                                        DistToleranceSquared;                              // 0x30(0x4)
	float                                                        RotationTolerance;                                 // 0x34(0x4)
};


// Size 0x28
struct HangoutSpotParams
{
public:
	struct FName                                                 HangoutSpotName;                                   // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	char                                                         pad0x4_VF6EV[0x4];                                 // 0xc(0x4)
	TArray<struct PetHangoutSpotParams>                          PetParams;                                         // 0x10(0x10)
	struct FName                                                 FeatureName;                                       // 0x20(0x8)
};


// Size 0x80
struct HangoutSpotPosition
{
public:
	struct HangoutSpotId                                         Id;                                                // 0x0(0x8)
	char                                                         pad0x8_2O19P[0x8];                                 // 0x8(0x8)
	struct Transform                                             Transform;                                         // 0x10(0x30)
	char                                                         RotationMode;                                      // 0x40(0x1)
	char                                                         ShipDeck;                                          // 0x41(0x1)
	char                                                         pad0x6_987P7[0x6];                                 // 0x42(0x6)
	class Pawn*                                                  Occupier;                                          // 0x48(0x8)
	char                                                         pad0x10_707T5[0x10];                               // 0x50(0x10)
	bool                                                         IsPerch;                                           // 0x60(0x1)
	bool                                                         NeedOverrideInteractionPoint;                      // 0x61(0x1)
	char                                                         pad0x2_4KU9U[0x2];                                 // 0x62(0x2)
	struct Vector                                                OverrideInteractionPointPosition;                  // 0x64(0xc)
	bool                                                         BlockPetEmoteReactions;                            // 0x70(0x1)
	bool                                                         IgnorePickupFromHangoutTooltipDisplayOffset;       // 0x71(0x1)
	char                                                         pad0xe_IWD08[0xe];                                 // 0x72(0xe)
};


