#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Pets_Structs.h"


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class PetsSettings: public Object
{
public:
	struct StringAssetReference                                  PetHangoutSpotsDataAsset;                          // 0x28(0x10)
	struct StringAssetReference                                  PetListingDataAsset;                               // 0x38(0x10)
	struct StringAssetReference                                  PetsServiceParamsDataAsset;                        // 0x48(0x10)
	struct StringAssetReference                                  PetSpawnDefinitionsDataAsset;                      // 0x58(0x10)
	TArray<char>                                                 ExcludedStatesForRoamingAssetGeneration;           // 0x68(0x10)
};


// Size 0xb0 (Full Size[0x168] - InheritedSize[0xb8]
class WieldablePetHungerComponent: public ActorComponent
{
public:
	class WieldablePetHungerDataAsset*                           HungerData;                                        // 0xb8(0x8)
	char                                                         pad0x28_QBKAW[0x28];                               // 0xc0(0x28)
	TArray<struct OverlapResult>                                 CachedOverlappingActors;                           // 0xe8(0x10)
	TArray<struct WieldablePetFoodSourceEntry>                   ActiveFoodSources;                                 // 0xf8(0x10)
	TArray<struct WieldablePetFoodSourceEntry>                   FoodSourcesToRemove;                               // 0x108(0x10)
	char                                                         pad0x50_YT5EQ[0x50];                               // 0x118(0x50)
};


// Size 0x20 (Full Size[0x80] - InheritedSize[0x60]
class BTTask_PetWaitForAnimationRoamingState: public BTTaskNode
{
public:
	TArray<char>                                                 SuccessRoamingStates;                              // 0x60(0x10)
	TArray<char>                                                 FailRoamingStates;                                 // 0x70(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetPartCustomisationInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class EnvQueryContext_AverageThreatPositionFromBlackboard: public EnvQueryContext_PositionFromBlackboard
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetMovementModifierSettingsInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x88] - InheritedSize[0x88]
class BTTask_ChangeHangoutAnimation: public BTTask_BlackboardBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetMemoryInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x68] - InheritedSize[0x68]
class BTDecorator_PetFoodSourceAvailable: public BTDecorator_BaseConditional
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class PetCustomisationOverrideDataAsset: public DataAsset
{
public:
	class UClass*                                                AnimationOverrideId;                               // 0x28(0x8)
	class WwiseEvent*                                            FiredFromActorSFX;                                 // 0x30(0x8)
	struct FString                                               DebugMenuName;                                     // 0x38(0x10)
};


// Size 0x0 (Full Size[0x460] - InheritedSize[0x460]
class AIPetsOnDemandSpawner: public AISpawner
{
public:
};


// Size 0x1f0 (Full Size[0x2a8] - InheritedSize[0xb8]
class PetHangoutSpotSelectorComponent: public ActorComponent
{
public:
	class PetHangoutSpotComponent*                               HangoutSpotPositionComponent;                      // 0xb8(0x8)
	class PetHangoutSpotsDataAsset*                              HangoutParamsDataAsset;                            // 0xc0(0x8)
	char                                                         pad0x70_RJPFQ[0x70];                               // 0xc8(0x70)
	class UClass*                                                PetType_Cached;                                    // 0x138(0x8)
	char                                                         pad0x168_24RPN[0x168];                             // 0x140(0x168)
};


// Size 0x0 (Full Size[0x88] - InheritedSize[0x88]
class BTTask_SelectFoodSource: public BTTask_BlackboardBase
{
public:
};


// Size 0x0 (Full Size[0x68] - InheritedSize[0x68]
class BTDecorator_IsOccupiedHangoutSpotStillAvailable: public BTDecorator_BaseConditional
{
public:
};


// Size 0x308 (Full Size[0x330] - InheritedSize[0x28]
class PetsService: public Object
{
public:
	char                                                         pad0x60_82XDW[0x60];                               // 0x28(0x60)
	class AIPetsOnDemandSpawner*                                 Spawner;                                           // 0x88(0x8)
	char                                                         pad0x18_380GK[0x18];                               // 0x90(0x18)
	struct PetsServiceParams                                     PetsServiceParams;                                 // 0xa8(0x38)
	TArray<class Actor*>                                         OwnersToRemove;                                    // 0xe0(0x10)
	TArray<class Actor*>                                         OwnersToRequestDespawn;                            // 0xf0(0x10)
	TArray<class Pawn*>                                          MovingPetsOnIslands;                               // 0x100(0x10)
	TArray<class Pawn*>                                          MovingPetsOnShips;                                 // 0x110(0x10)
	TArray<class Actor*>                                         ScratchArray;                                      // 0x120(0x10)
	char                                                         pad0x1a8_TPLKL[0x1a8];                             // 0x130(0x1a8)
	class PetHangoutSpotsDataAsset*                              PetHangoutDataAsset;                               // 0x2d8(0x8)
	char                                                         pad0x50_98UZP[0x50];                               // 0x2e0(0x50)
};


// Size 0x10 (Full Size[0x310] - InheritedSize[0x300]
class WieldablePetAnimNotifyWwiseEmitterComponent: public AnimNotifyWwiseEmitterComponent
{
public:
	char                                                         pad0x10_KEN42[0x10];                               // 0x300(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ReactAIStrategyId: public AIStrategyId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetIdleMovementInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0x98] - InheritedSize[0x90]
class BTTask_RotatePetToFaceBBEntryWithTime: public BTTask_RotateToFaceBBEntry
{
public:
	float                                                        Delay;                                             // 0x90(0x4)
	float                                                        RotationTime;                                      // 0x94(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetUGCNameInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class PetFeedingDataAsset: public DataAsset
{
public:
	struct PetFeedingParams                                      PetFeedingParams;                                  // 0x28(0x38)
};


// Size 0xd8 (Full Size[0x190] - InheritedSize[0xb8]
class PetDangerComponent: public ActorComponent
{
public:
	class PetDangerDataAsset*                                    DangerDataAsset;                                   // 0xb8(0x8)
	char                                                         pad0xd0_7CR6S[0xd0];                               // 0xc0(0xd0)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetOwnerIdentityInterface: public Interface
{
public:
};


// Size 0x150 (Full Size[0x940] - InheritedSize[0x7f0]
class WieldablePet: public SkeletalMeshWieldableItem
{
public:
	char                                                         pad0x38_U4IJG[0x38];                               // 0x7f0(0x38)
	float                                                        ThirdPersonScalingModifier;                        // 0x828(0x4)
	char                                                         pad0x4_IM96Z[0x4];                                 // 0x82c(0x4)
	class WieldablePetComponent*                                 WieldablePetComponent;                             // 0x830(0x8)
	class AIPartsRetrievalComponent*                             AIPartsRetrievalComponent;                         // 0x838(0x8)
	class PetPartCustomisationComponent*                         PetPartCustomisationComponent;                     // 0x840(0x8)
	class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitterComponent;                   // 0x848(0x8)
	class WaterExposureComponent*                                WaterExposureComponent;                            // 0x850(0x8)
	class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x858(0x8)
	class PickupableComponent*                                   PickupableComponent;                               // 0x860(0x8)
	class WieldableInteractableComponent*                        WieldableInteractableComponent;                    // 0x868(0x8)
	class CleanlinessComponent*                                  CleanlinessComponent;                              // 0x870(0x8)
	class LightWeightStatusEffectManagerComponent*               LightWeightStatusEffectManagerComponent;           // 0x878(0x8)
	class PetDitherComponent*                                    PetDitherComponent;                                // 0x880(0x8)
	class Actor*                                                 PetOwner;                                          // 0x888(0x8)
	class FeedingComponent*                                      FeedingComponent;                                  // 0x890(0x8)
	class PetSicknessComponent*                                  SicknessComponent;                                 // 0x898(0x8)
	class WieldablePetHungerComponent*                           HungerComponent;                                   // 0x8a0(0x8)
	class StarvingComponent*                                     StarvingComponent;                                 // 0x8a8(0x8)
	class PetTelemetryComponent*                                 TelemetryComponent;                                // 0x8b0(0x8)
	class AnimationDataStoreComponent*                           AnimationDataStoreComponent;                       // 0x8b8(0x8)
	bool                                                         SubmergedStrokingEnabled;                          // 0x8c0(0x1)
	char                                                         pad0x6f_F1TQS[0x6f];                               // 0x8c1(0x6f)
	char                                                         HungerReactAnimationState;                         // 0x930(0x1)
	char                                                         DropRequest;                                       // 0x931(0x1)
	char                                                         pad0xe_O3UXZ[0xe];                                 // 0x932(0xe)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class WieldablePetHungerDataAsset: public DataAsset
{
public:
	float                                                        TimeToStartEating;                                 // 0x28(0x4)
	float                                                        EdibleCheckRadius;                                 // 0x2c(0x4)
	struct WieldablePetHungerAnimationData                       EatingAnimData;                                    // 0x30(0x8)
	struct WieldablePetHungerAnimationData                       FedAnimData;                                       // 0x38(0x8)
	struct WieldablePetHungerAnimationData                       SickAnimData;                                      // 0x40(0x8)
	struct WieldablePetHungerAnimationData                       RefuseAnimData;                                    // 0x48(0x8)
	char                                                         CollisionChannel;                                  // 0x50(0x1)
	char                                                         pad0x7_PRCQP[0x7];                                 // 0x51(0x7)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ReactStateMappingsDataAsset: public DataAsset
{
public:
	TArray<struct ReactStateMapping>                             ReactMappings;                                     // 0x28(0x10)
};


// Size 0x18 (Full Size[0xd0] - InheritedSize[0xb8]
class CannonSquashComponent: public ActorComponent
{
public:
	char                                                         pad0x18_8VHA7[0x18];                               // 0xb8(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class HangoutSpotSelectionInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x78] - InheritedSize[0x68]
class BTDecorator_IsOccupyingHangoutSpotWithGivenId: public BTDecorator_BaseConditional
{
public:
	TArray<struct HangoutSpotId>                                 SuccessIds;                                        // 0x68(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetOwnerInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnvQueryContext_CurrentHangoutSpot: public EnvQueryContext
{
public:
};


// Size 0xa0 (Full Size[0x370] - InheritedSize[0x2d0]
class PetHangoutSpotComponent: public SceneComponent
{
public:
	TArray<struct HangoutSpotPosition>                           HangoutSpots;                                      // 0x2d0(0x10)
	bool                                                         HasLowerDeckFloodThreshold;                        // 0x2e0(0x1)
	char                                                         pad0x3_HAIJF[0x3];                                 // 0x2e1(0x3)
	float                                                        LowerDeckFloodThreshold;                           // 0x2e4(0x4)
	bool                                                         HasMiddleDeckFloodThreshold;                       // 0x2e8(0x1)
	char                                                         pad0x3_ACVX5[0x3];                                 // 0x2e9(0x3)
	float                                                        MiddleDeckFloodThreshold;                          // 0x2ec(0x4)
	float                                                        PerchInteractableHeightOffset;                     // 0x2f0(0x4)
	bool                                                         IsWorldHangout;                                    // 0x2f4(0x1)
	char                                                         pad0x23_HJTH7[0x23];                               // 0x2f5(0x23)
	TArray<class PetPerchComponent*>                             PetPerchComponents;                                // 0x318(0x10)
	char                                                         pad0x10_NJQXS[0x10];                               // 0x328(0x10)
	bool                                                         IsTopDeckBlocked;                                  // 0x338(0x1)
	bool                                                         IsOwnerSinking;                                    // 0x339(0x1)
	char                                                         pad0x1e_ALHH7[0x1e];                               // 0x33a(0x1e)
	class PetHangoutSpotsDataAsset*                              PetHangoutSpotsDataAsset;                          // 0x358(0x8)
	char                                                         pad0x10_8271P[0x10];                               // 0x360(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetHangoutInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetReactInterface: public Interface
{
public:
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class WieldablePetComponentDataAsset: public DataAsset
{
public:
	struct FloatRange                                            FriendlyTimeUntilEscape;                           // 0x28(0x10)
	struct FloatRange                                            NormalTimeUntilEscape;                             // 0x38(0x10)
	struct FloatRange                                            SubmergedTimeUntilEscape;                          // 0x48(0x10)
	float                                                        DamageToOwnerDropThreshold;                        // 0x58(0x4)
	char                                                         pad0x4_5S2TD[0x4];                                 // 0x5c(0x4)
	TArray<struct WieldablePetDropTimeout>                       DropTimeouts;                                      // 0x60(0x10)
};


// Size 0x10 (Full Size[0x70] - InheritedSize[0x60]
class BTTask_ReactToThreat: public BTTaskNode
{
public:
	char                                                         ReactAnimState;                                    // 0x60(0x1)
	bool                                                         ChangeAnimationAfterWaitTime;                      // 0x61(0x1)
	char                                                         pad0x2_RI8UF[0x2];                                 // 0x62(0x2)
	float                                                        ReactAnimTime;                                     // 0x64(0x4)
	char                                                         AfterReactAnimState;                               // 0x68(0x1)
	char                                                         pad0x7_5W7ZI[0x7];                                 // 0x69(0x7)
};


// Size 0x8 (Full Size[0x90] - InheritedSize[0x88]
class BTTask_DetachFromHangout: public BTTask_BlackboardBase
{
public:
	float                                                        TaskDuration;                                      // 0x88(0x4)
	char                                                         pad0x4_LFQMN[0x4];                                 // 0x8c(0x4)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class EnvQueryContext_FirstThreatPositionFromBlackboard: public EnvQueryContext_PositionFromBlackboard
{
public:
};


// Size 0x20 (Full Size[0xd8] - InheritedSize[0xb8]
class PetOwnerComponent: public ActorComponent
{
public:
	char                                                         pad0x18_UN8OK[0x18];                               // 0xb8(0x18)
	class ItemInfo*                                              PetInfo;                                           // 0xd0(0x8)
};


// Size 0xa0 (Full Size[0x158] - InheritedSize[0xb8]
class PetUGCNameComponent: public ActorComponent
{
public:
	char                                                         pad0x8_T8UEY[0x8];                                 // 0xb8(0x8)
	struct FString                                               DefaultPetName;                                    // 0xc0(0x10)
	struct FString                                               CustomisedPetName;                                 // 0xd0(0x10)
	char                                                         pad0x78_W4SFL[0x78];                               // 0xe0(0x78)
};


// Size 0x10 (Full Size[0x98] - InheritedSize[0x88]
class BTTask_SelectPetHangoutSpot: public BTTask_BlackboardBase
{
public:
	bool                                                         NeedForceId;                                       // 0x88(0x1)
	char                                                         pad0x3_BOD7O[0x3];                                 // 0x89(0x3)
	struct HangoutSpotId                                         ForcedId;                                          // 0x8c(0x8)
	char                                                         pad0x4_VTZDL[0x4];                                 // 0x94(0x4)
};


// Size 0x8 (Full Size[0x90] - InheritedSize[0x88]
class BTTask_AttachToHangout: public BTTask_BlackboardBase
{
public:
	float                                                        TaskDuration;                                      // 0x88(0x4)
	char                                                         pad0x4_7C0SK[0x4];                                 // 0x8c(0x4)
};


// Size 0x0 (Full Size[0x68] - InheritedSize[0x68]
class BTDecorator_IsPerchedInHangout: public BTDecorator_BaseConditional
{
public:
};


// Size 0x10 (Full Size[0x78] - InheritedSize[0x68]
class BTDecorator_PetRoamingAnimationStateActive: public BTDecorator_BaseConditional
{
public:
	TArray<char>                                                 MatchingStates;                                    // 0x68(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetSpawnOnShipInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class EnvQueryContext_SafePositionFromBlackboard: public EnvQueryContext_PositionFromBlackboard
{
public:
};


// Size 0x80 (Full Size[0x588] - InheritedSize[0x508]
class PetItemInfo: public NonStorableItemInfo
{
public:
	char                                                         pad0x20_R6ODT[0x20];                               // 0x508(0x20)
	class Actor*                                                 SpawnedForShip;                                    // 0x528(0x8)
	float                                                        DropTraceDistance;                                 // 0x530(0x4)
	float                                                        PointSearchRadius;                                 // 0x534(0x4)
	char                                                         DropChannel;                                       // 0x538(0x1)
	char                                                         pad0x7_YDT4Z[0x7];                                 // 0x539(0x7)
	class Actor*                                                 PetOwner;                                          // 0x540(0x8)
	struct PetCustomisation                                      PetCustomisation;                                  // 0x548(0x28)
	class PetUGCNameComponent*                                   PetUGCNameComponent;                               // 0x570(0x8)
	char                                                         pad0x10_BOFPF[0x10];                               // 0x578(0x10)
};


// Size 0x0 (Full Size[0x88] - InheritedSize[0x88]
class BTTask_StopOccupyingHangoutSpot: public BTTask_BlackboardBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetsServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x68] - InheritedSize[0x68]
class BTDecorator_IsForcingHangout: public BTDecorator_BaseConditional
{
public:
};


// Size 0x0 (Full Size[0x88] - InheritedSize[0x88]
class BTTask_NotifyForcedHangoutComplete: public BTTask_BlackboardBase
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class PetDangerDataAsset: public DataAsset
{
public:
	TArray<struct PetDangerHearingThreat>                        KnownHearingDangers;                               // 0x28(0x10)
	float                                                        MinChangeAverageThreatLocationToUpdate;            // 0x38(0x4)
	float                                                        FleeDistance;                                      // 0x3c(0x4)
	TArray<char>                                                 ResponsePriorities;                                // 0x40(0x10)
};


// Size 0x0 (Full Size[0x88] - InheritedSize[0x88]
class BTTask_GetTotalHangoutTime: public BTTask_BlackboardBase
{
public:
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class PetSpawnParamsDataAsset: public DataAsset
{
public:
	class UClass*                                                PetClassID;                                        // 0x28(0x8)
	class BehaviorTree*                                          TreeToRun;                                         // 0x30(0x8)
	class EnvQuery*                                              SpawnQueryForLand;                                 // 0x58(0x8)
	class EnvQuery*                                              SpawnQueryForShip;                                 // 0x60(0x8)
};


// Size 0x48 (Full Size[0x188] - InheritedSize[0x140]
class PetPerchComponent: public InteractableComponent
{
public:
	char                                                         pad0x18_8VKM5[0x18];                               // 0x140(0x18)
	TArray<class Class*>                                         AllowedPetTypes;                                   // 0x158(0x10)
	int                                                          HangoutSpotIndex;                                  // 0x168(0x4)
	struct FName                                                 HangoutSpotName;                                   // 0x16c(0x8)
	struct Vector                                                InteractionPointLocation;                          // 0x174(0xc)
	bool                                                         Enabled;                                           // 0x180(0x1)
	bool                                                         BlocksPetEmoteReactions;                           // 0x181(0x1)
	bool                                                         IgnorePickupFromHangoutTooltipDisplayOffset;       // 0x182(0x1)
	char                                                         pad0x5_48UTY[0x5];                                 // 0x183(0x5)
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class BTTask_ReactToOwner: public BTTaskNode
{
public:
	char                                                         pad0x8_9ZQ8T[0x8];                                 // 0x60(0x8)
};


// Size 0x78 (Full Size[0x100] - InheritedSize[0x88]
class BTTask_SelectWanderFlyStrategy: public BTTask_BlackboardBase
{
public:
	struct AIDataProviderFloatValue                              WanderRange;                                       // 0x88(0x30)
	struct AIDataProviderFloatValue                              LowFlyRange;                                       // 0xb8(0x30)
	class UClass*                                                WanderStrategy;                                    // 0xe8(0x8)
	class UClass*                                                LowFlyStrategy;                                    // 0xf0(0x8)
	class UClass*                                                HighFlyStrategy;                                   // 0xf8(0x8)
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class BTTask_SetDebugPetStateDescriptor: public BTTaskNode
{
public:
	char                                                         NewDescriptor;                                     // 0x60(0x1)
	char                                                         pad0x7_91IVD[0x7];                                 // 0x61(0x7)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class PetsServiceParamsDataAsset: public DataAsset
{
public:
	struct PetsServiceParams                                     Params;                                            // 0x28(0x38)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnvQueryContext_PerceivedFoodSources: public EnvQueryContext
{
public:
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class BTTask_EatFood: public BTTaskNode
{
public:
	class PetFeedingDataAsset*                                   FeedingDataAsset;                                  // 0x60(0x8)
};


// Size 0x10 (Full Size[0x130] - InheritedSize[0x120]
class PetDesc: public ItemDesc
{
public:
	class PetSpawnParamsDataAsset*                               PetSpawnParams;                                    // 0x120(0x8)
	class UClass*                                                PreviewPetClass;                                   // 0x128(0x8)
};


// Size 0x88 (Full Size[0x140] - InheritedSize[0xb8]
class WieldablePetComponent: public ActorComponent
{
public:
	class WieldablePetComponentDataAsset*                        WieldablePetComponentData;                         // 0xb8(0x8)
	char                                                         pad0x80_I6T3C[0x80];                               // 0xc0(0x80)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PetHangoutSpotsDataAsset: public DataAsset
{
public:
	TArray<struct HangoutSpotParams>                             HangoutSpotParams;                                 // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PetCustomisationOverrideMappingsDataAsset: public DataAsset
{
public:
	TArray<struct PetCustomiationOverrideMappingEntry>           MappingEntries;                                    // 0x28(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PetListingDataAsset: public DataAsset
{
public:
	TArray<struct PetListingTypeEntry>                           Entries;                                           // 0x28(0x10)
};


// Size 0xe8 (Full Size[0xaf0] - InheritedSize[0xa08]
class PetAIController: public AthenaAIController
{
public:
	char                                                         pad0x20_UJ11J[0x20];                               // 0xa08(0x20)
	TArray<struct AIStategyControllerMovementMod>                StrategyControllerMovementMods;                    // 0xa28(0x10)
	float                                                        DefaultControlRotationInterpSpeed;                 // 0xa38(0x4)
	char                                                         pad0x4_WZGKI[0x4];                                 // 0xa3c(0x4)
	class UClass*                                                DefaultStrategy;                                   // 0xa40(0x8)
	class ReactStateMappingsDataAsset*                           ReactMappings;                                     // 0xa48(0x8)
	char                                                         pad0x8_46QSJ[0x8];                                 // 0xa50(0x8)
	class PetHangoutSpotSelectorComponent*                       HangoutSpotSelectorComponent;                      // 0xa58(0x8)
	class PetHangoutSpotComponent*                               ForcedHangoutSpotComponent;                        // 0xa60(0x8)
	class BlackboardData*                                        DefaultBlackboardAsset;                            // 0xa68(0x8)
	class BehaviorTree*                                          DefaultTree;                                       // 0xa70(0x8)
	class BehaviorTree*                                          HangoutTree;                                       // 0xa78(0x8)
	class BehaviorTree*                                          IdleTree;                                          // 0xa80(0x8)
	float                                                        MaximumReactRange;                                 // 0xa88(0x4)
	char                                                         pad0x4_C3X8L[0x4];                                 // 0xa8c(0x4)
	class PetDangerComponent*                                    DangerComponent;                                   // 0xa90(0x8)
	float                                                        MinAgentHalfHeightPctOverride;                     // 0xa98(0x4)
	char                                                         pad0x54_7GDDE[0x54];                               // 0xa9c(0x54)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PetLifetimeInterface: public Interface
{
public:
};


