#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "PositionalVoice_Structs.h"


// Size 0x198 (Full Size[0x1c0] - InheritedSize[0x28]
class VoiceChatRenderer: public Object
{
public:
	class WwiseEvent*                                            AttenuatedVoiceEvent;                              // 0x38(0x8)
	class WwiseEvent*                                            AttenuatedAndSpatialisedVoiceEvent;                // 0x40(0x8)
	class WwiseEvent*                                            UnattenuatedVoiceEvent;                            // 0x48(0x8)
	int                                                          PreBufferInMilliseconds;                           // 0x50(0x4)
	int                                                          ChatRoutingListenerIndex;                          // 0x54(0x4)
	float                                                        EmitterHoldInSeconds;                              // 0x58(0x4)
	struct FString                                               UnattenuatedWwiseBusName;                          // 0x60(0x10)
	class RareAudioHardwareDeviceService*                        HardwareDeviceService;                             // 0x70(0x8)
};


