// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x70
struct PrioritisedPromptWithHandle
{
public:
	Struct PrioritisedPromptHandle                               PromptHandle;                                      // 0x0(0x10)
	Struct PrioritisedPrompt                                     Prompt;                                            // 0x10(0x60)
};


// Size 0x60
struct PrioritisedPrompt
{
public:
	bool                                                         UsePopupMessageDescForText;                        // 0x0(0x1)
	char                                                         pad0x7_V7PAE[0x7];                                 // 0x1(0x7)
	Struct FText                                                 Message;                                           // 0x8(0x38)
	Struct FString                                               Key;                                               // 0x40(0x10)
	Class PopUpMessageDesc*                                      PopUpMessageDesc;                                  // 0x50(0x8)
	byte                                                         BasePriority;                                      // 0x58(0x1)
	byte                                                         MenuNavigation;                                    // 0x59(0x1)
};


// Size 0x10
struct PrioritisedPromptHandle
{
public:
	Struct Guid                                                  Id;                                                // 0x0(0x10)
};


// Size 0x78
struct PromptEvaluation
{
public:
	byte                                                         PromptType;                                        // 0x0(0x1)
	char                                                         pad0x7_WD91X[0x7];                                 // 0x1(0x7)
	Struct PrioritisedPromptWithHandle                           Prompt;                                            // 0x8(0x70)
};


// Size 0x88
struct PermanentPromptNetworkEvent
{
public:
	Struct PrioritisedPromptWithHandle                           Prompt;                                            // 0x10(0x70)
	byte                                                         StartOrStop;                                       // 0x80(0x1)
};


// Size 0x8
struct PromptsCounterIncrementEvent
{
public:
	class                                                        AccessKey;                                         // 0x0(0x8)
};


// Size 0x1
struct PromptsServiceSetupEvent
{
public:
};


// Size 0x20
struct PlayerPromptTelemetryEvent
{
public:
	Struct FString                                               Message;                                           // 0x0(0x10)
	Struct FString                                               Key;                                               // 0x10(0x10)
};


}