#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x20
struct WwiseEmitter
{
public:
	char                                                         pad0x20_ZDZGQ[0x20];                               // 0x0(0x20)
};


// Size 0x38
struct StaticMeshWwiseEmitterData
{
public:
	class WwiseObjectPoolWrapper*                                Pool;                                              // 0x0(0x8)
	struct Vector                                                LocalOriginOffset;                                 // 0x8(0xc)
	char                                                         pad0x4_5B8WB[0x4];                                 // 0x14(0x4)
	TArray<class WwiseEvent*>                                    StartEvents;                                       // 0x18(0x10)
	TArray<class WwiseEvent*>                                    StopEvents;                                        // 0x28(0x10)
};


// Size 0xc
struct WWiseEmitterCreationRTPCSetting
{
public:
	struct FName                                                 RTPCName;                                          // 0x0(0x8)
	float                                                        RTPCValue;                                         // 0x8(0x4)
};


// Size 0x10
struct WWiseEmitterCreationSwitchSetting
{
public:
	struct FName                                                 SwitchGroup;                                       // 0x0(0x8)
	struct FName                                                 SwitchValue;                                       // 0x8(0x8)
};


// Size 0x20
struct StaticMeshAudioAssociation
{
public:
	TArray<struct StaticMeshWwiseEmitterData>                    PlaybackDataArray;                                 // 0x0(0x10)
	TArray<class StaticMesh*>                                    Meshes;                                            // 0x10(0x10)
};


// Size 0x68
struct StaticMeshComponentAudioAssociation
{
public:
	struct StaticMeshWwiseEmitterData                            PlaybackData;                                      // 0x0(0x38)
	struct Vector                                                EmitterPositionRelativeToComponentOrigin;          // 0x38(0xc)
	char                                                         pad0x24_67BOC[0x24];                               // 0x44(0x24)
};


// Size 0x28
struct WwiseEmitterCreationParams
{
public:
	class WwiseEvent*                                            Event;                                             // 0x0(0x8)
	TArray<struct WWiseEmitterCreationRTPCSetting>               RTPCs;                                             // 0x8(0x10)
	TArray<struct WWiseEmitterCreationSwitchSetting>             Switches;                                          // 0x18(0x10)
};


