#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "RareAudio_Structs.h"


// Size 0x48 (Full Size[0x80] - InheritedSize[0x38]
class AnimNotify_WwiseSound: public AnimNotify
{
public:
	class WwiseEvent*                                            WwiseEvent;                                        // 0x38(0x8)
	bool                                                         OwnedByWorld;                                      // 0x40(0x1)
	char                                                         pad0x3_KPL3P[0x3];                                 // 0x41(0x3)
	struct Vector                                                OwnedByWorldEmitterOffset;                         // 0x44(0xc)
	char                                                         PerspectiveRestriction;                            // 0x50(0x1)
	char                                                         pad0x7_FB0XM[0x7];                                 // 0x51(0x7)
	class WwiseObjectPoolWrapper*                                OwnedByWorldWisePoolToUse;                         // 0x58(0x8)
	char                                                         pad0x20_Z3H3A[0x20];                               // 0x60(0x20)
};


// Size 0x30 (Full Size[0x300] - InheritedSize[0x2d0]
class WwiseEmitterComponent: public SceneComponent
{
public:
	char                                                         pad0x8_T788A[0x8];                                 // 0x2d0(0x8)
	struct WwiseEmitter                                          Emitter;                                           // 0x2d8(0x20)
	class WwiseObjectPoolWrapper*                                WwiseObjectPoolWrapper;                            // 0x2f8(0x8)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class TritonAcousticMap: public Object
{
public:
	struct FString                                               TritonMapFilename;                                 // 0x28(0x10)
	float                                                        CustomCacheRatio;                                  // 0x38(0x4)
	char                                                         pad0x2c_PUT0N[0x2c];                               // 0x3c(0x2c)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class StaticMeshAudioDataAsset: public DataAsset
{
public:
	TArray<struct StaticMeshAudioAssociation>                    MeshToAudioAssociations;                           // 0x28(0x10)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class WwiseObjectPoolWrapper: public Object
{
public:
	struct FName                                                 PoolName;                                          // 0x28(0x8)
	int                                                          MaxResources;                                      // 0x30(0x4)
	bool                                                         DisableOcclusion;                                  // 0x34(0x1)
	bool                                                         DisableReverb;                                     // 0x35(0x1)
	bool                                                         ExcludeSilentProxiesFromPriority;                  // 0x36(0x1)
	char                                                         pad0x1_2Q1H4[0x1];                                 // 0x37(0x1)
	struct WwiseNativeEmitterPoolDensityParams                   PoolDensityParams;                                 // 0x38(0x28)
	char                                                         pad0x30_DF4W1[0x30];                               // 0x60(0x30)
};


// Size 0x0 (Full Size[0x3a0] - InheritedSize[0x3a0]
class AudioIslandStaticMeshAssociatorBase: public Actor
{
public:
};


// Size 0x60 (Full Size[0x90] - InheritedSize[0x30]
class AnimNotifyState_WwiseSound: public AnimNotifyState
{
public:
	class WwiseEvent*                                            WwiseEvent;                                        // 0x30(0x8)
	class WwiseEvent*                                            WwiseEventEnd;                                     // 0x38(0x8)
	char                                                         pad0x50_E98VK[0x50];                               // 0x40(0x50)
};


// Size 0x128 (Full Size[0x150] - InheritedSize[0x28]
class TritonService: public Object
{
public:
	char                                                         pad0x10_P515F[0x10];                               // 0x28(0x10)
	TArray<class TritonComponent*>                               RegisteredTritonComponents;                        // 0x38(0x10)
	char                                                         pad0xa8_209ZM[0xa8];                               // 0x48(0xa8)
	class TritonComponent*                                       CachedListenerInfo;                                // 0xf0(0x8)
	char                                                         pad0x58_U3KXD[0x58];                               // 0xf8(0x58)
};


// Size 0x10 (Full Size[0x2e0] - InheritedSize[0x2d0]
class TritonComponent: public SceneComponent
{
public:
	class TritonAcousticMap*                                     TritonMapAsset;                                    // 0x2d0(0x8)
	float                                                        TritonEffectRadius;                                // 0x2d8(0x4)
	char                                                         pad0x4_W3A4W[0x4];                                 // 0x2dc(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WwiseEmitterComponentBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x10 (Full Size[0x2e0] - InheritedSize[0x2d0]
class StaticMeshAudioEmittersComponent: public SceneComponent
{
public:
	TArray<struct StaticMeshComponentAudioAssociation>           InstanceAssociations;                              // 0x2d0(0x10)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class AudioSpaceDataAsset: public DataAsset
{
public:
	struct FName                                                 RtpcToUpdate;                                      // 0x28(0x8)
	class WwiseEvent*                                            AmbienceToStart;                                   // 0x30(0x8)
	class WwiseEvent*                                            AmbienceToStop;                                    // 0x38(0x8)
};


// Size 0x10 (Full Size[0x50] - InheritedSize[0x40]
class RareAudioHardwareDeviceService: public AudioHardwareDeviceService
{
public:
	char                                                         pad0x10_H5MS8[0x10];                               // 0x40(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WwiseEmitterBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x18 (Full Size[0x98] - InheritedSize[0x80]
class AnimNotify_WwiseSoundMeshSwitch: public AnimNotify_WwiseSound
{
public:
	struct FName                                                 SkeletalMeshSwitchGroup;                           // 0x80(0x8)
	TArray<struct AnimNotify_SoundSwitch>                        MeshOverrides;                                     // 0x88(0x10)
};


// Size 0x0 (Full Size[0x300] - InheritedSize[0x300]
class AnimNotifyWwiseEmitterComponent: public WwiseEmitterComponent
{
public:
};


