#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x70
struct RepairObjectActionStateConstructionInfo
{
public:
	struct NetSubObjectPtr                                       RepairableObject;                                  // 0x40(0x14)
	struct NetActorPtr                                           WieldedItem;                                       // 0x54(0x14)
	class UClass*                                                InputID;                                           // 0x68(0x8)
};


// Size 0x18
struct RepairableAuthoritiveRepairState
{
public:
	char                                                         RepairableState;                                   // 0x0(0x1)
	TArray<uintptr_t>                                            RepairingList;                                     // 0x8(0x10)
};


// Size 0x10
struct RepairableComponentRepairableStateChangedEvent
{
public:
	class ActorComponent*                                        RepairableComponent;                               // 0x0(0x8)
	char                                                         RepairableState;                                   // 0x8(0x1)
};


// Size 0x10
struct DamageZoneRepairableStateChangedEvent
{
public:
	class Actor*                                                 DamageZoneActor;                                   // 0x0(0x8)
	char                                                         RepairableState;                                   // 0x8(0x1)
};


// Size 0x20
struct ShipPartDamagePersistenceModel
{
public:
	TArray<char>                                                 ComponentRepairableStates;                         // 0x0(0x10)
	struct FString                                               Identifier;                                        // 0x10(0x10)
};


// Size 0xc
struct RepairableComponentMaxDamageLevelOverride
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	int                                                          MaxDamageLevel;                                    // 0x8(0x4)
};


// Size 0x28
struct EventRepairableObjectRepairEndedEvent
{
public:
	class Object*                                                Repairable;                                        // 0x0(0x8)
	struct Vector                                                Position;                                          // 0x8(0xc)
	class Actor*                                                 RepairerActor;                                     // 0x18(0x8)
	float                                                        RepairPercentage;                                  // 0x20(0x4)
	bool                                                         RepairCompleted;                                   // 0x24(0x1)
};


