// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20
struct ShipPartDamagePersistenceModel
{
public:
	TArray<Byte ComponentRepairableStates>                       ComponentRepairableStates;                         // 0x0(0x10)
	struct FString                                               Identifier;                                        // 0x10(0x10)
};


// Size 0x10
struct DamageZoneRepairableStateChangedEvent
{
public:
	class Actor*                                                 DamageZoneActor;                                   // 0x0(0x8)
	byte                                                         RepairableState;                                   // 0x8(0x1)
	char                                                         pad0x7_AOC90[0x7];                                 // 0x9(0x7)
};


// Size 0x10
struct RepairableComponentRepairableStateChangedEvent
{
public:
	class ActorComponent*                                        RepairableComponent;                               // 0x0(0x8)
	byte                                                         RepairableState;                                   // 0x8(0x1)
	char                                                         pad0x7_DONB8[0x7];                                 // 0x9(0x7)
};


// Size 0x28
struct EventRepairableObjectRepairEndedEvent
{
public:
	class Object*                                                Repairable;                                        // 0x0(0x8)
	struct Vector                                                Position;                                          // 0x8(0xc)
	char                                                         pad0x4_B7XXU[0x4];                                 // 0x14(0x4)
	class Actor*                                                 RepairerActor;                                     // 0x18(0x8)
	float                                                        RepairPercentage;                                  // 0x20(0x4)
	bool                                                         RepairCompleted;                                   // 0x24(0x1)
	char                                                         pad0x3_1ZMHL[0x3];                                 // 0x25(0x3)
};


// Size 0x1
struct EventRepairableObjectDestroyed
{
public:
	char                                                         pad0x1_R3OVS[0x1];                                 // 0x0(0x1)
};


// Size 0x8
struct EventPlayerUndoRepairEnd
{
public:
	char                                                         pad0x8_1II52[0x8];                                 // 0x0(0x8)
};


// Size 0x8
struct EventPlayerUndoRepairCompleted
{
public:
	char                                                         pad0x8_7GY7N[0x8];                                 // 0x0(0x8)
};


// Size 0x8
struct EventPlayerUndoRepairStart
{
public:
	char                                                         pad0x8_ESNNW[0x8];                                 // 0x0(0x8)
};


}