#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Retraction_Structs.h"


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RetractableProviderInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RetractableInterface: public Interface
{
public:
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class RetractorComponent: public ActorComponent
{
public:
	char                                                         pad0x48_N7BXF[0x48];                               // 0xc8(0x48)
	class SceneComponent*                                        RetractDestinationComponent;                       // 0x110(0x8)
	class SceneComponent*                                        RetractingComponent;                               // 0x118(0x8)
	char                                                         pad0x8_R63DO[0x8];                                 // 0x120(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RetractorInterface: public Interface
{
public:
};


// Size 0x48 (Full Size[0x110] - InheritedSize[0xc8]
class RetractableComponent: public ActorComponent
{
public:
	char                                                         pad0x38_M4KEU[0x38];                               // 0xc8(0x38)
	struct FName                                                 FeatureToggle;                                     // 0x100(0x8)
	struct RetractorOrientationAdjustmentFlags                   OrientationAdjustmentOnRetractFlags;               // 0x108(0x3)
	char                                                         RetractorBoxAxis;                                  // 0x10b(0x1)
	bool                                                         ShouldAutoReleaseOnSuccessfulRetract;              // 0x10c(0x1)
	bool                                                         MigrateAttachedWithRetractor;                      // 0x10d(0x1)
	bool                                                         WasSimulatingPhysicsBeforeRetract;                 // 0x10e(0x1)
	char                                                         pad0x1_17DWQ[0x1];                                 // 0x10f(0x1)
};


// Size 0x10 (Full Size[0x120] - InheritedSize[0x110]
class RetractableFloatingBarrelComponent: public RetractableComponent
{
public:
	char                                                         pad0x10_4X6ME[0x10];                               // 0x110(0x10)
};


