// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48 (Full Size[0x110] - InheritedSize[0xc8]
class RetractableComponent: public ActorComponent
{
public:
	char                                                         pad0x38_XTFFS[0x38];                               // 0xc8(0x38)
	struct FName                                                 FeatureToggle;                                     // 0x100(0x8)
	Struct RetractorOrientationAdjustmentFlags                   OrientationAdjustmentOnRetractFlags;               // 0x108(0x3)
	byte                                                         RetractorBoxAxis;                                  // 0x10b(0x1)
	bool                                                         ShouldAutoReleaseOnSuccessfulRetract;              // 0x10c(0x1)
	bool                                                         MigrateAttachedWithRetractor;                      // 0x10d(0x1)
	bool                                                         WasSimulatingPhysicsBeforeRetract;                 // 0x10e(0x1)
	char                                                         pad0x3_XLDX2[0x3];                                 // 0x10d(0x3)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RetractorInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RetractableInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RetractableProviderInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0x120] - InheritedSize[0x110]
class RetractableFloatingBarrelComponent: public RetractableComponent
{
public:
};


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class RetractorComponent: public ActorComponent
{
public:
	char                                                         pad0x48_Y1ZND[0x48];                               // 0xc8(0x48)
	Class SceneComponent*                                        RetractDestinationComponent;                       // 0x110(0x8)
	Class SceneComponent*                                        RetractingComponent;                               // 0x118(0x8)
	char                                                         pad0x18_J9A47[0x18];                               // 0x11e(0x18)
};


}