#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x20
struct ReviveEffectsValues
{
public:
	class MaterialInstanceDynamic*                               AstralCordPostProcessMID;                          // 0x0(0x8)
};


// Size 0x70
struct ReviveableActionStateConstructionInfo
{
public:
	class UClass*                                                ActionStateId;                                     // 0x30(0x8)
	struct DamageInstance                                        DamageInstance;                                    // 0x38(0x30)
	char                                                         CharacterDeathType;                                // 0x68(0x1)
	char                                                         CharacterType;                                     // 0x69(0x1)
};


// Size 0x38
struct ModeSpecificReviveSettings
{
public:
	char                                                         AssociatedPlaymode;                                // 0x0(0x1)
	float                                                        DeathCameraBlackFadeDelay;                         // 0x4(0x4)
	float                                                        DeathCameraBlackFadeDuration;                      // 0x8(0x4)
	float                                                        DeathCameraBlackFadeEventClientTimeout;            // 0xc(0x4)
	float                                                        DeathCameraBlackFadeEventServerTimeout;            // 0x10(0x4)
	float                                                        DelayBeforeEvaporate;                              // 0x14(0x4)
	float                                                        EvaporateDuration;                                 // 0x18(0x4)
	float                                                        DeathCameraStartDelay;                             // 0x1c(0x4)
	float                                                        ReviveWindowDuration;                              // 0x20(0x4)
	float                                                        GhostFadeDuration;                                 // 0x24(0x4)
	float                                                        AutoGiveUpDuration;                                // 0x28(0x4)
	class ReviveSettings*                                        CachedReviveSettings;                              // 0x30(0x8)
};


// Size 0x10
struct RevivedActionStateParams
{
public:
	float                                                        HealthRegained;                                    // 0x0(0x4)
	float                                                        ReviveDuration;                                    // 0x4(0x4)
	class WwiseEvent*                                            ReviveGaspAudio;                                   // 0x8(0x8)
};


// Size 0x60
struct RevivePlayerActionStateConstructionInfo
{
public:
	struct NetActorPtr                                           CharacterReviving;                                 // 0x30(0x14)
	struct NetSubObjectPtr                                       CharacterBeingRevived;                             // 0x44(0x14)
	class UClass*                                                InputID;                                           // 0x58(0x8)
};


// Size 0x1
struct PlayerRevivalTelemetryEvent
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
};


// Size 0x8
struct EventCharacterDiedDuringReviving
{
public:
	class Character*                                             OwningCharacter;                                   // 0x0(0x8)
};


// Size 0x40
struct RevivingWindowStart
{
public:
	struct DamageInstance                                        DamageInstance;                                    // 0x0(0x30)
	char                                                         CharacterDeathType;                                // 0x30(0x1)
	class Character*                                             RevivableCharacter;                                // 0x38(0x8)
};


// Size 0x1
struct EventRevivableRepresentationSpawnCompleted
{
public:
	bool                                                         FromSwimming;                                      // 0x0(0x1)
};


