#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Reviving_Structs.h"


// Size 0xa8 (Full Size[0xd0] - InheritedSize[0x28]
class ReviveEffectsDataAsset: public DataAsset
{
public:
	class MaterialParameterCollection*                           ReviveMaterialParameterCollection;                 // 0x28(0x8)
	struct FName                                                 AstralCordReviveInProgressMaterialCollectionScalarParameterName; // 0x30(0x8)
	struct FName                                                 AstralCordFadeMaterialCollectionScalarParameterName; // 0x38(0x8)
	struct FName                                                 AstralCordBorderMaterialCollectionScalarParameterName; // 0x40(0x8)
	class CurveFloat*                                            AstralCordBorderParamValueByAbsoluteTimeSinceDeath; // 0x48(0x8)
	class Material*                                              ReviveePostProcessMaterial;                        // 0x50(0x8)
	float                                                        GhostShaderGhostEffectInterpolationValue;          // 0x58(0x4)
	float                                                        ReviveSuccessfulEffectDuration;                    // 0x5c(0x4)
	class Object*                                                ReviveSuccessfulOneShotVFX;                        // 0x60(0x8)
	class Object*                                                ReviveSuccessfulOneShotVFX_Revivee;                // 0x68(0x8)
	class Object*                                                ReviveInProgressLoopingVFX;                        // 0x70(0x8)
	float                                                        AstralCordReviveInProgressInterpolationSpeed;      // 0x78(0x4)
	float                                                        AstralCordReviveNotInProgressInterpolationSpeed;   // 0x7c(0x4)
	class Object*                                                ContinuousBodyLoopingVFX;                          // 0x80(0x8)
	float                                                        AstralCordFadeInInterpolationSpeed;                // 0x88(0x4)
	float                                                        AstralCordFadeOutInterpolationSpeed;               // 0x8c(0x4)
	float                                                        DefaultAstralCordHeight;                           // 0x90(0x4)
	float                                                        AstralCordHeightOffsetFromTheGhost;                // 0x94(0x4)
	class Object*                                                DeadPlayerBodyEvaporatesOneShotVFX;                // 0x98(0x8)
	class WwiseEvent*                                            OtherPlayers_ReviveGhostAmbientStart;              // 0xa0(0x8)
	class WwiseEvent*                                            OtherPlayers_ReviveGhostAmbientStop;               // 0xa8(0x8)
	class WwiseEvent*                                            DeadPlayer_ReviveInProgressStart;                  // 0xb0(0x8)
	class WwiseEvent*                                            DeadPlayer_ReviveInProgressStop;                   // 0xb8(0x8)
	class WwiseEvent*                                            OtherPlayers_ReviveInProgressStart;                // 0xc0(0x8)
	class WwiseEvent*                                            OtherPlayers_ReviveInProgressStop;                 // 0xc8(0x8)
};


// Size 0x20 (Full Size[0x330] - InheritedSize[0x310]
class ReviveAudioComponent: public WwiseEmitterComponent
{
public:
	class ReviveEffectsDataAsset*                                ReviveEffectsDataAsset;                            // 0x310(0x8)
};


// Size 0x260 (Full Size[0x628] - InheritedSize[0x3c8]
class ReviveGhost: public Actor
{
public:
	TArray<class MaterialInstanceDynamic*>                       CorpseMaterials;                                   // 0x3d8(0x10)
	class SceneComponent*                                        Root;                                              // 0x3e8(0x8)
	class SkeletalMeshComponent*                                 MeshComponent;                                     // 0x3f0(0x8)
	class SceneComponent*                                        AstralCordContainer;                               // 0x3f8(0x8)
	class AnimationDataStoreComponent*                           AnimationDataStoreComponent;                       // 0x400(0x8)
	class PostProcessComponent*                                  PostProcessComponent;                              // 0x408(0x8)
	class DitherComponent*                                       DitherComponent;                                   // 0x410(0x8)
	class ReviveAudioComponent*                                  AudioComponent;                                    // 0x418(0x8)
	char                                                         RevivableOwnerNetRole;                             // 0x430(0x1)
	class GhostDataAsset*                                        ReviveGhostDataAsset;                              // 0x438(0x8)
	class ReviveEffectsDataAsset*                                ReviveEffectsDataAsset;                            // 0x440(0x8)
	struct ReviveEffectsValues                                   ReviveEffectsValues;                               // 0x448(0x20)
	struct ModeSpecificReviveSettings                            ReviveSettings;                                    // 0x468(0x38)
	class ParticleSystemComponent*                               ContinuousOnTheBodyLoopingVFX;                     // 0x5dc(0x8)
	class ParticleSystemComponent*                               ReviveInProgressLoopingVFX;                        // 0x5e4(0x8)
	TArray<class MaterialInstanceDynamic*>                       AstralCordDynamicMaterials;                        // 0x608(0x10)
	struct GhostPlayModeParameters                               GhostPlayModeSpecificParameters;                   // 0x618(0xc)
};


// Size 0x58 (Full Size[0x90] - InheritedSize[0x38]
class ReviveSettings: public DeveloperSettings
{
public:
	float                                                        HealthRegained;                                    // 0x38(0x4)
	float                                                        MaximumReviveDistance;                             // 0x3c(0x4)
	struct LinearColor                                           FadeColour;                                        // 0x40(0x10)
	bool                                                         ShouldFadeAudio;                                   // 0x50(0x1)
	float                                                        ServerWaitTimeBeforeFullyReviving;                 // 0x54(0x4)
	float                                                        ReviveTime;                                        // 0x58(0x4)
	float                                                        MaxRevertEvaporateDuration;                        // 0x5c(0x4)
	TArray<char>                                                 UnsupportedPlayModes;                              // 0x60(0x10)
	TArray<struct ModeSpecificReviveSettings>                    ModeSpecificSettings;                              // 0x70(0x10)
	float                                                        GiveUpHoldTime;                                    // 0x80(0x4)
	float                                                        GiveUpFadeDuration;                                // 0x84(0x4)
	float                                                        GiveUpEvaporateDuration;                           // 0x88(0x4)
};


// Size 0x50 (Full Size[0x188] - InheritedSize[0x138]
class DeathSelfInteractionComponent: public InteractableComponent
{
public:
	bool                                                         HasGivenUp;                                        // 0x140(0x1)
};


// Size 0x140 (Full Size[0x278] - InheritedSize[0x138]
class ReviveComponent: public InteractableComponent
{
public:
	class Character*                                             OwningCharacter;                                   // 0x148(0x8)
	class Actor*                                                 ReviveableRepresentationActor;                     // 0x150(0x8)
	char                                                         ReviveState;                                       // 0x158(0x1)
	char                                                         InteractionState;                                  // 0x159(0x1)
	class UClass*                                                ReviveableRepresentationClass;                     // 0x160(0x8)
	bool                                                         ReviveWindowIsOpen;                                // 0x174(0x1)
	struct Status                                                RevivableStatus;                                   // 0x248(0x18)
};


