// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x58 (Full Size[0x90] - InheritedSize[0x38]
class ReviveSettings: public DeveloperSettings
{
public:
	float                                                        HealthRegained;                                    // 0x38(0x4)
	float                                                        MaximumReviveDistance;                             // 0x3c(0x4)
	Struct LinearColor                                           FadeColour;                                        // 0x40(0x10)
	bool                                                         ShouldFadeAudio;                                   // 0x50(0x1)
	char                                                         pad0x3_SAJZA[0x3];                                 // 0x51(0x3)
	float                                                        ServerWaitTimeBeforeFullyReviving;                 // 0x54(0x4)
	float                                                        ReviveTime;                                        // 0x58(0x4)
	float                                                        MaxRevertEvaporateDuration;                        // 0x5c(0x4)
	TArray<Byte UnsupportedPlayModes>                            UnsupportedPlayModes;                              // 0x60(0x10)
	TArray<struct ModeSpecificSettings>                          ModeSpecificSettings;                              // 0x70(0x10)
	float                                                        GiveUpHoldTime;                                    // 0x80(0x4)
	float                                                        GiveUpFadeDuration;                                // 0x84(0x4)
	float                                                        GiveUpEvaporateDuration;                           // 0x88(0x4)
	char                                                         pad0x4_H3FC7[0x4];                                 // 0x8c(0x4)
};


// Size 0x50 (Full Size[0x178] - InheritedSize[0x128]
class DeathSelfInteractionComponent: public InteractableComponent
{
public:
	char                                                         pad0x8_SY9DD[0x8];                                 // 0x128(0x8)
	bool                                                         HasGivenUp;                                        // 0x130(0x1)
	char                                                         pad0x47_ROHML[0x47];                               // 0x131(0x47)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class PostReviveLocomotionActionStateId: public ActionStateId
{
public:
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class RevivableStatus: public StatusBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ReviveableActionStateId: public ActionStateId
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ReviveableCharacterInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ReviveableRepresentationInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0x330] - InheritedSize[0x310]
class ReviveAudioComponent: public WwiseEmitterComponent
{
public:
	Class ReviveEffectsDataAsset*                                ReviveEffectsDataAsset;                            // 0x310(0x8)
	char                                                         pad0x18_3T5M0[0x18];                               // 0x318(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ReviveInterface: public Interface
{
public:
};


// Size 0x140 (Full Size[0x268] - InheritedSize[0x128]
class ReviveComponent: public InteractableComponent
{
public:
	char                                                         pad0x10_2BWPP[0x10];                               // 0x128(0x10)
	Class Character*                                             OwningCharacter;                                   // 0x138(0x8)
	Class Actor*                                                 ReviveableRepresentationActor;                     // 0x140(0x8)
	byte                                                         ReviveState;                                       // 0x148(0x1)
	byte                                                         InteractionState;                                  // 0x149(0x1)
	char                                                         pad0x6_X5X31[0x6];                                 // 0x14a(0x6)
	class                                                        ReviveableRepresentationClass;                     // 0x150(0x8)
	char                                                         pad0xc_TF6YF[0xc];                                 // 0x158(0xc)
	bool                                                         ReviveWindowIsOpen;                                // 0x164(0x1)
	char                                                         pad0xd3_C0GRF[0xd3];                               // 0x165(0xd3)
	Struct Status                                                RevivableStatus;                                   // 0x238(0x18)
	char                                                         pad0x18_3JVQE[0x18];                               // 0x250(0x18)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class ReviveConditionalStatTrigger: public ConditionalStatsTriggerType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RevivedActionStateId: public ActionStateId
{
public:
};


// Size 0x98 (Full Size[0x160] - InheritedSize[0xc8]
class ReviveDebugComponent: public ActorComponent
{
public:
};


// Size 0xa8 (Full Size[0xd0] - InheritedSize[0x28]
class ReviveEffectsDataAsset: public DataAsset
{
public:
	Class MaterialParameterCollection*                           ReviveMaterialParameterCollection;                 // 0x28(0x8)
	struct FName                                                 AstralCordReviveInProgressMaterialCollectionScalarParameterName; // 0x30(0x8)
	struct FName                                                 AstralCordFadeMaterialCollectionScalarParameterName; // 0x38(0x8)
	struct FName                                                 AstralCordBorderMaterialCollectionScalarParameterName; // 0x40(0x8)
	Class CurveFloat*                                            AstralCordBorderParamValueByAbsoluteTimeSinceDeath; // 0x48(0x8)
	Class Material*                                              ReviveePostProcessMaterial;                        // 0x50(0x8)
	float                                                        GhostShaderGhostEffectInterpolationValue;          // 0x58(0x4)
	float                                                        ReviveSuccessfulEffectDuration;                    // 0x5c(0x4)
	Class Object*                                                ReviveSuccessfulOneShotVFX;                        // 0x60(0x8)
	Class Object*                                                ReviveSuccessfulOneShotVFX_Revivee;                // 0x68(0x8)
	Class Object*                                                ReviveInProgressLoopingVFX;                        // 0x70(0x8)
	float                                                        AstralCordReviveInProgressInterpolationSpeed;      // 0x78(0x4)
	float                                                        AstralCordReviveNotInProgressInterpolationSpeed;   // 0x7c(0x4)
	Class Object*                                                ContinuousBodyLoopingVFX;                          // 0x80(0x8)
	float                                                        AstralCordFadeInInterpolationSpeed;                // 0x88(0x4)
	float                                                        AstralCordFadeOutInterpolationSpeed;               // 0x8c(0x4)
	float                                                        DefaultAstralCordHeight;                           // 0x90(0x4)
	float                                                        AstralCordHeightOffsetFromTheGhost;                // 0x94(0x4)
	Class Object*                                                DeadPlayerBodyEvaporatesOneShotVFX;                // 0x98(0x8)
	Class WwiseEvent*                                            OtherPlayers_ReviveGhostAmbientStart;              // 0xa0(0x8)
	Class WwiseEvent*                                            OtherPlayers_ReviveGhostAmbientStop;               // 0xa8(0x8)
	Class WwiseEvent*                                            DeadPlayer_ReviveInProgressStart;                  // 0xb0(0x8)
	Class WwiseEvent*                                            DeadPlayer_ReviveInProgressStop;                   // 0xb8(0x8)
	Class WwiseEvent*                                            OtherPlayers_ReviveInProgressStart;                // 0xc0(0x8)
	Class WwiseEvent*                                            OtherPlayers_ReviveInProgressStop;                 // 0xc8(0x8)
};


// Size 0x260 (Full Size[0x628] - InheritedSize[0x3c8]
class ReviveGhost: public Actor
{
public:
	char                                                         pad0x10_HHENX[0x10];                               // 0x3c8(0x10)
	TArray<class MaterialInstanceDynamic*>                       CorpseMaterials;                                   // 0x3d8(0x10)
	Class SceneComponent*                                        Root;                                              // 0x3e8(0x8)
	Class SkeletalMeshComponent*                                 MeshComponent;                                     // 0x3f0(0x8)
	Class SceneComponent*                                        AstralCordContainer;                               // 0x3f8(0x8)
	Class AnimationDataStoreComponent*                           AnimationDataStoreComponent;                       // 0x400(0x8)
	Class PostProcessComponent*                                  PostProcessComponent;                              // 0x408(0x8)
	Class DitherComponent*                                       DitherComponent;                                   // 0x410(0x8)
	Class ReviveAudioComponent*                                  AudioComponent;                                    // 0x418(0x8)
	char                                                         pad0x10_HTUQX[0x10];                               // 0x420(0x10)
	byte                                                         RevivableOwnerNetRole;                             // 0x430(0x1)
	char                                                         pad0x7_IRQXA[0x7];                                 // 0x431(0x7)
	Class GhostDataAsset*                                        ReviveGhostDataAsset;                              // 0x438(0x8)
	Class ReviveEffectsDataAsset*                                ReviveEffectsDataAsset;                            // 0x440(0x8)
	Struct ReviveEffectsValues                                   ReviveEffectsValues;                               // 0x448(0x20)
	Struct ModeSpecificReviveSettings                            ReviveSettings;                                    // 0x468(0x38)
	char                                                         pad0x13c_AI0WP[0x13c];                             // 0x4a0(0x13c)
	TArray<class MaterialInstanceDynamic*>                       AstralCordDynamicMaterials;                        // 0x608(0x10)
	Struct GhostPlayModeParameters                               GhostPlayModeSpecificParameters;                   // 0x618(0xc)
	char                                                         pad0x4_YP0D4[0x4];                                 // 0x624(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RevivePlayerActionStateId: public ActionStateId
{
public:
};


}