#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x30
struct SandboxPerformanceConstraintActivityBaseTelemetryEvent
{
public:
	struct Guid                                                  SetRequestId;                                      // 0x0(0x10)
	TArray<struct Guid>                                          ActivityRequestIds;                                // 0x10(0x10)
	TArray<String>                                               ActivityTypes;                                     // 0x20(0x10)
};


// Size 0x10
struct SPCSetId
{
public:
	char                                                         pad0x10_K12NK[0x10];                               // 0x0(0x10)
};


// Size 0x10
struct SandboxPerformanceConstraintActivityActivationBudgetExceededTelemetryEvent
{
public:
	struct FString                                               Reason;                                            // 0x0(0x10)
};


// Size 0x40
struct SandboxPerformanceConstraintNullConsumerTelemetryEvent
{
public:
	char                                                         pad0x30_G7NVW[0x30];                               // 0x0(0x30)
	struct FString                                               Reason;                                            // 0x30(0x10)
};


// Size 0x58
struct SandboxPerformanceConstraintActivityUpdateTelemetryEvent
{
public:
	char                                                         pad0x30_JTAKC[0x30];                               // 0x0(0x30)
	struct Vector                                                NewLocation;                                       // 0x30(0xc)
	char                                                         pad0x4_OW3ES[0x4];                                 // 0x3c(0x4)
	struct DateTime                                              UpdateTime;                                        // 0x40(0x8)
	struct FString                                               ConstrainedDeactivationReason;                     // 0x48(0x10)
};


// Size 0x58
struct SandboxPerformanceConstraintActivityDeactivationTelemetryEvent
{
public:
	char                                                         pad0x30_8CFLE[0x30];                               // 0x0(0x30)
	struct FString                                               Reason;                                            // 0x30(0x10)
	bool                                                         DeactivatedWhileEngaged;                           // 0x40(0x1)
	char                                                         pad0x7_NQNNO[0x7];                                 // 0x41(0x7)
	struct DateTime                                              StartTime;                                         // 0x48(0x8)
	struct DateTime                                              EndTime;                                           // 0x50(0x8)
};


// Size 0x10
struct SandboxPerformanceConstraintActivityInstanceCount
{
public:
	class UClass*                                                ActivityType;                                      // 0x0(0x8)
	int                                                          NumInstances;                                      // 0x8(0x4)
	char                                                         pad0x4_6QBEE[0x4];                                 // 0xc(0x4)
};


// Size 0x18
struct SandboxPerformanceConstraintSharedResourceTelemetryData
{
public:
	struct FString                                               SharedResourceType;                                // 0x0(0x10)
	int                                                          NumConsumers;                                      // 0x10(0x4)
	char                                                         pad0x4_MGEG8[0x4];                                 // 0x14(0x4)
};


// Size 0x50
struct SandboxPerformanceConstraintActivityDeactivationFailureTelemetryEvent
{
public:
	char                                                         pad0x30_U6FXH[0x30];                               // 0x0(0x30)
	struct FString                                               Reason;                                            // 0x30(0x10)
	struct FString                                               DeactivationReason;                                // 0x40(0x10)
};


// Size 0x70
struct SandboxPerformanceConstraintActivityActivationTelemetryEvent
{
public:
	char                                                         pad0x60_GROHR[0x60];                               // 0x0(0x60)
	struct FString                                               ConstrainedDeactivationReason;                     // 0x60(0x10)
};


// Size 0x10
struct SandboxPerformanceConstraintSharedResourceContainer
{
public:
	float                                                        ServerMemoryUsageInMB;                             // 0x0(0x4)
	float                                                        ClientMemoryUsageInMB;                             // 0x4(0x4)
	float                                                        ServerCPUUsageInMs;                                // 0x8(0x4)
	float                                                        ClientCPUUsageInMs;                                // 0xc(0x4)
};


// Size 0x10
struct SandboxPerformanceConstraintInstancedResourceContainer
{
public:
	float                                                        ServerMemoryUsageInMB;                             // 0x0(0x4)
	float                                                        ClientMemoryUsageInMB;                             // 0x4(0x4)
	float                                                        ServerCPUUsageInMs;                                // 0x8(0x4)
	float                                                        ClientCPUUsageInMs;                                // 0xc(0x4)
};


// Size 0x70
struct SandboxPerformanceConstraintActivityActivationDeniedTelemetryEvent
{
public:
	char                                                         pad0x60_U2052[0x60];                               // 0x0(0x60)
	struct FString                                               Reason;                                            // 0x60(0x10)
};


// Size 0x10
struct SPCIdBase
{
public:
	struct Guid                                                  Id;                                                // 0x0(0x10)
};


// Size 0x10
struct SPCActivityId
{
public:
	char                                                         pad0x10_79HCB[0x10];                               // 0x0(0x10)
};


// Size 0x28
struct SandboxPerformanceConstraintActivityTelemetryData
{
public:
	struct FString                                               ActivityType;                                      // 0x0(0x10)
	struct Vector                                                Location;                                          // 0x10(0xc)
	char                                                         pad0x4_48NFQ[0x4];                                 // 0x1c(0x4)
	double                                                       LifetimeInSeconds;                                 // 0x20(0x8)
};


// Size 0x10
struct SandboxPerformanceConstraintActivityRequestContainer
{
public:
	TArray<struct SPCActivityId>                                 ActivityRequests;                                  // 0x0(0x10)
};


// Size 0x60
struct SandboxPerformanceConstraintActivityRequestBaseTelemetryEvent
{
public:
	char                                                         pad0x30_070QS[0x30];                               // 0x0(0x30)
	TArray<struct SandboxPerformanceConstraintSharedResourceContainer> SharedResourceUsages;                              // 0x30(0x10)
	TArray<struct SandboxPerformanceConstraintInstancedResourceContainer> InstancedResourceUsages;                           // 0x40(0x10)
	struct Vector                                                Location;                                          // 0x50(0xc)
	char                                                         pad0x4_MFXB7[0x4];                                 // 0x5c(0x4)
};


// Size 0x38
struct SandboxPerformanceConstraintActivityScore
{
public:
	class UClass*                                                ActivityType;                                      // 0x0(0x8)
	struct SPCSetId                                              SetId;                                             // 0x8(0x10)
	struct SPCActivityId                                         ActivityId;                                        // 0x18(0x10)
	struct DateTime                                              StartTime;                                         // 0x28(0x8)
	float                                                        Score;                                             // 0x30(0x4)
	char                                                         pad0x4_TAV1N[0x4];                                 // 0x34(0x4)
};


// Size 0x28
struct SandboxPerformanceConstraintResourceContainer
{
public:
	TArray<class Class*>                                         SharedResourceTypes;                               // 0x0(0x10)
	struct SandboxPerformanceConstraintInstancedResourceContainer InstancedResourceUsage;                            // 0x10(0x10)
	float                                                        Range;                                             // 0x20(0x4)
	bool                                                         IsAlwaysRelevant;                                  // 0x24(0x1)
	char                                                         pad0x3_IM34Q[0x3];                                 // 0x25(0x3)
};


// Size 0x30
struct SandboxPerformanceConstraintTelemetryFragment
{
public:
	TArray<struct SandboxPerformanceConstraintActivityTelemetryData> ActivitiesData;                                    // 0x0(0x10)
	TArray<struct SandboxPerformanceConstraintSharedResourceTelemetryData> SharedResourcesData;                               // 0x10(0x10)
	float                                                        ServerMemoryUsedInMB;                              // 0x20(0x4)
	float                                                        ServerCPUUsedInMs;                                 // 0x24(0x4)
	float                                                        ServerMemoryBudgetInMB;                            // 0x28(0x4)
	float                                                        ServerCPUBudgetInMs;                               // 0x2c(0x4)
};


// Size 0x38
struct SandboxPerformanceConstraintActivitySet
{
public:
	struct SPCSetId                                              SetId;                                             // 0x0(0x10)
	TArray<struct SPCActivityId>                                 ActivityIds;                                       // 0x10(0x10)
	struct DateTime                                              StartTime;                                         // 0x20(0x8)
	char                                                         pad0x10_WNAJW[0x10];                               // 0x28(0x10)
};


// Size 0x30
struct SandboxPerformanceConstraintActivityCustomResourceContainer
{
public:
	class UClass*                                                ActivityType;                                      // 0x0(0x8)
	struct SandboxPerformanceConstraintResourceContainer         ResourceUsage;                                     // 0x8(0x28)
};


// Size 0x78
struct SandboxPerformanceConstraintActivityConsumerData
{
public:
	struct SandboxPerformanceConstraintActivityCustomResourceContainer ActivityCustomResource;                            // 0x0(0x30)
	char                                                         pad0x10_1LOM6[0x10];                               // 0x30(0x10)
	struct SPCSetId                                              SetId;                                             // 0x40(0x10)
	struct SPCActivityId                                         ActivityId;                                        // 0x50(0x10)
	struct Vector                                                Location;                                          // 0x60(0xc)
	struct Vector                                                LastFullUpdateLocation;                            // 0x6c(0xc)
};


// Size 0x10
struct SandboxPerformanceConstraintActivityData
{
public:
	TArray<struct SandboxPerformanceConstraintActivityConsumerData> Consumers;                                         // 0x0(0x10)
};


