#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x28
struct SandboxPerformanceConstraintActivityTelemetryData
{
public:
	struct FString                                               ActivityType;                                      // 0x0(0x10)
	struct Vector                                                Location;                                          // 0x10(0xc)
	char                                                         pad0x4_9AAVK[0x4];                                 // 0x1c(0x4)
	double                                                       LifetimeInSeconds;                                 // 0x20(0x8)
};


// Size 0x10
struct SandboxPerformanceConstraintActivityContainer
{
public:
	TArray<class Class*>                                         Activities;                                        // 0x0(0x10)
};


// Size 0x30
struct SandboxPerformanceConstraintActivityBaseTelemetryEvent
{
public:
	struct Guid                                                  RequestID;                                         // 0x0(0x10)
	struct FString                                               ActivityType;                                      // 0x10(0x10)
	struct Vector                                                Location;                                          // 0x20(0xc)
	char                                                         pad0x4_MDKKQ[0x4];                                 // 0x2c(0x4)
};


// Size 0x10
struct SandboxPerformanceConstraintActivityRequestContainer
{
public:
	TArray<struct Guid>                                          ActivityRequests;                                  // 0x0(0x10)
};


// Size 0x40
struct SandboxPerformanceConstraintNullConsumerTelemetryEvent
{
public:
	char                                                         pad0x30_0YB7Z[0x30];                               // 0x0(0x30)
	struct FString                                               Info;                                              // 0x30(0x10)
};


// Size 0x30
struct SandboxPerformanceConstraintActivityActivationDeniedTelemetryEvent
{
public:
	char                                                         pad0x30_RUR5C[0x30];                               // 0x0(0x30)
};


// Size 0x50
struct SandboxPerformanceConstraintActivityDeactivationTelemetryEvent
{
public:
	char                                                         pad0x30_MFG6K[0x30];                               // 0x0(0x30)
	struct FString                                               Reason;                                            // 0x30(0x10)
	struct DateTime                                              StartTime;                                         // 0x40(0x8)
	struct DateTime                                              EndTime;                                           // 0x48(0x8)
};


// Size 0x20
struct SandboxPerformanceConstraintActivityScore
{
public:
	class UClass*                                                ActivityType;                                      // 0x0(0x8)
	struct Guid                                                  ActivityId;                                        // 0x8(0x10)
	float                                                        Score;                                             // 0x18(0x4)
	char                                                         pad0x4_YIS6N[0x4];                                 // 0x1c(0x4)
};


// Size 0x10
struct SandboxPerformanceConstraintActivityInstanceCount
{
public:
	class UClass*                                                ActivityType;                                      // 0x0(0x8)
	int                                                          NumInstances;                                      // 0x8(0x4)
	char                                                         pad0x4_DN5LX[0x4];                                 // 0xc(0x4)
};


// Size 0x18
struct SandboxPerformanceConstraintSharedResourceTelemetryData
{
public:
	struct FString                                               SharedResourceType;                                // 0x0(0x10)
	int                                                          NumConsumers;                                      // 0x10(0x4)
	char                                                         pad0x4_2544L[0x4];                                 // 0x14(0x4)
};


// Size 0x48
struct SandboxPerformanceConstraintActivityUpdateTelemetryEvent
{
public:
	char                                                         pad0x30_E9FVF[0x30];                               // 0x0(0x30)
	struct Vector                                                OldLocation;                                       // 0x30(0xc)
	char                                                         pad0x4_14J30[0x4];                                 // 0x3c(0x4)
	struct DateTime                                              UpdateTime;                                        // 0x40(0x8)
};


// Size 0x10
struct SandboxPerformanceConstraintInstancedResourceContainer
{
public:
	float                                                        ServerMemoryUsageInMB;                             // 0x0(0x4)
	float                                                        ClientMemoryUsageInMB;                             // 0x4(0x4)
	float                                                        ServerCPUUsageInMs;                                // 0x8(0x4)
	float                                                        ClientCPUUsageInMs;                                // 0xc(0x4)
};


// Size 0x10
struct SandboxPerformanceConstraintSharedResourceContainer
{
public:
	float                                                        ServerMemoryUsageInMB;                             // 0x0(0x4)
	float                                                        ClientMemoryUsageInMB;                             // 0x4(0x4)
	float                                                        ServerCPUUsageInMs;                                // 0x8(0x4)
	float                                                        ClientCPUUsageInMs;                                // 0xc(0x4)
};


// Size 0x30
struct SandboxPerformanceConstraintTelemetryFragment
{
public:
	TArray<struct SandboxPerformanceConstraintActivityTelemetryData> ActivitiesData;                                    // 0x0(0x10)
	TArray<struct SandboxPerformanceConstraintSharedResourceTelemetryData> SharedResourcesData;                               // 0x10(0x10)
	float                                                        ServerMemoryUsedInMB;                              // 0x20(0x4)
	float                                                        ServerCPUUsedInMs;                                 // 0x24(0x4)
	float                                                        ServerMemoryBudgetInMB;                            // 0x28(0x4)
	float                                                        ServerCPUBudgetInMs;                               // 0x2c(0x4)
};


// Size 0x20
struct SandboxPerformanceConstraintResourceContainer
{
public:
	TArray<class Class*>                                         SharedResourceTypes;                               // 0x0(0x10)
	struct SandboxPerformanceConstraintInstancedResourceContainer InstancedResourceUsage;                            // 0x10(0x10)
};


// Size 0x50
struct SandboxPerformanceConstraintActivityActivationTelemetryEvent
{
public:
	char                                                         pad0x30_GQZZ4[0x30];                               // 0x0(0x30)
	struct SandboxPerformanceConstraintSharedResourceContainer   SharedResourceUsage;                               // 0x30(0x10)
	struct SandboxPerformanceConstraintInstancedResourceContainer InstancedResourceUsage;                            // 0x40(0x10)
};


// Size 0x60
struct SandboxPerformanceConstraintActivityConsumerData
{
public:
	struct SandboxPerformanceConstraintResourceContainer         ResourceUsage;                                     // 0x0(0x20)
	char                                                         pad0x10_FX4AW[0x10];                               // 0x20(0x10)
	class UClass*                                                ActivityType;                                      // 0x30(0x8)
	struct Guid                                                  RequestID;                                         // 0x38(0x10)
	struct Vector                                                Location;                                          // 0x48(0xc)
	char                                                         pad0x4_O22FR[0x4];                                 // 0x54(0x4)
	struct DateTime                                              StartTime;                                         // 0x58(0x8)
};


// Size 0x10
struct SandboxPerformanceConstraintActivityData
{
public:
	TArray<struct SandboxPerformanceConstraintActivityConsumerData> Consumers;                                         // 0x0(0x10)
};


