#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x80
struct DeedProgressDesc
{
public:
	struct FString                                               Description;                                       // 0x0(0x10)
	struct FString                                               Icon;                                              // 0x10(0x10)
	struct                                                       NavigationDesc;                                    // 0x20(0x14)
	int                                                          ProgressValue;                                     // 0x34(0x4)
	int                                                          Threshold;                                         // 0x38(0x4)
	struct                                                       Audio;                                             // 0x40(0x40)
};


// Size 0x60
struct SeasonsChatNotificationEvent
{
public:
	struct                                                       SeasonsChatNotification;                           // 0x0(0x60)
};


// Size 0x14
struct NavigationDesc
{
public:
	char                                                         Action;                                            // 0x0(0x1)
	struct                                                       Id;                                                // 0x4(0x10)
};


// Size 0x68
struct SeasonIconPopupAsset
{
public:
	struct                                                       GlowIcon;                                          // 0x0(0x10)
	struct                                                       Icon;                                              // 0x10(0x10)
	struct FString                                               ToastSfxEventName;                                 // 0x20(0x10)
	struct FString                                               ToastEventName;                                    // 0x30(0x10)
	struct FString                                               ToastSwitchName;                                   // 0x40(0x10)
	struct FString                                               ToastSwitchValue;                                  // 0x50(0x10)
	float                                                        ToastHoldDuration;                                 // 0x60(0x4)
};


// Size 0x80
struct ShowDeedProgressEvent
{
public:
	struct                                                       DeedProgressDesc;                                  // 0x0(0x80)
};


// Size 0x60
struct SeasonsChatNotification
{
public:
	struct FString                                               IconUrl;                                           // 0x0(0x10)
	struct FString                                               Message;                                           // 0x10(0x10)
	struct                                                       Audio;                                             // 0x20(0x40)
};


// Size 0xa0
struct SeasonTextPopupAsset
{
public:
	struct                                                       GlowIcon;                                          // 0x0(0x10)
	struct                                                       Icon;                                              // 0x10(0x10)
	struct FText                                                 Message;                                           // 0x20(0x38)
	struct FString                                               ToastSfxEventName;                                 // 0x58(0x10)
	struct FString                                               ToastEventName;                                    // 0x68(0x10)
	struct FString                                               ToastSwitchName;                                   // 0x78(0x10)
	struct FString                                               ToastSwitchValue;                                  // 0x88(0x10)
	float                                                        ToastHoldDuration;                                 // 0x98(0x4)
};


// Size 0x18
struct EnableMoreButtonEvent
{
public:
	char                                                         MoreButtonSource;                                  // 0x0(0x1)
	struct                                                       Navigation;                                        // 0x4(0x14)
};


// Size 0x1
struct DisableMoreButtonEvent
{
public:
	char                                                         MoreButtonSource;                                  // 0x0(0x1)
};


// Size 0x8
struct SeasonProgressionUITelemetryFragmentInput
{
public:
	class PlayerController*                                      PlayerController;                                  // 0x0(0x8)
};


// Size 0xa0
struct SeasonsTextNotificationNetworkEvent
{
public:
	struct                                                       SeasonsTextNotification;                           // 0x18(0x88)
};


// Size 0x78
struct SeasonsChatNotificationNetworkEvent
{
public:
	struct                                                       SeasonsChatNotificationEvent;                      // 0x18(0x60)
};


// Size 0x80
struct SeasonGoalPopupAsset
{
public:
	struct FName                                                 Category;                                          // 0x0(0x8)
	struct                                                       GlowIcon;                                          // 0x8(0x10)
	struct                                                       Icon;                                              // 0x18(0x10)
	struct                                                       ChatIcon;                                          // 0x28(0x10)
	struct FString                                               ToastSfxEventName;                                 // 0x38(0x10)
	struct FString                                               ToastEventName;                                    // 0x48(0x10)
	struct FString                                               ToastSwitchName;                                   // 0x58(0x10)
	struct FString                                               ToastSwitchValue;                                  // 0x68(0x10)
	float                                                        ToastHoldDuration;                                 // 0x78(0x4)
};


// Size 0x18
struct SeasonProgressionUIEventTypeTelemetryFragment
{
public:
	struct FString                                               EventName;                                         // 0x0(0x10)
	int                                                          NumReceivedEvents;                                 // 0x10(0x4)
};


// Size 0x88
struct SeasonsTextNotification
{
public:
	struct                                                       IconUrl;                                           // 0x0(0x10)
	struct FText                                                 Message;                                           // 0x10(0x38)
	struct                                                       Audio;                                             // 0x48(0x40)
};


// Size 0x14
struct OpenSeasonsMenuEvent
{
public:
	char                                                         NavigationAction;                                  // 0x0(0x1)
	struct                                                       Id;                                                // 0x4(0x10)
};


// Size 0x68
struct SeasonNotificationContent
{
public:
	struct                                                       GlowIcon;                                          // 0x0(0x10)
	struct                                                       Icon;                                              // 0x10(0x10)
	struct FString                                               SfxEventName;                                      // 0x20(0x10)
	struct FString                                               EventName;                                         // 0x30(0x10)
	struct FString                                               SwitchName;                                        // 0x40(0x10)
	struct FString                                               SwitchValue;                                       // 0x50(0x10)
	float                                                        ToastHoldDuration;                                 // 0x60(0x4)
};


// Size 0xa0
struct SeasonsPopupEvent
{
public:
	TArray<struct Text>                                          Text;                                              // 0x0(0x10)
	TArray<String>                                               Images;                                            // 0x10(0x10)
	struct FString                                               Background;                                        // 0x20(0x10)
	struct                                                       Audio;                                             // 0x30(0x40)
	TArray<char>                                                 StyleModifiers;                                    // 0x70(0x10)
	int                                                          Rank;                                              // 0x80(0x4)
	struct                                                       NavigationDesc;                                    // 0x84(0x14)
	float                                                        HoldDuration;                                      // 0x98(0x4)
};


// Size 0x18
struct SeasonProgressionUITelemetryFragment
{
public:
	TArray<struct SeasonProgressionUIEventTypeTelemetryFragment> ReceivedEventsData;                                // 0x0(0x10)
	int                                                          TotalNumReceivedEvents;                            // 0x10(0x4)
};


