#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x88
struct SeasonsTextNotification
{
public:
	struct StringAssetReference                                  IconUrl;                                           // 0x0(0x10)
	struct FText                                                 Message;                                           // 0x10(0x38)
	struct GenericPopupAudioDescriptor                           Audio;                                             // 0x48(0x40)
};


// Size 0x1
struct DisableMoreButtonEvent
{
public:
	char                                                         MoreButtonSource;                                  // 0x0(0x1)
};


// Size 0x80
struct SeasonGoalPopupAsset
{
public:
	struct FName                                                 Category;                                          // 0x0(0x8)
	struct StringAssetReference                                  GlowIcon;                                          // 0x8(0x10)
	struct StringAssetReference                                  Icon;                                              // 0x18(0x10)
	struct StringAssetReference                                  ChatIcon;                                          // 0x28(0x10)
	struct FString                                               ToastSfxEventName;                                 // 0x38(0x10)
	struct FString                                               ToastEventName;                                    // 0x48(0x10)
	struct FString                                               ToastSwitchName;                                   // 0x58(0x10)
	struct FString                                               ToastSwitchValue;                                  // 0x68(0x10)
	float                                                        ToastHoldDuration;                                 // 0x78(0x4)
	char                                                         pad0x4_L21ZJ[0x4];                                 // 0x7c(0x4)
};


// Size 0x60
struct SeasonsChatNotification
{
public:
	struct FString                                               IconUrl;                                           // 0x0(0x10)
	struct FString                                               Message;                                           // 0x10(0x10)
	struct GenericPopupAudioDescriptor                           Audio;                                             // 0x20(0x40)
};


// Size 0x14
struct OpenSeasonsMenuEvent
{
public:
	char                                                         NavigationAction;                                  // 0x0(0x1)
	char                                                         pad0x3_G33EG[0x3];                                 // 0x1(0x3)
	struct Guid                                                  Id;                                                // 0x4(0x10)
};


// Size 0x14
struct NavigationDesc
{
public:
	char                                                         Action;                                            // 0x0(0x1)
	char                                                         pad0x3_ZLD3L[0x3];                                 // 0x1(0x3)
	struct Guid                                                  Id;                                                // 0x4(0x10)
};


// Size 0xa0
struct SeasonTextPopupAsset
{
public:
	struct StringAssetReference                                  GlowIcon;                                          // 0x0(0x10)
	struct StringAssetReference                                  Icon;                                              // 0x10(0x10)
	struct FText                                                 Message;                                           // 0x20(0x38)
	struct FString                                               ToastSfxEventName;                                 // 0x58(0x10)
	struct FString                                               ToastEventName;                                    // 0x68(0x10)
	struct FString                                               ToastSwitchName;                                   // 0x78(0x10)
	struct FString                                               ToastSwitchValue;                                  // 0x88(0x10)
	float                                                        ToastHoldDuration;                                 // 0x98(0x4)
	char                                                         pad0x4_KBL34[0x4];                                 // 0x9c(0x4)
};


// Size 0x68
struct SeasonIconPopupAsset
{
public:
	struct StringAssetReference                                  GlowIcon;                                          // 0x0(0x10)
	struct StringAssetReference                                  Icon;                                              // 0x10(0x10)
	struct FString                                               ToastSfxEventName;                                 // 0x20(0x10)
	struct FString                                               ToastEventName;                                    // 0x30(0x10)
	struct FString                                               ToastSwitchName;                                   // 0x40(0x10)
	struct FString                                               ToastSwitchValue;                                  // 0x50(0x10)
	float                                                        ToastHoldDuration;                                 // 0x60(0x4)
	char                                                         pad0x4_KJGYA[0x4];                                 // 0x64(0x4)
};


// Size 0x68
struct SeasonNotificationContent
{
public:
	struct StringAssetReference                                  GlowIcon;                                          // 0x0(0x10)
	struct StringAssetReference                                  Icon;                                              // 0x10(0x10)
	struct FString                                               SfxEventName;                                      // 0x20(0x10)
	struct FString                                               EventName;                                         // 0x30(0x10)
	struct FString                                               SwitchName;                                        // 0x40(0x10)
	struct FString                                               SwitchValue;                                       // 0x50(0x10)
	float                                                        ToastHoldDuration;                                 // 0x60(0x4)
	char                                                         pad0x4_F0AHM[0x4];                                 // 0x64(0x4)
};


// Size 0x8
struct SeasonProgressionUITelemetryFragmentInput
{
public:
	char                                                         pad0x8_OYEOV[0x8];                                 // 0x0(0x8)
};


// Size 0x18
struct SeasonProgressionUIEventTypeTelemetryFragment
{
public:
	struct FString                                               EventName;                                         // 0x0(0x10)
	int                                                          NumReceivedEvents;                                 // 0x10(0x4)
	char                                                         pad0x4_4UDQE[0x4];                                 // 0x14(0x4)
};


// Size 0x1
struct SeasonsDataRefreshEvent
{
public:
	char                                                         pad0x1_0MCCX[0x1];                                 // 0x0(0x1)
};


// Size 0x80
struct DeedProgressDesc
{
public:
	struct FString                                               Description;                                       // 0x0(0x10)
	struct FString                                               Icon;                                              // 0x10(0x10)
	struct NavigationDesc                                        NavigationDesc;                                    // 0x20(0x14)
	int                                                          ProgressValue;                                     // 0x34(0x4)
	int                                                          Threshold;                                         // 0x38(0x4)
	char                                                         pad0x4_91CKA[0x4];                                 // 0x3c(0x4)
	struct GenericPopupAudioDescriptor                           Audio;                                             // 0x40(0x40)
};


// Size 0xa0
struct SeasonsPopupEvent
{
public:
	TArray<struct Text>                                          Text;                                              // 0x0(0x10)
	TArray<String>                                               Images;                                            // 0x10(0x10)
	struct FString                                               Background;                                        // 0x20(0x10)
	struct GenericPopupAudioDescriptor                           Audio;                                             // 0x30(0x40)
	TArray<char>                                                 StyleModifiers;                                    // 0x70(0x10)
	int                                                          Rank;                                              // 0x80(0x4)
	struct NavigationDesc                                        NavigationDesc;                                    // 0x84(0x14)
	float                                                        HoldDuration;                                      // 0x98(0x4)
	char                                                         pad0x4_SIQXS[0x4];                                 // 0x9c(0x4)
};


// Size 0x18
struct SeasonProgressionUITelemetryFragment
{
public:
	TArray<struct SeasonProgressionUIEventTypeTelemetryFragment> ReceivedEventsData;                                // 0x0(0x10)
	int                                                          TotalNumReceivedEvents;                            // 0x10(0x4)
	char                                                         pad0x4_HFHA6[0x4];                                 // 0x14(0x4)
};


// Size 0xa0
struct SeasonsTextNotificationNetworkEvent
{
public:
	char                                                         pad0x18_40Y46[0x18];                               // 0x0(0x18)
	struct SeasonsTextNotification                               SeasonsTextNotification;                           // 0x18(0x88)
};


// Size 0x60
struct SeasonsChatNotificationEvent
{
public:
	struct SeasonsChatNotification                               SeasonsChatNotification;                           // 0x0(0x60)
};


// Size 0x18
struct EnableMoreButtonEvent
{
public:
	char                                                         MoreButtonSource;                                  // 0x0(0x1)
	char                                                         pad0x3_H2X6C[0x3];                                 // 0x1(0x3)
	struct NavigationDesc                                        Navigation;                                        // 0x4(0x14)
};


// Size 0x80
struct ShowDeedProgressEvent
{
public:
	struct DeedProgressDesc                                      DeedProgressDesc;                                  // 0x0(0x80)
};


// Size 0x78
struct SeasonsChatNotificationNetworkEvent
{
public:
	char                                                         pad0x18_NCYUY[0x18];                               // 0x0(0x18)
	struct SeasonsChatNotificationEvent                          SeasonsChatNotificationEvent;                      // 0x18(0x60)
};


