// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68
struct SeasonIconPopupAsset
{
public:
	struct StringAssetReference                                  GlowIcon;                                          // 0x0(0x10)
	struct StringAssetReference                                  Icon;                                              // 0x10(0x10)
	struct FString                                               ToastSfxEventName;                                 // 0x20(0x10)
	struct FString                                               ToastEventName;                                    // 0x30(0x10)
	struct FString                                               ToastSwitchName;                                   // 0x40(0x10)
	struct FString                                               ToastSwitchValue;                                  // 0x50(0x10)
	float                                                        ToastHoldDuration;                                 // 0x60(0x4)
	char                                                         pad0x4_CJ32R[0x4];                                 // 0x64(0x4)
};


// Size 0xa0
struct SeasonTextPopupAsset
{
public:
	struct StringAssetReference                                  GlowIcon;                                          // 0x0(0x10)
	struct StringAssetReference                                  Icon;                                              // 0x10(0x10)
	struct FText                                                 Message;                                           // 0x20(0x38)
	struct FString                                               ToastSfxEventName;                                 // 0x58(0x10)
	struct FString                                               ToastEventName;                                    // 0x68(0x10)
	struct FString                                               ToastSwitchName;                                   // 0x78(0x10)
	struct FString                                               ToastSwitchValue;                                  // 0x88(0x10)
	float                                                        ToastHoldDuration;                                 // 0x98(0x4)
	char                                                         pad0x4_Y2MK7[0x4];                                 // 0x9c(0x4)
};


// Size 0x80
struct SeasonGoalPopupAsset
{
public:
	struct FName                                                 Category;                                          // 0x0(0x8)
	struct StringAssetReference                                  GlowIcon;                                          // 0x8(0x10)
	struct StringAssetReference                                  Icon;                                              // 0x18(0x10)
	struct StringAssetReference                                  ChatIcon;                                          // 0x28(0x10)
	struct FString                                               ToastSfxEventName;                                 // 0x38(0x10)
	struct FString                                               ToastEventName;                                    // 0x48(0x10)
	struct FString                                               ToastSwitchName;                                   // 0x58(0x10)
	struct FString                                               ToastSwitchValue;                                  // 0x68(0x10)
	float                                                        ToastHoldDuration;                                 // 0x78(0x4)
	char                                                         pad0x4_UJ19W[0x4];                                 // 0x7c(0x4)
};


// Size 0x68
struct SeasonNotificationContent
{
public:
	struct StringAssetReference                                  GlowIcon;                                          // 0x0(0x10)
	struct StringAssetReference                                  Icon;                                              // 0x10(0x10)
	struct FString                                               SfxEventName;                                      // 0x20(0x10)
	struct FString                                               EventName;                                         // 0x30(0x10)
	struct FString                                               SwitchName;                                        // 0x40(0x10)
	struct FString                                               SwitchValue;                                       // 0x50(0x10)
	float                                                        ToastHoldDuration;                                 // 0x60(0x4)
	char                                                         pad0x4_QSIS1[0x4];                                 // 0x64(0x4)
};


// Size 0x80
struct DeedProgressDesc
{
public:
	struct FString                                               Description;                                       // 0x0(0x10)
	struct FString                                               Icon;                                              // 0x10(0x10)
	struct NavigationDesc                                        NavigationDesc;                                    // 0x20(0x14)
	int                                                          ProgressValue;                                     // 0x34(0x4)
	int                                                          Threshold;                                         // 0x38(0x4)
	char                                                         pad0x4_16GCA[0x4];                                 // 0x3c(0x4)
	struct GenericPopupAudioDescriptor                           Audio;                                             // 0x40(0x40)
};


// Size 0x14
struct NavigationDesc
{
public:
	byte                                                         Action;                                            // 0x0(0x1)
	char                                                         pad0x3_JUW7L[0x3];                                 // 0x1(0x3)
	struct Guid                                                  Id;                                                // 0x4(0x10)
};


// Size 0x88
struct SeasonsTextNotification
{
public:
	struct StringAssetReference                                  IconUrl;                                           // 0x0(0x10)
	struct FText                                                 Message;                                           // 0x10(0x38)
	struct GenericPopupAudioDescriptor                           Audio;                                             // 0x48(0x40)
};


// Size 0x60
struct SeasonsChatNotification
{
public:
	struct FString                                               IconUrl;                                           // 0x0(0x10)
	struct FString                                               Message;                                           // 0x10(0x10)
	struct GenericPopupAudioDescriptor                           Audio;                                             // 0x20(0x40)
};


// Size 0x1
struct SeasonsDataRefreshEvent
{
public:
	char                                                         pad0x1_LMUTW[0x1];                                 // 0x0(0x1)
};


// Size 0x14
struct OpenSeasonsMenuEvent
{
public:
	byte                                                         NavigationAction;                                  // 0x0(0x1)
	char                                                         pad0x3_F64VR[0x3];                                 // 0x1(0x3)
	struct Guid                                                  Id;                                                // 0x4(0x10)
};


// Size 0x1
struct DisableMoreButtonEvent
{
public:
	byte                                                         MoreButtonSource;                                  // 0x0(0x1)
};


// Size 0x18
struct EnableMoreButtonEvent
{
public:
	byte                                                         MoreButtonSource;                                  // 0x0(0x1)
	char                                                         pad0x3_2ULLJ[0x3];                                 // 0x1(0x3)
	struct NavigationDesc                                        Navigation;                                        // 0x4(0x14)
};


// Size 0x80
struct ShowDeedProgressEvent
{
public:
	struct DeedProgressDesc                                      DeedProgressDesc;                                  // 0x0(0x80)
};


// Size 0x98
struct SeasonsTextNotificationNetworkEvent
{
public:
	char                                                         pad0x10_ANI87[0x10];                               // 0x0(0x10)
	struct SeasonsTextNotification                               SeasonsTextNotification;                           // 0x10(0x88)
};


// Size 0x70
struct SeasonsChatNotificationNetworkEvent
{
public:
	char                                                         pad0x10_CNPDI[0x10];                               // 0x0(0x10)
	struct SeasonsChatNotificationEvent                          SeasonsChatNotificationEvent;                      // 0x10(0x60)
};


// Size 0x60
struct SeasonsChatNotificationEvent
{
public:
	struct SeasonsChatNotification                               SeasonsChatNotification;                           // 0x0(0x60)
};


// Size 0x8
struct SeasonProgressionUITelemetryFragmentInput
{
public:
	char                                                         pad0x8_GZHRS[0x8];                                 // 0x0(0x8)
};


// Size 0x18
struct SeasonProgressionUITelemetryFragment
{
public:
	TArray<struct SeasonProgressionUIEventTypeTelemetryFragment> ReceivedEventsData;                                // 0x0(0x10)
	int                                                          TotalNumReceivedEvents;                            // 0x10(0x4)
	char                                                         pad0x4_5Q9WN[0x4];                                 // 0x14(0x4)
};


// Size 0x18
struct SeasonProgressionUIEventTypeTelemetryFragment
{
public:
	struct FString                                               EventName;                                         // 0x0(0x10)
	int                                                          NumReceivedEvents;                                 // 0x10(0x4)
	char                                                         pad0x4_IUZ4Q[0x4];                                 // 0x14(0x4)
};


// Size 0xa0
struct SeasonsPopupEvent
{
public:
	TArray<struct FText>                                         Text;                                              // 0x0(0x10)
	TArray<Str Images>                                           Images;                                            // 0x10(0x10)
	struct FString                                               Background;                                        // 0x20(0x10)
	struct GenericPopupAudioDescriptor                           Audio;                                             // 0x30(0x40)
	TArray<Byte StyleModifiers>                                  StyleModifiers;                                    // 0x70(0x10)
	int                                                          Rank;                                              // 0x80(0x4)
	struct NavigationDesc                                        NavigationDesc;                                    // 0x84(0x14)
	float                                                        HoldDuration;                                      // 0x98(0x4)
	char                                                         pad0x4_GFMPZ[0x4];                                 // 0x9c(0x4)
};


}