#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x28
struct SerialisedNestedStruct
{
public:
	struct FString                                               String;                                            // 0x0(0x10)
	TArray<int>                                                  IntArray;                                          // 0x10(0x10)
	int                                                          Int;                                               // 0x20(0x4)
	float                                                        Float;                                             // 0x24(0x4)
};


// Size 0x60
struct SerialisedTestStruct
{
public:
	int                                                          Int;                                               // 0x0(0x4)
	float                                                        Float;                                             // 0x4(0x4)
	struct FString                                               String;                                            // 0x8(0x10)
	TArray<int>                                                  IntArray;                                          // 0x18(0x10)
	TArray<struct SerialisedNestedStruct>                        StructArray;                                       // 0x28(0x10)
	struct                                                       NestedStruct;                                      // 0x38(0x28)
};


