#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0xc
struct ServerMigrationSerialisationDetailsTestsUStruct
{
public:
	float                                                        FloatWithNoMarkup;                                 // 0x0(0x4)
	uint16                                                       UInt16WithMigrationMarkup;                         // 0x4(0x2)
	uint16                                                       UInt16WithNotReplicatedMarkup;                     // 0x6(0x2)
	uint16                                                       UInt16WithMigrationAndNotReplicatedMarkup;         // 0x8(0x2)
};


// Size 0x2
struct ClientSettings
{
public:
	bool                                                         FailToConnectToServer;                             // 0x0(0x1)
	bool                                                         PauseMigrationBeforeOwnershipTransfer;             // 0x1(0x1)
};


// Size 0x8
struct ServerSettings
{
public:
	bool                                                         FailToConnectToServer;                             // 0x0(0x1)
	bool                                                         RefuseMigrationStart;                              // 0x1(0x1)
	bool                                                         DisconnectServerConnectionDuringMigration;         // 0x2(0x1)
	int                                                          RefuseIncomingClientConnections;                   // 0x4(0x4)
};


