#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x28
struct ServerMatchmakingResultEvent
{
public:
	char                                                         pad0x28_EXQVF[0x28];                               // 0x0(0x28)
};


// Size 0x98
struct CrewSessionMatchmakingEndedTelemetryEvent
{
public:
	char                                                         pad0x10_9STR8[0x10];                               // 0x0(0x10)
	struct Guid                                                  NewCrewId;                                         // 0x10(0x10)
	struct Guid                                                  CrewMatchmakingAttemptId;                          // 0x20(0x10)
	struct FString                                               SessionType;                                       // 0x30(0x10)
	struct FString                                               MatchmakingHopper;                                 // 0x40(0x10)
	struct FString                                               MatchmakingType;                                   // 0x50(0x10)
	struct FString                                               MatchmakingResult;                                 // 0x60(0x10)
	struct FString                                               ErrorMessage;                                      // 0x70(0x10)
	TArray<int>                                                  CrewSegmentValues;                                 // 0x80(0x10)
	int                                                          CurrentCrewCount;                                  // 0x90(0x4)
	int                                                          TotalWaitTime;                                     // 0x94(0x4)
};


// Size 0x20
struct JupiterSessionJoinThroughServiceRequestModel
{
public:
	struct FString                                               OwningUserId;                                      // 0x0(0x10)
	struct FString                                               SessionTemplateName;                               // 0x10(0x10)
};


// Size 0x28
struct OnlineSessionMemberLostEvent
{
public:
	char                                                         pad0x28_T0CA8[0x28];                               // 0x0(0x28)
};


// Size 0x8
struct SessionLostEvent
{
public:
	char                                                         pad0x8_LBKNN[0x8];                                 // 0x0(0x8)
};


// Size 0x18
struct SessionTemplate
{
public:
	struct FString                                               TemplateName;                                      // 0x0(0x10)
	char                                                         SessionType;                                       // 0x10(0x1)
	char                                                         pad0x3_69GKB[0x3];                                 // 0x11(0x3)
	int                                                          MaxPlayers;                                        // 0x14(0x4)
};


// Size 0x70
struct CrewSessionMatchmakingStartedTelemetryEvent
{
public:
	char                                                         pad0x10_DPDK7[0x10];                               // 0x0(0x10)
	struct Guid                                                  CrewMatchmakingAttemptId;                          // 0x10(0x10)
	struct FString                                               SessionType;                                       // 0x20(0x10)
	struct FString                                               MatchmakingHopper;                                 // 0x30(0x10)
	struct FString                                               MatchmakingType;                                   // 0x40(0x10)
	TArray<int>                                                  CrewSegmentValues;                                 // 0x50(0x10)
	int                                                          CurrentCrewCount;                                  // 0x60(0x4)
	int                                                          EstimatedWaitTime;                                 // 0x64(0x4)
	int                                                          MaxWaitTime;                                       // 0x68(0x4)
	char                                                         pad0x4_PIB7W[0x4];                                 // 0x6c(0x4)
};


// Size 0x10
struct SessionInfoUpdateAvailableEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x28
struct CrewSessionMemberTelemetry
{
public:
	struct FString                                               UserId;                                            // 0x0(0x10)
	struct FString                                               StatusString;                                      // 0x10(0x10)
	bool                                                         IsSessionHost;                                     // 0x20(0x1)
	char                                                         pad0x7_AJCE4[0x7];                                 // 0x21(0x7)
};


// Size 0x20
struct CrewSessionQoSMeasurementTelemetry
{
public:
	struct FString                                               Location;                                          // 0x0(0x10)
	int                                                          NumReceivedPings;                                  // 0x14(0x4)
	int                                                          NumFailedPings;                                    // 0x18(0x4)
	char                                                         ResolveResult;                                     // 0x1c(0x1)
	bool                                                         LocationWasConsidered;                             // 0x1d(0x1)
	char                                                         pad0x2_84WDB[0x2];                                 // 0x1e(0x2)
};


// Size 0xb8
struct ServerMatchmakingPlayerServerAssignmentEvent
{
public:
	char                                                         pad0xb8_STICU[0xb8];                               // 0x0(0xb8)
};


// Size 0x20
struct SkadiSessionJoinThroughServiceRequestModel
{
public:
	struct FString                                               OwningUserId;                                      // 0x0(0x10)
	struct FString                                               SessionTemplateName;                               // 0x10(0x10)
};


// Size 0x90
struct ServerMatchmakingPlayerCrewAssignmentEvent
{
public:
	char                                                         pad0x90_GHM4C[0x90];                               // 0x0(0x90)
};


// Size 0xa8
struct ServerMatchmakingRequestEvent
{
public:
	char                                                         pad0xa8_94N7H[0xa8];                               // 0x0(0xa8)
};


// Size 0x38
struct CrewSessionTemplate
{
public:
	char                                                         pad0x18_C09J9[0x18];                               // 0x0(0x18)
	struct FString                                               MatchmakingHopper;                                 // 0x18(0x10)
	class UClass*                                                ShipSize;                                          // 0x28(0x8)
	int                                                          MaxMatchmakingPlayers;                             // 0x30(0x4)
	char                                                         pad0x4_3NZOI[0x4];                                 // 0x34(0x4)
};


// Size 0x10
struct CrewSessionBaseTelemetryEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
};


// Size 0x50
struct SessionHostChangedEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	char                                                         pad0x40_VZ9WN[0x40];                               // 0x10(0x40)
};


// Size 0x20
struct SessionHostDeviceChangedEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct FString                                               NewHostDevice;                                     // 0x10(0x10)
};


// Size 0x10
struct ServerMatchmakingCrewLeftEvent
{
public:
	char                                                         pad0x10_7V0TS[0x10];                               // 0x0(0x10)
};


// Size 0x18
struct CrewSessionOperationFailedTelemetryEvent
{
public:
	struct FString                                               ErrorMessage;                                      // 0x0(0x10)
	int                                                          OperationTypeCode;                                 // 0x10(0x4)
	bool                                                         WasCancelled;                                      // 0x14(0x1)
	char                                                         pad0x3_THUU3[0x3];                                 // 0x15(0x3)
};


// Size 0x88
struct ServerMatchmakingRefusedEvent
{
public:
	char                                                         pad0x88_JBP67[0x88];                               // 0x0(0x88)
};


// Size 0x148
struct CrewSessionMatchmakingFollowedTelemetryEvent
{
public:
	char                                                         pad0x120_O1AVR[0x120];                             // 0x0(0x120)
	struct Guid                                                  NewCrewId;                                         // 0x120(0x10)
	int                                                          ResultCode;                                        // 0x130(0x4)
	char                                                         pad0x4_02ECO[0x4];                                 // 0x134(0x4)
	struct FString                                               Message;                                           // 0x138(0x10)
};


// Size 0x4
struct ServerMatchmakingConfigChangedEvent
{
public:
	char                                                         pad0x4_5DVWC[0x4];                                 // 0x0(0x4)
};


// Size 0x1
struct PlayModeVariantSetFromAllocationSessionCookie
{
public:
	char                                                         pad0x1_24L8O[0x1];                                 // 0x0(0x1)
};


// Size 0x28
struct CrewSessionKeepAliveFailedTelemetryEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	struct FString                                               UserStatus;                                        // 0x10(0x10)
	int                                                          ErrorCode;                                         // 0x20(0x4)
	int                                                          KeepAliveCounter;                                  // 0x24(0x4)
};


// Size 0x20
struct SessionDetailsChangedEvent
{
public:
	char                                                         pad0x20_HVUAV[0x20];                               // 0x0(0x20)
};


// Size 0x10
struct CrewSessionLeaveTelemetryEvent
{
public:
	char                                                         pad0x10_57B6D[0x10];                               // 0x0(0x10)
};


// Size 0x110
struct CrewSessionTelemetry
{
public:
	TArray<struct CrewSessionMemberTelemetry>                    SessionMembers;                                    // 0x0(0x10)
	struct FString                                               SessionTemplate;                                   // 0x10(0x10)
	struct FString                                               SessionVisibility;                                 // 0x20(0x10)
	struct FString                                               PlayMode;                                          // 0x30(0x10)
	struct FString                                               PlayModeVariant;                                   // 0x40(0x10)
	struct FString                                               SessionType;                                       // 0x50(0x10)
	struct FString                                               XboxPadOnlySession;                                // 0x60(0x10)
	struct FString                                               SaferSeasSession;                                  // 0x70(0x10)
	struct FString                                               FriendsJoinable;                                   // 0x80(0x10)
	struct FString                                               SessionGrouping;                                   // 0x90(0x10)
	struct FString                                               SessionStyle;                                      // 0xa0(0x10)
	struct FString                                               CaptainedSessionPirateId;                          // 0xb0(0x10)
	struct FString                                               CaptainedSessionShipId;                            // 0xc0(0x10)
	struct FString                                               CaptainedSessionUserId;                            // 0xd0(0x10)
	struct FString                                               SessionGuildId;                                    // 0xe0(0x10)
	struct FString                                               SessionAllowGuildMembersToJoin;                    // 0xf0(0x10)
	struct FString                                               CrossPlaySetting;                                  // 0x100(0x10)
};


// Size 0x140
struct CrewSessionJoinedTelemetryEvent
{
public:
	char                                                         pad0x120_08T1M[0x120];                             // 0x0(0x120)
	struct FString                                               JoinMethod;                                        // 0x120(0x10)
	TArray<struct CrewSessionQoSMeasurementTelemetry>            QoSTelemetry;                                      // 0x130(0x10)
};


// Size 0x130
struct CrewSessionCreatedTelemetryEvent
{
public:
	char                                                         pad0x120_8AJS9[0x120];                             // 0x0(0x120)
	TArray<struct CrewSessionQoSMeasurementTelemetry>            QoSTelemetry;                                      // 0x120(0x10)
};


// Size 0x120
struct CrewSessionBaseSessionTelemetryEvent
{
public:
	char                                                         pad0x10_GFCVA[0x10];                               // 0x0(0x10)
	struct CrewSessionTelemetry                                  Session;                                           // 0x10(0x110)
};


