// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1
struct ShantyPuzzleUnlockCanceledEvent
{
public:
	char                                                         pad0x1_Y00PV[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct ShantyPuzzleSingleInteractionZoneStopInteractingEvent
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	int                                                          InteractionZoneIdx;                                // 0x8(0x4)
	char                                                         pad0x4_I05JZ[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct ShantyPuzzleSingleInteractionZoneUnlockEvent
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
	int                                                          InteractionZoneIdx;                                // 0x8(0x4)
	char                                                         pad0x4_NGEEX[0x4];                                 // 0xc(0x4)
};


// Size 0x8
struct ShantyPuzzlePlayerExitInteractionZoneEvent
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x8
struct ShantyPuzzlePlayerEnterInteractionZoneEvent
{
public:
	class Actor*                                                 Player;                                            // 0x0(0x8)
};


// Size 0x1
struct ShantyPuzzleUnlockedCompleteEvent
{
public:
	char                                                         pad0x1_296KD[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct ShantyPuzzleInteractionZoneDefinition
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
	byte                                                         RequiredMusicalInstrumentType;                     // 0x10(0x1)
	char                                                         pad0x3_Q939T[0x3];                                 // 0x11(0x3)
	int                                                          RequiredNumInteractors;                            // 0x14(0x4)
};


// Size 0x10
struct ShantyPuzzleCompleteEvent
{
public:
	TArray<struct Guid>                                          ParticipatingCrews;                                // 0x0(0x10)
};


}