// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48
class ShantyPuzzleCompletionComponent: public ActorComponent
{
public:
	float                                                        CompletionTime;                                    // 0xc8(0x4)
	TArray<Struct LandmarkReactionKeyFrame>                      StartCompletionReaction;                           // 0xd0(0x10)
	TArray<Struct LandmarkReactionKeyFrame>                      AbortCompletionReaction;                           // 0xe0(0x10)
	TArray<Struct LandmarkReactionKeyFrame>                      PuzzleCompletedReaction;                           // 0xf0(0x10)
	Class LandmarkReactionPlayer*                                ReactionPlayer;                                    // 0x100(0x8)
	byte                                                         ReactionState;                                     // 0x108(0x1)
};


// Size 0x0
class ShantyPuzzleInterface: public Interface
{
public:
};


// Size 0x110
class ShantyPuzzleComponent: public SceneComponent
{
public:
	class                                                        RequiredShantyItemDesc;                            // 0x2e8(0x8)
	TArray<Struct ShantyPuzzleInteractionZoneDefinition>         ShantyPuzzleInteractionZoneDefinitions;            // 0x2f0(0x10)
	bool                                                         TimeLimited;                                       // 0x300(0x1)
	bool                                                         ShouldMoveEnsembleToActorPosition;                 // 0x301(0x1)
	Struct GameTimeRange                                         ActiveTimeRange;                                   // 0x308(0x10)
	TArray<class ShantyPuzzleInteractionZones*>                  ShantyPuzzleInteractionZones;                      // 0x318(0x10)
	Class Ensemble*                                              CurrentlyPlayingShantyPuzzleEnsemble;              // 0x328(0x8)
};


// Size 0x20
class ShantyPuzzleInteractionZoneComponent: public SphereComponent
{
public:
};


}