// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10
struct HullDamagePersistenceModel
{
public:
	TArray<struct HullDamageZoneInfo>                            DamageZones;                                       // 0x0(0x10)
};


// Size 0x30
struct HullDamageZoneInfo
{
public:
	struct FString                                               DamageZoneId;                                      // 0x0(0x10)
	int                                                          DamageLevel;                                       // 0x10(0x4)
	int                                                          RepairedDamageLevel;                               // 0x14(0x4)
	byte                                                         RepairableState;                                   // 0x18(0x1)
	char                                                         pad0x7_1Z75K[0x7];                                 // 0x19(0x7)
	TArray<struct HullDamageHit>                                 ExternalHitList;                                   // 0x20(0x10)
};


// Size 0x1c
struct HullDamageHit
{
public:
	struct Vector                                                HitPosition;                                       // 0x0(0xc)
	struct Vector                                                HitNormal;                                         // 0xc(0xc)
	bool                                                         HasDecal;                                          // 0x18(0x1)
	char                                                         pad0x3_3AW0W[0x3];                                 // 0x19(0x3)
};


// Size 0x70
struct EventShipDamageApplied
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	struct FName                                                 DamagedShipPartIdentifier;                         // 0x8(0x8)
	int                                                          NewDamageLevel;                                    // 0x10(0x4)
	char                                                         pad0x4_C2AZZ[0x4];                                 // 0x14(0x4)
	struct ImpactDamageEvent                                     ImpactDamageEvent;                                 // 0x18(0x58)
};


// Size 0x60
struct EventShipDamaged
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	struct ImpactDamageEvent                                     ImpactDamageEvent;                                 // 0x8(0x58)
};


// Size 0x10
struct DamageZoneDamageLevelChanged
{
public:
	class Actor*                                                 DamageZone;                                        // 0x0(0x8)
	int                                                          DamageLevel;                                       // 0x8(0x4)
	char                                                         pad0x4_HQNSB[0x4];                                 // 0xc(0x4)
};


// Size 0x10
struct AppliedDamageToShipEvent
{
public:
	class UClass*                                                ShipType;                                          // 0x0(0x8)
	class Actor*                                                 Ship;                                              // 0x8(0x8)
};


// Size 0x10
struct ShipRestoredNetworkEvent
{
public:
	char                                                         pad0x10_U8KYF[0x10];                               // 0x0(0x10)
};


// Size 0x20
struct SendShipRestoredRpc
{
public:
	char                                                         pad0x10_1H1YI[0x10];                               // 0x0(0x10)
	struct Guid                                                  CrewId;                                            // 0x10(0x10)
};


// Size 0x1
struct EventRestoreShip
{
public:
	bool                                                         OnlyRepaired;                                      // 0x0(0x1)
};


// Size 0x10
struct ShipDamageParams
{
public:
	TArray<struct ShipPartLevelsOfDamage>                        DamageParams;                                      // 0x0(0x10)
};


// Size 0x40
struct ShipPartLevelsOfDamage
{
public:
	char                                                         pad0x20_FTFIV[0x20];                               // 0x0(0x20)
	TArray<struct DistanceAndLevelOfDamage>                      DamagePerDistance;                                 // 0x20(0x10)
	struct FeatureFlag                                           FeatureName;                                       // 0x30(0xc)
	char                                                         pad0x4_7TO1N[0x4];                                 // 0x3c(0x4)
};


// Size 0xc
struct DistanceAndLevelOfDamage
{
public:
	float                                                        DistanceLimit;                                     // 0x0(0x4)
	int                                                          LevelOfDamage;                                     // 0x4(0x4)
	bool                                                         CannotDamageAnAlreadyDamagedPoint;                 // 0x8(0x1)
	bool                                                         ShouldOnlyDamageOneHullDeckLevel;                  // 0x9(0x1)
	char                                                         pad0x2_D1QTQ[0x2];                                 // 0xa(0x2)
};


}