#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x60
struct EventShipDamaged
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	struct ImpactDamageEvent                                     ImpactDamageEvent;                                 // 0x8(0x58)
};


// Size 0x10
struct AppliedDamageToShipEvent
{
public:
	class UClass*                                                ShipType;                                          // 0x0(0x8)
	class Actor*                                                 Ship;                                              // 0x8(0x8)
};


// Size 0x14
struct DistanceAndLevelOfDamage
{
public:
	float                                                        DistanceLimit;                                     // 0x0(0x4)
	int                                                          LevelOfDamage;                                     // 0x4(0x4)
	bool                                                         CannotDamageAboveLimit;                            // 0x8(0x1)
	int                                                          DamageLimit;                                       // 0xc(0x4)
	bool                                                         ShouldOnlyDamageOneHullDeckLevel;                  // 0x10(0x1)
};


// Size 0x10
struct DamageZoneDamageLevelChanged
{
public:
	class Actor*                                                 DamageZone;                                        // 0x0(0x8)
	int                                                          DamageLevel;                                       // 0x8(0x4)
};


// Size 0x28
struct SendShipRestoredRpc
{
public:
	struct Guid                                                  CrewId;                                            // 0x18(0x10)
};


// Size 0x1c
struct HullDamageHit
{
public:
	struct Vector                                                HitPosition;                                       // 0x0(0xc)
	struct Vector                                                HitNormal;                                         // 0xc(0xc)
	bool                                                         HasDecal;                                          // 0x18(0x1)
};


// Size 0x1
struct EventRestoreShip
{
public:
	bool                                                         OnlyRepaired;                                      // 0x0(0x1)
};


// Size 0x90
struct LevelOfDamageProperties
{
public:
	float                                                        LeakAmount;                                        // 0x0(0x4)
	float                                                        RepairTime;                                        // 0x4(0x4)
	float                                                        UndoRepairTime;                                    // 0x8(0x4)
	float                                                        NonOwningCrewUndoRepairTime;                       // 0xc(0x4)
	class MaterialInterface*                                     HoleDecalMaterial;                                 // 0x10(0x8)
	struct Transform                                             HoleDecalComponentTransform;                       // 0x20(0x30)
	struct Vector                                                ParticleSystemComponentLocation;                   // 0x50(0xc)
	float                                                        InternalWaterSamplePositionTopOffset;              // 0x5c(0x4)
	float                                                        InternalWaterSamplePositionBottomOffset;           // 0x60(0x4)
	class ParticleSystem*                                        ParticleSystem_WaterLeakAboveWater;                // 0x68(0x8)
	class ParticleSystem*                                        ParticleSystem_WaterLeakBelowWater;                // 0x70(0x8)
	class ParticleSystem*                                        ParticleSystem_RepairLeakAboveWater;               // 0x78(0x8)
	class ParticleSystem*                                        ParticleSystem_RepairLeakBelowWater;               // 0x80(0x8)
	class ParticleSystem*                                        ParticleSystem_SplashOnInternalWaterSurface;       // 0x88(0x8)
};


// Size 0x70
struct EventShipDamageApplied
{
public:
	class Actor*                                                 Ship;                                              // 0x0(0x8)
	struct FName                                                 DamagedShipPartIdentifier;                         // 0x8(0x8)
	int                                                          NewDamageLevel;                                    // 0x10(0x4)
	struct ImpactDamageEvent                                     ImpactDamageEvent;                                 // 0x18(0x58)
};


// Size 0x30
struct HullDamageZoneInfo
{
public:
	struct FString                                               DamageZoneId;                                      // 0x0(0x10)
	int                                                          DamageLevel;                                       // 0x10(0x4)
	int                                                          RepairedDamageLevel;                               // 0x14(0x4)
	char                                                         RepairableState;                                   // 0x18(0x1)
	TArray<struct HullDamageHit>                                 ExternalHitList;                                   // 0x20(0x10)
};


// Size 0x40
struct ShipPartLevelsOfDamage
{
public:
	assetclass                                                   ActorClass;                                        // 0x0(0x20)
	TArray<struct DistanceAndLevelOfDamage>                      DamagePerDistance;                                 // 0x20(0x10)
	struct FeatureFlag                                           FeatureName;                                       // 0x30(0xc)
};


// Size 0x10
struct HullDamagePersistenceModel
{
public:
	TArray<struct HullDamageZoneInfo>                            DamageZones;                                       // 0x0(0x10)
};


// Size 0x10
struct ShipDamageParams
{
public:
	TArray<struct ShipPartLevelsOfDamage>                        DamageParams;                                      // 0x0(0x10)
};


