#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x58 (Full Size[0x420] - InheritedSize[0x3c8]
class ShortRangeMarker: public Actor
{
public:
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0x3d8(0x10)
	float                                                        LifetimerTimer;                                    // 0x3e8(0x4)
	float                                                        FadeTimer;                                         // 0x3ec(0x4)
	multicastinlinedelegate                                      TriggerFadeIn;                                     // 0x3f0(0x10)
	multicastinlinedelegate                                      TriggerFadeOut;                                    // 0x400(0x10)
	TArray<uintptr_t>                                            CachedActors;                                      // 0x410(0x10)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ShortRangeMarkerDataAsset: public DataAsset
{
public:
	class ActorSpawnData*                                        RewardMarker;                                      // 0x28(0x8)
	float                                                        RewardMarkerHeight;                                // 0x30(0x4)
};


