#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShortRangeMarkerBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class ShortRangeMarkerDataAsset: public DataAsset
{
public:
	class ActorSpawnData*                                        RewardMarker;                                      // 0x28(0x8)
	float                                                        RewardMarkerHeight;                                // 0x30(0x4)
	char                                                         pad0x4_QY10P[0x4];                                 // 0x34(0x4)
};


// Size 0x58 (Full Size[0x3f8] - InheritedSize[0x3a0]
class ShortRangeMarker: public Actor
{
public:
	char                                                         pad0x10_0QT7G[0x10];                               // 0x3a0(0x10)
	TArray<class MaterialInstanceDynamic*>                       DynamicMaterials;                                  // 0x3b0(0x10)
	float                                                        LifetimerTimer;                                    // 0x3c0(0x4)
	float                                                        FadeTimer;                                         // 0x3c4(0x4)
	TArray<uintptr_t>                                            CachedActors;                                      // 0x3e8(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShortRangeMarkerInterface: public Interface
{
public:
};


