// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size -0xb3f
class ShroudedIslands_AnchoredGhostShip_C: public ByteProperty
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x428(0x8)
	Class SphereComponent*                                       None;                                              // 0x430(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x438(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x440(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x448(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x450(0x8)
	Class SkeletalMeshComponent*                                 None;                                              // 0x458(0x8)
	bool                                                         None;                                              // 0x460(0x1)
};


}