// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x88 (Full Size[0x450] - InheritedSize[0x3c8]
class ShroudedIslands_BellesBuoy_C: public Actor
{
public:
	struct PointerToUberGraphFrame                               None;                                              // 0x3c8(0x8)
	class PointLightComponent*                                   None;                                              // 0x3d0(0x8)
	class ParticleSystemComponent*                               None;                                              // 0x3d8(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	class SceneComponent*                                        None;                                              // 0x3f0(0x8)
	struct WwiseEmitter                                          None;                                              // 0x3f8(0x20)
	struct WwiseEmitterCreationParams                            None;                                              // 0x418(0x28)
	class WwiseEvent*                                            None;                                              // 0x440(0x8)
	class WwiseObjectPoolWrapper*                                None;                                              // 0x448(0x8)
};


}