// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x88 (Full Size[0x450] - InheritedSize[0x3c8]
class ShroudedIslands_BellesBuoy_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3c8(0x8)
	Class PointLightComponent*                                   None;                                              // 0x3d0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	Class SceneComponent*                                        None;                                              // 0x3f0(0x8)
	Struct WwiseEmitter                                          None;                                              // 0x3f8(0x20)
	Struct WwiseEmitterCreationParams                            None;                                              // 0x418(0x28)
	Class WwiseEvent*                                            None;                                              // 0x440(0x8)
	Class WwiseObjectPoolWrapper*                                None;                                              // 0x448(0x8)
};


}