#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x428
struct ComboBoxStyle
{
public:
	struct                                                       ComboButtonStyle;                                  // 0x8(0x3e0)
	struct                                                       PressedSlateSound;                                 // 0x3e8(0x18)
	struct                                                       SelectionChangeSlateSound;                         // 0x400(0x18)
	struct FName                                                 PressedSound;                                      // 0x418(0x8)
	struct FName                                                 SelectionChangeSound;                              // 0x420(0x8)
};


// Size 0x518
struct TableColumnHeaderStyle
{
public:
	struct                                                       SortPrimaryAscendingImage;                         // 0x8(0x90)
	struct                                                       SortPrimaryDescendingImage;                        // 0x98(0x90)
	struct                                                       SortSecondaryAscendingImage;                       // 0x128(0x90)
	struct                                                       SortSecondaryDescendingImage;                      // 0x1b8(0x90)
	struct                                                       NormalBrush;                                       // 0x248(0x90)
	struct                                                       HoveredBrush;                                      // 0x2d8(0x90)
	struct                                                       MenuDropdownImage;                                 // 0x368(0x90)
	struct                                                       MenuDropdownNormalBorderBrush;                     // 0x3f8(0x90)
	struct                                                       MenuDropdownHoveredBorderBrush;                    // 0x488(0x90)
};


// Size 0x728
struct TableRowStyle
{
public:
	struct                                                       SelectorFocusedBrush;                              // 0x8(0x90)
	struct                                                       ActiveHoveredBrush;                                // 0x98(0x90)
	struct                                                       ActiveBrush;                                       // 0x128(0x90)
	struct                                                       InactiveHoveredBrush;                              // 0x1b8(0x90)
	struct                                                       InactiveBrush;                                     // 0x248(0x90)
	struct                                                       EvenRowBackgroundHoveredBrush;                     // 0x2d8(0x90)
	struct                                                       EvenRowBackgroundBrush;                            // 0x368(0x90)
	struct                                                       OddRowBackgroundHoveredBrush;                      // 0x3f8(0x90)
	struct                                                       OddRowBackgroundBrush;                             // 0x488(0x90)
	struct                                                       TextColor;                                         // 0x518(0x30)
	struct                                                       SelectedTextColor;                                 // 0x548(0x30)
	struct                                                       DropIndicator_Above;                               // 0x578(0x90)
	struct                                                       DropIndicator_Onto;                                // 0x608(0x90)
	struct                                                       DropIndicator_Below;                               // 0x698(0x90)
};


// Size 0x520
struct VolumeControlStyle
{
public:
	struct                                                       SliderStyle;                                       // 0x8(0x248)
	struct                                                       HighVolumeImage;                                   // 0x250(0x90)
	struct                                                       MidVolumeImage;                                    // 0x2e0(0x90)
	struct                                                       LowVolumeImage;                                    // 0x370(0x90)
	struct                                                       NoVolumeImage;                                     // 0x400(0x90)
	struct                                                       MutedImage;                                        // 0x490(0x90)
};


// Size 0x128
struct SplitterStyle
{
public:
	struct                                                       HandleNormalBrush;                                 // 0x8(0x90)
	struct                                                       HandleHighlightBrush;                              // 0x98(0x90)
};


// Size 0x160
struct TextBlockStyle
{
public:
	struct                                                       Font;                                              // 0x8(0x40)
	struct                                                       ColorAndOpacity;                                   // 0x48(0x30)
	struct                                                       ShadowOffset;                                      // 0x78(0x8)
	struct                                                       ShadowColorAndOpacity;                             // 0x80(0x10)
	struct                                                       SelectedBackgroundColor;                           // 0x90(0x30)
	struct                                                       HighlightColor;                                    // 0xc0(0x10)
	struct                                                       HighlightShape;                                    // 0xd0(0x90)
};


// Size 0xc20
struct HeaderRowStyle
{
public:
	struct                                                       ColumnStyle;                                       // 0x8(0x518)
	struct                                                       LastColumnStyle;                                   // 0x520(0x518)
	struct                                                       ColumnSplitterStyle;                               // 0xa38(0x128)
	struct                                                       BackgroundBrush;                                   // 0xb60(0x90)
	struct                                                       ForegroundColor;                                   // 0xbf0(0x30)
};


// Size 0x420
struct HyperlinkStyle
{
public:
	struct                                                       UnderlineStyle;                                    // 0x8(0x2a8)
	struct                                                       TextStyle;                                         // 0x2b0(0x160)
	struct                                                       Padding;                                           // 0x410(0x10)
};


// Size 0x2a8
struct ButtonStyle
{
public:
	struct                                                       Normal;                                            // 0x8(0x90)
	struct                                                       Hovered;                                           // 0x98(0x90)
	struct                                                       Pressed;                                           // 0x128(0x90)
	struct                                                       Disabled;                                          // 0x1b8(0x90)
	struct                                                       NormalPadding;                                     // 0x248(0x10)
	struct                                                       PressedPadding;                                    // 0x258(0x10)
	struct                                                       PressedSlateSound;                                 // 0x268(0x18)
	struct                                                       HoveredSlateSound;                                 // 0x280(0x18)
	struct FName                                                 PressedSound;                                      // 0x298(0x8)
	struct FName                                                 HoveredSound;                                      // 0x2a0(0x8)
};


// Size 0x1b8
struct ProgressBarStyle
{
public:
	struct                                                       BackgroundImage;                                   // 0x8(0x90)
	struct                                                       FillImage;                                         // 0x98(0x90)
	struct                                                       MarqueeImage;                                      // 0x128(0x90)
};


// Size 0x860
struct EditableTextBoxStyle
{
public:
	struct                                                       BackgroundImageNormal;                             // 0x8(0x90)
	struct                                                       BackgroundImageHovered;                            // 0x98(0x90)
	struct                                                       BackgroundImageFocused;                            // 0x128(0x90)
	struct                                                       BackgroundImageReadOnly;                           // 0x1b8(0x90)
	struct                                                       Padding;                                           // 0x248(0x10)
	struct                                                       Font;                                              // 0x258(0x40)
	struct                                                       ForegroundColor;                                   // 0x298(0x30)
	struct                                                       BackgroundColor;                                   // 0x2c8(0x30)
	struct                                                       ReadOnlyForegroundColor;                           // 0x2f8(0x30)
	struct                                                       HScrollBarPadding;                                 // 0x328(0x10)
	struct                                                       VScrollBarPadding;                                 // 0x338(0x10)
	struct                                                       ScrollBarStyle;                                    // 0x348(0x518)
};


// Size 0x38
struct TypefaceEntry
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	struct                                                       Font;                                              // 0x8(0x30)
};


// Size 0x30
struct FontData
{
public:
	struct FString                                               FontFilename;                                      // 0x0(0x10)
	class FontBulkData*                                          BulkDataPtr;                                       // 0x10(0x8)
	char                                                         Hinting;                                           // 0x18(0x1)
	TArray<char>                                                 FontData;                                          // 0x20(0x10)
};


// Size 0x9c8
struct InlineEditableTextBlockStyle
{
public:
	struct                                                       EditableTextBoxStyle;                              // 0x8(0x860)
	struct                                                       TextStyle;                                         // 0x868(0x160)
};


// Size 0x518
struct ScrollBarStyle
{
public:
	struct                                                       HorizontalBackgroundImage;                         // 0x8(0x90)
	struct                                                       VerticalBackgroundImage;                           // 0x98(0x90)
	struct                                                       VerticalTopSlotImage;                              // 0x128(0x90)
	struct                                                       HorizontalTopSlotImage;                            // 0x1b8(0x90)
	struct                                                       VerticalBottomSlotImage;                           // 0x248(0x90)
	struct                                                       HorizontalBottomSlotImage;                         // 0x2d8(0x90)
	struct                                                       NormalThumbImage;                                  // 0x368(0x90)
	struct                                                       HoveredThumbImage;                                 // 0x3f8(0x90)
	struct                                                       DraggedThumbImage;                                 // 0x488(0x90)
};


// Size 0x5f0
struct CheckBoxStyle
{
public:
	char                                                         CheckBoxType;                                      // 0x8(0x1)
	struct                                                       UncheckedImage;                                    // 0x10(0x90)
	struct                                                       UncheckedHoveredImage;                             // 0xa0(0x90)
	struct                                                       UncheckedPressedImage;                             // 0x130(0x90)
	struct                                                       CheckedImage;                                      // 0x1c0(0x90)
	struct                                                       CheckedHoveredImage;                               // 0x250(0x90)
	struct                                                       CheckedPressedImage;                               // 0x2e0(0x90)
	struct                                                       UndeterminedImage;                                 // 0x370(0x90)
	struct                                                       UndeterminedHoveredImage;                          // 0x400(0x90)
	struct                                                       UndeterminedPressedImage;                          // 0x490(0x90)
	struct                                                       Padding;                                           // 0x520(0x10)
	struct                                                       ForegroundColor;                                   // 0x530(0x30)
	struct                                                       BorderBackgroundColor;                             // 0x560(0x30)
	struct                                                       CheckedSlateSound;                                 // 0x590(0x18)
	struct                                                       UncheckedSlateSound;                               // 0x5a8(0x18)
	struct                                                       HoveredSlateSound;                                 // 0x5c0(0x18)
	struct FName                                                 CheckedSound;                                      // 0x5d8(0x8)
	struct FName                                                 UncheckedSound;                                    // 0x5e0(0x8)
	struct FName                                                 HoveredSound;                                      // 0x5e8(0x8)
};


// Size 0x38
struct CompositeSubFont
{
public:
	struct                                                       Typeface;                                          // 0x0(0x10)
	TArray<struct Int32Range>                                    CharacterRanges;                                   // 0x10(0x10)
	TArray<char>                                                 Languages;                                         // 0x20(0x10)
	float                                                        ScalingFactor;                                     // 0x30(0x4)
};


// Size 0xa0
struct InlineTextImageStyle
{
public:
	struct                                                       Image;                                             // 0x8(0x90)
	int16                                                        Baseline;                                          // 0x98(0x2)
};


// Size 0x3e0
struct ComboButtonStyle
{
public:
	struct                                                       ButtonStyle;                                       // 0x8(0x2a8)
	struct                                                       DownArrowImage;                                    // 0x2b0(0x90)
	struct                                                       MenuBorderBrush;                                   // 0x340(0x90)
	struct                                                       MenuBorderPadding;                                 // 0x3d0(0x10)
};


// Size 0x248
struct ScrollBoxStyle
{
public:
	struct                                                       TopShadowBrush;                                    // 0x8(0x90)
	struct                                                       BottomShadowBrush;                                 // 0x98(0x90)
	struct                                                       LeftShadowBrush;                                   // 0x128(0x90)
	struct                                                       RightShadowBrush;                                  // 0x1b8(0x90)
};


// Size 0x40
struct SlateFontInfo
{
public:
	class Object*                                                FontObject;                                        // 0x0(0x8)
	class Object*                                                FontMaterial;                                      // 0x8(0x8)
	struct FName                                                 TypefaceFontName;                                  // 0x28(0x8)
	int                                                          Size;                                              // 0x30(0x4)
	struct FName                                                 FontName;                                          // 0x34(0x8)
	char                                                         Hinting;                                           // 0x3c(0x1)
};


// Size 0x248
struct SliderStyle
{
public:
	struct                                                       NormalBarImage;                                    // 0x8(0x90)
	struct                                                       DisabledBarImage;                                  // 0x98(0x90)
	struct                                                       NormalThumbImage;                                  // 0x128(0x90)
	struct                                                       DisabledThumbImage;                                // 0x1b8(0x90)
};


// Size 0x1028
struct WindowStyle
{
public:
	struct                                                       MinimizeButtonStyle;                               // 0x8(0x2a8)
	struct                                                       MaximizeButtonStyle;                               // 0x2b0(0x2a8)
	struct                                                       RestoreButtonStyle;                                // 0x558(0x2a8)
	struct                                                       CloseButtonStyle;                                  // 0x800(0x2a8)
	struct                                                       TitleTextStyle;                                    // 0xaa8(0x160)
	struct                                                       ActiveTitleBrush;                                  // 0xc08(0x90)
	struct                                                       InactiveTitleBrush;                                // 0xc98(0x90)
	struct                                                       FlashTitleBrush;                                   // 0xd28(0x90)
	struct                                                       OutlineBrush;                                      // 0xdb8(0x90)
	struct                                                       OutlineColor;                                      // 0xe48(0x30)
	struct                                                       BorderBrush;                                       // 0xe78(0x90)
	struct                                                       BackgroundBrush;                                   // 0xf08(0x90)
	struct                                                       ChildBackgroundBrush;                              // 0xf98(0x90)
};


// Size 0x18
struct SlateSound
{
public:
	class Object*                                                ResourceObject;                                    // 0x0(0x8)
};


// Size 0x10
struct Margin
{
public:
	float                                                        Left;                                              // 0x0(0x4)
	float                                                        Top;                                               // 0x4(0x4)
	float                                                        Right;                                             // 0x8(0x4)
	float                                                        Bottom;                                            // 0xc(0x4)
};


// Size 0x228
struct EditableTextStyle
{
public:
	struct                                                       Font;                                              // 0x8(0x40)
	struct                                                       ColorAndOpacity;                                   // 0x48(0x30)
	struct                                                       BackgroundImageSelected;                           // 0x78(0x90)
	struct                                                       BackgroundImageComposing;                          // 0x108(0x90)
	struct                                                       CaretImage;                                        // 0x198(0x90)
};


// Size 0x30
struct SlateColor
{
public:
	struct                                                       SpecifiedColor;                                    // 0x0(0x10)
	char                                                         ColorUseRule;                                      // 0x10(0x1)
};


// Size 0x128
struct ScrollBorderStyle
{
public:
	struct                                                       TopShadowBrush;                                    // 0x8(0x90)
	struct                                                       BottomShadowBrush;                                 // 0x98(0x90)
};


// Size 0xb00
struct SearchBoxStyle
{
public:
	struct                                                       TextBoxStyle;                                      // 0x8(0x860)
	struct                                                       ActiveFontInfo;                                    // 0x868(0x40)
	struct                                                       UpArrowImage;                                      // 0x8a8(0x90)
	struct                                                       DownArrowImage;                                    // 0x938(0x90)
	struct                                                       GlassImage;                                        // 0x9c8(0x90)
	struct                                                       ClearImage;                                        // 0xa58(0x90)
	struct                                                       ImagePadding;                                      // 0xae8(0x10)
	bool                                                         bLeftAlignButtons;                                 // 0xaf8(0x1)
};


// Size 0x6e8
struct DockTabStyle
{
public:
	struct                                                       CloseButtonStyle;                                  // 0x8(0x2a8)
	struct                                                       NormalBrush;                                       // 0x2b0(0x90)
	struct                                                       ActiveBrush;                                       // 0x340(0x90)
	struct                                                       ColorOverlayBrush;                                 // 0x3d0(0x90)
	struct                                                       ForegroundBrush;                                   // 0x460(0x90)
	struct                                                       HoveredBrush;                                      // 0x4f0(0x90)
	struct                                                       ContentAreaBrush;                                  // 0x580(0x90)
	struct                                                       TabWellBrush;                                      // 0x610(0x90)
	struct                                                       TabPadding;                                        // 0x6a0(0x10)
	float                                                        OverlapWidth;                                      // 0x6b0(0x4)
	struct                                                       FlashColor;                                        // 0x6b8(0x30)
};


// Size 0x90
struct SlateBrush
{
public:
	struct                                                       ImageSize;                                         // 0x0(0x8)
	char                                                         DrawAs;                                            // 0x8(0x1)
	struct                                                       Margin;                                            // 0xc(0x10)
	struct                                                       Tint;                                              // 0x1c(0x10)
	struct                                                       TintColor;                                         // 0x30(0x30)
	char                                                         Tiling;                                            // 0x60(0x1)
	char                                                         Mirroring;                                         // 0x61(0x1)
	char                                                         ImageType;                                         // 0x62(0x1)
	class Object*                                                ResourceObject;                                    // 0x68(0x8)
	struct FName                                                 ResourceName;                                      // 0x70(0x8)
	bool                                                         bIsDynamicallyLoaded;                              // 0x78(0x1)
	bool                                                         bHasUObject;                                       // 0x79(0x1)
	struct                                                       UVRegion;                                          // 0x7c(0x14)
};


// Size 0x128
struct ExpandableAreaStyle
{
public:
	struct                                                       CollapsedImage;                                    // 0x8(0x90)
	struct                                                       ExpandedImage;                                     // 0x98(0x90)
};


// Size 0x318
struct SpinBoxStyle
{
public:
	struct                                                       BackgroundBrush;                                   // 0x8(0x90)
	struct                                                       HoveredBackgroundBrush;                            // 0x98(0x90)
	struct                                                       ActiveFillBrush;                                   // 0x128(0x90)
	struct                                                       InactiveFillBrush;                                 // 0x1b8(0x90)
	struct                                                       ArrowsImage;                                       // 0x248(0x90)
	struct                                                       ForegroundColor;                                   // 0x2d8(0x30)
	struct                                                       TextPadding;                                       // 0x308(0x10)
};


// Size 0x28
struct CompositeFont
{
public:
	struct                                                       DefaultTypeface;                                   // 0x0(0x10)
	TArray<struct CompositeSubFont>                              SubTypefaces;                                      // 0x10(0x10)
};


// Size 0x10
struct Typeface
{
public:
	TArray<struct TypefaceEntry>                                 Fonts;                                             // 0x0(0x10)
};


