// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x28
struct InputChord
{
public:
	struct Key                                                   Key;                                               // 0x0(0x20)
	bool                                                         bShift;                                            // 0x20(0x1)
	bool                                                         bCtrl;                                             // 0x20(0x1)
	bool                                                         bAlt;                                              // 0x20(0x1)
	bool                                                         bCmd;                                              // 0x20(0x1)
	char                                                         pad0x7_FFASB[0x7];                                 // 0x21(0x7)
};


// Size 0x10
struct Anchors
{
public:
	struct Vector2D                                              Minimum;                                           // 0x0(0x8)
	struct Vector2D                                              Maximum;                                           // 0x8(0x8)
};


}