#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Slate_Structs.h"


// Size 0x228 (Full Size[0x258] - InheritedSize[0x30]
class EditableTextWidgetStyle: public SlateWidgetStyleContainerBase
{
public:
	struct EditableTextStyle                                     EditableTextStyle;                                 // 0x30(0x228)
};


// Size 0x5f0 (Full Size[0x620] - InheritedSize[0x30]
class CheckBoxWidgetStyle: public SlateWidgetStyleContainerBase
{
public:
	struct CheckBoxStyle                                         CheckBoxStyle;                                     // 0x30(0x5f0)
};


// Size 0x160 (Full Size[0x190] - InheritedSize[0x30]
class TextBlockWidgetStyle: public SlateWidgetStyleContainerBase
{
public:
	struct TextBlockStyle                                        TextBlockStyle;                                    // 0x30(0x160)
};


// Size 0x860 (Full Size[0x890] - InheritedSize[0x30]
class EditableTextBoxWidgetStyle: public SlateWidgetStyleContainerBase
{
public:
	struct EditableTextBoxStyle                                  EditableTextBoxStyle;                              // 0x30(0x860)
};


// Size 0x428 (Full Size[0x458] - InheritedSize[0x30]
class ComboBoxWidgetStyle: public SlateWidgetStyleContainerBase
{
public:
	struct ComboBoxStyle                                         ComboBoxStyle;                                     // 0x30(0x428)
};


// Size 0x318 (Full Size[0x348] - InheritedSize[0x30]
class SpinBoxWidgetStyle: public SlateWidgetStyleContainerBase
{
public:
	struct SpinBoxStyle                                          SpinBoxStyle;                                      // 0x30(0x318)
};


// Size 0x2a8 (Full Size[0x2d8] - InheritedSize[0x30]
class ButtonWidgetStyle: public SlateWidgetStyleContainerBase
{
public:
	struct ButtonStyle                                           ButtonStyle;                                       // 0x30(0x2a8)
};


// Size 0x1b8 (Full Size[0x1e8] - InheritedSize[0x30]
class ProgressWidgetStyle: public SlateWidgetStyleContainerBase
{
public:
	struct ProgressBarStyle                                      ProgressBarStyle;                                  // 0x30(0x1b8)
};


// Size 0x248 (Full Size[0x278] - InheritedSize[0x30]
class ScrollBoxWidgetStyle: public SlateWidgetStyleContainerBase
{
public:
	struct ScrollBoxStyle                                        ScrollBoxStyle;                                    // 0x30(0x248)
};


// Size 0x518 (Full Size[0x548] - InheritedSize[0x30]
class ScrollBarWidgetStyle: public SlateWidgetStyleContainerBase
{
public:
	struct ScrollBarStyle                                        ScrollBarStyle;                                    // 0x30(0x518)
};


// Size 0x3e0 (Full Size[0x410] - InheritedSize[0x30]
class ComboButtonWidgetStyle: public SlateWidgetStyleContainerBase
{
public:
	struct ComboButtonStyle                                      ComboButtonStyle;                                  // 0x30(0x3e0)
};


