#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x58 (Full Size[0x400] - InheritedSize[0x3a8]
class sot_frontend_01_a_animation_C: public LevelScriptActor
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3a8(0x8)
	char                                                         pad0xced7d50_MCL4Y[0xced7d50];                     // 0x3b0(0xced7d50)
	class StaticMeshActor*                                       shipSelectUI_title_14_ExecuteUbergraph_sot_frontend_01_a_animation_RefProperty; // 0x3b0(0x8)
	class StaticMeshActor*                                       shipSelectUI_gallion_10_ExecuteUbergraph_sot_frontend_01_a_animation_RefProperty; // 0x3b8(0x8)
	class StaticMeshActor*                                       shipSelectUI_sloop_12_ExecuteUbergraph_sot_frontend_01_a_animation_RefProperty; // 0x3c0(0x8)
	class SkeletalMeshActor*                                     shipSelect_CharMarker2_ExecuteUbergraph_sot_frontend_01_a_animation_RefProperty; // 0x3c8(0x8)
	blueprintgeneratedclass BP_PirateGenerator_LineUp_C*         BP_PirateGenerator_LineUp_C_4_ExecuteUbergraph_sot_frontend_01_a_animation_RefProperty; // 0x3d0(0x8)
	class MatineeActor*                                          MatineeActor_ShipSelect_ExecuteUbergraph_sot_frontend_01_a_animation_RefProperty; // 0x3d8(0x8)
	class MatineeActor*                                          MatineeActor_ShipSelect_UniqueObjectNameForCooking_1530807069_RefProperty; // 0x3e0(0x8)
	class CameraActor*                                           ShipSelectScreenCam_UniqueObjectNameForCooking_1530807069_RefProperty; // 0x3e8(0x8)
	class MatineeActor*                                          MatineeActor_ShipSelect_UniqueObjectNameForCooking_1530807072_RefProperty; // 0x3f0(0x8)
	blueprintgeneratedclass BP_PirateGenerator_LineUp_C*         BP_PirateGenerator_LineUp_C_4_UniqueObjectNameForCooking_1530807072_RefProperty; // 0x3f8(0x8)
};


