#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x80 (Full Size[0x428] - InheritedSize[0x3a8]
class sot_frontend_01_a_C: public LevelScriptActor
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3a8(0x8)
	class PirateSelector*                                        PirateUI;                                          // 0x3b0(0x8)
	bool                                                         ZoomIn;                                            // 0x3b8(0x1)
	bool                                                         Rotation;                                          // 0x3b9(0x1)
	bool                                                         Selected;                                          // 0x3ba(0x1)
	char                                                         pad0x1_3J1WJ[0x1];                                 // 0x3bb(0x1)
	float                                                        initTime;                                          // 0x3bc(0x4)
	float                                                        rotFactor;                                         // 0x3c0(0x4)
	bool                                                         ZoomOut;                                           // 0x3c4(0x1)
	bool                                                         initHighlight;                                     // 0x3c5(0x1)
	char                                                         pad0x2_2CVSE[0x2];                                 // 0x3c6(0x2)
	int                                                          charSlotID;                                        // 0x3c8(0x4)
	char                                                         pad0x4_WV36Y[0x4];                                 // 0x3cc(0x4)
	TArray<class BP_PirateGenerator_LineUp_C*>                   pirateLineUpRef;                                   // 0x3d0(0x10)
	int                                                          lastCharSlotID;                                    // 0x3e0(0x4)
	bool                                                         zoomOutDone;                                       // 0x3e4(0x1)
	bool                                                         zoomDone;                                          // 0x3e5(0x1)
	char                                                         pad0x2_S8AC3[0x2];                                 // 0x3e6(0x2)
	animblueprintgeneratedclass BP_Anim_CharacterSelect_C*       pirateLineUpAnimgraph;                             // 0x3e8(0x8)
	struct Vector                                                selectedPirateLoc;                                 // 0x3f0(0xc)
	struct Rotator                                               selectedPirateRot;                                 // 0x3fc(0xc)
	bool                                                         PiratesInitialized;                                // 0x408(0x1)
	bool                                                         PirateSelected;                                    // 0x409(0x1)
	bool                                                         mouseDown;                                         // 0x40a(0x1)
	bool                                                         mouseDragging;                                     // 0x40b(0x1)
	float                                                        mouseStartX;                                       // 0x40c(0x4)
	blueprintgeneratedclass BP_CarouselCam_C*                    BP_CarouselCam_C_2_ExecuteUbergraph_sot_frontend_01_a_RefProperty; // 0x410(0x8)
	class MatineeActor*                                          MatineeActor_PirateSelect_ExecuteUbergraph_sot_frontend_01_a_RefProperty; // 0x418(0x8)
	blueprintgeneratedclass BP_CarouselCam_C*                    BP_CarouselCam_C_2_UniqueObjectNameForCooking_232772163_RefProperty; // 0x420(0x8)
};


