#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x80 (Full Size[0x450] - InheritedSize[0x3d0]
class sot_frontend_01_a_C: public LevelScriptActor
{
public:
	struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3d0(0x8)
	class PirateSelector*                                        PirateUI;                                          // 0x3d8(0x8)
	bool                                                         ZoomIn;                                            // 0x3e0(0x1)
	bool                                                         Rotation;                                          // 0x3e1(0x1)
	bool                                                         Selected;                                          // 0x3e2(0x1)
	char                                                         pad0x1_R0Q1O[0x1];                                 // 0x3e3(0x1)
	float                                                        initTime;                                          // 0x3e4(0x4)
	float                                                        rotFactor;                                         // 0x3e8(0x4)
	bool                                                         ZoomOut;                                           // 0x3ec(0x1)
	bool                                                         initHighlight;                                     // 0x3ed(0x1)
	char                                                         pad0x2_MT6QL[0x2];                                 // 0x3ee(0x2)
	int                                                          charSlotID;                                        // 0x3f0(0x4)
	char                                                         pad0x4_0TZ9X[0x4];                                 // 0x3f4(0x4)
	TArray<class BP_PirateGenerator_LineUp_C*>                   pirateLineUpRef;                                   // 0x3f8(0x10)
	int                                                          lastCharSlotID;                                    // 0x408(0x4)
	bool                                                         zoomOutDone;                                       // 0x40c(0x1)
	bool                                                         zoomDone;                                          // 0x40d(0x1)
	char                                                         pad0x2_J1EV7[0x2];                                 // 0x40e(0x2)
	animblueprintgeneratedclass BP_Anim_CharacterSelect_C*       pirateLineUpAnimgraph;                             // 0x410(0x8)
	struct Vector                                                selectedPirateLoc;                                 // 0x418(0xc)
	struct Rotator                                               selectedPirateRot;                                 // 0x424(0xc)
	bool                                                         PiratesInitialized;                                // 0x430(0x1)
	bool                                                         PirateSelected;                                    // 0x431(0x1)
	bool                                                         mouseDown;                                         // 0x432(0x1)
	bool                                                         mouseDragging;                                     // 0x433(0x1)
	float                                                        mouseStartX;                                       // 0x434(0x4)
	blueprintgeneratedclass BP_CarouselCam_C*                    BP_CarouselCam_C_2_ExecuteUbergraph_sot_frontend_01_a_RefProperty; // 0x438(0x8)
	class MatineeActor*                                          MatineeActor_PirateSelect_ExecuteUbergraph_sot_frontend_01_a_RefProperty; // 0x440(0x8)
	blueprintgeneratedclass BP_CarouselCam_C*                    BP_CarouselCam_C_2_UniqueObjectNameForCooking_232772163_RefProperty; // 0x448(0x8)
};


