#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x8
struct SpireInfo
{
public:
	int                                                          LevelId;                                           // 0x0(0x4)
	bool                                                         ShouldBeLoaded;                                    // 0x4(0x1)
	bool                                                         ShouldBeVisible;                                   // 0x5(0x1)
};


// Size 0x14
struct SpireEntry
{
public:
	struct Vector                                                Location;                                          // 0x0(0xc)
	struct FName                                                 IslandName;                                        // 0xc(0x8)
};


// Size 0x68
struct ServerSpireInfo
{
public:
	int                                                          LevelId;                                           // 0x0(0x4)
	struct Vector                                                Location;                                          // 0x4(0xc)
	class Actor*                                                 SpireActor;                                        // 0x10(0x8)
	map                                                          InstancedLevelPaths;                               // 0x18(0x50)
};


