// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68
struct ServerSpireInfo
{
public:
	int                                                          LevelId;                                           // 0x0(0x4)
	Struct Vector                                                Location;                                          // 0x4(0xc)
	Class Actor*                                                 SpireActor;                                        // 0x10(0x8)
};


// Size 0x8
struct SpireInfo
{
public:
	int                                                          LevelId;                                           // 0x0(0x4)
	bool                                                         ShouldBeLoaded;                                    // 0x4(0x1)
	bool                                                         ShouldBeVisible;                                   // 0x5(0x1)
};


// Size 0x14
struct SpireEntry
{
public:
	Struct Vector                                                Location;                                          // 0x0(0xc)
	struct FName                                                 IslandName;                                        // 0xc(0x8)
};


}