// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xe8 (Full Size[0x4b0] - InheritedSize[0x3c8]
class SplinePathingActor: public Actor
{
public:
	char                                                         pad0x8_J3FDN[0x8];                                 // 0x3c8(0x8)
	Struct ObjectMessagingDispatcher                             ObjectMessageDispatcher;                           // 0x3d0(0xa0)
	TArray<class PrimitiveComponent*>                            PrimitiveActors;                                   // 0x470(0x10)
	Class SceneComponent*                                        Root;                                              // 0x480(0x8)
	Class SplineComponent*                                       Spline;                                            // 0x488(0x8)
	float                                                        Force;                                             // 0x490(0x4)
	float                                                        MaxVelocity;                                       // 0x494(0x4)
	float                                                        DistanceAlongSplineToTarget;                       // 0x498(0x4)
	int                                                          DistanceFromDestination;                           // 0x49c(0x4)
	char                                                         pad0x10_40VMB[0x10];                               // 0x4a0(0x10)
};


}