// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x8
class BP_Trinket_WoodenHead_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   arn_pirate_01_a;                                   // 0x3f8(0x8)
};


// Size 0x18
class BP_Trinket_PotionBottles_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   ptn_pois_01_b;                                     // 0x3f8(0x8)
	Class StaticMeshComponent*                                   ptn_pois_01_c;                                     // 0x400(0x8)
	Class StaticMeshComponent*                                   ptn_pois_01_d;                                     // 0x408(0x8)
};


// Size 0x8
class BP_Trinket_Pot_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   cmn_clay_pot_01_a;                                 // 0x3f8(0x8)
};


// Size 0x28
class BP_Trinket_PanStack_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   cmn_cooking__pot_011;                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_cooking__pot_01;                               // 0x400(0x8)
	Class StaticMeshComponent*                                   cmn_fishing_cooker_lid_01_a;                       // 0x408(0x8)
	Class StaticMeshComponent*                                   shp_fry_pan_01_a1;                                 // 0x410(0x8)
	Class StaticMeshComponent*                                   shp_fry_pan_01_a;                                  // 0x418(0x8)
};


// Size 0x8
class BP_Trinket_DishStack_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   cmn_clay_dish_stack_01_a;                          // 0x3f8(0x8)
};


// Size 0x8
class BP_Trinket_Dish_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   cmn_clay_dish_01_b;                                // 0x3f8(0x8)
};


// Size 0x18
class BP_Trinket_TeaSet_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   cmn_wpnsmith_item_05_a;                            // 0x3f8(0x8)
	Class StaticMeshComponent*                                   bld_enc_shop_kettle_01_a;                          // 0x400(0x8)
	Class StaticMeshComponent*                                   cmn_wpnsmith_item_05_a1;                           // 0x408(0x8)
};


// Size 0x10
class BP_Trinket_Tankards_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   tls_tankard_01_b;                                  // 0x3f8(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b1;                                 // 0x400(0x8)
};


// Size 0x20
class BP_Trinket_PaintSet_02_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   bld_cls_shp_dye_pot_01_a;                          // 0x3f8(0x8)
	Class StaticMeshComponent*                                   bld_enc_shop_sign_01_a;                            // 0x400(0x8)
	Class StaticMeshComponent*                                   cmn_paintbrush_01_a1;                              // 0x408(0x8)
	Class StaticMeshComponent*                                   cmn_paintbrush_01_a;                               // 0x410(0x8)
};


// Size 0x8
class BP_Trinket_IncenseBurner_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   bld_enc_shop_burner_pot_01_a;                      // 0x3f8(0x8)
};


// Size 0x10
class BP_Trinket_FlowerBottle_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   wsp_flower_01_b;                                   // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a;                                   // 0x400(0x8)
};


// Size 0x10
class BP_Trinket_FlowerBoot_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   tri_com_wsp_flower_04_a;                           // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_boots_03_a_R;                                  // 0x400(0x8)
};


// Size 0x8
class BP_Trinket_FishBones_02_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   gmp_fishing_bones_01_a;                            // 0x3f8(0x8)
};


// Size 0x10
class BP_Trinket_ColoredBottles_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   cmn_hair_dye_bottle_01_a;                          // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a;                                   // 0x400(0x8)
};


// Size 0x10
class BP_Trinket_BonsaiTree_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   gmp_bonsai_emote_01_b;                             // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_wpnsmith_item_05_a;                            // 0x400(0x8)
};


// Size 0x10
class BP_Trinket_BoneDish_01_a_C: public BP_Trinket_StandingSmall_C
{
public:
	Class StaticMeshComponent*                                   gmp_pl_cabin_dogBowl_a_02;                         // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_clay_dish_01_b;                                // 0x400(0x8)
};


}