// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x8
class BP_Trinket_WoodStack_01_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   bld_tvn_wood_holder_01_a;                          // 0x3f8(0x8)
};


// Size 0x10
class BP_Trinket_Target_01_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   wpn_boarding_axe_smp_01_a;                         // 0x3f8(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_sign_standing_01_a;                   // 0x400(0x8)
};


// Size 0x18
class BP_Trinket_SwordBucket_01_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   gmp_wood_sword_emote_01_a;                         // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_bucket_01_a;                                   // 0x400(0x8)
	Class StaticMeshComponent*                                   gmp_wood_sword_emote_01_a1;                        // 0x408(0x8)
};


// Size 0x8
class BP_Trinket_SkullStand_01_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   bld_skull_stand_oos_01_a;                          // 0x3f8(0x8)
};


// Size 0x10
class BP_Trinket_ScrollBucket_01_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   gmp_map_bundle_01_a;                               // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_bucket_01_a;                                   // 0x400(0x8)
};


// Size 0x8
class BP_Trinket_Sack_01_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   sod_cmn_sack_01_a;                                 // 0x3f8(0x8)
};


// Size 0x8
class BP_Trinket_RopeSpool_01_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   bld_out_shop_bobbin_01_a;                          // 0x3f8(0x8)
};


// Size 0x8
class BP_Trinket_Rope_01_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   shp_rope_coil_03_a;                                // 0x3f8(0x8)
};


// Size 0x10
class BP_Trinket_Plant_06_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   bsp_bush_disc_01_a;                                // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a;                                   // 0x400(0x8)
};


// Size 0x10
class BP_Trinket_Plant_05_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_05_b;                                     // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a;                                   // 0x400(0x8)
};


// Size 0x10
class BP_Trinket_Plant_04_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_06_a;                                     // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_clay_vase_01_a;                                // 0x400(0x8)
};


// Size 0x10
class BP_Trinket_Plant_02_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_fern_01_a;                                // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_clay_pot_01_a;                                 // 0x400(0x8)
};


// Size 0x10
class BP_Trinket_Plant_01_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_03_a;                                     // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_clay_pot_01_a;                                 // 0x400(0x8)
};


// Size 0x8
class BP_Trinket_DVRRock_01_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   dvr_lv_projectile_01_a;                            // 0x3f8(0x8)
};


// Size 0x8
class BP_Trinket_DVRCrystal_02_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   dvr_lv_rock_large_01_c;                            // 0x3f8(0x8)
};


// Size 0x8
class BP_Trinket_BrokenPot_02_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   cmn_clay_pot_01_b;                                 // 0x3f8(0x8)
};


// Size 0x10
class BP_Trinket_Boots_01_a_C: public BP_Trinket_StandingLarge_C
{
public:
	Class StaticMeshComponent*                                   cmn_boots_02_a_L;                                  // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_boots_02_a_R;                                  // 0x400(0x8)
};


}