// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class StatusBase: public Object
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class StatusResponse: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ActivateableSurfaceMaterialStatusZoneInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class AppliedStatusToSelfStatCondition: public TargetedStatCondition
{
public:
	TArray<class Class*>                                         Status;                                            // 0x30(0x10)
	byte                                                         ComparisonMode;                                    // 0x40(0x1)
	char                                                         pad0x7_UJW0T[0x7];                                 // 0x41(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BuffReceiverInterface: public Interface
{
public:
};


// Size 0x10 (Full Size[0xd8] - InheritedSize[0xc8]
class BuffReceiverComponent: public ActorComponent
{
public:
	char                                                         pad0x8_PX88R[0x8];                                 // 0xc8(0x8)
	bool                                                         CanReceiveBuff;                                    // 0xd0(0x1)
	char                                                         pad0x7_U5860[0x7];                                 // 0xd1(0x7)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class DebugMenuStatusDataAsset: public DataAsset
{
public:
	TArray<struct StatusDefinitions>                             StatusDefinitions;                                 // 0x28(0x10)
	TArray<Float Durations>                                      Durations;                                         // 0x38(0x10)
};


// Size 0x8 (Full Size[0x3d0] - InheritedSize[0x3c8]
class DebugStatusTicketHolder: public Actor
{
public:
	Class Actor*                                                 StatusRecipient;                                   // 0x3c8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StatusEffectCancellationInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StatusEffectRecipientInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StatusEffectResponseConfigurationInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StatusEffectSuspensionInterface: public Interface
{
public:
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class StatusResponseAsset: public DataAsset
{
public:
	Struct FText                                                 HighFrequencyTriggerStatusHelper;                  // 0x28(0x38)
	TArray<class Class*>                                         TriggerStatus;                                     // 0x60(0x10)
	TArray<class StatusResponse*>                                Responses;                                         // 0x70(0x10)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class StatusRecipientResponseList: public DataAsset
{
public:
	TArray<class StatusResponseAsset*>                           ResponseAssets;                                    // 0x28(0x10)
	TArray<struct FeatureToggledResponseLists>                   FeatureToggledResponseLists;                       // 0x38(0x10)
	TArray<class StatusResponseAsset*>                           FinalResponseAssets;                               // 0x48(0x10)
};


// Size 0x38 (Full Size[0x100] - InheritedSize[0xc8]
class LightWeightStatusEffectManagerComponent: public ActorComponent
{
public:
	char                                                         pad0x20_7WP6A[0x20];                               // 0xc8(0x20)
	Class StatusRecipientResponseList*                           RecipientResponseList;                             // 0xe8(0x8)
	TArray<struct ActiveEffects>                                 ActiveEffects;                                     // 0xf0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class MaterialStatusSusceptibilityInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SurfaceMaterialStatusZoneInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0xf8] - InheritedSize[0xc8]
class MaterialStatusSusceptibilityComponent: public ActorComponent
{
public:
	char                                                         pad0x8_VWCRY[0x8];                                 // 0xc8(0x8)
	Class PhysicalMaterial*                                      CurrentSurfaceMaterial;                            // 0xd0(0x8)
	char                                                         pad0x20_ET2U2[0x20];                               // 0xd8(0x20)
};


// Size 0xc0 (Full Size[0x488] - InheritedSize[0x3c8]
class SphericalStatusEffectZone: public Actor
{
public:
	char                                                         pad0x8_GC727[0x8];                                 // 0x3c8(0x8)
	Class ActorActivationComponent*                              ActorActivationComponent;                          // 0x3d0(0x8)
	Class SphereComponent*                                       SphereComponent;                                   // 0x3d8(0x8)
	Class StatusEffectVolumeComponent*                           StatusEffectVolumeComponent;                       // 0x3e0(0x8)
	char                                                         pad0xa0_ISXXP[0xa0];                               // 0x3e8(0xa0)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class StatusApplicationDesc: public Object
{
public:
	Struct EventAppliedStatusToTargets                           ApplicationEvent;                                  // 0x28(0x28)
};


// Size 0x8 (Full Size[0xd0] - InheritedSize[0xc8]
class StatusApplicationMonitorComponent: public ActorComponent
{
public:
	class                                                        StatusApplicationTrigger;                          // 0xc8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StatusEffectHelperFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StatusEffectTicketDispenserInterface: public Interface
{
public:
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class StatusEffectManagerComponent: public ActorComponent
{
public:
	char                                                         pad0x28_VX3Y7[0x28];                               // 0xc8(0x28)
	Class StatusRecipientResponseList*                           RecipientResponseList;                             // 0xf0(0x8)
	TArray<struct ActiveEffects>                                 ActiveEffects;                                     // 0xf8(0x10)
};


// Size 0x20 (Full Size[0x4c0] - InheritedSize[0x4a0]
class StatusEffectOverlapZone: public SimpleOverlapZone
{
public:
	TArray<struct StatusesToApplyOnOverlap>                      StatusesToApplyOnOverlap;                          // 0x4a0(0x10)
	char                                                         pad0x10_F14KD[0x10];                               // 0x4b0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StatusEffectPersistenceInterface: public Interface
{
public:
};


// Size 0x8 (Full Size[0xd0] - InheritedSize[0xc8]
class StatusEffectPersistenceComponent: public ActorComponent
{
public:
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class StatusEffectsSettings: public DeveloperSettings
{
public:
	Struct StringAssetReference                                  DebugMenuStatusDefinitionsDataAsset;               // 0x38(0x10)
};


// Size 0x20 (Full Size[0x300] - InheritedSize[0x2e0]
class StatusEffectVolumeComponent: public SceneComponent
{
public:
	bool                                                         UseOverlapEventsFromParentComponent;               // 0x2e0(0x1)
	char                                                         pad0x7_M21OT[0x7];                                 // 0x2e1(0x7)
	TArray<struct StatusEffectsToMaintain>                       StatusEffectsToMaintain;                           // 0x2e8(0x10)
	char                                                         pad0x8_N35S4[0x8];                                 // 0x2f8(0x8)
};


// Size 0x8 (Full Size[0x38] - InheritedSize[0x30]
class SetCanReceiveBuffStatusResponse: public StatusResponse
{
public:
	bool                                                         LockBuffReceiver;                                  // 0x30(0x1)
	bool                                                         RevertOnDeactivate;                                // 0x31(0x1)
	char                                                         pad0x6_KK4PO[0x6];                                 // 0x32(0x6)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class StatusResponseNull: public StatusResponse
{
public:
};


}