// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x30 (Full Size[0x80] - InheritedSize[0x50]
class ActiveStorySpawnRequirement: public SpawnRequirement
{
public:
	TArray<struct FName>                                         StoryNames;                                        // 0x50(0x10)
	bool                                                         AllStoriesRequired;                                // 0x60(0x1)
	char                                                         pad0x1f_NXOHC[0x1f];                               // 0x61(0x1f)
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class IsStoryActiveNPCDialogConditional: public NPCDialogConditional
{
public:
	Struct StoryFlag                                             StoryFlag;                                         // 0x30(0x8)
	char                                                         pad0x10_L9EYY[0x10];                               // 0x38(0x10)
};


// Size 0x28 (Full Size[0xf0] - InheritedSize[0xc8]
class StoryClaimableResourceComponent: public ActorComponent
{
public:
	Struct StoryFlag                                             ClaimedStoryFlag;                                  // 0xc8(0x8)
	char                                                         pad0x20_0LDL6[0x20];                               // 0xd0(0x20)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StoryClaimedResourcesServiceInterface: public Interface
{
public:
};


// Size 0xc0 (Full Size[0x488] - InheritedSize[0x3c8]
class StoryClaimedResourcesService: public Actor
{
public:
	char                                                         pad0x60_Y7XVI[0x60];                               // 0x3c8(0x60)
	TArray<Weakclass PendingClaims>                              PendingClaims;                                     // 0x428(0x10)
	char                                                         pad0x50_77ETN[0x50];                               // 0x438(0x50)
};


// Size 0x30 (Full Size[0x360] - InheritedSize[0x330]
class StoryDrivenBlendedLightingZoneComponent: public BlendedLightingZoneComponent
{
public:
	Class StoryDrivenBlendedLightingZoneComponentDataAsset*      StoryDrivenLightingAssetsCollection;               // 0x328(0x8)
	Struct LightingZoneStoryRelatedSettings                      CurrentStoryResponse;                              // 0x330(0x10)
	char                                                         pad0x20_NHH99[0x20];                               // 0x340(0x20)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class StoryDrivenBlendedLightingZoneComponentDataAsset: public DataAsset
{
public:
	Struct FeatureFlag                                           Feature;                                           // 0x28(0xc)
	char                                                         pad0x4_PJHLL[0x4];                                 // 0x34(0x4)
	TArray<struct StoryResponses>                                StoryResponses;                                    // 0x38(0x10)
	TArray<class StoryDrivenBlendedLightingZoneComponentDataAsset*> AssetsList;                                        // 0x48(0x10)
};


// Size 0x30 (Full Size[0x5b0] - InheritedSize[0x580]
class StoryDrivenSalvageItemSpawnComponent: public SalvageItemSpawnComponent
{
public:
	Struct StoryFlag                                             Story;                                             // 0x580(0x8)
	char                                                         pad0x28_A8LB3[0x28];                               // 0x588(0x28)
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class StorySpawnedActorsComponent: public ActorComponent
{
public:
	Class StorySpawnedActorsComponentDataAsset*                  AssetsCollection;                                  // 0xc8(0x8)
	char                                                         pad0x38_GDPR4[0x38];                               // 0xd0(0x38)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class StorySpawnedActorsComponentDataAsset: public DataAsset
{
public:
	Struct FeatureFlag                                           Feature;                                           // 0x28(0xc)
	char                                                         pad0x4_MLD2J[0x4];                                 // 0x34(0x4)
	TArray<struct StoryResponses>                                StoryResponses;                                    // 0x38(0x10)
	TArray<class StorySpawnedActorsComponentDataAsset*>          AssetsList;                                        // 0x48(0x10)
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class StorySpawnedActorsDataAsset: public DataAsset
{
public:
	Struct FeatureFlag                                           Feature;                                           // 0x28(0xc)
	char                                                         pad0x4_TJB2U[0x4];                                 // 0x34(0x4)
	TArray<struct StoryResponses>                                StoryResponses;                                    // 0x38(0x10)
	TArray<class StorySpawnedActorsDataAsset*>                   AssetsList;                                        // 0x48(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StorySpawnedActorsServiceInterface: public Interface
{
public:
};


// Size 0x138 (Full Size[0x500] - InheritedSize[0x3c8]
class StorySpawnedActorsService: public Actor
{
public:
	char                                                         pad0x18_BYCBA[0x18];                               // 0x3c8(0x18)
	TArray<class StorySpawnedActorsComponent*>                   EarlyRegisteredComponents;                         // 0x3e0(0x10)
	Class StorySpawnedActorsDataAsset*                           Asset;                                             // 0x3f0(0x8)
	char                                                         pad0x108_D1QZ9[0x108];                             // 0x3f8(0x108)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class StorySpawnedActorsSettings: public DeveloperSettings
{
public:
	Struct StringAssetReference                                  StorySpawnActorsDataAssetLocation;                 // 0x38(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class DebugStoryServiceCheatInterface: public Interface
{
public:
};


// Size 0x58 (Full Size[0x420] - InheritedSize[0x3c8]
class DebugStoryServiceCheat: public Actor
{
public:
	char                                                         pad0x8_TNNCE[0x8];                                 // 0x3c8(0x8)
	TArray<struct AllStories>                                    AllStories;                                        // 0x3d0(0x10)
	TArray<Str AllIncludeFilters>                                AllIncludeFilters;                                 // 0x3e0(0x10)
	TArray<Str AllExcludeFilters>                                AllExcludeFilters;                                 // 0x3f0(0x10)
	char                                                         pad0x20_31FAE[0x20];                               // 0x400(0x20)
};


// Size 0x10 (Full Size[0x48] - InheritedSize[0x38]
class StorySettings: public DeveloperSettings
{
public:
	Struct StringAssetReference                                  StoryNamesCollectionDataAssetLocation;             // 0x38(0x10)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class StoryNamesCollectionDataAsset: public DataAsset
{
public:
	TArray<struct Stories>                                       Stories;                                           // 0x28(0x10)
	TArray<class StoryNamesCollectionDataAsset*>                 StoriesAssets;                                     // 0x38(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class StoryServiceInterface: public Interface
{
public:
};


// Size 0xd8 (Full Size[0x4a0] - InheritedSize[0x3c8]
class StoryService: public Actor
{
public:
	char                                                         pad0x28_WHEVR[0x28];                               // 0x3c8(0x28)
	TArray<struct Stories>                                       Stories;                                           // 0x3f0(0x10)
	TArray<struct ActiveStories>                                 ActiveStories;                                     // 0x400(0x10)
	char                                                         pad0x90_13SV8[0x90];                               // 0x410(0x90)
};


}