// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10
class IsStoryActiveNPCDialogConditional: public NPCDialogConditional
{
public:
};


// Size 0x40
class StoryDrivenBlendedLightingZoneComponent: public BlendedLightingZoneComponent
{
public:
	TArray<Struct LightingZoneStoryRelatedSettings>              StoryResponses;                                    // 0x328(0x10)
	int                                                          CurrentStoryResponseIndex;                         // 0x338(0x4)
};


// Size 0x18
class StoryNPCDialogConditionalContext: public NPCDialogConditionalContext
{
public:
	TArray<Struct FName>                                         StoryNames;                                        // 0x28(0x10)
	bool                                                         NeedsAllStories;                                   // 0x38(0x1)
};


// Size 0x0
class StoryNPCDialogOverrideType: public NPCDialogOverrideType
{
public:
};


// Size 0x0
class StoryServiceInterface: public Interface
{
public:
};


// Size 0xe8
class StoryService: public Actor
{
public:
	TArray<Struct StoryInfo>                                     Stories;                                           // 0x3f8(0x10)
	TArray<Struct StoryInfo>                                     ActiveStories;                                     // 0x408(0x10)
};


// Size 0x10
class StorySpawnedActorsCollectionDataAsset: public DataAsset
{
public:
	TArray<class StorySpawnedActorsAssetList*>                   StorySpawnedActorsAssetList;                       // 0x28(0x10)
};


// Size 0x30
class StorySpawnedActorsComponent: public ActorComponent
{
public:
	Class StorySpawnedActorsComponentCollectionDataAsset*        AssetsCollection;                                  // 0xc8(0x8)
};


// Size 0x10
class StorySpawnedActorsComponentCollectionDataAsset: public DataAsset
{
public:
	TArray<class StorySpawnedActorsAssetList*>                   StorySpawnedActorsAssetList;                       // 0x28(0x10)
};


// Size 0x18
class StorySpawnedActorsComponentDataAsset: public DataAsset
{
public:
	Struct FeatureFlag                                           Feature;                                           // 0x28(0x8)
	TArray<Struct StorySpawnedNamedPointsList>                   StorySpawnedActorsList;                            // 0x30(0x10)
};


// Size 0x18
class StorySpawnedActorsDataAsset: public DataAsset
{
public:
	Struct FeatureFlag                                           Feature;                                           // 0x28(0x8)
	TArray<Struct StorySpawnedActorsList>                        StorySpawnedActorsList;                            // 0x30(0x10)
};


// Size 0x0
class StorySpawnedActorsServiceInterface: public Interface
{
public:
};


// Size 0x208
class StorySpawnedActorsService: public Actor
{
public:
	Struct StoriesToSpawnedActorsListContainer                   GlobalSpawnedActors;                               // 0x3d8(0x50)
	Class StorySpawnedActorsCollectionDataAsset*                 Asset;                                             // 0x4c8(0x8)
};


// Size 0x10
class StorySpawnedActorsSettings: public DeveloperSettings
{
public:
	Struct StringAssetReference                                  StorySpawnActorsCollectionDataAssetLocation;       // 0x38(0x10)
};


}