// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x30
class ActiveStorySpawnRequirement: public SpawnRequirement
{
public:
	TArray<Struct FName>                                         StoryNames;                                        // 0x50(0x10)
	bool                                                         AllStoriesRequired;                                // 0x60(0x1)
};


// Size 0x10
class IsStoryActiveNPCDialogConditional: public NPCDialogConditional
{
public:
};


// Size 0x28
class StoryClaimableResourceComponent: public ActorComponent
{
public:
	Struct StoryFlag                                             ClaimedStoryFlag;                                  // 0xc8(0x8)
};


// Size 0x0
class StoryClaimedResourcesServiceInterface: public Interface
{
public:
};


// Size 0xd0
class StoryClaimedResourcesService: public Actor
{
public:
	TArray<Weakclass PendingClaims>                              PendingClaims;                                     // 0x428(0x10)
};


// Size 0x40
class StoryDrivenBlendedLightingZoneComponent: public BlendedLightingZoneComponent
{
public:
	Class StoryDrivenBlendedLightingZoneComponentCollectionDataAsset* StoryDrivenLightingAssetsCollection;               // 0x328(0x8)
	Struct LightingZoneStoryRelatedSettings                      CurrentStoryResponse;                              // 0x330(0x10)
};


// Size 0x18
class StoryDrivenBlendedLightingZoneComponentDataAsset: public DataAsset
{
public:
	Struct FeatureFlag                                           Feature;                                           // 0x28(0x8)
	TArray<Struct LightingZoneStoryRelatedSettings>              StoryResponses;                                    // 0x30(0x10)
};


// Size 0x10
class StoryDrivenBlendedLightingZoneComponentCollectionDataAsset: public DataAsset
{
public:
	TArray<class StoryDrivenLightingAssetList*>                  StoryDrivenLightingAssetList;                      // 0x28(0x10)
};


// Size 0x30
class StoryDrivenSalvageItemSpawnComponent: public SalvageItemSpawnComponent
{
public:
	Struct StoryFlag                                             Story;                                             // 0x560(0x8)
};


// Size 0x8
class StoryNPCDialogConditionalContext: public NPCDialogConditionalContext
{
public:
	Struct StoryFlag                                             StoryFlag;                                         // 0x28(0x8)
};


// Size 0x0
class StoryNPCDialogOverrideType: public NPCDialogOverrideType
{
public:
};


// Size 0x20
class StorySpawnedActorsCollectionDataAsset: public DataAsset
{
public:
	TArray<class StorySpawnedActorsAssetList*>                   StorySpawnedActorsAssetList;                       // 0x28(0x10)
	TArray<class StorySpawnedActorsCollectionList*>              StorySpawnedActorsCollectionList;                  // 0x38(0x10)
};


// Size 0x30
class StorySpawnedActorsComponent: public ActorComponent
{
public:
	Class StorySpawnedActorsComponentCollectionDataAsset*        AssetsCollection;                                  // 0xc8(0x8)
};


// Size 0x20
class StorySpawnedActorsComponentCollectionDataAsset: public DataAsset
{
public:
	TArray<class StorySpawnedActorsAssetList*>                   StorySpawnedActorsAssetList;                       // 0x28(0x10)
	TArray<class StorySpawnedActorsCollectionList*>              StorySpawnedActorsCollectionList;                  // 0x38(0x10)
};


// Size 0x18
class StorySpawnedActorsComponentDataAsset: public DataAsset
{
public:
	Struct FeatureFlag                                           Feature;                                           // 0x28(0x8)
	TArray<Struct StorySpawnedNamedPointsList>                   StorySpawnedActorsList;                            // 0x30(0x10)
};


// Size 0x18
class StorySpawnedActorsDataAsset: public DataAsset
{
public:
	Struct FeatureFlag                                           Feature;                                           // 0x28(0x8)
	TArray<Struct StorySpawnedActorsList>                        StorySpawnedActorsList;                            // 0x30(0x10)
};


// Size 0x0
class StorySpawnedActorsServiceInterface: public Interface
{
public:
};


// Size 0x138
class StorySpawnedActorsService: public Actor
{
public:
	TArray<class EarlyRegisteredComponents*>                     EarlyRegisteredComponents;                         // 0x3e0(0x10)
	Class StorySpawnedActorsCollectionDataAsset*                 Asset;                                             // 0x3f0(0x8)
};


// Size 0x10
class StorySpawnedActorsSettings: public DeveloperSettings
{
public:
	Struct StringAssetReference                                  StorySpawnActorsCollectionDataAssetLocation;       // 0x38(0x10)
};


// Size 0x0
class DebugStoryServiceCheatInterface: public Interface
{
public:
};


// Size 0x48
class DebugStoryServiceCheat: public Actor
{
public:
	TArray<Struct StoryInfo>                                     AllStories;                                        // 0x3d0(0x10)
	TArray<Str AllFilters>                                       AllFilters;                                        // 0x3e0(0x10)
};


// Size 0x10
class StorySettings: public DeveloperSettings
{
public:
	Struct StringAssetReference                                  StoryNamesCollectionDataAssetLocation;             // 0x38(0x10)
};


// Size 0x20
class StoryNamesCollectionDataAsset: public DataAsset
{
public:
	TArray<Struct StoryNameInfo>                                 Stories;                                           // 0x28(0x10)
	TArray<class StoriesAssets*>                                 StoriesAssets;                                     // 0x38(0x10)
};


// Size 0x0
class StoryServiceInterface: public Interface
{
public:
};


// Size 0xe8
class StoryService: public Actor
{
public:
	TArray<Struct StoryInfo>                                     Stories;                                           // 0x3f0(0x10)
	TArray<Struct StoryInfo>                                     ActiveStories;                                     // 0x400(0x10)
};


}