// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0
class TestLevelScriptActor: public LevelScriptActor
{
public:
	byte                                                         Category;                                          // 0x3d8(0x1)
	byte                                                         Area;                                              // 0x3d9(0x1)
	bool                                                         VisualTest;                                        // 0x3da(0x1)
	bool                                                         RunInEditor;                                       // 0x3db(0x1)
	bool                                                         RunOnServer;                                       // 0x3dc(0x1)
	bool                                                         RequiresServices;                                  // 0x3dd(0x1)
	TArray<Struct TestLevelMetadataEntry>                        AdditionalMetadata;                                // 0x3e0(0x10)
	byte                                                         CaptureType;                                       // 0x3f0(0x1)
	byte                                                         PlayModeOverride;                                  // 0x3f1(0x1)
	float                                                        TestTimeout;                                       // 0x3f4(0x4)
	float                                                        TestPausedTimeout;                                 // 0x3f8(0x4)
	TArray<Str VerboseLogCategories>                             VerboseLogCategories;                              // 0x400(0x10)
	TArray<Int ClientsRunning>                                   ClientsRunning;                                    // 0x410(0x10)
	TArray<Int ClientIds>                                        ClientIds;                                         // 0x420(0x10)
	TArray<Struct ClientPawnDetails>                             ClientPawns;                                       // 0x430(0x10)
	TArray<class Actor*>                                         SpawnedActors;                                     // 0x440(0x10)
	int                                                          NextSpawnedActorIndex;                             // 0x450(0x4)
};


// Size 0x0
class ActorThatLogsErrorWhenTicked: public Actor
{
public:
};


// Size 0x10
class AssetAuditSettings: public DeveloperSettings
{
public:
	TArray<Str PathsToAuditOnSave>                               PathsToAuditOnSave;                                // 0x38(0x10)
};


// Size 0x0
class AutomationBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x38
class AutomationLatentActionCallback: public Object
{
public:
};


// Size 0x0
class BPNamedObjectMock: public Object
{
public:
};


// Size 0x0
class DummyReplicatedActor: public Actor
{
public:
};


// Size 0x0
class MapFixtureTestGameMode: public GameMode
{
public:
};


// Size 0x8
class ObjectWithSettableWorld: public Object
{
public:
	Class World*                                                 World;                                             // 0x28(0x8)
};


// Size 0x0
class TestUObject: public Object
{
public:
};


// Size 0x0
class OtherTestUObject: public Object
{
public:
};


// Size 0x0
class RunUnitTestsCommandlet: public Commandlet
{
public:
};


// Size 0x0
class TestablePlayerController: public PlayerController
{
public:
};


// Size 0x0
class TestablePlayerControllerInterface: public Interface
{
public:
};


// Size 0x20
class TestablePlayerControllerComponent: public ActorComponent
{
public:
};


// Size 0x0
class TestAbstractActor: public Actor
{
public:
};


// Size 0x0
class TestSettings: public DeveloperSettings
{
public:
};


// Size 0x50
class TextureAuditorSettings: public TestSettings
{
public:
	TArray<Struct StringAssetReference>                          SpecificTexturesToNotAudit;                        // 0x38(0x10)
	TArray<Struct DirectoryPath>                                 TextureDirectoriesToNotAudit;                      // 0x48(0x10)
	Struct TextureAuditorProperties                              DefaultTextureProperties;                          // 0x58(0x20)
	TArray<Struct TextureAuditorGroupProperties>                 PerTextureGroupPropertiesOverrides;                // 0x78(0x10)
};


}