#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x28
struct BodyFramePair
{
public:
	class TaleQuestIndexedFrame*                                 Frame;                                             // 0x10(0x8)
	interface                                                    Body;                                              // 0x18(0x10)
};


// Size 0x40
struct TaleQuestQueryableStateReadAllValueBoolCondition
{
public:
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
};


// Size 0x38
struct TaleQuestQueryableStateReadValueIntCondition
{
public:
	class UClass*                                                DataID;                                            // 0x28(0x8)
	int                                                          ExpectedValue;                                     // 0x30(0x4)
	char                                                         ComparisonToExpectedValue;                         // 0x34(0x1)
};


// Size 0x14
struct IslandTypeWeights
{
public:
	float                                                        FeatureIslandWeight;                               // 0x0(0x4)
	float                                                        ResourceIslandWeight;                              // 0x4(0x4)
	float                                                        OutpostIslandWeight;                               // 0x8(0x4)
	float                                                        SeapostIslandWeight;                               // 0xc(0x4)
	float                                                        FortIslandWeight;                                  // 0x10(0x4)
};


// Size 0x10
struct TaleQuestPredicateBranchedTaskDesc
{
public:
	int                                                          BranchIndex;                                       // 0x0(0x4)
	class TaleQuestStepDesc*                                     BranchedTask;                                      // 0x8(0x8)
};


// Size 0x20
struct InteractionOptionSelectedWithQueryableStateNonUI
{
public:
	class UClass*                                                DataID;                                            // 0x0(0x8)
	struct Guid                                                  InstigatorCrewID;                                  // 0x8(0x10)
	class Actor*                                                 InteractingPlayer;                                 // 0x18(0x8)
};


// Size 0x40
struct StepMerchantItemDesc
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Icon;                                              // 0x38(0x8)
};


// Size 0x20
struct TaleQuestQueryableStateDataInfoId
{
public:
	struct Guid                                                  MyTaleId;                                          // 0x0(0x10)
	struct Guid                                                  MyScopeId;                                         // 0x10(0x10)
};


// Size 0x28
struct PhasedItem
{
public:
	class ItemProxy*                                             ItemProxy;                                         // 0x0(0x8)
	class ItemInfo*                                              ItemInfo;                                          // 0x8(0x8)
	bool                                                         Tracked;                                           // 0x10(0x1)
};


// Size 0x48
struct PredicatedBranchedTask
{
public:
	interface                                                    Task;                                              // 0x0(0x10)
};


// Size 0x3
struct TaleActorSpawnParameters
{
public:
	bool                                                         Tracked;                                           // 0x0(0x1)
	bool                                                         GatherForMigration;                                // 0x1(0x1)
	bool                                                         DeferredSpawning;                                  // 0x2(0x1)
};


// Size 0x18
struct SetDialogueInteractionEnabledClientCommand
{
public:
	class Object*                                                DialogueComponentObject;                           // 0x8(0x8)
	bool                                                         ShouldBeEnabled;                                   // 0x10(0x1)
};


// Size 0x10
struct TaleQuestToggledDefinition
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x0(0x8)
	class UClass*                                                Definition;                                        // 0x8(0x8)
};


// Size 0x10
struct MigrationActionPair
{
public:
	struct TaleResourceHandle                                    AllocatedResourceHandle;                           // 0x0(0x8)
	class TaleMigrationAction*                                   MigrationAction;                                   // 0x8(0x8)
};


// Size 0x20
struct PhasedActor
{
public:
	class Actor*                                                 MapActor;                                          // 0x0(0x8)
	class Actor*                                                 Actor;                                             // 0x8(0x8)
};


// Size 0x1
struct EventModalInteractionStateChanged
{
public:
	bool                                                         IsInteractionBlocked;                              // 0x0(0x1)
};


// Size 0x20
struct EndOnScreenParticlesRpc
{
public:
	class ParticleSystem*                                        Particles;                                         // 0x18(0x8)
};


// Size 0x40
struct TaleQuestDeliverableItem
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Icon;                                              // 0x38(0x8)
};


// Size 0x28
struct TaleQuestForEachCrewTask
{
public:
	interface                                                    Task;                                              // 0x0(0x10)
};


// Size 0x40
struct TaleQuestQueryableStateCanAnyDataBeReadCondition
{
public:
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
};


// Size 0x60
struct SnapshottedActorData
{
public:
	interface                                                    Instagator;                                        // 0x0(0x10)
	struct Guid                                                  SnapshotID;                                        // 0x10(0x10)
	bool                                                         ActorWasCritical;                                  // 0x20(0x1)
	bool                                                         ActorWasTracked;                                   // 0x21(0x1)
	struct FText                                                 FailureMessage;                                    // 0x28(0x38)
};


// Size 0x4
struct TaleQuestSelectorServiceSeedSetTelemetryEvent
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
};


// Size 0x28
struct SetNextMontageSectionCommand
{
public:
	struct FName                                                 FromSectionName;                                   // 0x18(0x8)
	struct FName                                                 ToSectionName;                                     // 0x20(0x8)
};


// Size 0x40
struct CriticalActorWrapper
{
public:
	class Actor*                                                 CriticalActor;                                     // 0x0(0x8)
};


// Size 0x80
struct TaleQuestDesc
{
public:
	class TaleQuestStepDesc*                                     Root;                                              // 0x28(0x8)
	class Object*                                                Definition;                                        // 0x30(0x8)
	struct FText                                                 TaleFailMessage;                                   // 0x38(0x38)
	struct FName                                                 TaleFailBannerTag;                                 // 0x70(0x8)
	bool                                                         ShouldFireStartTallTaleTrackedObjective;           // 0x78(0x1)
	bool                                                         Development;                                       // 0x79(0x1)
};


// Size 0x20
struct TriggerOnScreenParticlesRpc
{
public:
	class ParticleSystem*                                        Particles;                                         // 0x18(0x8)
};


// Size 0x40
struct StepBountyTargetDesc
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Portrait;                                          // 0x38(0x8)
};


// Size 0x40
struct TaleQuestQueryableStateCanAllDataBeReadCondition
{
public:
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
};


// Size 0x10
struct TaleQuestContextInvalidTelemetryEvent
{
public:
	struct FName                                                 StepType;                                          // 0x0(0x8)
	struct FName                                                 Tale;                                              // 0x8(0x8)
};


// Size 0x40
struct TaleQuestQueryableStateReadAnyValueBoolCondition
{
public:
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
};


// Size 0x30
struct ToggleModalInteractionNetworkEvent
{
public:
	struct NetActorPtr                                           TargetActor;                                       // 0x18(0x14)
	bool                                                         InteractionBlocked;                                // 0x2c(0x1)
};


// Size 0x10
struct TrackedActorData
{
public:
	class Actor*                                                 Actor;                                             // 0x0(0x8)
};


// Size 0x48
struct CompondNodePinDesc
{
public:
	struct FText                                                 DisplayName;                                       // 0x0(0x38)
	struct Guid                                                  PinId;                                             // 0x38(0x10)
};


// Size 0x18
struct MontageAnimationCommandBase
{
public:
	class Actor*                                                 MyTarget;                                          // 0x8(0x8)
	class AnimMontage*                                           MyMontage;                                         // 0x10(0x8)
};


// Size 0xc
struct PhaseBranchIndexPlayerAssignment
{
public:
	class Controller*                                            Player;                                            // 0x0(0x8)
	int                                                          AssignedPhaseBranchIndex;                          // 0x8(0x4)
};


// Size 0x18
struct TaleQuestCargoRunContractItem
{
public:
	class UClass*                                                ItemToCollect;                                     // 0x0(0x8)
};


// Size 0x38
struct TaleQuestDeliveryRequest
{
public:
	int                                                          Id;                                                // 0x0(0x4)
	struct MerchantContractItemDesc                              Item;                                              // 0x8(0x28)
	int                                                          NumToDeliver;                                      // 0x30(0x4)
	int                                                          NumToAllocate;                                     // 0x34(0x4)
};


// Size 0x48
struct CriticalActorDelegateData
{
public:
	class Actor*                                                 CriticalActor;                                     // 0x0(0x8)
	struct FText                                                 FailureMessage;                                    // 0x8(0x38)
};


// Size 0x20
struct StopMontageAnimationCommand
{
public:
	float                                                        BlendOutTime;                                      // 0x18(0x4)
};


// Size 0x20
struct TaleQuestFailedEvent
{
public:
	TArray<struct Guid>                                          CrewIds;                                           // 0x0(0x10)
	struct Guid                                                  QuestId;                                           // 0x10(0x10)
};


// Size 0x20
struct PlayMontageAnimationCommand
{
public:
	float                                                        PlayRate;                                          // 0x18(0x4)
	float                                                        Position;                                          // 0x1c(0x4)
};


// Size 0x20
struct JumpToMontageSectionCommand
{
public:
	struct FName                                                 SectionName;                                       // 0x18(0x8)
};


// Size 0x8
struct ActorSpawnedAutomationEvent
{
public:
	class Actor*                                                 Actor;                                             // 0x0(0x8)
};


// Size 0x48
struct SetDialogueInteractionPromptClientCommand
{
public:
	class NPCDialogComponent*                                    DialogueComponent;                                 // 0x8(0x8)
	struct FText                                                 Prompt;                                            // 0x10(0x38)
};


// Size 0x18
struct DebugTalePhaseBranchAssignedForPlayerEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	class Controller*                                            Player;                                            // 0x10(0x8)
};


// Size 0x30
struct TaleQuestQueryableStateDataInfo
{
public:
	struct TaleQuestQueryableStateDataInfoId                     InfoId;                                            // 0x0(0x20)
	class UClass*                                                DataID;                                            // 0x20(0x8)
	bool                                                         DataBool;                                          // 0x28(0x1)
	int                                                          DataInt;                                           // 0x2c(0x4)
};


// Size 0x28
struct DebugOnTalePhaseBranchAssignedForPlayerNetworkEvent
{
public:
	struct PhaseBranchIndexPlayerAssignment                      Assignment;                                        // 0x18(0xc)
};


// Size 0x30
struct QueryableStateChangedEvent
{
public:
	struct TaleQuestQueryableStateDataInfo                       DataValue;                                         // 0x0(0x30)
};


