#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x10
struct TaleQuestToggledDefinition
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x0(0x8)
	class UClass*                                                Definition;                                        // 0x8(0x8)
};


// Size 0x38
struct TaleQuestDeliveryRequest
{
public:
	int                                                          Id;                                                // 0x0(0x4)
	char                                                         pad0x4_G0VUS[0x4];                                 // 0x4(0x4)
	struct MerchantContractItemDesc                              Item;                                              // 0x8(0x28)
	int                                                          NumToDeliver;                                      // 0x30(0x4)
	int                                                          NumToAllocate;                                     // 0x34(0x4)
};


// Size 0x30
struct QuestVariableObjectArray
{
public:
	char                                                         pad0x30_FBORQ[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct JumpToMontageSectionCommand
{
public:
	char                                                         pad0x18_555N2[0x18];                               // 0x0(0x18)
	struct FName                                                 SectionName;                                       // 0x18(0x8)
};


// Size 0x48
struct PredicatedBranchedTask
{
public:
	char                                                         pad0x48_U73WV[0x48];                               // 0x0(0x48)
};


// Size 0x30
struct ToggleModalInteractionNetworkEvent
{
public:
	char                                                         pad0x18_FT8Y0[0x18];                               // 0x0(0x18)
	struct NetActorPtr                                           TargetActor;                                       // 0x18(0x14)
	bool                                                         InteractionBlocked;                                // 0x2c(0x1)
	char                                                         pad0x3_KKKIE[0x3];                                 // 0x2d(0x3)
};


// Size 0x10
struct TaleQuestPredicateBranchedTaskDesc
{
public:
	int                                                          BranchIndex;                                       // 0x0(0x4)
	char                                                         pad0x4_K2TT3[0x4];                                 // 0x4(0x4)
	class TaleQuestStepDesc*                                     BranchedTask;                                      // 0x8(0x8)
};


// Size 0x18
struct PlaySequencerAutomationEvent
{
public:
	char                                                         pad0x18_B3Z2H[0x18];                               // 0x0(0x18)
};


// Size 0x1
struct EventSpawnedTallTaleQuestItem
{
public:
	char                                                         pad0x1_K27QM[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct DebugTalePhaseBranchAssignedForPlayerEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	char                                                         pad0x8_0LK50[0x8];                                 // 0x10(0x8)
};


// Size 0x40
struct StepMerchantItemDesc
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Icon;                                              // 0x38(0x8)
};


// Size 0x28
struct SetNextMontageSectionCommand
{
public:
	char                                                         pad0x18_HWKWW[0x18];                               // 0x0(0x18)
	struct FName                                                 FromSectionName;                                   // 0x18(0x8)
	struct FName                                                 ToSectionName;                                     // 0x20(0x8)
};


// Size 0x20
struct EndOnScreenParticlesRpc
{
public:
	char                                                         pad0x18_95POG[0x18];                               // 0x0(0x18)
	class ParticleSystem*                                        Particles;                                         // 0x18(0x8)
};


// Size 0x28
struct PhasedItem
{
public:
	class ItemProxy*                                             ItemProxy;                                         // 0x0(0x8)
	class ItemInfo*                                              ItemInfo;                                          // 0x8(0x8)
	bool                                                         Tracked;                                           // 0x10(0x1)
	char                                                         pad0x17_W9ZEV[0x17];                               // 0x11(0x17)
};


// Size 0x40
struct TaleQuestQueryableStateReadAllValueBoolCondition
{
public:
	char                                                         pad0x28_SGK1A[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_Y5EQU[0x7];                                 // 0x39(0x7)
};


// Size 0x20
struct ParticpantToolGroup
{
public:
	char                                                         pad0x20_3KLIV[0x20];                               // 0x0(0x20)
};


// Size 0x30
struct QuestVariableItemDescType
{
public:
	char                                                         pad0x30_FERZZ[0x30];                               // 0x0(0x30)
};


// Size 0x40
struct TaleQuestQueryableStateCanAnyDataBeReadCondition
{
public:
	char                                                         pad0x28_HGW1O[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_NDHRV[0x7];                                 // 0x39(0x7)
};


// Size 0x10
struct MigrationActionPair
{
public:
	struct TaleResourceHandle                                    AllocatedResourceHandle;                           // 0x0(0x8)
	class TaleMigrationAction*                                   MigrationAction;                                   // 0x8(0x8)
};


// Size 0x30
struct QuestVariableTexture
{
public:
	char                                                         pad0x30_QBJAC[0x30];                               // 0x0(0x30)
};


// Size 0x18
struct MontageAnimationCommandBase
{
public:
	char                                                         pad0x8_56OUO[0x8];                                 // 0x0(0x8)
	class Actor*                                                 MyTarget;                                          // 0x8(0x8)
	class AnimMontage*                                           MyMontage;                                         // 0x10(0x8)
};


// Size 0x40
struct StepBountyTargetDesc
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Portrait;                                          // 0x38(0x8)
};


// Size 0x30
struct QuestVariableLinkEQSContext
{
public:
	char                                                         pad0x30_02NLM[0x30];                               // 0x0(0x30)
};


// Size 0x48
struct CompondNodePinDesc
{
public:
	struct FText                                                 DisplayName;                                       // 0x0(0x38)
	struct Guid                                                  PinId;                                             // 0x38(0x10)
};


// Size 0x28
struct TaleQuestForEachCrewTask
{
public:
	char                                                         pad0x28_3GPZ1[0x28];                               // 0x0(0x28)
};


// Size 0x4
struct TaleQuestSelectorServiceSeedSetTelemetryEvent
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
};


// Size 0x20
struct TriggerOnScreenParticlesRpc
{
public:
	char                                                         pad0x18_H56GL[0x18];                               // 0x0(0x18)
	class ParticleSystem*                                        Particles;                                         // 0x18(0x8)
};


// Size 0x14
struct IslandTypeWeights
{
public:
	float                                                        FeatureIslandWeight;                               // 0x0(0x4)
	float                                                        ResourceIslandWeight;                              // 0x4(0x4)
	float                                                        OutpostIslandWeight;                               // 0x8(0x4)
	float                                                        SeapostIslandWeight;                               // 0xc(0x4)
	float                                                        FortIslandWeight;                                  // 0x10(0x4)
};


// Size 0x40
struct TaleQuestQueryableStateReadAnyValueBoolCondition
{
public:
	char                                                         pad0x28_Q39CL[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_AFEK9[0x7];                                 // 0x39(0x7)
};


// Size 0x40
struct NameRedirectionTypeInfo
{
public:
	char                                                         NameRedirectionType;                               // 0x0(0x1)
	char                                                         pad0x7_6KSPY[0x7];                                 // 0x1(0x7)
	struct FText                                                 RedirectedName;                                    // 0x8(0x38)
};


// Size 0x1
struct SplineFootprintPathTool
{
public:
	char                                                         pad0x1_R4ALT[0x1];                                 // 0x0(0x1)
};


// Size 0x3
struct TaleActorSpawnParameters
{
public:
	bool                                                         Tracked;                                           // 0x0(0x1)
	bool                                                         GatherForMigration;                                // 0x1(0x1)
	bool                                                         DeferredSpawning;                                  // 0x2(0x1)
};


// Size 0x20
struct TaleQuestFailedEvent
{
public:
	TArray<struct Guid>                                          CrewIds;                                           // 0x0(0x10)
	struct Guid                                                  QuestId;                                           // 0x10(0x10)
};


// Size 0x48
struct SetDialogueInteractionPromptClientCommand
{
public:
	char                                                         pad0x8_507OP[0x8];                                 // 0x0(0x8)
	class NPCDialogComponent*                                    DialogueComponent;                                 // 0x8(0x8)
	struct FText                                                 Prompt;                                            // 0x10(0x38)
};


// Size 0x30
struct QuestVariableArray
{
public:
	char                                                         pad0x30_J4QGH[0x30];                               // 0x0(0x30)
};


// Size 0x1
struct TaleQuestStopPermanentPromptEvent
{
public:
	char                                                         pad0x1_R8HCE[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct SetDialogueInteractionEnabledClientCommand
{
public:
	char                                                         pad0x8_4WTO2[0x8];                                 // 0x0(0x8)
	class Object*                                                DialogueComponentObject;                           // 0x8(0x8)
	bool                                                         ShouldBeEnabled;                                   // 0x10(0x1)
	char                                                         pad0x7_4E713[0x7];                                 // 0x11(0x7)
};


// Size 0xc
struct PhaseBranchIndexPlayerAssignment
{
public:
	char                                                         pad0x8_LZ7V8[0x8];                                 // 0x0(0x8)
	int                                                          AssignedPhaseBranchIndex;                          // 0x8(0x4)
};


// Size 0x40
struct TaleQuestDeliverableItem
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Icon;                                              // 0x38(0x8)
};


// Size 0x30
struct QuestVariableTaleResourceHandle
{
public:
	char                                                         pad0x30_RQD5M[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableMerchantItem
{
public:
	char                                                         pad0x30_8NHU9[0x30];                               // 0x0(0x30)
};


// Size 0x48
struct CriticalActorDelegateData
{
public:
	class Actor*                                                 CriticalActor;                                     // 0x0(0x8)
	struct FText                                                 FailureMessage;                                    // 0x8(0x38)
	char                                                         pad0x8_Q7ZOG[0x8];                                 // 0x40(0x8)
};


// Size 0x20
struct InteractionOptionSelectedWithQueryableStateNonUI
{
public:
	class UClass*                                                DataID;                                            // 0x0(0x8)
	struct Guid                                                  InstigatorCrewID;                                  // 0x8(0x10)
	class Actor*                                                 InteractingPlayer;                                 // 0x18(0x8)
};


// Size 0x80
struct TaleQuestDesc
{
public:
	char                                                         pad0x28_N10OG[0x28];                               // 0x0(0x28)
	class TaleQuestStepDesc*                                     Root;                                              // 0x28(0x8)
	class Object*                                                Definition;                                        // 0x30(0x8)
	struct FText                                                 TaleFailMessage;                                   // 0x38(0x38)
	struct FName                                                 TaleFailBannerTag;                                 // 0x70(0x8)
	bool                                                         ShouldFireStartTallTaleTrackedObjective;           // 0x78(0x1)
	bool                                                         Development;                                       // 0x79(0x1)
	char                                                         pad0x6_06WXP[0x6];                                 // 0x7a(0x6)
};


// Size 0x20
struct StopMontageAnimationCommand
{
public:
	char                                                         pad0x18_O8EER[0x18];                               // 0x0(0x18)
	float                                                        BlendOutTime;                                      // 0x18(0x4)
	char                                                         pad0x4_O91M4[0x4];                                 // 0x1c(0x4)
};


// Size 0x40
struct CriticalActorWrapper
{
public:
	class Actor*                                                 CriticalActor;                                     // 0x0(0x8)
	char                                                         pad0x38_1VG2M[0x38];                               // 0x8(0x38)
};


// Size 0x20
struct PlayMontageAnimationCommand
{
public:
	char                                                         pad0x18_WHPRU[0x18];                               // 0x0(0x18)
	float                                                        PlayRate;                                          // 0x18(0x4)
	float                                                        Position;                                          // 0x1c(0x4)
};


// Size 0x30
struct QuestVariableCollection
{
public:
	char                                                         pad0x30_A5847[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableAny
{
public:
	char                                                         pad0x30_TQMG4[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableActorArray
{
public:
	char                                                         pad0x30_MIT7S[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableItemInfo
{
public:
	char                                                         pad0x30_RLSGB[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableAISpawner
{
public:
	char                                                         pad0x30_7HXLE[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableGameEvent
{
public:
	char                                                         pad0x30_HDIC3[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableGuidArray
{
public:
	char                                                         pad0x30_REU8N[0x30];                               // 0x0(0x30)
};


// Size 0x60
struct SnapshottedActorData
{
public:
	char                                                         pad0x10_OAYJH[0x10];                               // 0x0(0x10)
	struct Guid                                                  SnapshotID;                                        // 0x10(0x10)
	bool                                                         ActorWasCritical;                                  // 0x20(0x1)
	bool                                                         ActorWasTracked;                                   // 0x21(0x1)
	char                                                         pad0x6_WRDUY[0x6];                                 // 0x22(0x6)
	struct FText                                                 FailureMessage;                                    // 0x28(0x38)
};


// Size 0x48
struct CutsceneEndedTelemetryEvent
{
public:
	struct Guid                                                  CutsceneId;                                        // 0x0(0x10)
	struct FString                                               CutsceneName;                                      // 0x10(0x10)
	float                                                        CutsceneDuration;                                  // 0x20(0x4)
	float                                                        CutscenePlayTime;                                  // 0x24(0x4)
	TArray<String>                                               ParticipatingPlayers;                              // 0x28(0x10)
	TArray<struct Guid>                                          ParticipatingCrewIds;                              // 0x38(0x10)
};


// Size 0x48
struct CutsceneStartedTelemetryEvent
{
public:
	struct Guid                                                  CutsceneId;                                        // 0x0(0x10)
	struct FString                                               CutsceneName;                                      // 0x10(0x10)
	float                                                        CutsceneDuration;                                  // 0x20(0x4)
	bool                                                         IsLooping;                                         // 0x24(0x1)
	char                                                         pad0x3_45RMA[0x3];                                 // 0x25(0x3)
	TArray<String>                                               ParticipatingPlayers;                              // 0x28(0x10)
	TArray<struct Guid>                                          ParticipatingCrewIds;                              // 0x38(0x10)
};


// Size 0x30
struct QuestVariableClassArray
{
public:
	char                                                         pad0x30_HFNYH[0x30];                               // 0x0(0x30)
};


// Size 0x10
struct TrackedActorData
{
public:
	class Actor*                                                 Actor;                                             // 0x0(0x8)
	char                                                         pad0x8_9U89F[0x8];                                 // 0x8(0x8)
};


// Size 0x30
struct QuestVariableSetEQSTaleContextValue
{
public:
	char                                                         pad0x30_8P442[0x30];                               // 0x0(0x30)
};


// Size 0x28
struct BodyFramePair
{
public:
	char                                                         pad0x10_20U0O[0x10];                               // 0x0(0x10)
	class TaleQuestIndexedFrame*                                 Frame;                                             // 0x10(0x8)
	char                                                         pad0x10_HSD7D[0x10];                               // 0x18(0x10)
};


// Size 0x18
struct TaleQuestCargoRunContractItem
{
public:
	class UClass*                                                ItemToCollect;                                     // 0x0(0x8)
	char                                                         pad0x10_2PCZZ[0x10];                               // 0x8(0x10)
};


// Size 0x20
struct TaleQuestQueryableStateDataInfoId
{
public:
	struct Guid                                                  MyTaleId;                                          // 0x0(0x10)
	struct Guid                                                  MyScopeId;                                         // 0x10(0x10)
};


// Size 0x10
struct TaleQuestContextInvalidTelemetryEvent
{
public:
	struct FName                                                 StepType;                                          // 0x0(0x8)
	struct FName                                                 Tale;                                              // 0x8(0x8)
};


// Size 0x30
struct QuestVariableBountyTargetArray
{
public:
	char                                                         pad0x30_B60ZS[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct PhasedActor
{
public:
	class Actor*                                                 MapActor;                                          // 0x0(0x8)
	class Actor*                                                 Actor;                                             // 0x8(0x8)
	char                                                         pad0x10_KKAU6[0x10];                               // 0x10(0x10)
};


// Size 0x30
struct QuestVariableItemDescTypeArray
{
public:
	char                                                         pad0x30_F65KI[0x30];                               // 0x0(0x30)
};


// Size 0x1
struct EventModalInteractionStateChanged
{
public:
	bool                                                         IsInteractionBlocked;                              // 0x0(0x1)
};


// Size 0x40
struct TaleQuestQueryableStateCanAllDataBeReadCondition
{
public:
	char                                                         pad0x28_5E1B4[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_I9Z3H[0x7];                                 // 0x39(0x7)
};


// Size 0x30
struct QuestVariablePageLayout
{
public:
	char                                                         pad0x30_FIMRU[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct TaleQuestPhaseClusterRootActor
{
public:
	char                                                         pad0x30_TITK5[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableActorAssetType
{
public:
	char                                                         pad0x30_768NG[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableMerchantItemArray
{
public:
	char                                                         pad0x30_0SEXS[0x30];                               // 0x0(0x30)
};


// Size 0x38
struct TaleQuestQueryableStateReadValueIntCondition
{
public:
	char                                                         pad0x28_6PUS7[0x28];                               // 0x0(0x28)
	class UClass*                                                DataID;                                            // 0x28(0x8)
	int                                                          ExpectedValue;                                     // 0x30(0x4)
	char                                                         ComparisonToExpectedValue;                         // 0x34(0x1)
	char                                                         pad0x3_CBZ00[0x3];                                 // 0x35(0x3)
};


// Size 0x30
struct QuestVariablePrioritisedPrompt
{
public:
	char                                                         pad0x30_KNG15[0x30];                               // 0x0(0x30)
};


// Size 0x8
struct ActorSpawnedAutomationEvent
{
public:
	char                                                         pad0x8_ZW5A8[0x8];                                 // 0x0(0x8)
};


// Size 0x30
struct QuestVariableRotator
{
public:
	char                                                         pad0x30_2HM8J[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableActorAssetTypeArray
{
public:
	char                                                         pad0x30_3LBZI[0x30];                               // 0x0(0x30)
};


// Size 0x28
struct DebugOnTalePhaseBranchAssignedForPlayerNetworkEvent
{
public:
	char                                                         pad0x18_YC56Q[0x18];                               // 0x0(0x18)
	struct PhaseBranchIndexPlayerAssignment                      Assignment;                                        // 0x18(0xc)
	char                                                         pad0x4_0B9IK[0x4];                                 // 0x24(0x4)
};


// Size 0x48
struct NameRedirectionData
{
public:
	struct FText                                                 OriginalName;                                      // 0x0(0x38)
	TArray<struct NameRedirectionTypeInfo>                       RedirectedNames;                                   // 0x38(0x10)
};


// Size 0x30
struct TaleQuestQueryableStateDataInfo
{
public:
	struct TaleQuestQueryableStateDataInfoId                     InfoId;                                            // 0x0(0x20)
	class UClass*                                                DataID;                                            // 0x20(0x8)
	bool                                                         DataBool;                                          // 0x28(0x1)
	char                                                         pad0x3_SXHT2[0x3];                                 // 0x29(0x3)
	int                                                          DataInt;                                           // 0x2c(0x4)
};


// Size 0x30
struct QueryableStateChangedEvent
{
public:
	struct TaleQuestQueryableStateDataInfo                       DataValue;                                         // 0x0(0x30)
};


