// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x38
struct TaleQuestDeliveryRequest
{
public:
	int                                                          Id;                                                // 0x0(0x4)
	Struct MerchantContractItemDesc                              Item;                                              // 0x8(0x28)
	int                                                          NumToDeliver;                                      // 0x30(0x4)
	int                                                          NumToAllocate;                                     // 0x34(0x4)
};


// Size 0x3
struct TaleActorSpawnParameters
{
public:
	bool                                                         Tracked;                                           // 0x0(0x1)
	bool                                                         GatherForMigration;                                // 0x1(0x1)
	bool                                                         DeferredSpawning;                                  // 0x2(0x1)
};


// Size 0x14
struct IslandTypeWeights
{
public:
	float                                                        FeatureIslandWeight;                               // 0x0(0x4)
	float                                                        ResourceIslandWeight;                              // 0x4(0x4)
	float                                                        OutpostIslandWeight;                               // 0x8(0x4)
	float                                                        SeapostIslandWeight;                               // 0xc(0x4)
	float                                                        FortIslandWeight;                                  // 0x10(0x4)
};


// Size 0x20
struct QuestVariableAny
{
public:
};


// Size 0x1
struct SplineFootprintPathTool
{
public:
};


// Size 0x18
struct TaleQuestCargoRunContractItem
{
public:
	class                                                        ItemToCollect;                                     // 0x0(0x8)
};


// Size 0x80
struct TaleQuestDesc
{
public:
	Class TaleQuestStepDesc*                                     Root;                                              // 0x28(0x8)
	Class Object*                                                Definition;                                        // 0x30(0x8)
	Struct FText                                                 TaleFailMessage;                                   // 0x38(0x38)
	struct FName                                                 TaleFailBannerTag;                                 // 0x70(0x8)
	bool                                                         ShouldFireStartTallTaleTrackedObjective;           // 0x78(0x1)
	bool                                                         Development;                                       // 0x79(0x1)
};


// Size 0x10
struct TaleQuestToggledDefinition
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x0(0x8)
	class                                                        Definition;                                        // 0x8(0x8)
};


// Size 0x10
struct TrackedActorData
{
public:
	Class Actor*                                                 Actor;                                             // 0x0(0x8)
};


// Size 0x60
struct SnapshottedActorData
{
public:
	Struct Guid                                                  SnapshotID;                                        // 0x10(0x10)
	bool                                                         ActorWasCritical;                                  // 0x20(0x1)
	bool                                                         ActorWasTracked;                                   // 0x21(0x1)
	Struct FText                                                 FailureMessage;                                    // 0x28(0x38)
};


// Size 0x48
struct CriticalActorDelegateData
{
public:
	Class Actor*                                                 CriticalActor;                                     // 0x0(0x8)
	Struct FText                                                 FailureMessage;                                    // 0x8(0x38)
};


// Size 0x40
struct CriticalActorWrapper
{
public:
	Class Actor*                                                 CriticalActor;                                     // 0x0(0x8)
};


// Size 0x28
struct PhasedItem
{
public:
	Class ItemProxy*                                             ItemProxy;                                         // 0x0(0x8)
	Class ItemInfo*                                              ItemInfo;                                          // 0x8(0x8)
	bool                                                         Tracked;                                           // 0x10(0x1)
};


// Size 0x20
struct PhasedActor
{
public:
	Class Actor*                                                 MapActor;                                          // 0x0(0x8)
	Class Actor*                                                 Actor;                                             // 0x8(0x8)
};


// Size 0x20
struct QuestVariableCollection
{
public:
};


// Size 0x20
struct QuestVariableArray
{
public:
};


// Size 0x20
struct QuestVariableGuidArray
{
public:
};


// Size 0x20
struct QuestVariableActorArray
{
public:
};


// Size 0x20
struct QuestVariableObjectArray
{
public:
};


// Size 0x20
struct QuestVariableClassArray
{
public:
};


// Size 0x20
struct QuestVariableSetEQSTaleContextValue
{
public:
};


// Size 0x20
struct QuestVariableLinkEQSContext
{
public:
};


// Size 0x20
struct ParticpantToolGroup
{
public:
};


// Size 0x10
struct MigrationActionPair
{
public:
	Struct TaleResourceHandle                                    AllocatedResourceHandle;                           // 0x0(0x8)
	Class TaleMigrationAction*                                   MigrationAction;                                   // 0x8(0x8)
};


// Size 0x20
struct QuestVariableRotator
{
public:
};


// Size 0x20
struct QuestVariableActorAssetType
{
public:
};


// Size 0x28
struct BodyFramePair
{
public:
	Class TaleQuestIndexedFrame*                                 Frame;                                             // 0x10(0x8)
};


// Size 0x20
struct QuestVariableItemDescType
{
public:
};


// Size 0x20
struct QuestVariableItemInfo
{
public:
};


// Size 0x20
struct QuestVariablePrioritisedPrompt
{
public:
};


// Size 0x20
struct QuestVariableTaleResourceHandle
{
public:
};


// Size 0x8
struct ActorSpawnedAutomationEvent
{
public:
};


// Size 0x1
struct EventSpawnedTallTaleQuestItem
{
public:
};


// Size 0x4
struct TaleQuestSelectorServiceSeedSetTelemetryEvent
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
};


// Size 0x18
struct PlaySequencerAutomationEvent
{
public:
};


// Size 0x1
struct EventModalInteractionStateChanged
{
public:
	bool                                                         IsInteractionBlocked;                              // 0x0(0x1)
};


// Size 0x20
struct ToggleModalInteractionNetworkEvent
{
public:
	Class Actor*                                                 TargetActor;                                       // 0x10(0x8)
	bool                                                         InteractionBlocked;                                // 0x18(0x1)
};


// Size 0x20
struct QuestVariableMerchantItemArray
{
public:
};


// Size 0x20
struct QuestVariableMerchantItem
{
public:
};


// Size 0x40
struct StepMerchantItemDesc
{
public:
	Struct FText                                                 Name;                                              // 0x0(0x38)
	Class Texture*                                               Icon;                                              // 0x38(0x8)
};


// Size 0x20
struct QuestVariableActorAssetTypeArray
{
public:
};


// Size 0x20
struct QuestVariableItemDescTypeArray
{
public:
};


// Size 0x20
struct QuestVariablePageLayout
{
public:
};


// Size 0x20
struct QuestVariableTexture
{
public:
};


// Size 0x10
struct TaleQuestContextInvalidTelemetryEvent
{
public:
	struct FName                                                 StepType;                                          // 0x0(0x8)
	struct FName                                                 Tale;                                              // 0x8(0x8)
};


// Size 0x40
struct TaleQuestDeliverableItem
{
public:
	Struct FText                                                 Name;                                              // 0x0(0x38)
	Class Texture*                                               Icon;                                              // 0x38(0x8)
};


// Size 0x20
struct QuestVariableBountyTargetArray
{
public:
};


// Size 0x40
struct StepBountyTargetDesc
{
public:
	Struct FText                                                 Name;                                              // 0x0(0x38)
	Class Texture*                                               Portrait;                                          // 0x38(0x8)
};


}