// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x38
struct TaleQuestDeliveryRequest
{
public:
	int                                                          Id;                                                // 0x0(0x4)
	char                                                         pad0x4_02QK0[0x4];                                 // 0x4(0x4)
	struct MerchantContractItemDesc                              Item;                                              // 0x8(0x28)
	int                                                          NumToDeliver;                                      // 0x30(0x4)
	int                                                          NumToAllocate;                                     // 0x34(0x4)
};


// Size 0x3
struct TaleActorSpawnParameters
{
public:
	bool                                                         Tracked;                                           // 0x0(0x1)
	bool                                                         GatherForMigration;                                // 0x1(0x1)
	bool                                                         DeferredSpawning;                                  // 0x2(0x1)
};


// Size 0x14
struct IslandTypeWeights
{
public:
	float                                                        FeatureIslandWeight;                               // 0x0(0x4)
	float                                                        ResourceIslandWeight;                              // 0x4(0x4)
	float                                                        OutpostIslandWeight;                               // 0x8(0x4)
	float                                                        SeapostIslandWeight;                               // 0xc(0x4)
	float                                                        FortIslandWeight;                                  // 0x10(0x4)
};


// Size 0x30
struct QuestVariableAny
{
public:
	char                                                         pad0x30_9HNTE[0x30];                               // 0x0(0x30)
};


// Size 0x1
struct SplineFootprintPathTool
{
public:
	char                                                         pad0x1_TIG8G[0x1];                                 // 0x0(0x1)
};


// Size 0x18
struct TaleQuestCargoRunContractItem
{
public:
	class UClass*                                                ItemToCollect;                                     // 0x0(0x8)
	char                                                         pad0x10_P0K1N[0x10];                               // 0x8(0x10)
};


// Size 0x48
struct CompondNodePinDesc
{
public:
	struct FText                                                 DisplayName;                                       // 0x0(0x38)
	struct Guid                                                  PinId;                                             // 0x38(0x10)
};


// Size 0x80
struct TaleQuestDesc
{
public:
	char                                                         pad0x28_TCZ2M[0x28];                               // 0x0(0x28)
	class TaleQuestStepDesc*                                     Root;                                              // 0x28(0x8)
	class Object*                                                Definition;                                        // 0x30(0x8)
	struct FText                                                 TaleFailMessage;                                   // 0x38(0x38)
	struct FName                                                 TaleFailBannerTag;                                 // 0x70(0x8)
	bool                                                         ShouldFireStartTallTaleTrackedObjective;           // 0x78(0x1)
	bool                                                         Development;                                       // 0x79(0x1)
	char                                                         pad0x6_3KIBP[0x6];                                 // 0x7a(0x6)
};


// Size 0x10
struct TaleQuestToggledDefinition
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x0(0x8)
	class UClass*                                                Definition;                                        // 0x8(0x8)
};


// Size 0xc
struct PhaseBranchIndexPlayerAssignment
{
public:
	char                                                         pad0x8_33VX1[0x8];                                 // 0x0(0x8)
	int                                                          AssignedPhaseBranchIndex;                          // 0x8(0x4)
};


// Size 0x20
struct TaleQuestQueryableStateDataInfoId
{
public:
	struct Guid                                                  MyTaleId;                                          // 0x0(0x10)
	struct Guid                                                  MyScopeId;                                         // 0x10(0x10)
};


// Size 0x30
struct TaleQuestQueryableStateDataInfo
{
public:
	struct TaleQuestQueryableStateDataInfoId                     InfoId;                                            // 0x0(0x20)
	class UClass*                                                DataID;                                            // 0x20(0x8)
	bool                                                         DataBool;                                          // 0x28(0x1)
	char                                                         pad0x3_4FDM6[0x3];                                 // 0x29(0x3)
	int                                                          DataInt;                                           // 0x2c(0x4)
};


// Size 0x10
struct TrackedActorData
{
public:
	class Actor*                                                 Actor;                                             // 0x0(0x8)
	char                                                         pad0x8_08X56[0x8];                                 // 0x8(0x8)
};


// Size 0x60
struct SnapshottedActorData
{
public:
	char                                                         pad0x10_9G5KT[0x10];                               // 0x0(0x10)
	struct Guid                                                  SnapshotID;                                        // 0x10(0x10)
	bool                                                         ActorWasCritical;                                  // 0x20(0x1)
	bool                                                         ActorWasTracked;                                   // 0x21(0x1)
	char                                                         pad0x6_VCPM3[0x6];                                 // 0x22(0x6)
	struct FText                                                 FailureMessage;                                    // 0x28(0x38)
};


// Size 0x48
struct CriticalActorDelegateData
{
public:
	class Actor*                                                 CriticalActor;                                     // 0x0(0x8)
	struct FText                                                 FailureMessage;                                    // 0x8(0x38)
	char                                                         pad0x8_WBNHF[0x8];                                 // 0x40(0x8)
};


// Size 0x40
struct CriticalActorWrapper
{
public:
	class Actor*                                                 CriticalActor;                                     // 0x0(0x8)
	char                                                         pad0x38_M398J[0x38];                               // 0x8(0x38)
};


// Size 0x28
struct PhasedItem
{
public:
	class ItemProxy*                                             ItemProxy;                                         // 0x0(0x8)
	class ItemInfo*                                              ItemInfo;                                          // 0x8(0x8)
	bool                                                         Tracked;                                           // 0x10(0x1)
	char                                                         pad0x17_PSRE0[0x17];                               // 0x11(0x17)
};


// Size 0x20
struct PhasedActor
{
public:
	class Actor*                                                 MapActor;                                          // 0x0(0x8)
	class Actor*                                                 Actor;                                             // 0x8(0x8)
	char                                                         pad0x10_4NVKZ[0x10];                               // 0x10(0x10)
};


// Size 0x30
struct QuestVariableCollection
{
public:
	char                                                         pad0x30_M27EI[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableArray
{
public:
	char                                                         pad0x30_ZXYBV[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableGuidArray
{
public:
	char                                                         pad0x30_QAOMX[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableActorArray
{
public:
	char                                                         pad0x30_HH0VH[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableObjectArray
{
public:
	char                                                         pad0x30_LSI03[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableClassArray
{
public:
	char                                                         pad0x30_M8T7W[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableSetEQSTaleContextValue
{
public:
	char                                                         pad0x30_SZUQ7[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableLinkEQSContext
{
public:
	char                                                         pad0x30_13YB0[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct ParticpantToolGroup
{
public:
	char                                                         pad0x20_BBLZN[0x20];                               // 0x0(0x20)
};


// Size 0x10
struct MigrationActionPair
{
public:
	struct TaleResourceHandle                                    AllocatedResourceHandle;                           // 0x0(0x8)
	class TaleMigrationAction*                                   MigrationAction;                                   // 0x8(0x8)
};


// Size 0x30
struct QuestVariableRotator
{
public:
	char                                                         pad0x30_5ZZNM[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableActorAssetType
{
public:
	char                                                         pad0x30_CKJL5[0x30];                               // 0x0(0x30)
};


// Size 0x28
struct BodyFramePair
{
public:
	char                                                         pad0x10_VFJ6N[0x10];                               // 0x0(0x10)
	class TaleQuestIndexedFrame*                                 Frame;                                             // 0x10(0x8)
	char                                                         pad0x10_9BJFO[0x10];                               // 0x18(0x10)
};


// Size 0x28
struct TaleQuestForEachCrewTask
{
public:
	char                                                         pad0x28_GHL1Q[0x28];                               // 0x0(0x28)
};


// Size 0x1
struct TaleQuestStopPermanentPromptEvent
{
public:
	char                                                         pad0x1_4T5CI[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct TaleQuestPhaseClusterRootActor
{
public:
	char                                                         pad0x30_4VYUP[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableItemDescType
{
public:
	char                                                         pad0x30_KVHCC[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableItemInfo
{
public:
	char                                                         pad0x30_ZX2R0[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariablePrioritisedPrompt
{
public:
	char                                                         pad0x30_HR7WU[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableGameEvent
{
public:
	char                                                         pad0x30_H4OJ8[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableAISpawner
{
public:
	char                                                         pad0x30_P7WV5[0x30];                               // 0x0(0x30)
};


// Size 0x40
struct TaleQuestQueryableStateCanAllDataBeReadCondition
{
public:
	char                                                         pad0x28_LI6YO[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_VZUWM[0x7];                                 // 0x39(0x7)
};


// Size 0x40
struct TaleQuestQueryableStateCanAnyDataBeReadCondition
{
public:
	char                                                         pad0x28_TWVC0[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_E3DCL[0x7];                                 // 0x39(0x7)
};


// Size 0x40
struct TaleQuestQueryableStateReadAllValueBoolCondition
{
public:
	char                                                         pad0x28_TKC7G[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_B2NTH[0x7];                                 // 0x39(0x7)
};


// Size 0x40
struct TaleQuestQueryableStateReadAnyValueBoolCondition
{
public:
	char                                                         pad0x28_PS43L[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_GNMBE[0x7];                                 // 0x39(0x7)
};


// Size 0x38
struct TaleQuestQueryableStateReadValueIntCondition
{
public:
	char                                                         pad0x28_V1IND[0x28];                               // 0x0(0x28)
	class UClass*                                                DataID;                                            // 0x28(0x8)
	int                                                          ExpectedValue;                                     // 0x30(0x4)
	byte                                                         ComparisonToExpectedValue;                         // 0x34(0x1)
	char                                                         pad0x3_ZO7C4[0x3];                                 // 0x35(0x3)
};


// Size 0x20
struct InteractionOptionSelectedWithQueryableStateNonUI
{
public:
	class UClass*                                                DataID;                                            // 0x0(0x8)
	struct Guid                                                  InstigatorCrewID;                                  // 0x8(0x10)
	class Actor*                                                 InteractingPlayer;                                 // 0x18(0x8)
};


// Size 0x30
struct QuestVariableTaleResourceHandle
{
public:
	char                                                         pad0x30_8APCO[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct DebugOnTalePhaseBranchAssignedForPlayerNetworkEvent
{
public:
	char                                                         pad0x10_MVLR6[0x10];                               // 0x0(0x10)
	struct PhaseBranchIndexPlayerAssignment                      Assignment;                                        // 0x10(0xc)
	char                                                         pad0x4_WX57G[0x4];                                 // 0x1c(0x4)
};


// Size 0x18
struct DebugTalePhaseBranchAssignedForPlayerEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	char                                                         pad0x8_3AMT9[0x8];                                 // 0x10(0x8)
};


// Size 0x30
struct QueryableStateChangedEvent
{
public:
	struct TaleQuestQueryableStateDataInfo                       DataValue;                                         // 0x0(0x30)
};


// Size 0x8
struct ActorSpawnedAutomationEvent
{
public:
	char                                                         pad0x8_UIB4G[0x8];                                 // 0x0(0x8)
};


// Size 0x1
struct EventSpawnedTallTaleQuestItem
{
public:
	char                                                         pad0x1_F6XY8[0x1];                                 // 0x0(0x1)
};


// Size 0x4
struct TaleQuestSelectorServiceSeedSetTelemetryEvent
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
};


// Size 0x18
struct PlaySequencerAutomationEvent
{
public:
	char                                                         pad0x18_LNEXI[0x18];                               // 0x0(0x18)
};


// Size 0x18
struct MontageAnimationCommandBase
{
public:
	char                                                         pad0x8_0GE1O[0x8];                                 // 0x0(0x8)
	class Actor*                                                 MyTarget;                                          // 0x8(0x8)
	class AnimMontage*                                           MyMontage;                                         // 0x10(0x8)
};


// Size 0x20
struct JumpToMontageSectionCommand
{
public:
	char                                                         pad0x18_UNWII[0x18];                               // 0x0(0x18)
	struct FName                                                 SectionName;                                       // 0x18(0x8)
};


// Size 0x20
struct PlayMontageAnimationCommand
{
public:
	char                                                         pad0x18_BVNVA[0x18];                               // 0x0(0x18)
	float                                                        PlayRate;                                          // 0x18(0x4)
	float                                                        Position;                                          // 0x1c(0x4)
};


// Size 0x28
struct SetNextMontageSectionCommand
{
public:
	char                                                         pad0x18_IHDPN[0x18];                               // 0x0(0x18)
	struct FName                                                 FromSectionName;                                   // 0x18(0x8)
	struct FName                                                 ToSectionName;                                     // 0x20(0x8)
};


// Size 0x20
struct StopMontageAnimationCommand
{
public:
	char                                                         pad0x18_KNR5Z[0x18];                               // 0x0(0x18)
	float                                                        BlendOutTime;                                      // 0x18(0x4)
	char                                                         pad0x4_S5O9M[0x4];                                 // 0x1c(0x4)
};


// Size 0x18
struct SetDialogueInteractionEnabledClientCommand
{
public:
	char                                                         pad0x8_HI7K4[0x8];                                 // 0x0(0x8)
	class Object*                                                DialogueComponentObject;                           // 0x8(0x8)
	bool                                                         ShouldBeEnabled;                                   // 0x10(0x1)
	char                                                         pad0x7_TTOJF[0x7];                                 // 0x11(0x7)
};


// Size 0x48
struct SetDialogueInteractionPromptClientCommand
{
public:
	char                                                         pad0x8_H3UHE[0x8];                                 // 0x0(0x8)
	class NPCDialogComponent*                                    DialogueComponent;                                 // 0x8(0x8)
	struct FText                                                 Prompt;                                            // 0x10(0x38)
};


// Size 0x1
struct EventModalInteractionStateChanged
{
public:
	bool                                                         IsInteractionBlocked;                              // 0x0(0x1)
};


// Size 0x20
struct ToggleModalInteractionNetworkEvent
{
public:
	char                                                         pad0x10_G1OO7[0x10];                               // 0x0(0x10)
	class Actor*                                                 TargetActor;                                       // 0x10(0x8)
	bool                                                         InteractionBlocked;                                // 0x18(0x1)
	char                                                         pad0x7_21Z2S[0x7];                                 // 0x19(0x7)
};


// Size 0x30
struct QuestVariableMerchantItemArray
{
public:
	char                                                         pad0x30_44TO2[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableMerchantItem
{
public:
	char                                                         pad0x30_X1FP3[0x30];                               // 0x0(0x30)
};


// Size 0x40
struct StepMerchantItemDesc
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Icon;                                              // 0x38(0x8)
};


// Size 0x30
struct QuestVariableActorAssetTypeArray
{
public:
	char                                                         pad0x30_77YJL[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableItemDescTypeArray
{
public:
	char                                                         pad0x30_Z4WDG[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariablePageLayout
{
public:
	char                                                         pad0x30_30IYT[0x30];                               // 0x0(0x30)
};


// Size 0x18
struct EndOnScreenParticlesRpc
{
public:
	char                                                         pad0x10_2WG7G[0x10];                               // 0x0(0x10)
	class ParticleSystem*                                        Particles;                                         // 0x10(0x8)
};


// Size 0x18
struct TriggerOnScreenParticlesRpc
{
public:
	char                                                         pad0x10_EJYWA[0x10];                               // 0x0(0x10)
	class ParticleSystem*                                        Particles;                                         // 0x10(0x8)
};


// Size 0x30
struct QuestVariableTexture
{
public:
	char                                                         pad0x30_8JBNE[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct TaleQuestFailedEvent
{
public:
	TArray<struct Guid>                                          CrewIds;                                           // 0x0(0x10)
	struct Guid                                                  QuestId;                                           // 0x10(0x10)
};


// Size 0x10
struct TaleQuestContextInvalidTelemetryEvent
{
public:
	struct FName                                                 StepType;                                          // 0x0(0x8)
	struct FName                                                 Tale;                                              // 0x8(0x8)
};


// Size 0x40
struct TaleQuestDeliverableItem
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Icon;                                              // 0x38(0x8)
};


// Size 0x30
struct QuestVariableBountyTargetArray
{
public:
	char                                                         pad0x30_BANI2[0x30];                               // 0x0(0x30)
};


// Size 0x40
struct StepBountyTargetDesc
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Portrait;                                          // 0x38(0x8)
};


}