// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x220
class TaleNote: public SkeletalMeshWieldableItem
{
public:
	int                                                          CanvasWidth;                                       // 0x790(0x4)
	int                                                          CanvasHeight;                                      // 0x794(0x4)
	float                                                        FontScale;                                         // 0x798(0x4)
	Class Font*                                                  Font;                                              // 0x7a0(0x8)
	Struct TreasureMapWidgetStreamedTexture                      Image;                                             // 0x7a8(0x30)
	Struct TreasureMapWidgetText                                 TitleWidgetText;                                   // 0x7d8(0x38)
	Struct TreasureMapWidgetText                                 BodyWidgetText;                                    // 0x810(0x38)
	float                                                        NoteWidth;                                         // 0x848(0x4)
	float                                                        NoteLineSpacingMultiplier;                         // 0x84c(0x4)
	Struct FText                                                 Title;                                             // 0x850(0x38)
	Struct FText                                                 Body;                                              // 0x888(0x38)
	Class MaybeCompressedCanvasRenderTarget2D*                   RenderTarget;                                      // 0x8c0(0x8)
	Class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x8c8(0x8)
	Class InventoryItemComponent*                                InventoryItemComponent;                            // 0x8d0(0x8)
};


}