// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class TaleQuestStep: public Object
{
public:
	char                                                         pad0x60_7JFR1[0x60];                               // 0x28(0x60)
	Class TaleQuestStepDesc*                                     TaleStepDesc;                                      // 0x88(0x8)
	char                                                         pad0x8_DWCJT[0x8];                                 // 0x90(0x8)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class TaleQuestService: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestServiceDesc: public Object
{
public:
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class TaleQuestStepDesc: public Object
{
public:
	bool                                                         Fork;                                              // 0x28(0x1)
	char                                                         pad0x7_JX5Z2[0x7];                                 // 0x29(0x7)
	char                                                         pad0x50_RT8J3[0x50];                               // 0x30(0x50)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class TaleQuestRunnableStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x98 (Full Size[0x180] - InheritedSize[0xe8]
class TaleQuestFunctionStepLibrary: public TaleQuestRunnableStepDesc
{
public:
	char                                                         pad0x8_LREUN[0x8];                                 // 0xe8(0x8)
	Class Function*                                              Function;                                          // 0xf0(0x8)
	byte                                                         FunctionStepFlags;                                 // 0x178(0x1)
	char                                                         pad0x7_KZVOC[0x7];                                 // 0x179(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleMigrationAction: public Object
{
public:
};


// Size 0x60 (Full Size[0xf8] - InheritedSize[0x98]
class TaleQuestFramedStep: public TaleQuestStep
{
public:
	char                                                         pad0x8_34K3O[0x8];                                 // 0x98(0x8)
	TArray<class TaleQuestService*>                              Services;                                          // 0xa0(0x10)
	Class TaleQuestFramedStepDesc*                               FrameDesc;                                         // 0xb0(0x8)
	Struct UserDefinedStructWithSerialisableValue                Variables;                                         // 0xb8(0x20)
	Struct UserDefinedStructWithSerialisableValue                LocalVariables;                                    // 0xd8(0x20)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class TaleQuestFramedStepDesc: public TaleQuestStepDesc
{
public:
	TArray<class TaleQuestServiceDesc*>                          Services;                                          // 0x80(0x10)
	Struct UserDefinedStructWithSerialisableValue                VariablesWithDefaults;                             // 0x90(0x20)
	Struct InlineUserDefinedStructDetails                        GeneratedVariables;                                // 0xb0(0x8)
};


// Size 0x40 (Full Size[0x108] - InheritedSize[0xc8]
class ContendedResourceComponent: public ActorComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnvQueryContext_TaleContextBase: public EnvQueryContext
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class IslandTypeWeightsDataAsset: public DataAsset
{
public:
	TArray<struct IslandTypeWeightsForDifficultyRanks>           IslandTypeWeightsForDifficultyRanks;               // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestExpressionInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestStepInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0x660] - InheritedSize[0x640]
class SplineFootprintPathComponent: public SplineComponent
{
public:
	float                                                        DistanceBetweenDecals;                             // 0x638(0x4)
	char                                                         pad0x4_8WED0[0x4];                                 // 0x63c(0x4)
	Class MaterialInterface*                                     DecalMaterial;                                     // 0x640(0x8)
	Struct SplineFootprintPathTool                               PathTool;                                          // 0x648(0x1)
	char                                                         pad0x3_LNINU[0x3];                                 // 0x649(0x3)
	float                                                        DecalYaw;                                          // 0x64c(0x4)
	Struct Vector                                                DecalUniformScale;                                 // 0x650(0xc)
	char                                                         pad0x4_IJDGV[0x4];                                 // 0x65c(0x4)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class StartTallTaleConditionalStatTrigger: public ConditionalStatsTriggerType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestArrayEntrySelectionStrategy: public Object
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class FixedArrayEntrySelectionStrategy: public TaleQuestArrayEntrySelectionStrategy
{
public:
	int                                                          IndexToSelect;                                     // 0x28(0x4)
	char                                                         pad0x4_824BY[0x4];                                 // 0x2c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RandomArrayEntrySelectionStrategy: public TaleQuestArrayEntrySelectionStrategy
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class SequentialArrayEntrySelectionStrategy: public TaleQuestArrayEntrySelectionStrategy
{
public:
};


// Size 0x88 (Full Size[0xb0] - InheritedSize[0x28]
class TaleQuestCargoRunContract: public Object
{
public:
	char                                                         pad0x40_R8Q7Y[0x40];                               // 0x28(0x40)
	TArray<struct ItemsToCollect>                                ItemsToCollect;                                    // 0x68(0x10)
	char                                                         pad0x10_UN40A[0x10];                               // 0x78(0x10)
	Class Actor*                                                 DeliverToNPC;                                      // 0x88(0x8)
	Class Actor*                                                 CollectFromNPC;                                    // 0x90(0x8)
	char                                                         pad0x18_SR6WG[0x18];                               // 0x98(0x18)
};


// Size 0x48 (Full Size[0xa8] - InheritedSize[0x60]
class TaleQuestCargoRunContractsService: public TaleQuestService
{
public:
	TArray<class TaleQuestCargoRunContract*>                     Contracts;                                         // 0x60(0x10)
	char                                                         pad0x38_XTWY4[0x38];                               // 0x70(0x38)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestCompoundStepInterface: public Interface
{
public:
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class TaleQuestIndexedFrame: public Object
{
public:
	char                                                         pad0x8_SXAPO[0x8];                                 // 0x28(0x8)
	Class TaleQuestForEachStepDescBase*                          Desc;                                              // 0x30(0x8)
	int                                                          Index;                                             // 0x38(0x4)
	char                                                         pad0x4c_YCKW8[0x4c];                               // 0x3c(0x4c)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class TaleQuestMerchantContract: public Object
{
public:
};


// Size 0x10 (Full Size[0x70] - InheritedSize[0x60]
class TaleQuestMerchantContractsService: public TaleQuestService
{
public:
	TArray<class TaleQuestMerchantContract*>                     Contracts;                                         // 0x60(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestQueryableStateDataID: public Object
{
public:
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class TaleQuestQueryableStateCanAllDataBeReadNPCDialogConditional: public NPCDialogConditional
{
public:
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x30(0x10)
	bool                                                         ExpectedValue;                                     // 0x40(0x1)
	char                                                         pad0x7_E5C40[0x7];                                 // 0x41(0x7)
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class TaleQuestQueryableStateCanAnyDataBeReadNPCDialogConditional: public NPCDialogConditional
{
public:
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x30(0x10)
	bool                                                         ExpectedValue;                                     // 0x40(0x1)
	char                                                         pad0x7_5GWCB[0x7];                                 // 0x41(0x7)
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class TaleQuestQueryableStateReadAllValueBoolNPCDialogConditional: public NPCDialogConditional
{
public:
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x30(0x10)
	bool                                                         ExpectedValue;                                     // 0x40(0x1)
	char                                                         pad0x7_YUVQT[0x7];                                 // 0x41(0x7)
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class TaleQuestQueryableStateReadAnyValueBoolNPCDialogConditional: public NPCDialogConditional
{
public:
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x30(0x10)
	bool                                                         ExpectedValue;                                     // 0x40(0x1)
	char                                                         pad0x7_AHMMQ[0x7];                                 // 0x41(0x7)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class TaleQuestQueryableStateReadValueIntNPCDialogConditional: public NPCDialogConditional
{
public:
	class                                                        DataID;                                            // 0x30(0x8)
	int                                                          ExpectedValue;                                     // 0x38(0x4)
	byte                                                         ComparisonToExpectedValue;                         // 0x3c(0x1)
	char                                                         pad0x3_2OTS7[0x3];                                 // 0x3d(0x3)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestQueryableStatesReadInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestQueryableStatesWriteInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0xe8] - InheritedSize[0xc8]
class TaleQuestQueryableStatesAccessComponent: public ActorComponent
{
public:
	char                                                         pad0x10_QNVS4[0x10];                               // 0xc8(0x10)
	TArray<struct TalesData>                                     TalesData;                                         // 0xd8(0x10)
};


// Size 0x88 (Full Size[0xc0] - InheritedSize[0x38]
class TaleQuestImportFrame: public TaleQuestRootFrame
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestSelectorServiceBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x30 (Full Size[0x90] - InheritedSize[0x60]
class CutsceneResponsesTaleService: public TaleQuestService
{
public:
	TArray<class CutsceneResponseCoordinator*>                   TrackedResponseCoordinators;                       // 0x60(0x10)
	TArray<class CutsceneResponseComponent*>                     TrackedResponseComponents;                         // 0x70(0x10)
	TArray<class Actor*>                                         ResponseRelevantActors;                            // 0x80(0x10)
};


// Size 0x38 (Full Size[0x98] - InheritedSize[0x60]
class GameEventBlockingTaleService: public TaleQuestService
{
public:
};


// Size 0x28 (Full Size[0x88] - InheritedSize[0x60]
class GameEventExclusionZoneTaleService: public TaleQuestService
{
public:
};


// Size 0x30 (Full Size[0x90] - InheritedSize[0x60]
class RewardGenTaleQuestService: public TaleQuestService
{
public:
	Class TaleQuestWeightedItemDescSpawnDataAsset*               GlobalSpawnData;                                   // 0x60(0x8)
	TArray<Int ValidSpawnData>                                   ValidSpawnData;                                    // 0x68(0x10)
	TArray<class ItemSpawnData*>                                 ItemsToSpawn;                                      // 0x78(0x10)
	char                                                         pad0x8_DI03P[0x8];                                 // 0x88(0x8)
};


// Size 0x88 (Full Size[0xe8] - InheritedSize[0x60]
class TaleQuestActorOfInterestService: public TaleQuestService
{
public:
	char                                                         pad0x50_3V0M1[0x50];                               // 0x60(0x50)
	Class TaleQuestActorOfInterestServiceDesc*                   Desc;                                              // 0xb0(0x8)
	char                                                         pad0x30_ZMN9X[0x30];                               // 0xb8(0x30)
};


// Size 0x310 (Full Size[0x370] - InheritedSize[0x60]
class TaleQuestActorService: public TaleQuestService
{
public:
	TArray<struct TrackedActors>                                 TrackedActors;                                     // 0x60(0x10)
	TArray<struct CriticalActors>                                CriticalActors;                                    // 0x70(0x10)
	TArray<struct SnapshottedActors>                             SnapshottedActors;                                 // 0x80(0x10)
	Class TaleQuestActorServiceDesc*                             Desc;                                              // 0x90(0x8)
	Class PhasedClusterRoot*                                     PhasedClusterRoot;                                 // 0x98(0x8)
	TArray<struct PhasedActors>                                  PhasedActors;                                      // 0xa0(0x10)
	TArray<struct PhasedItems>                                   PhasedItems;                                       // 0xb0(0x10)
	Struct FText                                                 CriticalActorHandedInByAnotherCrewFailureMessage;  // 0xc0(0x38)
	char                                                         pad0x278_UZ1E5[0x278];                             // 0xf8(0x278)
};


// Size 0x48 (Full Size[0xa8] - InheritedSize[0x60]
class TaleQuestCheckpointService: public TaleQuestService
{
public:
	Class TaleQuestCheckpointServiceDesc*                        Desc;                                              // 0x60(0x8)
	char                                                         pad0x40_5AGPE[0x40];                               // 0x68(0x40)
};


// Size 0xd8 (Full Size[0x138] - InheritedSize[0x60]
class TaleQuestEQSService: public TaleQuestService
{
public:
};


// Size 0x18 (Full Size[0x78] - InheritedSize[0x60]
class TaleQuestInteractionPreventionService: public TaleQuestService
{
public:
	TArray<class Actor*>                                         TrackedInteractionActors;                          // 0x60(0x10)
	Class TaleQuestInteractionPreventionServiceDesc*             Desc;                                              // 0x70(0x8)
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class TaleQuestLockGhostShipDoorService: public TaleQuestService
{
public:
	Class TaleQuestLockGhostShipDoorServiceDesc*                 Desc;                                              // 0x60(0x8)
};


// Size 0x40 (Full Size[0xa0] - InheritedSize[0x60]
class TaleQuestQueryableStatesService: public TaleQuestService
{
public:
	TArray<struct AllData>                                       AllData;                                           // 0x60(0x10)
	char                                                         pad0x30_HVZ8B[0x30];                               // 0x70(0x30)
};


// Size 0x28 (Full Size[0x88] - InheritedSize[0x60]
class TaleQuestSelectorService: public TaleQuestService
{
public:
	Class TaleQuestSelectorServiceDesc*                          Desc;                                              // 0x60(0x8)
	char                                                         pad0x20_GTF3W[0x20];                               // 0x68(0x20)
};


// Size 0x50 (Full Size[0xb0] - InheritedSize[0x60]
class TaleQuestShipSetSinkingParamsService: public TaleQuestService
{
public:
	Class TaleQuestShipSetSinkingParamsServiceDesc*              Desc;                                              // 0x60(0x8)
	char                                                         pad0x48_FJ0IV[0x48];                               // 0x68(0x48)
};


// Size 0x58 (Full Size[0xb8] - InheritedSize[0x60]
class TaleQuestToggleInteractionDescriptionService: public TaleQuestService
{
public:
	char                                                         pad0x50_2BB6V[0x50];                               // 0x60(0x50)
	Class TaleQuestToggleInteractionDescriptionServiceDesc*      Desc;                                              // 0xb0(0x8)
};


// Size 0x48 (Full Size[0xa8] - InheritedSize[0x60]
class TaleResourceBrokerService: public TaleQuestService
{
public:
	char                                                         pad0x20_XFPSV[0x20];                               // 0x60(0x20)
	TArray<struct MigrationActions>                              MigrationActions;                                  // 0x80(0x10)
	char                                                         pad0x18_2P27G[0x18];                               // 0x90(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CutsceneResponsesTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventBlockingTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventExclusionZoneTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class RewardGenTaleQuestServiceDesc: public TaleQuestServiceDesc
{
public:
	Class TaleQuestWeightedItemDescSpawnDataAsset*               SpawnData;                                         // 0x28(0x8)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class TaleQuestActorOfInterestServiceDesc: public TaleQuestServiceDesc
{
public:
	TArray<class Class*>                                         AllNeededActorsOfInterest;                         // 0x28(0x10)
	Struct FText                                                 ActorOfInterestUnregisteredFailureMessage;         // 0x38(0x38)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class TaleQuestActorServiceDesc: public TaleQuestServiceDesc
{
public:
	class                                                        ItemLostFailureRunnable;                           // 0x28(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestCargoRunContractsServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestEQSServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestInteractionPreventionServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestLockGhostShipDoorServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestMerchantContractsServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestQueryableStatesServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestSelectorServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class TaleQuestShipSetSinkingParamsServiceDesc: public TaleQuestServiceDesc
{
public:
	Struct QuestVariableGuid                                     CrewId;                                            // 0x28(0x30)
	Class ShipSinkingParametersDataAsset*                        SmallShipSinkingData;                              // 0x58(0x8)
	Class ShipSinkingParametersDataAsset*                        MediumShipSinkingData;                             // 0x60(0x8)
	Class ShipSinkingParametersDataAsset*                        LargeShipSinkingData;                              // 0x68(0x8)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class TaleQuestToggleInteractionDescriptionServiceDesc: public TaleQuestServiceDesc
{
public:
	bool                                                         ResetDisabledInteractsOnEnd;                       // 0x28(0x1)
	bool                                                         ResetEnabledInteractsOnEnd;                        // 0x29(0x1)
	char                                                         pad0x6_L476Y[0x6];                                 // 0x2a(0x6)
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class ActorRadiusTrackerStep: public TaleQuestStep
{
public:
	Class ActorRadiusTrackerStepDesc*                            Desc;                                              // 0x98(0x8)
	Class Actor*                                                 TargetActor;                                       // 0xa0(0x8)
	char                                                         pad0x28_Z7XCV[0x28];                               // 0xa8(0x28)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AddGameEventExclusionZoneStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class CallObjectFunctionStep: public TaleQuestStep
{
public:
};


// Size 0x40 (Full Size[0xd8] - InheritedSize[0x98]
class DebugTaleAddInstancedLevelStep: public TaleQuestStep
{
public:
	char                                                         pad0x8_XJYIJ[0x8];                                 // 0x98(0x8)
	Class DebugTaleAddInstancedLevelStepDesc*                    StepDesc;                                          // 0xa0(0x8)
	Struct FString                                               InstancedLevelPath;                                // 0xa8(0x10)
	char                                                         pad0x20_QWQZX[0x20];                               // 0xb8(0x20)
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class DebugTaleAddInstancedLevelStepDesc: public TaleQuestStepDesc
{
public:
	Struct FText                                                 InstancedLevelKeyword;                             // 0x80(0x38)
	char                                                         pad0x8_Z3FXW[0x8];                                 // 0xb8(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class DestroySpawnedActorStep: public TaleQuestStep
{
public:
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class DoEQSQueryStep: public TaleQuestStep
{
public:
	Class DoEQSQueryStepDesc*                                    Desc;                                              // 0x98(0x8)
	Class TaleQuestEQSService*                                   CachedTaleEQSService;                              // 0xa0(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class EnableInteractionWithActorStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class FindItemInCollectorsChestStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class FindNamedPointStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class FindNamedPointAsVectorStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class FindNamedPointAsTransformStep: public TaleQuestStep
{
public:
};


// Size 0x60 (Full Size[0xf8] - InheritedSize[0x98]
class ForceCannonLoadStep: public TaleQuestStep
{
public:
};


// Size 0xb0 (Full Size[0x148] - InheritedSize[0x98]
class GenerateDigLocationInRadiusStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class GetActorOfInterestStep: public TaleQuestStep
{
public:
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class GetVoyageDifficultyFromRankStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class InvokeDamageStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class LinkEQSContextWithVariableStep: public TaleQuestStep
{
public:
	Class LinkEQSContextWithVariableStepDesc*                    Desc;                                              // 0x98(0x8)
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class LoadSequencerAnimationStep: public TaleQuestStep
{
public:
	Class LoadSequencerAnimationStepDesc*                        StepDesc;                                          // 0x98(0x8)
	Class SequencerCutSceneActor*                                SequencerCutSceneActor;                            // 0xa0(0x8)
	Class Actor*                                                 TargetToSpawnActor;                                // 0xa8(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class OverrideManagedActorStateStep: public TaleQuestStep
{
public:
};


// Size 0x20 (Full Size[0xb8] - InheritedSize[0x98]
class ParticipantRadiusTrackerStep: public TaleQuestStep
{
public:
	Class ParticipantRadiusTrackerStepDesc*                      Desc;                                              // 0x98(0x8)
	char                                                         pad0x18_NZ00Q[0x18];                               // 0xa0(0x18)
};


// Size 0x30 (Full Size[0xc8] - InheritedSize[0x98]
class PlaySequencerAnimationOnCutsceneActorStep: public TaleQuestStep
{
public:
	Class PlaySequencerAnimationOnCutsceneActorStepDesc*         StepDesc;                                          // 0x98(0x8)
	Class SequencerCutSceneActor*                                SequencerCutSceneActor;                            // 0xa0(0x8)
	TArray<struct PossessableSequences>                          PossessableSequences;                              // 0xa8(0x10)
	char                                                         pad0x10_AGNAI[0x10];                               // 0xb8(0x10)
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class PlaySequencerAnimationStep: public TaleQuestStep
{
public:
	Class PlaySequencerAnimationStepDesc*                        StepDesc;                                          // 0x98(0x8)
	Class SequencerCutSceneActor*                                SequencerCutSceneActor;                            // 0xa0(0x8)
	char                                                         pad0x28_R6LW3[0x28];                               // 0xa8(0x28)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class PreventInteractionWithActorStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class ProvokeHitReactionStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class ReleaseGameEventBlockStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class RemoveGameEventExclusionZoneStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class RequestGameEventBlockStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class SelectNamedPointStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class SetEQSNamedContextStep: public TaleQuestStep
{
public:
	Class SetEQSNamedContextStepDesc*                            Desc;                                              // 0x98(0x8)
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class SpawnLayerStep: public TaleQuestStep
{
public:
};


// Size 0x68 (Full Size[0x100] - InheritedSize[0x98]
class SpawnPhasedActorWithTransformStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class SpawnPhasedItemStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class StartSuppressingCutsceneResponsesStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class StopSuppressingCutsceneResponsesStep: public TaleQuestStep
{
public:
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class TaleMigrationVolatileTaskStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddCommonToolsStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddQuestBookStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddToArrayStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestArrayAppendStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestArrayContainsStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestArrayUnionStep: public TaleQuestStep
{
public:
};


// Size 0xa0 (Full Size[0x138] - InheritedSize[0x98]
class TaleQuestAwaitCrewShipSinkStep: public TaleQuestStep
{
public:
};


// Size 0x48 (Full Size[0xe0] - InheritedSize[0x98]
class TaleQuestAwaitEventStep: public TaleQuestStep
{
public:
};


// Size 0x98 (Full Size[0x130] - InheritedSize[0x98]
class TaleQuestChooseIslandFromWeightsStep: public TaleQuestStep
{
public:
	char                                                         pad0x90_C4883[0x90];                               // 0x98(0x90)
	Class IslandTypeWeightsDataAsset*                            IslandTypeWeights;                                 // 0x128(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestClearTaleProposalsStep: public TaleQuestStep
{
public:
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class TaleQuestCrewTaskStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestDisableInteractionStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestEmissaryCompanyActionRewardBoostStep: public TaleQuestStep
{
public:
	Class TaleQuestEmissaryCompanyActionRewardBoostStepDesc*     Desc;                                              // 0x98(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestEnableInteractionStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestFireEventStep: public TaleQuestStep
{
public:
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class TaleQuestForEachStepBase: public TaleQuestStep
{
public:
	TArray<struct Bodies>                                        Bodies;                                            // 0x98(0x10)
};


// Size 0x0 (Full Size[0xa8] - InheritedSize[0xa8]
class TaleQuestForEachAnyStep: public TaleQuestForEachStepBase
{
public:
};


// Size 0x40 (Full Size[0xe8] - InheritedSize[0xa8]
class TaleQuestForEachSequential: public TaleQuestForEachStepBase
{
public:
	Class TaleQuestIndexedFrame*                                 Frame;                                             // 0xa8(0x8)
	char                                                         pad0x38_5IV67[0x38];                               // 0xb0(0x38)
};


// Size 0x0 (Full Size[0xa8] - InheritedSize[0xa8]
class TaleQuestForEachUnionStep: public TaleQuestForEachStepBase
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestGetCollectionItemCountStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestGetParticipatingCrewsInRadiusStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestGetParticipatingCrewsStep: public TaleQuestStep
{
public:
};


// Size 0x40 (Full Size[0xd8] - InheritedSize[0x98]
class TaleQuestGrantRewardStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestObstacleCourseSetupAndWaitForCompletionStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestPermanentPromptStep: public TaleQuestStep
{
public:
};


// Size 0x58 (Full Size[0xf0] - InheritedSize[0x98]
class TaleQuestPersistentForEachCrewTaskStep: public TaleQuestStep
{
public:
	Class TaleQuestPersistentForEachCrewTaskStepDesc*            StepDesc;                                          // 0x98(0x8)
	char                                                         pad0x50_4U3TX[0x50];                               // 0xa0(0x50)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestRemoveCommonToolsStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestRemoveQuestBookStep: public TaleQuestStep
{
public:
};


// Size 0x60 (Full Size[0xf8] - InheritedSize[0x98]
class TaleQuestSelectEntryFromArrayStep: public TaleQuestStep
{
public:
	Struct QuestVariableArray                                    InputArray;                                        // 0x98(0x30)
	Struct QuestVariable                                         OutputEntry;                                       // 0xc8(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestShipDiveStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestShipSurfaceStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestStarFieldPuzzleDimStep: public TaleQuestStep
{
public:
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class TaleQuestStarFieldPuzzleEndStep: public TaleQuestStep
{
public:
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class TaleQuestStarFieldPuzzleSetupAndWaitForCompletionStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestStartCameraFadeStep: public TaleQuestStep
{
public:
};


// Size 0x28 (Full Size[0xc0] - InheritedSize[0x98]
class TaleQuestStartPermanentPromptAndWaitForEndEventStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestStructStepBase: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestBreakStructStep: public TaleQuestStructStepBase
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestMakeStructStep: public TaleQuestStructStepBase
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestToggleAmbientMigrationForServerStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestUpdateCheckpointStep: public TaleQuestStep
{
public:
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class TaleQuestWaitForHandInStep: public TaleQuestStep
{
public:
	Class TaleQuestWaitForHandInStepDesc*                        Desc;                                              // 0x98(0x8)
	char                                                         pad0x8_PL1KT[0x8];                                 // 0xa0(0x8)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TrackResponseCoordinatorStep: public TaleQuestStep
{
public:
	Class TrackResponseCoordinatorStepDesc*                      StepDesc;                                          // 0x98(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class VisualiseLoggerEQSResultsTaleStep: public TaleQuestStep
{
public:
};


// Size 0x78 (Full Size[0x110] - InheritedSize[0x98]
class WaitForActorOfInterestToUnregisterStep: public TaleQuestStep
{
public:
	Class WaitForActorOfInterestToUnregisterStepDesc*            Desc;                                              // 0x98(0x8)
	char                                                         pad0x70_O8MWM[0x70];                               // 0xa0(0x70)
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class WaitForGameEventToCompleteStep: public TaleQuestStep
{
public:
	Class GameEvent*                                             GameEvent;                                         // 0x98(0x8)
	char                                                         pad0x8_SB1OL[0x8];                                 // 0xa0(0x8)
};


// Size 0x70 (Full Size[0x108] - InheritedSize[0x98]
class WaitForHealthToReachFractionStep: public TaleQuestStep
{
public:
};


// Size 0xd0 (Full Size[0x168] - InheritedSize[0x98]
class WaitForItemPickupStep: public TaleQuestStep
{
public:
};


// Size 0x80 (Full Size[0x118] - InheritedSize[0x98]
class WaitForQueryableStateValueStep: public TaleQuestStep
{
public:
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class WaitForSpawnedPawnBaseStep: public TaleQuestStep
{
public:
	Class AISpawner*                                             AISpawner;                                         // 0x98(0x8)
	char                                                         pad0x10_FSGAP[0x10];                               // 0xa0(0x10)
};


// Size 0xa0 (Full Size[0x120] - InheritedSize[0x80]
class ActorRadiusTrackerStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
	float                                                        DurationBetweenChecks;                             // 0xb0(0x4)
	char                                                         pad0x4_KBTS4[0x4];                                 // 0xb4(0x4)
	Struct QuestVariableVector                                   Location;                                          // 0xb8(0x30)
	float                                                        Radius;                                            // 0xe8(0x4)
	char                                                         pad0x4_TT0IX[0x4];                                 // 0xec(0x4)
	Struct QuestVariableBool                                     ActorInsideRadius;                                 // 0xf0(0x30)
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class AddGameEventExclusionZoneStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        Radius;                                            // 0x80(0x4)
	bool                                                         ShouldGetRadiusFromRemoteConfig;                   // 0x84(0x1)
	char                                                         pad0x3_60A9F[0x3];                                 // 0x85(0x3)
	struct FName                                                 RemoteConfigKeyRadius;                             // 0x88(0x8)
	Struct QuestVariableVector                                   Location;                                          // 0x90(0x30)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class CallObjectFunctionStepDesc: public TaleQuestStepDesc
{
public:
	Class Object*                                                Target;                                            // 0x80(0x8)
	Struct ClassFunctionSelectionType                            Function;                                          // 0x88(0x10)
	char                                                         pad0x50_9A3G9[0x50];                               // 0x98(0x50)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class DestroySpawnedActorStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    ActorVar;                                          // 0x80(0x30)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class DoEQSQueryStepDesc: public TaleQuestStepDesc
{
public:
	Class EnvQuery*                                              EQSQuery;                                          // 0x80(0x8)
	Struct QuestVariableArray                                    OutPoints;                                         // 0x88(0x30)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class EnableInteractionWithActorStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class FindItemInCollectorsChestStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    CollectorsChest;                                   // 0x80(0x30)
	Struct QuestVariableActor                                    ItemInChest;                                       // 0xb0(0x30)
	class                                                        ItemToFind;                                        // 0xe0(0x8)
};


// Size 0x90 (Full Size[0x110] - InheritedSize[0x80]
class FindNamedPointStepDescBase: public TaleQuestStepDesc
{
public:
	char                                                         pad0x20_EX54G[0x20];                               // 0x80(0x20)
	Struct QuestVariableActor                                    ActorToSearch;                                     // 0xa0(0x30)
	Struct QuestVariableName                                     GroupNamePin;                                      // 0xd0(0x30)
	struct FName                                                 PointGroupName;                                    // 0x100(0x8)
	byte                                                         SearchMethod;                                      // 0x108(0x1)
	byte                                                         ReturnInSpace;                                     // 0x109(0x1)
	char                                                         pad0x6_I9XPH[0x6];                                 // 0x10a(0x6)
};


// Size 0x30 (Full Size[0x140] - InheritedSize[0x110]
class FindNamedPointStepDesc: public FindNamedPointStepDescBase
{
public:
	Struct QuestVariableOrientedPoint                            OutputOrientedPoint;                               // 0x110(0x30)
};


// Size 0x30 (Full Size[0x140] - InheritedSize[0x110]
class FindNamedPointAsVectorStepDesc: public FindNamedPointStepDescBase
{
public:
	Struct QuestVariableVector                                   OutputVectorLocation;                              // 0x110(0x30)
};


// Size 0x38 (Full Size[0x148] - InheritedSize[0x110]
class FindNamedPointAsTransformStepDesc: public FindNamedPointStepDescBase
{
public:
	Struct QuestVariableTransform                                OutputTransform;                                   // 0x110(0x38)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class ForceCannonLoadStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    Cannon;                                            // 0x80(0x30)
	Struct QuestVariableActor                                    Projectile;                                        // 0xb0(0x30)
};


// Size 0x98 (Full Size[0x118] - InheritedSize[0x80]
class GenerateDigLocationInRadiusStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableName                                     IslandName;                                        // 0x80(0x30)
	Struct QuestVariableVector                                   Center;                                            // 0xb0(0x30)
	float                                                        RadiusInCm;                                        // 0xe0(0x4)
	char                                                         pad0x4_R118H[0x4];                                 // 0xe4(0x4)
	Struct QuestVariableVector                                   DigLocation;                                       // 0xe8(0x30)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class GetActorOfInterestStepDesc: public TaleQuestStepDesc
{
public:
	class                                                        ActorOfInterestId;                                 // 0x80(0x8)
	Struct QuestVariableActor                                    ActorOfInterest;                                   // 0x88(0x30)
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class InvokeDamageDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    ActorToDamage;                                     // 0x80(0x30)
	class                                                        DamageType;                                        // 0xb0(0x8)
	float                                                        DamageAmount;                                      // 0xb8(0x4)
	byte                                                         DamageReason;                                      // 0xbc(0x1)
	char                                                         pad0x3_YHND5[0x3];                                 // 0xbd(0x3)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class LinkEQSContextWithVariableStepDesc: public TaleQuestStepDesc
{
public:
	class                                                        Context;                                           // 0x80(0x8)
	Struct QuestVariableSetEQSTaleContextValue                   Variable;                                          // 0x88(0x30)
};


// Size 0xb0 (Full Size[0x130] - InheritedSize[0x80]
class LoadSequencerAnimationStepDesc: public TaleQuestStepDesc
{
public:
	TArray<class LevelSequence*>                                 LevelSequencesToLoad;                              // 0x80(0x10)
	Struct QuestVariableActor                                    TargetActorToSpawn;                                // 0x90(0x30)
	Struct QuestVariableActor                                    LevelSequenceActorSpawnLocation;                   // 0xc0(0x30)
	Struct QuestVariableActor                                    SequencerCutSceneActor;                            // 0xf0(0x30)
	bool                                                         AttachToTargetActor;                               // 0x120(0x1)
	char                                                         pad0x3_HQ1F9[0x3];                                 // 0x121(0x3)
	struct FName                                                 AttachSocketName;                                  // 0x124(0x8)
	bool                                                         PlayGlobally;                                      // 0x12c(0x1)
	char                                                         pad0x3_KS9W1[0x3];                                 // 0x12d(0x3)
};


// Size 0x70 (Full Size[0xf0] - InheritedSize[0x80]
class OverrideManagedActorStateStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    ActorVar;                                          // 0x80(0x30)
	bool                                                         TrackActor;                                        // 0xb0(0x1)
	bool                                                         MarkAsCritical;                                    // 0xb1(0x1)
	char                                                         pad0x6_47LKX[0x6];                                 // 0xb2(0x6)
	Struct FText                                                 CriticalActorLostMessage;                          // 0xb8(0x38)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class ParticipantRadiusTrackerStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        DurationBetweenChecks;                             // 0x80(0x4)
	char                                                         pad0x4_5NGM3[0x4];                                 // 0x84(0x4)
	Struct QuestVariableVector                                   Location;                                          // 0x88(0x30)
	Struct QuestVariableFloat                                    Radius;                                            // 0xb8(0x30)
};


// Size 0x0 (Full Size[0xe8] - InheritedSize[0xe8]
class WaitUntilAllParticipantsEnterRadiusStep: public ParticipantRadiusTrackerStepDesc
{
public:
};


// Size 0x0 (Full Size[0xe8] - InheritedSize[0xe8]
class WaitUntilAllParticipantsLeaveRadiusStep: public ParticipantRadiusTrackerStepDesc
{
public:
};


// Size 0x0 (Full Size[0xe8] - InheritedSize[0xe8]
class WaitUntilAnyParticipantEntersRadiusStep: public ParticipantRadiusTrackerStepDesc
{
public:
};


// Size 0x138 (Full Size[0x1b8] - InheritedSize[0x80]
class PlaySequencerAnimationOnCutsceneActorStepDesc: public TaleQuestStepDesc
{
public:
	Class LevelSequence*                                         LevelSequence;                                     // 0x80(0x8)
	float                                                        Delay;                                             // 0x88(0x4)
	char                                                         pad0x4_LLCUW[0x4];                                 // 0x8c(0x4)
	Struct QuestVariableActor                                    DockableBaseActor;                                 // 0x90(0x30)
	Struct QuestVariableActor                                    SequencerCutSceneActor;                            // 0xc0(0x30)
	Struct QuestVariableActor                                    ActorToPossess;                                    // 0xf0(0x30)
	Struct QuestVariableArray                                    AdditionalPossessables;                            // 0x120(0x30)
	Struct QuestVariableActor                                    InteractingActor;                                  // 0x150(0x30)
	Struct FString                                               PossessableName;                                   // 0x180(0x10)
	Class SceneDialogueData*                                     DialogueData;                                      // 0x190(0x8)
	TArray<struct FText>                                         LocalisableNames;                                  // 0x198(0x10)
	bool                                                         IsLevelSequenceActorAlwaysRelevant;                // 0x1a8(0x1)
	bool                                                         IsLooping;                                         // 0x1a9(0x1)
	char                                                         pad0x2_N9MR0[0x2];                                 // 0x1aa(0x2)
	float                                                        SubtitleSphereRadiusInCm;                          // 0x1ac(0x4)
	Class LevelSequence*                                         FemaleLevelSequence;                               // 0x1b0(0x8)
};


// Size 0xf8 (Full Size[0x178] - InheritedSize[0x80]
class PlaySequencerAnimationStepDesc: public TaleQuestStepDesc
{
public:
	Class LevelSequence*                                         LevelSequenceToPlay;                               // 0x80(0x8)
	Struct QuestVariableActor                                    TargetActorToSpawn;                                // 0x88(0x30)
	Struct QuestVariableActor                                    LevelSequenceActorSpawnLocation;                   // 0xb8(0x30)
	Struct QuestVariableActor                                    DockableBaseActor;                                 // 0xe8(0x30)
	Struct QuestVariableActor                                    InteractingActor;                                  // 0x118(0x30)
	bool                                                         PlayGlobally;                                      // 0x148(0x1)
	bool                                                         IsLevelSequenceActorAlawaysRelevant;               // 0x149(0x1)
	char                                                         pad0x6_4D6WB[0x6];                                 // 0x14a(0x6)
	Class SceneDialogueData*                                     DialogueData;                                      // 0x150(0x8)
	TArray<struct FText>                                         LocalisableNames;                                  // 0x158(0x10)
	bool                                                         IsLooping;                                         // 0x168(0x1)
	char                                                         pad0x3_02W4W[0x3];                                 // 0x169(0x3)
	float                                                        SubtitleSphereRadiusInCm;                          // 0x16c(0x4)
	Class LevelSequence*                                         FemaleLevelSequenceToPlay;                         // 0x170(0x8)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class PreventInteractionWithActorStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class ProvokeHitReactionDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    ActorToProvoke;                                    // 0x80(0x30)
	class                                                        DamageType;                                        // 0xb0(0x8)
	float                                                        DamageAmount;                                      // 0xb8(0x4)
	byte                                                         DamageReason;                                      // 0xbc(0x1)
	char                                                         pad0x3_ECCJV[0x3];                                 // 0xbd(0x3)
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class ReleaseGameEventBlockStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class RemoveGameEventExclusionZoneStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        Radius;                                            // 0x80(0x4)
	bool                                                         ShouldGetRadiusFromRemoteConfig;                   // 0x84(0x1)
	char                                                         pad0x3_BGPNO[0x3];                                 // 0x85(0x3)
	struct FName                                                 RemoteConfigKeyRadius;                             // 0x88(0x8)
	Struct QuestVariableVector                                   Location;                                          // 0x90(0x30)
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class RequestGameEventBlockStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class SelectNamedPointStepDesc: public TaleQuestStepDesc
{
public:
	char                                                         pad0x20_VGE3S[0x20];                               // 0x80(0x20)
	struct FName                                                 GroupName;                                         // 0xa0(0x8)
	int                                                          PointIndex;                                        // 0xa8(0x4)
	byte                                                         ReturnInSpace;                                     // 0xac(0x1)
	char                                                         pad0x3_D6USA[0x3];                                 // 0xad(0x3)
	Struct QuestVariableOrientedPoint                            Point;                                             // 0xb0(0x30)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class SetEQSNamedContextStepDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 Name;                                              // 0x80(0x8)
	Struct QuestVariableLinkEQSContext                           Value;                                             // 0x88(0x30)
};


// Size 0x50 (Full Size[0xd0] - InheritedSize[0x80]
class SpawnLayerStepDesc: public TaleQuestStepDesc
{
public:
	Class LayerActorsDataAsset*                                  LayerAsset;                                        // 0x80(0x8)
	bool                                                         SpawnPhased;                                       // 0x88(0x1)
	char                                                         pad0x7_HV78G[0x7];                                 // 0x89(0x7)
	Struct QuestVariableActor                                    ActorWithLayers;                                   // 0x90(0x30)
	TArray<struct SpawnedActors>                                 SpawnedActors;                                     // 0xc0(0x10)
};


// Size 0x90 (Full Size[0x110] - InheritedSize[0x80]
class SpawnPhasedActorWithTransformStepBaseDesc: public TaleQuestStepDesc
{
public:
	char                                                         pad0x20_OQFYK[0x20];                               // 0x80(0x20)
	bool                                                         MarkAsCritical;                                    // 0xa0(0x1)
	char                                                         pad0x7_FXEOK[0x7];                                 // 0xa1(0x7)
	Struct FText                                                 CriticalActorLostMessage;                          // 0xa8(0x38)
	Struct QuestVariableActor                                    ActorVar;                                          // 0xe0(0x30)
};


// Size 0x38 (Full Size[0x148] - InheritedSize[0x110]
class SpawnPhasedActorAtLocationStepDesc: public SpawnPhasedActorWithTransformStepBaseDesc
{
public:
	Struct QuestVariableTransform                                Location;                                          // 0x110(0x38)
};


// Size 0x108 (Full Size[0x188] - InheritedSize[0x80]
class SpawnPhasedItemStepDesc: public TaleQuestStepDesc
{
public:
	bool                                                         TrackItem;                                         // 0x80(0x1)
	bool                                                         MarkItemAsCritical;                                // 0x81(0x1)
	char                                                         pad0x6_7V73R[0x6];                                 // 0x82(0x6)
	Struct FText                                                 CriticalActorLostMessage;                          // 0x88(0x38)
	struct FName                                                 SocketName;                                        // 0xc0(0x8)
	Struct QuestVariableItemDescType                             Item;                                              // 0xc8(0x30)
	Struct QuestVariableActor                                    LocatorVar;                                        // 0xf8(0x30)
	Struct QuestVariableOrientedPoint                            LocatorPoint;                                      // 0x128(0x30)
	Struct QuestVariableItemInfo                                 SpawnedItemVar;                                    // 0x158(0x30)
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class StartSuppressingCutsceneResponsesStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class StopSuppressingCutsceneResponsesStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x10 (Full Size[0x90] - InheritedSize[0x80]
class TaleQuestAddCommonToolsStepDesc: public TaleQuestStepDesc
{
public:
	TArray<class Class*>                                         ToolsToGive;                                       // 0x80(0x10)
};


// Size 0x10 (Full Size[0x90] - InheritedSize[0x80]
class TaleQuestAddQuestBookStepDesc: public TaleQuestStepDesc
{
public:
	class                                                        QuestBookDesc;                                     // 0x80(0x8)
	class                                                        RemapperClass;                                     // 0x88(0x8)
};


// Size 0x10 (Full Size[0x90] - InheritedSize[0x80]
class TaleQuestArrayItemStepBaseDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 ArrayVar;                                          // 0x80(0x8)
	struct FName                                                 ItemVar;                                           // 0x88(0x8)
};


// Size 0x0 (Full Size[0x90] - InheritedSize[0x90]
class TaleQuestAddToArrayStepDesc: public TaleQuestArrayItemStepBaseDesc
{
public:
};


// Size 0x30 (Full Size[0xc0] - InheritedSize[0x90]
class TaleQuestArrayContainsStepDesc: public TaleQuestArrayItemStepBaseDesc
{
public:
	Struct QuestVariableBool                                     Result;                                            // 0x90(0x30)
};


// Size 0x18 (Full Size[0x98] - InheritedSize[0x80]
class TaleQuestArrayOperationStepBaseDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 Array1;                                            // 0x80(0x8)
	struct FName                                                 Array2;                                            // 0x88(0x8)
	struct FName                                                 Result;                                            // 0x90(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestArrayAppendStepDesc: public TaleQuestArrayOperationStepBaseDesc
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestArrayUnionStepDesc: public TaleQuestArrayOperationStepBaseDesc
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestAwaitCrewShipSinkStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableGuid                                     CrewId;                                            // 0x80(0x30)
};


// Size 0x98 (Full Size[0x118] - InheritedSize[0x80]
class TaleQuestChooseIslandFromWeightsStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableNameArray                                IslandsToChooseFrom;                               // 0x80(0x30)
	Struct QuestVariableInt                                      DifficultyRank;                                    // 0xb0(0x30)
	Struct QuestVariableName                                     ChosenIsland;                                      // 0xe0(0x30)
	Class IslandTypeWeightsDataAsset*                            IslandTypeWeights;                                 // 0x110(0x8)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestClearTaleProposalsStepDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 CampaignId;                                        // 0x80(0x8)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestDisableInteractionStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestEmissaryCompanyActionRewardBoostStepDesc: public TaleQuestStepDesc
{
public:
	byte                                                         CompanyActionType;                                 // 0x80(0x1)
	char                                                         pad0x7_4J558[0x7];                                 // 0x81(0x7)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestEnableInteractionStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class TaleQuestEventStepDescBase: public TaleQuestStepDesc
{
public:
	Class Object*                                                Dispatcher;                                        // 0x80(0x8)
	Struct NativeAndUserDefinedStructSelector                    EventType;                                         // 0x88(0x8)
	char                                                         pad0x50_I17AN[0x50];                               // 0x90(0x50)
};


// Size 0x0 (Full Size[0xe0] - InheritedSize[0xe0]
class TaleQuestAwaitEventStepDesc: public TaleQuestEventStepDescBase
{
public:
};


// Size 0x0 (Full Size[0xe0] - InheritedSize[0xe0]
class TaleQuestFireEventStepDesc: public TaleQuestEventStepDescBase
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ValueProviderStepInterface: public Interface
{
public:
};


// Size 0x28 (Full Size[0xa8] - InheritedSize[0x80]
class TaleQuestForEachStepDescBase: public TaleQuestStepDesc
{
public:
	char                                                         pad0x8_KYSEB[0x8];                                 // 0x80(0x8)
	struct FName                                                 Collection;                                        // 0x88(0x8)
	Class TaleQuestStepDesc*                                     Body;                                              // 0x90(0x8)
	struct FName                                                 KeyPinName;                                        // 0x98(0x8)
	struct FName                                                 ItemPinName;                                       // 0xa0(0x8)
};


// Size 0x0 (Full Size[0xa8] - InheritedSize[0xa8]
class TaleQuestForEachAnyStepDesc: public TaleQuestForEachStepDescBase
{
public:
};


// Size 0x0 (Full Size[0xa8] - InheritedSize[0xa8]
class TaleQuestForEachSequentialDesc: public TaleQuestForEachStepDescBase
{
public:
};


// Size 0x0 (Full Size[0xa8] - InheritedSize[0xa8]
class TaleQuestForEachUnionStepDesc: public TaleQuestForEachStepDescBase
{
public:
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class TaleQuestGetCollectionItemCountStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableCollection                               Collection;                                        // 0x80(0x30)
	Struct QuestVariableInt                                      Num;                                               // 0xb0(0x30)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class TaleQuestGetParticipatingCrewsInRadiusStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableGuidArray                                CrewIds;                                           // 0x80(0x30)
	Struct QuestVariableVector                                   Location;                                          // 0xb0(0x30)
	float                                                        Radius;                                            // 0xe0(0x4)
	char                                                         pad0x4_6LULZ[0x4];                                 // 0xe4(0x4)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestGetParticipatingCrewsStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableGuidArray                                CrewIds;                                           // 0x80(0x30)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class TaleQuestGrantRewardStepDesc: public TaleQuestStepDesc
{
public:
	Struct RewardId                                              RewardId;                                          // 0x80(0x8)
	class                                                        Company;                                           // 0x88(0x8)
	Struct Guid                                                  Id;                                                // 0x90(0x10)
	bool                                                         ShouldGrantToAlliedCrews;                          // 0xa0(0x1)
	char                                                         pad0x7_8J4FD[0x7];                                 // 0xa1(0x7)
	Struct QuestVariablePlayerActor                              SpecificPlayerToAward;                             // 0xa8(0x30)
	struct FName                                                 Feature;                                           // 0xd8(0x8)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestObstacleCourseSetupAndWaitForCompletionStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    ObstacleCourseActor;                               // 0x80(0x30)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class TaleQuestPermanentPromptStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariablePrioritisedPrompt                        Prompt;                                            // 0x80(0x30)
	byte                                                         StartOrStop;                                       // 0xb0(0x1)
	char                                                         pad0x7_QPQSD[0x7];                                 // 0xb1(0x7)
};


// Size 0x10 (Full Size[0x90] - InheritedSize[0x80]
class TaleQuestRemoveCommonToolsStepDesc: public TaleQuestStepDesc
{
public:
	TArray<class Class*>                                         ToolsToRemove;                                     // 0x80(0x10)
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class TaleQuestRemoveQuestBookStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class ActorOfInterestTaleFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestActorFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestAnimationStepFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestConversionFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestCoreFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestCutscenesFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestFloatMathsFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestIntMathsFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestItemFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestLogicFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestNamedPointsFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestNameFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestNPCHideFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestQueryableStateAddToIntFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestQueryableStateReadBoolFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestQueryableStateReadIntFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestQueryableStateWriteBoolFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestQueryableStateWriteIntFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestStoryFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x48 (Full Size[0x1c8] - InheritedSize[0x180]
class TaleQuestStoryBranchFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
	char                                                         pad0x8_N9SMR[0x8];                                 // 0x180(0x8)
	Class TaleQuestStepDesc*                                     Active;                                            // 0x188(0x8)
	Class TaleQuestStepDesc*                                     Inactive;                                          // 0x190(0x8)
	char                                                         pad0x30_G0M8U[0x30];                               // 0x198(0x30)
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestTransformMathsFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestTransfromConversionFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestUObjectFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestUtilityFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestValueFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestWaterVolumeFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class TaleQuestSelectEntryFromArrayStepDesc: public TaleQuestStepDesc
{
public:
	Class TaleQuestArrayEntrySelectionStrategy*                  SelectionStrategy;                                 // 0x80(0x8)
	Struct QuestVariableArray                                    InputArray;                                        // 0x88(0x30)
	Struct QuestVariableAny                                      OutputEntry;                                       // 0xb8(0x30)
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class TaleQuestShipDiveStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestShipSurfaceStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        TimeToSurface;                                     // 0x80(0x4)
	char                                                         pad0x4_3IQKN[0x4];                                 // 0x84(0x4)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestStarFieldPuzzleDimStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    StarFieldPuzzleActor;                              // 0x80(0x30)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestStarFieldPuzzleEndStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    StarFieldPuzzleActor;                              // 0x80(0x30)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestStarFieldPuzzleSetupAndWaitForCompletionStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    StarFieldPuzzleActor;                              // 0x80(0x30)
};


// Size 0x20 (Full Size[0xa0] - InheritedSize[0x80]
class TaleQuestStartCameraFadeStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        FromAlpha;                                         // 0x80(0x4)
	float                                                        ToAlpha;                                           // 0x84(0x4)
	float                                                        FadeTimeInSeconds;                                 // 0x88(0x4)
	Struct LinearColor                                           FadeColour;                                        // 0x8c(0x10)
	bool                                                         ShouldFadeAudio;                                   // 0x9c(0x1)
	bool                                                         HoldFadeWhenFinished;                              // 0x9d(0x1)
	char                                                         pad0x2_X179U[0x2];                                 // 0x9e(0x2)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestStartPermanentPromptAndWaitForEndEventStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariablePrioritisedPrompt                        Prompt;                                            // 0x80(0x30)
};


// Size 0x58 (Full Size[0xd8] - InheritedSize[0x80]
class TaleQuestStructStepDescBase: public TaleQuestStepDesc
{
public:
	Class ScriptStruct*                                          Struct;                                            // 0x80(0x8)
	char                                                         pad0x50_429IH[0x50];                               // 0x88(0x50)
};


// Size 0x0 (Full Size[0xd8] - InheritedSize[0xd8]
class TaleQuestBreakStructStepDesc: public TaleQuestStructStepDescBase
{
public:
};


// Size 0x0 (Full Size[0xd8] - InheritedSize[0xd8]
class TaleQuestMakeStructStepDesc: public TaleQuestStructStepDescBase
{
public:
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestTaskStepDescBase: public TaleQuestStepDesc
{
public:
	Class TaleQuestStepDesc*                                     Task;                                              // 0x80(0x8)
};


// Size 0x0 (Full Size[0x88] - InheritedSize[0x88]
class TaleMigrationVolatileTaskStepDesc: public TaleQuestTaskStepDescBase
{
public:
};


// Size 0x30 (Full Size[0xb8] - InheritedSize[0x88]
class TaleQuestCrewTaskStepDesc: public TaleQuestTaskStepDescBase
{
public:
	Struct QuestVariableGuid                                     CrewId;                                            // 0x88(0x30)
};


// Size 0x0 (Full Size[0x88] - InheritedSize[0x88]
class TaleQuestPersistentForEachCrewTaskStepDesc: public TaleQuestTaskStepDescBase
{
public:
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestToggleAmbientMigrationForServerStepDesc: public TaleQuestStepDesc
{
public:
	bool                                                         AmbientMigrationAvailable;                         // 0x80(0x1)
	char                                                         pad0x7_KAA6W[0x7];                                 // 0x81(0x7)
};


// Size 0x18 (Full Size[0x98] - InheritedSize[0x80]
class TaleQuestUpdateCheckpointStepDesc: public TaleQuestStepDesc
{
public:
	Struct RewardId                                              RewardIdToAward;                                   // 0x80(0x8)
	struct FName                                                 CampaignIdToRemove;                                // 0x88(0x8)
	struct FName                                                 Feature;                                           // 0x90(0x8)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class TaleQuestWaitForHandInStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    HandInActor;                                       // 0x80(0x30)
	class                                                        SpecificItem;                                      // 0xb0(0x8)
	Struct QuestVariableItemDescType                             HandInItem;                                        // 0xb8(0x30)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TrackResponseCoordinatorStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableUObject                                  CutsceneResponseCoordinator;                       // 0x80(0x30)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class VisualiseLoggerEQSResultsTaleStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableArray                                    ResultsArray;                                      // 0x80(0x30)
	Struct QuestVariableVector                                   SelectedResult;                                    // 0xb0(0x30)
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class WaitForActorOfInterestToUnregisterStepDesc: public TaleQuestStepDesc
{
public:
	class                                                        ActorOfInterestId;                                 // 0x80(0x8)
	Struct FText                                                 ActorOfInterestUnregisteredFailureMessage;         // 0x88(0x38)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class WaitForGameEventToCompleteStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableGameEvent                                GameEvent;                                         // 0x80(0x30)
};


// Size 0x10 (Full Size[0x90] - InheritedSize[0x80]
class WaitForHealthToReachFractionStepDesc: public TaleQuestStepDesc
{
public:
	Class Actor*                                                 HealthOwner;                                       // 0x80(0x8)
	float                                                        HealthFraction;                                    // 0x88(0x4)
	char                                                         pad0x4_K3L36[0x4];                                 // 0x8c(0x4)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class WaitForItemPickupStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    Item;                                              // 0x80(0x30)
	Struct QuestVariableActor                                    PickerUpper;                                       // 0xb0(0x30)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class WaitForQueryableStateValueStepDescBase: public TaleQuestStepDesc
{
public:
	class                                                        DataID;                                            // 0x80(0x8)
};


// Size 0x8 (Full Size[0x90] - InheritedSize[0x88]
class WaitForQueryableStateValueBoolStepDesc: public WaitForQueryableStateValueStepDescBase
{
public:
	bool                                                         ExpectedValue;                                     // 0x88(0x1)
	char                                                         pad0x7_1BYK6[0x7];                                 // 0x89(0x7)
};


// Size 0x8 (Full Size[0x90] - InheritedSize[0x88]
class WaitForQueryableStateValueIntStepDesc: public WaitForQueryableStateValueStepDescBase
{
public:
	int                                                          ExpectedValue;                                     // 0x88(0x4)
	char                                                         pad0x4_QI59I[0x4];                                 // 0x8c(0x4)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class WaitForSpawnedPawnBaseStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableAISpawner                                AISpawner;                                         // 0x80(0x30)
};


// Size 0x198 (Full Size[0x230] - InheritedSize[0x98]
class TaleQuestSelectShipwreckLocationFromValidCandidatesStep: public TaleQuestStep
{
public:
	char                                                         pad0x78_BP070[0x78];                               // 0x98(0x78)
	Class TaleQuestSelectorService*                              CachedSelectorService;                             // 0x110(0x8)
	char                                                         pad0x118_TJ4TH[0x118];                             // 0x118(0x118)
};


// Size 0x98 (Full Size[0x118] - InheritedSize[0x80]
class TaleQuestSelectShipwreckLocationFromValidCandidatesStepDesc: public TaleQuestStepDesc
{
public:
	Class TaleQuestArrayEntrySelectionStrategy*                  SelectionStrategy;                                 // 0x80(0x8)
	Struct QuestVariableVectorArray                              InputArray;                                        // 0x88(0x30)
	Struct QuestVariableVector                                   OutputEntry;                                       // 0xb8(0x30)
	Struct QuestVariableBool                                     ShuffleLists;                                      // 0xe8(0x30)
};


// Size 0x10 (Full Size[0x90] - InheritedSize[0x80]
class RemoveFlameOfFateTypeStepDesc: public TaleQuestStepDesc
{
public:
	byte                                                         FlameOfFateTypeToRemove;                           // 0x80(0x1)
	char                                                         pad0x7_7IQZY[0x7];                                 // 0x81(0x7)
	class                                                        LanternItemCategory;                               // 0x88(0x8)
};


// Size 0x60 (Full Size[0xc0] - InheritedSize[0x60]
class TaleQuestFlameOfFateService: public TaleQuestService
{
public:
	Class TaleQuestFlameOfFateServiceDesc*                       ServiceDesc;                                       // 0x60(0x8)
	char                                                         pad0x58_OBIQK[0x58];                               // 0x68(0x58)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class TaleQuestFlameOfFateServiceDesc: public TaleQuestServiceDesc
{
public:
	class                                                        LanternItemCategory;                               // 0x28(0x8)
	byte                                                         FlameOfFateTypeToSet;                              // 0x30(0x1)
	bool                                                         SetFlameOnStart;                                   // 0x31(0x1)
	char                                                         pad0x6_9TXCU[0x6];                                 // 0x32(0x6)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddBountyMapStep: public TaleQuestStep
{
public:
};


// Size 0x108 (Full Size[0x188] - InheritedSize[0x80]
class TaleQuestAddBountyMapStepDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	Struct QuestVariableText                                     Location;                                          // 0xb8(0x30)
	Struct QuestVariableTextArray                                Description;                                       // 0xe8(0x30)
	Struct QuestVariableBountyTargetArray                        CaptainTargets;                                    // 0x118(0x30)
	Struct QuestVariableBountyTargetArray                        CrewTargets;                                       // 0x148(0x30)
	Class BountyMapLayout*                                       CustomLayout;                                      // 0x178(0x8)
	class                                                        OverrideTreasureMapItemDesc;                       // 0x180(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddCargoRunMapStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddChecklistMapStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddCircleMapStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddMerchantMapStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddRiddleMapStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddXMarksMapStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAdvanceRiddleMapStep: public TaleQuestStep
{
public:
};


// Size 0xb0 (Full Size[0x110] - InheritedSize[0x60]
class TaleQuestMapService: public TaleQuestService
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestMapServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0xa0 (Full Size[0x120] - InheritedSize[0x80]
class TaleQuestAddCargoRunMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	Struct QuestVariableInt                                      NumItems;                                          // 0xb8(0x30)
	Struct QuestVariableGuid                                     NPCId;                                             // 0xe8(0x30)
	Class CargoRunMapLayout*                                     Layout;                                            // 0x118(0x8)
};


// Size 0x120 (Full Size[0x1a0] - InheritedSize[0x80]
class TaleQuestAddChecklistMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableText                                     Title;                                             // 0xa8(0x30)
	Struct QuestVariableText                                     Description;                                       // 0xd8(0x30)
	Struct QuestVariableDataAsset                                ChecklistItemsData;                                // 0x108(0x30)
	Struct QuestVariableText                                     Afternote;                                         // 0x138(0x30)
	Struct QuestVariableDataAsset                                Layout;                                            // 0x168(0x30)
	byte                                                         RadialMiniIcon;                                    // 0x198(0x1)
	char                                                         pad0x7_7ZZ4B[0x7];                                 // 0x199(0x7)
};


// Size 0x70 (Full Size[0xf0] - InheritedSize[0x80]
class TaleQuestAddCircleMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	Struct QuestVariableVector                                   Location;                                          // 0xb8(0x30)
	float                                                        CircleScale;                                       // 0xe8(0x4)
	byte                                                         RadialMiniIcon;                                    // 0xec(0x1)
	char                                                         pad0x3_MQ7DB[0x3];                                 // 0xed(0x3)
};


// Size 0xd0 (Full Size[0x150] - InheritedSize[0x80]
class TaleQuestAddMerchantMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	Struct QuestVariableText                                     DeliveryLocation;                                  // 0xb8(0x30)
	Struct QuestVariableText                                     DeliverByTime;                                     // 0xe8(0x30)
	Struct QuestVariableMerchantItemArray                        Items;                                             // 0x118(0x30)
	Class MerchantMapLayout*                                     Layout;                                            // 0x148(0x8)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class TaleQuestAddRiddleMapBaseStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
};


// Size 0x10 (Full Size[0xc8] - InheritedSize[0xb8]
class TaleQuestAddRiddleMapStepDesc: public TaleQuestAddRiddleMapBaseStepDesc
{
public:
	TArray<struct FText>                                         Text;                                              // 0xb8(0x10)
};


// Size 0x30 (Full Size[0xe8] - InheritedSize[0xb8]
class TaleQuestAddRiddleMapUsingVariableStepDesc: public TaleQuestAddRiddleMapBaseStepDesc
{
public:
	Struct QuestVariableTextArray                                TextVariable;                                      // 0xb8(0x30)
};


// Size 0xc8 (Full Size[0x148] - InheritedSize[0x80]
class TaleQuestAddXMarksMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	Struct QuestVariableVector                                   Location;                                          // 0xb8(0x30)
	Struct QuestVariableBool                                     IsUnderground;                                     // 0xe8(0x30)
	Struct TaleQuestVariableTreasureMapItemDescType              TreasureMapOverride;                               // 0x118(0x30)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestAdvanceRiddleMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestRemoveMapStep: public TaleQuestStep
{
public:
	Class TaleQuestRemoveMapStepDesc*                            StepDesc;                                          // 0x98(0x8)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class TaleQuestRemoveMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableVector                                   Location;                                          // 0x88(0x30)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestUpdateMerchantMapStep: public TaleQuestStep
{
public:
	Class TaleQuestUpdateMerchantMapStepDesc*                    Desc;                                              // 0x98(0x8)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class TaleQuestUpdateMerchantMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableMerchantItem                             Item;                                              // 0x88(0x30)
	Struct QuestVariableInt                                      Index;                                             // 0xb8(0x30)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestWaitForChecklistMapCompletionStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
};


}