#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x270 (Full Size[0xa80] - InheritedSize[0x810]
class TaleNote: public SkeletalMeshWieldableItem
{
public:
	int                                                          CanvasWidth;                                       // 0x820(0x4)
	int                                                          CanvasHeight;                                      // 0x824(0x4)
	float                                                        FontScale;                                         // 0x828(0x4)
	class Font*                                                  Font;                                              // 0x830(0x8)
	struct TreasureMapWidgetStreamedTexture                      Image;                                             // 0x838(0x38)
	struct TreasureMapWidgetText                                 TitleWidgetText;                                   // 0x870(0x3c)
	struct TreasureMapWidgetText                                 BodyWidgetText;                                    // 0x8ac(0x3c)
	TArray<struct TreasureMapWidgetText>                         AdditionalBodyWidgetText;                          // 0x8e8(0x10)
	float                                                        NoteWidth;                                         // 0x8f8(0x4)
	float                                                        NoteLineSpacingMultiplier;                         // 0x8fc(0x4)
	struct FText                                                 Title;                                             // 0x900(0x38)
	struct FText                                                 Body;                                              // 0x938(0x38)
	TArray<struct Text>                                          AdditionalBody;                                    // 0x970(0x10)
	class MaybeCompressedCanvasRenderTarget2D*                   RenderTarget;                                      // 0x980(0x8)
	class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x988(0x8)
	class InventoryItemComponent*                                InventoryItemComponent;                            // 0x990(0x8)
	class ZoomInOnWieldableItemComponent*                        ZoomInOnWieldableComponent;                        // 0x998(0x8)
};


