#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Tales_Structs.h"


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class TaleQuestIndexedFrame: public Object
{
public:
	char                                                         pad0x8_2YX2E[0x8];                                 // 0x28(0x8)
	class TaleQuestForEachStepDescBase*                          Desc;                                              // 0x30(0x8)
	int                                                          Index;                                             // 0x38(0x4)
	char                                                         pad0x4c_HXEVX[0x4c];                               // 0x3c(0x4c)
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class TaleQuestQueryableStateCanAllDataBeReadNPCDialogConditional: public NPCDialogConditional
{
public:
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x30(0x10)
	bool                                                         ExpectedValue;                                     // 0x40(0x1)
	char                                                         pad0x7_7AXW8[0x7];                                 // 0x41(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestServiceDesc: public Object
{
public:
};


// Size 0x70 (Full Size[0x98] - InheritedSize[0x28]
class TaleQuestStep: public Object
{
public:
	char                                                         pad0x60_G4Q3R[0x60];                               // 0x28(0x60)
	class TaleQuestStepDesc*                                     TaleStepDesc;                                      // 0x88(0x8)
	char                                                         pad0x8_2TWRT[0x8];                                 // 0x90(0x8)
};


// Size 0x40 (Full Size[0xf8] - InheritedSize[0xb8]
class ContendedResourceComponent: public ActorComponent
{
public:
	char                                                         pad0x40_83FH7[0x40];                               // 0xb8(0x40)
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class TaleQuestQueryableStateCanAnyDataBeReadNPCDialogConditional: public NPCDialogConditional
{
public:
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x30(0x10)
	bool                                                         ExpectedValue;                                     // 0x40(0x1)
	char                                                         pad0x7_FHFXA[0x7];                                 // 0x41(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleMigrationAction: public Object
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnvQueryContext_TaleContextBase: public EnvQueryContext
{
public:
};


// Size 0x120 (Full Size[0x1a0] - InheritedSize[0x80]
class TaleQuestAddChecklistMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapID;                                             // 0x80(0x8)
	struct QuestVariableText                                     Title;                                             // 0xa8(0x30)
	struct QuestVariableText                                     Description;                                       // 0xd8(0x30)
	struct QuestVariableDataAsset                                ChecklistItemsData;                                // 0x108(0x30)
	struct QuestVariableText                                     Afternote;                                         // 0x138(0x30)
	struct QuestVariableDataAsset                                Layout;                                            // 0x168(0x30)
	char                                                         RadialMiniIcon;                                    // 0x198(0x1)
	char                                                         pad0x7_YX5JI[0x7];                                 // 0x199(0x7)
};


// Size 0xd0 (Full Size[0x150] - InheritedSize[0x80]
class TaleQuestAddMerchantMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapID;                                             // 0x80(0x8)
	struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	struct QuestVariableText                                     DeliveryLocation;                                  // 0xb8(0x30)
	struct QuestVariableText                                     DeliverByTime;                                     // 0xe8(0x30)
	struct QuestVariableMerchantItemArray                        Items;                                             // 0x118(0x30)
	class MerchantMapLayout*                                     Layout;                                            // 0x148(0x8)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class TaleQuestRemoveMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapID;                                             // 0x80(0x8)
	struct QuestVariableVector                                   Location;                                          // 0x88(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestExpressionInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestQueryableStatesReadInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestArrayEntrySelectionStrategy: public Object
{
public:
};


// Size 0x70 (Full Size[0xf0] - InheritedSize[0x80]
class TaleQuestAddCircleMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapID;                                             // 0x80(0x8)
	struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	struct QuestVariableVector                                   Location;                                          // 0xb8(0x30)
	float                                                        CircleScale;                                       // 0xe8(0x4)
	char                                                         RadialMiniIcon;                                    // 0xec(0x1)
	char                                                         pad0x3_WDQBH[0x3];                                 // 0xed(0x3)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class TaleQuestStepDesc: public Object
{
public:
	bool                                                         Fork;                                              // 0x28(0x1)
	char                                                         pad0x7_0ANUJ[0x7];                                 // 0x29(0x7)
	char                                                         pad0x50_C9DW6[0x50];                               // 0x30(0x50)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestQueryableStatesWriteInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class TaleQuestAddRiddleMapBaseStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapID;                                             // 0x80(0x8)
	struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class TaleQuestUpdateMerchantMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapID;                                             // 0x80(0x8)
	struct QuestVariableMerchantItem                             Item;                                              // 0x88(0x30)
	struct QuestVariableInt                                      Index;                                             // 0xb8(0x30)
};


// Size 0x0 (Full Size[0x30] - InheritedSize[0x30]
class StartTallTaleConditionalStatTrigger: public ConditionalStatsTriggerType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ValueProviderStepInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestPhaseBranchSelectorPredicateBase: public Object
{
public:
};


// Size 0xa0 (Full Size[0xc8] - InheritedSize[0x28]
class TaleQuestSeasonNotificationDataAsset: public DataAsset
{
public:
	struct SeasonTextPopupAsset                                  SeasonTextPopupAsset;                              // 0x28(0xa0)
};


// Size 0xd8 (Full Size[0x158] - InheritedSize[0x80]
class TaleQuestAddXMarksMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapID;                                             // 0x80(0x8)
	char                                                         QuestIconOverride;                                 // 0x88(0x1)
	char                                                         pad0x7_OFLPJ[0x7];                                 // 0x89(0x7)
	struct QuestVariableName                                     IslandName;                                        // 0x90(0x30)
	struct QuestVariableVector                                   Location;                                          // 0xc0(0x30)
	float                                                        LocationRadius;                                    // 0xf0(0x4)
	char                                                         pad0x4_39PGO[0x4];                                 // 0xf4(0x4)
	struct QuestVariableBool                                     IsUnderground;                                     // 0xf8(0x30)
	struct TaleQuestVariableTreasureMapItemDescType              TreasureMapOverride;                               // 0x128(0x30)
};


// Size 0x20 (Full Size[0xd8] - InheritedSize[0xb8]
class TaleQuestQueryableStatesQuantityContainerComponent: public ActorComponent
{
public:
	char                                                         pad0x8_UHLXK[0x8];                                 // 0xb8(0x8)
	class UClass*                                                QuantityDataID;                                    // 0xc0(0x8)
	class UClass*                                                OptionalCapacityOverrideDataID;                    // 0xc8(0x8)
	int                                                          Capacity;                                          // 0xd0(0x4)
	char                                                         pad0x4_O3RJU[0x4];                                 // 0xd4(0x4)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestWaitForChecklistMapCompletionStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapID;                                             // 0x80(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class IslandTypeWeightsDataAsset: public DataAsset
{
public:
	TArray<struct IslandTypeWeights>                             IslandTypeWeightsForDifficultyRanks;               // 0x28(0x10)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class TaleQuestMerchantContract: public Object
{
public:
	char                                                         pad0x60_LOT7M[0x60];                               // 0x28(0x60)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestCompoundStepInterface: public Interface
{
public:
};


// Size 0xa0 (Full Size[0x120] - InheritedSize[0x80]
class TaleQuestAddCargoRunMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapID;                                             // 0x80(0x8)
	struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	struct QuestVariableInt                                      NumItems;                                          // 0xb8(0x30)
	struct QuestVariableGuid                                     NPCId;                                             // 0xe8(0x30)
	class CargoRunMapLayout*                                     Layout;                                            // 0x118(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class NameRedirectionDataAsset: public DataAsset
{
public:
	TArray<struct NameRedirectionData>                           NameRedirectionData;                               // 0x28(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestSelectorServiceBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0xc0 (Full Size[0xe8] - InheritedSize[0x28]
class TaleQuestCargoRunContract: public Object
{
public:
	char                                                         pad0x40_ID93N[0x40];                               // 0x28(0x40)
	TArray<struct TaleQuestCargoRunContractItem>                 ItemsToCollect;                                    // 0x68(0x10)
	char                                                         pad0x10_X97RM[0x10];                               // 0x78(0x10)
	class Actor*                                                 DeliverToNPC;                                      // 0x88(0x8)
	class Actor*                                                 CollectFromNPC;                                    // 0x90(0x8)
	char                                                         pad0x50_BP3KY[0x50];                               // 0x98(0x50)
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class TaleQuestQueryableStateReadAnyValueBoolNPCDialogConditional: public NPCDialogConditional
{
public:
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x30(0x10)
	bool                                                         ExpectedValue;                                     // 0x40(0x1)
	char                                                         pad0x7_87EDJ[0x7];                                 // 0x41(0x7)
};


// Size 0x38 (Full Size[0x60] - InheritedSize[0x28]
class TaleQuestService: public Object
{
public:
	char                                                         pad0x38_U0KML[0x38];                               // 0x28(0x38)
};


// Size 0x20 (Full Size[0x640] - InheritedSize[0x620]
class SplineFootprintPathComponent: public SplineComponent
{
public:
	float                                                        DistanceBetweenDecals;                             // 0x618(0x4)
	char                                                         pad0x4_QNABG[0x4];                                 // 0x61c(0x4)
	class MaterialInterface*                                     DecalMaterial;                                     // 0x620(0x8)
	struct SplineFootprintPathTool                               PathTool;                                          // 0x628(0x1)
	char                                                         pad0x3_2B75I[0x3];                                 // 0x629(0x3)
	float                                                        DecalYaw;                                          // 0x62c(0x4)
	struct Vector                                                DecalUniformScale;                                 // 0x630(0xc)
	char                                                         pad0x4_80ML2[0x4];                                 // 0x63c(0x4)
};


// Size 0x10 (Full Size[0x40] - InheritedSize[0x30]
class TaleQuestQueryableStateReadValueIntNPCDialogConditional: public NPCDialogConditional
{
public:
	class UClass*                                                DataID;                                            // 0x30(0x8)
	int                                                          ExpectedValue;                                     // 0x38(0x4)
	char                                                         ComparisonToExpectedValue;                         // 0x3c(0x1)
	char                                                         pad0x3_IM1H9[0x3];                                 // 0x3d(0x3)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestStepInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestQueryableStatesQuantityReaderInterface: public Interface
{
public:
};


// Size 0x18 (Full Size[0x48] - InheritedSize[0x30]
class TaleQuestQueryableStateReadAllValueBoolNPCDialogConditional: public NPCDialogConditional
{
public:
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x30(0x10)
	bool                                                         ExpectedValue;                                     // 0x40(0x1)
	char                                                         pad0x7_EHS4D[0x7];                                 // 0x41(0x7)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class TaleQuestMacroAsset: public DataAsset
{
public:
	class TaleQuestStepDesc*                                     MacroRoot;                                         // 0x28(0x8)
	struct FText                                                 MacroTooltip;                                      // 0x30(0x38)
	class TaleStruct*                                            MacroParameters;                                   // 0x68(0x8)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestAdvanceRiddleMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapID;                                             // 0x80(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestQueryableStateDataID: public Object
{
public:
};


// Size 0x88 (Full Size[0xc0] - InheritedSize[0x38]
class TaleQuestImportFrame: public TaleQuestRootFrame
{
public:
	char                                                         pad0x88_JYYDL[0x88];                               // 0x38(0x88)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ShroudBreakerServiceInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0xd8] - InheritedSize[0xb8]
class TaleQuestQueryableStatesAccessComponent: public ActorComponent
{
public:
	char                                                         pad0x10_J4ESM[0x10];                               // 0xb8(0x10)
	TArray<struct TaleQuestQueryableStateDataInfo>               TalesData;                                         // 0xc8(0x10)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestSetDigSpotVoyageStatusStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestCargoRunContractsServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class SelectNamedPointStep: public TaleQuestStep
{
public:
};


// Size 0xc8 (Full Size[0x148] - InheritedSize[0x80]
class ParticipantRadiusArrayTrackerStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        DurationBetweenChecks;                             // 0x80(0x4)
	char                                                         pad0x4_MM9IA[0x4];                                 // 0x84(0x4)
	struct QuestVariableActorArray                               Actors;                                            // 0x88(0x30)
	struct QuestVariableVectorArray                              Locations;                                         // 0xb8(0x30)
	struct QuestVariableFloat                                    Radius;                                            // 0xe8(0x30)
	struct QuestVariableVector                                   OutLocation;                                       // 0x118(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class RandomArrayEntrySelectionStrategy: public TaleQuestArrayEntrySelectionStrategy
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class SetReplenishableContentSelectorStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class FixedArrayEntrySelectionStrategy: public TaleQuestArrayEntrySelectionStrategy
{
public:
	int                                                          IndexToSelect;                                     // 0x28(0x4)
	char                                                         pad0x4_UTOGH[0x4];                                 // 0x2c(0x4)
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class ProvokeHitReactionDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    ActorToProvoke;                                    // 0x80(0x30)
	class UClass*                                                DamageType;                                        // 0xb0(0x8)
	float                                                        DamageAmount;                                      // 0xb8(0x4)
	char                                                         DamageReason;                                      // 0xbc(0x1)
	char                                                         pad0x3_2HMUZ[0x3];                                 // 0xbd(0x3)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAdvanceRiddleMapStep: public TaleQuestStep
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestDisableInteractionStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class EnableInteractionWithActorStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
};


// Size 0x40 (Full Size[0xd8] - InheritedSize[0x98]
class TaleQuestGrantRewardStep: public TaleQuestStep
{
public:
	char                                                         pad0x40_AIF9N[0x40];                               // 0x98(0x40)
};


// Size 0x90 (Full Size[0x128] - InheritedSize[0x98]
class WaitForQueryableStateValueStep: public TaleQuestStep
{
public:
	char                                                         pad0x90_BCWEN[0x90];                               // 0x98(0x90)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class DoEQSQueryStepDesc: public TaleQuestStepDesc
{
public:
	class EnvQuery*                                              EQSQuery;                                          // 0x80(0x8)
	struct QuestVariableArray                                    OutPoints;                                         // 0x88(0x30)
};


// Size 0x108 (Full Size[0x188] - InheritedSize[0x80]
class SpawnPhasedItemStepDesc: public TaleQuestStepDesc
{
public:
	bool                                                         TrackItem;                                         // 0x80(0x1)
	bool                                                         MarkItemAsCritical;                                // 0x81(0x1)
	char                                                         pad0x6_2EG0P[0x6];                                 // 0x82(0x6)
	struct FText                                                 CriticalActorLostMessage;                          // 0x88(0x38)
	struct FName                                                 SocketName;                                        // 0xc0(0x8)
	struct QuestVariableItemDescType                             Item;                                              // 0xc8(0x30)
	struct QuestVariableActor                                    LocatorVar;                                        // 0xf8(0x30)
	struct QuestVariableOrientedPoint                            LocatorPoint;                                      // 0x128(0x30)
	struct QuestVariableItemInfo                                 SpawnedItemVar;                                    // 0x158(0x30)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class TaleQuestActorServiceDesc: public TaleQuestServiceDesc
{
public:
	class UClass*                                                ItemLostFailureRunnable;                           // 0x28(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventExclusionZoneTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class SetEQSNamedContextStepDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 Name;                                              // 0x80(0x8)
	struct QuestVariableLinkEQSContext                           Value;                                             // 0x88(0x30)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class TaleQuestToggleInteractionDescriptionServiceDesc: public TaleQuestServiceDesc
{
public:
	bool                                                         ResetDisabledInteractsOnEnd;                       // 0x28(0x1)
	bool                                                         ResetEnabledInteractsOnEnd;                        // 0x29(0x1)
	char                                                         pad0x6_Z17K1[0x6];                                 // 0x2a(0x6)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class SetReplenishableContentSelectorStepDesc: public TaleQuestStepDesc
{
public:
	class StorageContainerContentTypeSelector*                   ContentTypeSelector;                               // 0x80(0x8)
	struct QuestVariableActor                                    ReplenishableActor;                                // 0x88(0x30)
};


// Size 0x60 (Full Size[0xf8] - InheritedSize[0x98]
class TaleQuestMacroRootStep: public TaleQuestStep
{
public:
	char                                                         pad0x8_4VYLK[0x8];                                 // 0x98(0x8)
	struct TaleStructInstance                                    Params;                                            // 0xa0(0x10)
	char                                                         pad0x48_UJI5Q[0x48];                               // 0xb0(0x48)
};


// Size 0xc8 (Full Size[0x148] - InheritedSize[0x80]
class GenerateDigLocationInRadiusStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableName                                     IslandName;                                        // 0x80(0x30)
	struct QuestVariableVector                                   Center;                                            // 0xb0(0x30)
	float                                                        RadiusInCm;                                        // 0xe0(0x4)
	char                                                         pad0x4_XU22L[0x4];                                 // 0xe4(0x4)
	struct QuestVariableVector                                   DigLocation;                                       // 0xe8(0x30)
	struct QuestVariableArray                                    AllDigLocationsInRadius;                           // 0x118(0x30)
};


// Size 0x10 (Full Size[0x90] - InheritedSize[0x80]
class TaleQuestAddQuestBookStepDesc: public TaleQuestStepDesc
{
public:
	class UClass*                                                QuestBookDesc;                                     // 0x80(0x8)
	class UClass*                                                RemapperClass;                                     // 0x88(0x8)
};


// Size 0x28 (Full Size[0x88] - InheritedSize[0x60]
class IslandReservationTaleService: public TaleQuestService
{
public:
	char                                                         pad0x18_XCO4K[0x18];                               // 0x60(0x18)
	struct FName                                                 NameOfIsland;                                      // 0x78(0x8)
	class IslandReservationTaleServiceDesc*                      IslandReservationTaleServiceDesc;                  // 0x80(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestStructStepBase: public TaleQuestStep
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class DestroySpawnedActorStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    ActorVar;                                          // 0x80(0x30)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestRemoveMapStep: public TaleQuestStep
{
public:
	class TaleQuestRemoveMapStepDesc*                            StepDesc;                                          // 0x98(0x8)
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class TaleQuestShipDiveStep: public TaleQuestStep
{
public:
	class TaleQuestShipDiveStepDesc*                             StepDesc;                                          // 0x98(0x8)
	char                                                         pad0x10_AGHT7[0x10];                               // 0xa0(0x10)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class TaleQuestRunnableStepDesc: public TaleQuestStepDesc
{
public:
	char                                                         pad0x68_EPGGX[0x68];                               // 0x80(0x68)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestStarFieldPuzzleSetupAndWaitForCompletionStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    StarFieldPuzzleActor;                              // 0x80(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestUpdateSpyglassWakeVisibilityStep: public TaleQuestStep
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class WaitForGameEventToCompleteStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableGameEvent                                GameEvent;                                         // 0x80(0x30)
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class TaleQuestEnumSwitchStep: public TaleQuestStep
{
public:
	char                                                         pad0x18_NNYIX[0x18];                               // 0x98(0x18)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class TaleQuestCrewGameEventBlockingTaleServiceDesc: public TaleQuestServiceDesc
{
public:
	float                                                        GracePeriodAfterServiceStops;                      // 0x28(0x4)
	char                                                         pad0x4_I4A5Z[0x4];                                 // 0x2c(0x4)
};


// Size 0xc0 (Full Size[0x120] - InheritedSize[0x60]
class TaleQuestMapService: public TaleQuestService
{
public:
	char                                                         pad0xc0_SC1VM[0xc0];                               // 0x60(0xc0)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class TaleQuestWaitForHandInStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    HandInActor;                                       // 0x80(0x30)
	class UClass*                                                SpecificItem;                                      // 0xb0(0x8)
	struct QuestVariableItemDescType                             HandInItem;                                        // 0xb8(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestInteractionPreventionServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestStarFieldPuzzleEndStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    StarFieldPuzzleActor;                              // 0x80(0x30)
};


// Size 0x20 (Full Size[0xb8] - InheritedSize[0x98]
class ParticipantRadiusTrackerStep: public TaleQuestStep
{
public:
	class ParticipantRadiusTrackerStepDesc*                      Desc;                                              // 0x98(0x8)
	char                                                         pad0x18_A4UFV[0x18];                               // 0xa0(0x18)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class CallObjectFunctionStepDesc: public TaleQuestStepDesc
{
public:
	class Object*                                                Target;                                            // 0x80(0x8)
	struct ClassFunctionSelectionType                            Function;                                          // 0x88(0x10)
	char                                                         pad0x50_27HON[0x50];                               // 0x98(0x50)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class ForceCannonLoadStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    Cannon;                                            // 0x80(0x30)
	struct QuestVariableActor                                    Projectile;                                        // 0xb0(0x30)
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class WaitForGameEventToCompleteStep: public TaleQuestStep
{
public:
	class GameEvent*                                             GameEvent;                                         // 0x98(0x8)
	char                                                         pad0x8_1EGZM[0x8];                                 // 0xa0(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class TaleQuestFlameOfFateServiceDesc: public TaleQuestServiceDesc
{
public:
	class UClass*                                                LanternItemCategory;                               // 0x28(0x8)
	char                                                         FlameOfFateTypeToSet;                              // 0x30(0x1)
	bool                                                         SetFlameOnStart;                                   // 0x31(0x1)
	char                                                         pad0x6_C4TP1[0x6];                                 // 0x32(0x6)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class TaleQuestGetVoyageGeneratorIslandStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableName                                     IslandName;                                        // 0x80(0x30)
	struct QuestVariableVector                                   IslandLocation;                                    // 0xb0(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class FindItemInCollectorsChestStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestRemoveCommonToolsStep: public TaleQuestStep
{
public:
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class SplinePathingActorAddPrimitiveStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    SplinePathingActor;                                // 0x80(0x30)
	struct QuestVariableActor                                    ActorToManipulate;                                 // 0xb0(0x30)
};


// Size 0x18 (Full Size[0x78] - InheritedSize[0x60]
class TaleShroudBreakerService: public TaleQuestService
{
public:
	char                                                         pad0x18_H0WR7[0x18];                               // 0x60(0x18)
};


// Size 0x60 (Full Size[0xc0] - InheritedSize[0x60]
class TaleQuestFlameOfFateService: public TaleQuestService
{
public:
	class TaleQuestFlameOfFateServiceDesc*                       ServiceDesc;                                       // 0x60(0x8)
	char                                                         pad0x58_0Q41N[0x58];                               // 0x68(0x58)
};


// Size 0x50 (Full Size[0xb0] - InheritedSize[0x60]
class TaleQuestQueryableStatesService: public TaleQuestService
{
public:
	TArray<struct TaleQuestQueryableStateDataInfo>               AllData;                                           // 0x60(0x10)
	char                                                         pad0x40_KZIYP[0x40];                               // 0x70(0x40)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestUpdateSpyglassTargetLocationStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableVector                                   NewLocation;                                       // 0x80(0x30)
};


// Size 0x50 (Full Size[0xb0] - InheritedSize[0x60]
class TaleQuestShipSetSinkingParamsService: public TaleQuestService
{
public:
	class TaleQuestShipSetSinkingParamsServiceDesc*              Desc;                                              // 0x60(0x8)
	char                                                         pad0x48_OWVTK[0x48];                               // 0x68(0x48)
};


// Size 0x58 (Full Size[0xb8] - InheritedSize[0x60]
class TaleQuestToggleInteractionDescriptionService: public TaleQuestService
{
public:
	char                                                         pad0x50_925M2[0x50];                               // 0x60(0x50)
	class TaleQuestToggleInteractionDescriptionServiceDesc*      Desc;                                              // 0xb0(0x8)
};


// Size 0x98 (Full Size[0x130] - InheritedSize[0x98]
class TaleQuestChooseIslandFromWeightsStep: public TaleQuestStep
{
public:
	char                                                         pad0x90_VUQRU[0x90];                               // 0x98(0x90)
	class IslandTypeWeightsDataAsset*                            IslandTypeWeights;                                 // 0x128(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestClearTaleProposalsStep: public TaleQuestStep
{
public:
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class SplinePathingActorActivationStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    SplinePathingActor;                                // 0x80(0x30)
	struct QuestVariableBool                                     IsActivated;                                       // 0xb0(0x30)
};


// Size 0x38 (Full Size[0x98] - InheritedSize[0x60]
class TaleQuestActorOfInterestService: public TaleQuestService
{
public:
	class TaleQuestActorOfInterestServiceDesc*                   Desc;                                              // 0x60(0x8)
	char                                                         pad0x30_QS30M[0x30];                               // 0x68(0x30)
};


// Size 0x40 (Full Size[0xd8] - InheritedSize[0x98]
class DebugTaleAddInstancedLevelStep: public TaleQuestStep
{
public:
	char                                                         pad0x8_02U7L[0x8];                                 // 0x98(0x8)
	class DebugTaleAddInstancedLevelStepDesc*                    StepDesc;                                          // 0xa0(0x8)
	struct FString                                               InstancedLevelPath;                                // 0xa8(0x10)
	char                                                         pad0x20_TLKV3[0x20];                               // 0xb8(0x20)
};


// Size 0x48 (Full Size[0xa8] - InheritedSize[0x60]
class TaleQuestCargoRunContractsService: public TaleQuestService
{
public:
	TArray<class TaleQuestCargoRunContract*>                     Contracts;                                         // 0x60(0x10)
	char                                                         pad0x38_N8DZC[0x38];                               // 0x70(0x38)
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class InvokeDamageDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    ActorToDamage;                                     // 0x80(0x30)
	class UClass*                                                DamageType;                                        // 0xb0(0x8)
	float                                                        DamageAmount;                                      // 0xb8(0x4)
	char                                                         DamageReason;                                      // 0xbc(0x1)
	char                                                         pad0x3_E5VYW[0x3];                                 // 0xbd(0x3)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestStartPermanentPromptAndWaitForEndEventStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariablePrioritisedPrompt                        Prompt;                                            // 0x80(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestParticipantDeathServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class SplinePathingActorActivationStep: public TaleQuestStep
{
public:
};


// Size 0x168 (Full Size[0x1e8] - InheritedSize[0x80]
class PlaySequencerAnimationOnCutsceneActorStepDesc: public TaleQuestStepDesc
{
public:
	class LevelSequence*                                         LevelSequence;                                     // 0x80(0x8)
	float                                                        Delay;                                             // 0x88(0x4)
	char                                                         pad0x4_QGCOG[0x4];                                 // 0x8c(0x4)
	struct QuestVariableActor                                    DockableBaseActor;                                 // 0x90(0x30)
	struct QuestVariableActor                                    SequencerCutSceneActor;                            // 0xc0(0x30)
	struct QuestVariableActor                                    ActorToPossess;                                    // 0xf0(0x30)
	struct QuestVariableArray                                    AdditionalPossessables;                            // 0x120(0x30)
	struct QuestVariableActor                                    ManuallySetInteractor;                             // 0x150(0x30)
	struct QuestVariableActor                                    InteractingActor;                                  // 0x180(0x30)
	struct FString                                               PossessableName;                                   // 0x1b0(0x10)
	class SceneDialogueData*                                     DialogueData;                                      // 0x1c0(0x8)
	TArray<struct Text>                                          LocalisableNames;                                  // 0x1c8(0x10)
	bool                                                         IsLevelSequenceActorAlwaysRelevant;                // 0x1d8(0x1)
	bool                                                         IsLooping;                                         // 0x1d9(0x1)
	char                                                         pad0x2_OW0HR[0x2];                                 // 0x1da(0x2)
	float                                                        SubtitleSphereRadiusInCm;                          // 0x1dc(0x4)
	class LevelSequence*                                         FemaleLevelSequence;                               // 0x1e0(0x8)
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class RemoveGameEventExclusionZoneStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        Radius;                                            // 0x80(0x4)
	bool                                                         ShouldGetRadiusFromRemoteConfig;                   // 0x84(0x1)
	char                                                         pad0x3_2S6QN[0x3];                                 // 0x85(0x3)
	struct FName                                                 RemoteConfigKeyRadius;                             // 0x88(0x8)
	struct QuestVariableVector                                   Location;                                          // 0x90(0x30)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class TaleQuestPermanentPromptStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariablePrioritisedPrompt                        Prompt;                                            // 0x80(0x30)
	char                                                         StartOrStop;                                       // 0xb0(0x1)
	char                                                         pad0x7_BTK67[0x7];                                 // 0xb1(0x7)
};


// Size 0x20 (Full Size[0x80] - InheritedSize[0x60]
class TaleQuestSuppressIslandBannersService: public TaleQuestService
{
public:
	class TaleQuestSuppressIslandBannersServiceDesc*             Desc;                                              // 0x60(0x8)
	char                                                         pad0x18_912FP[0x18];                               // 0x68(0x18)
};


// Size 0x30 (Full Size[0x90] - InheritedSize[0x60]
class RewardGenTaleQuestService: public TaleQuestService
{
public:
	class TaleQuestWeightedItemDescSpawnDataAsset*               GlobalSpawnData;                                   // 0x60(0x8)
	TArray<int>                                                  ValidSpawnData;                                    // 0x68(0x10)
	TArray<class ItemSpawnData*>                                 ItemsToSpawn;                                      // 0x78(0x10)
	char                                                         pad0x8_QSLNF[0x8];                                 // 0x88(0x8)
};


// Size 0x90 (Full Size[0x110] - InheritedSize[0x80]
class WaitForItemPickupStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    Item;                                              // 0x80(0x30)
	struct QuestVariableBool                                     CompleteOnPickupAndStore;                          // 0xb0(0x30)
	struct QuestVariableActor                                    PickerUpper;                                       // 0xe0(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestFireEventStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestSetDigSpotVoyageStatusStepDesc: public TaleQuestStepDesc
{
public:
	char                                                         VoyageStatus;                                      // 0x80(0x1)
	char                                                         pad0x7_NQL03[0x7];                                 // 0x81(0x7)
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class TaleQuestCrewTaskStep: public TaleQuestStep
{
public:
	char                                                         pad0x38_JQZNL[0x38];                               // 0x98(0x38)
};


// Size 0x28 (Full Size[0xc0] - InheritedSize[0x98]
class TaleQuestStartPermanentPromptAndWaitForEndEventStep: public TaleQuestStep
{
public:
	char                                                         pad0x28_JCM2Y[0x28];                               // 0x98(0x28)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class TaleQuestSuppressIslandBannersServiceDesc: public TaleQuestServiceDesc
{
public:
	bool                                                         DoNotSuppressDiveTargetIsland;                     // 0x28(0x1)
	char                                                         pad0x7_QLRWH[0x7];                                 // 0x29(0x7)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestNotificationQuestsBegunStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestQueryableStatesServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x68 (Full Size[0x100] - InheritedSize[0x98]
class SpawnPhasedActorWithTransformStep: public TaleQuestStep
{
public:
	char                                                         pad0x68_1IVD4[0x68];                               // 0x98(0x68)
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class WaitForActorOfInterestToUnregisterStepDesc: public TaleQuestStepDesc
{
public:
	class UClass*                                                ActorOfInterestId;                                 // 0x80(0x8)
	struct FText                                                 ActorOfInterestUnregisteredFailureMessage;         // 0x88(0x38)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestGetGlobalDigSpotDataStep: public TaleQuestStep
{
public:
};


// Size 0x98 (Full Size[0x118] - InheritedSize[0x80]
class TaleQuestChooseIslandFromWeightsStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableNameArray                                IslandsToChooseFrom;                               // 0x80(0x30)
	struct QuestVariableInt                                      DifficultyRank;                                    // 0xb0(0x30)
	struct QuestVariableName                                     ChosenIsland;                                      // 0xe0(0x30)
	class IslandTypeWeightsDataAsset*                            IslandTypeWeights;                                 // 0x110(0x8)
};


// Size 0x98 (Full Size[0x118] - InheritedSize[0x80]
class TaleQuestSelectShipwreckLocationFromValidCandidatesStepDesc: public TaleQuestStepDesc
{
public:
	class TaleQuestArrayEntrySelectionStrategy*                  SelectionStrategy;                                 // 0x80(0x8)
	struct QuestVariableVectorArray                              InputArray;                                        // 0x88(0x30)
	struct QuestVariableVector                                   OutputEntry;                                       // 0xb8(0x30)
	struct QuestVariableBool                                     ShuffleLists;                                      // 0xe8(0x30)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class TaleQuestActorOfInterestServiceDesc: public TaleQuestServiceDesc
{
public:
	TArray<class Class*>                                         AllNeededActorsOfInterest;                         // 0x28(0x10)
	struct FText                                                 ActorOfInterestUnregisteredFailureMessage;         // 0x38(0x38)
};


// Size 0x20 (Full Size[0xb8] - InheritedSize[0x98]
class ParticipantRadiusArrayTrackerStep: public TaleQuestStep
{
public:
	class ParticipantRadiusArrayTrackerStepDesc*                 Desc;                                              // 0x98(0x8)
	char                                                         pad0x18_YO5J1[0x18];                               // 0xa0(0x18)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class ReleaseGameEventBlockStep: public TaleQuestStep
{
public:
};


// Size 0x90 (Full Size[0x128] - InheritedSize[0x98]
class TaleQuestSelectEntryFromArrayStep: public TaleQuestStep
{
public:
	struct QuestVariableArray                                    InputArray;                                        // 0x98(0x30)
	struct QuestVariable                                         OutputEntry;                                       // 0xc8(0x30)
	struct QuestVariableInt                                      OutputEntryIndex;                                  // 0xf8(0x30)
};


// Size 0xa0 (Full Size[0x120] - InheritedSize[0x80]
class ActorRadiusTrackerStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
	float                                                        DurationBetweenChecks;                             // 0xb0(0x4)
	char                                                         pad0x4_LS462[0x4];                                 // 0xb4(0x4)
	struct QuestVariableVector                                   Location;                                          // 0xb8(0x30)
	float                                                        Radius;                                            // 0xe8(0x4)
	char                                                         pad0x4_PZR18[0x4];                                 // 0xec(0x4)
	struct QuestVariableBool                                     ActorInsideRadius;                                 // 0xf0(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class SplinePathingActorAddPrimitiveStep: public TaleQuestStep
{
public:
};


// Size 0x90 (Full Size[0x110] - InheritedSize[0x80]
class TaleQuestEnumSwitchStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariable                                         EnumVar;                                           // 0x80(0x30)
	class Enum*                                                  Enum;                                              // 0xb0(0x8)
	class TaleQuestStepDesc*                                     DefaultBranch;                                     // 0xb8(0x8)
	char                                                         pad0x50_EDB8N[0x50];                               // 0xc0(0x50)
};


// Size 0x28 (Full Size[0xa8] - InheritedSize[0x80]
class TaleQuestForEachStepDescBase: public TaleQuestStepDesc
{
public:
	char                                                         pad0x8_SJG2B[0x8];                                 // 0x80(0x8)
	struct FName                                                 Collection;                                        // 0x88(0x8)
	class TaleQuestStepDesc*                                     Body;                                              // 0x90(0x8)
	struct FName                                                 KeyPinName;                                        // 0x98(0x8)
	struct FName                                                 ItemPinName;                                       // 0xa0(0x8)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TrackResponseCoordinatorStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableUObject                                  CutsceneResponseCoordinator;                       // 0x80(0x30)
};


// Size 0xd8 (Full Size[0x138] - InheritedSize[0x60]
class TaleQuestEQSService: public TaleQuestService
{
public:
	char                                                         pad0xd8_A4KQI[0xd8];                               // 0x60(0xd8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class TaleQuestPredicatedBranchPhasingServiceDesc: public TaleQuestServiceDesc
{
public:
	bool                                                         ClampAssignments;                                  // 0x28(0x1)
	bool                                                         TreatOutOfBoundsAssignmentsAsErrors;               // 0x29(0x1)
	char                                                         pad0x2_O0J38[0x2];                                 // 0x2a(0x2)
	int                                                          NumberOfClusters;                                  // 0x2c(0x4)
	class TaleQuestPhaseBranchSelectorPredicateBase*             PlayerAssignmentFunction;                          // 0x30(0x8)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestEmissaryCompanyActionRewardBoostStepDesc: public TaleQuestStepDesc
{
public:
	char                                                         CompanyActionType;                                 // 0x80(0x1)
	char                                                         pad0x7_XDIML[0x7];                                 // 0x81(0x7)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleShroudBreakerServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestAwaitCrewShipSinkStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableGuid                                     CrewId;                                            // 0x80(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestStartCameraFadeStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TrackResponseCoordinatorStep: public TaleQuestStep
{
public:
	class TrackResponseCoordinatorStepDesc*                      StepDesc;                                          // 0x98(0x8)
};


// Size 0x190 (Full Size[0x228] - InheritedSize[0x98]
class WaitForItemPickupStep: public TaleQuestStep
{
public:
	char                                                         pad0x190_ZX0GZ[0x190];                             // 0x98(0x190)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class WaitForActorToFullyDockStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    DockerActor;                                       // 0x80(0x30)
	struct QuestVariableActor                                    DockableTargetActor;                               // 0xb0(0x30)
};


// Size 0x70 (Full Size[0xf0] - InheritedSize[0x80]
class FindItemInCollectorsChestStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    CollectorsChest;                                   // 0x80(0x30)
	struct QuestVariableActor                                    ItemInChest;                                       // 0xb0(0x30)
	class UClass*                                                ItemToFind;                                        // 0xe0(0x8)
	bool                                                         AllowChildClasses;                                 // 0xe8(0x1)
	char                                                         pad0x7_9T44U[0x7];                                 // 0xe9(0x7)
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class GetVoyageDifficultyFromRankStep: public TaleQuestStep
{
public:
	char                                                         pad0x38_B7UY4[0x38];                               // 0x98(0x38)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestToggleAmbientMigrationForServerStepDesc: public TaleQuestStepDesc
{
public:
	bool                                                         AmbientMigrationAvailable;                         // 0x80(0x1)
	char                                                         pad0x7_85S6B[0x7];                                 // 0x81(0x7)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestToggleAmbientMigrationForServerStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestEmissaryCompanyActionRewardBoostStep: public TaleQuestStep
{
public:
	class TaleQuestEmissaryCompanyActionRewardBoostStepDesc*     Desc;                                              // 0x98(0x8)
};


// Size 0x58 (Full Size[0xf0] - InheritedSize[0x98]
class WaitForActorToFullyDockStep: public TaleQuestStep
{
public:
	char                                                         pad0x58_BANWW[0x58];                               // 0x98(0x58)
};


// Size 0xe0 (Full Size[0x160] - InheritedSize[0x80]
class LoadSequencerAnimationStepDesc: public TaleQuestStepDesc
{
public:
	TArray<class LevelSequence*>                                 LevelSequencesToLoad;                              // 0x80(0x10)
	struct QuestVariableActor                                    TargetActorToSpawn;                                // 0x90(0x30)
	struct QuestVariableActor                                    LevelSequenceActorSpawnLocation;                   // 0xc0(0x30)
	struct QuestVariableActor                                    SequencerCutSceneActor;                            // 0xf0(0x30)
	struct TaleQuestPhaseClusterRootActor                        OptionalPhaseCluster;                              // 0x120(0x30)
	bool                                                         AttachToTargetActor;                               // 0x150(0x1)
	char                                                         pad0x3_JJIVH[0x3];                                 // 0x151(0x3)
	struct FName                                                 AttachSocketName;                                  // 0x154(0x8)
	bool                                                         PlayGlobally;                                      // 0x15c(0x1)
	char                                                         pad0x3_WDGY7[0x3];                                 // 0x15d(0x3)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class FindNamedPointAsVectorStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddQuestBookStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class FindNamedPointAsTransformStep: public TaleQuestStep
{
public:
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class DebugTaleAddInstancedLevelStepDesc: public TaleQuestStepDesc
{
public:
	struct FText                                                 InstancedLevelKeyword;                             // 0x80(0x38)
	char                                                         pad0x8_W6AUN[0x8];                                 // 0xb8(0x8)
};


// Size 0x10 (Full Size[0x90] - InheritedSize[0x80]
class RemoveFlameOfFateTypeStepDesc: public TaleQuestStepDesc
{
public:
	char                                                         FlameOfFateTypeToRemove;                           // 0x80(0x1)
	char                                                         pad0x7_EYPRW[0x7];                                 // 0x81(0x7)
	class UClass*                                                LanternItemCategory;                               // 0x88(0x8)
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class ActorRadiusTrackerStep: public TaleQuestStep
{
public:
	class ActorRadiusTrackerStepDesc*                            Desc;                                              // 0x98(0x8)
	class Actor*                                                 TargetActor;                                       // 0xa0(0x8)
	char                                                         pad0x28_D93DV[0x28];                               // 0xa8(0x28)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class AddGameEventExclusionZoneStep: public TaleQuestStep
{
public:
};


// Size 0x18 (Full Size[0x78] - InheritedSize[0x60]
class TaleQuestInteractionPreventionService: public TaleQuestService
{
public:
	TArray<class Actor*>                                         TrackedInteractionActors;                          // 0x60(0x10)
	class TaleQuestInteractionPreventionServiceDesc*             Desc;                                              // 0x70(0x8)
};


// Size 0x20 (Full Size[0xa0] - InheritedSize[0x80]
class TaleQuestPredicateBranchStepDesc: public TaleQuestStepDesc
{
public:
	int                                                          NumBranches;                                       // 0x80(0x4)
	char                                                         pad0x4_65P8U[0x4];                                 // 0x84(0x4)
	class TaleQuestPhaseBranchSelectorPredicateBase*             BranchedTaskAssignmentFunction;                    // 0x88(0x8)
	TArray<struct TaleQuestPredicateBranchedTaskDesc>            BranchedTasks;                                     // 0x90(0x10)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class TaleQuestArrayItemStepBaseDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariable                                         ArrayQuestVar;                                     // 0x80(0x30)
	struct QuestVariable                                         ItemQuestVar;                                      // 0xb0(0x30)
};


// Size 0x10 (Full Size[0xc8] - InheritedSize[0xb8]
class TaleQuestAddRiddleMapStepDesc: public TaleQuestAddRiddleMapBaseStepDesc
{
public:
	TArray<struct Text>                                          Text;                                              // 0xb8(0x10)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestGetParticipatingCrewsInRadiusStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventBlockingTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class TaleQuestGetParticipatingCrewsInRadiusStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableGuidArray                                CrewIds;                                           // 0x80(0x30)
	struct QuestVariableVector                                   Location;                                          // 0xb0(0x30)
	float                                                        Radius;                                            // 0xe0(0x4)
	char                                                         pad0x4_MGERS[0x4];                                 // 0xe4(0x4)
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class TaleQuestAddCommonToolsStepDesc: public TaleQuestStepDesc
{
public:
	TArray<class Class*>                                         ToolsToGive;                                       // 0x80(0x10)
	struct QuestVariableActor                                    PlayerToWieldImmediately;                          // 0x90(0x30)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestUpdateSpyglassWakeVisibilityStepDesc: public TaleQuestStepDesc
{
public:
	bool                                                         NewVisibility;                                     // 0x80(0x1)
	char                                                         pad0x7_IP4SZ[0x7];                                 // 0x81(0x7)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestUpdateMerchantMapStep: public TaleQuestStep
{
public:
	class TaleQuestUpdateMerchantMapStepDesc*                    Desc;                                              // 0x98(0x8)
};


// Size 0x50 (Full Size[0xb0] - InheritedSize[0x60]
class TaleQuestScopeService: public TaleQuestService
{
public:
	char                                                         pad0x50_ANQYU[0x50];                               // 0x60(0x50)
};


// Size 0xc0 (Full Size[0x158] - InheritedSize[0x98]
class TaleQuestAwaitCrewShipSinkStep: public TaleQuestStep
{
public:
	char                                                         pad0xc0_0MYU7[0xc0];                               // 0x98(0xc0)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddChecklistMapStep: public TaleQuestStep
{
public:
};


// Size 0x70 (Full Size[0xf0] - InheritedSize[0x80]
class GenerateTinySharkHotspotsStepDesc: public TaleQuestStepDesc
{
public:
	int                                                          NumberOfHotspotsToGenerate;                        // 0x80(0x4)
	char                                                         pad0x4_UZBZC[0x4];                                 // 0x84(0x4)
	class EnvQuery*                                              EQSQuery;                                          // 0x88(0x8)
	struct QuestVariableVector                                   StartLocation;                                     // 0x90(0x30)
	struct QuestVariableVectorArray                              OutPoints;                                         // 0xc0(0x30)
};


// Size 0x18 (Full Size[0x98] - InheritedSize[0x80]
class TaleQuestShipSurfaceStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        ResurfaceMusicWindUpTime;                          // 0x80(0x4)
	bool                                                         AutoStopResurfaceMusic;                            // 0x84(0x1)
	char                                                         pad0x3_T9RXR[0x3];                                 // 0x85(0x3)
	float                                                        StopResurfaceMusicAfter;                           // 0x88(0x4)
	struct FName                                                 MusicThemeName;                                    // 0x8c(0x8)
	char                                                         pad0x4_8VSMH[0x4];                                 // 0x94(0x4)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestDisableInteractionStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestGetArrayElementStep: public TaleQuestStep
{
public:
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class TaleQuestAddZoomMapStep: public TaleQuestStep
{
public:
	class TaleQuestAddZoomMapStepDesc*                           Desc;                                              // 0x98(0x8)
	class TaleQuestMapService*                                   MapService;                                        // 0xa0(0x8)
	struct FName                                                 IslandName;                                        // 0xa8(0x8)
	struct Vector                                                ZoomCenterPoint;                                   // 0xb0(0xc)
	char                                                         pad0x4_VIPCY[0x4];                                 // 0xbc(0x4)
	TArray<struct Vector>                                        InputLocations;                                    // 0xc0(0x10)
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class TaleMigrationVolatileTaskStep: public TaleQuestStep
{
public:
	char                                                         pad0x10_FR8S6[0x10];                               // 0x98(0x10)
};


// Size 0x90 (Full Size[0x110] - InheritedSize[0x80]
class FindNamedPointStepDescBase: public TaleQuestStepDesc
{
public:
	char                                                         pad0x20_JITN0[0x20];                               // 0x80(0x20)
	struct QuestVariableActor                                    ActorToSearch;                                     // 0xa0(0x30)
	struct QuestVariableName                                     GroupNamePin;                                      // 0xd0(0x30)
	struct FName                                                 PointGroupName;                                    // 0x100(0x8)
	char                                                         SearchMethod;                                      // 0x108(0x1)
	char                                                         ReturnInSpace;                                     // 0x109(0x1)
	char                                                         pad0x6_Q9WAV[0x6];                                 // 0x10a(0x6)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class PreventInteractionWithActorStep: public TaleQuestStep
{
public:
};


// Size 0x40 (Full Size[0xa0] - InheritedSize[0x60]
class TaleQuestCrewGameEventBlockingTaleService: public TaleQuestService
{
public:
	char                                                         pad0x38_2TV3P[0x38];                               // 0x60(0x38)
	class TaleQuestCrewGameEventBlockingTaleServiceDesc*         ServiceDesc;                                       // 0x98(0x8)
};


// Size 0xf8 (Full Size[0x178] - InheritedSize[0x80]
class PlaySequencerAnimationStepDesc: public TaleQuestStepDesc
{
public:
	class LevelSequence*                                         LevelSequenceToPlay;                               // 0x80(0x8)
	struct QuestVariableActor                                    TargetActorToSpawn;                                // 0x88(0x30)
	struct QuestVariableActor                                    LevelSequenceActorSpawnLocation;                   // 0xb8(0x30)
	struct QuestVariableActor                                    DockableBaseActor;                                 // 0xe8(0x30)
	struct QuestVariableActor                                    InteractingActor;                                  // 0x118(0x30)
	bool                                                         PlayGlobally;                                      // 0x148(0x1)
	bool                                                         IsLevelSequenceActorAlawaysRelevant;               // 0x149(0x1)
	char                                                         pad0x6_H6T6B[0x6];                                 // 0x14a(0x6)
	class SceneDialogueData*                                     DialogueData;                                      // 0x150(0x8)
	TArray<struct Text>                                          LocalisableNames;                                  // 0x158(0x10)
	bool                                                         IsLooping;                                         // 0x168(0x1)
	char                                                         pad0x3_QLUD2[0x3];                                 // 0x169(0x3)
	float                                                        SubtitleSphereRadiusInCm;                          // 0x16c(0x4)
	class LevelSequence*                                         FemaleLevelSequenceToPlay;                         // 0x170(0x8)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class TaleQuestEventStepDescBase: public TaleQuestStepDesc
{
public:
	class Object*                                                Dispatcher;                                        // 0x80(0x8)
	struct NativeAndUserDefinedStructSelector                    EventType;                                         // 0x88(0x8)
	char                                                         pad0x50_03D7S[0x50];                               // 0x90(0x50)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddToArrayStep: public TaleQuestStep
{
public:
};


// Size 0xc0 (Full Size[0x140] - InheritedSize[0x80]
class TaleQuestGetGlobalDigSpotDataStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableItemSpawnDataType                        OutputItemSpawnData;                               // 0x80(0x30)
	struct QuestVariableOrientedPoint                            OutputOrientedPoint;                               // 0xb0(0x30)
	struct QuestVariableGuid                                     OutputVoyageID;                                    // 0xe0(0x30)
	struct QuestVariableName                                     OutputStoryName;                                   // 0x110(0x30)
};


// Size 0x18 (Full Size[0x98] - InheritedSize[0x80]
class TaleQuestUpdateCheckpointStepDesc: public TaleQuestStepDesc
{
public:
	struct RewardId                                              RewardIdToAward;                                   // 0x80(0x8)
	struct FName                                                 CampaignIdToRemove;                                // 0x88(0x8)
	struct FName                                                 Feature;                                           // 0x90(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestArrayUnionStep: public TaleQuestStep
{
public:
};


// Size 0x70 (Full Size[0xf0] - InheritedSize[0x80]
class OverrideManagedActorStateStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    ActorVar;                                          // 0x80(0x30)
	bool                                                         TrackActor;                                        // 0xb0(0x1)
	bool                                                         MarkAsCritical;                                    // 0xb1(0x1)
	char                                                         pad0x6_6M764[0x6];                                 // 0xb2(0x6)
	struct FText                                                 CriticalActorLostMessage;                          // 0xb8(0x38)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddRiddleMapStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class ProvokeHitReactionStep: public TaleQuestStep
{
public:
};


// Size 0x60 (Full Size[0xf8] - InheritedSize[0x98]
class TaleQuestFramedStep: public TaleQuestStep
{
public:
	char                                                         pad0x8_3KA24[0x8];                                 // 0x98(0x8)
	TArray<class TaleQuestService*>                              Services;                                          // 0xa0(0x10)
	class TaleQuestFramedStepDesc*                               FrameDesc;                                         // 0xb0(0x8)
	struct UserDefinedStructWithSerialisableValue                Variables;                                         // 0xb8(0x20)
	struct UserDefinedStructWithSerialisableValue                LocalVariables;                                    // 0xd8(0x20)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestGetVoyageGeneratorIslandStep: public TaleQuestStep
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class PreventInteractionWithActorStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddBountyMapStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddCargoRunMapStep: public TaleQuestStep
{
public:
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class TaleQuestForEachStepBase: public TaleQuestStep
{
public:
	TArray<struct BodyFramePair>                                 Bodies;                                            // 0x98(0x10)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class TaleQuestObstacleCourseSetupAndWaitForCompletionStep: public TaleQuestStep
{
public:
	char                                                         pad0x8_I2T8J[0x8];                                 // 0x98(0x8)
};


// Size 0x80 (Full Size[0x118] - InheritedSize[0x98]
class TaleQuestPredicateBranchTaskStep: public TaleQuestStep
{
public:
	char                                                         pad0x50_IN993[0x50];                               // 0x98(0x50)
	class TaleQuestPredicateBranchStepDesc*                      StepDesc;                                          // 0xe8(0x8)
	TArray<int>                                                  BranchesCompleted;                                 // 0xf0(0x10)
	char                                                         pad0x18_LKEFJ[0x18];                               // 0x100(0x18)
};


// Size 0x58 (Full Size[0xf0] - InheritedSize[0x98]
class TaleQuestAwaitEventStep: public TaleQuestStep
{
public:
	char                                                         pad0x58_GGBYJ[0x58];                               // 0x98(0x58)
};


// Size 0x48 (Full Size[0xa8] - InheritedSize[0x60]
class TaleQuestCheckpointService: public TaleQuestService
{
public:
	class TaleQuestCheckpointServiceDesc*                        Desc;                                              // 0x60(0x8)
	char                                                         pad0x40_7MCD1[0x40];                               // 0x68(0x40)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestObstacleCourseSetupAndWaitForCompletionStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    ObstacleCourseActor;                               // 0x80(0x30)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class VisualiseLoggerEQSResultsTaleStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableArray                                    ResultsArray;                                      // 0x80(0x30)
	struct QuestVariableVector                                   SelectedResult;                                    // 0xb0(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class DestroySpawnedActorStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class RequestGameEventBlockStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class CutsceneResponsesTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestStarFieldPuzzleDimStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    StarFieldPuzzleActor;                              // 0x80(0x30)
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class WaitForSpawnedPawnBaseStep: public TaleQuestStep
{
public:
	class AISpawner*                                             AISpawner;                                         // 0x98(0x8)
	char                                                         pad0x10_FBQV5[0x10];                               // 0xa0(0x10)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestRemoveQuestBookStep: public TaleQuestStep
{
public:
};


// Size 0x10 (Full Size[0x90] - InheritedSize[0x80]
class WaitForHealthToReachFractionStepDesc: public TaleQuestStepDesc
{
public:
	class Actor*                                                 HealthOwner;                                       // 0x80(0x8)
	float                                                        HealthFraction;                                    // 0x88(0x4)
	char                                                         pad0x4_PNLQE[0x4];                                 // 0x8c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestLockGhostShipDoorServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class SetEQSNamedContextStep: public TaleQuestStep
{
public:
	class SetEQSNamedContextStepDesc*                            Desc;                                              // 0x98(0x8)
};


// Size 0x28 (Full Size[0xa8] - InheritedSize[0x80]
class TaleQuestNotificationQuestsBegunStepDesc: public TaleQuestStepDesc
{
public:
	int                                                          NumQuests;                                         // 0x80(0x4)
	char                                                         pad0x4_BLUEO[0x4];                                 // 0x84(0x4)
	TArray<struct StringAssetReference>                          Icons;                                             // 0x88(0x10)
	struct StringAssetReference                                  Background;                                        // 0x98(0x10)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestUpdateSpyglassTargetLocationStep: public TaleQuestStep
{
public:
};


// Size 0x18 (Full Size[0x98] - InheritedSize[0x80]
class TaleQuestArrayOperationStepBaseDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 Array1;                                            // 0x80(0x8)
	struct FName                                                 Array2;                                            // 0x88(0x8)
	struct FName                                                 Result;                                            // 0x90(0x8)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestEnableInteractionStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class SelectNamedPointStepDesc: public TaleQuestStepDesc
{
public:
	char                                                         pad0x20_YCV5E[0x20];                               // 0x80(0x20)
	struct FName                                                 GroupName;                                         // 0xa0(0x8)
	int                                                          PointIndex;                                        // 0xa8(0x4)
	char                                                         ReturnInSpace;                                     // 0xac(0x1)
	char                                                         pad0x3_TQFAS[0x3];                                 // 0xad(0x3)
	struct QuestVariableOrientedPoint                            Point;                                             // 0xb0(0x30)
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class TaleQuestGetCollectionItemCountStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableCollection                               Collection;                                        // 0x80(0x30)
	struct QuestVariableInt                                      Num;                                               // 0xb0(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestUpdateCheckpointStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class EnableInteractionWithActorStep: public TaleQuestStep
{
public:
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class WaitForSpawnedPawnBaseStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableAISpawner                                AISpawner;                                         // 0x80(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestGetParticipatingCrewsStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestClearTaleProposalsStepDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 CampaignId;                                        // 0x80(0x8)
};


// Size 0x30 (Full Size[0x90] - InheritedSize[0x60]
class CutsceneResponsesTaleService: public TaleQuestService
{
public:
	TArray<class CutsceneResponseCoordinator*>                   TrackedResponseCoordinators;                       // 0x60(0x10)
	TArray<class CutsceneResponseComponent*>                     TrackedResponseComponents;                         // 0x70(0x10)
	TArray<class Actor*>                                         ResponseRelevantActors;                            // 0x80(0x10)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class WaitForQueryableStateValueStepDescBase: public TaleQuestStepDesc
{
public:
	class UClass*                                                DataID;                                            // 0x80(0x8)
};


// Size 0xc8 (Full Size[0x148] - InheritedSize[0x80]
class ParticipantRadiusTrackerStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        DurationBetweenChecks;                             // 0x80(0x4)
	char                                                         pad0x4_4MKIO[0x4];                                 // 0x84(0x4)
	struct QuestVariableVector                                   Location;                                          // 0x88(0x30)
	struct QuestVariableFloat                                    Radius;                                            // 0xb8(0x30)
	struct QuestVariableActorArray                               PlayersOutsideRadius;                              // 0xe8(0x30)
	struct QuestVariableActorArray                               PlayersInsideRadius;                               // 0x118(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class FindNamedPointStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class OverrideManagedActorStateStep: public TaleQuestStep
{
public:
};


// Size 0x118 (Full Size[0x198] - InheritedSize[0x80]
class TaleQuestAddZoomMapStepDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 MapID;                                             // 0x80(0x8)
	char                                                         QuestIconOverride;                                 // 0x88(0x1)
	char                                                         pad0x3_PUVL7[0x3];                                 // 0x89(0x3)
	float                                                        ZoomLevel;                                         // 0x8c(0x4)
	struct FText                                                 MapTitle;                                          // 0x90(0x38)
	TArray<struct Text>                                          Descriptions;                                      // 0xc8(0x10)
	struct QuestVariableVector                                   ZoomCenterPoint;                                   // 0xd8(0x30)
	struct QuestVariableVectorArray                              MarkLocations;                                     // 0x108(0x30)
	struct QuestVariableName                                     IslandName;                                        // 0x138(0x30)
	struct TaleQuestVariableTreasureMapItemDescType              TreasureMapOverride;                               // 0x168(0x30)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class LinkEQSContextWithVariableStepDesc: public TaleQuestStepDesc
{
public:
	class UClass*                                                Context;                                           // 0x80(0x8)
	struct QuestVariableSetEQSTaleContextValue                   Variable;                                          // 0x88(0x30)
};


// Size 0x90 (Full Size[0x110] - InheritedSize[0x80]
class SpawnDebrisAtVectorLocationStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableActorAssetType                           ActorToSpawn;                                      // 0x80(0x30)
	struct QuestVariableVector                                   LocatorVar;                                        // 0xb0(0x30)
	struct QuestVariableActor                                    ActorVar;                                          // 0xe0(0x30)
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class StopSuppressingCutsceneResponsesStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestArrayAppendStep: public TaleQuestStep
{
public:
};


// Size 0x60 (Full Size[0xe0] - InheritedSize[0x80]
class TaleQuestGrantRewardStepDesc: public TaleQuestStepDesc
{
public:
	struct RewardId                                              RewardId;                                          // 0x80(0x8)
	class UClass*                                                Company;                                           // 0x88(0x8)
	struct Guid                                                  Id;                                                // 0x90(0x10)
	bool                                                         ShouldGrantToAlliedCrews;                          // 0xa0(0x1)
	char                                                         pad0x7_BF3PE[0x7];                                 // 0xa1(0x7)
	struct QuestVariablePlayerActor                              SpecificPlayerToAward;                             // 0xa8(0x30)
	struct FName                                                 Feature;                                           // 0xd8(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class GetActorOfInterestStep: public TaleQuestStep
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class IslandReservationTaleServiceDesc: public TaleQuestServiceDesc
{
public:
	struct QuestVariableName                                     IslandName;                                        // 0x28(0x30)
};


// Size 0x90 (Full Size[0x110] - InheritedSize[0x80]
class SpawnPhasedActorWithTransformStepBaseDesc: public TaleQuestStepDesc
{
public:
	char                                                         pad0x20_UPO3J[0x20];                               // 0x80(0x20)
	bool                                                         MarkAsCritical;                                    // 0xa0(0x1)
	char                                                         pad0x7_97WEL[0x7];                                 // 0xa1(0x7)
	struct FText                                                 CriticalActorLostMessage;                          // 0xa8(0x38)
	struct QuestVariableActor                                    ActorVar;                                          // 0xe0(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class SpawnPhasedItemStep: public TaleQuestStep
{
public:
};


// Size 0x60 (Full Size[0xf8] - InheritedSize[0x98]
class GenerateTinySharkHotspotsStep: public TaleQuestStep
{
public:
	class GenerateTinySharkHotspotsStepDesc*                     Desc;                                              // 0x98(0x8)
	class TaleQuestEQSService*                                   CachedTaleEQSService;                              // 0xa0(0x8)
	int                                                          NumGeneratedPoints;                                // 0xa8(0x4)
	char                                                         pad0x4_WZHDF[0x4];                                 // 0xac(0x4)
	TArray<struct Vector>                                        HotspotPathPoints;                                 // 0xb0(0x10)
	char                                                         pad0x38_TK3CP[0x38];                               // 0xc0(0x38)
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class RewardGenTaleQuestServiceDesc: public TaleQuestServiceDesc
{
public:
	class TaleQuestWeightedItemDescSpawnDataAsset*               SpawnData;                                         // 0x28(0x8)
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class TaleQuestLockGhostShipDoorService: public TaleQuestService
{
public:
	class TaleQuestLockGhostShipDoorServiceDesc*                 Desc;                                              // 0x60(0x8)
};


// Size 0x98 (Full Size[0x118] - InheritedSize[0x80]
class TaleQuestSelectEntryFromArrayStepDesc: public TaleQuestStepDesc
{
public:
	class TaleQuestArrayEntrySelectionStrategy*                  SelectionStrategy;                                 // 0x80(0x8)
	struct QuestVariableArray                                    InputArray;                                        // 0x88(0x30)
	struct QuestVariableAny                                      OutputEntry;                                       // 0xb8(0x30)
	struct QuestVariableInt                                      OutputEntryIndex;                                  // 0xe8(0x30)
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class LoadSequencerAnimationStep: public TaleQuestStep
{
public:
	class LoadSequencerAnimationStepDesc*                        StepDesc;                                          // 0x98(0x8)
	class SequencerCutSceneActor*                                SequencerCutSceneActor;                            // 0xa0(0x8)
	class Actor*                                                 TargetToSpawnActor;                                // 0xa8(0x8)
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class TaleQuestShipSurfaceStep: public TaleQuestStep
{
public:
	class TaleQuestShipSurfaceStepDesc*                          StepDesc;                                          // 0x98(0x8)
	char                                                         pad0x10_G4OMY[0x10];                               // 0xa0(0x10)
};


// Size 0x20 (Full Size[0xa0] - InheritedSize[0x80]
class TaleQuestStartCameraFadeStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        FromAlpha;                                         // 0x80(0x4)
	float                                                        ToAlpha;                                           // 0x84(0x4)
	float                                                        FadeTimeInSeconds;                                 // 0x88(0x4)
	struct LinearColor                                           FadeColour;                                        // 0x8c(0x10)
	bool                                                         ShouldFadeAudio;                                   // 0x9c(0x1)
	bool                                                         HoldFadeWhenFinished;                              // 0x9d(0x1)
	char                                                         pad0x2_8RDT5[0x2];                                 // 0x9e(0x2)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class StartSuppressingCutsceneResponsesStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestStarFieldPuzzleDimStep: public TaleQuestStep
{
public:
};


// Size 0x88 (Full Size[0x120] - InheritedSize[0x98]
class WaitForActorOfInterestToUnregisterStep: public TaleQuestStep
{
public:
	class WaitForActorOfInterestToUnregisterStepDesc*            Desc;                                              // 0x98(0x8)
	char                                                         pad0x80_1A2W8[0x80];                               // 0xa0(0x80)
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class SpawnDebrisAtVectorLocationStep: public TaleQuestStep
{
public:
	class SpawnDebrisAtVectorLocationStepDesc*                   Desc;                                              // 0x98(0x8)
	class TaleQuestActorService*                                 ActorService;                                      // 0xa0(0x8)
};


// Size 0x40 (Full Size[0xc0] - InheritedSize[0x80]
class AddGameEventExclusionZoneStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        Radius;                                            // 0x80(0x4)
	bool                                                         ShouldGetRadiusFromRemoteConfig;                   // 0x84(0x1)
	char                                                         pad0x3_NSUMO[0x3];                                 // 0x85(0x3)
	struct FName                                                 RemoteConfigKeyRadius;                             // 0x88(0x8)
	struct QuestVariableVector                                   Location;                                          // 0x90(0x30)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestMacroRootStepDesc: public TaleQuestStepDesc
{
public:
	class TaleQuestStepDesc*                                     BodyDesc;                                          // 0x80(0x8)
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class TaleQuestRemoveQuestBookStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddCommonToolsStep: public TaleQuestStep
{
public:
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class TaleQuestMacroStepDesc: public TaleQuestStepDesc
{
public:
	class TaleQuestMacroAsset*                                   MacroAsset;                                        // 0x80(0x8)
	struct TaleStructInstance                                    ParameterInstance;                                 // 0xd8(0x10)
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class TaleQuestWaitForHandInStep: public TaleQuestStep
{
public:
	class TaleQuestWaitForHandInStepDesc*                        Desc;                                              // 0x98(0x8)
	char                                                         pad0x8_AKE8M[0x8];                                 // 0xa0(0x8)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class RequestGameEventBlockStep: public TaleQuestStep
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class SequentialArrayEntrySelectionStrategy: public TaleQuestArrayEntrySelectionStrategy
{
public:
	char                                                         pad0x8_KDJUO[0x8];                                 // 0x28(0x8)
};


// Size 0x30 (Full Size[0xb0] - InheritedSize[0x80]
class TaleQuestGetParticipatingCrewsStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableGuidArray                                CrewIds;                                           // 0x80(0x30)
};


// Size 0x38 (Full Size[0x98] - InheritedSize[0x60]
class GameEventBlockingTaleService: public TaleQuestService
{
public:
	char                                                         pad0x38_EV0IA[0x38];                               // 0x60(0x38)
};


// Size 0x370 (Full Size[0x3d0] - InheritedSize[0x60]
class TaleQuestActorService: public TaleQuestService
{
public:
	TArray<struct TrackedActorData>                              TrackedActors;                                     // 0x60(0x10)
	TArray<struct CriticalActorDelegateData>                     CriticalActors;                                    // 0x70(0x10)
	TArray<struct SnapshottedActorData>                          SnapshottedActors;                                 // 0x80(0x10)
	class TaleQuestActorServiceDesc*                             Desc;                                              // 0x90(0x8)
	class PhasedClusterRoot*                                     PhasedClusterRoot;                                 // 0x98(0x8)
	TArray<struct PhasedActor>                                   PhasedActors;                                      // 0xa0(0x10)
	TArray<struct PhasedItem>                                    PhasedItems;                                       // 0xb0(0x10)
	struct FText                                                 CriticalActorHandedInByAnotherCrewFailureMessage;  // 0xc0(0x38)
	char                                                         pad0x2d8_6L0JG[0x2d8];                             // 0xf8(0x2d8)
};


// Size 0x80 (Full Size[0xe0] - InheritedSize[0x60]
class TaleQuestPredicatedBranchPhasingService: public TaleQuestService
{
public:
	TArray<class PhasedClusterRoot*>                             SpawnedPhaseClustersRoots;                         // 0x60(0x10)
	class TaleQuestPredicatedBranchPhasingServiceDesc*           ServiceDesc;                                       // 0x70(0x8)
	char                                                         pad0x68_0J7ZL[0x68];                               // 0x78(0x68)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestScopeServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class StopSuppressingCutsceneResponsesStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class InvokeDamageStep: public TaleQuestStep
{
public:
};


// Size 0x50 (Full Size[0xd0] - InheritedSize[0x80]
class SpawnLayerStepDesc: public TaleQuestStepDesc
{
public:
	class LayerActorsDataAsset*                                  LayerAsset;                                        // 0x80(0x8)
	bool                                                         SpawnPhased;                                       // 0x88(0x1)
	char                                                         pad0x7_IIWVJ[0x7];                                 // 0x89(0x7)
	struct QuestVariableActor                                    ActorWithLayers;                                   // 0x90(0x30)
	TArray<struct QuestVariableActor>                            SpawnedActors;                                     // 0xc0(0x10)
};


// Size 0x8 (Full Size[0x88] - InheritedSize[0x80]
class TaleQuestTaskStepDescBase: public TaleQuestStepDesc
{
public:
	class TaleQuestStepDesc*                                     Task;                                              // 0x80(0x8)
};


// Size 0x108 (Full Size[0x188] - InheritedSize[0x80]
class TaleQuestAddBountyMapStepDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 MapID;                                             // 0x80(0x8)
	struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	struct QuestVariableText                                     Location;                                          // 0xb8(0x30)
	struct QuestVariableTextArray                                Description;                                       // 0xe8(0x30)
	struct QuestVariableBountyTargetArray                        CaptainTargets;                                    // 0x118(0x30)
	struct QuestVariableBountyTargetArray                        CrewTargets;                                       // 0x148(0x30)
	class BountyMapLayout*                                       CustomLayout;                                      // 0x178(0x8)
	class UClass*                                                OverrideTreasureMapItemDesc;                       // 0x180(0x8)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class TaleQuestFramedStepDesc: public TaleQuestStepDesc
{
public:
	TArray<class TaleQuestServiceDesc*>                          Services;                                          // 0x80(0x10)
	struct UserDefinedStructWithSerialisableValue                VariablesWithDefaults;                             // 0x90(0x20)
	struct InlineUserDefinedStructDetails                        GeneratedVariables;                                // 0xb0(0x8)
};


// Size 0x18 (Full Size[0x98] - InheritedSize[0x80]
class TaleQuestShipDiveStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        DiveMusicWindUpTime;                               // 0x80(0x4)
	bool                                                         AutoStopDiveMusic;                                 // 0x84(0x1)
	char                                                         pad0x3_2D8W9[0x3];                                 // 0x85(0x3)
	float                                                        StopDiveMusicAfter;                                // 0x88(0x4)
	struct FName                                                 MusicThemeName;                                    // 0x8c(0x8)
	char                                                         pad0x4_3CO2B[0x4];                                 // 0x94(0x4)
};


// Size 0x68 (Full Size[0xe8] - InheritedSize[0x80]
class TaleQuestGetArrayElementStepDesc: public TaleQuestStepDesc
{
public:
	struct QuestVariableArray                                    InputArray;                                        // 0x80(0x30)
	int                                                          Index;                                             // 0xb0(0x4)
	char                                                         pad0x4_6KPJY[0x4];                                 // 0xb4(0x4)
	struct QuestVariableAny                                      OutputEntry;                                       // 0xb8(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class RemoveGameEventExclusionZoneStep: public TaleQuestStep
{
public:
};


// Size 0x10 (Full Size[0x90] - InheritedSize[0x80]
class TaleQuestRemoveCommonToolsStepDesc: public TaleQuestStepDesc
{
public:
	TArray<class Class*>                                         ToolsToRemove;                                     // 0x80(0x10)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddXMarksMapStep: public TaleQuestStep
{
public:
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class TaleQuestShipSetSinkingParamsServiceDesc: public TaleQuestServiceDesc
{
public:
	struct QuestVariableGuid                                     CrewId;                                            // 0x28(0x30)
	class ShipSinkingParametersDataAsset*                        SmallShipSinkingData;                              // 0x58(0x8)
	class ShipSinkingParametersDataAsset*                        MediumShipSinkingData;                             // 0x60(0x8)
	class ShipSinkingParametersDataAsset*                        LargeShipSinkingData;                              // 0x68(0x8)
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class GenerateDigLocationInRadiusStep: public TaleQuestStep
{
public:
	char                                                         pad0x18_8ZIA6[0x18];                               // 0x98(0x18)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestMapServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestEnableInteractionStep: public TaleQuestStep
{
public:
};


// Size 0x28 (Full Size[0x88] - InheritedSize[0x60]
class TaleQuestSelectorService: public TaleQuestService
{
public:
	class TaleQuestSelectorServiceDesc*                          Desc;                                              // 0x60(0x8)
	char                                                         pad0x20_I4PZ7[0x20];                               // 0x68(0x20)
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class SpawnLayerStep: public TaleQuestStep
{
public:
	char                                                         pad0x18_UNJI3[0x18];                               // 0x98(0x18)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestArrayContainsStep: public TaleQuestStep
{
public:
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class TaleQuestMacroStep: public TaleQuestStep
{
public:
	char                                                         pad0x10_4O9HD[0x10];                               // 0x98(0x10)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestPermanentPromptStep: public TaleQuestStep
{
public:
};


// Size 0x80 (Full Size[0x118] - InheritedSize[0x98]
class WaitForHealthToReachFractionStep: public TaleQuestStep
{
public:
	char                                                         pad0x80_CIT9C[0x80];                               // 0x98(0x80)
};


// Size 0x60 (Full Size[0xf8] - InheritedSize[0x98]
class ForceCannonLoadStep: public TaleQuestStep
{
public:
	char                                                         pad0x60_VJY8F[0x60];                               // 0x98(0x60)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestGetCollectionItemCountStep: public TaleQuestStep
{
public:
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class NumPlayerStatsFromListPhaseBranchSelector: public TaleQuestPhaseBranchSelectorPredicateBase
{
public:
	TArray<struct PlayerStat>                                    UniqueStats;                                       // 0x28(0x10)
	char                                                         pad0x18_E7ZTU[0x18];                               // 0x38(0x18)
};


// Size 0x48 (Full Size[0xa8] - InheritedSize[0x60]
class TaleResourceBrokerService: public TaleQuestService
{
public:
	char                                                         pad0x20_7NY6O[0x20];                               // 0x60(0x20)
	TArray<struct MigrationActionPair>                           MigrationActions;                                  // 0x80(0x10)
	char                                                         pad0x18_QNLIP[0x18];                               // 0x90(0x18)
};


// Size 0x58 (Full Size[0xd8] - InheritedSize[0x80]
class TaleQuestStructStepDescBase: public TaleQuestStepDesc
{
public:
	class ScriptStruct*                                          Struct;                                            // 0x80(0x8)
	char                                                         pad0x50_1PUWP[0x50];                               // 0x88(0x50)
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class ReleaseGameEventBlockStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class VisualiseLoggerEQSResultsTaleStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestSelectorServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x28 (Full Size[0x88] - InheritedSize[0x60]
class GameEventExclusionZoneTaleService: public TaleQuestService
{
public:
	TArray<struct GameEventExclusionZone>                        EventExclusionZones;                               // 0x60(0x10)
	char                                                         pad0x18_KK819[0x18];                               // 0x70(0x18)
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class TaleQuestStarFieldPuzzleSetupAndWaitForCompletionStep: public TaleQuestStep
{
public:
	char                                                         pad0x18_DHFGZ[0x18];                               // 0x98(0x18)
};


// Size 0x48 (Full Size[0xe0] - InheritedSize[0x98]
class PlaySequencerAnimationOnCutsceneActorStep: public TaleQuestStep
{
public:
	class PlaySequencerAnimationOnCutsceneActorStepDesc*         StepDesc;                                          // 0x98(0x8)
	class SequencerCutSceneActor*                                SequencerCutSceneActor;                            // 0xa0(0x8)
	TArray<struct PossessableSequence>                           PossessableSequences;                              // 0xa8(0x10)
	char                                                         pad0x28_V14XQ[0x28];                               // 0xb8(0x28)
};


// Size 0x38 (Full Size[0xd0] - InheritedSize[0x98]
class PlaySequencerAnimationStep: public TaleQuestStep
{
public:
	class PlaySequencerAnimationStepDesc*                        StepDesc;                                          // 0x98(0x8)
	class SequencerCutSceneActor*                                SequencerCutSceneActor;                            // 0xa0(0x8)
	char                                                         pad0x28_EQG9O[0x28];                               // 0xa8(0x28)
};


// Size 0x38 (Full Size[0xb8] - InheritedSize[0x80]
class GetActorOfInterestStepDesc: public TaleQuestStepDesc
{
public:
	class UClass*                                                ActorOfInterestId;                                 // 0x80(0x8)
	struct QuestVariableActor                                    ActorOfInterest;                                   // 0x88(0x30)
};


// Size 0x10 (Full Size[0x70] - InheritedSize[0x60]
class TaleQuestPlayerItemsCleaupService: public TaleQuestService
{
public:
	class TaleQuestPlayerItemsCleaupServiceDesc*                 ServiceDesc;                                       // 0x60(0x8)
	char                                                         pad0x8_G9JNA[0x8];                                 // 0x68(0x8)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class TaleQuestPlayerItemsCleaupServiceDesc: public TaleQuestServiceDesc
{
public:
	TArray<class Class*>                                         ItemDescsToRemove;                                 // 0x28(0x10)
};


// Size 0x20 (Full Size[0x80] - InheritedSize[0x60]
class TaleQuestParticipantDeathService: public TaleQuestService
{
public:
	char                                                         pad0x20_Y0CK6[0x20];                               // 0x60(0x20)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddCircleMapStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestMerchantContractsServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestAddMerchantMapStep: public TaleQuestStep
{
public:
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class TaleQuestStarFieldPuzzleEndStep: public TaleQuestStep
{
public:
	char                                                         pad0x10_1DY2X[0x10];                               // 0x98(0x10)
};


// Size 0x58 (Full Size[0xf0] - InheritedSize[0x98]
class TaleQuestPersistentForEachCrewTaskStep: public TaleQuestStep
{
public:
	class TaleQuestPersistentForEachCrewTaskStepDesc*            StepDesc;                                          // 0x98(0x8)
	char                                                         pad0x50_AR7QJ[0x50];                               // 0xa0(0x50)
};


// Size 0x0 (Full Size[0x80] - InheritedSize[0x80]
class StartSuppressingCutsceneResponsesStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x10 (Full Size[0x70] - InheritedSize[0x60]
class TaleQuestMerchantContractsService: public TaleQuestService
{
public:
	TArray<class TaleQuestMerchantContract*>                     Contracts;                                         // 0x60(0x10)
};


// Size 0x198 (Full Size[0x230] - InheritedSize[0x98]
class TaleQuestSelectShipwreckLocationFromValidCandidatesStep: public TaleQuestStep
{
public:
	char                                                         pad0x78_H5XCK[0x78];                               // 0x98(0x78)
	class TaleQuestSelectorService*                              CachedSelectorService;                             // 0x110(0x8)
	char                                                         pad0x118_CB40B[0x118];                             // 0x118(0x118)
};


// Size 0x30 (Full Size[0xe8] - InheritedSize[0xb8]
class TaleQuestAddRiddleMapUsingVariableStepDesc: public TaleQuestAddRiddleMapBaseStepDesc
{
public:
	struct QuestVariableTextArray                                TextVariable;                                      // 0xb8(0x30)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class CallObjectFunctionStep: public TaleQuestStep
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TaleQuestEQSServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x10 (Full Size[0xa8] - InheritedSize[0x98]
class DoEQSQueryStep: public TaleQuestStep
{
public:
	class DoEQSQueryStepDesc*                                    Desc;                                              // 0x98(0x8)
	class TaleQuestEQSService*                                   CachedTaleEQSService;                              // 0xa0(0x8)
};


// Size 0x8 (Full Size[0xa0] - InheritedSize[0x98]
class LinkEQSContextWithVariableStep: public TaleQuestStep
{
public:
	class LinkEQSContextWithVariableStepDesc*                    Desc;                                              // 0x98(0x8)
};


// Size 0x0 (Full Size[0xa8] - InheritedSize[0xa8]
class TaleQuestForEachUnionStepDesc: public TaleQuestForEachStepDescBase
{
public:
};


// Size 0x40 (Full Size[0xe8] - InheritedSize[0xa8]
class TaleQuestForEachSequential: public TaleQuestForEachStepBase
{
public:
	class TaleQuestIndexedFrame*                                 Frame;                                             // 0xa8(0x8)
	char                                                         pad0x38_HHUAK[0x38];                               // 0xb0(0x38)
};


// Size 0x30 (Full Size[0x110] - InheritedSize[0xe0]
class TaleQuestArrayContainsStepDesc: public TaleQuestArrayItemStepBaseDesc
{
public:
	struct QuestVariableBool                                     Result;                                            // 0xe0(0x30)
};


// Size 0x8 (Full Size[0x90] - InheritedSize[0x88]
class WaitForQueryableStateValueBoolStepDesc: public WaitForQueryableStateValueStepDescBase
{
public:
	bool                                                         ExpectedValue;                                     // 0x88(0x1)
	char                                                         pad0x7_43KX0[0x7];                                 // 0x89(0x7)
};


// Size 0x0 (Full Size[0x148] - InheritedSize[0x148]
class WaitUntilAnyParticipantEntersAnyRadiusStep: public ParticipantRadiusArrayTrackerStepDesc
{
public:
};


// Size 0x0 (Full Size[0xe0] - InheritedSize[0xe0]
class TaleQuestAddToArrayStepDesc: public TaleQuestArrayItemStepBaseDesc
{
public:
};


// Size 0x38 (Full Size[0x148] - InheritedSize[0x110]
class SpawnPhasedActorAtLocationStepDesc: public SpawnPhasedActorWithTransformStepBaseDesc
{
public:
	struct QuestVariableTransform                                Location;                                          // 0x110(0x38)
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestArrayAppendStepDesc: public TaleQuestArrayOperationStepBaseDesc
{
public:
};


// Size 0x30 (Full Size[0xb8] - InheritedSize[0x88]
class TaleQuestCrewTaskStepDesc: public TaleQuestTaskStepDescBase
{
public:
	struct QuestVariableGuid                                     CrewId;                                            // 0x88(0x30)
};


// Size 0x38 (Full Size[0x148] - InheritedSize[0x110]
class FindNamedPointAsTransformStepDesc: public FindNamedPointStepDescBase
{
public:
	struct QuestVariableTransform                                OutputTransform;                                   // 0x110(0x38)
};


// Size 0x0 (Full Size[0xd8] - InheritedSize[0xd8]
class TaleQuestMakeStructStepDesc: public TaleQuestStructStepDescBase
{
public:
};


// Size 0x8 (Full Size[0x90] - InheritedSize[0x88]
class WaitForQueryableStateValueIntStepDesc: public WaitForQueryableStateValueStepDescBase
{
public:
	int                                                          ExpectedValue;                                     // 0x88(0x4)
	char                                                         ComparisonType;                                    // 0x8c(0x1)
	char                                                         pad0x3_H3D86[0x3];                                 // 0x8d(0x3)
};


// Size 0x0 (Full Size[0xa8] - InheritedSize[0xa8]
class TaleQuestForEachAnyStepDesc: public TaleQuestForEachStepDescBase
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestBreakStructStep: public TaleQuestStructStepBase
{
public:
};


// Size 0x0 (Full Size[0x88] - InheritedSize[0x88]
class TaleMigrationVolatileTaskStepDesc: public TaleQuestTaskStepDescBase
{
public:
};


// Size 0x0 (Full Size[0x50] - InheritedSize[0x50]
class PlayerHasStatsPhaseBranchSelector: public NumPlayerStatsFromListPhaseBranchSelector
{
public:
};


// Size 0x0 (Full Size[0xe0] - InheritedSize[0xe0]
class TaleQuestFireEventStepDesc: public TaleQuestEventStepDescBase
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestMakeStructStep: public TaleQuestStructStepBase
{
public:
};


// Size 0x0 (Full Size[0xa8] - InheritedSize[0xa8]
class TaleQuestForEachSequentialDesc: public TaleQuestForEachStepDescBase
{
public:
};


// Size 0x0 (Full Size[0xd8] - InheritedSize[0xd8]
class TaleQuestBreakStructStepDesc: public TaleQuestStructStepDescBase
{
public:
};


// Size 0x0 (Full Size[0x98] - InheritedSize[0x98]
class TaleQuestArrayUnionStepDesc: public TaleQuestArrayOperationStepBaseDesc
{
public:
};


// Size 0x98 (Full Size[0x180] - InheritedSize[0xe8]
class TaleQuestFunctionStepLibrary: public TaleQuestRunnableStepDesc
{
public:
	char                                                         pad0x8_G51WM[0x8];                                 // 0xe8(0x8)
	class Function*                                              Function;                                          // 0xf0(0x8)
	char                                                         FunctionStepFlags;                                 // 0x178(0x1)
	char                                                         pad0x7_35QJL[0x7];                                 // 0x179(0x7)
};


// Size 0x0 (Full Size[0x148] - InheritedSize[0x148]
class WaitUntilAnyParticipantEntersRadiusStep: public ParticipantRadiusTrackerStepDesc
{
public:
};


// Size 0x30 (Full Size[0x140] - InheritedSize[0x110]
class FindNamedPointStepDesc: public FindNamedPointStepDescBase
{
public:
	struct QuestVariableOrientedPoint                            OutputOrientedPoint;                               // 0x110(0x30)
};


// Size 0x0 (Full Size[0xa8] - InheritedSize[0xa8]
class TaleQuestForEachAnyStep: public TaleQuestForEachStepBase
{
public:
};


// Size 0x30 (Full Size[0x140] - InheritedSize[0x110]
class FindNamedPointAsVectorStepDesc: public FindNamedPointStepDescBase
{
public:
	struct QuestVariableVector                                   OutputVectorLocation;                              // 0x110(0x30)
};


// Size 0x0 (Full Size[0x148] - InheritedSize[0x148]
class WaitUntilAllParticipantsLeaveRadiusStep: public ParticipantRadiusTrackerStepDesc
{
public:
};


// Size 0x0 (Full Size[0x148] - InheritedSize[0x148]
class WaitUntilAllParticipantsEnterRadiusStep: public ParticipantRadiusTrackerStepDesc
{
public:
};


// Size 0x60 (Full Size[0x148] - InheritedSize[0xe8]
class TaleQuestCopyValueStepDesc: public TaleQuestRunnableStepDesc
{
public:
	struct QuestVariable                                         FromVar;                                           // 0xe8(0x30)
	struct QuestVariable                                         ToVar;                                             // 0x118(0x30)
};


// Size 0x0 (Full Size[0xa8] - InheritedSize[0xa8]
class TaleQuestForEachUnionStep: public TaleQuestForEachStepBase
{
public:
};


// Size 0x0 (Full Size[0x88] - InheritedSize[0x88]
class TaleQuestPersistentForEachCrewTaskStepDesc: public TaleQuestTaskStepDescBase
{
public:
};


// Size 0x0 (Full Size[0xe0] - InheritedSize[0xe0]
class TaleQuestAwaitEventStepDesc: public TaleQuestEventStepDescBase
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestPredicatedBranchPhasingFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestEmoteFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestNamedPointsFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestConversionFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestAnimationStepFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestShantyFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestActionStateMachineFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestQueryableStateWriteIntFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestFloatMathsFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestLogicFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestParticipantFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestShipInteractionHandlerFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestNameFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestDialogueFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestStoryFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestModifyPagesFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestStatusEffectsFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestQueryableStateAddToIntFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestValueFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestUObjectFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestVectorMathsFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestUtilityFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestDeathFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestSpawnShipFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestNotificationFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestAudioFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestOfferingNPCFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestQueryableStateReadBoolFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestCrewFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestTransfromConversionFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class NameRedirectionTaleQuestFunctionLibary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestCharacterFunctionStepLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestDamageableInterfaceFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class ActorOfInterestTaleFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestClassFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestCoreFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestCurveFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestNPCHideFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestAnimationMontageFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestQueryableStateReadIntFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x8 (Full Size[0x188] - InheritedSize[0x180]
class TaleQuestStatFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
	struct PlayerStat                                            Stat;                                              // 0x180(0x4)
	char                                                         pad0x4_2HOUX[0x4];                                 // 0x184(0x4)
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestHealthFunctionStepLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestItemFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestQueryableStateWriteBoolFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestTransformMathsFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestActorFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestWaterVolumeFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestRandomFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestIntMathsFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestCutscenesFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0 (Full Size[0x180] - InheritedSize[0x180]
class TaleQuestClientCommandFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x48 (Full Size[0x1c8] - InheritedSize[0x180]
class TaleQuestStoryBranchFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
	char                                                         pad0x8_VTNVA[0x8];                                 // 0x180(0x8)
	class TaleQuestStepDesc*                                     Active;                                            // 0x188(0x8)
	class TaleQuestStepDesc*                                     Inactive;                                          // 0x190(0x8)
	char                                                         pad0x30_47OTP[0x30];                               // 0x198(0x30)
};


