#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "TaleAI_Structs.h"


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class TaleQuestAIAsset: public DataAsset
{
public:
	class TaleQuestSpawnAICustomRootStepDesc*                    SpawnerRoot;                                       // 0x28(0x8)
	class TaleStruct*                                            SpawnerParameters;                                 // 0x30(0x8)
};


// Size 0xe8 (Full Size[0x168] - InheritedSize[0x80]
class TaleQuestSpawnAICustomRootStepDesc: public TaleQuestStepDesc
{
public:
	struct                                                       SetupTaskData;                                     // 0x88(0x18)
	struct                                                       OnTriggerWaveTaskData;                             // 0xa0(0x10)
	struct                                                       OnCompleteWaveTaskData;                            // 0xb0(0x8)
	struct                                                       PreSpawnTaskData;                                  // 0xb8(0x78)
	struct                                                       OnSpawnTaskData;                                   // 0x130(0x18)
	struct                                                       OnDespawnTaskData;                                 // 0x148(0x20)
};


// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class TaleQuestSpawnAICustomOnDespawnFrame: public Object
{
public:
	struct                                                       Data;                                              // 0x30(0x20)
};


// Size 0x48 (Full Size[0x70] - InheritedSize[0x28]
class TaleAIRegionBase: public Object
{
public:
	class AIProximityPlayerTracker*                              ProximityPlayerTracker;                            // 0x30(0x8)
};


// Size 0x50 (Full Size[0x78] - InheritedSize[0x28]
class TaleQuestSpawnAICustomTaskBase: public Object
{
public:
	class TaleQuestSpawnAICustomRootStep*                        MyRootStep;                                        // 0x30(0x8)
};


// Size 0xb0 (Full Size[0x148] - InheritedSize[0x98]
class TaleQuestSpawnAICustomStep: public TaleQuestStep
{
public:
	interface                                                    SpawnerInstance;                                   // 0x98(0x10)
	map                                                          OnSpawnedTasks;                                    // 0xa8(0x50)
	map                                                          OnDespawnTasks;                                    // 0xf8(0x50)
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class TaleQuestSpawnAICustomOnSpawnFrame: public Object
{
public:
	struct                                                       Data;                                              // 0x30(0x18)
};


// Size 0xf0 (Full Size[0x188] - InheritedSize[0x98]
class TaleQuestSpawnAICustomRootStep: public TaleQuestStep
{
public:
	struct                                                       Params;                                            // 0xa8(0x10)
	TArray<class TaleQuestSpawnAICustomTaskBase*>                ActiveTasks;                                       // 0xb8(0x10)
	class TaleAIRegionBase*                                      Region;                                            // 0xd8(0x8)
};


// Size 0x80 (Full Size[0x100] - InheritedSize[0x80]
class TaleQuestSpawnAICustomStepDesc: public TaleQuestStepDesc
{
public:
	class TaleQuestAIAsset*                                      AISpawner;                                         // 0x88(0x8)
	class TaleQuestStepDesc*                                     OnSpawn;                                           // 0x90(0x8)
	class TaleQuestStepDesc*                                     OnDespawn;                                         // 0x98(0x8)
	map                                                          ParameterMapping;                                  // 0xa0(0x50)
	struct                                                       ParamterInstance;                                  // 0xf0(0x10)
};


// Size 0x98 (Full Size[0x110] - InheritedSize[0x78]
class TaleQuestSpawnAICustomPreSpawnTask: public TaleQuestSpawnAICustomTaskBase
{
public:
	interface                                                    Body;                                              // 0x80(0x10)
	struct                                                       TaskData;                                          // 0x90(0x78)
};


// Size 0xa8 (Full Size[0x120] - InheritedSize[0x78]
class TaleQuestSpawnAICustomOnSpawnTask: public TaleQuestSpawnAICustomTaskBase
{
public:
	interface                                                    Body;                                              // 0x78(0x10)
	struct                                                       TaskData;                                          // 0x88(0x18)
};


// Size 0x28 (Full Size[0xa0] - InheritedSize[0x78]
class TaleQuestSpawnAICustomSetupTask: public TaleQuestSpawnAICustomTaskBase
{
public:
	struct                                                       TaskData;                                          // 0x78(0x18)
	interface                                                    Body;                                              // 0x90(0x10)
};


// Size 0x18 (Full Size[0x90] - InheritedSize[0x78]
class TaleQuestSpawnAICustomSpawnerOnCompleteWaveTask: public TaleQuestSpawnAICustomTaskBase
{
public:
	struct                                                       TaskData;                                          // 0x78(0x8)
	interface                                                    Body;                                              // 0x80(0x10)
};


// Size 0x20 (Full Size[0x98] - InheritedSize[0x78]
class TaleQuestSpawnAICustomSpawnerOnTriggerWaveTask: public TaleQuestSpawnAICustomTaskBase
{
public:
	struct                                                       TaskData;                                          // 0x78(0x10)
	interface                                                    Body;                                              // 0x88(0x10)
};


// Size 0x30 (Full Size[0xa8] - InheritedSize[0x78]
class TaleQuestSpawnAICustomOnDespawnTask: public TaleQuestSpawnAICustomTaskBase
{
public:
	interface                                                    Body;                                              // 0x78(0x10)
	struct                                                       TaskData;                                          // 0x88(0x20)
};


