#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x260 (Full Size[0xa50] - InheritedSize[0x7f0]
class TaleNote: public SkeletalMeshWieldableItem
{
public:
	int                                                          CanvasWidth;                                       // 0x7f8(0x4)
	int                                                          CanvasHeight;                                      // 0x7fc(0x4)
	float                                                        FontScale;                                         // 0x800(0x4)
	class Font*                                                  Font;                                              // 0x808(0x8)
	struct TreasureMapWidgetStreamedTexture                      Image;                                             // 0x810(0x38)
	struct TreasureMapWidgetText                                 TitleWidgetText;                                   // 0x848(0x3c)
	struct TreasureMapWidgetText                                 BodyWidgetText;                                    // 0x884(0x3c)
	TArray<struct TreasureMapWidgetText>                         AdditionalBodyWidgetText;                          // 0x8c0(0x10)
	float                                                        NoteWidth;                                         // 0x8d0(0x4)
	float                                                        NoteLineSpacingMultiplier;                         // 0x8d4(0x4)
	struct FText                                                 Title;                                             // 0x8d8(0x38)
	struct FText                                                 Body;                                              // 0x910(0x38)
	TArray<struct Text>                                          AdditionalBody;                                    // 0x948(0x10)
	class MaybeCompressedCanvasRenderTarget2D*                   RenderTarget;                                      // 0x958(0x8)
	class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x960(0x8)
	class InventoryItemComponent*                                InventoryItemComponent;                            // 0x968(0x8)
	class ZoomInOnWieldableItemComponent*                        ZoomInOnWieldableComponent;                        // 0x970(0x8)
};


