#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x18
struct SpawnAICustomOnSpawnTaskData
{
public:
	int                                                          Spawn_Index;                                       // 0x0(0x4)
	class Pawn*                                                  Spawn_Pawn;                                        // 0x8(0x8)
	class TaleQuestStepDesc*                                     Body;                                              // 0x10(0x8)
};


// Size 0x8
struct SpawnActorCustomOnCompleteWaveTaskData
{
public:
	class TaleQuestStepDesc*                                     Body;                                              // 0x0(0x8)
};


// Size 0x18
struct SpawnAICustomSetupTaskData
{
public:
	int                                                          MaxAI;                                             // 0x0(0x4)
	class TaleAIRegionBase*                                      Region;                                            // 0x8(0x8)
	class TaleQuestStepDesc*                                     Body;                                              // 0x10(0x8)
};


// Size 0x10
struct SpawnActorCustomOnTriggerWaveTaskData
{
public:
	int                                                          NumAIToSpawn;                                      // 0x0(0x4)
	class TaleQuestStepDesc*                                     Body;                                              // 0x8(0x8)
};


// Size 0x78
struct SpawnAICustomPreSpawnTaskData
{
public:
	int                                                          Index;                                             // 0x0(0x4)
	struct Vector                                                SpawnLocation;                                     // 0x4(0xc)
	struct Rotator                                               SpawnRotation;                                     // 0x10(0xc)
	bool                                                         PerceiveActor;                                     // 0x1c(0x1)
	assetclass                                                   PawnClass;                                         // 0x20(0x20)
	class AthenaAIControllerParamsDataAsset*                     Skillset;                                          // 0x40(0x8)
	class LoadoutAsset*                                          Loadout;                                           // 0x48(0x8)
	class AthenaAIFormDataAsset*                                 Form;                                              // 0x50(0x8)
	class AthenaAIAmmoDataAsset*                                 Ammo;                                              // 0x58(0x8)
	class UClass*                                                AIClass;                                           // 0x60(0x8)
	class AIPartsCategory*                                       PartsCategory;                                     // 0x68(0x8)
	class TaleQuestStepDesc*                                     Body;                                              // 0x70(0x8)
};


// Size 0x20
struct SpawnAICustomOnDespawnTaskData
{
public:
	int                                                          Despawn_Index;                                     // 0x0(0x4)
	class Pawn*                                                  Despawn_Pawn;                                      // 0x8(0x8)
	char                                                         Despawn_Reason;                                    // 0x10(0x1)
	class TaleQuestStepDesc*                                     Body;                                              // 0x18(0x8)
};


