#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x270 (Full Size[0xa60] - InheritedSize[0x7f0]
class TaleNote: public SkeletalMeshWieldableItem
{
public:
	char                                                         pad0x10_AOH96[0x10];                               // 0x7f0(0x10)
	int                                                          CanvasWidth;                                       // 0x800(0x4)
	int                                                          CanvasHeight;                                      // 0x804(0x4)
	float                                                        FontScale;                                         // 0x808(0x4)
	char                                                         pad0x4_CZ452[0x4];                                 // 0x80c(0x4)
	class Font*                                                  Font;                                              // 0x810(0x8)
	struct TreasureMapWidgetStreamedTexture                      Image;                                             // 0x818(0x38)
	struct TreasureMapWidgetText                                 TitleWidgetText;                                   // 0x850(0x3c)
	struct TreasureMapWidgetText                                 BodyWidgetText;                                    // 0x88c(0x3c)
	TArray<struct TreasureMapWidgetText>                         AdditionalBodyWidgetText;                          // 0x8c8(0x10)
	float                                                        NoteWidth;                                         // 0x8d8(0x4)
	float                                                        NoteLineSpacingMultiplier;                         // 0x8dc(0x4)
	struct FText                                                 Title;                                             // 0x8e0(0x38)
	struct FText                                                 Body;                                              // 0x918(0x38)
	TArray<struct Text>                                          AdditionalBody;                                    // 0x950(0x10)
	class MaybeCompressedCanvasRenderTarget2D*                   RenderTarget;                                      // 0x960(0x8)
	class UsableWieldableComponent*                              UsableWieldableComponent;                          // 0x968(0x8)
	class InventoryItemComponent*                                InventoryItemComponent;                            // 0x970(0x8)
	class ZoomInOnWieldableItemComponent*                        ZoomInOnWieldableComponent;                        // 0x978(0x8)
	char                                                         pad0xe0_41SBI[0xe0];                               // 0x980(0xe0)
};


