#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x30
struct QuestVariableCollection
{
public:
	char                                                         pad0x30_GSYDR[0x30];                               // 0x0(0x30)
};


// Size 0x38
struct TaleQuestQueryableStateReadValueIntCondition
{
public:
	char                                                         pad0x28_GPAT0[0x28];                               // 0x0(0x28)
	class UClass*                                                DataID;                                            // 0x28(0x8)
	int                                                          ExpectedValue;                                     // 0x30(0x4)
	char                                                         ComparisonToExpectedValue;                         // 0x34(0x1)
	char                                                         pad0x3_ZT7HS[0x3];                                 // 0x35(0x3)
};


// Size 0x30
struct QuestVariableActorAssetTypeArray
{
public:
	char                                                         pad0x30_2M23Q[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct TaleQuestPhaseClusterRootActor
{
public:
	char                                                         pad0x30_OIR6K[0x30];                               // 0x0(0x30)
};


// Size 0x40
struct CriticalActorWrapper
{
public:
	class Actor*                                                 CriticalActor;                                     // 0x0(0x8)
	char                                                         pad0x38_GOBYU[0x38];                               // 0x8(0x38)
};


// Size 0x28
struct BodyFramePair
{
public:
	char                                                         pad0x10_8GHJI[0x10];                               // 0x0(0x10)
	class TaleQuestIndexedFrame*                                 Frame;                                             // 0x10(0x8)
	char                                                         pad0x10_CZODV[0x10];                               // 0x18(0x10)
};


// Size 0x10
struct TaleQuestContextInvalidTelemetryEvent
{
public:
	struct FName                                                 StepType;                                          // 0x0(0x8)
	struct FName                                                 Tale;                                              // 0x8(0x8)
};


// Size 0x20
struct ParticpantToolGroup
{
public:
	char                                                         pad0x20_HX6G7[0x20];                               // 0x0(0x20)
};


// Size 0x10
struct TrackedActorData
{
public:
	class Actor*                                                 Actor;                                             // 0x0(0x8)
	char                                                         pad0x8_Y5KKJ[0x8];                                 // 0x8(0x8)
};


// Size 0x10
struct TaleQuestPredicateBranchedTaskDesc
{
public:
	int                                                          BranchIndex;                                       // 0x0(0x4)
	char                                                         pad0x4_APPE2[0x4];                                 // 0x4(0x4)
	class TaleQuestStepDesc*                                     BranchedTask;                                      // 0x8(0x8)
};


// Size 0x60
struct SnapshottedActorData
{
public:
	char                                                         pad0x10_5ETD9[0x10];                               // 0x0(0x10)
	struct Guid                                                  SnapshotID;                                        // 0x10(0x10)
	bool                                                         ActorWasCritical;                                  // 0x20(0x1)
	bool                                                         ActorWasTracked;                                   // 0x21(0x1)
	char                                                         pad0x6_45URQ[0x6];                                 // 0x22(0x6)
	struct FText                                                 FailureMessage;                                    // 0x28(0x38)
};


// Size 0x40
struct StepMerchantItemDesc
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Icon;                                              // 0x38(0x8)
};


// Size 0x18
struct TaleQuestCargoRunContractItem
{
public:
	class UClass*                                                ItemToCollect;                                     // 0x0(0x8)
	char                                                         pad0x10_6H2M6[0x10];                               // 0x8(0x10)
};


// Size 0x10
struct MigrationActionPair
{
public:
	struct TaleResourceHandle                                    AllocatedResourceHandle;                           // 0x0(0x8)
	class TaleMigrationAction*                                   MigrationAction;                                   // 0x8(0x8)
};


// Size 0x30
struct QuestVariableActorAssetType
{
public:
	char                                                         pad0x30_1L0IR[0x30];                               // 0x0(0x30)
};


// Size 0x3
struct TaleActorSpawnParameters
{
public:
	bool                                                         Tracked;                                           // 0x0(0x1)
	bool                                                         GatherForMigration;                                // 0x1(0x1)
	bool                                                         DeferredSpawning;                                  // 0x2(0x1)
};


// Size 0x40
struct StepBountyTargetDesc
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Portrait;                                          // 0x38(0x8)
};


// Size 0xc
struct PhaseBranchIndexPlayerAssignment
{
public:
	char                                                         pad0x8_HWDUV[0x8];                                 // 0x0(0x8)
	int                                                          AssignedPhaseBranchIndex;                          // 0x8(0x4)
};


// Size 0x30
struct QuestVariableItemInfo
{
public:
	char                                                         pad0x30_0SP1G[0x30];                               // 0x0(0x30)
};


// Size 0x40
struct TaleQuestQueryableStateReadAllValueBoolCondition
{
public:
	char                                                         pad0x28_V6YEE[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_RBZWH[0x7];                                 // 0x39(0x7)
};


// Size 0x40
struct NameRedirectionTypeInfo
{
public:
	char                                                         NameRedirectionType;                               // 0x0(0x1)
	char                                                         pad0x7_C5PXH[0x7];                                 // 0x1(0x7)
	struct FText                                                 RedirectedName;                                    // 0x8(0x38)
};


// Size 0x38
struct TaleQuestDeliveryRequest
{
public:
	int                                                          Id;                                                // 0x0(0x4)
	char                                                         pad0x4_295OZ[0x4];                                 // 0x4(0x4)
	struct MerchantContractItemDesc                              Item;                                              // 0x8(0x28)
	int                                                          NumToDeliver;                                      // 0x30(0x4)
	int                                                          NumToAllocate;                                     // 0x34(0x4)
};


// Size 0x28
struct SetNextMontageSectionCommand
{
public:
	char                                                         pad0x18_XSTR9[0x18];                               // 0x0(0x18)
	struct FName                                                 FromSectionName;                                   // 0x18(0x8)
	struct FName                                                 ToSectionName;                                     // 0x20(0x8)
};


// Size 0x40
struct TaleQuestQueryableStateReadAnyValueBoolCondition
{
public:
	char                                                         pad0x28_O79OY[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_EKQOC[0x7];                                 // 0x39(0x7)
};


// Size 0x30
struct QuestVariableAISpawner
{
public:
	char                                                         pad0x30_OQQ9U[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableItemDescTypeArray
{
public:
	char                                                         pad0x30_0NI5N[0x30];                               // 0x0(0x30)
};


// Size 0x10
struct TaleQuestToggledDefinition
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x0(0x8)
	class UClass*                                                Definition;                                        // 0x8(0x8)
};


// Size 0x30
struct QuestVariableBountyTargetArray
{
public:
	char                                                         pad0x30_PQJ1A[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct TaleQuestQueryableStateDataInfoId
{
public:
	struct Guid                                                  MyTaleId;                                          // 0x0(0x10)
	struct Guid                                                  MyScopeId;                                         // 0x10(0x10)
};


// Size 0x30
struct QuestVariableGuidArray
{
public:
	char                                                         pad0x30_5SF1G[0x30];                               // 0x0(0x30)
};


// Size 0x48
struct CompondNodePinDesc
{
public:
	struct FText                                                 DisplayName;                                       // 0x0(0x38)
	struct Guid                                                  PinId;                                             // 0x38(0x10)
};


// Size 0x30
struct QuestVariableSetEQSTaleContextValue
{
public:
	char                                                         pad0x30_40DN2[0x30];                               // 0x0(0x30)
};


// Size 0x8
struct ActorSpawnedAutomationEvent
{
public:
	char                                                         pad0x8_2YGZ1[0x8];                                 // 0x0(0x8)
};


// Size 0x4
struct TaleQuestSelectorServiceSeedSetTelemetryEvent
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
};


// Size 0x20
struct TriggerOnScreenParticlesRpc
{
public:
	char                                                         pad0x18_00P2G[0x18];                               // 0x0(0x18)
	class ParticleSystem*                                        Particles;                                         // 0x18(0x8)
};


// Size 0x20
struct StopMontageAnimationCommand
{
public:
	char                                                         pad0x18_XUOHY[0x18];                               // 0x0(0x18)
	float                                                        BlendOutTime;                                      // 0x18(0x4)
	char                                                         pad0x4_WIY40[0x4];                                 // 0x1c(0x4)
};


// Size 0x1
struct SplineFootprintPathTool
{
public:
	char                                                         pad0x1_8PM5B[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct QuestVariableObjectArray
{
public:
	char                                                         pad0x30_WV5WB[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableActorArray
{
public:
	char                                                         pad0x30_GC70S[0x30];                               // 0x0(0x30)
};


// Size 0x48
struct CriticalActorDelegateData
{
public:
	class Actor*                                                 CriticalActor;                                     // 0x0(0x8)
	struct FText                                                 FailureMessage;                                    // 0x8(0x38)
	char                                                         pad0x8_6O8L0[0x8];                                 // 0x40(0x8)
};


// Size 0x48
struct PredicatedBranchedTask
{
public:
	char                                                         pad0x48_VGAQH[0x48];                               // 0x0(0x48)
};


// Size 0x14
struct IslandTypeWeights
{
public:
	float                                                        FeatureIslandWeight;                               // 0x0(0x4)
	float                                                        ResourceIslandWeight;                              // 0x4(0x4)
	float                                                        OutpostIslandWeight;                               // 0x8(0x4)
	float                                                        SeapostIslandWeight;                               // 0xc(0x4)
	float                                                        FortIslandWeight;                                  // 0x10(0x4)
};


// Size 0x30
struct QuestVariableRotator
{
public:
	char                                                         pad0x30_MK2JQ[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableMerchantItemArray
{
public:
	char                                                         pad0x30_W0UHJ[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct PhasedActor
{
public:
	class Actor*                                                 MapActor;                                          // 0x0(0x8)
	class Actor*                                                 Actor;                                             // 0x8(0x8)
	char                                                         pad0x10_H4L5D[0x10];                               // 0x10(0x10)
};


// Size 0x18
struct SetDialogueInteractionEnabledClientCommand
{
public:
	char                                                         pad0x8_GGN8M[0x8];                                 // 0x0(0x8)
	class Object*                                                DialogueComponentObject;                           // 0x8(0x8)
	bool                                                         ShouldBeEnabled;                                   // 0x10(0x1)
	char                                                         pad0x7_KVYRC[0x7];                                 // 0x11(0x7)
};


// Size 0x80
struct TaleQuestDesc
{
public:
	char                                                         pad0x28_SVVZP[0x28];                               // 0x0(0x28)
	class TaleQuestStepDesc*                                     Root;                                              // 0x28(0x8)
	class Object*                                                Definition;                                        // 0x30(0x8)
	struct FText                                                 TaleFailMessage;                                   // 0x38(0x38)
	struct FName                                                 TaleFailBannerTag;                                 // 0x70(0x8)
	bool                                                         ShouldFireStartTallTaleTrackedObjective;           // 0x78(0x1)
	bool                                                         Development;                                       // 0x79(0x1)
	char                                                         pad0x6_AGSGM[0x6];                                 // 0x7a(0x6)
};


// Size 0x30
struct QuestVariableArray
{
public:
	char                                                         pad0x30_BKDZC[0x30];                               // 0x0(0x30)
};


// Size 0x40
struct TaleQuestQueryableStateCanAllDataBeReadCondition
{
public:
	char                                                         pad0x28_9EH5Z[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_RAV50[0x7];                                 // 0x39(0x7)
};


// Size 0x40
struct TaleQuestQueryableStateCanAnyDataBeReadCondition
{
public:
	char                                                         pad0x28_HL99S[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_PMJ3J[0x7];                                 // 0x39(0x7)
};


// Size 0x30
struct QuestVariablePrioritisedPrompt
{
public:
	char                                                         pad0x30_GX843[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableClassArray
{
public:
	char                                                         pad0x30_POLRX[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableAny
{
public:
	char                                                         pad0x30_B2IBM[0x30];                               // 0x0(0x30)
};


// Size 0x28
struct PhasedItem
{
public:
	class ItemProxy*                                             ItemProxy;                                         // 0x0(0x8)
	class ItemInfo*                                              ItemInfo;                                          // 0x8(0x8)
	bool                                                         Tracked;                                           // 0x10(0x1)
	char                                                         pad0x17_LYGGH[0x17];                               // 0x11(0x17)
};


// Size 0x18
struct PlaySequencerAutomationEvent
{
public:
	char                                                         pad0x18_6IFRA[0x18];                               // 0x0(0x18)
};


// Size 0x30
struct QuestVariableGameEvent
{
public:
	char                                                         pad0x30_G63AA[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct InteractionOptionSelectedWithQueryableStateNonUI
{
public:
	class UClass*                                                DataID;                                            // 0x0(0x8)
	struct Guid                                                  InstigatorCrewID;                                  // 0x8(0x10)
	class Actor*                                                 InteractingPlayer;                                 // 0x18(0x8)
};


// Size 0x1
struct TaleQuestStopPermanentPromptEvent
{
public:
	char                                                         pad0x1_X4MHO[0x1];                                 // 0x0(0x1)
};


// Size 0x20
struct TaleQuestFailedEvent
{
public:
	TArray<struct Guid>                                          CrewIds;                                           // 0x0(0x10)
	struct Guid                                                  QuestId;                                           // 0x10(0x10)
};


// Size 0x30
struct ToggleModalInteractionNetworkEvent
{
public:
	char                                                         pad0x18_BOLGR[0x18];                               // 0x0(0x18)
	struct NetActorPtr                                           TargetActor;                                       // 0x18(0x14)
	bool                                                         InteractionBlocked;                                // 0x2c(0x1)
	char                                                         pad0x3_F3K7B[0x3];                                 // 0x2d(0x3)
};


// Size 0x30
struct QuestVariablePageLayout
{
public:
	char                                                         pad0x30_9J42P[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableTexture
{
public:
	char                                                         pad0x30_N7ZMB[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct PlayMontageAnimationCommand
{
public:
	char                                                         pad0x18_GYHZD[0x18];                               // 0x0(0x18)
	float                                                        PlayRate;                                          // 0x18(0x4)
	float                                                        Position;                                          // 0x1c(0x4)
};


// Size 0x28
struct TaleQuestForEachCrewTask
{
public:
	char                                                         pad0x28_OUJAT[0x28];                               // 0x0(0x28)
};


// Size 0x40
struct TaleQuestDeliverableItem
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Icon;                                              // 0x38(0x8)
};


// Size 0x1
struct EventSpawnedTallTaleQuestItem
{
public:
	char                                                         pad0x1_Q9LIT[0x1];                                 // 0x0(0x1)
};


// Size 0x30
struct QuestVariableLinkEQSContext
{
public:
	char                                                         pad0x30_0GM08[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct JumpToMontageSectionCommand
{
public:
	char                                                         pad0x18_ZQRXO[0x18];                               // 0x0(0x18)
	struct FName                                                 SectionName;                                       // 0x18(0x8)
};


// Size 0x20
struct EndOnScreenParticlesRpc
{
public:
	char                                                         pad0x18_33OEN[0x18];                               // 0x0(0x18)
	class ParticleSystem*                                        Particles;                                         // 0x18(0x8)
};


// Size 0x18
struct DebugTalePhaseBranchAssignedForPlayerEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	char                                                         pad0x8_I3A56[0x8];                                 // 0x10(0x8)
};


// Size 0x1
struct EventModalInteractionStateChanged
{
public:
	bool                                                         IsInteractionBlocked;                              // 0x0(0x1)
};


// Size 0x30
struct QuestVariableMerchantItem
{
public:
	char                                                         pad0x30_RQTBS[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableTaleResourceHandle
{
public:
	char                                                         pad0x30_G6T82[0x30];                               // 0x0(0x30)
};


// Size 0x48
struct SetDialogueInteractionPromptClientCommand
{
public:
	char                                                         pad0x8_WYL1G[0x8];                                 // 0x0(0x8)
	class NPCDialogComponent*                                    DialogueComponent;                                 // 0x8(0x8)
	struct FText                                                 Prompt;                                            // 0x10(0x38)
};


// Size 0x18
struct MontageAnimationCommandBase
{
public:
	char                                                         pad0x8_N1100[0x8];                                 // 0x0(0x8)
	class Actor*                                                 MyTarget;                                          // 0x8(0x8)
	class AnimMontage*                                           MyMontage;                                         // 0x10(0x8)
};


// Size 0x30
struct QuestVariableItemDescType
{
public:
	char                                                         pad0x30_POFPA[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct TaleQuestQueryableStateDataInfo
{
public:
	struct TaleQuestQueryableStateDataInfoId                     InfoId;                                            // 0x0(0x20)
	class UClass*                                                DataID;                                            // 0x20(0x8)
	bool                                                         DataBool;                                          // 0x28(0x1)
	char                                                         pad0x3_A66NK[0x3];                                 // 0x29(0x3)
	int                                                          DataInt;                                           // 0x2c(0x4)
};


// Size 0x48
struct NameRedirectionData
{
public:
	struct FText                                                 OriginalName;                                      // 0x0(0x38)
	TArray<struct NameRedirectionTypeInfo>                       RedirectedNames;                                   // 0x38(0x10)
};


// Size 0x28
struct DebugOnTalePhaseBranchAssignedForPlayerNetworkEvent
{
public:
	char                                                         pad0x18_3B1AN[0x18];                               // 0x0(0x18)
	struct PhaseBranchIndexPlayerAssignment                      Assignment;                                        // 0x18(0xc)
	char                                                         pad0x4_QE4H8[0x4];                                 // 0x24(0x4)
};


// Size 0x30
struct QueryableStateChangedEvent
{
public:
	struct TaleQuestQueryableStateDataInfo                       DataValue;                                         // 0x0(0x30)
};


