// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x70
class TaleQuestStep: public Object
{
public:
	Class TaleQuestStepDesc*                                     TaleStepDesc;                                      // 0x88(0x8)
};


// Size 0x38
class TaleQuestService: public Object
{
public:
};


// Size 0x0
class TaleQuestServiceDesc: public Object
{
public:
};


// Size 0x58
class TaleQuestStepDesc: public Object
{
public:
	bool                                                         Fork;                                              // 0x28(0x1)
};


// Size 0x0
class TaleMigrationAction: public Object
{
public:
};


// Size 0x40
class TaleQuestFramedStep: public TaleQuestStep
{
public:
	TArray<class TaleQuestService*>                              Services;                                          // 0xa0(0x10)
	Class TaleQuestFramedStepDesc*                               FrameDesc;                                         // 0xb0(0x8)
	Class ScriptStruct*                                          StructForCollector;                                // 0xc8(0x8)
	Class ScriptStruct*                                          LocalStructForCollector;                           // 0xd0(0x8)
};


// Size 0x20
class TaleQuestFramedStepDesc: public TaleQuestStepDesc
{
public:
	TArray<class TaleQuestServiceDesc*>                          Services;                                          // 0x80(0x10)
	Class ScriptStruct*                                          Variables;                                         // 0x90(0x8)
	Struct InlineUserDefinedStructDetails                        GeneratedVariables;                                // 0x98(0x8)
};


// Size 0x40
class ContendedResourceComponent: public ActorComponent
{
public:
};


// Size 0x0
class EnvQueryContext_TaleContextBase: public EnvQueryContext
{
public:
};


// Size 0x10
class IslandTypeWeightsDataAsset: public DataAsset
{
public:
	TArray<Struct IslandTypeWeights>                             IslandTypeWeightsForDifficultyRanks;               // 0x28(0x10)
};


// Size 0x0
class TaleQuestExpressionInterface: public Interface
{
public:
};


// Size 0x0
class TaleQuestStepInterface: public Interface
{
public:
};


// Size 0x20
class SplineFootprintPathComponent: public SplineComponent
{
public:
	float                                                        DistanceBetweenDecals;                             // 0x638(0x4)
	Class MaterialInterface*                                     DecalMaterial;                                     // 0x640(0x8)
	Struct SplineFootprintPathTool                               PathTool;                                          // 0x648(0x1)
	float                                                        DecalYaw;                                          // 0x64c(0x4)
	Struct Vector                                                DecalUniformScale;                                 // 0x650(0xc)
};


// Size 0x0
class StartTallTaleConditionalStatTrigger: public ConditionalStatsTriggerType
{
public:
};


// Size 0x0
class TaleQuestArrayEntrySelectionStrategy: public Object
{
public:
};


// Size 0x8
class FixedArrayEntrySelectionStrategy: public TaleQuestArrayEntrySelectionStrategy
{
public:
	int                                                          IndexToSelect;                                     // 0x28(0x4)
};


// Size 0x0
class RandomArrayEntrySelectionStrategy: public TaleQuestArrayEntrySelectionStrategy
{
public:
};


// Size 0x8
class SequentialArrayEntrySelectionStrategy: public TaleQuestArrayEntrySelectionStrategy
{
public:
};


// Size 0x88
class TaleQuestCargoRunContract: public Object
{
public:
	TArray<Struct TaleQuestCargoRunContractItem>                 ItemsToCollect;                                    // 0x68(0x10)
	Class Actor*                                                 DeliverToNPC;                                      // 0x88(0x8)
	Class Actor*                                                 CollectFromNPC;                                    // 0x90(0x8)
};


// Size 0x48
class TaleQuestCargoRunContractsService: public TaleQuestService
{
public:
	TArray<class TaleQuestCargoRunContract*>                     Contracts;                                         // 0x60(0x10)
};


// Size 0x0
class TaleQuestCompoundStepInterface: public Interface
{
public:
};


// Size 0x60
class TaleQuestIndexedFrame: public Object
{
public:
	Class TaleQuestForEachStepDescBase*                          Desc;                                              // 0x30(0x8)
	int                                                          Index;                                             // 0x38(0x4)
};


// Size 0x60
class TaleQuestMerchantContract: public Object
{
public:
};


// Size 0x10
class TaleQuestMerchantContractsService: public TaleQuestService
{
public:
	TArray<class TaleQuestMerchantContract*>                     Contracts;                                         // 0x60(0x10)
};


// Size 0x0
class TaleQuestQueryableStateDataID: public Object
{
public:
};


// Size 0x18
class TaleQuestQueryableStateCanAllDataBeReadNPCDialogConditional: public NPCDialogConditional
{
public:
	TArray<Class AllDataToCheck>                                 AllDataToCheck;                                    // 0x30(0x10)
	bool                                                         ExpectedValue;                                     // 0x40(0x1)
};


// Size 0x18
class TaleQuestQueryableStateCanAnyDataBeReadNPCDialogConditional: public NPCDialogConditional
{
public:
	TArray<Class AllDataToCheck>                                 AllDataToCheck;                                    // 0x30(0x10)
	bool                                                         ExpectedValue;                                     // 0x40(0x1)
};


// Size 0x18
class TaleQuestQueryableStateReadAllValueBoolNPCDialogConditional: public NPCDialogConditional
{
public:
	TArray<Class AllDataToCheck>                                 AllDataToCheck;                                    // 0x30(0x10)
	bool                                                         ExpectedValue;                                     // 0x40(0x1)
};


// Size 0x18
class TaleQuestQueryableStateReadAnyValueBoolNPCDialogConditional: public NPCDialogConditional
{
public:
	TArray<Class AllDataToCheck>                                 AllDataToCheck;                                    // 0x30(0x10)
	bool                                                         ExpectedValue;                                     // 0x40(0x1)
};


// Size 0x10
class TaleQuestQueryableStateReadValueIntNPCDialogConditional: public NPCDialogConditional
{
public:
	class                                                        DataID;                                            // 0x30(0x8)
	int                                                          ExpectedValue;                                     // 0x38(0x4)
};


// Size 0x0
class TaleQuestQueryableStatesReadInterface: public Interface
{
public:
};


// Size 0x0
class TaleQuestQueryableStatesWriteInterface: public Interface
{
public:
};


// Size 0x20
class TaleQuestQueryableStatesAccessComponent: public ActorComponent
{
public:
	TArray<Struct TaleQuestQueryableStateDataInfo>               TalesData;                                         // 0xd8(0x10)
};


// Size 0x88
class TaleQuestImportFrame: public TaleQuestRootFrame
{
public:
};


// Size 0x0
class TaleQuestSelectorServiceBlueprintFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x30
class CutsceneResponsesTaleService: public TaleQuestService
{
public:
	TArray<class CutsceneResponseCoordinator*>                   TrackedResponseCoordinators;                       // 0x60(0x10)
	TArray<class CutsceneResponseComponent*>                     TrackedResponseComponents;                         // 0x70(0x10)
	TArray<class Actor*>                                         ResponseRelevantActors;                            // 0x80(0x10)
};


// Size 0x38
class GameEventBlockingTaleService: public TaleQuestService
{
public:
};


// Size 0x28
class GameEventExclusionZoneTaleService: public TaleQuestService
{
public:
};


// Size 0x30
class RewardGenTaleQuestService: public TaleQuestService
{
public:
	Class TaleQuestWeightedItemDescSpawnDataAsset*               GlobalSpawnData;                                   // 0x60(0x8)
	TArray<Int ValidSpawnData>                                   ValidSpawnData;                                    // 0x68(0x10)
	TArray<class ItemSpawnData*>                                 ItemsToSpawn;                                      // 0x78(0x10)
};


// Size 0x88
class TaleQuestActorOfInterestService: public TaleQuestService
{
public:
	Class TaleQuestActorOfInterestServiceDesc*                   Desc;                                              // 0xb0(0x8)
};


// Size 0x310
class TaleQuestActorService: public TaleQuestService
{
public:
	TArray<Struct TrackedActorData>                              TrackedActors;                                     // 0x60(0x10)
	TArray<Struct CriticalActorDelegateData>                     CriticalActors;                                    // 0x70(0x10)
	TArray<Struct SnapshottedActorData>                          SnapshottedActors;                                 // 0x80(0x10)
	Class TaleQuestActorServiceDesc*                             Desc;                                              // 0x90(0x8)
	Class PhasedClusterRoot*                                     PhasedClusterRoot;                                 // 0x98(0x8)
	TArray<Struct PhasedActor>                                   PhasedActors;                                      // 0xa0(0x10)
	TArray<Struct PhasedItem>                                    PhasedItems;                                       // 0xb0(0x10)
	Struct FText                                                 CriticalActorHandedInByAnotherCrewFailureMessage;  // 0xc0(0x38)
};


// Size 0x48
class TaleQuestCheckpointService: public TaleQuestService
{
public:
	Class TaleQuestCheckpointServiceDesc*                        Desc;                                              // 0x60(0x8)
};


// Size 0xd8
class TaleQuestEQSService: public TaleQuestService
{
public:
};


// Size 0x18
class TaleQuestInteractionPreventionService: public TaleQuestService
{
public:
	TArray<class Actor*>                                         TrackedInteractionActors;                          // 0x60(0x10)
	Class TaleQuestInteractionPreventionServiceDesc*             Desc;                                              // 0x70(0x8)
};


// Size 0x8
class TaleQuestLockGhostShipDoorService: public TaleQuestService
{
public:
	Class TaleQuestLockGhostShipDoorServiceDesc*                 Desc;                                              // 0x60(0x8)
};


// Size 0x30
class TaleQuestQueryableStatesService: public TaleQuestService
{
public:
	TArray<Struct TaleQuestQueryableStateDataInfo>               AllData;                                           // 0x60(0x10)
};


// Size 0x28
class TaleQuestSelectorService: public TaleQuestService
{
public:
	Class TaleQuestSelectorServiceDesc*                          Desc;                                              // 0x60(0x8)
};


// Size 0x50
class TaleQuestShipSetSinkingParamsService: public TaleQuestService
{
public:
	Class TaleQuestShipSetSinkingParamsServiceDesc*              Desc;                                              // 0x60(0x8)
};


// Size 0x58
class TaleQuestToggleInteractionDescriptionService: public TaleQuestService
{
public:
	Class TaleQuestToggleInteractionDescriptionServiceDesc*      Desc;                                              // 0xb0(0x8)
};


// Size 0x48
class TaleResourceBrokerService: public TaleQuestService
{
public:
	TArray<Struct MigrationActionPair>                           MigrationActions;                                  // 0x80(0x10)
};


// Size 0x0
class CutsceneResponsesTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0
class GameEventBlockingTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0
class GameEventExclusionZoneTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x8
class RewardGenTaleQuestServiceDesc: public TaleQuestServiceDesc
{
public:
	Class TaleQuestWeightedItemDescSpawnDataAsset*               SpawnData;                                         // 0x28(0x8)
};


// Size 0x48
class TaleQuestActorOfInterestServiceDesc: public TaleQuestServiceDesc
{
public:
	TArray<Class AllNeededActorsOfInterest>                      AllNeededActorsOfInterest;                         // 0x28(0x10)
	Struct FText                                                 ActorOfInterestUnregisteredFailureMessage;         // 0x38(0x38)
};


// Size 0x8
class TaleQuestActorServiceDesc: public TaleQuestServiceDesc
{
public:
	class                                                        ItemLostFailureRunnable;                           // 0x28(0x8)
};


// Size 0x0
class TaleQuestCargoRunContractsServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0
class TaleQuestEQSServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0
class TaleQuestInteractionPreventionServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0
class TaleQuestLockGhostShipDoorServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0
class TaleQuestMerchantContractsServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0
class TaleQuestQueryableStatesServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x0
class TaleQuestSelectorServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x48
class TaleQuestShipSetSinkingParamsServiceDesc: public TaleQuestServiceDesc
{
public:
	Struct QuestVariableGuid                                     CrewId;                                            // 0x28(0x30)
	Class ShipSinkingParametersDataAsset*                        SmallShipSinkingData;                              // 0x58(0x8)
	Class ShipSinkingParametersDataAsset*                        MediumShipSinkingData;                             // 0x60(0x8)
	Class ShipSinkingParametersDataAsset*                        LargeShipSinkingData;                              // 0x68(0x8)
};


// Size 0x8
class TaleQuestToggleInteractionDescriptionServiceDesc: public TaleQuestServiceDesc
{
public:
	bool                                                         ResetDisabledInteractsOnEnd;                       // 0x28(0x1)
	bool                                                         ResetEnabledInteractsOnEnd;                        // 0x29(0x1)
};


// Size 0x38
class ActorRadiusTrackerStep: public TaleQuestStep
{
public:
	Class ActorRadiusTrackerStepDesc*                            Desc;                                              // 0x98(0x8)
	Class Actor*                                                 TargetActor;                                       // 0xa0(0x8)
};


// Size 0x0
class AddGameEventExclusionZoneStep: public TaleQuestStep
{
public:
};


// Size 0x0
class CallObjectFunctionStep: public TaleQuestStep
{
public:
};


// Size 0x40
class DebugTaleAddInstancedLevelStep: public TaleQuestStep
{
public:
	Class DebugTaleAddInstancedLevelStepDesc*                    StepDesc;                                          // 0xa0(0x8)
	Struct FString                                               InstancedLevelPath;                                // 0xa8(0x10)
};


// Size 0x40
class DebugTaleAddInstancedLevelStepDesc: public TaleQuestStepDesc
{
public:
	Struct FText                                                 InstancedLevelKeyword;                             // 0x80(0x38)
};


// Size 0x0
class DestroySpawnedActorStep: public TaleQuestStep
{
public:
};


// Size 0x10
class DoEQSQueryStep: public TaleQuestStep
{
public:
	Class DoEQSQueryStepDesc*                                    Desc;                                              // 0x98(0x8)
	Class TaleQuestEQSService*                                   CachedTaleEQSService;                              // 0xa0(0x8)
};


// Size 0x0
class EnableInteractionWithActorStep: public TaleQuestStep
{
public:
};


// Size 0x0
class FindItemInCollectorsChestStep: public TaleQuestStep
{
public:
};


// Size 0x0
class FindNamedPointStep: public TaleQuestStep
{
public:
};


// Size 0x0
class FindNamedPointAsVectorStep: public TaleQuestStep
{
public:
};


// Size 0x0
class FindNamedPointAsTransformStep: public TaleQuestStep
{
public:
};


// Size 0x60
class ForceCannonLoadStep: public TaleQuestStep
{
public:
};


// Size 0xb0
class GenerateDigLocationInRadiusStep: public TaleQuestStep
{
public:
};


// Size 0x0
class GetActorOfInterestStep: public TaleQuestStep
{
public:
};


// Size 0x38
class GetVoyageDifficultyFromRankStep: public TaleQuestStep
{
public:
};


// Size 0x0
class InvokeDamageStep: public TaleQuestStep
{
public:
};


// Size 0x8
class LinkEQSContextWithVariableStep: public TaleQuestStep
{
public:
	Class LinkEQSContextWithVariableStepDesc*                    Desc;                                              // 0x98(0x8)
};


// Size 0x18
class LoadSequencerAnimationStep: public TaleQuestStep
{
public:
	Class LoadSequencerAnimationStepDesc*                        StepDesc;                                          // 0x98(0x8)
	Class SequencerCutSceneActor*                                SequencerCutSceneActor;                            // 0xa0(0x8)
	Class Actor*                                                 TargetToSpawnActor;                                // 0xa8(0x8)
};


// Size 0x0
class OverrideManagedActorStateStep: public TaleQuestStep
{
public:
};


// Size 0x20
class ParticipantRadiusTrackerStep: public TaleQuestStep
{
public:
	Class ParticipantRadiusTrackerStepDesc*                      Desc;                                              // 0x98(0x8)
};


// Size 0x30
class PlaySequencerAnimationOnCutsceneActorStep: public TaleQuestStep
{
public:
	Class PlaySequencerAnimationOnCutsceneActorStepDesc*         StepDesc;                                          // 0x98(0x8)
	Class SequencerCutSceneActor*                                SequencerCutSceneActor;                            // 0xa0(0x8)
	TArray<Struct PossessableSequence>                           PossessableSequences;                              // 0xa8(0x10)
};


// Size 0x38
class PlaySequencerAnimationStep: public TaleQuestStep
{
public:
	Class PlaySequencerAnimationStepDesc*                        StepDesc;                                          // 0x98(0x8)
	Class SequencerCutSceneActor*                                SequencerCutSceneActor;                            // 0xa0(0x8)
};


// Size 0x0
class PreventInteractionWithActorStep: public TaleQuestStep
{
public:
};


// Size 0x0
class ProvokeHitReactionStep: public TaleQuestStep
{
public:
};


// Size 0x0
class ReleaseGameEventBlockStep: public TaleQuestStep
{
public:
};


// Size 0x0
class RemoveGameEventExclusionZoneStep: public TaleQuestStep
{
public:
};


// Size 0x0
class RequestGameEventBlockStep: public TaleQuestStep
{
public:
};


// Size 0x0
class SelectNamedPointStep: public TaleQuestStep
{
public:
};


// Size 0x8
class SetEQSNamedContextStep: public TaleQuestStep
{
public:
	Class SetEQSNamedContextStepDesc*                            Desc;                                              // 0x98(0x8)
};


// Size 0x18
class SpawnLayerStep: public TaleQuestStep
{
public:
};


// Size 0x68
class SpawnPhasedActorWithTransformStep: public TaleQuestStep
{
public:
};


// Size 0x0
class SpawnPhasedItemStep: public TaleQuestStep
{
public:
};


// Size 0x0
class StartSuppressingCutsceneResponsesStep: public TaleQuestStep
{
public:
};


// Size 0x0
class StopSuppressingCutsceneResponsesStep: public TaleQuestStep
{
public:
};


// Size 0x10
class TaleMigrationVolatileTaskStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestAddToArrayStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestArrayAppendStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestArrayContainsStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestArrayUnionStep: public TaleQuestStep
{
public:
};


// Size 0x48
class TaleQuestAwaitCrewShipSinkStep: public TaleQuestStep
{
public:
};


// Size 0x48
class TaleQuestAwaitEventStep: public TaleQuestStep
{
public:
};


// Size 0x98
class TaleQuestChooseIslandFromWeightsStep: public TaleQuestStep
{
public:
	Class IslandTypeWeightsDataAsset*                            IslandTypeWeights;                                 // 0x128(0x8)
};


// Size 0x0
class TaleQuestClearTaleProposalsStep: public TaleQuestStep
{
public:
};


// Size 0x38
class TaleQuestCrewTaskStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestDisableInteractionStep: public TaleQuestStep
{
public:
};


// Size 0x8
class TaleQuestEmissaryCompanyActionRewardBoostStep: public TaleQuestStep
{
public:
	Class TaleQuestEmissaryCompanyActionRewardBoostStepDesc*     Desc;                                              // 0x98(0x8)
};


// Size 0x0
class TaleQuestEnableInteractionStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestFireEventStep: public TaleQuestStep
{
public:
};


// Size 0x10
class TaleQuestForEachStepBase: public TaleQuestStep
{
public:
	TArray<Struct BodyFramePair>                                 Bodies;                                            // 0x98(0x10)
};


// Size 0x0
class TaleQuestForEachAnyStep: public TaleQuestForEachStepBase
{
public:
};


// Size 0x40
class TaleQuestForEachSequential: public TaleQuestForEachStepBase
{
public:
	Class TaleQuestIndexedFrame*                                 Frame;                                             // 0xa8(0x8)
};


// Size 0x0
class TaleQuestForEachUnionStep: public TaleQuestForEachStepBase
{
public:
};


// Size 0x0
class TaleQuestGetCollectionItemCountStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestGetParticipatingCrewsInRadiusStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestGetParticipatingCrewsStep: public TaleQuestStep
{
public:
};


// Size 0x40
class TaleQuestGrantRewardStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestPermanentPromptStep: public TaleQuestStep
{
public:
};


// Size 0x58
class TaleQuestPersistentForEachCrewTaskStep: public TaleQuestStep
{
public:
	Class TaleQuestPersistentForEachCrewTaskStepDesc*            StepDesc;                                          // 0x98(0x8)
};


// Size 0x60
class TaleQuestSelectEntryFromArrayStep: public TaleQuestStep
{
public:
	Struct QuestVariableArray                                    InputArray;                                        // 0x98(0x30)
	Struct QuestVariable                                         OutputEntry;                                       // 0xc8(0x30)
};


// Size 0x0
class TaleQuestShipDiveStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestShipSurfaceStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestStarFieldPuzzleDimStep: public TaleQuestStep
{
public:
};


// Size 0x10
class TaleQuestStarFieldPuzzleEndStep: public TaleQuestStep
{
public:
};


// Size 0x18
class TaleQuestStarFieldPuzzleSetupAndWaitForCompletionStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestStartCameraFadeStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestStructStepBase: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestBreakStructStep: public TaleQuestStructStepBase
{
public:
};


// Size 0x0
class TaleQuestMakeStructStep: public TaleQuestStructStepBase
{
public:
};


// Size 0x0
class TaleQuestToggleAmbientMigrationForServerStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestUpdateCheckpointStep: public TaleQuestStep
{
public:
};


// Size 0x10
class TaleQuestWaitForHandInStep: public TaleQuestStep
{
public:
	Class TaleQuestWaitForHandInStepDesc*                        Desc;                                              // 0x98(0x8)
};


// Size 0x8
class TrackResponseCoordinatorStep: public TaleQuestStep
{
public:
	Class TrackResponseCoordinatorStepDesc*                      StepDesc;                                          // 0x98(0x8)
};


// Size 0x0
class VisualiseLoggerEQSResultsTaleStep: public TaleQuestStep
{
public:
};


// Size 0x78
class WaitForActorOfInterestToUnregisterStep: public TaleQuestStep
{
public:
	Class WaitForActorOfInterestToUnregisterStepDesc*            Desc;                                              // 0x98(0x8)
};


// Size 0x10
class WaitForGameEventToCompleteStep: public TaleQuestStep
{
public:
	Class GameEvent*                                             GameEvent;                                         // 0x98(0x8)
};


// Size 0x70
class WaitForHealthToReachFractionStep: public TaleQuestStep
{
public:
};


// Size 0xd0
class WaitForItemPickupStep: public TaleQuestStep
{
public:
};


// Size 0x18
class WaitForSpawnedPawnBaseStep: public TaleQuestStep
{
public:
	Class AISpawner*                                             AISpawner;                                         // 0x98(0x8)
};


// Size 0xa0
class ActorRadiusTrackerStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
	float                                                        DurationBetweenChecks;                             // 0xb0(0x4)
	Struct QuestVariableVector                                   Location;                                          // 0xb8(0x30)
	float                                                        Radius;                                            // 0xe8(0x4)
	Struct QuestVariableBool                                     ActorInsideRadius;                                 // 0xf0(0x30)
};


// Size 0x40
class AddGameEventExclusionZoneStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        Radius;                                            // 0x80(0x4)
	bool                                                         ShouldGetRadiusFromRemoteConfig;                   // 0x84(0x1)
	struct FName                                                 RemoteConfigKeyRadius;                             // 0x88(0x8)
	Struct QuestVariableVector                                   Location;                                          // 0x90(0x30)
};


// Size 0x68
class CallObjectFunctionStepDesc: public TaleQuestStepDesc
{
public:
	Class Object*                                                Target;                                            // 0x80(0x8)
	Struct ClassFunctionSelectionType                            Function;                                          // 0x88(0x10)
};


// Size 0x30
class DestroySpawnedActorStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    ActorVar;                                          // 0x80(0x30)
};


// Size 0x38
class DoEQSQueryStepDesc: public TaleQuestStepDesc
{
public:
	Class EnvQuery*                                              EQSQuery;                                          // 0x80(0x8)
	Struct QuestVariableArray                                    OutPoints;                                         // 0x88(0x30)
};


// Size 0x30
class EnableInteractionWithActorStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
};


// Size 0x68
class FindItemInCollectorsChestStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    CollectorsChest;                                   // 0x80(0x30)
	Struct QuestVariableActor                                    ItemInChest;                                       // 0xb0(0x30)
	class                                                        ItemToFind;                                        // 0xe0(0x8)
};


// Size 0x90
class FindNamedPointStepDescBase: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    ActorToSearch;                                     // 0xa0(0x30)
	Struct QuestVariableName                                     GroupNamePin;                                      // 0xd0(0x30)
	struct FName                                                 PointGroupName;                                    // 0x100(0x8)
	byte                                                         SearchMethod;                                      // 0x108(0x1)
	byte                                                         ReturnInSpace;                                     // 0x109(0x1)
};


// Size 0x30
class FindNamedPointStepDesc: public FindNamedPointStepDescBase
{
public:
	Struct QuestVariableOrientedPoint                            OutputOrientedPoint;                               // 0x110(0x30)
};


// Size 0x30
class FindNamedPointAsVectorStepDesc: public FindNamedPointStepDescBase
{
public:
	Struct QuestVariableVector                                   OutputVectorLocation;                              // 0x110(0x30)
};


// Size 0x38
class FindNamedPointAsTransformStepDesc: public FindNamedPointStepDescBase
{
public:
	Struct QuestVariableTransform                                OutputTransform;                                   // 0x110(0x38)
};


// Size 0x60
class ForceCannonLoadStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    Cannon;                                            // 0x80(0x30)
	Struct QuestVariableActor                                    Projectile;                                        // 0xb0(0x30)
};


// Size 0x98
class GenerateDigLocationInRadiusStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableName                                     IslandName;                                        // 0x80(0x30)
	Struct QuestVariableVector                                   Center;                                            // 0xb0(0x30)
	float                                                        RadiusInCm;                                        // 0xe0(0x4)
	Struct QuestVariableVector                                   DigLocation;                                       // 0xe8(0x30)
};


// Size 0x38
class GetActorOfInterestStepDesc: public TaleQuestStepDesc
{
public:
	class                                                        ActorOfInterestId;                                 // 0x80(0x8)
	Struct QuestVariableActor                                    ActorOfInterest;                                   // 0x88(0x30)
};


// Size 0x40
class InvokeDamageDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    ActorToDamage;                                     // 0x80(0x30)
	class                                                        DamageType;                                        // 0xb0(0x8)
	float                                                        DamageAmount;                                      // 0xb8(0x4)
	byte                                                         DamageReason;                                      // 0xbc(0x1)
};


// Size 0x38
class LinkEQSContextWithVariableStepDesc: public TaleQuestStepDesc
{
public:
	class                                                        Context;                                           // 0x80(0x8)
	Struct QuestVariableSetEQSTaleContextValue                   Variable;                                          // 0x88(0x30)
};


// Size 0xb0
class LoadSequencerAnimationStepDesc: public TaleQuestStepDesc
{
public:
	TArray<class LevelSequence*>                                 LevelSequencesToLoad;                              // 0x80(0x10)
	Struct QuestVariableActor                                    TargetActorToSpawn;                                // 0x90(0x30)
	Struct QuestVariableActor                                    LevelSequenceActorSpawnLocation;                   // 0xc0(0x30)
	Struct QuestVariableActor                                    SequencerCutSceneActor;                            // 0xf0(0x30)
	bool                                                         AttachToTargetActor;                               // 0x120(0x1)
	struct FName                                                 AttachSocketName;                                  // 0x124(0x8)
	bool                                                         PlayGlobally;                                      // 0x12c(0x1)
};


// Size 0x70
class OverrideManagedActorStateStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    ActorVar;                                          // 0x80(0x30)
	bool                                                         TrackActor;                                        // 0xb0(0x1)
	bool                                                         MarkAsCritical;                                    // 0xb1(0x1)
	Struct FText                                                 CriticalActorLostMessage;                          // 0xb8(0x38)
};


// Size 0x68
class ParticipantRadiusTrackerStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        DurationBetweenChecks;                             // 0x80(0x4)
	Struct QuestVariableVector                                   Location;                                          // 0x88(0x30)
	Struct QuestVariableFloat                                    Radius;                                            // 0xb8(0x30)
};


// Size 0x0
class WaitUntilAllParticipantsEnterRadiusStep: public ParticipantRadiusTrackerStepDesc
{
public:
};


// Size 0x0
class WaitUntilAllParticipantsLeaveRadiusStep: public ParticipantRadiusTrackerStepDesc
{
public:
};


// Size 0x0
class WaitUntilAnyParticipantEntersRadiusStep: public ParticipantRadiusTrackerStepDesc
{
public:
};


// Size 0x138
class PlaySequencerAnimationOnCutsceneActorStepDesc: public TaleQuestStepDesc
{
public:
	Class LevelSequence*                                         LevelSequence;                                     // 0x80(0x8)
	float                                                        Delay;                                             // 0x88(0x4)
	Struct QuestVariableActor                                    DockableBaseActor;                                 // 0x90(0x30)
	Struct QuestVariableActor                                    SequencerCutSceneActor;                            // 0xc0(0x30)
	Struct QuestVariableActor                                    ActorToPossess;                                    // 0xf0(0x30)
	Struct QuestVariableArray                                    AdditionalPossessables;                            // 0x120(0x30)
	Struct QuestVariableActor                                    InteractingActor;                                  // 0x150(0x30)
	Struct FString                                               PossessableName;                                   // 0x180(0x10)
	Class SceneDialogueData*                                     DialogueData;                                      // 0x190(0x8)
	TArray<Struct FText>                                         LocalisableNames;                                  // 0x198(0x10)
	bool                                                         IsLevelSequenceActorAlwaysRelevant;                // 0x1a8(0x1)
	bool                                                         IsLooping;                                         // 0x1a9(0x1)
	float                                                        SubtitleSphereRadiusInCm;                          // 0x1ac(0x4)
	Class LevelSequence*                                         FemaleLevelSequence;                               // 0x1b0(0x8)
};


// Size 0xf8
class PlaySequencerAnimationStepDesc: public TaleQuestStepDesc
{
public:
	Class LevelSequence*                                         LevelSequenceToPlay;                               // 0x80(0x8)
	Struct QuestVariableActor                                    TargetActorToSpawn;                                // 0x88(0x30)
	Struct QuestVariableActor                                    LevelSequenceActorSpawnLocation;                   // 0xb8(0x30)
	Struct QuestVariableActor                                    DockableBaseActor;                                 // 0xe8(0x30)
	Struct QuestVariableActor                                    InteractingActor;                                  // 0x118(0x30)
	bool                                                         PlayGlobally;                                      // 0x148(0x1)
	bool                                                         IsLevelSequenceActorAlawaysRelevant;               // 0x149(0x1)
	Class SceneDialogueData*                                     DialogueData;                                      // 0x150(0x8)
	TArray<Struct FText>                                         LocalisableNames;                                  // 0x158(0x10)
	bool                                                         IsLooping;                                         // 0x168(0x1)
	float                                                        SubtitleSphereRadiusInCm;                          // 0x16c(0x4)
	Class LevelSequence*                                         FemaleLevelSequenceToPlay;                         // 0x170(0x8)
};


// Size 0x30
class PreventInteractionWithActorStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
};


// Size 0x40
class ProvokeHitReactionDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    ActorToProvoke;                                    // 0x80(0x30)
	class                                                        DamageType;                                        // 0xb0(0x8)
	float                                                        DamageAmount;                                      // 0xb8(0x4)
	byte                                                         DamageReason;                                      // 0xbc(0x1)
};


// Size 0x0
class ReleaseGameEventBlockStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x40
class RemoveGameEventExclusionZoneStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        Radius;                                            // 0x80(0x4)
	bool                                                         ShouldGetRadiusFromRemoteConfig;                   // 0x84(0x1)
	struct FName                                                 RemoteConfigKeyRadius;                             // 0x88(0x8)
	Struct QuestVariableVector                                   Location;                                          // 0x90(0x30)
};


// Size 0x0
class RequestGameEventBlockStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x60
class SelectNamedPointStepDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 GroupName;                                         // 0xa0(0x8)
	int                                                          PointIndex;                                        // 0xa8(0x4)
	byte                                                         ReturnInSpace;                                     // 0xac(0x1)
	Struct QuestVariableOrientedPoint                            Point;                                             // 0xb0(0x30)
};


// Size 0x38
class SetEQSNamedContextStepDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 Name;                                              // 0x80(0x8)
	Struct QuestVariableLinkEQSContext                           Value;                                             // 0x88(0x30)
};


// Size 0x50
class SpawnLayerStepDesc: public TaleQuestStepDesc
{
public:
	Class LayerActorsDataAsset*                                  LayerAsset;                                        // 0x80(0x8)
	bool                                                         SpawnPhased;                                       // 0x88(0x1)
	Struct QuestVariableActor                                    ActorWithLayers;                                   // 0x90(0x30)
	TArray<Struct QuestVariableActor>                            SpawnedActors;                                     // 0xc0(0x10)
};


// Size 0x90
class SpawnPhasedActorWithTransformStepBaseDesc: public TaleQuestStepDesc
{
public:
	bool                                                         MarkAsCritical;                                    // 0xa0(0x1)
	Struct FText                                                 CriticalActorLostMessage;                          // 0xa8(0x38)
	Struct QuestVariableActor                                    ActorVar;                                          // 0xe0(0x30)
};


// Size 0x38
class SpawnPhasedActorAtLocationStepDesc: public SpawnPhasedActorWithTransformStepBaseDesc
{
public:
	Struct QuestVariableTransform                                Location;                                          // 0x110(0x38)
};


// Size 0x108
class SpawnPhasedItemStepDesc: public TaleQuestStepDesc
{
public:
	bool                                                         TrackItem;                                         // 0x80(0x1)
	bool                                                         MarkItemAsCritical;                                // 0x81(0x1)
	Struct FText                                                 CriticalActorLostMessage;                          // 0x88(0x38)
	struct FName                                                 SocketName;                                        // 0xc0(0x8)
	Struct QuestVariableItemDescType                             Item;                                              // 0xc8(0x30)
	Struct QuestVariableActor                                    LocatorVar;                                        // 0xf8(0x30)
	Struct QuestVariableOrientedPoint                            LocatorPoint;                                      // 0x128(0x30)
	Struct QuestVariableItemInfo                                 SpawnedItemVar;                                    // 0x158(0x30)
};


// Size 0x0
class StartSuppressingCutsceneResponsesStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x0
class StopSuppressingCutsceneResponsesStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x10
class TaleQuestArrayItemStepBaseDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 ArrayVar;                                          // 0x80(0x8)
	struct FName                                                 ItemVar;                                           // 0x88(0x8)
};


// Size 0x0
class TaleQuestAddToArrayStepDesc: public TaleQuestArrayItemStepBaseDesc
{
public:
};


// Size 0x30
class TaleQuestArrayContainsStepDesc: public TaleQuestArrayItemStepBaseDesc
{
public:
	Struct QuestVariableBool                                     Result;                                            // 0x90(0x30)
};


// Size 0x18
class TaleQuestArrayOperationStepBaseDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 Array1;                                            // 0x80(0x8)
	struct FName                                                 Array2;                                            // 0x88(0x8)
	struct FName                                                 Result;                                            // 0x90(0x8)
};


// Size 0x0
class TaleQuestArrayAppendStepDesc: public TaleQuestArrayOperationStepBaseDesc
{
public:
};


// Size 0x0
class TaleQuestArrayUnionStepDesc: public TaleQuestArrayOperationStepBaseDesc
{
public:
};


// Size 0x30
class TaleQuestAwaitCrewShipSinkStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableGuid                                     CrewId;                                            // 0x80(0x30)
};


// Size 0x98
class TaleQuestChooseIslandFromWeightsStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableNameArray                                IslandsToChooseFrom;                               // 0x80(0x30)
	Struct QuestVariableInt                                      DifficultyRank;                                    // 0xb0(0x30)
	Struct QuestVariableName                                     ChosenIsland;                                      // 0xe0(0x30)
	Class IslandTypeWeightsDataAsset*                            IslandTypeWeights;                                 // 0x110(0x8)
};


// Size 0x8
class TaleQuestClearTaleProposalsStepDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 CampaignId;                                        // 0x80(0x8)
};


// Size 0x30
class TaleQuestDisableInteractionStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
};


// Size 0x8
class TaleQuestEmissaryCompanyActionRewardBoostStepDesc: public TaleQuestStepDesc
{
public:
	byte                                                         CompanyActionType;                                 // 0x80(0x1)
};


// Size 0x30
class TaleQuestEnableInteractionStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    TargetActor;                                       // 0x80(0x30)
};


// Size 0x60
class TaleQuestEventStepDescBase: public TaleQuestStepDesc
{
public:
	Class Object*                                                Dispatcher;                                        // 0x80(0x8)
	Struct NativeAndUserDefinedStructSelector                    EventType;                                         // 0x88(0x8)
};


// Size 0x0
class TaleQuestAwaitEventStepDesc: public TaleQuestEventStepDescBase
{
public:
};


// Size 0x0
class TaleQuestFireEventStepDesc: public TaleQuestEventStepDescBase
{
public:
};


// Size 0x0
class ValueProviderStepInterface: public Interface
{
public:
};


// Size 0x28
class TaleQuestForEachStepDescBase: public TaleQuestStepDesc
{
public:
	struct FName                                                 Collection;                                        // 0x88(0x8)
	Class TaleQuestStepDesc*                                     Body;                                              // 0x90(0x8)
	struct FName                                                 KeyPinName;                                        // 0x98(0x8)
	struct FName                                                 ItemPinName;                                       // 0xa0(0x8)
};


// Size 0x0
class TaleQuestForEachAnyStepDesc: public TaleQuestForEachStepDescBase
{
public:
};


// Size 0x0
class TaleQuestForEachSequentialDesc: public TaleQuestForEachStepDescBase
{
public:
};


// Size 0x0
class TaleQuestForEachUnionStepDesc: public TaleQuestForEachStepDescBase
{
public:
};


// Size 0x60
class TaleQuestGetCollectionItemCountStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableCollection                               Collection;                                        // 0x80(0x30)
	Struct QuestVariableInt                                      Num;                                               // 0xb0(0x30)
};


// Size 0x68
class TaleQuestGetParticipatingCrewsInRadiusStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableGuidArray                                CrewIds;                                           // 0x80(0x30)
	Struct QuestVariableVector                                   Location;                                          // 0xb0(0x30)
	float                                                        Radius;                                            // 0xe0(0x4)
};


// Size 0x30
class TaleQuestGetParticipatingCrewsStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableGuidArray                                CrewIds;                                           // 0x80(0x30)
};


// Size 0x60
class TaleQuestGrantRewardStepDesc: public TaleQuestStepDesc
{
public:
	Struct RewardId                                              RewardId;                                          // 0x80(0x8)
	class                                                        Company;                                           // 0x88(0x8)
	Struct Guid                                                  Id;                                                // 0x90(0x10)
	bool                                                         ShouldGrantToAlliedCrews;                          // 0xa0(0x1)
	Struct QuestVariablePlayerActor                              SpecificPlayerToAward;                             // 0xa8(0x30)
	struct FName                                                 Feature;                                           // 0xd8(0x8)
};


// Size 0x38
class TaleQuestPermanentPromptStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariablePrioritisedPrompt                        Prompt;                                            // 0x80(0x30)
	byte                                                         StartOrStop;                                       // 0xb0(0x1)
};


// Size 0x68
class TaleQuestRunnableStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x98
class TaleQuestFunctionStepLibrary: public TaleQuestRunnableStepDesc
{
public:
	Class Function*                                              Function;                                          // 0xf0(0x8)
	byte                                                         FunctionStepFlags;                                 // 0x178(0x1)
};


// Size 0x0
class ActorOfInterestTaleFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestActorFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestAnimationStepFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestCoreFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestIntMathsFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestItemFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestLogicFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestNamedPointsFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestNameFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestNPCHideFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestQueryableStateAddToIntFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestQueryableStateReadBoolFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestQueryableStateReadIntFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestQueryableStateWriteBoolFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestQueryableStateWriteIntFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestStoryFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x48
class TaleQuestStoryBranchFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
	Class TaleQuestStepDesc*                                     Active;                                            // 0x188(0x8)
	Class TaleQuestStepDesc*                                     Inactive;                                          // 0x190(0x8)
};


// Size 0x0
class TaleQuestTransformMathsFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestTransfromConversionFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestUObjectFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestUtilityFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x0
class TaleQuestWaterVolumeFunctionLibrary: public TaleQuestFunctionStepLibrary
{
public:
};


// Size 0x68
class TaleQuestSelectEntryFromArrayStepDesc: public TaleQuestStepDesc
{
public:
	Class TaleQuestArrayEntrySelectionStrategy*                  SelectionStrategy;                                 // 0x80(0x8)
	Struct QuestVariableArray                                    InputArray;                                        // 0x88(0x30)
	Struct QuestVariableAny                                      OutputEntry;                                       // 0xb8(0x30)
};


// Size 0x0
class TaleQuestShipDiveStepDesc: public TaleQuestStepDesc
{
public:
};


// Size 0x8
class TaleQuestShipSurfaceStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        TimeToSurface;                                     // 0x80(0x4)
};


// Size 0x30
class TaleQuestStarFieldPuzzleDimStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    StarFieldPuzzleActor;                              // 0x80(0x30)
};


// Size 0x30
class TaleQuestStarFieldPuzzleEndStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    StarFieldPuzzleActor;                              // 0x80(0x30)
};


// Size 0x30
class TaleQuestStarFieldPuzzleSetupAndWaitForCompletionStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    StarFieldPuzzleActor;                              // 0x80(0x30)
};


// Size 0x20
class TaleQuestStartCameraFadeStepDesc: public TaleQuestStepDesc
{
public:
	float                                                        FromAlpha;                                         // 0x80(0x4)
	float                                                        ToAlpha;                                           // 0x84(0x4)
	float                                                        FadeTimeInSeconds;                                 // 0x88(0x4)
	Struct LinearColor                                           FadeColour;                                        // 0x8c(0x10)
	bool                                                         ShouldFadeAudio;                                   // 0x9c(0x1)
	bool                                                         HoldFadeWhenFinished;                              // 0x9d(0x1)
};


// Size 0x58
class TaleQuestStructStepDescBase: public TaleQuestStepDesc
{
public:
	Class ScriptStruct*                                          Struct;                                            // 0x80(0x8)
};


// Size 0x0
class TaleQuestBreakStructStepDesc: public TaleQuestStructStepDescBase
{
public:
};


// Size 0x0
class TaleQuestMakeStructStepDesc: public TaleQuestStructStepDescBase
{
public:
};


// Size 0x8
class TaleQuestTaskStepDescBase: public TaleQuestStepDesc
{
public:
	Class TaleQuestStepDesc*                                     Task;                                              // 0x80(0x8)
};


// Size 0x0
class TaleMigrationVolatileTaskStepDesc: public TaleQuestTaskStepDescBase
{
public:
};


// Size 0x30
class TaleQuestCrewTaskStepDesc: public TaleQuestTaskStepDescBase
{
public:
	Struct QuestVariableGuid                                     CrewId;                                            // 0x88(0x30)
};


// Size 0x0
class TaleQuestPersistentForEachCrewTaskStepDesc: public TaleQuestTaskStepDescBase
{
public:
};


// Size 0x8
class TaleQuestToggleAmbientMigrationForServerStepDesc: public TaleQuestStepDesc
{
public:
	bool                                                         AmbientMigrationAvailable;                         // 0x80(0x1)
};


// Size 0x18
class TaleQuestUpdateCheckpointStepDesc: public TaleQuestStepDesc
{
public:
	Struct RewardId                                              RewardIdToAward;                                   // 0x80(0x8)
	struct FName                                                 CampaignIdToRemove;                                // 0x88(0x8)
	struct FName                                                 Feature;                                           // 0x90(0x8)
};


// Size 0x68
class TaleQuestWaitForHandInStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    HandInActor;                                       // 0x80(0x30)
	class                                                        SpecificItem;                                      // 0xb0(0x8)
	Struct QuestVariableItemDescType                             HandInItem;                                        // 0xb8(0x30)
};


// Size 0x30
class TrackResponseCoordinatorStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableUObject                                  CutsceneResponseCoordinator;                       // 0x80(0x30)
};


// Size 0x60
class VisualiseLoggerEQSResultsTaleStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableArray                                    ResultsArray;                                      // 0x80(0x30)
	Struct QuestVariableVector                                   SelectedResult;                                    // 0xb0(0x30)
};


// Size 0x40
class WaitForActorOfInterestToUnregisterStepDesc: public TaleQuestStepDesc
{
public:
	class                                                        ActorOfInterestId;                                 // 0x80(0x8)
	Struct FText                                                 ActorOfInterestUnregisteredFailureMessage;         // 0x88(0x38)
};


// Size 0x30
class WaitForGameEventToCompleteStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableGameEvent                                GameEvent;                                         // 0x80(0x30)
};


// Size 0x10
class WaitForHealthToReachFractionStepDesc: public TaleQuestStepDesc
{
public:
	Class Actor*                                                 HealthOwner;                                       // 0x80(0x8)
	float                                                        HealthFraction;                                    // 0x88(0x4)
};


// Size 0x60
class WaitForItemPickupStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableActor                                    Item;                                              // 0x80(0x30)
	Struct QuestVariableActor                                    PickerUpper;                                       // 0xb0(0x30)
};


// Size 0x30
class WaitForSpawnedPawnBaseStepDesc: public TaleQuestStepDesc
{
public:
	Struct QuestVariableAISpawner                                AISpawner;                                         // 0x80(0x30)
};


// Size 0x198
class TaleQuestSelectShipwreckLocationFromValidCandidatesStep: public TaleQuestStep
{
public:
	Class TaleQuestSelectorService*                              CachedSelectorService;                             // 0x110(0x8)
};


// Size 0x98
class TaleQuestSelectShipwreckLocationFromValidCandidatesStepDesc: public TaleQuestStepDesc
{
public:
	Class TaleQuestArrayEntrySelectionStrategy*                  SelectionStrategy;                                 // 0x80(0x8)
	Struct QuestVariableVectorArray                              InputArray;                                        // 0x88(0x30)
	Struct QuestVariableVector                                   OutputEntry;                                       // 0xb8(0x30)
	Struct QuestVariableBool                                     ShuffleLists;                                      // 0xe8(0x30)
};


// Size 0x10
class RemoveFlameOfFateTypeStepDesc: public TaleQuestStepDesc
{
public:
	byte                                                         FlameOfFateTypeToRemove;                           // 0x80(0x1)
	class                                                        LanternItemCategory;                               // 0x88(0x8)
};


// Size 0x60
class TaleQuestFlameOfFateService: public TaleQuestService
{
public:
	Class TaleQuestFlameOfFateServiceDesc*                       ServiceDesc;                                       // 0x60(0x8)
};


// Size 0x10
class TaleQuestFlameOfFateServiceDesc: public TaleQuestServiceDesc
{
public:
	class                                                        LanternItemCategory;                               // 0x28(0x8)
	byte                                                         FlameOfFateTypeToSet;                              // 0x30(0x1)
	bool                                                         SetFlameOnStart;                                   // 0x31(0x1)
};


// Size 0x0
class TaleQuestAddBountyMapStep: public TaleQuestStep
{
public:
};


// Size 0x108
class TaleQuestAddBountyMapStepDesc: public TaleQuestStepDesc
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	Struct QuestVariableText                                     Location;                                          // 0xb8(0x30)
	Struct QuestVariableTextArray                                Description;                                       // 0xe8(0x30)
	Struct QuestVariableBountyTargetArray                        CaptainTargets;                                    // 0x118(0x30)
	Struct QuestVariableBountyTargetArray                        CrewTargets;                                       // 0x148(0x30)
	Class BountyMapLayout*                                       CustomLayout;                                      // 0x178(0x8)
	class                                                        OverrideTreasureMapItemDesc;                       // 0x180(0x8)
};


// Size 0x0
class TaleQuestAddCargoRunMapStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestAddChecklistMapStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestAddCircleMapStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestAddMerchantMapStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestAddRiddleMapStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestAddXMarksMapStep: public TaleQuestStep
{
public:
};


// Size 0x0
class TaleQuestAdvanceRiddleMapStep: public TaleQuestStep
{
public:
};


// Size 0xb0
class TaleQuestMapService: public TaleQuestService
{
public:
};


// Size 0x0
class TaleQuestMapServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0xa0
class TaleQuestAddCargoRunMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	Struct QuestVariableInt                                      NumItems;                                          // 0xb8(0x30)
	Struct QuestVariableGuid                                     NPCId;                                             // 0xe8(0x30)
	Class CargoRunMapLayout*                                     Layout;                                            // 0x118(0x8)
};


// Size 0x120
class TaleQuestAddChecklistMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableText                                     Title;                                             // 0xa8(0x30)
	Struct QuestVariableText                                     Description;                                       // 0xd8(0x30)
	Struct QuestVariableDataAsset                                ChecklistItemsData;                                // 0x108(0x30)
	Struct QuestVariableText                                     Afternote;                                         // 0x138(0x30)
	Struct QuestVariableDataAsset                                Layout;                                            // 0x168(0x30)
	byte                                                         RadialMiniIcon;                                    // 0x198(0x1)
};


// Size 0x70
class TaleQuestAddCircleMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	Struct QuestVariableVector                                   Location;                                          // 0xb8(0x30)
	float                                                        CircleScale;                                       // 0xe8(0x4)
	byte                                                         RadialMiniIcon;                                    // 0xec(0x1)
};


// Size 0xd0
class TaleQuestAddMerchantMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	Struct QuestVariableText                                     DeliveryLocation;                                  // 0xb8(0x30)
	Struct QuestVariableText                                     DeliverByTime;                                     // 0xe8(0x30)
	Struct QuestVariableMerchantItemArray                        Items;                                             // 0x118(0x30)
	Class MerchantMapLayout*                                     Layout;                                            // 0x148(0x8)
};


// Size 0x38
class TaleQuestAddRiddleMapBaseStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
};


// Size 0x10
class TaleQuestAddRiddleMapStepDesc: public TaleQuestAddRiddleMapBaseStepDesc
{
public:
	TArray<Struct FText>                                         Text;                                              // 0xb8(0x10)
};


// Size 0x30
class TaleQuestAddRiddleMapUsingVariableStepDesc: public TaleQuestAddRiddleMapBaseStepDesc
{
public:
	Struct QuestVariableTextArray                                TextVariable;                                      // 0xb8(0x30)
};


// Size 0xc8
class TaleQuestAddXMarksMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableName                                     IslandName;                                        // 0x88(0x30)
	Struct QuestVariableVector                                   Location;                                          // 0xb8(0x30)
	Struct QuestVariableBool                                     IsUnderground;                                     // 0xe8(0x30)
	Struct TaleQuestVariableTreasureMapItemDescType              TreasureMapOverride;                               // 0x118(0x30)
};


// Size 0x8
class TaleQuestAdvanceRiddleMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
};


// Size 0x8
class TaleQuestRemoveMapStep: public TaleQuestStep
{
public:
	Class TaleQuestRemoveMapStepDesc*                            StepDesc;                                          // 0x98(0x8)
};


// Size 0x38
class TaleQuestRemoveMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableVector                                   Location;                                          // 0x88(0x30)
};


// Size 0x8
class TaleQuestUpdateMerchantMapStep: public TaleQuestStep
{
public:
	Class TaleQuestUpdateMerchantMapStepDesc*                    Desc;                                              // 0x98(0x8)
};


// Size 0x68
class TaleQuestUpdateMerchantMapStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
	Struct QuestVariableMerchantItem                             Item;                                              // 0x88(0x30)
	Struct QuestVariableInt                                      Index;                                             // 0xb8(0x30)
};


// Size 0x8
class TaleQuestWaitForChecklistMapCompletionStepDesc: public TaleQuestMapStepDescBase
{
public:
	struct FName                                                 MapId;                                             // 0x80(0x8)
};


}