#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x38
struct TaleQuestQueryableStateReadValueIntCondition
{
public:
	char                                                         pad0x28_LIHOP[0x28];                               // 0x0(0x28)
	class UClass*                                                DataID;                                            // 0x28(0x8)
	int                                                          ExpectedValue;                                     // 0x30(0x4)
	char                                                         ComparisonToExpectedValue;                         // 0x34(0x1)
	char                                                         pad0x3_T0DIQ[0x3];                                 // 0x35(0x3)
};


// Size 0x30
struct ToggleModalInteractionNetworkEvent
{
public:
	char                                                         pad0x18_5GGD3[0x18];                               // 0x0(0x18)
	struct NetActorPtr                                           TargetActor;                                       // 0x18(0x14)
	bool                                                         InteractionBlocked;                                // 0x2c(0x1)
	char                                                         pad0x3_9UI1Z[0x3];                                 // 0x2d(0x3)
};


// Size 0x3
struct TaleActorSpawnParameters
{
public:
	bool                                                         Tracked;                                           // 0x0(0x1)
	bool                                                         GatherForMigration;                                // 0x1(0x1)
	bool                                                         DeferredSpawning;                                  // 0x2(0x1)
};


// Size 0x20
struct JumpToMontageSectionCommand
{
public:
	char                                                         pad0x18_BGLKK[0x18];                               // 0x0(0x18)
	struct FName                                                 SectionName;                                       // 0x18(0x8)
};


// Size 0x30
struct QuestVariablePageLayout
{
public:
	char                                                         pad0x30_WL5Q3[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableItemInfo
{
public:
	char                                                         pad0x30_IMFVA[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableAny
{
public:
	char                                                         pad0x30_61BBW[0x30];                               // 0x0(0x30)
};


// Size 0x18
struct SetDialogueInteractionEnabledClientCommand
{
public:
	char                                                         pad0x8_DUYRW[0x8];                                 // 0x0(0x8)
	class Object*                                                DialogueComponentObject;                           // 0x8(0x8)
	bool                                                         ShouldBeEnabled;                                   // 0x10(0x1)
	char                                                         pad0x7_KHGP4[0x7];                                 // 0x11(0x7)
};


// Size 0x28
struct BodyFramePair
{
public:
	char                                                         pad0x10_LDGQJ[0x10];                               // 0x0(0x10)
	class TaleQuestIndexedFrame*                                 Frame;                                             // 0x10(0x8)
	char                                                         pad0x10_AGMMC[0x10];                               // 0x18(0x10)
};


// Size 0x38
struct TaleQuestDeliveryRequest
{
public:
	int                                                          Id;                                                // 0x0(0x4)
	char                                                         pad0x4_97IJ1[0x4];                                 // 0x4(0x4)
	struct MerchantContractItemDesc                              Item;                                              // 0x8(0x28)
	int                                                          NumToDeliver;                                      // 0x30(0x4)
	int                                                          NumToAllocate;                                     // 0x34(0x4)
};


// Size 0x30
struct QuestVariablePrioritisedPrompt
{
public:
	char                                                         pad0x30_LP63W[0x30];                               // 0x0(0x30)
};


// Size 0x48
struct CutsceneStartedTelemetryEvent
{
public:
	struct Guid                                                  CutsceneId;                                        // 0x0(0x10)
	struct FString                                               CutsceneName;                                      // 0x10(0x10)
	float                                                        CutsceneDuration;                                  // 0x20(0x4)
	bool                                                         IsLooping;                                         // 0x24(0x1)
	char                                                         pad0x3_DN8NE[0x3];                                 // 0x25(0x3)
	TArray<String>                                               ParticipatingPlayers;                              // 0x28(0x10)
	TArray<struct Guid>                                          ParticipatingCrewIds;                              // 0x38(0x10)
};


// Size 0x30
struct QuestVariableMerchantItem
{
public:
	char                                                         pad0x30_F6L5A[0x30];                               // 0x0(0x30)
};


// Size 0x10
struct MigrationActionPair
{
public:
	struct TaleResourceHandle                                    AllocatedResourceHandle;                           // 0x0(0x8)
	class TaleMigrationAction*                                   MigrationAction;                                   // 0x8(0x8)
};


// Size 0x28
struct SetNextMontageSectionCommand
{
public:
	char                                                         pad0x18_N39WP[0x18];                               // 0x0(0x18)
	struct FName                                                 FromSectionName;                                   // 0x18(0x8)
	struct FName                                                 ToSectionName;                                     // 0x20(0x8)
};


// Size 0x20
struct TaleQuestFailedEvent
{
public:
	TArray<struct Guid>                                          CrewIds;                                           // 0x0(0x10)
	struct Guid                                                  QuestId;                                           // 0x10(0x10)
};


// Size 0x20
struct StopMontageAnimationCommand
{
public:
	char                                                         pad0x18_CAH82[0x18];                               // 0x0(0x18)
	float                                                        BlendOutTime;                                      // 0x18(0x4)
	char                                                         pad0x4_H34ZZ[0x4];                                 // 0x1c(0x4)
};


// Size 0x20
struct TriggerOnScreenParticlesRpc
{
public:
	char                                                         pad0x18_5F4V4[0x18];                               // 0x0(0x18)
	class ParticleSystem*                                        Particles;                                         // 0x18(0x8)
};


// Size 0x60
struct SnapshottedActorData
{
public:
	char                                                         pad0x10_VQ7RX[0x10];                               // 0x0(0x10)
	struct Guid                                                  SnapshotID;                                        // 0x10(0x10)
	bool                                                         ActorWasCritical;                                  // 0x20(0x1)
	bool                                                         ActorWasTracked;                                   // 0x21(0x1)
	char                                                         pad0x6_14P4C[0x6];                                 // 0x22(0x6)
	struct FText                                                 FailureMessage;                                    // 0x28(0x38)
};


// Size 0x48
struct PredicatedBranchedTask
{
public:
	char                                                         pad0x48_JY2OK[0x48];                               // 0x0(0x48)
};


// Size 0x1
struct TaleQuestStopPermanentPromptEvent
{
public:
	char                                                         pad0x1_DWPHX[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct TaleQuestPredicateBranchedTaskDesc
{
public:
	int                                                          BranchIndex;                                       // 0x0(0x4)
	char                                                         pad0x4_GB8SS[0x4];                                 // 0x4(0x4)
	class TaleQuestStepDesc*                                     BranchedTask;                                      // 0x8(0x8)
};


// Size 0x10
struct TaleQuestToggledDefinition
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x0(0x8)
	class UClass*                                                Definition;                                        // 0x8(0x8)
};


// Size 0x20
struct PlayMontageAnimationCommand
{
public:
	char                                                         pad0x18_VI5KF[0x18];                               // 0x0(0x18)
	float                                                        PlayRate;                                          // 0x18(0x4)
	float                                                        Position;                                          // 0x1c(0x4)
};


// Size 0x28
struct PhasedItem
{
public:
	class ItemProxy*                                             ItemProxy;                                         // 0x0(0x8)
	class ItemInfo*                                              ItemInfo;                                          // 0x8(0x8)
	bool                                                         Tracked;                                           // 0x10(0x1)
	char                                                         pad0x17_Z3DZK[0x17];                               // 0x11(0x17)
};


// Size 0x30
struct QuestVariableCollection
{
public:
	char                                                         pad0x30_TSCKI[0x30];                               // 0x0(0x30)
};


// Size 0x18
struct TaleQuestCargoRunContractItem
{
public:
	class UClass*                                                ItemToCollect;                                     // 0x0(0x8)
	char                                                         pad0x10_U47NL[0x10];                               // 0x8(0x10)
};


// Size 0x4
struct TaleQuestSelectorServiceSeedSetTelemetryEvent
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
};


// Size 0x40
struct StepMerchantItemDesc
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Icon;                                              // 0x38(0x8)
};


// Size 0x14
struct IslandTypeWeights
{
public:
	float                                                        FeatureIslandWeight;                               // 0x0(0x4)
	float                                                        ResourceIslandWeight;                              // 0x4(0x4)
	float                                                        OutpostIslandWeight;                               // 0x8(0x4)
	float                                                        SeapostIslandWeight;                               // 0xc(0x4)
	float                                                        FortIslandWeight;                                  // 0x10(0x4)
};


// Size 0x30
struct TaleQuestPhaseClusterRootActor
{
public:
	char                                                         pad0x30_7DL72[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableItemDescTypeArray
{
public:
	char                                                         pad0x30_GYXDA[0x30];                               // 0x0(0x30)
};


// Size 0x1
struct SplineFootprintPathTool
{
public:
	char                                                         pad0x1_DYWBG[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct TrackedActorData
{
public:
	class Actor*                                                 Actor;                                             // 0x0(0x8)
	char                                                         pad0x8_VBV7H[0x8];                                 // 0x8(0x8)
};


// Size 0x30
struct QuestVariableTexture
{
public:
	char                                                         pad0x30_RD3PS[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableGameEvent
{
public:
	char                                                         pad0x30_68J17[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct InteractionOptionSelectedWithQueryableStateNonUI
{
public:
	class UClass*                                                DataID;                                            // 0x0(0x8)
	struct Guid                                                  InstigatorCrewID;                                  // 0x8(0x10)
	class Actor*                                                 InteractingPlayer;                                 // 0x18(0x8)
};


// Size 0x20
struct TaleQuestQueryableStateDataInfoId
{
public:
	struct Guid                                                  MyTaleId;                                          // 0x0(0x10)
	struct Guid                                                  MyScopeId;                                         // 0x10(0x10)
};


// Size 0x48
struct CompondNodePinDesc
{
public:
	struct FText                                                 DisplayName;                                       // 0x0(0x38)
	struct Guid                                                  PinId;                                             // 0x38(0x10)
};


// Size 0x30
struct QuestVariableLinkEQSContext
{
public:
	char                                                         pad0x30_25CCI[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableBountyTargetArray
{
public:
	char                                                         pad0x30_AII8Q[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct EndOnScreenParticlesRpc
{
public:
	char                                                         pad0x18_5M1T5[0x18];                               // 0x0(0x18)
	class ParticleSystem*                                        Particles;                                         // 0x18(0x8)
};


// Size 0x18
struct MontageAnimationCommandBase
{
public:
	char                                                         pad0x8_697NY[0x8];                                 // 0x0(0x8)
	class Actor*                                                 MyTarget;                                          // 0x8(0x8)
	class AnimMontage*                                           MyMontage;                                         // 0x10(0x8)
};


// Size 0x30
struct QuestVariableActorArray
{
public:
	char                                                         pad0x30_9WGB9[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableActorAssetTypeArray
{
public:
	char                                                         pad0x30_XDLE9[0x30];                               // 0x0(0x30)
};


// Size 0xc
struct PhaseBranchIndexPlayerAssignment
{
public:
	char                                                         pad0x8_6OCPV[0x8];                                 // 0x0(0x8)
	int                                                          AssignedPhaseBranchIndex;                          // 0x8(0x4)
};


// Size 0x40
struct TaleQuestDeliverableItem
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Icon;                                              // 0x38(0x8)
};


// Size 0x80
struct TaleQuestDesc
{
public:
	char                                                         pad0x28_Y8O2D[0x28];                               // 0x0(0x28)
	class TaleQuestStepDesc*                                     Root;                                              // 0x28(0x8)
	class Object*                                                Definition;                                        // 0x30(0x8)
	struct FText                                                 TaleFailMessage;                                   // 0x38(0x38)
	struct FName                                                 TaleFailBannerTag;                                 // 0x70(0x8)
	bool                                                         ShouldFireStartTallTaleTrackedObjective;           // 0x78(0x1)
	bool                                                         Development;                                       // 0x79(0x1)
	char                                                         pad0x6_YTQDN[0x6];                                 // 0x7a(0x6)
};


// Size 0x30
struct QuestVariableAISpawner
{
public:
	char                                                         pad0x30_VVAZM[0x30];                               // 0x0(0x30)
};


// Size 0x40
struct TaleQuestQueryableStateCanAllDataBeReadCondition
{
public:
	char                                                         pad0x28_G7N6M[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_Q420W[0x7];                                 // 0x39(0x7)
};


// Size 0x30
struct QuestVariableArray
{
public:
	char                                                         pad0x30_I6S45[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableGuidArray
{
public:
	char                                                         pad0x30_1ZI2E[0x30];                               // 0x0(0x30)
};


// Size 0x20
struct PhasedActor
{
public:
	class Actor*                                                 MapActor;                                          // 0x0(0x8)
	class Actor*                                                 Actor;                                             // 0x8(0x8)
	char                                                         pad0x10_VYCQC[0x10];                               // 0x10(0x10)
};


// Size 0x8
struct ActorSpawnedAutomationEvent
{
public:
	char                                                         pad0x8_11807[0x8];                                 // 0x0(0x8)
};


// Size 0x40
struct StepBountyTargetDesc
{
public:
	struct FText                                                 Name;                                              // 0x0(0x38)
	class Texture*                                               Portrait;                                          // 0x38(0x8)
};


// Size 0x20
struct ParticpantToolGroup
{
public:
	char                                                         pad0x20_ZOEMK[0x20];                               // 0x0(0x20)
};


// Size 0x40
struct TaleQuestQueryableStateCanAnyDataBeReadCondition
{
public:
	char                                                         pad0x28_LFOCM[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_ZWRBQ[0x7];                                 // 0x39(0x7)
};


// Size 0x1
struct EventSpawnedTallTaleQuestItem
{
public:
	char                                                         pad0x1_NPHT8[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventModalInteractionStateChanged
{
public:
	bool                                                         IsInteractionBlocked;                              // 0x0(0x1)
};


// Size 0x10
struct TaleQuestContextInvalidTelemetryEvent
{
public:
	struct FName                                                 StepType;                                          // 0x0(0x8)
	struct FName                                                 Tale;                                              // 0x8(0x8)
};


// Size 0x30
struct QuestVariableMerchantItemArray
{
public:
	char                                                         pad0x30_LLHAS[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableSetEQSTaleContextValue
{
public:
	char                                                         pad0x30_FJK8B[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableActorAssetType
{
public:
	char                                                         pad0x30_ZKR7A[0x30];                               // 0x0(0x30)
};


// Size 0x18
struct DebugTalePhaseBranchAssignedForPlayerEvent
{
public:
	struct Guid                                                  CrewId;                                            // 0x0(0x10)
	char                                                         pad0x8_68Q2K[0x8];                                 // 0x10(0x8)
};


// Size 0x48
struct SetDialogueInteractionPromptClientCommand
{
public:
	char                                                         pad0x8_ZRY3L[0x8];                                 // 0x0(0x8)
	class NPCDialogComponent*                                    DialogueComponent;                                 // 0x8(0x8)
	struct FText                                                 Prompt;                                            // 0x10(0x38)
};


// Size 0x30
struct QuestVariableObjectArray
{
public:
	char                                                         pad0x30_48HKB[0x30];                               // 0x0(0x30)
};


// Size 0x40
struct NameRedirectionTypeInfo
{
public:
	char                                                         NameRedirectionType;                               // 0x0(0x1)
	char                                                         pad0x7_6P6PJ[0x7];                                 // 0x1(0x7)
	struct FText                                                 RedirectedName;                                    // 0x8(0x38)
};


// Size 0x28
struct TaleQuestForEachCrewTask
{
public:
	char                                                         pad0x28_NM0L3[0x28];                               // 0x0(0x28)
};


// Size 0x18
struct PlaySequencerAutomationEvent
{
public:
	char                                                         pad0x18_4R6TC[0x18];                               // 0x0(0x18)
};


// Size 0x48
struct CriticalActorDelegateData
{
public:
	class Actor*                                                 CriticalActor;                                     // 0x0(0x8)
	struct FText                                                 FailureMessage;                                    // 0x8(0x38)
	char                                                         pad0x8_GJBFQ[0x8];                                 // 0x40(0x8)
};


// Size 0x48
struct CutsceneEndedTelemetryEvent
{
public:
	struct Guid                                                  CutsceneId;                                        // 0x0(0x10)
	struct FString                                               CutsceneName;                                      // 0x10(0x10)
	float                                                        CutsceneDuration;                                  // 0x20(0x4)
	float                                                        CutscenePlayTime;                                  // 0x24(0x4)
	TArray<String>                                               ParticipatingPlayers;                              // 0x28(0x10)
	TArray<struct Guid>                                          ParticipatingCrewIds;                              // 0x38(0x10)
};


// Size 0x40
struct CriticalActorWrapper
{
public:
	class Actor*                                                 CriticalActor;                                     // 0x0(0x8)
	char                                                         pad0x38_410UY[0x38];                               // 0x8(0x38)
};


// Size 0x30
struct QuestVariableTaleResourceHandle
{
public:
	char                                                         pad0x30_P2KUJ[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableItemDescType
{
public:
	char                                                         pad0x30_OE5D9[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableClassArray
{
public:
	char                                                         pad0x30_17IXC[0x30];                               // 0x0(0x30)
};


// Size 0x30
struct QuestVariableRotator
{
public:
	char                                                         pad0x30_6RM79[0x30];                               // 0x0(0x30)
};


// Size 0x40
struct TaleQuestQueryableStateReadAnyValueBoolCondition
{
public:
	char                                                         pad0x28_L1IAQ[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_MVDCI[0x7];                                 // 0x39(0x7)
};


// Size 0x40
struct TaleQuestQueryableStateReadAllValueBoolCondition
{
public:
	char                                                         pad0x28_QQEQC[0x28];                               // 0x0(0x28)
	TArray<class Class*>                                         AllDataToCheck;                                    // 0x28(0x10)
	bool                                                         ExpectedValue;                                     // 0x38(0x1)
	char                                                         pad0x7_7V10W[0x7];                                 // 0x39(0x7)
};


// Size 0x48
struct NameRedirectionData
{
public:
	struct FText                                                 OriginalName;                                      // 0x0(0x38)
	TArray<struct NameRedirectionTypeInfo>                       RedirectedNames;                                   // 0x38(0x10)
};


// Size 0x28
struct DebugOnTalePhaseBranchAssignedForPlayerNetworkEvent
{
public:
	char                                                         pad0x18_TNSIT[0x18];                               // 0x0(0x18)
	struct PhaseBranchIndexPlayerAssignment                      Assignment;                                        // 0x18(0xc)
	char                                                         pad0x4_126T8[0x4];                                 // 0x24(0x4)
};


// Size 0x30
struct TaleQuestQueryableStateDataInfo
{
public:
	struct TaleQuestQueryableStateDataInfoId                     InfoId;                                            // 0x0(0x20)
	class UClass*                                                DataID;                                            // 0x20(0x8)
	bool                                                         DataBool;                                          // 0x28(0x1)
	char                                                         pad0x3_488CW[0x3];                                 // 0x29(0x3)
	int                                                          DataInt;                                           // 0x2c(0x4)
};


// Size 0x30
struct QueryableStateChangedEvent
{
public:
	struct TaleQuestQueryableStateDataInfo                       DataValue;                                         // 0x0(0x30)
};


