#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Tethering_Structs.h"


// Size 0x60 (Full Size[0x128] - InheritedSize[0xc8]
class TetherCustomisationComponent: public ActorComponent
{
public:
	class SceneComponent*                                        ComponentToTetherTo;                               // 0xd0(0x8)
	float                                                        MassIntertiaScale;                                 // 0x120(0x4)
	bool                                                         CanBeTethered;                                     // 0x124(0x1)
	bool                                                         IsMassInertiaScalingEnabled;                       // 0x125(0x1)
};


// Size 0x140 (Full Size[0x508] - InheritedSize[0x3c8]
class Tether: public Actor
{
public:
	class SceneComponent*                                        TetherPositionAnchorComponent;                     // 0x4c0(0x8)
	class SphereComponent*                                       SourcePhysicsHandle;                               // 0x4c8(0x8)
	class SphereComponent*                                       TargetPhysicsHandle;                               // 0x4d0(0x8)
	class DistanceJointComponent*                                JointComponent;                                    // 0x4d8(0x8)
	class Actor*                                                 SourceActor;                                       // 0x4e0(0x8)
	class Actor*                                                 TargetActor;                                       // 0x4e8(0x8)
	float                                                        SlackCm;                                           // 0x4f0(0x4)
	float                                                        MaxLengthWhenGrowing;                              // 0x4f4(0x4)
	bool                                                         HasAttached;                                       // 0x500(0x1)
	bool                                                         HasSourceActor;                                    // 0x501(0x1)
	bool                                                         HasTargetActor;                                    // 0x502(0x1)
	bool                                                         IsSlackEnabled;                                    // 0x503(0x1)
	char                                                         CurrentTetherMode;                                 // 0x504(0x1)
};


// Size 0x40 (Full Size[0x670] - InheritedSize[0x630]
class CordRenderComponent: public StaticMeshComponent
{
public:
	TArray<class MaterialInstanceDynamic*>                       CordMaterials;                                     // 0x638(0x10)
	float                                                        ThicknessCm;                                       // 0x648(0x4)
};


// Size 0x88 (Full Size[0x150] - InheritedSize[0xc8]
class DistanceJointComponent: public ActorComponent
{
public:
	float                                                        MinDistance;                                       // 0x138(0x4)
	float                                                        MaxDistance;                                       // 0x13c(0x4)
	float                                                        SpringStiffness;                                   // 0x140(0x4)
	float                                                        SpringDamping;                                     // 0x144(0x4)
	bool                                                         ApplyAsSpring;                                     // 0x148(0x1)
	bool                                                         EnforceMinDistance;                                // 0x149(0x1)
	bool                                                         EnforceMaxDistance;                                // 0x14a(0x1)
};


// Size 0x60 (Full Size[0x6d0] - InheritedSize[0x670]
class DynamicCordRenderComponent: public CordRenderComponent
{
public:
	float                                                        BoundsPadding;                                     // 0x668(0x4)
	class SceneComponent*                                        EndPointA;                                         // 0x670(0x8)
	class SceneComponent*                                        EndPointB;                                         // 0x678(0x8)
};


// Size 0x20 (Full Size[0x690] - InheritedSize[0x670]
class HarpoonRenderComponent: public CordRenderComponent
{
public:
	TArray<class MaterialInstanceDynamic*>                       HarpoonMaterials;                                  // 0x668(0x10)
	float                                                        LaunchAnimationDurationSecs;                       // 0x678(0x4)
	float                                                        HitAnimationDurationSecs;                          // 0x67c(0x4)
	float                                                        QuickRetractAnimationSpeed;                        // 0x680(0x4)
};


