#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Time_Structs.h"


// Size 0x130 (Full Size[0x4f8] - InheritedSize[0x3c8]
class TimeService: public Actor
{
public:
	struct                                                       GameWorldTimeOffset;                               // 0x400(0x8)
	uint32                                                       TimeScalar;                                        // 0x40c(0x4)
	uint32                                                       NumberOfDaysInEachGameMonth;                       // 0x410(0x4)
	double                                                       ServiceTimeQueryRapidFrequencyOffsetMax;           // 0x418(0x8)
	float                                                        ServiceTimeQueryRapidFrequencyInSeconds;           // 0x420(0x4)
	float                                                        ServiceTimeQueryFrequencyInSeconds;                // 0x424(0x4)
	float                                                        ClientTimeUpdateFrequencyInSeconds;                // 0x428(0x4)
	float                                                        SunriseTimeHours;                                  // 0x42c(0x4)
	float                                                        SunsetTimeHours;                                   // 0x430(0x4)
	float                                                        LocalTimeUpdateAdjustMaxTimeDelta;                 // 0x434(0x4)
	float                                                        MinLocalTimeUpdateAdjustPercentageToSlowDown;      // 0x438(0x4)
	float                                                        MaxLocalTimeUpdateAdjustPercentageToSlowDown;      // 0x43c(0x4)
	float                                                        MinLocalTimeUpdateAdjustPercentageToSpeedUp;       // 0x440(0x4)
	float                                                        MaxLocalTimeUpdateAdjustPercentageToSpeedUp;       // 0x444(0x4)
	uint32                                                       MaxNumReplicatedTimeEntriesToAverage;              // 0x448(0x4)
	struct                                                       ReplicatedServerTime;                              // 0x498(0x10)
};


