// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x8
struct GameTime
{
public:
	Struct DateTime                                              DateTimeRepresentation;                            // 0x0(0x8)
};


// Size 0x10
struct GameTimeRange
{
public:
	Struct GameTime                                              Start;                                             // 0x0(0x8)
	Struct GameTime                                              End;                                               // 0x8(0x8)
};


// Size 0x8
struct ReplicatedDateTime
{
public:
};


// Size 0x10
struct ReplicatedAuthoritativeTime
{
public:
	Struct ReplicatedDateTime                                    WorldTime;                                         // 0x0(0x8)
	Struct ReplicatedDateTime                                    SyncTime;                                          // 0x8(0x8)
};


// Size 0x8
struct ReplicatedTimespan
{
public:
};


// Size 0x14
struct EventSetDateTime
{
public:
	int                                                          Year;                                              // 0x0(0x4)
	int                                                          Month;                                             // 0x4(0x4)
	int                                                          Day;                                               // 0x8(0x4)
	int                                                          Hour;                                              // 0xc(0x4)
	int                                                          Minute;                                            // 0x10(0x4)
};


}