#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x10
struct TinyKrakenEventCreatedTelemetryEvent
{
public:
	struct Guid                                                  EventId;                                           // 0x0(0x10)
};


// Size 0x10
struct TinyKrakenEventCompletedTelemetryEvent
{
public:
	struct Guid                                                  EventId;                                           // 0x0(0x10)
};


// Size 0x1
struct EventTinyKrakenHeadKilled
{
public:
	char                                                         pad0x1_LL4NY[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventTinyKrakenHeadTakenDamage
{
public:
	char                                                         pad0x1_4SZAP[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct EventTinyKrakenHeadHealthChanged
{
public:
	struct EventHealthChanged                                    HealthChangedEvent;                                // 0x0(0x48)
};


// Size 0x10
struct EventTinyKrakenBattlePhaseCompleted
{
public:
	struct FName                                                 CompletedBattlePhaseName;                          // 0x0(0x8)
	bool                                                         IsFinalPhase;                                      // 0xc(0x1)
	char                                                         pad0x3_LN234[0x3];                                 // 0xd(0x3)
};


