#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x30
struct TinyKrakenBattlePhaseParams
{
public:
	struct FName                                                 PhaseName;                                         // 0x0(0x8)
	bool                                                         TentaclesActiveInPhase;                            // 0x8(0x1)
	bool                                                         HeadActiveInPhase;                                 // 0x9(0x1)
	char                                                         pad0x6_J82XH[0x6];                                 // 0xa(0x6)
	class KrakenParamsDataAsset*                                 KrakenParams;                                      // 0x10(0x8)
	class TinyKrakenHeadParamsDataAsset*                         KrakenHeadParams;                                  // 0x18(0x8)
	class BattlePhaseProgressionTrackerBase*                     BattlePhaseProgressionTracker;                     // 0x20(0x8)
	float                                                        DelayBeforeNextPhase;                              // 0x28(0x4)
	float                                                        InactiveTimerBeforeSubmerge;                       // 0x2c(0x4)
};


// Size 0x38
struct TinyKrakenHeadIdleBehaviourParams
{
public:
	char                                                         pad0x38_TRFH9[0x38];                               // 0x0(0x38)
};


// Size 0x38
struct TinyKrakenHeadBehaviourParams
{
public:
	char                                                         AttackType;                                        // 0x0(0x1)
	char                                                         pad0x7_EUKRE[0x7];                                 // 0x1(0x7)
	class EnvQuery*                                              HeadMoveEQSQuery;                                  // 0x8(0x8)
	float                                                        TimeBeforeNextHeadAttack;                          // 0x10(0x4)
	float                                                        MinPlayRateScale;                                  // 0x14(0x4)
	float                                                        MaxPlayRateScale;                                  // 0x18(0x4)
	float                                                        PanicDespawnShipRangeRadius;                       // 0x1c(0x4)
	float                                                        PanicDespawnWatercraftRangeRadius;                 // 0x20(0x4)
	float                                                        PanicDespawnAnimationPlayRateScale;                // 0x24(0x4)
	float                                                        PreDeathAnimationPlayRateScale;                    // 0x28(0x4)
	float                                                        AttackSubmergedZOffset;                            // 0x2c(0x4)
	float                                                        DamageRequiredToCancelAttack;                      // 0x30(0x4)
	char                                                         pad0x4_0PX7U[0x4];                                 // 0x34(0x4)
};


// Size 0x18
struct TinyKrakenBehaviourParams
{
public:
	char                                                         Type;                                              // 0x0(0x1)
	char                                                         pad0x7_CJWOD[0x7];                                 // 0x1(0x7)
	class TinyKrakenRoarShockwaveBehaviourParamsDataAsset*       RoarShockwaveParams;                               // 0x8(0x8)
	class TinyKrakenShipBitingBehaviourParamsDataAsset*          FuryOfTheSeaParams;                                // 0x10(0x8)
};


// Size 0x20
struct TinyKrakenBiteAttackShipData
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	int                                                          MinHullDamageHoles;                                // 0x8(0x4)
	int                                                          MaxHullDamageHoles;                                // 0xc(0x4)
	float                                                        RollImpulseForce;                                  // 0x10(0x4)
	struct Vector                                                RollImpulseLocation;                               // 0x14(0xc)
};


// Size 0x8
struct TinyKrakenHeadWeightedBehaviour
{
public:
	int                                                          Weight;                                            // 0x0(0x4)
	char                                                         BehaviourType;                                     // 0x4(0x1)
	char                                                         pad0x3_I8EY5[0x3];                                 // 0x5(0x3)
};


// Size 0x58
struct TinyKrakenRoarShockwaveBehaviourParams
{
public:
	char                                                         pad0x38_IHJR6[0x38];                               // 0x0(0x38)
	float                                                        RoarRadialAngle;                                   // 0x38(0x4)
	float                                                        RoarDuration;                                      // 0x3c(0x4)
	float                                                        RoarHeadRotationAngle;                             // 0x40(0x4)
	float                                                        RoarHeadRotationSpeed;                             // 0x44(0x4)
	float                                                        RoarBuildUpTime;                                   // 0x48(0x4)
	float                                                        RoarCooldownTime;                                  // 0x4c(0x4)
	float                                                        PlayerKnockbackCooldown;                           // 0x50(0x4)
	float                                                        ShipDamageCooldown;                                // 0x54(0x4)
};


// Size 0x30
struct TinyKrakenHeadParams
{
public:
	class EnvQuery*                                              SpawningQueryTemplate;                             // 0x0(0x8)
	class UClass*                                                HeadClass;                                         // 0x8(0x8)
	TArray<struct TinyKrakenHeadWeightedBehaviour>               ShipInteractingBehaviourWeights;                   // 0x10(0x10)
	TArray<struct TinyKrakenBehaviourParams>                     Behaviours;                                        // 0x20(0x10)
};


// Size 0xe8
struct TinyKrakenShipBitingBehaviourParams
{
public:
	char                                                         pad0x38_B8LLB[0x38];                               // 0x0(0x38)
	float                                                        AttackTimeout;                                     // 0x38(0x4)
	float                                                        BiteRange;                                         // 0x3c(0x4)
	class UClass*                                                DamageCauserType;                                  // 0x40(0x8)
	char                                                         HealthChangedReason;                               // 0x48(0x1)
	char                                                         pad0x3_1L14N[0x3];                                 // 0x49(0x3)
	float                                                        PlayerBiteRadius;                                  // 0x4c(0x4)
	float                                                        PlayerBiteDamage;                                  // 0x50(0x4)
	char                                                         pad0x4_Z7SLZ[0x4];                                 // 0x54(0x4)
	struct Status                                                PlayerStatusEffectToApply;                         // 0x58(0x20)
	struct KnockBackInfo                                         PlayerKnockbackParams;                             // 0x78(0x54)
	int                                                          HullDamageLevel;                                   // 0xcc(0x4)
	TArray<struct TinyKrakenBiteAttackShipData>                  ShipBiteAttackData;                                // 0xd0(0x10)
	char                                                         CollisionChannelForGunpowderKegs;                  // 0xe0(0x1)
	char                                                         pad0x7_145M2[0x7];                                 // 0xe1(0x7)
};


