#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x10
struct TinyKrakenEventCreatedTelemetryEvent
{
public:
	struct Guid                                                  EventId;                                           // 0x0(0x10)
};


// Size 0x1
struct TinyKrakenBattleProgressionDamageDealtParams
{
public:
	char                                                         pad0x1_ESPGJ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct TinyKrakenBattleProgressionTentaclesDestroyedParams
{
public:
	char                                                         pad0x1_TNW3A[0x1];                                 // 0x0(0x1)
};


// Size 0x48
struct EventTinyKrakenHeadHealthChanged
{
public:
	struct EventHealthChanged                                    HealthChangedEvent;                                // 0x0(0x48)
};


// Size 0x1
struct TinyKrakenBattleProgressionKrakenKilledParams
{
public:
	char                                                         pad0x1_XFRNJ[0x1];                                 // 0x0(0x1)
};


// Size 0x88
struct TinyKrakenHeadIdleBehaviourParams
{
public:
	char                                                         pad0x88_BQ19N[0x88];                               // 0x0(0x88)
};


// Size 0x1
struct TinyKrakenRoarShockwaveBehaviourParams
{
public:
	char                                                         pad0x1_2QFGD[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct TinyKrakenEventCompletedTelemetryEvent
{
public:
	struct Guid                                                  EventId;                                           // 0x0(0x10)
};


// Size 0x1
struct TinyKrakenHeadParams
{
public:
	char                                                         pad0x1_LJJGM[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventTinyKrakenHeadTakenDamage
{
public:
	char                                                         pad0x1_LRADZ[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventTinyKrakenHeadKilled
{
public:
	char                                                         pad0x1_XTWKS[0x1];                                 // 0x0(0x1)
};


// Size 0x88
struct TinyKrakenHeadBehaviourParams
{
public:
	class EnvQuery*                                              SpawningQueryTemplate;                             // 0x0(0x8)
	class UClass*                                                HeadClass;                                         // 0x8(0x8)
	float                                                        MinPlayRateScale;                                  // 0x10(0x4)
	float                                                        MaxPlayRateScale;                                  // 0x14(0x4)
	float                                                        PanicDespawnShipRangeRadius;                       // 0x18(0x4)
	float                                                        PanicDespawnWatercraftRangeRadius;                 // 0x1c(0x4)
	float                                                        PanicDespawnAnimationPlayRateScale;                // 0x20(0x4)
	float                                                        PreDeathAnimationPlayRateScale;                    // 0x24(0x4)
	struct WeightedProbabilityRangeOfRanges                      TimeToSpendInInactiveState;                        // 0x28(0x30)
	struct WeightedProbabilityRangeOfRanges                      TimeToSpendInActiveState;                          // 0x58(0x30)
};


// Size 0x178
struct TinyKrakenBattlePhaseParams
{
public:
	bool                                                         TentaclesActiveInPhase;                            // 0x0(0x1)
	bool                                                         HeadActiveInPhase;                                 // 0x1(0x1)
	char                                                         pad0x6_CH2BK[0x6];                                 // 0x2(0x6)
	struct KrakenParams                                          KrakenParams;                                      // 0x8(0x160)
	struct TinyKrakenHeadParams                                  KrakenHeadParams;                                  // 0x168(0x1)
	bool                                                         ShouldFailPhaseAfterTimer;                         // 0x169(0x1)
	char                                                         pad0x2_BHFVB[0x2];                                 // 0x16a(0x2)
	float                                                        TimeBeforeReturnToPreviousPhase;                   // 0x16c(0x4)
	char                                                         PhaseProgressionCriteria;                          // 0x170(0x1)
	struct TinyKrakenBattleProgressionDamageDealtParams          DamageDealtProgressionParams;                      // 0x171(0x1)
	struct TinyKrakenBattleProgressionTentaclesDestroyedParams   TentaclesDestroyedProgressionParams;               // 0x172(0x1)
	struct TinyKrakenBattleProgressionKrakenKilledParams         KrakenKilledProgressionParams;                     // 0x173(0x1)
	char                                                         pad0x4_CTKLQ[0x4];                                 // 0x174(0x4)
};


