#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "TinyKraken_Structs.h"


// Size 0x150 (Full Size[0x4f0] - InheritedSize[0x3a0]
class TinyKrakenEventService: public Actor
{
public:
	char                                                         pad0x40_G1TOI[0x40];                               // 0x3a0(0x40)
	class TinyKrakenEventServiceParams*                          TinyKrakenServiceParams;                           // 0x3e0(0x8)
	char                                                         pad0xf0_K4R7G[0xf0];                               // 0x3e8(0xf0)
	class TinyKraken*                                            TinyKraken;                                        // 0x4d8(0x8)
	char                                                         pad0x10_BU7QD[0x10];                               // 0x4e0(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SandboxPerformanceConstraintActivity_TinyKraken: public SandboxPerformanceConstraintActivityType
{
public:
};


// Size 0x40 (Full Size[0x960] - InheritedSize[0x920]
class TinyKraken: public Kraken
{
public:
	class TinyKrakenHead*                                        SpawnedHead;                                       // 0x918(0x8)
	class UClass*                                                HeadType;                                          // 0x920(0x8)
	char                                                         pad0x8_JKFOF[0x8];                                 // 0x928(0x8)
	struct Transform                                             HeadSpawnTransform;                                // 0x930(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TinyKrakenEventServiceInterface: public Interface
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class TinyKrakenEventServiceParams: public DataAsset
{
public:
	class EnvQuery*                                              TinyKrakenSpawnLocationEQSQuery;                   // 0x28(0x8)
	class GameEventBannerDataAsset*                              TinyKrakenApproachedBanner;                        // 0x30(0x8)
	class GameEventBannerDataAsset*                              TinyKrakenDefeatedBanner;                          // 0x38(0x8)
	class UClass*                                                TentacleType;                                      // 0x40(0x8)
	class UClass*                                                TinyKrakenType;                                    // 0x48(0x8)
	class KrakenParamsDataAsset*                                 TinyKrakenParams;                                  // 0x50(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class BattlePhaseProgressionTrackerBase: public Object
{
public:
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class TinyKrakenMultiPhaseEventDataAsset: public DataAsset
{
public:
	TArray<struct TinyKrakenBattlePhaseParams>                   TinyKrakenBattlePhaseParamsList;                   // 0x28(0x10)
};


// Size 0x160 (Full Size[0x500] - InheritedSize[0x3a0]
class TinyKrakenHead: public Actor
{
public:
	char                                                         pad0x28_1OZPJ[0x28];                               // 0x3a0(0x28)
	class SceneComponent*                                        Root;                                              // 0x3c8(0x8)
	class SkeletalMeshComponent*                                 SkeletalMesh;                                      // 0x3d0(0x8)
	class HealthComponent*                                       HealthComponent;                                   // 0x3d8(0x8)
	class ActorDamageableComponent*                              DamageableComponent;                               // 0x3e0(0x8)
	class SphereComponent*                                       SphereComponent;                                   // 0x3e8(0x8)
	class KrakenHeadAnimationInstance*                           HeadAnimInstance;                                  // 0x3f0(0x8)
	char                                                         pad0x108_GRGPV[0x108];                             // 0x3f8(0x108)
};


// Size 0x58 (Full Size[0x80] - InheritedSize[0x28]
class BattlePhaseProgressionTrackerKrakenKilled: public BattlePhaseProgressionTrackerBase
{
public:
	char                                                         pad0x58_2LI0W[0x58];                               // 0x28(0x58)
};


// Size 0xc0 (Full Size[0xe8] - InheritedSize[0x28]
class BattlePhaseProgressionTrackerDamage: public BattlePhaseProgressionTrackerBase
{
public:
	float                                                        DamageRequiredToProgress;                          // 0x28(0x4)
	char                                                         pad0xbc_MDN99[0xbc];                               // 0x2c(0xbc)
};


// Size 0x68 (Full Size[0x90] - InheritedSize[0x28]
class BattlePhaseProgressionTrackerTentaclesDestroyed: public BattlePhaseProgressionTrackerBase
{
public:
	char                                                         pad0x68_3T104[0x68];                               // 0x28(0x68)
};


